{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uowoi5",
            "title": "#BitcoinHydraThesis the end game",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uowoi5/bitcoinhydrathesis_the_end_game/",
            "author": "MGTOW_and_Bitcoin",
            "created_utc": 1652462458.0,
            "score": 3,
            "num_comments": 14,
            "subreddit": "Bitcoin",
            "selftext": "Only 1/19430 of these Blockchain projects are going to survive: Bitcoin... and that's because all possible Innovation throughout all of these all the altcoins has been built already on top of Bitcoin as a second layer, third layer or sidechain... consistant with the #BitcoinHydraThesis",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uo1o0k",
            "title": "Sell-off fear?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uo1o0k/selloff_fear/",
            "author": "PoensieWeit",
            "created_utc": 1652363747.0,
            "score": 4,
            "num_comments": 1,
            "subreddit": "Bitcoin",
            "selftext": "Sell-off-fear? Do not forget that this is a race to acquire as much Bitcoin as you can…   More than 90 percent of Bitcoin has already been mined.   With Bitcoin price dropping, hodlers continue to eat up only a bigger percentage of an asset that has a finite supply. It is similar to a company repurchasing its shares at discount prices. Holders buying now, during a crash, acquire triple the amount of btc than during the all time high period. Once put away in cold storage, it s off the market.   \n\nIf btc-price drops, more Bitcoin gets bought up for an equal amount of fiat money. That same money is being printed every day, so fiat supply is unlimited.   Don’t let a sell-off scare you; the fundamental reasons why you’re in Bitcoin are still intact.",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uo0mpw",
            "title": "I am pretty sure institutional players are waiting on the sidelines to scoop up some BTC for themselves.",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uo0mpw/i_am_pretty_sure_institutional_players_are/",
            "author": "sgtslaughterTV",
            "created_utc": 1652360738.0,
            "score": 3,
            "num_comments": 12,
            "subreddit": "Bitcoin",
            "selftext": "Title.\n\nThey've had plenty of time and Michael Saylor's bitcoin for business lecture was given in February of 2021. No time like the present.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8baupw",
                    "author": "dlq84",
                    "score": 3,
                    "created_utc": 1652360960.0,
                    "response": "Indeed, whales feast on paper hands' coins.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "unia2u",
            "title": "United Kingdom All-set to Introduce Crypto Framework For Safer Adoption",
            "url": "https://thenewscrypto.com/united-kingdom-all-set-to-introduce-crypto-framework-for-safer-adoption/",
            "author": "Loud_Dingo7261",
            "created_utc": 1652298542.0,
            "score": 3,
            "num_comments": 2,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i88khad",
                    "author": "Nada_Lives",
                    "score": 3,
                    "created_utc": 1652304387.0,
                    "response": "*As the embryonic asset class has become more popular, market watchdogs like the Financial Conduct Authority (FCA) have imposed a slew of rules, including a ban on numerous cryptocurrency exchanges, including Binance.*\n\nI feel safer already.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uo1yut",
            "title": "Don’t sell don’t panic",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uo1yut/dont_sell_dont_panic/",
            "author": "luckystar865",
            "created_utc": 1652364598.0,
            "score": 3,
            "num_comments": 17,
            "subreddit": "Bitcoin",
            "selftext": "This will all pass patience is the key my friends. It’s not about what you’re losing right now the whole market is taking a dump. The best thing you can do is average down and buy more stocks or more coins you’re only at a loss if you sell and this is what they want. Put your money in but don’t buy until it hit a lower price or just buy little by little $25 at a time for a coin it’ll all average it self out and the market will eventually correct it’s self. When you panic sell you’re the one becoming poorer do what the rich do hold and sell at the top don’t sell at the bottom. You’re losing your hard earned dollars and that’s what they want. This is the perfect opportunity to buy right now and get in. Go for a run work out do something beside obsess over your losses. If you can’t stomach it you shouldn’t be in the market. This is what investing is about holding when you don’t want too cause the price is down. I know many people who are at retirement age and they’re just going to leave their money alone until it recovers and it always recovers. Just buy more little by little you’ll thank me later and everyone else who has said the same thing.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8bn2ju",
                    "author": "hepazepie",
                    "score": 6,
                    "created_utc": 1652366199.0,
                    "response": "Sell? I'll buy more! It's discount season!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8bosov",
                    "author": "shawnewoods",
                    "score": 3,
                    "created_utc": 1652366877.0,
                    "response": "just bought another 2k worth, hodl.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "unraa1",
            "title": "Buffet sold out already, but making voice of negativity in Bitcoin / Cryptocurrencies just year/week ago !",
            "url": "https://www.reddit.com/r/PokketOfficial/comments/suhro8/so_not_rat_poison_squared_anymore_huh_warren/?utm_medium=android_app&utm_source=share",
            "author": "cyberwargame",
            "created_utc": 1652324951.0,
            "score": 4,
            "num_comments": 2,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uovg94",
            "title": "7 common misconceptions about how bitcoin mining helps cutting methane emissions (methane has 84x the warming effect of CO2)",
            "url": "https://twitter.com/DSBatten/status/1524566067817107456",
            "author": "polloponzi",
            "created_utc": 1652458963.0,
            "score": 3,
            "num_comments": 0,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "upgmwu",
            "title": "Book About Bitcoin?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/upgmwu/book_about_bitcoin/",
            "author": "gcthorpe",
            "created_utc": 1652532774.0,
            "score": 14,
            "num_comments": 23,
            "subreddit": "Bitcoin",
            "selftext": "Hey everyone, long time lurker… \n\nI’ve been trying to orange pill my girlfriend and her birthday is fast approaching. I’d like one of her gifts to be a book about Bitcoin, but I’m looking for a book that can be easily understood from someone who’s new to the ecosystem and has very little understanding. I’d figured some of y’all would have a good idea or two?\n\nThanks for the help!\n\nEdit: Just for the record, the book will be in addition to two other gifts she’ll be getting. This will be more of an add-on gift.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8kl62v",
                    "author": "ContraianD",
                    "score": 25,
                    "created_utc": 1652532831.0,
                    "response": "The Bitcoin Standard",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8komon",
                            "author": "usernamewastaken5",
                            "score": 9,
                            "created_utc": 1652534793.0,
                            "response": "^ this \n\nBut also buy something sweet like a necklace or some flowers, she might be expecting something along those lines from her partner",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8kphuy",
                                    "author": "Lbkelp",
                                    "score": 3,
                                    "created_utc": 1652535256.0,
                                    "response": "Yes. I would just buy the book as an additional gift to something else. Maybe shes not interested or finds it boring and then it would suck.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8knx9r",
                    "author": "reclamerommelenzo",
                    "score": 9,
                    "created_utc": 1652534409.0,
                    "response": "Definitely The Bitcoin Standard. \n\nNot only good for learning about Bitcoin, but also the concept and history of money. That's an essential part to understanding the value of Bitcoin.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ksbkb",
                    "author": "AvengedTurtleFold",
                    "score": 3,
                    "created_utc": 1652536719.0,
                    "response": "Gift books that you want others to read on your own birthday since their reading it is what you want, not necessarily what they want. You should focus on what would bring your girlfriend joy on her birthday when you choose a gift. If she hasn't explicitly expressed an interest in wanting to learn more about Bitcoin, don't get her a book on Bitcoin. \n\nBetter yet, ask her if she wants something like that and talk about it.\n\nThis applies to any other subject really. Replace \"Bitcoin\" with any other thing you don't really know or care about and consider whether you'd want to be gifted a book on that subject on your birthday.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8kn6ys",
                    "author": "cableguy_21",
                    "score": 5,
                    "created_utc": 1652534003.0,
                    "response": "Buying somebody a book that they never asked for is always risky and may be a waste. Explainer YouTube videos may be better and cheaper. Then maybe send her crypto to play with after.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "upgpzc",
            "title": "Coinbase bankruptcy and funds",
            "url": "https://www.reddit.com/r/Bitcoin/comments/upgpzc/coinbase_bankruptcy_and_funds/",
            "author": "LordMinax",
            "created_utc": 1652533068.0,
            "score": 8,
            "num_comments": 99,
            "subreddit": "Bitcoin",
            "selftext": "I heard that if Coinbase goes bankrupt, people may lose their funds on the exchange. Is that true?",
            "stickied": false,
            "comments": [
                {
                    "id": "i8ks4tj",
                    "author": "Atreyu_n_Falcor_BFF",
                    "score": 34,
                    "created_utc": 1652536625.0,
                    "response": "They are not going bankrupt. They have massive backing by big institutional players.  If it really came down to it, someone would buy them out.\n\nNow that being said, get your coins into a hard wallet and off exchanges. I moved the remainder off coinbase yesterday. Smooth transactions and no issues to report",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8ledxd",
                            "author": "CARadders",
                            "score": 5,
                            "created_utc": 1652546982.0,
                            "response": "Would the Coinbase wallet be affected? I mean I have the keys so I’m all good right?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8lg7wi",
                                    "author": "IanMichael001",
                                    "score": 5,
                                    "created_utc": 1652547818.0,
                                    "response": "You have the keys so it’s safe",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8kmy7g",
                    "author": "Sealobo",
                    "score": 52,
                    "created_utc": 1652533865.0,
                    "response": "Fake news. It's a risk disclosure in their latest quarterly as required by the SEC. It's been taken out of context.\n\nCoinbase is the most secure and transparent bitcoin (crypto) exchange out there. They're public, meaning they're also under tight surveillance by all the relevant agencies and commissions of the government. If you HAVE to store your bitcoin on an exchange, Coinbase is bar-none in terms of safety.\n\nHaving said that, if you're not an active trader, the best strategy is still self-custody.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8l8m1e",
                            "author": "Kingfisher_ybw",
                            "score": 9,
                            "created_utc": 1652544416.0,
                            "response": "It’s risk disclosure. Which means that IF Coinbase goes bankrupt, your money is gone. \n\nPeople act shocked, but that’s a rather obvious fact.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8kroxw",
                            "author": "Stoopiddogface",
                            "score": 9,
                            "created_utc": 1652536400.0,
                            "response": "Yea, this \"warning\" that they issued, was none of that.\n\nIt was disclosed in a bunch of paperwork that says if they go bankrupt your assets would go under with them... Its no different than any others id bet.\n\nEasy fix, move them off the CEX",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8klskz",
                    "author": "Informal-Act1282",
                    "score": 19,
                    "created_utc": 1652533199.0,
                    "response": "Its true, also your post might get deleted, mine got when i made an discussion.\nCeo said l funds are property of coinbase in case of bankruptcy",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8kmo48",
                            "author": "LordMinax",
                            "score": 9,
                            "created_utc": 1652533702.0,
                            "response": "That’s f@cked up.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8knpik",
                                    "author": "Fluffy_Total_1899",
                                    "score": 18,
                                    "created_utc": 1652534291.0,
                                    "response": "Not really, just the way it works. Not your key, not your coins. Need to move them off CEX.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8kww72",
                                            "author": "leeljay",
                                            "score": 5,
                                            "created_utc": 1652538980.0,
                                            "response": "Read this the other day and started moving mine off CB that night, did 3 transactions, all 3 progressively larger than the last, no problem. The next morning, tried to move a larger amount, and the transaction got flagged for suspicious activity and postponed for 3 days. Emailed them and got a response made up entirely of copy pasted information from their “Help” page. Coinbase won’t get anymore of my business after I’ve moved everything off it. I’ll print my tax paperwork and then I’ll start using Kraken or something to buy.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8l24h5",
                                                    "author": "LilBlueFire",
                                                    "score": 3,
                                                    "created_utc": 1652541466.0,
                                                    "response": "I'm moving my sats off in batches too and despite the amount being small in my head I'm like 'mwahaha let's see you cough up this amount of btc, Coinbase'",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i8kro89",
                                            "author": "sonicode",
                                            "score": 6,
                                            "created_utc": 1652536390.0,
                                            "response": "People act surprised when they hear NYKNYC, but seriously it has been posted on /r/bitcoin 100 times a day ever since Mt Gox and there are tons of youtube videos explaining exactly why this is the case (exchanges are just banks, you lend them your coins so that gives them posession) and how to protect yourself from it (get a fucking hardware wallet and get your damned coins off the exchanges plebs)  \n\n\nWho buys something valuable and then just leaves it there at the store in case they want to sell it back in a few months/years?",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i8lbtn6",
                                    "author": "Sabertoothkittens",
                                    "score": 3,
                                    "created_utc": 1652545846.0,
                                    "response": "news flash Bitcoin isn't FDIC insured?! insert shocked Pikachu face.\n\nthat's the deal with literally every CEX \"not your keys not your coins\" is not hyperbole. The bright side is that Coinbase made over $4 billion in profit last year has $7 billion in cash and has tripled their number of employees in the last year. I would be more concerned about Robinhood who lost $3.6 billion in the last year and recently laid off 10% of their work force",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8klvjt",
                    "author": "oachkatzalschwoaf",
                    "score": 7,
                    "created_utc": 1652533245.0,
                    "response": "Not you keys not your money.\n\nCrypto on exchanges cant be Safu.\nAll your coins might get lost on any exchanges Bankruptcy.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8kmfnk",
                    "author": "RakDizzle",
                    "score": 7,
                    "created_utc": 1652533565.0,
                    "response": "I’m still going to use them. 256 Billion in assets (the ones they had to report) + decent operating costs. Don’t see them in a bankruptcy court anytime soon…",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ko3k9",
                    "author": "Amoci",
                    "score": 3,
                    "created_utc": 1652534505.0,
                    "response": "[https://www.youtube.com/watch?v=1zcoaKP2ieg](https://www.youtube.com/watch?v=1zcoaKP2ieg)\n\n5 minutes of dodging, but basically, yes.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8kx54s",
                    "author": "Impressive_Ruin2775",
                    "score": 3,
                    "created_utc": 1652539099.0,
                    "response": "Yes, when a company goes bankrupt, people lose their funds. Economics 101.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uphkop",
            "title": "Bitcoiners evolves eventually",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uphkop/bitcoiners_evolves_eventually/",
            "author": "givethought",
            "created_utc": 1652535899.0,
            "score": 146,
            "num_comments": 30,
            "subreddit": "Bitcoin",
            "selftext": "&#x200B;\n\nhttps://preview.redd.it/8i7g7cw44gz81.jpg?width=500&format=pjpg&auto=webp&s=c2a869c258a767f6d75932b9e7f1c045fb72f3d5",
            "stickied": false,
            "comments": [
                {
                    "id": "i8ktf35",
                    "author": "Bedroom-Eastern",
                    "score": 75,
                    "created_utc": 1652537268.0,
                    "response": "In god we trust - dollar note\n\nProof of work - bitcoin",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8lkx79",
                            "author": "Hefty_Jicama",
                            "score": 7,
                            "created_utc": 1652549970.0,
                            "response": "We’re all Satoshi",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8m1l9k",
                                    "author": "noddingacquaintance",
                                    "score": 11,
                                    "created_utc": 1652557656.0,
                                    "response": "What if satoshi is the friends we made along the way?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8m66tl",
                                            "author": "Into-the-Beyond",
                                            "score": 4,
                                            "created_utc": 1652559777.0,
                                            "response": "You’re saying they’re all dead and didn’t leave me the keys to their wallets?",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8mb8wy",
                            "author": "immersive-matthew",
                            "score": 6,
                            "created_utc": 1652562117.0,
                            "response": "In decentralization we trust",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8m6fqd",
                            "author": "Antoni8024",
                            "score": 4,
                            "created_utc": 1652559889.0,
                            "response": "In code we trust",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8l7vo3",
                    "author": "PerformanceVarious45",
                    "score": 10,
                    "created_utc": 1652544087.0,
                    "response": "Since 1913 my friend",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8lite7",
                            "author": "givethought",
                            "score": 5,
                            "created_utc": 1652549003.0,
                            "response": "yeah, I was thinking that. I just wanted to direct people to the year, because so much has declined specifically since 1971",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8ksoxw",
                    "author": "Novel-Counter-8093",
                    "score": 18,
                    "created_utc": 1652536905.0,
                    "response": "thats crazy bro. ever smoke DMT after buying BTC?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8kwkc7",
                            "author": "leeljay",
                            "score": 17,
                            "created_utc": 1652538821.0,
                            "response": "Dimethyltryptacoin",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8kwzui",
                                    "author": "Novel-Counter-8093",
                                    "score": 4,
                                    "created_utc": 1652539027.0,
                                    "response": "now that sounds like an awesome name for a shitcoin",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8kx9bx",
                                            "author": "leeljay",
                                            "score": 3,
                                            "created_utc": 1652539156.0,
                                            "response": "🤔 hmmm",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8le4oo",
                            "author": "BTCMachineElf",
                            "score": 5,
                            "created_utc": 1652546869.0,
                            "response": "If you do, you might meet me.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8l0qx0",
                            "author": "NYKNYb",
                            "score": 6,
                            "created_utc": 1652540816.0,
                            "response": "Weed & Bitcoin meditation goes well together.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8m3rge",
                    "author": "mediablitz91",
                    "score": 7,
                    "created_utc": 1652558666.0,
                    "response": "Been in this since 2017 doesn’t even bother me anymore watching it drop 40% in a week I’ve seen this go up just as fast. It’s how crypto works",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8mkyy2",
                            "author": "DigitaleDukaten",
                            "score": 3,
                            "created_utc": 1652566630.0,
                            "response": "Its how bitcoin works*\n\nNot so sure about (some) alts, but 99% sure about bitcoin.\n\nThat last 1% though,... always scary.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8krs6n",
                    "author": "Hot_Necessary_2618",
                    "score": 3,
                    "created_utc": 1652536446.0,
                    "response": "Love it",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "upgc2v",
            "title": "Michael Saylor Just Called Cathie Wood's $1M Bitcoin By 2030 Prediction \"Conservative\" (short audio clip)",
            "url": "https://podclips.com/c/ndutb6?ss=r&ss2=bitcoin&d=2022-05-14",
            "author": "PodClips",
            "created_utc": 1652531704.0,
            "score": 52,
            "num_comments": 24,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8lc59y",
                    "author": "truthseeking_missel",
                    "score": 20,
                    "created_utc": 1652545990.0,
                    "response": "McAfee's ghost rises again",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8kvb9i",
                    "author": "Inca30",
                    "score": 15,
                    "created_utc": 1652538208.0,
                    "response": "Could be, who knows - but let's hope so. However, the next few months could be choppy for bitcoin - and terminal for many altcoins. This week may turn out to have been just Round 1 of a big shakeout. Bitcoin will come through but I suspect a lot of second-tier coins will now begin a gradual fade against bitcoin. Bear markets usually herald a flight to quality and that means money into bitcoin that would hitherto have gone into coins we don't name in polite company.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8m6u1x",
                    "author": "mikesevnteen",
                    "score": 3,
                    "created_utc": 1652560070.0,
                    "response": "It won't be long to wait, and then it will become clear whether she was conservative?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8o1oxt",
                    "author": "no-intrinsic-value",
                    "score": 3,
                    "created_utc": 1652595896.0,
                    "response": "I’m extremely bullish on BTC long term, but Saylor annoys me.  His moonboi vibe with mainstream media makes many no coiners think BTC is hype driven BS.  \n\nBTC ain’t NFTs.  We don’t need evangelists.  It speaks for itself at this point.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8mo10r",
                    "author": "Dry-Cardiologist2187",
                    "score": 5,
                    "created_utc": 1652568061.0,
                    "response": "$100M by 2025. That's my conservative estimate.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8m64a1",
                    "author": "Downtown-Ad-4117",
                    "score": 3,
                    "created_utc": 1652559744.0,
                    "response": "Whatever happens, it won't be what majority plebs believe now.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8mp0vb",
                    "author": "glasswiper69",
                    "score": 3,
                    "created_utc": 1652568533.0,
                    "response": "heh.. dollar just keeps losing value, it's probably gonna be even more",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "up8m4x",
            "title": "Bitcoin wedding ring?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/up8m4x/bitcoin_wedding_ring/",
            "author": "eOg5Khe",
            "created_utc": 1652499388.0,
            "score": 3,
            "num_comments": 10,
            "subreddit": "Bitcoin",
            "selftext": "I propose with one Bitcoin?",
            "stickied": false,
            "comments": [
                {
                    "id": "i8jdtv6",
                    "author": "Big_Swede89",
                    "score": 10,
                    "created_utc": 1652500055.0,
                    "response": "She'll say no. You'll still have 1 BTC. Win/Win",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uphohu",
            "title": "Did the IMF crash Bitcoin to make El Salvador look bad?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uphohu/did_the_imf_crash_bitcoin_to_make_el_salvador/",
            "author": "CryptoDApper",
            "created_utc": 1652536254.0,
            "score": 71,
            "num_comments": 260,
            "subreddit": "Bitcoin",
            "selftext": "A bit of a conspiracy theory for those interested. Today news articles started to pop up from multiple supposedly unconnected media - their message was uncanningly similar though; El Salvador has lost so much money on Bitcoin that they can’t pay back their due IMF loans. In fact, the loan payment they will forfeit is almost exactly the amount they’ve invested in Bitcoin - well isn’t that a big coincident.. It all just seems too convenient as if it’s all part of a plan to make El Salvador look bad and to discurage other rogue states to break free from the IMF monetary prison system.\n\nhttps://www.bloomberg.com/news/articles/2022-05-12/el-salvador-s-bitcoin-losses-are-as-big-as-its-next-bond-payment\n\nhttps://www.bloomberg.com/news/articles/2022-05-10/el-salvador-s-bitcoin-losses-swell-to-28-as-bukele-buys-more\n\nhttps://e24-no.translate.goog/boers-og-finans/i/wOBPKn/el-salvador-trues-av-statskonkurs-etter-bitcoin-kjoep?_x_tr_sl=auto&_x_tr_tl=en&_x_tr_hl=no&_x_tr_pto=wapp",
            "stickied": false,
            "comments": [
                {
                    "id": "i8lbvdz",
                    "author": "KaiSosceles",
                    "score": 33,
                    "created_utc": 1652545868.0,
                    "response": "Did the IMF crash Bitcoin the last 9 times it dropped more than 50%?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8m6opr",
                            "author": "Scam_Destroyer",
                            "score": 8,
                            "created_utc": 1652560003.0,
                            "response": "No, i did. But i ran out of borrowed bitcoins and now im angry. :)",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8ksutj",
                    "author": "NiceDoctorBeam",
                    "score": 129,
                    "created_utc": 1652536988.0,
                    "response": "Tell us how the IMF could crash Bitcoin.  Convince us it is even possible.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8leb6r",
                            "author": "DisorientedPanda",
                            "score": 30,
                            "created_utc": 1652546948.0,
                            "response": "They rang the Bitcoin ceo and asked",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8mnmso",
                                    "author": "Smackolol",
                                    "score": 8,
                                    "created_utc": 1652567880.0,
                                    "response": "Good ol’ Bit Coinstein, he’s a shady fella.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8lsocc",
                                    "author": "CryptoDApper",
                                    "score": 2,
                                    "created_utc": 1652553498.0,
                                    "response": "Roger Ver?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8mmbie",
                                            "author": "BashCo",
                                            "score": 10,
                                            "created_utc": 1652567263.0,
                                            "response": "Roger got fired from Bitcoin like 6-7 years ago.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8mnjvr",
                                                    "author": "CryptoDApper",
                                                    "score": 5,
                                                    "created_utc": 1652567842.0,
                                                    "response": "Did he get the memo?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8mnna6",
                                                            "author": "BashCo",
                                                            "score": 6,
                                                            "created_utc": 1652567886.0,
                                                            "response": "We fixed the glitch.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8myo5z",
                                                                    "author": "BigSL600",
                                                                    "score": 3,
                                                                    "created_utc": 1652573131.0,
                                                                    "response": "Bought a red swingline just cus of that movie.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8ktg1n",
                            "author": "carpetedman",
                            "score": 34,
                            "created_utc": 1652537281.0,
                            "response": "I'm still stuck on the idea that El Salvador has a **mortgage** payment.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8ktw9o",
                                    "author": "learner77",
                                    "score": 22,
                                    "created_utc": 1652537507.0,
                                    "response": "It’s a REALLY big house ;)",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8m29b7",
                                    "author": "Financial_Chemist286",
                                    "score": 15,
                                    "created_utc": 1652557972.0,
                                    "response": "The USA is not a country, it’s a corporation.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8m3kdt",
                                            "author": "ThatOrdinaryJoe",
                                            "score": 4,
                                            "created_utc": 1652558577.0,
                                            "response": "USA Inc.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8m4i2n",
                                                    "author": "Financial_Chemist286",
                                                    "score": 10,
                                                    "created_utc": 1652559006.0,
                                                    "response": "And everyone with a social security number is a good little employee of said Inc. including allowing your corporate father to educate you and of course learn how to take it on the chin for being a good patriot using USD while it’s debased.  \n\nFederal Debt Slaves ;We’re all collateralized",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8m88zc",
                                                            "author": "Mojicana",
                                                            "score": 4,
                                                            "created_utc": 1652560733.0,
                                                            "response": "I am now the gold standard. They bet everything that I'll be paying taxes forever.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i8ku37q",
                                    "author": "CryptoDApper",
                                    "score": 7,
                                    "created_utc": 1652537605.0,
                                    "response": "Sorry about that, english is not my native language, fixed it now.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8lps84",
                                            "author": "superavg",
                                            "score": 1,
                                            "created_utc": 1652552168.0,
                                            "response": "Don’t be like half the other dimbasses in America and think everything has a conspiracy behind it.\n\nIt’s just the fucking market and we are small fish in a big fucking ocean.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8luhku",
                                                    "author": "deezx1010",
                                                    "score": 13,
                                                    "created_utc": 1652554326.0,
                                                    "response": "You don't think every other country is filled with conspiracy theories? This isn't an American ideal lol",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i8lry5y",
                                                    "author": "CryptoDApper",
                                                    "score": 10,
                                                    "created_utc": 1652553166.0,
                                                    "response": "What half is that? The half that believe Russia secretly made Hillary loose the Presidential Election, or the half that believe that Biden cheated in the Presidential Election against Trump?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8mfgvk",
                                                            "author": "CryptoDApper",
                                                            "score": 7,
                                                            "created_utc": 1652564061.0,
                                                            "response": "Crickets..",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8nsgbw",
                                                                    "author": "superavg",
                                                                    "score": 1,
                                                                    "created_utc": 1652589319.0,
                                                                    "response": "Neither of em. Don’t believe any of that bullshit it isn’t worth any of our amounts of time when we can’t impact any bit of whatever either of those rhetorics may have caused.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8l9wgo",
                            "author": "I-make-ada-spaghetti",
                            "score": 10,
                            "created_utc": 1652544996.0,
                            "response": "Easy.\n\n1. Convince Tether to mint them enough USDT to move the spot price during a period of low trading volume.\n2. Buy the dips.\n3. Offload accumulated Bitcoin at significant price levels when trading volume dies down.\n\nI don’t think this was done but it is possible.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8lpknv",
                                    "author": "KnightzEnd2",
                                    "score": 5,
                                    "created_utc": 1652552074.0,
                                    "response": "Thank you... it is insane how people think bitcoin is untouchable",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8luk98",
                                            "author": "generateduser29128",
                                            "score": 12,
                                            "created_utc": 1652554359.0,
                                            "response": "Bitcoin is untouchable, but price action and laws aren't.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8lv407",
                                                    "author": "KnightzEnd2",
                                                    "score": 3,
                                                    "created_utc": 1652554614.0,
                                                    "response": "Manipulation of price in grand ways is not bitcoin being untouchable. It may be virtually impossible to kill but it can damn sure be manipulated and touched.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8lvxoz",
                                                            "author": "generateduser29128",
                                                            "score": 4,
                                                            "created_utc": 1652554999.0,
                                                            "response": "They can put forth hostile legislations and manipulate the price for some time, but they can't change consensus rules or the underlying fundamentals. It has too much political support to outright ban at this point, so it's going to recover and increase adoption eventually.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8lwn3d",
                                                                    "author": "KnightzEnd2",
                                                                    "score": 5,
                                                                    "created_utc": 1652555328.0,
                                                                    "response": "Yes, but if this conspiracy theory is true they did not need to kill it. They simply wanted to delay it by making el salvador fail.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i8lgkju",
                                    "author": "DigitaleDukaten",
                                    "score": 4,
                                    "created_utc": 1652547977.0,
                                    "response": "This is like \"just buy the deepest dip and sell the tippitytop\"",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8lkk3f",
                                            "author": "sexyhoebot",
                                            "score": 8,
                                            "created_utc": 1652549800.0,
                                            "response": "no its like saying all you gotta do is bribe the right person at tether",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8m19kc",
                                                    "author": "DigitaleDukaten",
                                                    "score": 2,
                                                    "created_utc": 1652557503.0,
                                                    "response": "Im not sure if it would work like that. But who am I to judge, I barely know anything",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i8n3ohf",
                                            "author": "I-make-ada-spaghetti",
                                            "score": 1,
                                            "created_utc": 1652575666.0,
                                            "response": "No. It’s more like understand how much volume is needed to move the market in a particular direction and make those peaks.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i8m741h",
                                    "author": "yuckfoubitch",
                                    "score": 3,
                                    "created_utc": 1652560202.0,
                                    "response": "The IMF is not a prop firm or hedge fund. They wouldn’t take trading risk like this, ever",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8oai1l",
                                            "author": "I-make-ada-spaghetti",
                                            "score": 1,
                                            "created_utc": 1652603222.0,
                                            "response": "What if Tether had no option but to give them USDT. That’s a no risk trade.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i8m4nxc",
                                    "author": "snek-jazz",
                                    "score": 1,
                                    "created_utc": 1652559080.0,
                                    "response": "> Convince Tether to mint them enough USDT to move the spot price during a period of low trading volume.\n\nyeah, no one working for the IMF is doing this",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8n2xg0",
                                            "author": "I-make-ada-spaghetti",
                                            "score": 1,
                                            "created_utc": 1652575288.0,
                                            "response": "How do you know this?\n\nTether is a black box that outputs a counterfeit digital dollar which everyone treats like a real USD.\n\nAs long as USDT maintains its peg everyone assumes that any Bitcoin traded for USDT is worth the equivalent in USD.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i8o0eoo",
                                    "author": "WalksOnLego",
                                    "score": 1,
                                    "created_utc": 1652594889.0,
                                    "response": "Printing money, to buy bitcoin, is a terrible, long-term strategy for the IMF.\n\nSure, I see what you are saying, but *overall* that strategy would be enormously supporting bitcoin's trading value.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8oabxn",
                                            "author": "I-make-ada-spaghetti",
                                            "score": 1,
                                            "created_utc": 1652603077.0,
                                            "response": "Im not saying they are printing money. I’m saying why is it impossible for Tether to be coerced into minting more USDT out of thin air?\n\nSince the mechanism of how Tether maintains the USD peg of USDT is unknown what’s the harm in adding an extra few hundred million to the 78 billion USDT in existence?",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8m5t4u",
                            "author": "brohamsontheright",
                            "score": 3,
                            "created_utc": 1652559602.0,
                            "response": ">Tell us how the IMF could crash Bitcoin.  Convince us it is even possible.\n\nAre you serious? The IMF has unlimited access to capital... \n\n1. Buy lots of Bitcoin on the dips.. slowly, but steadily, over the course of many months, or years.\n2. When you're ready to \"crash\" the price -- sell it all, on the open market, in giant heaps to create fear.  Spread those dumps out over a few weeks if you really want to give it a bloody nose.\n3. This will create ENORMOUS fear, and the market will do the rest... \n4. If it looks like it's going to recover, start against from step 2.\n5. Repeat. Repeat. Repeat from step 1 until nobody believes in Bitcoin anymore -- or until you own every token not in long-term cold storage. (Mission accomplished, in either case).\n\nThis narrative that Bitcoin can't be manipulated is absolutely ABSURD. Given the small amount of float at any given time, \"crashing\" the price of Bitcoin, and keeping the price suppressed, could be done for as little as a few billion dollars. Chump change to the fed or the IMF.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8mh8gd",
                                    "author": "Dry-Cardiologist2187",
                                    "score": 3,
                                    "created_utc": 1652564879.0,
                                    "response": "So that's good for bitcoin if they bought the dip /s",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8mwt8g",
                                    "author": "seambizzle",
                                    "score": -1,
                                    "created_utc": 1652572204.0,
                                    "response": "but the thing is bitcoin can not be manipulated\n\n&#x200B;\n\nyou seem to just be referring to the value when it comes to bitcoin, which uneducated people seem to do.  But it's the network that  makes bitcoin truly valuable.  The bitcoin network is the most secure, decentralized, and global asset in the world.   Thats been running almost flawlessly with very minimal downtime since its existence.  As long as this is the case, El Salvador can not loose.  And by the way the USD is also still legal tender in El Salvador, so people are able to exchange bitcoin for USD for quick and  easy and free.\n\n&#x200B;\n\nBitcoin is much bigger than just the price.  People need to start understanding this.  Dive into the actual network it will blow your mind and you will realize that the price means very very little. Bitcoins security is top notch, it can not be changed, more coins can never be added, AND IT LITERALLY CAN NOT BE MANIPULATED\n\n&#x200B;\n\n&#x200B;\n\nPlus your arguments dont make any sense.  The fact that you used the word \"tokens\" to describe bitcoin tells me you dont know shit.  Its a trillion dollar asset, that's not easy to manipulate.  That time has passed for anyone to even think of doing this.  But by your logic if they buy that much bitcoin it has no choice but to increase in value. Thats the beauty with bitcoins de-inflationary monetary system.  And \"dumping\" them on the market wont affect the price as much as you think.  There will always be buyers (retail, companies, countries, institutions). People aren't just gonna \"stop believing in bitcoin\" because the price goes down.  That's just another tuesday for bitcoin bud, try another way to spread your FUD",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8n3gdg",
                                            "author": "squareOfTwo",
                                            "score": 0,
                                            "created_utc": 1652575550.0,
                                            "response": "There have to be people who watch [sheepl.tv](https://sheepl.tv) all day and consume and spread the FUD without understanding. It's more and more entertaining with each year.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8l5n1f",
                            "author": "protestersunited",
                            "score": -1,
                            "created_utc": 1652543074.0,
                            "response": "Do you know how a short attack works?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8l7ule",
                                    "author": "NiceDoctorBeam",
                                    "score": 3,
                                    "created_utc": 1652544074.0,
                                    "response": "Don't you?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8mc3yw",
                            "author": "Sea_Conversation2799",
                            "score": 1,
                            "created_utc": 1652562508.0,
                            "response": "They decide spending a couple billion buying over time to unload against the book at once crashing price in an attempt to discredit a potential threat to it's future profits of trillions if it maintains financial dominance over the world",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8mk49i",
                                    "author": "NiceDoctorBeam",
                                    "score": 2,
                                    "created_utc": 1652566225.0,
                                    "response": "This answer makes sense.  They could do that, in theory.  \n\nWhat about the KYC at the exchanges?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8nhu24",
                            "author": "bitcoinharambeee",
                            "score": 1,
                            "created_utc": 1652583086.0,
                            "response": "They asked market makers to short it on derivatives",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8o6lfg",
                            "author": "ChasTheGreat",
                            "score": 1,
                            "created_utc": 1652599890.0,
                            "response": "They print 20 billion dollars, get on Binance Futures on multiple accounts and go 10x short sale on bitcoin.  This could happen because of Binance fractional reserves, so they don't even have to own the bitcoin to lend it out for shorts.\n\nEdit:  The IMF doesn't print money, so they borrow it from their friends at the FED.  \nEdit2:  I'm not saying this is what happened.  I'm just answering \"Convince us it is even possible\"",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8lha4m",
                            "author": "Dog_Faced_Pony_",
                            "score": -6,
                            "created_utc": 1652548304.0,
                            "response": "Same way Citadel fucked over GME. \n\nBorrow and short.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8lvk5n",
                            "author": "ElonsAss",
                            "score": -1,
                            "created_utc": 1652554825.0,
                            "response": "Yep, that would be petty and also pretty impossible.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8mh3m8",
                            "author": "Dry-Cardiologist2187",
                            "score": -1,
                            "created_utc": 1652564816.0,
                            "response": "the IMF is highly invested in bitcoin of course! /s",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8lj9sz",
                    "author": "Engine_Light_On",
                    "score": 16,
                    "created_utc": 1652549213.0,
                    "response": "Omg how can people disregard FED rate increase and every tech stock plummeting and think it is just a conspiracy to bring BTC down?\n\n\n\nJeez, open any finance website and read. Don’t get all your information from your echo chamber",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8lgnkn",
                    "author": "Level_Willingness790",
                    "score": 25,
                    "created_utc": 1652548015.0,
                    "response": "No. The imf crashed netflix to make dave chapelle look bad.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8l3bv2",
                    "author": "zeycus",
                    "score": 35,
                    "created_utc": 1652542022.0,
                    "response": "Let's see. Using a search engine, El Salvador has a current debt of about 20,000,000,000 USD. Bukele claims to have bought 2,300 BTC. Worst case scenario, assume all was bought ATP, so the loss would be about 2300 \\* 30000 USD = 70,000,000 USD. I know it is less, but anyway. Are they saying that El Salvador is defaulting because of a loss of 70 million, whet your debt is 20,000 million? Seriously?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8lbq0r",
                            "author": "Earth2Andy",
                            "score": 8,
                            "created_utc": 1652545801.0,
                            "response": "There’s a specific $800M due in January, that  El Salvador borrowed 10yrs ago and has no way to pay it back.  That’s what they think they’ll default on.  \n\nSpending $150M on Bitcoin (buying it and rolling it out to your whole country) rather than trying to pay back some of your $800M in debt is not a great way to get people to lend you more money.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8lig1z",
                                    "author": "ElephantsAreHeavy",
                                    "score": -7,
                                    "created_utc": 1652548836.0,
                                    "response": "In January? 800M is just selling 3 BTC. Volatility (in btc) goes both ways, volatility in fiat only goes down.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8lscaz",
                                            "author": "eqleriq",
                                            "score": 2,
                                            "created_utc": 1652553350.0,
                                            "response": "M is million, not thousand, here. Either way, bitcoin was never at 800,000/3 or 800,000,000/3 so not sure about what you're saying. That in Jan 2023 it will be above $266,666 each?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8lutt8",
                                                    "author": "generateduser29128",
                                                    "score": 9,
                                                    "created_utc": 1652554481.0,
                                                    "response": "Maybe still hoping for 280k by Q12 of 2021",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8mfptp",
                                                            "author": "CryptoDApper",
                                                            "score": 1,
                                                            "created_utc": 1652564174.0,
                                                            "response": "Now that´s what I call patience :)",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "i8mhc5u",
                                                            "author": "Dry-Cardiologist2187",
                                                            "score": 1,
                                                            "created_utc": 1652564926.0,
                                                            "response": "LOL.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i8m5xhp",
                                                    "author": "ElephantsAreHeavy",
                                                    "score": 1,
                                                    "created_utc": 1652559655.0,
                                                    "response": "I was, indeed, making a joke about the potential upward volatility. Being 260 million a coin.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8lbqmq",
                            "author": "CryptoDApper",
                            "score": 3,
                            "created_utc": 1652545809.0,
                            "response": "I think they say that they will default on the currently due loan downpayment.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8m89h2",
                                    "author": "manhattanabe",
                                    "score": 1,
                                    "created_utc": 1652560739.0,
                                    "response": "They may default on the current due interest payment, but I doubt they were planning to use Bitcoin to make the payment anyway. They are keeping the Bitcoin for other purposes.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8n1i1y",
                            "author": "Character_Body_2810",
                            "score": 1,
                            "created_utc": 1652574579.0,
                            "response": "Thank you. Thank you for doing math. I hate nonsense like this. How is it not obvious to everyone.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8lnl5n",
                    "author": "Rokey76",
                    "score": 22,
                    "created_utc": 1652551180.0,
                    "response": "This is like thinking because Bill Gates said a pandemic would happen, and then it did, he must have created the virus.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8looal",
                            "author": "CryptoDApper",
                            "score": -16,
                            "created_utc": 1652551664.0,
                            "response": "He says a lot of things that suddenly happen and makes him even more richer and powerful..",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8mkcff",
                                    "author": "BitcoinUser263895",
                                    "score": 14,
                                    "created_utc": 1652566332.0,
                                    "response": "Yeah, go outside. Get away from the computer.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8nq2wi",
                                    "author": "Rokey76",
                                    "score": 2,
                                    "created_utc": 1652587843.0,
                                    "response": "Bill Gates has been giving away his money for 20 years. It is a full time job for him and his wife.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8l786j",
                    "author": "Shougee369",
                    "score": 18,
                    "created_utc": 1652543790.0,
                    "response": "if bitcoin can be “manipulated” to crash then it deserves to crash.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8m4o8z",
                            "author": "EntaronAdun",
                            "score": 5,
                            "created_utc": 1652559084.0,
                            "response": "The IMF sits on a shit ton of money, they can buy a shit ton of Bitcoin and then sell it all at once to create a crash.\n\nThe price of everything can be manipulated with enough power.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8mft2k",
                                    "author": "CryptoDApper",
                                    "score": 3,
                                    "created_utc": 1652564216.0,
                                    "response": "Preach!",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8n1uvc",
                                    "author": "Character_Body_2810",
                                    "score": 1,
                                    "created_utc": 1652574760.0,
                                    "response": "Yep but even that has its limits. They can’t do it forever",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8n23b2",
                                            "author": "EntaronAdun",
                                            "score": 1,
                                            "created_utc": 1652574876.0,
                                            "response": "They have a shit ton of money.\n\nOnly way they don't put a dent to the price is if bitcoin becomes way way way more bigger.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8n27cp",
                                                    "author": "Character_Body_2810",
                                                    "score": 3,
                                                    "created_utc": 1652574931.0,
                                                    "response": "Yep. They do. They can do a lot. But not enough to o derail bitcoin for more than a few months. To many other players In the game.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8n3vuu",
                                                            "author": "squareOfTwo",
                                                            "score": 3,
                                                            "created_utc": 1652575771.0,
                                                            "response": "some people don't understand game theory and assume that entities with money can bend all physical and mathematical rules to their way. this is not so.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8n3xv5",
                                                                    "author": "Character_Body_2810",
                                                                    "score": 1,
                                                                    "created_utc": 1652575799.0,
                                                                    "response": "Precisely my sentiment",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "i8n2z19",
                                                            "author": "EntaronAdun",
                                                            "score": 1,
                                                            "created_utc": 1652575310.0,
                                                            "response": "Their objective is to deter new buyers who didn't do some proper research when buying Bitcoin from staying.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8n338x",
                                                                    "author": "Character_Body_2810",
                                                                    "score": 1,
                                                                    "created_utc": 1652575369.0,
                                                                    "response": "I’m each cycle that’s 90% of the people who buy. The small percentage that get it will stick around. It is inevitable. Just a matter of time.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i8npx2s",
                                    "author": "Wsemenske",
                                    "score": 1,
                                    "created_utc": 1652587746.0,
                                    "response": "If they buy it all, the price goes up first...you can't just have the crash part and ignore the buying.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8ntfyg",
                                            "author": "EntaronAdun",
                                            "score": 1,
                                            "created_utc": 1652589939.0,
                                            "response": "I know, I mean I'm all in on Bitcoin.\n\nJust pointing out that for sure the IMF can be one of the reasons of the volatility of bitcoin.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i8oo1hh",
                                    "author": "I-make-ada-spaghetti",
                                    "score": 1,
                                    "created_utc": 1652614534.0,
                                    "response": "Weren’t the big mining companies suspected of doing this? Dumping a ton of BTC on the exchanges while having a large short position on the futures.\n\nSure they could have sold slowly but due to the high price at the time and the trading volumes a big sell with a short position was a better way to hedge.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8lh0zi",
                            "author": "L_Tryptophan",
                            "score": 9,
                            "created_utc": 1652548187.0,
                            "response": "a handful of rich assholes have enough money to easily crash ANY market hard and then allow retail to sell the bottom. It is unfortunate that the wealth inequality is so great, it can allow this to happen. \n\nIts doesn't deserve to crash",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8mhgdu",
                                    "author": "Dry-Cardiologist2187",
                                    "score": 2,
                                    "created_utc": 1652564981.0,
                                    "response": "Well what's the point of bitcoin if it is the same as FIAT? A handful of rich assholes control FIAT as well, are you telling me they also control bitcoin now?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8n40xf",
                                            "author": "squareOfTwo",
                                            "score": 0,
                                            "created_utc": 1652575842.0,
                                            "response": "it was never the same and Fiat, go read the definition of fiat money.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i8n1yj7",
                                    "author": "Character_Body_2810",
                                    "score": 2,
                                    "created_utc": 1652574810.0,
                                    "response": "That’s why bitcoin won’t be “stable” until it is 10-100X it’s current market cap. When nobody has enough money to move the market.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8n1sbw",
                            "author": "Character_Body_2810",
                            "score": 2,
                            "created_utc": 1652574723.0,
                            "response": "It can and is manipulated up as well. As an investor in bitcoin I have long since accepted the manipulation as a feature not a bug. That’s what has made it successful",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8lcwvv",
                            "author": "CryptoDApper",
                            "score": 3,
                            "created_utc": 1652546327.0,
                            "response": "I think you can crash any stock too if you have enough money, or any market given enough time and resources.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8mhdcf",
                            "author": "Dry-Cardiologist2187",
                            "score": 1,
                            "created_utc": 1652564941.0,
                            "response": "exactly.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8kytd8",
                    "author": "Lazy-Substance-5161",
                    "score": 4,
                    "created_utc": 1652539901.0,
                    "response": "I hope they recover.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8l3myz",
                    "author": "LordHaldon",
                    "score": 4,
                    "created_utc": 1652542164.0,
                    "response": "El Salvador is not a \"rogue\" state and if the IMF wanted to act in a manner to kill off the El Salvador experiment, they could. All will come to light when El Salvador has to renegotiate its loans in Jan 2023. The dip has happened and it was all noise. We all know where bitcoin is heading and that this is but a blimp.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8m5702",
                            "author": "help-me-retire-early",
                            "score": 2,
                            "created_utc": 1652559324.0,
                            "response": "An airship?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8m7ebf",
                                    "author": "sdguy71",
                                    "score": 3,
                                    "created_utc": 1652560338.0,
                                    "response": "Goodyear",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8n1oex",
                                            "author": "Character_Body_2810",
                                            "score": 2,
                                            "created_utc": 1652574667.0,
                                            "response": "Badmonth",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8ll9pj",
                    "author": "rguerraf",
                    "score": 3,
                    "created_utc": 1652550127.0,
                    "response": "If you invest only the amount of money you can afford to lose, no one can ever force you to sell.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8lf2yx",
                    "author": "NoShip7475",
                    "score": 3,
                    "created_utc": 1652547297.0,
                    "response": "Yes all 2% LOL",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8kspn7",
                    "author": "FucktheCaball",
                    "score": 17,
                    "created_utc": 1652536915.0,
                    "response": "I don’t think it’s conspiracy but fact. The IMF are a bunch of banker thugs who force countries through regime change either by loans they can’t pay back or installing one of their men as the new president or invade them with another countries army (USA). Look at any country that don’t have a central bank, they are always demonized. If the Bitcoin would work out it would free to many people and countries rendering the IMF and all central banks useless the globalist would loose all control over us and their plan would start to unravel.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8kt29i",
                            "author": "Userid77",
                            "score": 14,
                            "created_utc": 1652537091.0,
                            "response": "The great rest is underway right now. Klaus Schwab, the WEF and the rest of the cabal need to be arrested and tried for crimes against humanity.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8ku9r9",
                                    "author": "FucktheCaball",
                                    "score": 11,
                                    "created_utc": 1652537695.0,
                                    "response": "I agree",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8l5b43",
                                            "author": "Floridaman__________",
                                            "score": 3,
                                            "created_utc": 1652542924.0,
                                            "response": "User name checks out^",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i8n21qq",
                                    "author": "Character_Body_2810",
                                    "score": 1,
                                    "created_utc": 1652574854.0,
                                    "response": "Seems highly unlikely.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8lccy4",
                            "author": "BlueberryBags15",
                            "score": 0,
                            "created_utc": 1652546083.0,
                            "response": "Fuck the cabal.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8l1c2n",
                    "author": "bitrequest",
                    "score": 9,
                    "created_utc": 1652541095.0,
                    "response": "Well, they don't like Bitcoin, that's a fact.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8lt9m6",
                    "author": "LastRecognition4151",
                    "score": 5,
                    "created_utc": 1652553764.0,
                    "response": "Everything is a conspiracy these days. Go outside, people.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8lurgk",
                            "author": "CryptoDApper",
                            "score": 2,
                            "created_utc": 1652554451.0,
                            "response": "But...there´s people out there..",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8mbzxl",
                                    "author": "GroovyFat",
                                    "score": 1,
                                    "created_utc": 1652562456.0,
                                    "response": "With masks 😷",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8lahcm",
                    "author": "Earth2Andy",
                    "score": 16,
                    "created_utc": 1652545245.0,
                    "response": "Jesus, the lack of understanding of basic economics here is staggering.\n\nEl Salvador borrowed $800M almost 20 years ago, in January it’ll be time to pay it back.\n\nDue to massive amounts of corruption and a huge violence problem, the El Salvadorian economy is in the shitter, the govt continues to spend far more than it takes in in taxes.  None of this is new or the doing of the IMF.\n\nIn the last year El Salvador has taken $150M of tax revenue and decided to try and get out of this mess.  \n\nThey could have invested it creating manufacturing jobs to grow the economy , \n\nThey could have used it to stamp out corruption and try to attract foreign investment.\n\nThey could have spent it on generating green energy to sell to their neighbors.\n\nBut no, they decided to YOLO it into a crypto and lost.\n\nSo now they are going to the IMF saying “Can we borrow more money please?” and the IMF is quite reasonably saying “If we give you this money do you promise to invest it in growing your economy in ways proven to work and not YOLO it again?”\n\nYet somehow the Bitcoin community thinks that’s the IMF trying to stamp out Bitcoin.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8lfvyu",
                            "author": "IanMichael001",
                            "score": 8,
                            "created_utc": 1652547666.0,
                            "response": "Either way they wouldn’t have the money so I don’t get your point. IMF gave loans to a country they knew wouldn’t be able to pay back to control them, china does the same thing.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8lhqyv",
                                    "author": "Earth2Andy",
                                    "score": 4,
                                    "created_utc": 1652548520.0,
                                    "response": "If they can’t pay it all back they have 2 choices…\n\n1/ Borrow the money, by convincing someone they can make the payments on the new loan\n\n2/ Don’t pay it and nobody will ever lend to them again \n\nIf they want to go with #1, they have to convince the new lender that they’ve got a way to cover the new payments.  Most lenders would rather see you investing in growing jobs and building up industries, rather than betting on Bitcoin going up.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8loht5",
                                            "author": "IanMichael001",
                                            "score": 3,
                                            "created_utc": 1652551583.0,
                                            "response": "Option 1 is quite literally the world banks plans. Enslave them.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8lqgis",
                                                    "author": "Earth2Andy",
                                                    "score": 1,
                                                    "created_utc": 1652552471.0,
                                                    "response": "Yeah that evil evil IMF agreeing to lend them money when nobody else will.\n\nThe IMF should butt out and let El Salvador borrow money on the free market at <<checks notes>> 22% interest.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8luayn",
                                                            "author": "CryptoDApper",
                                                            "score": 0,
                                                            "created_utc": 1652554240.0,
                                                            "response": "If you really believe that the IMF give loans to countries out of the goodness of their heart then I have a bridge to sell you..",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8lut5n",
                                                                    "author": "Earth2Andy",
                                                                    "score": 4,
                                                                    "created_utc": 1652554472.0,
                                                                    "response": "The IMF lends money to countries because it’s better for the world to lose money lending to those countries than deal the famine/civil war/refugee crisis that happens when a country fails.  \n\nIt’s self preservation, nothing more nothing less.  These conspiracy theories about the IMF trying to enslave countries is straight up tin foil hat BS.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i8lvlky",
                                                                            "author": "CryptoDApper",
                                                                            "score": 2,
                                                                            "created_utc": 1652554842.0,
                                                                            "response": "Have you read The confessions of an economic hitman or seen some of John Perkins´ interviews?",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i8lw16e",
                                                                                    "author": "Earth2Andy",
                                                                                    "score": 3,
                                                                                    "created_utc": 1652555044.0,
                                                                                    "response": "Yes and have YOU read the articles written by journalists that researched his stories and found they were mostly exaggerations?",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i8lwaob",
                                                                                            "author": "CryptoDApper",
                                                                                            "score": 3,
                                                                                            "created_utc": 1652555165.0,
                                                                                            "response": "Is this on FactCheck.org or do you have a link..",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "id": "i8lv238",
                                                                    "author": "Earth2Andy",
                                                                    "score": 3,
                                                                    "created_utc": 1652554589.0,
                                                                    "response": "Also given you literally don’t understand how sovereign debt works (as evidenced by this post), maybe you should spend a little less time on Reddit and a little more time on Wikipedia.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i8lw3uj",
                                                                            "author": "CryptoDApper",
                                                                            "score": 2,
                                                                            "created_utc": 1652555077.0,
                                                                            "response": "Oh, that´s just rude, man.. Don´t low blow me like that.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i8m3nfq",
                                                                                    "author": "Earth2Andy",
                                                                                    "score": 6,
                                                                                    "created_utc": 1652558614.0,
                                                                                    "response": "You know, you’re right, I need to be better….\n\n\nHere’s what you need to know about the debt in question….\n\nThe debit coming due is $800 million bonds that El Salvador sold on the open market in 2002.  It’s a fixed rate bond paying 7.75%.  It is due on 1/24/2023.  You can see all the details here…\n\nhttps://www.bourse.lu/security/USP01012AJ55/62269\n\nNote, none of this debt is owned by the IMF\n\nThe way bonds like this work (and most countries do it this way including the US) is that the issuer (El Salvador) pays out half of that 7.75% twice a year.  If you do the math you’ll see that comes out to $31M every 6 months.  Then at the end of the term (Jan 24th 2023) they have to give the holders of the bond the original amount back ($800M total).  That fixed $31M payment every six months amount was agreed in 2002, it’s not a new thing.\n\nIn the last year, El Salvador has bought 2300 bitcoins for roughly $100M.  2300 coins are now worth about $67M meaning they’ve lost $33M.  So when people say they’ve lost the equivalent of one debt payment, they mean they could have made one of those 6 month payments with the $33M they are currently down.\n\nWhen people talk about a default, they mean that El Salvador can’t pay it’s obligations on this debt.  Nobody is really worried about ES making that next $31M payment.  What they are worried about is that $800M repayment in January.\n\nThe reason a default is a big deal, is nobody is going to lend you money ever again if you have a history of not paying it back.  Or if they do, they are going to charge you crazy high interest.\n\nGiven El Salvador needs to borrow money to keep paying it’s bills (interest on it’s other debts, state pensions, paying the army etc etc), a default would be a disaster.\n\nThat’s where the IMF could step in.  They could lend them the $800M at a below market interest rate.  But they will add strings, and one of those strings will likely be, stop doing risky speculative things and start doing the basics right.",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8lh4ht",
                            "author": "_CypherIO",
                            "score": 2,
                            "created_utc": 1652548231.0,
                            "response": "> they decided to YOLO it into a crypto and lost.\n\nIt was not into 'crypto' in this case but into Bitcoin and they didn't lost a single sat if they didn't panic sell.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8lk87m",
                                    "author": "bittenbycoin",
                                    "score": 3,
                                    "created_utc": 1652549649.0,
                                    "response": "You know, I get the feeling there's two kinds of fomo. There's that external fomo when everyone around you is getting in and you get swept along. But there's also this internal fomo for those who had their internal light switch go on regarding bitcoin. I've got to get in, I now realize how important this is and I have to get in ASAP! There is no way I can  wait and wait for an optimal entry point - the time is now, says my internal light bulb. \n\nSo if you are hit by internal fomo, there's a lot of luck involved, in the short term, that it happened at an optimal price entry point. Win some lose some in the short term, but in the long term there is not much doubt what the outcome will be.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8loenv",
                                            "author": "Rokey76",
                                            "score": 1,
                                            "created_utc": 1652551545.0,
                                            "response": "Time in the market beats timing the market. If you believe in a product and think it is a good investment, the best time to buy is now.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i8lio1n",
                                    "author": "Earth2Andy",
                                    "score": -3,
                                    "created_utc": 1652548936.0,
                                    "response": "Lol, I said “A Crypto”.  Bitcoin is a crypto currency.\n\n> and they didn’t lose a single sat\n\nLol, I love this logic!  I’m going to spend my mortgage payment on Pokémon cards this month, when the bank ask for the money I’ll just tell them I haven’t lost a single card so it’s OK.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8kweg6",
                    "author": "Stocksugardaddy",
                    "score": 2,
                    "created_utc": 1652538744.0,
                    "response": "I think the biggest institution is doing it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8lmxkh",
                    "author": "sdguy71",
                    "score": 2,
                    "created_utc": 1652550875.0,
                    "response": "Total number of bitcoins: 2301\n\nAverage cost per bitcoin: $44,204\n\nCurrent loss at 29.5K: $33,800,000\n\n[Source](https://elsalvadorinfo.net/el-salvador-bitcoins/)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ln7zt",
                    "author": "Rjk214",
                    "score": 2,
                    "created_utc": 1652551010.0,
                    "response": "If you don’t believe that almost all banks are heavily short on BTC then that is just naive and foolish..\n\nIt is a systemic threat to their control. Why do you think almost every derivative is only futures?!? It allows governments and banks to control the price.\n\nBTC was once a product with a limited supply. Now that supply is essentially unlimited.\n\nAllowing banks and governments to control the price. All data suggests BTC holdings are almost at ATHs and yet the price is 60% lower. Weird.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8n4u1b",
                            "author": "squareOfTwo",
                            "score": 2,
                            "created_utc": 1652576267.0,
                            "response": ">BTC was once a product with a limited supply. Now that supply is essentially unlimited.\n\nThis is false because a BTC future is not BTC.\n\nBTC was never a product nor a financial instrument.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8nfkco",
                                    "author": "Rjk214",
                                    "score": 1,
                                    "created_utc": 1652581863.0,
                                    "response": "It allows for unlimited shorting. Which means it allows for unlimited control.\n\nIf you don’t understand how futures work to control markets you have a lot to learn",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8nk70n",
                                            "author": "squareOfTwo",
                                            "score": 1,
                                            "created_utc": 1652584401.0,
                                            "response": "here please understand game theory [https://en.wikipedia.org/wiki/Game\\_theory#Symmetric\\_/\\_asymmetric](https://en.wikipedia.org/wiki/Game_theory#Symmetric_/_asymmetric)\n\nAre you telling me that one entity can influence the price of BTC for a long time given a lot of other entities with the same size/\"influence\"/etc.? That's not possible by game theory in a zero sum game. A asset such as BTC is almost like a zero sum game, because not a lot of BTC is mined.\n\n&#x200B;\n\nThere is no such thing as \"unlimited control\". Your false belief is that fiat=control.\n\nFutures are not BTC (self custody), they are about the BTC price.\n\n&#x200B;\n\nOr maybe listen to Michael Saylor, he seems to be on the game theory train too.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8nm1l2",
                                                    "author": "Rjk214",
                                                    "score": 1,
                                                    "created_utc": 1652585458.0,
                                                    "response": "You are trying to to discuss something that isn’t even the same topic. Once you learn what a paper market is feel free to have a discussion. \n\nIt’s clear you have a lot to learn about financial markets.\n\nThere is no point in going further since you ignored what derivatives do and tried to flip it into something else completely. Good luck",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8om99z",
                                                            "author": "squareOfTwo",
                                                            "score": 0,
                                                            "created_utc": 1652613194.0,
                                                            "response": "You just don't understand my point. Good luck yourself. It's funny that you relate the BTC price to a \"paper market\", it's not, maybe in the short term but not in the long term. Good luck trying to hold a future for 10 years, lol.\n\nYou don't even know what your buying, else you wouldn't argue in this way.\nGo back to the fundamentals of BTC.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8p4179",
                                                                    "author": "Rjk214",
                                                                    "score": 1,
                                                                    "created_utc": 1652623750.0,
                                                                    "response": "Your point has 0 validity in this conversation. It doesn’t mean it’s wrong. I made a point you didn’t understand it so you tried to make some other point that had nothing to do with mine.\n\nAnyways. Good luck.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8lz02w",
                    "author": "Mageant",
                    "score": 2,
                    "created_utc": 1652556442.0,
                    "response": "I don't understand why the Bitcoin crash would make El Salvador unable to pay back IMF loans. Did they actually buy Bitcoin with money that was supposed to be for paying back loans in such short term?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8nyx9i",
                    "author": "Future_Thing_2984",
                    "score": 2,
                    "created_utc": 1652593755.0,
                    "response": "No, it didn't.  Don't believe goofy conspiracy theories!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8o2k74",
                    "author": "hoangnd1",
                    "score": 2,
                    "created_utc": 1652596587.0,
                    "response": "Why do you think that? I just can't believe the people still they think that IMF have that much power. They can't even stop El Salvador from buying Bitcoin from the market.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8o70oy",
                    "author": "Ok_Tangerine346",
                    "score": 2,
                    "created_utc": 1652600246.0,
                    "response": "No. Don't be stupid",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8o7gqp",
                    "author": "lucienBTC",
                    "score": 2,
                    "created_utc": 1652600625.0,
                    "response": "Do you really think that? Well I am feeling sad for you now.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8w8i2n",
                    "author": "assinuss",
                    "score": 1,
                    "created_utc": 1652751421.0,
                    "response": "They can never and you need to stop posting these things.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8lqzde",
                    "author": "thegodofwine7",
                    "score": 3,
                    "created_utc": 1652552708.0,
                    "response": "If you think any entity has the ability to \"crash Bitcoin\", then why would you possibly invest in it? Totally antithetical to the idea of Bitcoin in the first place.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ktvsp",
                    "author": "VariousTransition795",
                    "score": 4,
                    "created_utc": 1652537500.0,
                    "response": "lol - your theory is missing some polish.\n\nEl Salvador bought most of his stack at a $30K price tag.\n\nCurrent BTC price $29K\n\nGuess where the price was between the start of this journey and now.\n\nSeriously, use numbers only on your calculator (and share source).",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8l4uzj",
                            "author": "CorrectStrawberry225",
                            "score": 2,
                            "created_utc": 1652542723.0,
                            "response": "The most recent buy is at $30k but they bought much more in the 40k-60k range",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8l7vkg",
                                    "author": "VariousTransition795",
                                    "score": 1,
                                    "created_utc": 1652544086.0,
                                    "response": "The main issue with this data is:They bought X amount while the spot price was Y\n\nSince we don't have the price paid and when the deal occurred, we'll simply speculate and assume that Y was the paid price on the day they announced it.\n\nStill, I don't see how a 2.5% impermanent loss is meaningful on a 800M number.\n\nThis whole story is probably part of the other, bigger theory on how \"the smallest LATAM country who will wipe the US economy\".",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8lbtoi",
                            "author": "Earth2Andy",
                            "score": 2,
                            "created_utc": 1652545846.0,
                            "response": "Nope, El Salvador bought at an average in the 40s",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8w7ncz",
                                    "author": "cryptidan",
                                    "score": 1,
                                    "created_utc": 1652750990.0,
                                    "response": "They will buy more and that's what I like about them lol.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8w9an0",
                                            "author": "Earth2Andy",
                                            "score": 1,
                                            "created_utc": 1652751820.0,
                                            "response": "Every single purchase they have made is underwater.  Maybe one day it will make a profit, maybe not.\n\n1st rule of Bitcoin is don’t invest more than you can afford to lose.  El Salvador can’t afford to lose $100M",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8kwclm",
                            "author": "CryptoDApper",
                            "score": 2,
                            "created_utc": 1652538719.0,
                            "response": "I’ve added some sources now. Thanks for your help.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8l1mpe",
                                    "author": "VariousTransition795",
                                    "score": 2,
                                    "created_utc": 1652541236.0,
                                    "response": "The way they estimate his \"losses\" is probably wrong.\n\nSince Bloomberg wasn't able to get the actual data on the price paid, they used the daily spot price.\n\nLastly, see it this way:\n\n80M is 10% of 800M\n\n20M is 2.5% of 800M\n\nSo they won't make it because they have an impermanent loss of 2.5% of the whole 800M? Is that it?\n\nIMO Bloomberg theory is a NGMI theory.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8ltlvs",
                    "author": "Scodo",
                    "score": 2,
                    "created_utc": 1652553920.0,
                    "response": "Unfortunately, El Salvador doesn't really need help looking bad.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8mppdb",
                            "author": "wwwalera",
                            "score": 1,
                            "created_utc": 1652568852.0,
                            "response": "Their president is just doing DCA and they want Bitcoin to pump only",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8w7ny7",
                                    "author": "demonDDS_bot",
                                    "score": 1,
                                    "created_utc": 1652750998.0,
                                    "response": "That's what I love about him, he is doing so great there.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8m7tal",
                    "author": "SillyGrizzles",
                    "score": 2,
                    "created_utc": 1652560527.0,
                    "response": "Probably one of the dumbest posts I’ve ever read.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8mf00f",
                            "author": "CryptoDApper",
                            "score": 2,
                            "created_utc": 1652563850.0,
                            "response": "Thanks..",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8o70pl",
                            "author": "yeskelar",
                            "score": 1,
                            "created_utc": 1652600247.0,
                            "response": "Yeah man, people are making so many things like that.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8lvsbr",
                    "author": "ukrainianhater",
                    "score": 2,
                    "created_utc": 1652554927.0,
                    "response": "El Salvador’s brain dead redditlord president invested in a highly volatile market and that volatile market crashed like it has numerous times already. Get out of here with this garbage",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8kv0un",
                    "author": "aKnightWh0SaysNi",
                    "score": -2,
                    "created_utc": 1652538064.0,
                    "response": "El Salvador put their eggs in a volatile basket. They fucked around and found out. Even governments shouldn’t gamble more than they can afford to lose when they have debt payments regularly due.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8lc3uq",
                            "author": "Earth2Andy",
                            "score": 2,
                            "created_utc": 1652545973.0,
                            "response": "You’re going to get down voted to hell for this, but this is the truth.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8kv4oe",
                    "author": "garowedre-68abe4",
                    "score": 1,
                    "created_utc": 1652538118.0,
                    "response": "What crash?🤔",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8w8370",
                            "author": "willesscp",
                            "score": 1,
                            "created_utc": 1652751214.0,
                            "response": "We haven't even witnessed a real crash right now, we gotta laugh on this.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8kzro7",
                    "author": "MMinjin",
                    "score": 0,
                    "created_utc": 1652540360.0,
                    "response": "No.\n\n(also https://en.wikipedia.org/wiki/Betteridge%27s\\_law\\_of\\_headlines)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8l7zm6",
                    "author": "ErosTHE",
                    "score": 1,
                    "created_utc": 1652544137.0,
                    "response": "Well FED is increasing interest rates..... What you prefer ? A save heaven to put your money = bank = I terest or anything else??? Also stocks the same faith.. . However the opportunity is here I think. To start going long. And also don't forget that there is a housing bubble rising... increased interest rates has a risk also .... remember what hapened to housing bubble and now in my opinion we are leaving the same...\nhttps://youtu.be/yc15x1WUrSw",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8l9594",
                    "author": "JerryLeeDog",
                    "score": 1,
                    "created_utc": 1652544661.0,
                    "response": "I'd believe aliens did it before this",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8ld0s9",
                            "author": "CryptoDApper",
                            "score": 1,
                            "created_utc": 1652546376.0,
                            "response": "Wise words.. All humans (and Bitcoin) shall bend to the will of the Galactic Federation, and those who do not bend will be broken! :D",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8oe050",
                            "author": "crazywerd",
                            "score": 1,
                            "created_utc": 1652606230.0,
                            "response": "I guess yeah because people of any country can never control BTC.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8lbh3k",
                    "author": "forzagesu",
                    "score": 1,
                    "created_utc": 1652545690.0,
                    "response": "If by IMF you mean Black Rock, then yes",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ldntb",
                    "author": "Krypto_Kane",
                    "score": 1,
                    "created_utc": 1652546656.0,
                    "response": "No profits means get back to work.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8li2e6",
                    "author": "ultroulcomp",
                    "score": 1,
                    "created_utc": 1652548666.0,
                    "response": "No",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8li382",
                    "author": "ElephantsAreHeavy",
                    "score": 1,
                    "created_utc": 1652548677.0,
                    "response": "They would not be able to pay this back with that money invested in bitcoin regardless of the value of bitcoin.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8liamg",
                    "author": "VPNApe",
                    "score": 1,
                    "created_utc": 1652548770.0,
                    "response": "It's not like they're playing nice with the IMF to begin with. Just default",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8lk1tv",
                    "author": "BitcoinCitadel",
                    "score": 1,
                    "created_utc": 1652549569.0,
                    "response": "No it's just a corrupt country",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8w83dq",
                            "author": "fingusio",
                            "score": 1,
                            "created_utc": 1652751216.0,
                            "response": "But still they are into bitcoin like no one else right now.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8lkn0k",
                    "author": "deadweight999",
                    "score": 1,
                    "created_utc": 1652549837.0,
                    "response": "No, because that would also make Tesla look bad. Whales are scooping up the panic sellers. It's the same old bull/bear cycle. Nothing new other than big banks are involved and they are a lot of the new whales, but they aren't all the whales and never will be.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8o7src",
                            "author": "erastoff",
                            "score": 1,
                            "created_utc": 1652600916.0,
                            "response": "How can they even control bitcoin? I will never gonna understand that.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8lltes",
                    "author": "aliensmadeus",
                    "score": 1,
                    "created_utc": 1652550376.0,
                    "response": "winter was comming anyway, so i don't see why they would have to force it earlier",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8loy7a",
                    "author": "Old-Form8787",
                    "score": 1,
                    "created_utc": 1652551792.0,
                    "response": "no",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8mf57m",
                            "author": "CryptoDApper",
                            "score": 1,
                            "created_utc": 1652563915.0,
                            "response": "ok",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8o5ee4",
                            "author": "ralph_ka2014",
                            "score": 1,
                            "created_utc": 1652598885.0,
                            "response": "This is the simplest way of telling something legit here.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8lqoog",
                    "author": "Quagdarr",
                    "score": 1,
                    "created_utc": 1652552573.0,
                    "response": "I doubt it. The stock market was artificially inflated due to corporate buybacks using payroll protection program money and prior to that it was bailout money to some companies.\n\nThen borrowing money with almost no interest so now with the interest rate going up less will spend and it’s speculators keeping the scam going. \n\nNot making it political at all. Under previous administration, it was mandated ALL money for PPP was to go to actual payroll and the said head of that administration warned of consequences if that money was not to keep people employed. Many companies took the money and laid off people for fat pay days and increase profits. Then when the current administration took over they changed it to where the PPP could (up to a set percent) be used for anything, not just payroll. So that’s when we saw a spike in share buybacks. I work for a bank and had to make the material for clients/sales team and that’s where I found out about the change. I was floored. People laid off while your tax dollars went to share buybacks to enrich the 1%, the executives. \n\nWe should be in a depression, interest rates are only showing a small fraction of what should actually be. So my guess is day traders saw this, saw BTC skyrocket & are in both stocks and crypto. I see stops getting taken out as mad selloff a hit as speculators know companies will not show increased profits quarter over quarter. I think BTC sell offs were to both short it for profits and to pay off their debts owed trading options and shit.\n\nMostly my guess. In short? No…I don’t think it’s IMF. I think the fraud that is the current global economic system is simply revealing and YOU the consumer will be blamed and like in 2008, nobody will go to jail. Sadly greasy day traders got in and like a parasite, grabbed onto crypto and we now move with the stock market hoping to break free.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8lt1nl",
                    "author": "mattferg222",
                    "score": 1,
                    "created_utc": 1652553665.0,
                    "response": "There’s no evidence they won’t make their next debt payment.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8lth6m",
                    "author": "PostalEFM",
                    "score": 1,
                    "created_utc": 1652553860.0,
                    "response": "No . . . . But duck the IMF for all the stuff they actually have done.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8w84q8",
                            "author": "marvelvl",
                            "score": 1,
                            "created_utc": 1652751235.0,
                            "response": "Yeah they are bad but they don't have that much of power.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8lvetp",
                    "author": "GannicusXIII",
                    "score": 1,
                    "created_utc": 1652554756.0,
                    "response": "🤣🤣🤣🤣",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8lw5q2",
                    "author": "OfficialMarsCurrency",
                    "score": 1,
                    "created_utc": 1652555101.0,
                    "response": "They would not have bought bitcoin to pay the IMF in the short term, that would be poor economic strategy even for a 4 year old playing monopoly.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8lx3te",
                    "author": "AnyDesign9860",
                    "score": 1,
                    "created_utc": 1652555548.0,
                    "response": "I highly doubt this conspiracy theory is true. Yes, the IMF hates bitcoin and will do anything they can to keep it low, but I do not think it goes directly to attack El Salvador. Small nations will keep adopting bitcoin. The IMF does not fear El Salvador, it fears the people who are buying bitcoin and not trusting any governments or banks anymore. \n\nGovernment/banks credibility goes down, bitcoin goes up. They are trying to give more credibility to their institutions and giving bitcoin a hard time. Its just a matter of time (many years to come) for the fiat system to collapse.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8lx5ob",
                    "author": "italiansixth",
                    "score": 1,
                    "created_utc": 1652555573.0,
                    "response": "Ofc they did. Or maybe Yellen&Co.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8w87fl",
                            "author": "zgogenadze",
                            "score": 1,
                            "created_utc": 1652751273.0,
                            "response": "Lol do you really think that? I guess that's not something legit.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8lyb4u",
                    "author": "ShadowFire139",
                    "score": 1,
                    "created_utc": 1652556112.0,
                    "response": "What about independence from the Government?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8w8cyv",
                            "author": "adhgsw",
                            "score": 1,
                            "created_utc": 1652751349.0,
                            "response": "Wow man, I can't even think about these things right now.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8m0lfo",
                    "author": "rashnull",
                    "score": 1,
                    "created_utc": 1652557192.0,
                    "response": "Bitcoin didn’t crash. It’s valuation in dollars did.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8mtrbf",
                            "author": "dbihosting",
                            "score": 1,
                            "created_utc": 1652570735.0,
                            "response": "It's same thing, Bitcoin is down we agree but dollar power has also decreased",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8ojdn5",
                                    "author": "the_2_jammer",
                                    "score": 1,
                                    "created_utc": 1652610867.0,
                                    "response": "Well yeah but the point is IMF can't control anything for sure.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8m3cru",
                    "author": "Vigilias",
                    "score": 1,
                    "created_utc": 1652558479.0,
                    "response": "Musta crashed the Dow too.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8m81uu",
                    "author": "Mojicana",
                    "score": 1,
                    "created_utc": 1652560640.0,
                    "response": "Wouldn't be out of character for the IMF.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8m8uv0",
                    "author": "fverdeja",
                    "score": 1,
                    "created_utc": 1652561008.0,
                    "response": "Did the blockchain stopped working? Or the price tanked? Two totally different things",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8m91vi",
                    "author": "n0x103",
                    "score": 1,
                    "created_utc": 1652561097.0,
                    "response": "lol keep your stupidity on the conspiracy subreddit. Why don't you stick to such great hot takes as \"build back better\"= bbb = 666 = devil confirmed. lmao",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8w8upn",
                            "author": "wqj911",
                            "score": 1,
                            "created_utc": 1652751598.0,
                            "response": "These guys are good for entertainment, we gotta agree.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8mrunw",
                            "author": "CryptoDApper",
                            "score": 0,
                            "created_utc": 1652569832.0,
                            "response": "I´m surprised & flattered ppl remember that oldie but goldie.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8mbg2c",
                    "author": "TorukMaktoM",
                    "score": 1,
                    "created_utc": 1652562208.0,
                    "response": "But how?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8o3wtk",
                            "author": "lestatgyry",
                            "score": 1,
                            "created_utc": 1652597667.0,
                            "response": "We never gonna know that because it's just something made up.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8mdyk1",
                    "author": "Gh0st_Pirate_LeChuck",
                    "score": 1,
                    "created_utc": 1652563373.0,
                    "response": "You call that a crash?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8w9219",
                            "author": "itismeme1",
                            "score": 1,
                            "created_utc": 1652751699.0,
                            "response": "that's not a crash and that was not done by IMF for sure.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8mfczo",
                    "author": "FallingKnife_",
                    "score": 1,
                    "created_utc": 1652564011.0,
                    "response": "Please, we don't need any more make believe conspiracy theories. We have our hands full with reality.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8ohhwn",
                            "author": "operationatlanta",
                            "score": 1,
                            "created_utc": 1652609256.0,
                            "response": "Yeah man, we are already tired of these things right now.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8mk2k4",
                    "author": "BitcoinUser263895",
                    "score": 1,
                    "created_utc": 1652566202.0,
                    "response": "That's not how the IMF works.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8w95v3",
                            "author": "ankaa1118",
                            "score": 1,
                            "created_utc": 1652751753.0,
                            "response": "They works pretty shitty and they can't harm Bitcoin market.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8mkbbg",
                    "author": "Rtbrosk",
                    "score": 1,
                    "created_utc": 1652566318.0,
                    "response": "how do people dream this shit up",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8w8y6i",
                            "author": "Karapatian",
                            "score": 1,
                            "created_utc": 1652751646.0,
                            "response": "We can never understand this and we have our own reasons.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8ml5j5",
                    "author": "BigPlayCrypto",
                    "score": 1,
                    "created_utc": 1652566716.0,
                    "response": "I would think so good sir but what do I know",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8o5pur",
                            "author": "antonlva",
                            "score": 1,
                            "created_utc": 1652599154.0,
                            "response": "You know nothing jon snow, you better wait for the winter.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8mqlps",
                    "author": "virus5877",
                    "score": 1,
                    "created_utc": 1652569271.0,
                    "response": "I think folks are forgetting about the US Federeal Reserve's role in everything.  They've kept money cheap for waaay longer than they should have.  Granted we were in \"unprecedented times,\" but now that they're turning the spigots off and selling off government debt the riskier segments of the global markets are ALL dropping.   See tech stocks, see crypto.   This is mostly to be expected.    \n\n&#x200B;\n\nEl Salvador is playing the long, macroeconomic gain.   BTC is a volatile asset, always has been, probably always will be.   It's the most free market in the history of the world!@!    In 18+ months when we're smashing ATHs again El Hodlador will look like the genius he claims to be ;)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8mrr2a",
                    "author": "Blueopus2",
                    "score": 1,
                    "created_utc": 1652569786.0,
                    "response": "Now I know where my tinfoil went",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8mvvfz",
                            "author": "CryptoDApper",
                            "score": 1,
                            "created_utc": 1652571746.0,
                            "response": "To heat up your fentanyl?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8mw1ey",
                                    "author": "Blueopus2",
                                    "score": 1,
                                    "created_utc": 1652571829.0,
                                    "response": "Na, I use a spoon",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8w95du",
                                            "author": "ruscowalev",
                                            "score": 1,
                                            "created_utc": 1652751746.0,
                                            "response": "That's still something better than other intoxication lol.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i8w9gu2",
                                    "author": "dima43rus",
                                    "score": 1,
                                    "created_utc": 1652751908.0,
                                    "response": "Man is high on that shit for sure, we all can agree with it.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8w9llp",
                            "author": "nino262596",
                            "score": 1,
                            "created_utc": 1652751975.0,
                            "response": "What's tinfoil? I never understood the meaning of it man.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8n0neg",
                    "author": "Ja307020",
                    "score": 1,
                    "created_utc": 1652574150.0,
                    "response": "Well for one this random bitcoin maybe belongong to the fbi cashed out along with sending the market into a frenzy helped",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8w9nvh",
                            "author": "jeffw601",
                            "score": 1,
                            "created_utc": 1652752008.0,
                            "response": "Lol these things are just so funny, I can't believe if they can control us.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8n0r9f",
                    "author": "Ja307020",
                    "score": 1,
                    "created_utc": 1652574205.0,
                    "response": "https://www.reddit.com/r/CryptoCurrency/comments/upe3zp/satoshiera_bitcoin_wallet_awakens_after_85_years/?utm_source=share&utm_medium=ios_app&utm_name=iossmf",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8n1cwg",
                    "author": "Character_Body_2810",
                    "score": 1,
                    "created_utc": 1652574507.0,
                    "response": "El Salvador put about 5% of their reserves in bitcoin. This is all absolute bullshit. They lost 35 million out of a couple billion. This is all nonsense",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8w9wmb",
                            "author": "noetus",
                            "score": 1,
                            "created_utc": 1652752128.0,
                            "response": "Yeah man, I can't agree with the OP, he is clearly wrong.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8waocm",
                                    "author": "Character_Body_2810",
                                    "score": 1,
                                    "created_utc": 1652752514.0,
                                    "response": "It’s just a bunch of sensationalized headlines taking the opportunity to smear bitcoin.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8n5u5u",
                    "author": "infopocalypse",
                    "score": 1,
                    "created_utc": 1652576783.0,
                    "response": "El Salvadors BTC holdings only make up about 2% of their reserves. All this reporting that btc dipping could make them go default is just propaganda.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8w9qfh",
                            "author": "wjtwww",
                            "score": 1,
                            "created_utc": 1652752043.0,
                            "response": "They can't harm us and they can't harm El Salvador's market.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8n6b9m",
                    "author": "SolarPanelDude",
                    "score": 1,
                    "created_utc": 1652577035.0,
                    "response": "No they did not.\n\n\nNext question please.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8waxkk",
                            "author": "dzexod",
                            "score": 1,
                            "created_utc": 1652752643.0,
                            "response": "They can't would be the perfect answer for that shit lol.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8n7kra",
                    "author": "ghosn2013",
                    "score": 1,
                    "created_utc": 1652577694.0,
                    "response": "EL Salvador is not going to care about the crash they are still buying BTC",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8wart1",
                            "author": "ildaros",
                            "score": 1,
                            "created_utc": 1652752563.0,
                            "response": "Yeah but still IMF can't crash bitcoin, we know it's not possible.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8ne3vn",
                    "author": "RoyYourWorkingBoy",
                    "score": 1,
                    "created_utc": 1652581092.0,
                    "response": "I don't think they crashed anything, but I think they have a plan in place to pile on when bitcoin dips 10% with a stream of FUD. Maybe screw with some shitcoins.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8o6enh",
                            "author": "airtimemobilesen",
                            "score": 1,
                            "created_utc": 1652599729.0,
                            "response": "They can't screw Bitcoin whenever they want, that's a fact.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8neefz",
                    "author": "TaleRecursion",
                    "score": 1,
                    "created_utc": 1652581244.0,
                    "response": "> from multiple supposedly unconnected media\n\nUnder what rock have you been living these last ten years that you still make that kind of supposition?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8nh99g",
                    "author": "Plenty_System45",
                    "score": 1,
                    "created_utc": 1652582770.0,
                    "response": "Surely IMF is not that evil.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8nstgm",
                    "author": "DMC_007",
                    "score": 1,
                    "created_utc": 1652589549.0,
                    "response": "As if the IMF has as much power as Citadel in any market.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8o1rc4",
                    "author": "BlockChainR3volution",
                    "score": 1,
                    "created_utc": 1652595950.0,
                    "response": "We give the IMF too much imaginary power",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8odcg2",
                    "author": "jeffereeee",
                    "score": 1,
                    "created_utc": 1652605654.0,
                    "response": "Lol, no.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ogg9o",
                    "author": "Interstellar_Being",
                    "score": 1,
                    "created_utc": 1652608354.0,
                    "response": "Every market can be manipulated. I don’t know why so many people think this can be a conspiracy. \n\nBut the recent crash occurred because of macroeconomic factors. But it’s one of the first rules you learn in trading, that the market makers make the price, and the herd follows. \n\nWhy are there fakeouts? Because the market maker want entities to believe the price goes up/down to get their liquidity. \n\nThere IS manipulation in market, that’s no conspiracy, but you will never know who’s manipulating it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8oi6bi",
                    "author": "megasoso",
                    "score": 1,
                    "created_utc": 1652609848.0,
                    "response": "Man I am feeling sad for you, it's good that people have brains.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ojxg2",
                    "author": "seeking2006",
                    "score": 1,
                    "created_utc": 1652611321.0,
                    "response": "You guys need to relax, it's nothing like that for sure lmao.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8p217b",
                    "author": "cryptokingmylo",
                    "score": 1,
                    "created_utc": 1652622775.0,
                    "response": "The world isn't full of diabolical geniuses and grand conspiracys, it's far worse, it's full of idiots like you and I who wouldn't have a snow balls chance in hell of pulling off anything substantial and without getting caught..",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8w93xk",
                    "author": "Melbstyle",
                    "score": 1,
                    "created_utc": 1652751725.0,
                    "response": "Man I need to see the importance of your thought but I can't find it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8w9uta",
                    "author": "BpzID",
                    "score": 1,
                    "created_utc": 1652752104.0,
                    "response": "I am glad that I never believed something like that lmao.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8wafhp",
                    "author": "77Network",
                    "score": 1,
                    "created_utc": 1652752389.0,
                    "response": "We need to understand that it's just complete bullshit for sure.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8wb95g",
                    "author": "318318dsdsd",
                    "score": 1,
                    "created_utc": 1652752806.0,
                    "response": "Why you guys are like that? It's just so fucked up man lmao.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8noywf",
                    "author": "custurdlauncher",
                    "score": 0,
                    "created_utc": 1652587179.0,
                    "response": "No offense meant but does a 3rd world country really need help to “look bad”",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}