{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uvvmyc",
            "title": "Bitcoin Monthly 16: BIP119, CTV, BISQ and important software updates",
            "url": "https://v.redd.it/s9sygft2t6191",
            "author": "MrCrownnnnn",
            "created_utc": 1653294914.0,
            "score": 9,
            "num_comments": 4,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9nusmp",
                    "author": "MrCrownnnnn",
                    "score": 1,
                    "created_utc": 1653295328.0,
                    "response": "Check out the [full episode](https://ungovernablemisfits.com/podcast/bitcoin-monthly-16-bip119-ctv-software-updates-bisq/)",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uvvija",
            "title": "The wealth gap will shrink thanks to the arrogance of rich people",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uvvija/the_wealth_gap_will_shrink_thanks_to_the/",
            "author": "MCHappster1",
            "created_utc": 1653294339.0,
            "score": 133,
            "num_comments": 138,
            "subreddit": "Bitcoin",
            "selftext": "Rich countries have incentive to hold onto their fiat currency. The poorer nations and individuals who discover the power of Bitcoin are incentivised to ditch fiat for a better alternative. \n\nThe longer the rich nations hold out with their fiat the longer the poorer nations will have to accumulate and hence bring the wealth gap closer together during eventual bull markets. \n\nThe arrogance of the rich and powerful is in essence the very thing starting to destroy them and re distribute this power to the people. It’s very ironic and I love it.\n\nThis is also a main argument against the banning of Bitcoin. Like sure, go ahead, but you’ll be missing out and you’ll regret it when everyone else has it and rides the bull into the sunset.\n\nEdit: Just to clarify, I get the current distribution of bitcoins isn’t any better. However, I am suggesting rich nation states will slowly lose their power and we could transition into an era where individuals can accumulate their wealth in a capitalist society. No more bailouts either; it’s all fair game and we should see the wealth gap stop exploding.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9nvx60",
                    "author": "Introvert82",
                    "score": 83,
                    "created_utc": 1653296377.0,
                    "response": "Bitcoin will accumulate into the hands of few, like everything else on the planet. \n\"For to every one who has will more be given, and he will have abundance\"… a tale as old a time.\nMight be some minor adjustments, but the same old principle will continue.\nI'm not complaining about it btw, it's just how the world works.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9olldq",
                            "author": "002timmy",
                            "score": 6,
                            "created_utc": 1653313785.0,
                            "response": "Pareto effect (or the Matthew Principle) is so powerful it not only applies to money, but it applies to the tress in the rainforest or mass of stars in the galaxy.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9or3gd",
                                    "author": "Introvert82",
                                    "score": 3,
                                    "created_utc": 1653316341.0,
                                    "response": "Indeed, super weird. Like a universal law everywhere.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9rkt1a",
                                    "author": "sztormwariat",
                                    "score": 1,
                                    "created_utc": 1653362452.0,
                                    "response": "explain the trees in rainforest part plz. I understand that stars and other massive celestial bodies attract each other but how do the trees work?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9ovahc",
                            "author": "chansiky",
                            "score": 5,
                            "created_utc": 1653318194.0,
                            "response": "What you're describing is Proof of Stake as well as Fiat + inflation systems.\n\nPoS rewards those who hold \"Stake\" as in \"For to every one who has will more be given, and he will have abundance\".\n\nPoW will always reward those who \"Work\", as in for doing work, they will be rewarded.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9o19wb",
                            "author": "Western_Boris",
                            "score": 21,
                            "created_utc": 1653301207.0,
                            "response": "One big thing is that the fiat money system favours the rich people but Bitcoin does not. It is called Cantillon effect.\n\n\nThe closer you are to the money printing central banks, the more you benefit from money printing while poor people far away from those only suffer the disadvantages.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9oas51",
                                    "author": "Crypto-hercules",
                                    "score": 29,
                                    "created_utc": 1653308002.0,
                                    "response": "Iam very close to my btc i sleep with my ledger in my butt crack.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9oiapx",
                                            "author": "Troy_Ounces",
                                            "score": 8,
                                            "created_utc": 1653312150.0,
                                            "response": "I replaced your ledger with something else and im definitely moving seeds",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i9ox1bw",
                                            "author": "ChevalBlanc",
                                            "score": 4,
                                            "created_utc": 1653318964.0,
                                            "response": "Bitcoin ledger butt plug could be a thing.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9p6ej5",
                                                    "author": "SailorMBliss",
                                                    "score": 3,
                                                    "created_utc": 1653322919.0,
                                                    "response": "I low key hate you, but you may want to start the patent process",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9p6q6v",
                                                            "author": "that1rowdyracer",
                                                            "score": 5,
                                                            "created_utc": 1653323053.0,
                                                            "response": "You think the Buttcoin boys would be pissed if he took the name?",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9rl0c6",
                                                                    "author": "sztormwariat",
                                                                    "score": 1,
                                                                    "created_utc": 1653362559.0,
                                                                    "response": "Do it, we will flood their sub with buttstuff!",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9oxa5j",
                                            "author": "BlueberryDefender",
                                            "score": 2,
                                            "created_utc": 1653319071.0,
                                            "response": "Haha wasn’t expecting that",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9rbdwm",
                                    "author": "cryptomultimoon",
                                    "score": 2,
                                    "created_utc": 1653357716.0,
                                    "response": "Yes, exactly this.  A fiat system rewards the swindlers.  The politicians are always available to be wooed into a mutually beneficial agreement that essentially prints money into their pockets.  With Bitcoin, the Pareto distribution will still hold, but anyone that chooses to save their wealth will still be able to, and no amount of manipulation can generate infinite Bitcoin for the politician to distribute as he pleases.  The distribution of wealth will be based much more on the amount of value you provide to the world, and there will always be individuals more willing and able to do this than others.  These people make it easier (cheaper) for the rest of the world to live, thus making it easier for everyone to save their Bitcoin by lowering prices through increased efficiency.  \n\nWe do not need to fix the wealth gap.  We need to allow rational markets to exist.  Everything improves as a result, and the poorest people benefit without having to do any of the work.  If at any point they are willing or able to provide more value, their efforts will provide them with ever increasing rewards in the form of cheaper and higher quality products and services.  Victims of circumstances outside of their control, the sick and disabled, benefit too from this.  It is cheaper to help them, so the goodwill of people willing to do so goes much further in rational markets.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9o1u5z",
                                    "author": "sloaleks",
                                    "score": 5,
                                    "created_utc": 1653301681.0,
                                    "response": ">The closer you are to the money printing central banks\n\nthe closer you are to bitcoin also, you seem to forget ... Bitcoin is like any other asset, it is better for you, if you already are rich.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9o9a3e",
                                            "author": "Capaj",
                                            "score": 7,
                                            "created_utc": 1653307057.0,
                                            "response": "when you're poor you have limited means to produce wealth. This has nothing to do with money/bitcoin. This is just natural order of things.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9o9fas",
                                                    "author": "sloaleks",
                                                    "score": 2,
                                                    "created_utc": 1653307150.0,
                                                    "response": "And when you're rich, you have an easier way to access bitcoin (and other vehicles to wealth), it has everything to do with money ... The natural order is the richer you are, the easier you access assets and wealth. The thing is, bitcoin is a thing of the rich, if they choose so.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9obyw6",
                                                            "author": "pink_raya",
                                                            "score": 3,
                                                            "created_utc": 1653308716.0,
                                                            "response": "thing is until recently, rich ppl didn't need to understand bitcoin, precisely because it had no advantage over their private deluxe banking accounts. They had very little incentive to learn about it when they could access any traditional instrument with priority and due urgency.\n\nThis changed a little bit, but still, billionaires are in a business of not losing money, instead of making them, their btc allocation is usually (according to some) < 5%.\n\npleb that DCA over time will get to 100% real quick. If this happens on big enough scale, the change in spending habits will make the people who owns the current infrastructure (selling planned obsolescence products) lose a lot of money.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9p3vj2",
                                                                    "author": "GCTD90",
                                                                    "score": 2,
                                                                    "created_utc": 1653321860.0,
                                                                    "response": "People getting paid with an average wage of 100.000 satoshis, BTC is the new currency but people are speaking of satoshis rather then btcs.\n\nUgh I'm awake again, that was a nice dream though",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                },
                                                                {
                                                                    "id": "i9og19p",
                                                                    "author": "IndianaGeoff",
                                                                    "score": 2,
                                                                    "created_utc": 1653310985.0,
                                                                    "response": "100% Bitcoin is foolish.  A rich person might be at 5%, but the other 95% is invested in real estate, income producing assets and company investments.  All those are productive uses of capital that are not invalidated by Bitcoin.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9ogl9u",
                                                                            "author": "pink_raya",
                                                                            "score": 9,
                                                                            "created_utc": 1653311275.0,
                                                                            "response": "if you hold and DCA long enough, it will get close to 100% against your will.\n\nAll these instruments have a high barrier of entry, how do I invest $20 into real estate or fine art? Should I sell the sats I got at 5k now? to buy what?",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i9oi2yc",
                                                                                    "author": "IndianaGeoff",
                                                                                    "score": 2,
                                                                                    "created_utc": 1653312041.0,
                                                                                    "response": "In all you have is 20 bucks any investment you should make should be in increasing your income and paying off debt.  Use the 20 bucks to look for a better job that will provide a greater income to invest.  Having an extra hundred bucks a week will dwarf your returns even if Bitcoin goes to a million.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i9oj6vl",
                                                                                            "author": "pink_raya",
                                                                                            "score": 2,
                                                                                            "created_utc": 1653312601.0,
                                                                                            "response": "I think you ain't broke enough to understand my perspective. I have a good job, no debt, but if there wasn't for bitcoin, I'd have $0 to my name by now, because I'd spent that cash elsewhere. \n\nFor me it wasn't a decision between investing into anything vs btc. I care much more about how btc can change the world than I do about working till I kick it.\n\nThere used to be a bear named Mark, and he would tell you to have at least 3 months of income as emergency fund in fiat before putting money into bitcoin.\n\nIf I listened I'd have 0 sats today.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "i9ozjdu",
                                                            "author": "HearMeSpeakAsIWill",
                                                            "score": 2,
                                                            "created_utc": 1653320031.0,
                                                            "response": "Yes, but what you're missing is that Bitcoin is a way of storing wealth for rich and poor alike. Fiat is a way for the rich to make themselves richer at the expense of the poor.",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "i9plg2b",
                                                            "author": "towerninja",
                                                            "score": 1,
                                                            "created_utc": 1653329222.0,
                                                            "response": "But people closer to the money printer get to borrow almost 0 interest fiat and spend it before the inflation",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9s2qf8",
                                                                    "author": "Dont_Say_No_to_Panda",
                                                                    "score": 1,
                                                                    "created_utc": 1653374664.0,
                                                                    "response": "What does it look like to be “closer to the money printer?” Can you give me examples of some of these people?",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "i9rc2ve",
                                                            "author": "cryptomultimoon",
                                                            "score": 0,
                                                            "created_utc": 1653358049.0,
                                                            "response": "Rich people sustain their lifestyle now by utilizing the fiat system to their benefit.  In a Bitcoin system, you would have to earn your money.  Only temporarily will the wealth stay in the hands of the kind of people that do not deserve their wealth.  These kind of people will spend it faster than they can earn it.  In a fiat system, these people can go back to the well.  In a Bitcoin system, they have to get someone to voluntarily trade with them to earn more money.  The only way to do that is to provide value, which means, to help people.  Parasites may accumulate Bitcoin with their ill gotten fiat, but they will not keep it.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9sdmge",
                                                                    "author": "Hughski",
                                                                    "score": 1,
                                                                    "created_utc": 1653384576.0,
                                                                    "response": "Lol come on. If you mean people who’ve like won the lottery then yeah they will lose their money whether it’s fiat or BTC.\n\nBut wealthy people who invest, are gonna stay wealthy whether they hold part of their portfolio in BTC or not. No matter how successful BTC becomes, the wealthiest people will very likely continue to have the majority of their assets in company stock",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9siic2",
                                                                            "author": "cryptomultimoon",
                                                                            "score": 1,
                                                                            "created_utc": 1653388797.0,
                                                                            "response": "Which company?  Over what period of time?  How would they ensure that their investments won’t lose?  \n\nI highly recommend you read The Bitcoin Standard and The Fiat Standard to understand the point I am making.  If rich people earn their money honestly, then they are adding value to the world by doing so.  If they earn it dishonestly, then under a Bitcoin dominated economy it will be much harder to keep it.  Using fiat money, the ultra rich can stay wealthy using essentially 0% interest loans and other unnatural market conditions to keep their momentum going.  Yes, there will always be rich people.  Under a stable currency the poorest people will do much better, and they will have a much better time saving and investing their own money to change their circumstance.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9ojzvl",
                            "author": "PeacefullyFighting",
                            "score": 4,
                            "created_utc": 1653313003.0,
                            "response": "This is so true and one of my major internal conflicts with investing into crypto currency & the GameStop thing. Sure it's the greatest wealth transfer in history but what then? Will they really do things for others just because they come from the working class? \n\nWe'll see but I know the current system is broken",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9omcvc",
                                    "author": "Introvert82",
                                    "score": 2,
                                    "created_utc": 1653314151.0,
                                    "response": "I'll probably be in the top % if the bitcoin price skyrockets into 500k within 10 years. If others are left behind, sucks for them. I built myself up from nothing, I'm not gonna feel sorry for poor people.\nThe world is unfair, but I will enjoy the spoils as much as I can. I pay my taxes and donate a tiny bit to charity, that's good enough for me.\nIt's not like poverty will disappear anytime soon, it will always stick around imo.....no matter how much society change.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9oo22j",
                                            "author": "PeacefullyFighting",
                                            "score": 2,
                                            "created_utc": 1653314947.0,
                                            "response": "Exactly my point. Too many people rubbed early crypto adopters the wrong way to expect any handouts.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9op6ye",
                                    "author": "bcyng",
                                    "score": 1,
                                    "created_utc": 1653315479.0,
                                    "response": "It’s only broken when u split the world into classes. Which is why the class system is broken and the world no longer uses the class system. It’s also why Marxist systems that insist on it tend to fail.\n\nNow wealth accumulates into the hands of the most productive. Which is by design. \n\nInflation ironically speeds up that process. Because it devalues unproductive accumulation of money - money is inherently unproductive. This is probably the biggest argument against Bitcoin - the fact that it’s deflationary - this encourages accumulation of unproductive money (Bitcoin) rather than incentivising people to spend it productively.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9pd7w6",
                                            "author": "PeacefullyFighting",
                                            "score": 1,
                                            "created_utc": 1653325760.0,
                                            "response": "I agree with your last statement but need to comment on the other two. Firstly I want to point out that Too Big To Fail is also a HUGE factor. If only the small guy can loose how will they ever catch up even if they are right and the big guy wrong. Historically wealth was lost within 3 generation. It's just nature, the kids grow up without any worry but they still have their parents to instil the values that built the company but as you get further and further into the generations these ideas slowly disappear and the company, investment or whatever crumbles. Others see their mistakes, pick up the rubble for cheap and the cycle repeats. This goes away with too big to fail. Once your in that class your set forever. \n\nNow I disagree that the world no longer uses a class system. It does just by a different name and rules of enforcement. \n\nI don't see an issue with rewarding the most productive but we need to let them deal with their own consequences, good or bad.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9r31c9",
                                                    "author": "bcyng",
                                                    "score": 1,
                                                    "created_utc": 1653353717.0,
                                                    "response": "Bailouts on too big to fail companies usually involve the shareholders losing their money. It generally involves the government buying the company from the shareholders at fire-sale prices or diluting them and then selling it back to the market at a profit for the government. The idea is to ensure that the company continues to provide essential services NOT that shareholders are protected. \n\nExamples of this:\nAIG - they provided $140b+ but took a 90%+ ownership stake. Govt sold at a profit later on and earned interest on the funds.\nBoA, Citigroup - they basically just bought shares at fire-sale prices to provide liquidity and later sold at a profit. \n\nMarxism likes to enforce classes on people - it helps them set one group of people against another as a way to divide and conquer. The real world doesn’t work like that.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i9poss5",
                                    "author": "qepdibpbfessttrud",
                                    "score": 1,
                                    "created_utc": 1653330660.0,
                                    "response": ">but what then? \n\nU could donate to charity or government - or not",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9olfye",
                            "author": "Lurked_Emerging",
                            "score": 2,
                            "created_utc": 1653313714.0,
                            "response": "Depends how firmly we arrive at \"you pay me for work in bitcoin\" there will be attempts at a cbdc etc. to try block the normies from owning bitcoin and work as an intermediary layer they can inflate and rent seek with like they do now, albeit with bitcoin forcing them to use the money printer in a restrained manner.\n\nPractically though young generations will probably insist on being paid in bitcoin meaning no fuzzy cheat layer and everything depreciates against bitcoin forever so hording land etc. becomes pointless and if they don't generate value faster than the rate at which prices deflate in future then they'll run out of bitcoin eventually.\n\nThere will be frugal families that never have to work again or bitcoin's buying power may scale quickly forever practically but inheritance etc. makes a fool of most people's planning. There will still be significant wealth inequality for a long time but bitcoin doesn't incentivise systems that can perpetuate it so time can come in and fix it slowly and surely.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9osk05",
                            "author": "JohnnySixguns",
                            "score": 2,
                            "created_utc": 1653316988.0,
                            "response": "Correct. \n\nAlso, one of the challenges for poorer people acquiring Bitcoin is that it’s not the simplest concept. \n\nRich people understand money and are smarter about how to move it, manage it and multiply it. \n\nOP’s comment included a huge caveat: those poor people who “discover the power of Bitcoin…”\n\nWell, it’s a very complex topic with a steep learning curve. Right now that’s Bitcoin’s biggest problem. \n\nIf there was an easy way to solve it we’d see daily record highs.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9nxemu",
                            "author": "MCHappster1",
                            "score": 5,
                            "created_utc": 1653297755.0,
                            "response": "The wealth gap won’t close but it’ll tighten.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9oidln",
                                    "author": "ojedaforpresident",
                                    "score": 3,
                                    "created_utc": 1653312191.0,
                                    "response": "No, it won’t. Rich people and nations can wait for that moment of if, and even to anyone on this sub this should still be a big big big big big biiiiiiiiiiiiiig if, Bitcoin actually becomes meaningful to them, and sell/trade assets for Bitcoin.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9qiwnb",
                                    "author": "BitcoinUser263895",
                                    "score": 1,
                                    "created_utc": 1653343870.0,
                                    "response": "It will stay exactly where it is. Maths.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9rcja6",
                                    "author": "cryptomultimoon",
                                    "score": 1,
                                    "created_utc": 1653358264.0,
                                    "response": "Wealth will move from the hands of the parasites into the hands of those that earn it.  The distribution may shift somewhat, but there will always be high achievers, and there should be.  More money in the hands of the people that provide the most value is a good thing for everyone, especially the poor.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9owxo2",
                            "author": "Telkk2",
                            "score": 1,
                            "created_utc": 1653318919.0,
                            "response": "Yup.  Geni coefficient is the scientific term for disparity that pretty much exists in all of nature.  Since no one country can control it (thankfully) it'll be more stratified than gold, so perhaps the disparity will be less than, say the disparity between those with the most u.s dollars and those with the least.  But the disparity will still exist and the only way to mitigate that is to offer other forms of wealth and have a strong social safety net that doesn't start at zero.\n\nThis way disparity will continue just like the seasons in the year but just like the seasons in the year within a modern society where we have heating and ac, the impact will be felt far far less.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9p0hme",
                    "author": "yungwilla",
                    "score": 7,
                    "created_utc": 1653320431.0,
                    "response": "This thread gave me cancer. The rich are accumulating silently or quietly. We’re not gonna be rich because we’re here now, but we’ll make money",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9p5nw6",
                    "author": "Random_Ad",
                    "score": 9,
                    "created_utc": 1653322614.0,
                    "response": "Holy fuck, the people in this sub are honesty brain dead.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9qibin",
                            "author": "BitcoinUser263895",
                            "score": 2,
                            "created_utc": 1653343593.0,
                            "response": "We have to keep the rich people out of Bitcoin at any cost!!!!!! Bukele for president of the world!!!! ;D",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9p7y5x",
                            "author": "GhostLooper",
                            "score": -4,
                            "created_utc": 1653323563.0,
                            "response": "Bye Felicia",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9owejd",
                    "author": "jabba1977ad",
                    "score": 6,
                    "created_utc": 1653318685.0,
                    "response": "Hmm. A lot of the poorer countries now adopting Bitcoin are poor due to their corrupt governments.\n\nI'm not sure how I feel about some of the most financially corrupt governments getting involved, but i certainly don't see the punishment of the rich - and if they do ride off into the sunset, Bitcoin has allowed corruption to win.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9s332m",
                            "author": "Dont_Say_No_to_Panda",
                            "score": 1,
                            "created_utc": 1653374958.0,
                            "response": "It was always obvious to me that the kleptocrats of the world would flock to Bitcoin first (even before I really dove into Bitcoin.)",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9o8pz6",
                    "author": "mustyoshi",
                    "score": 19,
                    "created_utc": 1653306691.0,
                    "response": "The wealth disparity in crypto is even worse than in fiat though...",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ogdlq",
                            "author": "Harbinger311",
                            "score": 12,
                            "created_utc": 1653311163.0,
                            "response": "More so because access to Bitcoin (intellectual knowledge + digital infrastructure + key management) gates even harder than conventional fiat (possession of a physical piece of paper).  A poor/lesser educated person isn't really going to be learning about Bitcoin while they're trying to make ends meet.  They're trying to make ends meet.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9p3sdi",
                                    "author": "CryptoBehemoth",
                                    "score": -4,
                                    "created_utc": 1653321824.0,
                                    "response": "For now",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9pawpy",
                            "author": "VPNApe",
                            "score": 2,
                            "created_utc": 1653324789.0,
                            "response": "I wouldn't say that. The elite/govt have literally infinite amounts of fiat at their disposal. People like Putin basically have ownership over entire countries which is an amount of wealth that can't even be measured in dollars.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9o95bk",
                    "author": "DrAgaricus",
                    "score": 11,
                    "created_utc": 1653306970.0,
                    "response": "Hmmm the wealthy already own most BTC. If you think developing countries are \"jumping in on it\", just look at the state of BTC adoption in El Salvador... Looks good on paper, but the people just cashed out the free money (in fiat) and are back to square one. Meeting immediate needs usually overshadows potential asymetric bets in developing countries.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9p8oep",
                    "author": "skaag",
                    "score": 3,
                    "created_utc": 1653323866.0,
                    "response": "You need to explain how this redistribution works. It’s not enough to claim it will cause a redistribution of wealth. You also need to explain how those same rich people can’t also just buy a ton of BTC and still benefit from the rising prices.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9p95bv",
                            "author": "MCHappster1",
                            "score": 1,
                            "created_utc": 1653324062.0,
                            "response": "I never claimed the wealth gap would close, I’m suggesting that nation states lose their power over fiat and members of a capitalist society can accumulate wealth and ever so slowly tighten the gap even further. Rich people will always have the upper hand here you are right.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9p9dfz",
                                    "author": "skaag",
                                    "score": 1,
                                    "created_utc": 1653324153.0,
                                    "response": "I’m one of those people who benefited from crypto. Not in a super big way, but big enough for me.\n\nI’m not saying your post is wrong; I’m saying you need to explain to the masses how that’s done.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9o78y7",
                    "author": "BeemanIT",
                    "score": 6,
                    "created_utc": 1653305722.0,
                    "response": "Currency won't matter when the wealthy own all the land and control all the food. People will beg for the CBDC and lab made meat.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9rcwai",
                            "author": "cryptomultimoon",
                            "score": 1,
                            "created_utc": 1653358437.0,
                            "response": "As long as there are property rights for citizens no entity will ever hold all the land.  There will be no reason to hold land you have no use for, in perpetuity.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9or0b7",
                    "author": "Ok_Magician7814",
                    "score": 5,
                    "created_utc": 1653316302.0,
                    "response": "This is hilariously wrong. Rich people don’t just hold all their money in liquid cash… they hold assets like real estate or stocks, totally devoid from inflation or fiat. This will not change even if Bitcoin magically replaces fiat.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9orf63",
                            "author": "MCHappster1",
                            "score": 4,
                            "created_utc": 1653316488.0,
                            "response": "Yes but the rich still have more cash than the poor on average. I was mainly suggesting nations themselves with the power over fiat would be giving up lots of power if they shifted to bitcoin. They’ll have to wait until Bitcoin takes the power from them.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9oap7u",
                    "author": "mattferg222",
                    "score": 10,
                    "created_utc": 1653307952.0,
                    "response": "lol, BTC is mostly held by the top 1%, sorry your libertarian dream isn’t reality",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9olvia",
                            "author": "DatBuridansAss",
                            "score": -12,
                            "created_utc": 1653313918.0,
                            "response": "If you're not libertarian you're authoritarian.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9oto41",
                                    "author": "mattferg222",
                                    "score": 11,
                                    "created_utc": 1653317479.0,
                                    "response": "Hahahaha literally not how it works, but yeah sounds like a libertarian shit take so about right for this sub",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9p7hzb",
                                            "author": "freelee33",
                                            "score": 2,
                                            "created_utc": 1653323374.0,
                                            "response": "I'm curious how do you know it's mostly held by the top 1%?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9q9zsp",
                                                    "author": "mattferg222",
                                                    "score": 1,
                                                    "created_utc": 1653339785.0,
                                                    "response": "The coin distribution per wallet",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9s2x33",
                                                            "author": "Dont_Say_No_to_Panda",
                                                            "score": 0,
                                                            "created_utc": 1653374819.0,
                                                            "response": "Not a libertarian at all but you and I both know there is no way to map the true demographics of those wallets. Many of the 1% you’re referring to are in fact exchanges holding every plebs bags.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9s3210",
                                                                    "author": "mattferg222",
                                                                    "score": 1,
                                                                    "created_utc": 1653374934.0,
                                                                    "response": "Exchange wallets are well known and identified, for the most part.\n\nSo yes, otherwise, a large majority of the coins are held by 1% of the wallets. This is pretty clear to see on-chain.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9s3vux",
                                                                            "author": "Dont_Say_No_to_Panda",
                                                                            "score": 1,
                                                                            "created_utc": 1653375633.0,
                                                                            "response": "From what I understand, some exchanges are known but hardly all (“for the most part.”) I doubt even a majority of the total coins on all exchanges reside in “well known and identified wallets” but I would love to be proved wrong and would welcome evidence to that effect. \n\nAnd furthermore, are you not assuming that all of these same exchanges *only* have well known and identified wallets for all of their holdings? I feel like that is a big assumption. \n\nAlso, there are other groups like miners, central banks, corporations like TSLA, MSTR, SQ etc that are all holding large amounts of coin. \n\nAnd my central point is you cannot know since Bitcoin is pseudonymous so everything we “know” is based on what little some entity chose to divulge or what can be deduced.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i9s4f9w",
                                                                                    "author": "mattferg222",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653376094.0,
                                                                                    "response": "Most of the big ones have been identified. \n\nWhether the wallet is an organisation, a miner etc is irrelevant. The majority of coins are still owned by a few wallets. This is a fact on chain.",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9ouasc",
                    "author": "FutureNotBleak",
                    "score": 2,
                    "created_utc": 1653317756.0,
                    "response": "I approve this message.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9qupkj",
                    "author": "AriSteele87",
                    "score": 2,
                    "created_utc": 1653349603.0,
                    "response": "What some of you don’t seem to realise is that no one will be too late for Bitcoin.\n\nIt’s a superior form of money that doesn’t work any better for you whether you have a million satoshi or a quadrillion.\n\nIn that way, you will be able to store the value of your labour, be you the owner of a skyscraper, or the guy who cleans it, as near perfectly as possible.\n\nIt will not favour the rich. It will not favour the poor. So even if you buy after the boom you’ll still benefit tremendously over the current system.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9rduft",
                            "author": "cryptomultimoon",
                            "score": 2,
                            "created_utc": 1653358893.0,
                            "response": "This thread is giving me a headache.  Wealthy people can buy 99% of Bitcoin, that doesn’t mean that they will be able to keep it.  They will trade this Bitcoin, otherwise they become the lonely dragon sitting on their gold coins.  If they are not producing something valuable, they will lose their Bitcoin.  If they are, they will keep more of it.  If they are providing value, they are trading with people who also benefit from their efforts. \n\nOver time, Bitcoin will accumulate in the hands of the people that help the world the most.  If rich people are buying Bitcoin, they are transferring their wealth out of an irrational system into a rational one.  Everyone wins.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9rdv28",
                            "author": "cryptomultimoon",
                            "score": 1,
                            "created_utc": 1653358902.0,
                            "response": "This thread is giving me a headache.  Wealthy people can buy 99% of Bitcoin, that doesn’t mean that they will be able to keep it.  They will trade this Bitcoin, otherwise they become the lonely dragon sitting on their gold coins.  If they are not producing something valuable, they will lose their Bitcoin.  If they are, they will keep more of it.  If they are providing value, they are trading with people who also benefit from their efforts. \n\nOver time, Bitcoin will accumulate in the hands of the people that help the world the most.  If rich people are buying Bitcoin, they are transferring their wealth out of an irrational system into a rational one.  Everyone wins.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9nxtvj",
                    "author": "Walla_Walla_26",
                    "score": 5,
                    "created_utc": 1653298156.0,
                    "response": "Yes until mostly the wealthy own all the Bitcoin.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9o8nuu",
                            "author": "_skala_",
                            "score": 7,
                            "created_utc": 1653306652.0,
                            "response": "They already do.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9o99jx",
                                    "author": "Walla_Walla_26",
                                    "score": 0,
                                    "created_utc": 1653307047.0,
                                    "response": "Hopefully I have a big enough piece of the pie",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9rd2i4",
                            "author": "cryptomultimoon",
                            "score": 1,
                            "created_utc": 1653358519.0,
                            "response": "Once they own it, how will they keep it?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9sgk5b",
                                    "author": "Walla_Walla_26",
                                    "score": 1,
                                    "created_utc": 1653387206.0,
                                    "response": "The wealthy don’t self custody. They use a custody service with insurance. It’s much less risky for them",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9si4m9",
                                            "author": "cryptomultimoon",
                                            "score": 1,
                                            "created_utc": 1653388489.0,
                                            "response": "I mean, are they going to hoard their Bitcoin?  Or will they trade it?  Spend it?  Invest it? \n\nHow do people create wealth, and once they do, how do they keep it?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9sjr1j",
                                                    "author": "Walla_Walla_26",
                                                    "score": 1,
                                                    "created_utc": 1653389759.0,
                                                    "response": "They will accumulate in down periods and will hold forever. Mostly they use money/asset managers, but I think I’m over my head a little on this one. Any one else know how the wealthy manage their portfolios? Crypto and other assets",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9sldmz",
                                                            "author": "cryptomultimoon",
                                                            "score": 1,
                                                            "created_utc": 1653390938.0,
                                                            "response": "I’m trying to lead you into making a point.  Sorry for being indirect.  If you haven’t read The Bitcoin Standard I highly recommend it.  The fiat system rewards people for acting irrationally, and for establishing corrupt ties to the government.  Bitcoin doesn’t make this impossible, but it does fundamentally change the rules of the financial system in favor of the average person over the wealthy elite. It evens the playing field.  \n\nIn a fiat system corruption and irrational markets is a feature of the system.  It creates bogus rich people and severely punishes poor people or anyone that tries to save their money instead of using it as leverage to borrow more.  Without this mechanism, rich people will not have the same advantages they do today over poorer people.  There will not be near 0% interest rates to borrow Bitcoin and pay it back 10 years in the future, which is what we have today.  Imagine someone wanting to borrow 10 Bitcoin from you today, and will pay you back 10.5 Bitcoin in 10 years.  Nobody will take that deal because we expect Bitcoin will be worth much more in the future.  With fiat, this is what rich people have access to because when a bank loans 10 dollars, they can print 9 more out of thin air.  They are incentivized by the system to continuously loan out more and more money.  But poor people pay 18% on credit cards.  \n\nI can’t recommend more highly that you read The Bitcoin Standard.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9nxvoy",
                    "author": "twoforty_",
                    "score": 2,
                    "created_utc": 1653298204.0,
                    "response": "This is game theory in practice",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9oaoc2",
                    "author": "Constant-Ad9398",
                    "score": 2,
                    "created_utc": 1653307936.0,
                    "response": "Thats one of the things i like most about bitcoin. Most people that's born with a proper trustworthy banking system will be the last to adapt bitcoin, but poor countrys without a banking system will benefit from the bitcoin system in earlier stages",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9p5e51",
                            "author": "Random_Ad",
                            "score": 3,
                            "created_utc": 1653322498.0,
                            "response": "Really, I don’t see that happening. Seems like wealthy nations and the rich already dominate BTC.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9pgmlq",
                                    "author": "Constant-Ad9398",
                                    "score": 2,
                                    "created_utc": 1653327193.0,
                                    "response": "Im more talking about like average joe, they dont see the point of bitcoin because they have the banks to do the virtual transfer of money for them, but poor average joe doesnt even qualify for a bank and would be amazed by having a digital currency, but idk its just a theory i guess",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9o01ha",
                    "author": "ElephantsAreHeavy",
                    "score": 2,
                    "created_utc": 1653300138.0,
                    "response": "Bitcoin is not immune to corruption. Rich entities do not need capital appreciation. They have a totally different risk profile.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9o5e0g",
                    "author": "Zealousideal_Neck78",
                    "score": -5,
                    "created_utc": 1653304427.0,
                    "response": "Poor people are stupid and thus will always be poor.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9o5fk9",
                            "author": "MCHappster1",
                            "score": 6,
                            "created_utc": 1653304458.0,
                            "response": "Really man?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9of81v",
                                    "author": "Thirdlegproduction",
                                    "score": 2,
                                    "created_utc": 1653310553.0,
                                    "response": "Really yes,\n\nResearch was done on farmers who sow a season and then harvest a season so their profits have to last them until the next harvest and they found that towards the end when money was running low the IQ's dropped by 20 points and they concluded that financial worries take up a significant amount of mental energy and people are more likely to take stupid and impulsive decisions. \n\nIt's not that if you're poor you're inherently stupid but poverty lowers IQ.   \nGood thing is that you do not need high IQ levels to make money.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9of58w",
                                    "author": "Ar0war",
                                    "score": -1,
                                    "created_utc": 1653310511.0,
                                    "response": "The thing is \"time\", let me explain myself...\n\nRich people think on years, even decades. Middle class goes month by month. Very poor people think on what to eat next day.\n\nThe rich is not going to lose his position.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9offm1",
                                            "author": "MCHappster1",
                                            "score": -1,
                                            "created_utc": 1653310668.0,
                                            "response": "When you have bitcoin you don't worry about time anymore. Your wealth is forever.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9oalhl",
                                    "author": "outdatedrhombus",
                                    "score": 0,
                                    "created_utc": 1653307887.0,
                                    "response": "The sentiment is an ugly one, but I'd guess that there's a good amount of truth to that statement",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9nvjgy",
                    "author": "koalaposse",
                    "score": 1,
                    "created_utc": 1653296025.0,
                    "response": "Ha. This is a great theory! The wager is on.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ojqq5",
                    "author": "Nickanator8",
                    "score": 1,
                    "created_utc": 1653312881.0,
                    "response": "The wealth gap is going to stay right where it is.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9qijip",
                            "author": "BitcoinUser263895",
                            "score": 1,
                            "created_utc": 1653343697.0,
                            "response": "Almost like distribution of assets follow a Pareto distribution. SHOCKING!!!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9p1frt",
                    "author": "gobirdsss",
                    "score": 1,
                    "created_utc": 1653320833.0,
                    "response": "The wealth gap of Bitcoin is already more extreme than fiat lol",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9piov2",
                    "author": "spajn",
                    "score": 1,
                    "created_utc": 1653328061.0,
                    "response": "You know why there is a wealth gap? Because Intelligence is not fairly distributed among the gene pool my friend. There will always be certain people who kick ass and most people doing average at best.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9o2whs",
                    "author": "dmv1975",
                    "score": -3,
                    "created_utc": 1653302553.0,
                    "response": "What is a rich country? The U.S. certainly isn't. $4.9 trillion in assets and $34.8 trillion in debt, we're $29.9 trillion in the hole.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9og33t",
                            "author": "the_mr_walrus",
                            "score": 1,
                            "created_utc": 1653311011.0,
                            "response": "We are owed money too though, all countries do this and 60% of business in the world is done in US Dollars",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9o8kky",
                    "author": "krush0910",
                    "score": -1,
                    "created_utc": 1653306594.0,
                    "response": "Moreso, technology is equaling the playing field. Corporations will replace expensive work force with cheap, overseas labor. The entire #great resignation and work from home demands are propaganda campaigns, started by the corporations themselves as a way to get rid of expensive/entitled Americans who can be replaced for a fraction of the cost.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ofise",
                    "author": "Thirdlegproduction",
                    "score": 1,
                    "created_utc": 1653310716.0,
                    "response": "It is said that a family's wealth is destroyed by the third generation.\n\nIt's simply because they have been living life on easy mode.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9on6hf",
                    "author": "horsecyack",
                    "score": 1,
                    "created_utc": 1653314541.0,
                    "response": "It will also widen thanks to the stupidity of poor people",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9oqcrn",
                    "author": "Ima_Wreckyou",
                    "score": 1,
                    "created_utc": 1653316005.0,
                    "response": "On the other hand we will also get the Sailor dynasty who will wield more wealth than the biggest countries.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9oqxzw",
                            "author": "MCHappster1",
                            "score": 2,
                            "created_utc": 1653316272.0,
                            "response": "This is scary but we can only hope he stays true to his promise of providing the world with better education.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9oqt0f",
                    "author": "MartinCavallo",
                    "score": 1,
                    "created_utc": 1653316210.0,
                    "response": "The establishment has plenty of moves left, where they’re in a better position to ride the wave than poor/outside ppl.  Hopefully they snooze past more rather than less but not counting on it.\n\nThe real payoff would be forcing them to compete, fail or just pay their bills in a level playing field.  Unfortunately it’s a few stages away.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9oqxwk",
                    "author": "Vv4nd",
                    "score": 1,
                    "created_utc": 1653316271.0,
                    "response": "also dont forget about the guillotines.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9oxlxw",
                    "author": "Infanteater91",
                    "score": 1,
                    "created_utc": 1653319212.0,
                    "response": "How many people own Bitcoin? How many people have fiat?\n\nHow many people have a lot of Bitcoin? How many people have a lot of fiat?\n\nI feel like the answers to these questions are the same.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9oz6ry",
                    "author": "Pleasant_Theme_4355",
                    "score": 1,
                    "created_utc": 1653319881.0,
                    "response": "Necessity is the mother of invention and change!.The countries that are suffering the most economically will be the first to move to a new financial system.That's been the case throughout history.\n\nFor eg the people who will be adopting Starlink first won't be the ones living in the cities with half decent Internet.Its those who are in the middle of nowhere that can't get any Internet.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9p27kn",
                    "author": "tzt1324",
                    "score": 1,
                    "created_utc": 1653321160.0,
                    "response": "Power = natural resources, manpower, education and military power. I am not sure bitcoin actually fits here.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9p386v",
                    "author": "sunilk277",
                    "score": 1,
                    "created_utc": 1653321588.0,
                    "response": "Those who adapt will survive and the rest will shrink",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9pcxet",
                    "author": "UnlixGh0st",
                    "score": 1,
                    "created_utc": 1653325633.0,
                    "response": "Y'know what- I'm going to say it: that's a beautiful dream and it might still be a reality, but right now: The Crypto community was arrogant and was infiltrated. \n\nEither on purpose (which I'd prefer because it means they recognize the power & utility of the project and we can identify, categorize, and eliminate those vectors and people from the ecosystem and combat their attacks) \n\nOr ... out of incompetence, and that's far worse. The people that became involved with Blockchain didn't understand the tech and were ignorant of the ecosystems philosophy and duplicated the same egregious failures they created in the traditional economy. \n\nWhy?\n\nDevBros didn't document shit and if they did: its on github. Good luck with that. What a shit show. \n\nAnd the documents that did get filed, are now missing, deleted, broken links, and/or these projects use the buzzwords I give them:\n\n- Store of Value \n- Gold like Value (where'd that go huh?! Lol.)\n- Utility... (do they even understand what that actually means?)\n\nThey're marketing buzzwords that are approximate in definition to the message & meaning they attempt to convey. I'm not doing it to make fun of them. I say it because we, others and myself included have been trying to guide the knuckleheads. \n\nDon't give up on that dream, but I no longer share it with you:\n\nTime to move forward and on. Good luck & godspeed.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9pu2yt",
                    "author": "OtherDetective",
                    "score": 1,
                    "created_utc": 1653332936.0,
                    "response": "This is their pattern. Short-term gains for the cost of long-term gains.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9qi36e",
                    "author": "BitcoinUser263895",
                    "score": 1,
                    "created_utc": 1653343484.0,
                    "response": "*\"Bitcoin is a get rich scheme only for poor people!!!\"*\n\nPossibly the worst take on Bitcoin a person can possibly have.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9qoji4",
                    "author": "Mediocre_Piccolo8542",
                    "score": 1,
                    "created_utc": 1653346567.0,
                    "response": "I disagree, the big chunk of bitcoin already belongs to some rich countries early adopters and hedge funds. And there are also arrogant rich people in developing countries, it’s not unique for rich countries, the average Joe in rich country can simply get more BTC with average salary which is compounding pretty fast.\n\nThe actual positive effect- poor nations can leapfrog the establishment of functional fiat money and go directly to BTC which will benefit them immensely. Still, not even BTC can solve the huge wealth gap which has developed over centuries, be real.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9r6btq",
                    "author": "Johndrc",
                    "score": 1,
                    "created_utc": 1653355299.0,
                    "response": "Unless your diamond hands.\n\nIts very rare for a poor man to be strong hands..",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9nyoe1",
                    "author": "MF_SPAWN",
                    "score": -1,
                    "created_utc": 1653298945.0,
                    "response": "Until we need to cash out to pay bills. Utility companies don't take BTC I'm afraid.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9oq2o2",
                            "author": "BitcoinIslandPH",
                            "score": 0,
                            "created_utc": 1653315879.0,
                            "response": "That depends entirely on where you are.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9oqwrc",
                    "author": "Marrymechrispratt",
                    "score": 0,
                    "created_utc": 1653316256.0,
                    "response": "I remember my first recession.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9pddae",
                    "author": "black_diamonds2",
                    "score": 0,
                    "created_utc": 1653325824.0,
                    "response": "I’m sorry but you’re wrong. The rich will never lose their grip on the power, and even if they do a different 1% will just take over. It’s been this way forever and it’s not going to change.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9phim7",
                            "author": "AphisteMe",
                            "score": 1,
                            "created_utc": 1653327571.0,
                            "response": "No way there will always be a 1% group of people that are the richest? That's a deep insight /s",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}