{
    "subreddit": "BitcoinBeginners",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "v10srz",
            "title": "software vs hardware wallet",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/v10srz/software_vs_hardware_wallet/",
            "author": "Noobmaster_69_69_69",
            "created_utc": 1653919095.0,
            "score": 13,
            "num_comments": 11,
            "subreddit": "BitcoinBeginners",
            "selftext": "So i am thinking of moving my btc to one of software or hardware wallet, but I'm confused about which one should i use,  are wallet like exodus and atomic wallet are as safe as ledger and trezor and if not why ?",
            "stickied": false,
            "comments": [
                {
                    "id": "iajqj9a",
                    "author": "civilengineer4",
                    "score": 9,
                    "created_utc": 1653920961.0,
                    "response": "They are not as safe. Ledgers and hardware wallets store private keys offline and never touch the internet. Software wallets can be compromised if the computer or phone has malware or is hacked. While it is safe to use a hardware wallet with malware infested computer. It is just very important to write down and keep your passphrase safe, and never input it into a computer or software wallet if you use a hardware wallet. Never take photos of the passphrase. Some hardware wallets can be attached to software wallets and still remain secure with the hardware wallet using that to sign the transactions.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iak2s31",
                    "author": "CoinCorner_Sam",
                    "score": 4,
                    "created_utc": 1653926583.0,
                    "response": "No. Trezor or ledger is much safer than a software wallet. If you own more that a few hundreds if dollars worth of Bitcoin, you should consider to buy one. Always buy directly from the manufacturer and I would prefer Trezor became it has open source code.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iajmqpe",
                    "author": "AutoModerator",
                    "score": 2,
                    "created_utc": 1653919096.0,
                    "response": "WassaWassaWassup! Scam Alert! Scammers are particularly active on this sub. They operate via private messages and private chat. If you receive private messages, be extremely careful. Use the **report** link to report any suspicious private message to Reddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BitcoinBeginners) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iajvqlb",
                    "author": "never-give-up-every1",
                    "score": 2,
                    "created_utc": 1653923403.0,
                    "response": "Most people use ledger nano S but that depends on you what are you willing to buy tho, But I transfer My BTC from Netcoins to Ledger Nano S, Since Ledger is available in Canada and many people also use this.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaktje6",
                    "author": "BTCMachineElf",
                    "score": 1,
                    "created_utc": 1653938597.0,
                    "response": "Do not use a software wallet on your PC without a hardware wallet; the attack vector is too great.\n\nFor software, it is best to use an open-source bitcoin-only phone wallet (BlueWallet, Blockstream Green, Electrum). These are not as safe as hardware wallets, but still relatively safe. To my knowledge there has been no cases of these wallets getting hacked out of phones.\n\nFor hardware, Coldcard is the best. Trezor is good. Ledgers are crap.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ial9jj7",
                            "author": "muskymetal",
                            "score": 1,
                            "created_utc": 1653946218.0,
                            "response": "I’d like to know why you’re saying Ledgers are crap. They’re arguably the most secure hardware wallets out there right now and use microchip technology to guarantee a signature is only computed upon physical pressing of the button",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ials17b",
                                    "author": "sleepdrift3r",
                                    "score": 1,
                                    "created_utc": 1653955627.0,
                                    "response": "Lmao they’re anything but the safest hardware wallets out there. They’re not even airgapped",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ialw7ej",
                    "author": "jvsephii",
                    "score": 1,
                    "created_utc": 1653957764.0,
                    "response": "I personally do a combination of Guarda Wallet + Ledger for a few coins. Guarda's security architecture is great and you have access to a wide range of crypto tools/features inbuilt.\n\n[https://guarda.com/](https://guarda.com/?utm_source=reddit&utm_medium=social&utm_campaign=BitcoinBeginners-comment-ji) , [https://guarda.com/ledger](https://guarda.com/ledger/?utm_source=reddit&utm_medium=social&utm_campaign=BitcoinBeginners-comment-ji)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iakewh3",
                    "author": "CuriousResearcher506",
                    "score": 0,
                    "created_utc": 1653931922.0,
                    "response": "You can check Guarda wallet, and you can also connect  your Ledger Nano S to it. \nGuarda is a non-custodial wallet, you can buy Bitcoin and other assets directly in the wallet, exchange, and hodl safely. \n\nhttps://guarda.com/coins/bitcoin-wallet/\n\nhttps://guarda.com/ledger/",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}