{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "us7p0d",
            "title": "The Bitcoin Standard instead of Gold Standard",
            "url": "https://www.reddit.com/r/Bitcoin/comments/us7p0d/the_bitcoin_standard_instead_of_gold_standard/",
            "author": "raVenwomBat",
            "created_utc": 1652860383.0,
            "score": 12,
            "num_comments": 28,
            "subreddit": "Bitcoin",
            "selftext": "Really compelled by Ammous‘ arguments for the inevitable backing of currencies by Bitcoin. \n\nI still have one big question however:\n\nWhy using Bitcoin over Gold? I‘m not really asking in terms of what would be better for the human race but more in terms of likelihood. \nWhy wouldn’t governments and central banks if pressured enough just go back to a gold standard? Because if they did, i fear for the future of Bitcoin. \n\nI for one am all on the idea of a bitcoin backed economy. This could be the end of so much war and suffering in the world. Such a grand idea…\n\nAnyways, give me your best takes!",
            "stickied": false,
            "comments": [
                {
                    "id": "i91ta1g",
                    "author": "GoingDeezNuts",
                    "score": 11,
                    "created_utc": 1652861284.0,
                    "response": "Bitcoin makes a lot more sense.   Gold is very heavy and expensive to store/protect/transfer across countries.  \n\nGold is Analog in a Digital World.  And I'm a Digital Girl.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i93chlk",
                            "author": "TheGreatGreg81",
                            "score": 1,
                            "created_utc": 1652892362.0,
                            "response": "Cause a States Gold assets need to be transfered on a daily basis, in best case even across borders, i think you might be right",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i91yvzr",
                    "author": "Independent-Snow-129",
                    "score": 6,
                    "created_utc": 1652866543.0,
                    "response": "Easily transferrable and verifiable which make it easy to avoid forever lasting derivative.  Divisible and an immutable ledger.  Bitcoin's attributes and especially halving make it impossible for anyone to buy all the supply and centralize the issuance of coins.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i91v8rg",
                    "author": "vitalyevodin",
                    "score": 8,
                    "created_utc": 1652863124.0,
                    "response": "because they can’t cheat on bitcoin as they did every time on gold\n\nidea with gold was good and was working perfectly until they always ended up in create more gold from nothing, decreasing gold backup or make new coins from old coins with less gold\n\nso bitcoin/gold need for simple people to forget about all this financial lie and stuff and focus on what people want to do by selling your specialization for money that won’t break in few years and listen to your heart instead of fighting with inflation and all hidden cut-off of your saving \n\nBitcoin is a protocol that provides fair rule of a game where there are no beneficiaries of cheating",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i920uzn",
                    "author": "bitusher",
                    "score": 3,
                    "created_utc": 1652868291.0,
                    "response": "Bitcoin has better monetary properties than gold -\n\nhttps://www.reddit.com/r/Bitcoin/comments/urtqrh/dog_sitting_for_my_receptive_uncle_and_left_a/i90008t/\n\nAnother issue is people and countries will start to transition away from gold in the future as a hedge \n \nIn 2026 Psyche will start reporting back to NASA the expected reality that there will a sudden hyper-inflationary spike in the volume of gold being mined in the near future\n\nhttps://www.jpl.nasa.gov/missions/psyche/\n\nSince psyche 16 asteroid represents an example of an asteroid that is a core of an early planet thus metallic and estimated to contain around $700 quintillion dollars of precious metals (gold, platinum, etc..) or 93 billion dollars of precious metals per person.\n\nWhile mining will not start immediately, the markets will start pricing in the expectation of mining and nation states will start to slowly sell their gold reserves if they are wise enough flooding the market with cheap gold.\nNation states will need an alternative asset to hedge against.\n\nOnce (or if) Bitcoin has enough liquidity than nation states will have no choice to hedge in some Bitcoin regardless what they desire. Please look at the historical example of governments using the silver standard competing to a gold standard and what that eventually did to their economies forcing them to switch to the gold standard. A country must at minimum be proportionally hedged in a hard money to survive a speculative attack.\n\nBitcoin with an absolute limit and a planned expected monetary supply is a harder form of money than gold . With gold more demand encourages more mining discovering more gold , with bitcoin more demand only increases the price.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i92pxqq",
                            "author": "dadlif3",
                            "score": 1,
                            "created_utc": 1652883014.0,
                            "response": "I'm not convinced that mining asteroids for gold is as possible or cost efficient as you make it seem. That would be wildly difficult to do in any large enough quantity to impact the supply of precious metals markets.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i92rpwl",
                                    "author": "bitusher",
                                    "score": 2,
                                    "created_utc": 1652883809.0,
                                    "response": "Have you considered the reality that mining these asteroids will occur regardless of the precious metals they contain for military, space colonization, and scientific reasons alone? \n\nHave you considered that a core of a planet contains higher concentrations of all heavy metals including radioactive ones needed for weapons and energy ?\n\nHave you considered that it is unfeasible to keep sending up rockets with materials , oxygen , and fuel and these supplies will need to be gathered outside of earth and it is much easier to send supplies mined from asteroids back down to earth than exporting materials outside of earth?\n\nWhy is NASA so focused on studying this asteroid, why has obama legalized asteroid mining and trump created space force ? NASA has escalated the planned mission to psyche 16 from the original date of arrival of 2030 to 2026 and it launches in a july this year. This is a prospective mission to confirm and claim the asteroid.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i922z0u",
                    "author": "SannySen",
                    "score": 3,
                    "created_utc": 1652870045.0,
                    "response": "What I don't get it why does he think a Bitcoin standard would be any more workable than a gold standard?  He suggests that the gold standard was some laissez faire panacea, but it wasn't.  Central bankers routinely had to work together (aka, cooperate) to make the whole thing work.  It was far from orderly and self executing, it was a complete mess.  Why would a Bitcoin standard be any different?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i923cl0",
                            "author": "Serene-dippity",
                            "score": 2,
                            "created_utc": 1652870348.0,
                            "response": "Simply because there is no need for Central Banking to fulfil this. A nation state only needs to have authorised keyholders - Bitcoin payment settlement and storage functionality handles all the admin out of the box and is incorruptible by any player.  This means no nation is at the mercy of another to store gold and has no need to rely on debt instruments which rules out default.  Storage / trasnport costs are also crazy high for gold",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i91xmal",
                    "author": "MrQ01",
                    "score": 2,
                    "created_utc": 1652865368.0,
                    "response": "To frame the \"future of Bitcoin\" as being reliant on government's usage goes against the purpose of Bitcoin in so many ways that difficult knowing where to start (in explaining why).",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i921s5k",
                    "author": "illegal-illusion258",
                    "score": 2,
                    "created_utc": 1652869082.0,
                    "response": "Could you do some research about why we abandoned the gold standard? I think if you did you would see that it was for many good reasons. Also could you think about how the Is economy would have responded with a gold standard in recent history like in 2008 or in 2020?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i922ovh",
                            "author": "Ralph_Naders_Ghost",
                            "score": 1,
                            "created_utc": 1652869821.0,
                            "response": "https://wtfhappenedin1971.com/",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i926b53",
                                    "author": "illegal-illusion258",
                                    "score": 1,
                                    "created_utc": 1652872506.0,
                                    "response": "You think all of that was caused by switching from the gold standard? Any other possible reasons?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i92b521",
                                            "author": "Ralph_Naders_Ghost",
                                            "score": 1,
                                            "created_utc": 1652875582.0,
                                            "response": "The US didn't go off the gold standard. It was a \"temporary suspension of the convertability of dollars for gold except in amounts and conditions to be in the best interest of the United States\".",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9235ci",
                            "author": "SannySen",
                            "score": 1,
                            "created_utc": 1652870183.0,
                            "response": "We would have dropped the gold standard in 2008 and 2020, just like we did during WWI and the great depression.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i92pfv1",
                    "author": "dadlif3",
                    "score": 2,
                    "created_utc": 1652882791.0,
                    "response": "Gold's problem since the beginning of time is verifying that someone actually has as much gold as they say they do. US is supposed to have other countries gold locked up at Ft knox , but when those countries asked for the gold the US couldn't produce it. \n\nBitcoin makes proof of reserves possible by looking at the blockchain to verify that I have the reserves that I say I have.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i925izh",
                    "author": "Mallardshead",
                    "score": 1,
                    "created_utc": 1652871957.0,
                    "response": "In the second part of this post I explain exactly why gold failed and how \"Don't trust, verify\" came to be bitcoin's motto as it relates to gold:\n\nhttps://www.reddit.com/r/MadMaxi/comments/u5skm7/stanford_universitys_paper_on_proofofstake_makes/?utm_source=share&utm_medium=ios_app&utm_name=iossmf",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i91sedc",
                    "author": "organizedRhyme",
                    "score": 1,
                    "created_utc": 1652860470.0,
                    "response": "i just really feel for people living in this paradigm",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i924gfr",
                    "author": "DashingSir",
                    "score": 1,
                    "created_utc": 1652871185.0,
                    "response": "We aren't getting away from the dollar standard, we are getting away from the CENTRAL BANK STANDARD.\n\nThey have failed many times before, and they will fail again in the next few decades. The only thing different this time is, this time we have better alternatives.\n\nYou're free to trade in Gold or whatever asset you have and another party likes, but there is a reason central bank control prevailed all those other times when currency failed: bad usability and high transaction costs.\n\nWe have work to do to make sure these aren't an obstacle this time.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i92dolm",
                    "author": "NYKNYb",
                    "score": 1,
                    "created_utc": 1652877028.0,
                    "response": "This Breedlove / Plan B video covers the gold question quite extensively.\n\n[https://www.youtube.com/watch?v=JdgZbSRIRjc](https://www.youtube.com/watch?v=JdgZbSRIRjc)\n\n&#x200B;\n\nAlso the most recent Freidman / Ammous podcast but it's a long one\n\nhttps://www.youtube.com/watch?v=gp4U5aH\\_T6A",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i92fn21",
                    "author": "OGeyeschinese",
                    "score": 1,
                    "created_utc": 1652878087.0,
                    "response": "Btc is not acting like a gold standard. It’s moving with the indexes atm. Perhaps in the future when it’s easier to make purchase with coins. Gold is also tangible. People and countries that buy shit loads of the stuff will also buy crypto, if they think it’s a good investment, but only time will tell how gold is affected by digital assets",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i92hwi8",
                    "author": "swgo1",
                    "score": 1,
                    "created_utc": 1652879242.0,
                    "response": "BTC is easier to move, easier to verify, and it's supply is more fixed and stable. If gold went to $100k an ounce people would be digging up corpses for their fillings.....",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i932o7j",
                    "author": "Nada_Lives",
                    "score": 1,
                    "created_utc": 1652888380.0,
                    "response": "Because stablecoins don't work. There must be a guarantor, who always flakes. Always.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i93kbqj",
                    "author": "Leech-64",
                    "score": 1,
                    "created_utc": 1652895514.0,
                    "response": "Now I am a huge proponent of bitcoin, but it does not mean I am against gold. Gold is actually a great currency. Yes it is expensive to transport, but its also quite immortal and doesn't require a network host of people for security.\n\nAt the end of the day, currency is just a place holder, or token, for goods and services. Gold has always filled that need. Fiat on the other hand fails miserably. \n\nIt doesn't matter what currency we use to back the economy, as long as its not fiat.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}