{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "utno5j",
            "title": "SHE HULK ATTORNEY AT LAW Trailer 2022 Marvel",
            "url": "https://youtube.com/watch?v=D1NKsBoUOPU&feature=share",
            "author": "Hasan_Rafat_996",
            "created_utc": 1653030761.0,
            "score": 2,
            "num_comments": 0,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "utnkun",
            "title": "EU officials Take On The Proposed Bitcoin Mining Ban",
            "url": "https://blog.blockmagnates.com/eu-officials-take-on-the-proposed-bitcoin-mining-ban-b1278e200041?source=---------2",
            "author": "waysixyes",
            "created_utc": 1653030348.0,
            "score": 7,
            "num_comments": 2,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9au3yu",
                    "author": "coinfeeds-bot",
                    "score": 1,
                    "created_utc": 1653030921.0,
                    "response": "tldr; Documents on EU officials’ conversations on banning Bitcoin have surfaced. The EU officials had a series of discussions on the ban on Bitcoin trading. All the talks were through a debate on a proposed ban on Proof of Work (PoW) mining. Bitcoin mining consumes 139 terawatt-hours annually.\n\n*This summary is auto generated by a bot and not meant to replace reading the original article. As always, DYOR.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9avswn",
                    "author": "castorfromtheva",
                    "score": 1,
                    "created_utc": 1653032406.0,
                    "response": ">While it’s evident that PoS cryptos are safe from the crackdown in the future, the EU will always go after Bitcoin mining.\n\nSure. They're okay with things they can easily control but hate things out of their manipulation range, especially when it comes to freedom, sovereignty and individual empowerment for the people.\n\nMaybe you haven't already got it but.... EU is China 2.0",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "utnm94",
            "title": "Beware of www.unionbazaar.com trading scam/TheJoshGausdenScam",
            "url": "https://www.reddit.com/r/Bitcoin/comments/utnm94/beware_of_wwwunionbazaarcom_trading/",
            "author": "The_JoshGausden_Scam",
            "created_utc": 1653030522.0,
            "score": 1,
            "num_comments": 1,
            "subreddit": "Bitcoin",
            "selftext": "This is another trading scam website. Please beware. The scammer pretended/copied the account of Josh Gausden. Mr. Josh Gausden is a “finance guy” in instagram with 130k+ followers, and with a twitter account as well. On his bio he listed he was on reuters and yahoonews as well.I checked in Reuters linked and indeed he was mentioned as a young 20-something finance dude and wrote a book too. Impressive right?! The article was done by Mr. Vick Jack and William Schomberg of Reuters, giving Josh a ‘solid background’. So, was pretty confident I am following a credible person. Of course, I was wise enough to do the check if the Reuters article is legit, and it is. Then Josh contacted me on a different instagram account about some finance/trading information. Of course, checked again his first account to verify about the second account because we all know how scammers create other accounts. So, on his Instagram Bio he listed the second instagram account there. Along with the reuters, yahoonews, book link and what-have-you that he’s got. Well, so far everything verified. Decided  reply to the guy, got to talking on whatapp with his “business account” number there. He suggested to sign up on the trading platform www.unionbazaar.com where he said he works/or a part of. Did the signing up and he ended as my personal finance advisor. Long story short, lost a lot and I mean a looooot of money for falling for his b.s. Just making a post here on reddit so no one will fall for it as well. Be very careful![www.unionbazaar.com](www.unionbazaar.com)",
            "stickied": false,
            "comments": [
                {
                    "id": "i9bij8p",
                    "author": "nerdiestnerdballer",
                    "score": 1,
                    "created_utc": 1653048973.0,
                    "response": "I’m sorry you fell victim to what sounds like a scam.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}