{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uqaw7e",
            "title": "A Bitcoin Investment Strategy Involving FASB Accounting Guidance Changes",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uqaw7e/a_bitcoin_investment_strategy_involving_fasb/",
            "author": "PayDre",
            "created_utc": 1652635519.0,
            "score": 3,
            "num_comments": 3,
            "subreddit": "Bitcoin",
            "selftext": "For those that are not aware, under current accounting standards, public companies holding Bitcoin have to report the assets as other intangibles. Other intangibles are subject to impairment losses when a triggering event occurs (price decreases) which creates a negative impact to the profit a loss statement. Other intangibles do not record a gain even if the price increases so holding Bitcoin can only negatively impact the public company holding it. This method of recording it is primarily due to the Financial Accounting Standards Board (FASB) lacking proper guidance specific to the new digital asset technology. I also believe it is a large reason why more companies don’t hold it. \n\nRecently, FASB voted to dedicate time and money in developing new standards specific to companies that hold Bitcoin which could most likely result in those assets being marked to fair value under those new rules. As such, any company that had previously recorded Bitcoin as other intangible and suffered heavy impairment losses would now record a large fair market gain and positive impact on the income statement/balance sheet. I could see this create a surge in stock prices for those companies that has previously written those assets down and now have a large gain in one quarter when that new guidance is adopted. \n\nSo the strategy would be to buy a company like MicroStrategy who is expected to record a large impairment loss for Q2 2022 due to recent price drops and micro strategy has a sell off. Buy the stock with the anticipation that the new rules will require a large fair market gain and large earnings recording. \n\nI know a lot will say, “why don’t you just buy bitcoin directly?”. Well this would be for individuals that have money tied up in retirement assets and don’t want to pay 2% on bitcoin fund fees and want to have exposure.",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uqdl4a",
            "title": "NOOO! Based on a true story smh",
            "url": "https://i.redd.it/f8llipw2zoz81.jpg",
            "author": "EB_In_The_House",
            "created_utc": 1652643157.0,
            "score": 101,
            "num_comments": 11,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uqdjdn",
            "title": "Only opportunities",
            "url": "https://i.redd.it/3xljha8oyoz81.jpg",
            "author": "AggressiveAwareness2",
            "created_utc": 1652643021.0,
            "score": 40,
            "num_comments": 4,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8qcv2v",
                    "author": "txhex",
                    "score": 5,
                    "created_utc": 1652643637.0,
                    "response": "10 years later…..\n\n::buttcoiners chanting::",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}