{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uyhbv5",
            "title": "Crypto Casino",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uyhbv5/crypto_casino/",
            "author": "bitcozon",
            "created_utc": 1653598612.0,
            "score": 1,
            "num_comments": 0,
            "subreddit": "Bitcoin",
            "selftext": "Stake's Daily 💵 $100,000 Race! 🏆\n\nFor every bet placed, sports or casino, you’ll climb up the Daily Race Leaderboard!\n\nTop 5,000 racers every day will recieve prizes, based on leaderboard position!\n\nRegister now 👉  [https://staketr5.com/?c=75a928292f](https://staketr5.com/?c=75a928292f)",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uyhb4k",
            "title": "Make easy money, get more bitcoin!",
            "url": "https://share.socialdm.co/Fatboy615",
            "author": "UnusualLibrarian7480",
            "created_utc": 1653598551.0,
            "score": 0,
            "num_comments": 0,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uyhb1d",
            "title": "Earn $500 daily from Google Translate",
            "url": "https://adkeeps.com/U1X2v",
            "author": "kamel05",
            "created_utc": 1653598544.0,
            "score": 1,
            "num_comments": 0,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uyhc5b",
            "title": "Poor Johnny ! That’s appalling !",
            "url": "https://i.redd.it/1c62pxd7wv191.jpg",
            "author": "Zipski577",
            "created_utc": 1653598634.0,
            "score": 51,
            "num_comments": 43,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "ia4m0ux",
                    "author": "K0rbenKen0bi",
                    "score": 26,
                    "created_utc": 1653607130.0,
                    "response": "Wow shots fired",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia4kh26",
                    "author": "WellPayed",
                    "score": 7,
                    "created_utc": 1653606383.0,
                    "response": "Ew. Thats too big to be from a dog.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia50vc0",
                    "author": "w_savage",
                    "score": 1,
                    "created_utc": 1653614372.0,
                    "response": "Pretty funny,  but I do own a bag",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia4rar7",
                    "author": "-spooky_ghost",
                    "score": 10,
                    "created_utc": 1653609674.0,
                    "response": "Explain to me why ethereum is shit (ignoring the fact it's moving to PoS)",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia4rnrm",
                            "author": "fullooza",
                            "score": 5,
                            "created_utc": 1653609854.0,
                            "response": "Ethereum is a centralized scam that totally revolutionized scams and is the future of pyramid schemes (how many ERC-20 pyramid scamcoins run on top of Ethereum again?) But it would still be a centralized scam even if it was created without the massive 72 million ETH premine. \n\nEthereum started with a 72 million ETH premine, but that doesn't mean people can't make money with it. A lot of people even made money with bitconnect, dogecoin, and shiba inu... So as long as suckers keep buying ETH then its price can keep going up. But institutional investors have no interest in ETH and [this report titled \"An Institutional Investor's Take on Cryptoassets\" details why](https://s3.eu-west-2.amazonaws.com/john-pfeffer/An+Investor's+Take+on+Cryptoassets+v6.pdf). That report even explains that when the fees get too high and things don't go as planned, users will (and are) switch to a different cryptocurrency. You can already see this happening right now with all of the \"ETH killers.\" That report also explains what makes BTC attractive to them.\n\n[Click here and listen to a few minutes of Bitcoin developer Jimmy Song talk about Ethereum and Vitalik.](http://www.youtube.com/watch?v=T89gsJ2MsG8&t=47m24s) \n\nJimmy worked directly with Vitalik from the beginning, back when Vitalik was still working on rootstock for Bitcoin.\n\nOver 99% of altcoins were created to enrich their founders and over 99% of them have no future. None of them are as secure, as decentralized, or launched as fairly as Bitcoin. Satoshi created Bitcoin to allow online payments to be sent directly from one person to another without the trust or permission of anyone else. Bitcoin had no premine, no developer fund, no developer tax, and no leader. Satoshi never sold, made no profit, got no fame for his real identity, removed himself from the project, and he gave a two month heads up about before he launched Bitcoin. Bitcoin is decentralized and trustless with the full nodes in control of the protocol, and it has no leader or company leading it.\n \nCryptocurrency is full of scammers/grifters, ignorance, and people that actually believe the lies because they've been sucked into shitcoin cults. People use altcoins for trading/gambling to increase their Bitcoin stack or even their Ethereum stack if they don't understand Bitcoin and cryptocurrency. Gambling on altcoins can still be very profitable during a bull run, but making a profit is not guaranteed and you can easily lose BTC when gambling on altcoins. \n\nSatoshi took careful steps to make sure that the world would look back and observe that Bitcoin was launched fairly:\n\n* No premine (Satoshi didn’t grant himself any coins)\n\n* Gave a 2 month heads up before launching the network (no sudden release and no mining before release)\n\n* Coins had no value for 1.5 years so they circulated freely (it's not even possible for an altcoin to replicate this)\n\n* Satoshi never cashed out (unlike every altcoin founder in history and I bet it stays that way for eternity)\n\nEthereum launched with 12 million ETH for the developers, and 60 million ETH for sale as an \"initial coin offering\" during the presale. They purposely misled investors by suggesting merely 12 million gifted premine and ignoring the 60 million that they sold. Misleading total supply graphs in their prospectus. This is a serious concern in light of Ripple getting sued by the SEC as being an illegal security which means in due time we should expect them to also go after Ethereum developers and the Ethereum foundation for creating an illegal security, because that's what it is according to the [Howey Test](https://www.investopedia.com/terms/h/howey-test.asp).\n\n[Here is a clip of Joseph Lubin describing how they allowed whales to use multiple fake identities to buy as much ETH as they wanted during the Ethereum presale.](https://i.imgur.com/HpBR7C5.mp4) \"A person can buy with any number of different identities. We may limit the unit size of a single sale to make it easier to disguise. So that nobody scares people with an enormous initial purchase. If you are a whale and you plan on investing several million US dollars worth, then you can do so with with multiple identities.\"\n\nVitalik and many others in the Ethereum space are known scammers. Vitalik is not an idiot and he knew better than to pitch something as ridiculous as quantum mining to investors. Another example is pitching turing completeness as the valuable aspect of ETH, now pivoting away from that and saying it was never about turing completeness but \"rich statefulness.\" \n\n[Gregory Maxwell: “Vitalik Buterin Ran A Quantum Computer Scam”](http://www.newsbtc.com/2016/08/17/gregory-maxwell-vitalik-buterin-ran-quantum-computer-scam/)\n\n[Quantum Computing and Bitcoin with Vitalik Buterin](https://www.youtube.com/watch?v=DkUpZkeqhF4)\n\n[Vitalik’s Quantum Scam](https://medium.com/bitcoinerrorlog/vitaliks-quantum-quest-9e6af6570f23)\n\nThe Ethereum community has endorsed radical changes and pivots, trying to find narrative fit and the Ethereum leadership team is more willing to embrace alternations to the core objective of the protocol in their search for product market fit. They've literally tried world computer, dapps, crowdfunding, NFTs, DeFi, open finance, radical markets, store of value, and more. Ethereum is an aggregator of these narratives, trying each one out over the years in an attempt to seduce people that are uneducated about cryptocurrency. But there is no persistence of a singular narrative when it comes to Ethereum and they are still trying to find product market fit even after all this time.\n\nEthereum is a pointless project that will lead to no efficiency because there is no censorship risk in code execution. What purpose does Ethereum solve if it comes with a horrible trade off of an extremely large attack surface and huge scaling problems? They also advertised immutability and unstoppable contracts that were then immediately reversed with multiple hard forks. \n\nUnlike Ethereum, Bitcoin's inflation rate and maximum supply are clearly defined and they will never change. Ethereum's inflation rate, maximum supply, and final algo are not even defined and people are investing in this. This is insane and it basically amounts to faith in Vitalik and his team. While at the same time newbies are misled into believing that Ethereum is decentralized. Meanwhile, Vitalik has full control over the whole project. Does anybody else here remember the DAO smart contract? Someone found a way to drain ETH and some of Vitalik's buddies lost a ton of ETH, so he rolled back the entire blockchain because Ethereum is centralized, Vitalik is the leader of it, and everyone in the Ethereum community agrees with him, so he can do whatever he wants with Ethereum. He chose to change the name of the real Ethereum blockchain to Ethereum Classic and calls his rolled back blockchain Ethereum. Not long ago ETH miners said they weren't going to follow Vitalik into adding a ponzi style transaction fee burn, so Vitalik, leader of Ethereum, called their consensus a 51% attack and changed the rules. \n\nThe fact that Ethereum has switched over to staking rewards also has serious tax implication in many countries where merely holding your ETH being staked will expose users to legal tax obligations. Exchanges for example must send a 1099-MISC to the IRS on behalf of any American user earning $600 in a year. Proof-of-Stake also makes it so the already rich whales control the network and will be collecting compounding interest to dump on the open market.\n\nEthereum has already failed to scale as expected and so they are creating a whole new blockchain and starting from scratch and I have no expectation that the new Ethereum will be any more successful than the current one. This can only be done because Ethereum is centralized. Ethereum 2 will still be a centralized scamcoin controlled and ran by scammers.  \n\n[Vitalik is already laying the groundwork for some more hype and suggesting a re-brand to Ethereum 3.0!](https://i.imgur.com/mxIzBYK.mp4)\n\nEthereum scam part 1 - [Here we focus on the Ethereum token pre-sale which to anyone with any financial experience, is an obvious sale of an unlicensed unregistered security.](https://www.youtube.com/watch?v=wUUVlatCvp0)\n\nEthereum scam part 2 - [Here we take a look at the value & business proposition of Decentralized Smart Contracts and why it's one of the dumbest ways to make your business more efficient.](https://www.youtube.com/watch?v=mCiHTJRbIf4)\n\nEthereum scam part 3 - [The Ethereum scam part 3.](https://www.youtube.com/watch?v=BgFXqVpGDNg)\n\nhttps://medium.com/startup-grind/i-was-wrong-about-ethereum-804c9a906d36\n\n[Ethereum and Ethereum Classic are Scams and so are the developers that build on them](https://www.youtube.com/watch?v=qxtVLjCxPDU)\n\n\"The Ethereum blockchain growing 85 terabytes per year is totally fine. If you have even one person that just keeps buying like a hundred dollar hard drive like I think once every month then they can store it.\" – Vitalik Buterin\n\nSource: https://i.imgur.com/1FZdLC5.mp4",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia50cyg",
                                    "author": "Nada_Lives",
                                    "score": 1,
                                    "created_utc": 1653614119.0,
                                    "response": "That was massive! Even the tldr is tldr.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "ia4vhpe",
                                    "author": "Dildromeda",
                                    "score": 1,
                                    "created_utc": 1653611719.0,
                                    "response": "Respect",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "ia55u2y",
                                    "author": "Edvardoh",
                                    "score": 1,
                                    "created_utc": 1653616775.0,
                                    "response": "⚡️🧡",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia4e0fl",
                    "author": "ZioTron",
                    "score": 15,
                    "created_utc": 1653603366.0,
                    "response": "Stop behaving like a shitcoiner.  \n\n\nTalk about BTC, don't talk about shitcoins, this is the way.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia4vsjm",
                            "author": "Dildromeda",
                            "score": -5,
                            "created_utc": 1653611869.0,
                            "response": "I think raising awareness of shitcoins is a large part of the whole bitcoin discussion right now.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia4f317",
                    "author": "Rickard403",
                    "score": 11,
                    "created_utc": 1653603852.0,
                    "response": "Of all the coins to rip on you big the biggest threat to BTC. (Im not saying it will overtake or anything so calm down)\n\nDo i smell fear?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia4qrww",
                            "author": "Blimpleton",
                            "score": -4,
                            "created_utc": 1653609417.0,
                            "response": "Eth is a 0 threat.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "ia51pll",
                            "author": "CupformyCosta",
                            "score": 1,
                            "created_utc": 1653614782.0,
                            "response": "And how exactly is Eth a threat to btc?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia55iwc",
                                    "author": "daddy_bitcoins",
                                    "score": 1,
                                    "created_utc": 1653616621.0,
                                    "response": "It's not.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia4pdi2",
                    "author": "LooperGamer",
                    "score": 3,
                    "created_utc": 1653608727.0,
                    "response": "33% of my portfolio 🥲🥲",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia4krkl",
                    "author": "Ernest-Everhard42",
                    "score": 8,
                    "created_utc": 1653606524.0,
                    "response": "Fear is strong in this one.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia43iuw",
                    "author": "wifesdontsuck",
                    "score": 3,
                    "created_utc": 1653598746.0,
                    "response": "😂😂",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia4aqa2",
                    "author": "wkw3",
                    "score": 3,
                    "created_utc": 1653601903.0,
                    "response": "The mother of a million shitcoins.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia4srq7",
                            "author": "Frolicking_Flower",
                            "score": 1,
                            "created_utc": 1653610403.0,
                            "response": "[Ethereum is the mother asshole from which the shitcoins spring](https://bitcoinnews.com/ethereum-is-the-mother-asshole-from-which-the-shitcoins-spring/)",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia4va1v",
                    "author": "YoMammaSoThin",
                    "score": 1,
                    "created_utc": 1653611617.0,
                    "response": "PoS doesn't mean what you think it means. Don't sell your GPU miners.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia4gbhk",
                    "author": "Black_Labs_Matter69",
                    "score": 1,
                    "created_utc": 1653604429.0,
                    "response": "Spit out my tacos fuck lol",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia4aqaa",
                    "author": "TaylorynGreyJoy",
                    "score": 1,
                    "created_utc": 1653601903.0,
                    "response": "🤣",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia4qb5u",
                    "author": "SurferScott",
                    "score": 1,
                    "created_utc": 1653609186.0,
                    "response": "😂",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia4zwoc",
                    "author": "lordalpha01",
                    "score": 1,
                    "created_utc": 1653613896.0,
                    "response": "Be patient, well get paid.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia4ecri",
                    "author": "Farrellfernandez",
                    "score": -7,
                    "created_utc": 1653603520.0,
                    "response": "ETH IS 💩",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia55703",
                    "author": "TK96123",
                    "score": 1,
                    "created_utc": 1653616459.0,
                    "response": "Hey now",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uyhcu2",
            "title": "Running a full node to help the network",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uyhcu2/running_a_full_node_to_help_the_network/",
            "author": "msamuelem",
            "created_utc": 1653598692.0,
            "score": 18,
            "num_comments": 32,
            "subreddit": "Bitcoin",
            "selftext": "quick question for you guys,\n\nI just downloaded bitcoin core on my laptop to assist the network. do I just leave the application open like this? It just looks like nothing is happening just leaving it open.\n\nhttps://preview.redd.it/qinkhiu7wv191.png?width=722&format=png&auto=webp&s=7d2feccc02b9fcbef375b8cc77cc3d88f7bbee41",
            "stickied": false,
            "comments": [
                {
                    "id": "ia46cfe",
                    "author": "OldMercenary",
                    "score": 5,
                    "created_utc": 1653599972.0,
                    "response": "Bottom right you'll see options to right click on and you'll see what connections there are.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia45or4",
                    "author": "Nada_Lives",
                    "score": 2,
                    "created_utc": 1653599684.0,
                    "response": "That's pretty much it. Now open up port 8333. You'll have limited connections until then.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia48b3x",
                            "author": "msamuelem",
                            "score": 1,
                            "created_utc": 1653600839.0,
                            "response": "How do I do this?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia4qbvi",
                                    "author": "NoShip7475",
                                    "score": 3,
                                    "created_utc": 1653609196.0,
                                    "response": "Consult your router info",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "ia64p4v",
                                    "author": "DoctorRV",
                                    "score": 1,
                                    "created_utc": 1653639184.0,
                                    "response": "Waaaauww!!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia472eq",
                    "author": "Jetjones",
                    "score": 2,
                    "created_utc": 1653600285.0,
                    "response": "How much space does it take? I've been thinking about doing it as well.  \nIs it safe to run on my main PC if I plan on using my Trezor along with it?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia4jusb",
                            "author": "DryTechnology5224",
                            "score": 5,
                            "created_utc": 1653606090.0,
                            "response": "Several hundred gigabites.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia46e4j",
                    "author": "SHA256dynasty",
                    "score": -1,
                    "created_utc": 1653599993.0,
                    "response": "the point of running a node isn't help the network. the point of running a node is to help yourself - to validate your own transactions so you don't have to trust a third party service provider to do that for you.\n\nit will \"do something\" when you connect your own wallet to it and use it to send or receive bitcoin. besides that it is just keeping a redundant copy of the blockchain",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia46q32",
                            "author": "Jetjones",
                            "score": 9,
                            "created_utc": 1653600135.0,
                            "response": "Doesn't running a node help further decentralization? You have a say on future updates if someone is trying to push unwanted changes to the network.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia4firv",
                                    "author": "SadIdiot219",
                                    "score": 9,
                                    "created_utc": 1653604056.0,
                                    "response": "It does don’t listen to Sha256dynasty",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "ia49fl4",
                                    "author": "SHA256dynasty",
                                    "score": 6,
                                    "created_utc": 1653601334.0,
                                    "response": "it helps decentralization, in that you are adding one more point of communication and sharing the mempool and blockchain with other nodes.\n\nbut you only \"have a say\" with what you do with your own node, meaning whether you update or not. you don't have any control over whether other nodes update to a new version or not. \n\nthe real benefit of running a node is you are directly participating in bitcoin - you are a \"peer\" in this \"peer-to-peer network.\"  if your node says you received bitcoin, you know it is 100% real because it was validated by your own node. if you are using any wallet that isn't connected to own personal node, then you are always asking and trusting some outside node to confirm and broadcast your transactions. so your cell phone wallet might say you have 1.5 bitcoin, but how do you know it's really there? in all seriousness you don't know it's real, all you know is your phone says some node somewhere says it's real. you can check it against a block explorer, but that's just trusting a website to check against some other node you don't control. the only way you know you actually control any bitcoin for sure, is by validating the transaction yourself on your own node. that's what is meant by \"don't trust, verify\" - you validate every tx yourself.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia4gan8",
                                            "author": "Jetjones",
                                            "score": 2,
                                            "created_utc": 1653604419.0,
                                            "response": "Nodes are the one who decide the future of Bitcoin, I'm not sure what you're talking about. If node operators are well informed (and they should) they will not accept an update that defies the principles of Bitcoin. It's a common misconception that Miners are the one who decide but it's not the case. The whole gang must reach concensus. Running a node 100% gives you a vote.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia4h2zx",
                                                    "author": "SHA256dynasty",
                                                    "score": 6,
                                                    "created_utc": 1653604783.0,
                                                    "response": "i didn't say anything about miners.\n\nwhat i said is you only have power over your own node, which doesn't affect anyone else. you could spin up 100,000 nodes and that won't give you any additional decision power over the network or \"future of bitcoin.\" you are responsible for your own use of your own node and that's that.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "ia4hf6d",
                                                            "author": "Jetjones",
                                                            "score": 1,
                                                            "created_utc": 1653604939.0,
                                                            "response": "... and all nodes who do not update unwanted changes will keep the protocol running as it should. I'm not sure I understand your point. That's the whole point - that Bitcoin will keep going with those who don't care for the new fancy twist that might break it. That's how you vote, by not blindly accepting all major updates.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "ia4n6l5",
                                                                    "author": "senfmeister",
                                                                    "score": 3,
                                                                    "created_utc": 1653607676.0,
                                                                    "response": "You can spin up 100k nodes on AWS with some shitty update, but it doesn't mean those 100k nodes count as votes in favor of it.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "ia4nlkx",
                                                                            "author": "Jetjones",
                                                                            "score": 1,
                                                                            "created_utc": 1653607878.0,
                                                                            "response": "Wouldn't that just mean you start running a new fork of Bitcoin? What am I missing? How does the vote happen then?\n\nEdit: I understand the confusion - I wasn't talking about unused nodes.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "ia4qfv1",
                                    "author": "whitslack",
                                    "score": 3,
                                    "created_utc": 1653609250.0,
                                    "response": "No. I can start a thousand more nodes, but that doesn't increase decentralization. The important governance body in Bitcoin is the *economic* majority, not the *node* majority. If you're running a node but not actually using Bitcoin, then you're not doing shit to further decentralization.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia4s51n",
                                            "author": "Jetjones",
                                            "score": 1,
                                            "created_utc": 1653610091.0,
                                            "response": "Oh okay I understand the confusion. You basically need to have BTC on your node and that's it? Well it makes sense but doesn't remove the fact that nodes are the main decentralization piece, does it?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia4zkaf",
                                                    "author": "Nada_Lives",
                                                    "score": 2,
                                                    "created_utc": 1653613727.0,
                                                    "response": "BTC isn't on the nodes, and it isn't in the wallets either. It's on the blockchain. Well, the abstract concept of a Bitcoin is on the chain, if you want to get technical.\n\nI'd say that Bitcoin as a system is what keeps it decentralized.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "ia487e0",
                            "author": "msamuelem",
                            "score": 4,
                            "created_utc": 1653600793.0,
                            "response": "I thought running a node validates transactions and blocks?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia4c1nj",
                                    "author": "SHA256dynasty",
                                    "score": 6,
                                    "created_utc": 1653602478.0,
                                    "response": "it does validate every transaction in every block. so you are keeping an up-to-date copy of the validated blockchain and sharing it with other nodes. don't get me wrong this IS a good thing to have more nodes on the network.. but unless you are connecting your own wallet to this node and sending/receiving bitcoin with it, all you are going to see is your bitcoin directory growing in size with each block added. once you connect your wallet to your node and use it to send/receive bitcoin, it is truly serving its purpose in broadcasting transactions, and validating transactions that are important *to you*",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "ia5v217",
                            "author": "_scampy",
                            "score": 2,
                            "created_utc": 1653631232.0,
                            "response": "Why are you being downvoted? This is basically correct.\n\nOne can however help the network by running a Lightning node, opening a bunch of channels with the appropriate capacities, and setting routing fees to zero. :p",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia642dq",
                                    "author": "capedra",
                                    "score": 1,
                                    "created_utc": 1653638624.0,
                                    "response": "I stopped on the part of \"opening a bunch of channels\", because to open a channel with some nodes like the one from Phoenix, you need a looot of sats, and if they close your channel someday, you can say goodbye to those funds.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "ia49v1e",
                            "author": "zyuki18",
                            "score": 1,
                            "created_utc": 1653601522.0,
                            "response": "So, is not necessary to Run several Nodes to vê descentralized. So Bitcoiners are misleading us according to your narrative.\n\nAlso Bitcoin standard dont say that my friend about running a node. Of course it helps to verified and to mantain private as well. But off course it helps.\n\n\nYou are answer it was with your polítical eyes..",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia49wt8",
                                    "author": "zyuki18",
                                    "score": 1,
                                    "created_utc": 1653601544.0,
                                    "response": "Be",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "ia4k1cn",
                            "author": "DryTechnology5224",
                            "score": 1,
                            "created_utc": 1653606177.0,
                            "response": "I have bitcoin core, how do i connect my ledger to it?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia4l5n3",
                                    "author": "SHA256dynasty",
                                    "score": 1,
                                    "created_utc": 1653606711.0,
                                    "response": "https://github.com/chris-belcher/electrum-personal-server",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "ia64481",
                                    "author": "bitusher",
                                    "score": 1,
                                    "created_utc": 1653638666.0,
                                    "response": "Here are 2 easy methods :\n\n1) umbrel \n\nhttps://www.youtube.com/watch?v=-I53fAnQ6t8&ab_channel=BTCSessions\n\nhttps://getumbrel.com\n\n--------------------\n\n2) electrum personal server \n\n1) Setup electrum personal server(this is your full node) \n\nhttps://github.com/chris-belcher/electrum-personal-server \n\nhttps://curiosityoverflow.xyz/posts/bitcoin-electrum-wallet/\n\nhttps://www.youtube.com/watch?v=1JMP4NZCC5g\n\nhttps://www.youtube.com/watch?v=4H8gCFrjTYs\n\n2) Use electrum with your nano/trezor and configure electrum to use your personal server you setup above (Full node plus HW wallet) -\n\nhttps://support.ledger.com/hc/en-us/articles/115005161925-Set-up-and-use-Electrum\n\nhttps://wiki.trezor.io/Apps:Electrum\n\nledger nano S/trezor crash courses:\n\nhttps://www.youtube.com/watch?v=YI1OntWB7wc\n\nhttps://www.youtube.com/watch?v=pT1j_kbZBEo\n\nhttps://www.youtube.com/watch?v=i3BIo5Ac_n4\n\n\n\n3) Record your 24 words on paper + record your passphrase on a separate paper you keep private and secure and separate from your hardware wallet and each other. You will both memorize your passphrase and pin + keep it in writing but not with your 24 word backup. Never store passphrase or mnemonic backup digitally. \n\nhttps://support.ledger.com/hc/en-us/articles/115005214529-Advanced-passphrase-security\n\nhttps://wiki.trezor.io/Passphrase\n\nConsider upgrading to metal backup - \n\nhttps://jlopp.github.io/metal-bitcoin-storage-reviews/\n\n4) Withdraw a small test amount of BTC from your exchange to your receive address on your electrum + ledger/trezor wallet. You are going to send BTC to your hidden wallet with the passphrase.\n\n5) Confirm you got the BTC, reset your ledger/trezor , recover it with 24 words + passphrase . Now you have trained yourself how to recover a wallet with backup and 100% confident you did everything right once you see the BTc again in your hidden wallet. \n\n6)\tSend a small amount of BTC to your non hidden wallet(protected by pin) , and the rest to your hidden wallet(protected by passphrase). Done and send more BTC to hidden wallet account addresses.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia43vwb",
                    "author": "Amoci",
                    "score": 1,
                    "created_utc": 1653598899.0,
                    "response": "Yeah buddy! Make it start on boot?",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}