{
    "subreddit": "BitcoinBeginners",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "usxgyj",
            "title": "How day traders earn during long consolidation?",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/usxgyj/how_day_traders_earn_during_long_consolidation/",
            "author": "Top-Butterscotch8892",
            "created_utc": 1652943214.0,
            "score": 0,
            "num_comments": 16,
            "subreddit": "BitcoinBeginners",
            "selftext": "Hello.\nAs above.",
            "stickied": false,
            "comments": [
                {
                    "id": "i96b21x",
                    "author": "DavLithium",
                    "score": 5,
                    "created_utc": 1652943628.0,
                    "response": "Idk i read somewhere that 97% of daytraders lose money. So im guessing the whales and exchanges r the winners since they can literally move the market.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i98wcxw",
                            "author": "Brandammm",
                            "score": 1,
                            "created_utc": 1652992788.0,
                            "response": "i read 80% but sure they have so much money the can have 2131 open calls so who knows ><",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i96p23k",
                    "author": "BTCMachineElf",
                    "score": 3,
                    "created_utc": 1652956026.0,
                    "response": "Trading is folly. Why put your paycheck on the roulette table? Bitcoin is money. Treat it as such, and simply accumulate it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i96evvq",
                    "author": "MrQ01",
                    "score": 3,
                    "created_utc": 1652946945.0,
                    "response": "Theoretically, consolidations are the most ideal times to day trade, because it assumes price is in a predictable channel - and so you buy low (at support level) and sell high (at resistance level).\n\nPrice is unlikely however to be this predictable and formulaic, and so heavy risk management would be required.\n\nIf you want to ask more questions about Bitcoin trading, you're recommended to go to r/bitcointrading.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i96ajwk",
                    "author": "AutoModerator",
                    "score": 2,
                    "created_utc": 1652943214.0,
                    "response": "WassaWassaWassup! Scam Alert! Scammers are particularly active on this sub. They operate via private messages and private chat. If you receive private messages, be extremely careful. Use the **report** link to report any suspicious private message to Reddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BitcoinBeginners) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i96ooip",
                    "author": "igadjeed",
                    "score": 2,
                    "created_utc": 1652955717.0,
                    "response": "Day traders always lose. That's their choice",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i999ylq",
                            "author": "Brettanomyces78",
                            "score": 1,
                            "created_utc": 1652999031.0,
                            "response": "They can't *all* lose.  Someone has to net a profit.  I suppose it all depends on what timeframe you look at.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i96pbsu",
                    "author": "sakiman117",
                    "score": 1,
                    "created_utc": 1652956244.0,
                    "response": "I’ve been day trading for several years now and while it’s easy to make money on volatility with a positive upward trend you are correct in asking about how to make money in a long consolidation period. I’ve been mostly buying HDOL positions lately and moving back into day trading in the rise.  I’m floating in about 24.5% for the year so far but way down on my volume.  So yes, my income is off because I need upward movement to make profits and just haven’t had nearly as many opportunities so hence the HODLing.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i99a0lu",
                    "author": "Brettanomyces78",
                    "score": 1,
                    "created_utc": 1652999058.0,
                    "response": "They either trade the range, or they take time off.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9dct17",
                    "author": "Psychological-Ad212",
                    "score": 1,
                    "created_utc": 1653077387.0,
                    "response": "Well it depends on your capital size, if you can afford 1 btc look at the price fluctuation on the lower time frames, Im not saying there is no opportunities in consolidation if your entry point is good and have logical expectation on selling, also note that exchanges takes trading fees mostly about 0.2 percent per transaction",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9g3zmk",
                    "author": "Senior-Drama-1781",
                    "score": 1,
                    "created_utc": 1653139461.0,
                    "response": "Day trading is very profitable especially in ranging with  clear price action\nAnd everyone saying 80% of.traders lose \nYes they lose bcz they don't know proper risk management \nIv been living of trading since corona!",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}