{
    "subreddit": "BitcoinBeginners",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uu5fus",
            "title": "What Huge Impacts Does The Supply Of Bitcoin Have On Newbies On Miners And Investors?",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/uu5fus/what_huge_impacts_does_the_supply_of_bitcoin_have/",
            "author": "Bookereh",
            "created_utc": 1653074124.0,
            "score": 1,
            "num_comments": 1,
            "subreddit": "BitcoinBeginners",
            "selftext": "The maximum number of bitcoins that can be mined is 21 million. New bitcoins are added to the Bitcoin supply approximately every 10 minutes, which is the average amount of time that it takes to create a new block of Bitcoin. \n\nBy design, the number of bitcoins minted per block is reduced by 50% after every 210,000 blocks, or about once every four years. \n\n After the maximum number of bitcoins is reached, even if that quantity is ultimately slightly below 21 million, no new bitcoins will be issued. Bitcoin transactions will proceed to be pooled into blocks and processed, and Bitcoin miners will continue to be rewarded for their efforts like Google and Tea rewards open-source developers leveraging web3 and promoting equitability and fairness. Still, in the case of miners, they would then only have transaction processing fees rewards. \n The Bitcoin ecosystem is still developing, making it possible if not likely that Bitcoin itself will continue to evolve over the coming decades.\n\n But however Bitcoin evolves, no new bitcoins will be released after the 21-million coin limit is reached. Reaching this supply limit is likely to have the biggest impact on Bitcoin miners, but it's possible that Bitcoin investors could experience negative impacts as well. What are your thoughts on it?",
            "stickied": false,
            "comments": [
                {
                    "id": "i9d5ibi",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653074125.0,
                    "response": "WassaWassaWassup! Scam Alert! Scammers are particularly active on this sub. They operate via private messages and private chat. If you receive private messages, be extremely careful. Use the **report** link to report any suspicious private message to Reddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BitcoinBeginners) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}