{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uf6p0n",
            "title": "The Next bitcoin halving will create millionaires...",
            "url": "https://youtube.com/shorts/XTzE6AOjjXI?feature=share",
            "author": "oldgodemo1",
            "created_utc": 1651306370.0,
            "score": 3,
            "num_comments": 7,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i6s2xc7",
                    "author": "Generationhodl",
                    "score": 8,
                    "created_utc": 1651318900.0,
                    "response": "Easy, put 999k $ into btc and when price will rise just a little bit you are a millionaire thx to bitcoin.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "ujby71",
            "title": "The Benfits of Wallet Vaults (related to covenants and OP_CHECKTEMPLATEVERIFY)",
            "url": "https://www.reddit.com/r/Bitcoin/comments/ujby71/the_benfits_of_wallet_vaults_related_to_covenants/",
            "author": "fresheneesz",
            "created_utc": 1651799393.0,
            "score": 3,
            "num_comments": 22,
            "subreddit": "Bitcoin",
            "selftext": "With the drama over CTV, I have seen several people talk about covenants as if they're a frivolous experimental feature that probably very few people need. I very much disagree, and to expand on that I want to focus on the use case I believe is most important for covenants: wallet vaults.\n\nToday's best-in-class self-custody mechanism is always some kind of multisig wallet setup. Companies like Casa and Unchained Capital have their own systems to help people self-custody with multisig, and I have my own ideas. But multisig wallets are significantly more difficult to set up and manage than a single-key wallet. Transactions require signing with multiple devices, which may be separated by significant distance. Additional considerations are needed, like storing and backing up the wallet configuration in addition to the multiple seeds necessary. \n\nSo what are the benefits of wallet vaults over multisig wallets?\nA wallet vault can approach the ease of use of a hot wallet, while at the same time having better properties than a normal multisig wallet in many important ways.\n\n**Better security:**\n\n* For example, a 3-seed wallet vault will be as secure as a 3-of-5 multisig wallet requiring 5 seeds.\n* Only 1 seed is needed for normal wallet vault unvaultings, meaning your other keys become exposed far less often.\n* You can more easily add additional seeds to your wallet vault than with multisig because doing so doesn't make it harder to spend your money.\n\n**Better redundancy:**\n\n* With a wallet vault, you only lose funds if you lose *all* your seeds, whereas with normal multisig you generally lose funds if you lose half your seeds (eg losing 3 keys will result in loss of funds for a 3-of-5 multisig wallet).\n* A wallet vault can have basically unlimited amount of redundancy without loss of security by adding numerous 3rd party signers as backup signers that are always overridable by your personal keys. Such a thing could make someone's bitcoin basically unlosable. \n\n**Better usability:**\n\n* Because you don't need as many seeds (for the same level of security), you don't need as many secure storage locations so creating and maintaining the wallet is easier.\n* You only need to use 1 seed to spend, so you don't have to potentially travel around to multiple places and sign with multiple devices. \n\nThe sole downside of a wallet vault over normal multisig is that you need something watching the blockchain for transactions from your vault, so that you have time to create a recovery transaction and sign it with your other seeds / signing devices. This is somewhat similar to the concept of a lightning watchtower, except that if a thief tries to steal your funds, you generally have to manually create and sign a recovery transaction. However, this doesn't place much additional burden on the end user.\n\nSo bitcoin in a wallet vault can easily be both harder to lose and harder to steal, while at the same time being easier to use. Wallet vaults are not just a frivolous experimental toy, but are well understood to be an enormous advancement in self-custody. They could help more people self-custody, help people keep a larger fraction of their bitcoin in cold wallets, and generally make holding and using bitcoin substantially safer and easier. \n\nAnd this is only one of the important improvements covenants enable. So please, if you think that covenants aren't important, please read more about wallet vaults. \n\nOP_CHECKTEMPLATEVERIFY enables wallet vaults, and as simple as OP_CTV is, it has numerous important use cases like wallet vaults. Please don't believe the FUD that OP_CTV was born yesterday. OP_CTV has been around for 3 years and has been very well reviewed, tested, discussed, etc etc. Covenants in bitcoin have been discussed since at least 2013. Those talking about OP_CTV being \"potentially dangerous\" and \"rushed\" simply haven't been paying attention to covenants research in the past 9 years. OP_CTV's spec and implementation was finalized **before** taproot. OP_CTV is in basically every way more mature than taproot was when it was activated. \n\nIf you hear influencers talking about how OP_CTV is rushed, please feel free to correct them.",
            "stickied": false,
            "comments": [
                {
                    "id": "i7i1eha",
                    "author": "DesignerAccount",
                    "score": 5,
                    "created_utc": 1651800443.0,
                    "response": "Good discussion, thanks for posting.\n\nWhat is rushed is the implementation and activation method. Bitcoin Core is not merging the change, which by very essence of consensus means it's lacking. How can you claim there's consensus if the reference client devs refuse to merge the change?\n\nSecondly, and I'm not saying this as expert in the matter so take with a pinch of salt, I understand there's various approaches to covenants and the technical review in terms of which approach is best is far from settled. I think this is a pretty important step before we just decide to accept this or that approach.\n\nAll in all, my personal rejection comes from the observation that it doesn't have consensus.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}