{
    "subreddit": "BitcoinBeginners",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uwyzxm",
            "title": "How to keep hopes up when markets keeps going down?",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/uwyzxm/how_to_keep_hopes_up_when_markets_keeps_going_down/",
            "author": "person508800027",
            "created_utc": 1653420838.0,
            "score": 0,
            "num_comments": 7,
            "subreddit": "BitcoinBeginners",
            "selftext": "People keep saying to HODL but I feel like that’s not where the money is at right now. From how I see it, the real money is made IF you are a day trader. Slowly start building your portfolio by taking percentages not holding and hoping. Maybe I’m seeing it the wrong way. I’m in the hole right now because of holding. Yeah trading is riskier but I think I’m going to try that next. I think I’m going in light though because last time I went all in and yeah  im going to have to wait for that to go up lol. Learning my lessons the expensive way 🥲 \n\nI’m trying to keep myself leveled enough to not sell while I’m down. I for sure lose if I take it out right. But if I wait I have an opportunity if it going back up sometime in the future. I just don’t know how to keep my hopes up when all I see is red\n\nBut then again everyone says buy when it’s red and sell when it’s green. But that’s tough when the greens are still not good enough to make up for when you bought in. I see why people give up lol this is taxing in many ways \n\nIm trying to be hopeful but it’s getting harder. How do you guys keep hopes up when your portfolio is down significantly? I was doubling down the other week but then I’m like it’s just going to keep going red so I need to stop",
            "stickied": false,
            "comments": [
                {
                    "id": "i9ugs8a",
                    "author": "BTCMachineElf",
                    "score": 3,
                    "created_utc": 1653421593.0,
                    "response": "You just haven't been in the market long enough. Bitcoin is doing fine. It may be a few years before it moves up, but it also might surprise us and go back up to 60 before the end of the year. All we can be sure of is that bitcoin will almost certainly go up eventually.\n\nIf you trade, you will almost certainly lose, statistically speaking. It was my biggest mistake starting out. I had lost bitcoin and I swore never to do it again, and just started buying. In Jan 2019 the market was just like this,.. long downtrend and then a fat dump to $3.2k. Lots of fear, a lot of people said it was going to $1k. But I bought as much as I could and held it, and still hold 98% of it.\n\nUse this chance to accumulate because bitcoin *will* rise again. It's just a matter of when. DCA strategy never fails in the long run.\n\n&#x200B;\n\n>But then again everyone says buy when it’s red and sell when it’s green\n\nYou are listening to the wrong people. Bitcoiners say buy and hodl. Traders think its foolish, then get rekt, while bitcoiners always win in the long run.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9uhoki",
                            "author": "c3sco799999",
                            "score": 2,
                            "created_utc": 1653421967.0,
                            "response": "This is a great advice.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9uriqn",
                            "author": "person508800027",
                            "score": 1,
                            "created_utc": 1653426126.0,
                            "response": "I’ve only been in for a couple of months so it’s just been going down and I just double down but I guess I’m kinda at my cash limit. Maybe I should start investing  in actual assets instead of these highly risky ones. The stock market isn’t doing so well either though :/ \n\nI guess I’ll keep holding because that’s why I got into it. To hold for the future. But the future doesn’t look like it’s coming because if the world standing. Life is really crazy. I just want this to go up already so i can rest lol",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9uutsb",
                    "author": "igadjeed",
                    "score": 2,
                    "created_utc": 1653427557.0,
                    "response": "I can just hear the violins",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ut7pz",
                    "author": "Mango_Split88",
                    "score": 1,
                    "created_utc": 1653426859.0,
                    "response": "Hodl is a meme bud. Sell into strength on the way up (15% incremental sells dependent on the % you have gained since purchase), then wait until any downtrend starts to reverse before you start buying again. Don’t catch knives and don’t try and time bottoms - just wait for a confirmed reversal.\n\nYea, you’ll miss tops/bottoms but at least you’ll have some profit.\n\nPS appreciate this is kinda irrelevant now. Take it as a learning i guess.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9uezjz",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653420839.0,
                    "response": "WassaWassaWassup! Scam Alert! Scammers are particularly active on this sub. They operate via private messages and private chat. If you receive private messages, be extremely careful. Use the **report** link to report any suspicious private message to Reddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BitcoinBeginners) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9v5q2b",
                    "author": "MrQ01",
                    "score": 1,
                    "created_utc": 1653432398.0,
                    "response": "It's not just HODL... it's also dollar-cost-average (DCA), and seeing a long-term timeframe as your goal for making gain (in fiat terms). If you have conviction in Bitcoin's future prospects then you should be looking forward to the lower prices and getting as much for your buck as you can.\n\n&#x200B;\n\n>But then again everyone says buy when it’s red and sell when it’s green.\n\nI'm pretty sure experienced Bitcoin investors say to DCA and HODL, as what you're describing is swing-trading. Though since you haven't mentioned Bitcoin, you could be referring to other cryptos where the aim really is to make a quick profit.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}