{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "utjm1x",
            "title": "What does the future hold?",
            "url": "https://i.redd.it/cg6vcmj8oj091.jpg",
            "author": "Stack3",
            "created_utc": 1653014825.0,
            "score": 0,
            "num_comments": 1,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9a6uhk",
                    "author": "hi_Joe_joe_mama",
                    "score": 1,
                    "created_utc": 1653015412.0,
                    "response": "69420",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "utjpwe",
            "title": "Satoshi said, \"If you don't believe me or don't get it, I don't have time to try to convince you, sorry.\" This applies to both billionaires that are non-bitcoiners and alt-coiners.",
            "url": "https://www.reddit.com/r/Bitcoin/comments/utjpwe/satoshi_said_if_you_dont_believe_me_or_dont_get/",
            "author": "sgtslaughterTV",
            "created_utc": 1653015204.0,
            "score": 93,
            "num_comments": 33,
            "subreddit": "Bitcoin",
            "selftext": "I don't know what is going through Bill Gates' mind, nor do I care too much with regards to Bitcoin. He is only 25 years younger than Warren Buffett, but he is a billionaire and he isn't one of those people that \"needs\" bitcoin. He has so much money that he could probably find a way send it to North Korea without using bitcoin or cryptocurrency and find a way to conceal it - and if he were to be caught I'm sure he would only get a slap on the wrist.              \n\nWithout lingering on any billionaires in particular, when they reach that status, they have access to financial services that you and I do not. I don't want to put the Winklevoss twins on a pedestal that is any higher or lower than Bill Gates (or vice versa), but I'm pretty sure that both parties can get access to better banking services than 99% of the people who are browsing this sub right now.                \n\nThe kind of way that we hold idols and their remarks towards something is entirely unimportant because it changes nothing. Maybe it's a technology thing. Who knows? I've been buying bitcoin since 2017, but didn't start using uber or uber eats until 2021. Last but not least, I don't see the reason why a billionaire would need bitcoin in this lifetime.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9am3xh",
                    "author": "TheEvilStapler",
                    "score": 14,
                    "created_utc": 1653024697.0,
                    "response": "If not for the tipping of the American empire, billionaires would have been content to leave their wealth in US dollars and live the high life forever. But as with pretty much every apex civilization in history, America is going to go down printing. Its been a broken system since 2008, if not earlier, and now its all starting to unravel. The Winklevos, Elon, Zuckerberg, and Bill Gates all know this, and right now every Government, Billionaire or wannabe Billionaire is needing to decide what they are going to do about a falling power. Some want Gold, and there will be Gold Countries. Some want Bitcoin, and there will be Bitcoin countries. But most at the moment are holding their faith in the US dollar, despite the inflation, and suggest that those seeking alternative are currently crazy. \n\nThe US in particular is strong enough to persist on FIAT alone for some time, but Billionaires lose out in extreme inflation too. As bad as inflation is right now, this is far from over. Inflation moves in waves and right now we are barely around the peak of the first wave. The crash down from here will trigger a response so powerful that inflation will be impossible to control. THAT is the situation that these billionaires are preparing for. We're still in the second quarter of this story, and Bitcoin has just entered the room.\n\nMany of us here agree with the Winklevos, whether we like them or hate them or neither, that Bitcoin is a unique financial instrument and a convenient payment option that may grow to be ubiquitous. We trust the lifeboat ethos of HODLR support and a powerful deep rooted network, the only thing we don't know is what the boat is actually made of, so we need to invest at our own risk.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9avotl",
                            "author": "Alesi42",
                            "score": 3,
                            "created_utc": 1653032302.0,
                            "response": "Love this comment. And I'm start using the word ubiquitous (but in german, ubiquitär).",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9azur3",
                                    "author": "Bitcoin__Hodler",
                                    "score": 2,
                                    "created_utc": 1653036061.0,
                                    "response": "> ubiquitär\n\nhell, that´s even a real germany word which i never heard before.\n\n>„Meine Tante hingegen setzt die ubiquitäre Existenz des Internets und aller in ihm enthaltenen Wunder als gegeben voraus.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9acnb2",
                    "author": "shwirv",
                    "score": 13,
                    "created_utc": 1653018583.0,
                    "response": "I couldn't care less what any one person thinks of crypto. I care what the world thinks of it. And there's certainly evidence it has a lot of support and interest.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9b3gpq",
                            "author": "MuchTemperature6776",
                            "score": 2,
                            "created_utc": 1653039021.0,
                            "response": "Especially when you look out side of the “west”\n\nTons of third world countries etc. have taken notice of the value it holds and are adopting it.\n\nThat’s good enough for me.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9b8g93",
                                    "author": "OtherDetective",
                                    "score": 2,
                                    "created_utc": 1653042972.0,
                                    "response": "And you’ll see that when these small countries adopt Bitcoin, the west only has two options, and only one will work.\n1 - try to suppress adoption with a coup or some other bullshit the USA constantly does\n2 - join the Bitcoin standard",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9b8ubg",
                                            "author": "MuchTemperature6776",
                                            "score": 1,
                                            "created_utc": 1653043270.0,
                                            "response": "They can’t stop it so only the latter will work. I mean China has banned BTC but a large portion of the miners are located there. If China can’t stop something in their own country then nobody can.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9bk77e",
                    "author": "roliasedor",
                    "score": 2,
                    "created_utc": 1653049820.0,
                    "response": "USD billionaire cantillonaires have a vested interest in perpetuating the status quo. Of course they’re going to be publicly opposed to a new monetary technology. Their whole net worth is tied up in the legacy system.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9a9lw1",
                    "author": "arbalest_22",
                    "score": 6,
                    "created_utc": 1653016884.0,
                    "response": "I’m still trying to figure out why anyone cares what he said. The guy is a giant hypocrite. He isn’t worth paying any attention to.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9aa1te",
                            "author": "caploves1019",
                            "score": 1,
                            "created_utc": 1653017127.0,
                            "response": "Examples?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9aafhm",
                                    "author": "arbalest_22",
                                    "score": 8,
                                    "created_utc": 1653017337.0,
                                    "response": "He used to hang out with Epstein, and he’s a fat ass, but he wants to tell other people how to be healthy.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9an41s",
                                            "author": "caploves1019",
                                            "score": 6,
                                            "created_utc": 1653025420.0,
                                            "response": "Oh bill gates, got it. I thought you were referring to Satoshi lol. Real head scratcher for a sec with the pronoun being able to point to multiple people in reference. Cheers",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9b8lz2",
                                                    "author": "MilesPower",
                                                    "score": 0,
                                                    "created_utc": 1653043095.0,
                                                    "response": "I mean, if you want a satoshi hypocrite situation arguably the 1mb block limit.\n\nHe created this amazing, open source - decentralized project but snuck in the blocksize limit and asked people to keep it secret when they discovered it until the patch was deployed.\n\nThat's not particularly open or transparent. I get why he did it but he wasn't infallible.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9btoef",
                                                            "author": "caploves1019",
                                                            "score": 1,
                                                            "created_utc": 1653054198.0,
                                                            "response": "If the block size was increased, every node operator on 1tb SSD would have to upgrade to 2tb within the year and 4tb in the next couple years or \"prune\" which isn't ideal for decentralization or affordable cheap full nodes.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9aws7j",
                    "author": "theNeumannArchitect",
                    "score": 6,
                    "created_utc": 1653033280.0,
                    "response": "\"I don't care what bill gates thinks.\" \n\nProceeds to write three paragraphs about why he doesn’t care and post it on Reddit.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9asjuy",
                    "author": "dlq84",
                    "score": 3,
                    "created_utc": 1653029616.0,
                    "response": "Everyone that's trying to convince people in buttcoin should read this. And bill gates, he's just an old fart pretending to be a good person, and everyone just forgets how nasty he was while running microsoft.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9apchz",
                    "author": "BitcoinUser263895",
                    "score": -1,
                    "created_utc": 1653027093.0,
                    "response": "Hey lets shoe-horn this quote into whatever context we feel once again.\n\n>  he isn't one of those people that \"needs\" bitcoin. He has so much money \n\nSeems you're the one who fails to understand Bitcoin.\n\n> I don't see the reason why a billionaire would need bitcoin in this lifetime.\n\nFinally some self-awareness? ;)",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ar40u",
                            "author": "sgtslaughterTV",
                            "score": 2,
                            "created_utc": 1653028463.0,
                            "response": "Did you read the rest of my post or not? I'm implying that bill could be a part of the illuminati if he isn't already and that he has enough money and power to go through standard financial services (as some people would say, \"The banking cartel\") to as a means to a corrupt end if he so desired. Wasn't there a figure of something like 20-trillion USD of money laundered through banks since 2000 until a couple years ago? Including HSBC laundering for drug cartels?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9ay0f9",
                                    "author": "outdatedrhombus",
                                    "score": 2,
                                    "created_utc": 1653034393.0,
                                    "response": "Ah I was wondering why there was a tinfoil shortage, mystery solved",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9aza8a",
                                    "author": "BitcoinUser263895",
                                    "score": 0,
                                    "created_utc": 1653035548.0,
                                    "response": "lol",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9aw1ue",
                            "author": "Alesi42",
                            "score": 2,
                            "created_utc": 1653032626.0,
                            "response": "With that kind of money, why should bitcoin even be on his radar? Bitcoin is my only true hope to gain financial independence in 20 years for retirement, as an asset with increasing value. He has no reason to invest in bitcoin. You come across cunty, btw.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9az8kr",
                                    "author": "BitcoinUser263895",
                                    "score": -3,
                                    "created_utc": 1653035506.0,
                                    "response": "> With that kind of money, why should bitcoin even be on his radar?\n\nWhy would someone with billions of dollars to manage and protect be interested in Bitcoin?\n\n> Bitcoin is my only true hope to gain financial independence in 20 years for retirement\n\nDude. Buy some shares and shit.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9b61mp",
                                            "author": "Alesi42",
                                            "score": 2,
                                            "created_utc": 1653041055.0,
                                            "response": "How would you invest in shares? Something special or the usual suspects like Amazon, E-Corp etc.?",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9awbse",
                    "author": "SeanyBlaze",
                    "score": 1,
                    "created_utc": 1653032872.0,
                    "response": "Everything is politics. Look at what they do, NOT what they say that they do.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9b1ycp",
                    "author": "JSammut29",
                    "score": 1,
                    "created_utc": 1653037846.0,
                    "response": "I don't want to have the same opinions as bill so that's good.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9b5w4i",
                    "author": "iamjide91",
                    "score": 1,
                    "created_utc": 1653040927.0,
                    "response": "What you said is true. We are in crypto to make wealth. They've made wealth without crypto. They can borrow to and lend from nations if they need to. Things are different for them. \n\nWell said homie.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9bj3yr",
                    "author": "mgsxprt",
                    "score": 1,
                    "created_utc": 1653049269.0,
                    "response": "My guy, the dude is buddy buddy with Warren Buffet. That's all you need to know.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9bnozr",
                            "author": "Oneinterestingthing",
                            "score": 1,
                            "created_utc": 1653051522.0,
                            "response": "And epstein",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9bklmz",
                    "author": "ShibaHook",
                    "score": 1,
                    "created_utc": 1653050020.0,
                    "response": "He really didn’t have time... dude just disappeared... I like to imagine he grew wings and flew off into the sunset.. lol",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9bq097",
                    "author": "salmonbitch88",
                    "score": 1,
                    "created_utc": 1653052586.0,
                    "response": "it sounds like a conspiracy theory, you think and believe that the wealthy people know something that you do not know or think you want to know, but you have no evidence. I do not mean that you are wrong about the fact that they may have special financial rights due to wealth. But what is the benefit, what goes beyond you? you know nothing, so you decide for yourself what it should be. maybe one is just a little burnt out on wealthy people. Nothing new in that and that human. I 100% agree with you on what a wealthy person should USE crypto for. They invest.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9bta2v",
                    "author": "BlockChainR3volution",
                    "score": 1,
                    "created_utc": 1653054025.0,
                    "response": "Yeaaahhh but other billionaires r buying them all up🙄🙄",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}