{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "us8dta",
            "title": "HODL",
            "url": "https://i.redd.it/kkdko22m67091.jpg",
            "author": "marketingonline1979",
            "created_utc": 1652863614.0,
            "score": 3,
            "num_comments": 0,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "us8f5w",
            "title": "Top 5 defi coins to look for in 2022 (Massive Potential)",
            "url": "https://youtube.com/watch?v=sOrBJPYwGLo&feature=share",
            "author": "knowledgepower1192",
            "created_utc": 1652863800.0,
            "score": 0,
            "num_comments": 0,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "us8eye",
            "title": "PSA: DO NOT buy used Trezor (or any hardware wallets)",
            "url": "https://www.reddit.com/r/Bitcoin/comments/us8eye/psa_do_not_buy_used_trezor_or_any_hardware_wallets/",
            "author": "wwwIGAMERSorg",
            "created_utc": 1652863771.0,
            "score": 6,
            "num_comments": 20,
            "subreddit": "Bitcoin",
            "selftext": "I was browsing eBay the other day and was surprised to see so many Trezor listing. I know hardware wallets aren't exactly cheap but buying one from some unknown guy just to save 30 bucks is a very dumb idea",
            "stickied": false,
            "comments": [
                {
                    "id": "i91xz2y",
                    "author": "mariusherea",
                    "score": 18,
                    "created_utc": 1652865693.0,
                    "response": "The title should have been “do not buy trezor from ebay”. No need to panic people.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i927cfk",
                            "author": "ivgur",
                            "score": 2,
                            "created_utc": 1652873211.0,
                            "response": "I guess it’s still accurate cause any hardware that isn’t out from the company manufacturing them is a risk",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i939iuc",
                            "author": "Popular_Bet_2849",
                            "score": 1,
                            "created_utc": 1652891175.0,
                            "response": "Title seems fine saying \"used\". There is more than one place to buy something used.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i93y93a",
                                    "author": "mariusherea",
                                    "score": 1,
                                    "created_utc": 1652901154.0,
                                    "response": "My bad. I missed the word “used”:)",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i91y8rb",
                    "author": "Lockean_Machismo",
                    "score": 9,
                    "created_utc": 1652865946.0,
                    "response": "Devil's advocate, why not?\n\nIf you upgrade the firmware, wouldn't that wipe any malicious code on the device lest it not pass the authentication step and not work with the suite or the website? \n\nI've heard talk of fake Trezors, but isn't that because the whole thing is open source and there are instructions on how to make it everywhere? weren't the fakes all just counterfeit goods and not decoy devices to steal your keys?\n\nHas anyone actually documented buying a used Trezor, updating the firmware and gotten their coins stolen? has anyone been documented buying a counterfeit Trezor and gotten their coins stolen? 99% of the time it just seems like people get phished out of their keys. \n\nI know there could be an secret chip on a fake board that has code to call home with your keys, but would that not be inoperable with the suite as before? That also seems like a hell of a lot of effort considering there's no guarantee a whale will buy the thing and store anything approaching your costs of making bespoke Trezor clones with hidden hardware.\n\nI understand the theoretical risks, but what about the practical? my biggest concern buying off of ebay is that literally anyone would know my address and that I hold the bitcorn.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i921qe2",
                            "author": "MrQ01",
                            "score": 4,
                            "created_utc": 1652869042.0,
                            "response": "Or you could just... give yourself peace of mind by buying from the manufacturer.\n\nI'm pretty certain that *\"what are the chances of that happening\"* are the prelude to anybody who's lost their Bitcoin. Why even run the risk of compromising the whole point of owning a hardware wallet?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i922dic",
                                    "author": "Lockean_Machismo",
                                    "score": 2,
                                    "created_utc": 1652869560.0,
                                    "response": "Sure, if a clean chain of custody is worth about a good meal out on the town, why wouldn't one spend the extra money? but isn't the whole point of open source that you're not even meant to trust, but rather verify, manufacturers? \n\nRegarding absolute risk, has anyone actually been hacked by a fake Trezor, ever? it would be nice to get a clear probability on the chances of getting scammed via this particular vector.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i92jwvd",
                                    "author": "Jezzes",
                                    "score": 2,
                                    "created_utc": 1652880220.0,
                                    "response": "I wish I had bought my ledger from eBay. Ledger stored my home address and email in their database and it got hacked. I checked the haveibeenpwned.com site and it's true. Last year I got a mysterious black envelope in the mail advertising Hex/pulsechain. I am forever freaked out.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i924xjg",
                            "author": "Mallardshead",
                            "score": 1,
                            "created_utc": 1652871541.0,
                            "response": "No, the hardware can be modified so the new software downloads in the memory, but not the memory you'll actually use. There are many other ways, and yes, there are documented cases of modified  hard wallets and criminal rings. Bust besides that, most newbs won't bother downloading the latest software; they'll just plug it in and go about their business. We've all seen the Chinese produce enough passable counterfeit shit to know a fake Trezor is quite easy, and would have one of the highest returns ever from both the hardware sale and bonus stolen coin.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i93xde2",
                                    "author": "Lockean_Machismo",
                                    "score": 1,
                                    "created_utc": 1652900790.0,
                                    "response": ">documented cases of modified hard wallets\n\nSource? is this the Trezor specifically?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i92ujfx",
                    "author": "IIIBryGuyIII",
                    "score": 2,
                    "created_utc": 1652885019.0,
                    "response": "I mean I’m not going to do it when there is brand new unboxed trezors to buy….\n\nBut…\n\nIf it’s only used and actually real…updating firmware and resetting the wallet would remove any malicious anything…\n\nHell reset and waste 4 seed phrases or 45.\n\nA used trezor is not the same as a counterfeit trezor.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i92du8g",
                    "author": "NYKNYb",
                    "score": 1,
                    "created_utc": 1652877114.0,
                    "response": "No shit.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i92k5mq",
                    "author": "Jezzes",
                    "score": 1,
                    "created_utc": 1652880335.0,
                    "response": "Ledger: In June 2020, the hardware crypto wallet manufacturer Ledger suffered a data breach that exposed over 1 million email addresses. The data was initially sold before being dumped publicly in December 2020 and included names, physical addresses and phone numbers. The data was provided to HIBP by Alon Gal, CTO of cybercrime intelligence firm Hudson Rock.\n\nCompromised data: Email addresses, Names, Phone numbers, Physical addresses\nSource - haveibeenpwned.com",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i94yw1q",
                            "author": "deviantgoober",
                            "score": 1,
                            "created_utc": 1652916831.0,
                            "response": "How quick you forget that this also happened to Trezor.... go home.\n\nNeither instance was a reflection of the security of the hardware devices themselves.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i92y525",
                    "author": "Nouranium",
                    "score": 1,
                    "created_utc": 1652886518.0,
                    "response": "TailsOS and electrum on an old USB is free...",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i91w4ml",
                    "author": "Amoci",
                    "score": 1,
                    "created_utc": 1652863974.0,
                    "response": "Tell us where we should be looking, too!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i91xsbq",
                            "author": "MrQ01",
                            "score": 5,
                            "created_utc": 1652865526.0,
                            "response": "Directly from the manufacturer and nowhere else.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i93930a",
                    "author": "WaYYne169",
                    "score": 1,
                    "created_utc": 1652890998.0,
                    "response": "I've also saw some offers. I've written some accounts (mostly resellers which probably don't understand the product) and 4/5 removed their offer after I explained why it's problematic. If you have to much time do the same ;-)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i92s8rv",
                    "author": "DivineRusher",
                    "score": 0,
                    "created_utc": 1652884037.0,
                    "response": "Do not buy any hardware wallet except for direct from manufacture.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i92seia",
                    "author": "coinarmy",
                    "score": 0,
                    "created_utc": 1652884107.0,
                    "response": "generate your own private keys, and do it offline. do not trust software/hardware wallets to generate the keys for you.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}