{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uqrfn4",
            "title": "What is the critical mass for Bitcoin to become the world reserve currency?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uqrfn4/what_is_the_critical_mass_for_bitcoin_to_become/",
            "author": "avoteforfreedom",
            "created_utc": 1652691341.0,
            "score": 2,
            "num_comments": 7,
            "subreddit": "Bitcoin",
            "selftext": "How would you even go about trying to answer such a question? It is not just about the global % of people that own Bitcoin. There is a difference between ownership and everything functioning on Bitcoin. At what point does the scale tip so that it doesn't make any sense to be on anything other than a Bitcoin standard?\n\n&#x200B;\n\nAny insights would be grately appreciated.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8stmpu",
                    "author": "goobar_oz",
                    "score": 1,
                    "created_utc": 1652693264.0,
                    "response": "This is still a pipe dream. Next major milestone would be for BTC to flip gold.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ssqi1",
                    "author": "Dimitris-T",
                    "score": 2,
                    "created_utc": 1652692440.0,
                    "response": "See https://twitter.com/nayibbukele/status/1526029996787216387\n\n“Tomorrow, 32 central banks and 12 financial authorities (44 countries) will meet in El Salvador to discuss financial inclusion, digital economy, banking the unbanked, the #Bitcoin  rollout and its benefits in our country.”",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8sttky",
                            "author": "avoteforfreedom",
                            "score": 1,
                            "created_utc": 1652693442.0,
                            "response": "It was in light of this that got me thinking. National orange pilling under way",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8swfsv",
                                    "author": "Geoknysis",
                                    "score": 1,
                                    "created_utc": 1652695766.0,
                                    "response": "Checkmate!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8svfxz",
                    "author": "DatBuridansAss",
                    "score": 1,
                    "created_utc": 1652694910.0,
                    "response": "Too many powerful geopolitical interests who would stop it from just happening organically. Most of the world's richest people/corps/institutions are invested in and reliant on the dollar system. They can literally print the money for anything they need. They aren't going to give that up for a fair system that would make them play by the same rules as everyone else. Not voluntarily anyway.\n\nSo for the Bitcoin Standard to become a reality, there will have to be a major crisis that shakes up the current system so badly that people are desperate enough to try something else. Could be war, could be something even worse.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8svr8z",
                    "author": "rtheiss",
                    "score": 1,
                    "created_utc": 1652695187.0,
                    "response": "Once reserves became imaginary and we went full fiat, I believe the fuse was lit. It will take time though, probably a generation.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8sw55m",
                    "author": "OGeyeschinese",
                    "score": 1,
                    "created_utc": 1652695511.0,
                    "response": "Lol, will never happen. A lot are speculating that countries will have their own digital currency which could boost btc but it won’t ever be used like that.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}