{
    "subreddit": "BitcoinBeginners",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ule4i8",
            "title": "question about binance",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/ule4i8/question_about_binance/",
            "author": "millustrationsbymatt",
            "created_utc": 1652052858.0,
            "score": 15,
            "num_comments": 17,
            "subreddit": "BitcoinBeginners",
            "selftext": "I have been buying small amounts of btc since the end of last year but have only been using binance to do so.\n\nI've been seeing people on here encouraging people to stay away from binance but not exactly sure why. Is it just because of their high fees or is there something else I'm unaware of.\n\nI'm obviously quite a novice but any info will be helpful.",
            "stickied": false,
            "comments": [
                {
                    "id": "i7uy6xp",
                    "author": "bitusher",
                    "score": 9,
                    "created_utc": 1652054407.0,
                    "response": "Binance should be avoided for these reasons –\n\n1)\tThey have an absurd withdraw fee of 0.0005 BTC where other exchanges have free withdrawals\n\n2) They try and trick/scam users into selling their btc for a coupon token they control with confusing withdrawal options\n\n3) They are being sued right now for fraudulent activity and illegal securities and market manipulation and might become another MtGox\n\n4) Their original site binance.com allowed for little to no verification upfront but they have been and continue to freeze accounts after the fact which is very dishonest behavior\n\n5) Their partner site binance.us has low liquidity compared to the original site but if you are in the USA that's all you can use. The CEO of that site just stepped down\n\n6) many  banks have stopped transfers to them in the UK and other countries due to fraud investigations\n\n7) They are fighting multiple class action lawsuits due to their fraud and illegal securities\nSome examples -\nhttps://www.rosenlegal.com/cases-1839.html\nhttps://www.scribd.com/document/455203877/Lee-et-al-vs-Binance\n\n8) They are mostly dependent into the tether ponzi scheme that will likely implode in the future. Binance, other than tether, holds the biggest USDT reserves thus making it the primary exchange effected when this Ponzi implodes and stopping most of its incoming liquidity. Tether and other stable coins will be increasingly targeted by regulators due to concerns of money laundering and capital flight.\n\n9)\tThey are mostly used to trade shitcoins but with supporting so many sketchy projects that increases ones attack surface from a technical layer because any bug or exploit can lead to loss of funds\n\n10) Binance “smart chain” is run exclusively on their own personal servers thus when the company goes defunct or arrests are made these may stop functioning and all tokens and wallets they control (trust) will have problems \n\n\n\n11) Binance is known to use their leverage tokens and trade against their clients and manipulate the market for their personal gain \n\n\n12) Binance operates without a proper license in multiple countries, more and more news is coming out about regulators in those countries specifically saying that Binance is operating illegally. This means it's easy for governments can make Binance Insolvent placing my funds at risk. Binance is not officially registered in any country and does not pay taxes making them a target for regulators.\n\n\n https://twitter.com/franciskim_co/status/1423658703174082567\nFurther reading on new risks and regulatory concerns -\nhttps://www.reddit.com/r/BitcoinBeginners/comments/p12oz0/best_way_to_dca/h8anlfq/\n\n13) They openly lie about their wallet being open source - https://trustwallet.com/developer/ when it is not open source\n\nhttps://walletscrutiny.com/android/com.wallet.crypto.trustapp/\n\nhttps://walletscrutiny.com/iphone/com.sixdays.trust/\n\nas you cannot test and build the binaries from source. The lie is built upon the ignorance of many that are unaware that almost all software you use is dependent upon some open source repositories/libraries/dependencies but unless we can peer review 100% of the source code and build the binaries from the source we cannot verify if any intentional or unintentional exploits or backdoors exist in the software.\n\nThis means that at best you have a wallet that is slightly better than using a custodian because you have access to the private keys that you could restore your coins in a separate wallet if their full nodes that support this light client is offline but there might be privacy leaks or exploits and backdoors that allow them or outsiders to steal your coins.\n\nWhat is the point in using cryptocurrency if you ultimately need to have faith in a single company or developer ? This undermines many of the security assumptions of cryptocurrencies.\n\n14) Incompetence by leaving 1 billion dollars worth of unconfirmed transactions for more than a year causing huge loses and frozen accounts\n\nhttps://www.coindesk.com/business/2021/11/12/binance-freezes-doge-withdrawals-as-users-report-being-asked-to-return-coins-they-dont-have/\n\nhttps://www.binance.com/en/support/announcement/7602e2790f3c444d8d6ed47d6954bcef",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7vpuxh",
                            "author": "artsi95",
                            "score": 4,
                            "created_utc": 1652068726.0,
                            "response": "What should be used instead?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7wdp6v",
                                    "author": "bitusher",
                                    "score": 3,
                                    "created_utc": 1652087399.0,
                                    "response": "any other exchange listed in the pinned faq",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i7v4tg4",
                    "author": "Fair_Command_9861",
                    "score": 4,
                    "created_utc": 1652057702.0,
                    "response": "I don't think there's anything wrong with binance. I think it's very safe. Compared with other exchanges, it's really a bit expensive. As a cryptocurrency supporter, it's better to give up the investment if you can't afford the fees.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "ukhiod",
            "title": "Where could you buy Bitcoin without KYC?",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/ukhiod/where_could_you_buy_bitcoin_without_kyc/",
            "author": "SwurveMan",
            "created_utc": 1651942716.0,
            "score": 4,
            "num_comments": 21,
            "subreddit": "BitcoinBeginners",
            "selftext": "and preferably low minimum costs?",
            "stickied": false,
            "comments": []
        },
        {
            "id": "ulu44q",
            "title": "If bitcoin wallets are free and open-source, how does the company that created them make money?",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/ulu44q/if_bitcoin_wallets_are_free_and_opensource_how/",
            "author": "PeleMaradona",
            "created_utc": 1652111007.0,
            "score": 53,
            "num_comments": 21,
            "subreddit": "BitcoinBeginners",
            "selftext": "I'm curious to what the business model is for wallets like Electrum or Muun is.\n\nI love the wallets, but are these essentially donations from the creators to the community?",
            "stickied": false,
            "comments": [
                {
                    "id": "i7xm03x",
                    "author": "seg_fault0x0000",
                    "score": 39,
                    "created_utc": 1652111853.0,
                    "response": "i think they're like normal open source projects, they often get donations and sometimes are sponsored by tech companies, like the linux kernel.\n\nthere's also the possibility it's some developer's side projects that got attention from the community",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7ycvk5",
                            "author": "bitgray",
                            "score": 8,
                            "created_utc": 1652122672.0,
                            "response": "Electrum yes, but Muun seems to be taking a cut of lightning fees, nice UI for higher fees.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7xrckt",
                    "author": "RawDick",
                    "score": 28,
                    "created_utc": 1652113980.0,
                    "response": "Altruism in open source world is undefeatable.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7y9y6t",
                            "author": "scuczu",
                            "score": 7,
                            "created_utc": 1652121480.0,
                            "response": "I remember the term \"open source hippie\" from a college class 20 years ago and it stuck with me.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7y5sai",
                    "author": "Successful-Salad4346",
                    "score": 35,
                    "created_utc": 1652119772.0,
                    "response": "Open source projects have ways of making money, but let’s imagine this:\n\nYou are an early adopter with 20,000 bitcoins worth $660,000,000.\n\nYou don’t need to work so you spend your time making bitcoin safer, easier, and help it gain more adoption.\n\nNow because you made it better your 20k bitcoins are worth 5 Billion Dollars.\n\nThat’s better compensation than 99% of the software projects you could be working on.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8043t3",
                    "author": "igadjeed",
                    "score": 4,
                    "created_utc": 1652150347.0,
                    "response": "Electrum is not a company. The developers are volunteers. Send them a donation  \n\nElectrum earns a small fee for integrating the TrustedCoin 2FA service into the wallet app  \n\nSome wallet apps integrate the buy services of Bitcoin exchanges, and earn commissions when users choose the \"Buy Bitcoin\" button",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7y1vjf",
                    "author": "ourielohayon",
                    "score": 15,
                    "created_utc": 1652118181.0,
                    "response": "Good questions with Good answers. \n\nContext: I run ZenGo a  popular crypto wallet\n\nindeed wallets are free and wallets charge no additional fees to send and receive. no money there\n\nbut wallets are primary interfaces to make on chain investments and many wallets will offer services built in operated by 3rd parties: 1, buy crypto. 2. sell. 3. swap 3.earn .4 stake \n\nThere are more ways to make money from a wallet (some will be revealed later) but the important idea is that wallets the primary trusted interfaces to make investment decisions. This is even more true with the rise of web 3.  So you can expect many ways to capture that value\n\nThose are primary revenue makers. Some other wallets charge the price for a hardware and some other wallets will charge additional cost for a multi sig set up (for assisted recovery for example or for additional protection)\n\nThere are more ways to make money from a wallet (some will be revealed later) but the important idea is that wallets a primary trusted interfaces to make investment decisions. This is even more true with the rise of web 3.  So you can expect many ways to capture that value\n\nHope that makes sense",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7xz0tx",
                    "author": "bitusher",
                    "score": 8,
                    "created_utc": 1652117036.0,
                    "response": "Some make their money on value added products \n\nSome are just open source projects that the main developers continue to develop as they are already wealthy from being early bitcoin adopters (mostly bitcoin only wallets)\n\nSome sell you cryptocurrencies within the wallet that they overcharge the end user and take a cut of the profits with a third party \n\nSome have advert feeds within the wallet \n\nSome sell pump and dump securities(premined tokens)",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}