{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uxbunu",
            "title": "My cryptocurrency portfolio",
            "url": "https://v.redd.it/vh128zirok191",
            "author": "Dimmao_meme",
            "created_utc": 1653462964.0,
            "score": 11,
            "num_comments": 4,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9wqs6w",
                    "author": "DmitryMate",
                    "score": 1,
                    "created_utc": 1653463744.0,
                    "response": "All jokes aside. I don't see any way the hamster got into this situation without human help",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9wqxfh",
                            "author": "ivgur",
                            "score": 1,
                            "created_utc": 1653463870.0,
                            "response": "\"influencers\" promoting coins seems like the same thing😂",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9wrfe7",
                            "author": "HungryLikeTheWolf99",
                            "score": 1,
                            "created_utc": 1653464304.0,
                            "response": "Not to mention, /r/donthelpjustfilm",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9wpzbu",
                    "author": "Puzzleface62",
                    "score": 1,
                    "created_utc": 1653463073.0,
                    "response": "At least he finally figured it out.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uxbnqw",
            "title": "Bitcoin in El Salvador - Part 2 with Nayib Bukele — What Bitcoin Did",
            "url": "https://www.whatbitcoindid.com/podcast/bitcoin-in-el-salvador-part-2",
            "author": "mccormack555",
            "created_utc": 1653462135.0,
            "score": 4,
            "num_comments": 1,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9wrko3",
                    "author": "vinceforcalifornia",
                    "score": 1,
                    "created_utc": 1653464433.0,
                    "response": "Was part 1 the June 23 2021 episode?",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uxbthu",
            "title": "Seeing Bitcoin as property",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uxbthu/seeing_bitcoin_as_property/",
            "author": "LuKeNuKuM",
            "created_utc": 1653462827.0,
            "score": 10,
            "num_comments": 10,
            "subreddit": "Bitcoin",
            "selftext": "I've been listening and watching a fair bit of Michael Saylor's interviews and yesterday it really hit home what he was saying about Bitcoin being property; the penny dropped. I'd heard him say it previously but it hadn't truly registered with me. It makes perfect sense and when people talk of 'investing' in BTC this can be confused with investing in stocks and shares and other assets such as gold or real estate.\n\nYou literally own a thing, it's in your hands but you don't have all the crap that comes with it.\n\nIn the case of real estate you don't have to factor in future costs of maintenance or unexpected fees. You don't need insurance like you might for a piece of art or bottles of wine. You don't have high ongoing security costs like you would with gold. You don't have to rely on a bunch of company directors making wise decisions for your investment share to become more valuable. You don't have to worry that your fund manager is picking the right stocks at the right time. \n\nAll these sorts of investments cost you either financially or mentally over time and this is often incalculable and unknown. This will eat away at your investment and is often lost when you're trying to work out the value.\n\nIf you're confident in Bitcoin then you own the perfect property. Everything has a risk but to me is clear that you can dodge all those other risks by holding BTC.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9wqnjo",
                    "author": "CoinCorner_Sam",
                    "score": 6,
                    "created_utc": 1653463635.0,
                    "response": "> In the case of real estate you don't have to factor in future costs of maintenance or unexpected fees.\n\nAlso in the case of real estate, to make it more valuable, you're the one paying for the upgrades. In case of Bitcoin, the success is shared by everyone. If some coder, living in Argentina, Nigeria or Thailand, makes Bitcoin somehow better (new type of wallet, Layer, etc), we all will benefit from it. In case of the upgraded property, it's only its owner.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9wsi2u",
                            "author": "LuKeNuKuM",
                            "score": 1,
                            "created_utc": 1653465261.0,
                            "response": "Good point! Yet another thing I don't need to worry about.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9wq40h",
                    "author": "Into_The_Wilderness1",
                    "score": 5,
                    "created_utc": 1653463181.0,
                    "response": "It's a huge point that is often missed. A security will be treated much differently from property, and the risk you take with the former is possibly harsher regulation, as well as having to rely on a \"company\" to deliver value and drive growth of the project.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9wt2x6",
                            "author": "LuKeNuKuM",
                            "score": 2,
                            "created_utc": 1653465774.0,
                            "response": "That's it, it's out of your hands. Whilst I originally saw bitcoin as an investment I now see it as a perfect way to just save what I've earned. It's a distinction I hadn't really tuned into and even more of a reason to hodl.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9wrfts",
                    "author": "johnathondeaux",
                    "score": 3,
                    "created_utc": 1653464315.0,
                    "response": "It's actually worse than that in the case of real estate and gold, in the UK and presumably in other places, even when you own a home outright, the queen owns the land it is built on and so can seize it for any reason at any time such as what happened during d-day in 1944 when people's homes were used to house troops waiting to cross the channel.\n\nGold can similarly be seized like what happened in the 1910s (correct me if wrong year) in the US when they outlawed owning gold or buying gold.\n\nBTC cannot be seized unless you give away your seed phrase, BTC is the first and the only true property because nobody can sieze it from you unless you allow them to do so.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9wsm6n",
                            "author": "LuKeNuKuM",
                            "score": 3,
                            "created_utc": 1653465365.0,
                            "response": "Yes precisely, I'd forgotten about underlying leases. I didn't realise there was that sort of power to be able to reclaim your own property, scary stuff.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9wsu8e",
                    "author": "Crawlero",
                    "score": 3,
                    "created_utc": 1653465569.0,
                    "response": "Right.  Now ask yourself what the meaning of your life is, knowing your current actions will effect not only your current life, but potentially the lives of your grandchildren.  Are you not worth more than a bag of bones, when the product of your labor and decisions carries forward after you?  Are you still around in some way?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9wtle9",
                            "author": "LuKeNuKuM",
                            "score": 1,
                            "created_utc": 1653466243.0,
                            "response": "To leave something for your descendants is a great aspiration but I think it also relies on the person passing the wisdom down with the treasure. So many people have stories of how some historic fortune in their family was lost to unwise investments, gambling or alcohol. I'm making a note of that! thanks.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9wyv9l",
                    "author": "Mektzer",
                    "score": 1,
                    "created_utc": 1653471040.0,
                    "response": "Many people have been criticizing bitcoin for being digital. \"It's nothing, just digital numbers, It has no tangible value.\" They did the same with the internet at the time. One day they will realize that bitcoin being digital is its biggest strenght.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}