{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uz295s",
            "title": "Fiat is muggle money. Bitcoin is for wizards.",
            "url": "https://i.redd.it/mwmgfpmwq1291.png",
            "author": "c_games_official",
            "created_utc": 1653669584.0,
            "score": 56,
            "num_comments": 14,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "ia7n5td",
                    "author": "c_games_official",
                    "score": 4,
                    "created_utc": 1653669756.0,
                    "response": "Source: American Dad S03E03 Dope & Faith\n\nRoger tricks Steve into thinking he got into Hogwarts when he really joined a gang of drug dealers. This line from the show always resonated with me, and I've been calling USD \"muggle money\" for years now",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia8txn3",
                    "author": "TheEnglishPhysitian",
                    "score": 1,
                    "created_utc": 1653688817.0,
                    "response": "The value of crypto really is what the majority dictates. Unfortunately that is what is heavily manipulated by the big boys. I just want to run an animal sanctuary in a hot country. That is what I would do with unlimited wealth.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia9pasz",
                    "author": "SuspiciousStable9649",
                    "score": 1,
                    "created_utc": 1653705018.0,
                    "response": "You should read The Wheel of Time.  Bitcoin is like saidar, fiat is like saidin.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia85jcp",
                    "author": "No_Painting_9479",
                    "score": -2,
                    "created_utc": 1653677555.0,
                    "response": "The biggest problem with btc is that it’s an appreciating asset. Most people are not incentivized to make transactions with it to buy or sell goods. It’s a great investment, but not good as legitimate currency.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia8izzv",
                            "author": "c_games_official",
                            "score": 5,
                            "created_utc": 1653683623.0,
                            "response": "Gold is an appreciating asset as well. Many people still used it in the old days (gold coins) to buy or sell goods. The only difference is that they cared about the quality of the goods since they are spending an 'appreciating asset' to acquire it. Imagine what a society like that today would look like. A lot less useless crap on the market thats for sure (such as phones that fall into obsolescence after only a year)",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia8xx4w",
                                    "author": "coriolisFX",
                                    "score": 1,
                                    "created_utc": 1653690763.0,
                                    "response": "Gold _may_ appreciate.  But it's a commodity and is not a productive asset.  Same as bitcoin.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "ia86hpo",
                            "author": "sangderenard",
                            "score": 2,
                            "created_utc": 1653677985.0,
                            "response": "can someone explain to me, a peon at the bottom of society, why I should care if people are not incentivized to spend, and the economy contracts?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia8j7tp",
                                    "author": "c_games_official",
                                    "score": 3,
                                    "created_utc": 1653683721.0,
                                    "response": "The only people that are want folks to be motivated to spend are the ones that are profiting from it, i.e. manufacturers of useless garbage (central bankers, influencers, China)",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "ia8ccc2",
                            "author": "jmicsmith",
                            "score": 2,
                            "created_utc": 1653680600.0,
                            "response": "That is correct while you hold fiat, since fiat is a depreciating asset, it makes sense to get rid of it first.\n\nHowever, it doesn't make sense to hold fiat.  So when we're able to convert any fiat immediately to bitcoin, we won't have fiat.  We'll then have to spend bitcoin since it'll be all we have.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "ia8h3nd",
                            "author": "laxn397",
                            "score": 2,
                            "created_utc": 1653682756.0,
                            "response": "People will ALWAYs have incentive to spend.\n\nDoubt anyone is going to starve just to hold some BTC.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "uz242k",
            "title": "Does running a full node help against a 51% attack?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uz242k/does_running_a_full_node_help_against_a_51_attack/",
            "author": "msamuelem",
            "created_utc": 1653669188.0,
            "score": 12,
            "num_comments": 21,
            "subreddit": "Bitcoin",
            "selftext": "I made a post yesterday about how I just downloaded Bitcoin Core on my laptop to help assist the network and if I should just leave the application open to do so.\n\nThere was alot of confusion about wether running a node actually adds to the decentralization of the network in the comments and I am so confused. \n\nAll I do is buy Bitcoin and send it to my ledger. I buy and hodl Bitcoin. I don't use it to buy anything. I just wanted to run a node to assist the network and that's it. \n\nIf someone can explain to me if running a node actually helps against a 51% attack and if it doesn't, why I should run one if my goal is to just buy and Hodl Bitcoin forever and send it to cold storage. \n\nThank you",
            "stickied": false,
            "comments": [
                {
                    "id": "ia7ryiz",
                    "author": "Ima_Wreckyou",
                    "score": 11,
                    "created_utc": 1653671727.0,
                    "response": "Well it's complicated\n\nIt doesn't help against a 51% attack because that is about hash power. Your node isn't mining, so you don't add any hash power.\n\nIf you just run the node it will not do much, except you have a copy of the blockchain on your computer. However, it gives you first class access to the Bitcoin network. You are essentially part of the network, and if you use your node to send transactions instead of ledger's node then you add to decentralization.\n\nApart from that it adds more privacy to your transactions, because you don't need to give your xpub to ledger. The node will also ensure that it enforces the rules for you. If there ever should be another situation where someone wants to force a hard fork you don't have to worry on what side the wallet provider whose node you used is on, because you have your own node.\n\nSo if you use your node you add in two important ways to decentralization. You use Bitcoin in the decentralized fashion it was intended to be used, and you help make sure the rules can't be changed by making you independent from people who could decide such things for you.\n\nhttps://github.com/cryptoadvance/specter-desktop is a nice frontend for bitcoin core if you want to use your ledger directly with your node.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia8d9w2",
                    "author": "igadjeed",
                    "score": 7,
                    "created_utc": 1653681020.0,
                    "response": "The short version of the complicated answer is that nodes are able to resolve a tied mining race in favor of the longest chain, but a 51% attack allows the attacking miner to forge a tied mining race. The node network follows the longest chain, whether the tied mining race was genuine or forced  \n\n\"Attack\" is a matter of human opinion. A node doesn't have an opinion. It follows the same rules for every block  \n\nWhy run a node? If you run your own node, you can trust your node's copy of the blockchain. Otherwise, you have to trust some stranger's node",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia7u4n9",
                    "author": "savinelli_smoker",
                    "score": 3,
                    "created_utc": 1653672633.0,
                    "response": "From what I can see there are two levels of “protecting the network” here. Running a node, IMHO, helps at the highest level, namely the protocol level. This is when the attacks are on the bitcoin protocol, the fundamental characteristics of bitcoin: the 21m cap, the block size, etc… in other words at the constitutional level. Like in 2017 during the b-cash hard fork, and btc node owners, by sticking to existing software (and refuse to “upgrade” to the newer version or acknowledge the bigger blocks) helped maintained the bitcoin protocol and fended off an almost fatal attack. This is arguably the most important form of protection and our nodes are helping here (just make sure we don’t blindly update our software without first knowing what’s the “upgrade”… it’s ok to stick to the old version if unsure)\n\nThe lower level would be on the individual transaction/ block level. This is less about the fundamental characteristics of bitcoin and more on double spending a specific transaction, or DDoS attack by mining empty block, etc, this is where the 51% attack comes in. If someone somehow spends billions of dollars quietly accumulate hashing rigs and perform 51% attack on the network, from the non-mining nodes it seems there isn’t a whole lot we could do directly. The defence needs to come from the hash arms race. If that happens we can expect all the honest mining rigs would spin up to top speeds and new ASICS will be urgently deployed in the hope of beating the attacker.\n\nI guess if the 51% attacking miners are known, the non mining nodes could be configured (just my guess) to reject any transaction coming from the hostile miners… rendering their hash rates useless… would be interesting to find out how feasible that is… but somehow we need to be able to identify the hostile miners which is probably not easy. The transactions from the 51% attacks are still valid bitcoin txs because they DO follow the bitcoin protocol. The most direct way to prevent 51% attack is to beef up the honest hash rate (which is what bitcoin excels at, nothing comes remotely close to btc hash rates and we call bitcoin the worlds biggest computer network for a good reason)\n\nJust my 2 sats.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia8t0wy",
                    "author": "mbrochh",
                    "score": 3,
                    "created_utc": 1653688378.0,
                    "response": "No. It helps against greedy corps trying to push features into bitcoin that you don't want to be in there. And it only helps if you actually use your own node to sign your own transactions (vs for example just buying a Trezor and trusting their web interface and node).\n\nYou may want to read the short book \"The Blocksize Wars\".",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia7srdd",
                    "author": "ZICRON_ULTRA",
                    "score": 1,
                    "created_utc": 1653672059.0,
                    "response": "No.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia7ubp2",
                    "author": "superboget",
                    "score": 1,
                    "created_utc": 1653672714.0,
                    "response": "No. Mining does.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia7mkq7",
                    "author": "caploves1019",
                    "score": 0,
                    "created_utc": 1653669515.0,
                    "response": "Simple answer is yes if you're just running Bitcoin core and not going through any Tor or VPN and also don't prune, you're an open node others can peer to; a full copy of the Blockchain future users can sync with. Yes this helps decentralization.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia7mwyr",
                            "author": "caploves1019",
                            "score": 3,
                            "created_utc": 1653669654.0,
                            "response": "Longer answer gets into privacy, Umbrel node and other prepackaged nodes being behind Tor and VPN walls (listening nodes help the user of them but not the network as a whole in the way you're referring to, helpful indeed but not the way you are interested in).",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia7u2yi",
                                    "author": "laxn397",
                                    "score": 1,
                                    "created_utc": 1653672613.0,
                                    "response": "Would you suggest running two nodes then? One for privacy and one to help decentralization.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia8n2z4",
                                            "author": "senfmeister",
                                            "score": 1,
                                            "created_utc": 1653685527.0,
                                            "response": "Just running your own node for your own needs helps the network as much as the network can benefit from it.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "ia7ttf5",
                            "author": "TheGreatMuffin",
                            "score": 6,
                            "created_utc": 1653672502.0,
                            "response": "> Simple answer is yes\n\nThe simple answer is no, a full node doesn't help against a 51% attack.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia8oiek",
                                    "author": "caploves1019",
                                    "score": 2,
                                    "created_utc": 1653686212.0,
                                    "response": "We've already seen miners don't control the network. The mining hashrate is negligible if node operators reject the submissions. So, yeah, more nodes hosting proper Bitcoin blockchain validating transactions the miners present absolutely helps...\n\nHe who controls the nodes controls the future Bitcoin.\n\nhttps://youtu.be/XVFDXF88EMQ",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iac2dbf",
                                            "author": "pwuille",
                                            "score": 3,
                                            "created_utc": 1653759490.0,
                                            "response": "Nodes are definitely useful in keeping miners honest, but that doesn't mean they are relevant in protecting against a hashrate majority attack. Bitcoin, and by extension your honestly-operated full node, should and will consider the most-work valid chain to be the correct one.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "iacvx2o",
                                            "author": "coinjaf",
                                            "score": 2,
                                            "created_utc": 1653773663.0,
                                            "response": "> He who controls the nodes controls the future Bitcoin.\n\nBitcoin only has a future if no one \"he\" controls the nodes.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iacwqjk",
                                                    "author": "caploves1019",
                                                    "score": 1,
                                                    "created_utc": 1653774019.0,
                                                    "response": "Agreed, so every holder should be running a full node ☝️😎",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "iacvkms",
                            "author": "coinjaf",
                            "score": 1,
                            "created_utc": 1653773511.0,
                            "response": "Nodes on Tor can also be peered to.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia7o45m",
                    "author": "c_games_official",
                    "score": 0,
                    "created_utc": 1653670145.0,
                    "response": "Depends on the type of 51% attack. Running a node definitely protects against any double spends, since your node contributes to the validation of every transaction. \n\nHowever a 51% attack could also mean preventing/censoring certain transactions in the mempool since its the miners who choose which transactions to include and the non-miner full nodes are oblivious to it.\n\nIf that started happening at a larger scale, the 'honest' nodes could collectively stop broadcasting nodes from 'dishonest' miners. But in reality not sure if honest nodes would care enough to.\n\nIMHO I still think its a noble cause to run a full node. I have an umbrel myself that I dont store any money on, I just watch the heart beat every 10 minutes and sleep well knowing that I am helping (in a small way) to secure the network.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia7tpym",
                            "author": "TheGreatMuffin",
                            "score": 4,
                            "created_utc": 1653672461.0,
                            "response": "> However a 51% attack could also mean preventing/censoring certain transactions in the mempool since its the miners who choose which transactions to include and the non-miner full nodes are oblivious to it.  \n\nThis is not what a 51% attack usually means, and there is no \"THE mempool\", every node has its individual, internal mempool which might have slight variations to the internal mempools of other nodes.  \n\n> If that started happening at a larger scale, the 'honest' nodes could collectively stop broadcasting nodes from 'dishonest' miners.\n\nWut, no, you cannot know what the nodes of \"dishonest\" miners are and you can't stop broadcasting transactions to them. Miners will always have the choice of which transactions to include or not to include in their blocks, that's inherent in how bitcoin works and your node won't help you with censorship attacks.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia7m1cy",
                    "author": "Joey_breeze954",
                    "score": 1,
                    "created_utc": 1653669293.0,
                    "response": "Idk about a full node.. but you could be on too something here. Very impressed",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaehzdw",
                    "author": "Simple_List_3092",
                    "score": 1,
                    "created_utc": 1653808297.0,
                    "response": "no",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia7uhrb",
                    "author": "uncontrollableop",
                    "score": 0,
                    "created_utc": 1653672783.0,
                    "response": "it could if there were ever an attack (which there won't be).",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}