{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "us52cw",
            "title": "Wasabi Wallet has become a surveillance instrument- here’s how to use the wallet without blacklists/censorship/surveillance etc",
            "url": "https://www.reddit.com/r/Bitcoin/comments/us52cw/wasabi_wallet_has_become_a_surveillance/",
            "author": "under_dnuorg",
            "created_utc": 1652849413.0,
            "score": 47,
            "num_comments": 21,
            "subreddit": "Bitcoin",
            "selftext": "Earlier this year (March 3rd) Wasabi Wallet announced that \"the zkSnacks coordinator will start refusing certain utxos from registering to conjoins\". zkSnacks Ltd is the company running Wasabi Wallet. Meaning Wasabi Wallet will be analyzing its users bitcoin inputs and deciding- on undisclosed criteria/sanctions/blacklists- if they accept your bitcoin or not. This means that coinjoining with wasabiwallet has become like dealing with any other big Bitcoin company/exchange in the space complying with KYC/AML/sanctions- and everything that comes with blacklisting. This is the beginning of a slippery slope which can not be tolerated by any Bitcoiner who understands its consequences.\n\nChanging the following settings enables use of a different- and proper anonymous- coordinator. (SAKE) Making it possible to use Wasabi without any of the blacklists/censorship/surveillance etc.\n\n1- Open Wasabi + file-open-config file\n\n2- Change- *MainNetBackendUriV3: http://wasabiukrxmkdgveSkynjztuovbg43uxcbcxn6y2okcrsg7gb6jdmbad.onion/*\n\nTo- *MainNetBackendUriv3: http://sakeazyzcx6gcmyv7ijduvogwpieewsk6mrjzgxciu2x2sfsyij6ogid.onion/*\n\n3- Change- *MainNetFallbackBackendUri: https://wasabiwallet.io/*\n\nTo- *MainNetFallbackBackendUri: http://sakeazyzex6gcmyv7ijduvogwpieewsk6mrjzgxciu2x2sfsyij6ogid.onion/*\n\n4- Restart Wasabi",
            "stickied": false,
            "comments": [
                {
                    "id": "i91k385",
                    "author": "steuer2teuer",
                    "score": 9,
                    "created_utc": 1652853488.0,
                    "response": "How can we trust this other coordinator? Can you tell more about it?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i91ks4p",
                            "author": "under_dnuorg",
                            "score": 4,
                            "created_utc": 1652854016.0,
                            "response": "Considering Wasabi is open source it’s not Wasabi that’s the problem its the zkSnacks run coordinator- which is compromised. SAKE is just a viable alternative anonymous coordinator- users can also spin up a coordinator.\n\nTo further answer your question- you should not trust them, nor anyone. In regards to Bitcoin operating inside an open source and trust-less system is imperative.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i92wc8d",
                                    "author": "steuer2teuer",
                                    "score": 1,
                                    "created_utc": 1652885773.0,
                                    "response": "Thanks for further explaining, and you're right about the trust aspect of things.\n\nAre there any downsides to using SAKE instead of zkSnack's coordinator? Does it only coordinate with other SAKE users? Sorry, i'm very unfamiliar with how coordinators work.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i91nlud",
                    "author": "5liveR",
                    "score": 5,
                    "created_utc": 1652856291.0,
                    "response": "I don't use their Cj anymore. Do they also surveil the wallets too ? I use the Coldcard through their client, thats why",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i91rxww",
                            "author": "Quantris",
                            "score": 7,
                            "created_utc": 1652860051.0,
                            "response": "No, this issue is only about the coordinator which they run for coinjoins. Normal wallet functionality isn't related to that.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i92cg2p",
                                    "author": "5liveR",
                                    "score": 3,
                                    "created_utc": 1652876342.0,
                                    "response": "thanks",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i91hw7i",
                    "author": "mrarjonny",
                    "score": 7,
                    "created_utc": 1652851846.0,
                    "response": "Use Sparrow",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i91yvl0",
                            "author": "k0b13",
                            "score": 3,
                            "created_utc": 1652866533.0,
                            "response": "How is it different from Samurai when it comes to whirlpool?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i92dsaq",
                                    "author": "Squigglywiggler",
                                    "score": 2,
                                    "created_utc": 1652877085.0,
                                    "response": "It uses samurai’s whirlpool I believe",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i92wvg8",
                                            "author": "mrarjonny",
                                            "score": 1,
                                            "created_utc": 1652885996.0,
                                            "response": "Ya exactly you use Sparrow to connect with Samourai Whirlpool.\n\nWasabi can be demixed it reuses addresses.  This is only one of the reasons to not to use it at all.\n\nhttps://youtu.be/alcLdBsoDDg",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i91wrn8",
                    "author": "davidcwilliams",
                    "score": 3,
                    "created_utc": 1652864569.0,
                    "response": "> slippery slop\n\nLike an Eminem lyric.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i91wufb",
                            "author": "under_dnuorg",
                            "score": 1,
                            "created_utc": 1652864638.0,
                            "response": "Ha ha oops",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i91jlfa",
                    "author": "Marcion_Sinope",
                    "score": 1,
                    "created_utc": 1652853105.0,
                    "response": "Boycott.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i91mhmq",
                    "author": "HappyCommunication81",
                    "score": 1,
                    "created_utc": 1652855370.0,
                    "response": "Why would I want to use this? Why would I want to coinjoin with UTXOs from addresses that are sanctioned by the US?\n\n>Wasabi Wallet has become a surveillance instrument\n\nHow can Wasabi Wallet be a surveillance instrument when Wasabi and the zkSnacks coordinator don't know which UTXOs belong to who?\n\n>This means that coinjoining with wasabiwallet has become like dealing with any other big Bitcoin company/exchange in the space complying with KYC/AML/sanctions\n\nWasabi Wallet doesn't do any KYC/AML. It doesn't ask for your name or personal information. I'm sure Wasabi complies with US sanctions.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i91nba0",
                            "author": "under_dnuorg",
                            "score": 2,
                            "created_utc": 1652856051.0,
                            "response": "Wasabi Wallet codebase is open source- in this sense you’re right it’s not kyc- however the default coordinator is zkSnacks. They’ve decided to start determining whether to accept or refuse certain utxos from registering to coinjoin. \n\nIt’s not a matter of choosing to coinjoin with sanctioned addresses- it’s the transparency to be able to- without a bad actor having the power to intervene.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9213ni",
                                    "author": "neonzzzzz",
                                    "score": 1,
                                    "created_utc": 1652868500.0,
                                    "response": "> without a bad actor having the power to intervene\n\nAny coordinator you use with Wasabi has the power to block certain UTXOs.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i924x20",
                                            "author": "under_dnuorg",
                                            "score": 1,
                                            "created_utc": 1652871531.0,
                                            "response": "You’re right any coordinator has this power- the difference is the bad actor has proper motive/benefit to doing surveillance/blacklisting. An anonymous actor has none.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i92so0z",
                                            "author": "ElephantsAreHeavy",
                                            "score": 1,
                                            "created_utc": 1652884219.0,
                                            "response": "You, being able to chose the coordinator, have the ultimate power.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i91wi3e",
                    "author": "Bitcoin__Hodler",
                    "score": 1,
                    "created_utc": 1652864330.0,
                    "response": "thx for the info",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i91wfhz",
                    "author": "segersh",
                    "score": -1,
                    "created_utc": 1652864264.0,
                    "response": "Mercury Wallet is the best in the business.\nwww.mercurywallet.com[Mercury Wallet](https://www.mercurywallet.com)",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i920af5",
                            "author": "MuchTemperature6776",
                            "score": 1,
                            "created_utc": 1652867794.0,
                            "response": "I like Muun better and seems like a better choice too since you actually have the private key yourself and in your recovery kit you have all your keys yourself.\n\nhttps://blog.muun.com/muuns-multisig-model/\n\nhttps://muun.com",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "us57cm",
            "title": "Can Bitcoin scale to billions of users?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/us57cm/can_bitcoin_scale_to_billions_of_users/",
            "author": "Centmo",
            "created_utc": 1652849951.0,
            "score": 38,
            "num_comments": 97,
            "subreddit": "Bitcoin",
            "selftext": "Recently, something got me thinking about the end-game: how Bitcoin will scale to be globally adopted as the world’s digital gold or currency or reserve asset, with billions of users?\n\nThe answer is always a layer 2 protocol like Lightning on top of the base layer. Small, frequent transactions will take place on L2. Fast and nearly free. Base layer transactions are slower and more expensive so will be used only for infrequent large transactions and for opening and closing L2 channels. \n\nThis all makes sense but there is a problem, which is the 1MB block size on the base layer. It can only accommodate about 5 transactions per second. If we assume only 1 transaction per user per month, the network can only support 13M users. If half of all transactions were a new user opening their first L2 channel, it would take about 50 years to bring 4B people onto L2. This is way too slow when you look at the steep part of tech adoption s-curves. \n\nI am aware of the history of the block size wars, and that there is always a trade off: when you improve one aspect of the network, something else suffers. The most often cited reason to keep 1MB blocks is to ensure the decentralization of full nodes by allowing them to run on low-cost hardware and low-bandwidth connections. BUT, storage keeps getting cheaper and internet speeds keep improving. Where I live you can get unlimited data for an extra $15/mo. Nodes download 20GB/mo and upload 200GB/mo. This is equivalent to 1hr of Netflix per day. Why can’t block size increase as these technologies get cheaper and faster? We’ve had 1MB basically since the beginning and it hasn’t changed in 13 years (not counting SegWit). \n\nThe alternative is that the Bitcoin base layer ends up being something that only the top 1% can use, and the rest (whom Bitcoin was supposed to help the most) are relegated to completely off-chain, custodial solutions with many of the same drawbacks that the current system has. Centralization, censorship, seizure, etc. \n\nThe only way around this is to increase the capacity of the base layer and I see no appetite for that. \n\nAm I missing something?\n\nUpdate:\n\nAfter reading all the comments, here are my new thoughts. \n\nHyperbitcoinizion may look like this. 99% of users use custodial wallets. If the custodian is trusted, insured, and audited to ensure 1:1 holding of Bitcoin to deposits then it reduces user counterparty risk. If the custodian is registered in some stable country friendly to innovative banking like Switzerland, then user funds are protected from confiscation by abusive governments. Also, since user wealth is denominated in BTC, they are protected from inflation in their local fiat (which is really a hidden tax on the poorest). On the L2 rails, they have access to the cheap fast global digitally native payment system. On-chain L1 transactions are expensive, and used primarily by corporations, institutions, nations, high-value tx.\n\nAlternatively, maybe some new innovation allows billions to open their own Lightning channels and self-custody within the current base layer block limitation.\n\nUpdate 2:\n\nThese new innovations may be “channel factories” or “inherited IDs”",
            "stickied": false,
            "comments": [
                {
                    "id": "i923o2l",
                    "author": "ST-Fish",
                    "score": 11,
                    "created_utc": 1652870593.0,
                    "response": "Surprised everyone here is pretty uninformed, but the solution to this problem is channel factories. They can bundle tens of thousands of channel opens and closes with only 1 on chain transaction.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i92pmxe",
                            "author": "MCHappster1",
                            "score": 6,
                            "created_utc": 1652882879.0,
                            "response": "[Channel Factories](https://bitcoin.stackexchange.com/questions/67158/what-are-channel-factories-and-how-do-they-work)",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i94shwc",
                            "author": "BitcoinUser263895",
                            "score": 1,
                            "created_utc": 1652913860.0,
                            "response": "The entire thing is predicated on the misleading premise that there is a 1-to-1 relationship between channel creation transactions and users.\n\nIt's an intentionally dishonest narrative created by bcash rulers selling bags to bagholders.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i91fmxq",
                    "author": "SmoothGoing",
                    "score": 22,
                    "created_utc": 1652850245.0,
                    "response": "There's no 1MB block size limit anymore. Limit is 4 million weight units.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i91frmn",
                            "author": "Centmo",
                            "score": -6,
                            "created_utc": 1652850333.0,
                            "response": "Right, but we’re still talking around 5 transactions per second, no?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9204wj",
                                    "author": "bitusher",
                                    "score": 18,
                                    "created_utc": 1652867656.0,
                                    "response": "No\n\nThe size of the block doesn't matter much in the context , what matters is the tx throughput, so here is the math if you are curious- (not including future improvements with MAST and schnorr)\n\nhttps://bitcoin.stackexchange.com/questions/59408/with-100-segwit-transactions-what-would-be-the-max-number-of-transaction-confi\n\n4 bytes version\n\n1 byte input count\n\nInput\n\n36 bytes outpoint\n\n1 byte scriptSigLen (0x00)\n\n0 bytes scriptSig\n\n4 bytes sequence\n\n1 byte output count\n\n8 bytes value\n\n1 byte scriptPubKeyLen\n\n22 bytes scriptPubKey (0x0014{20-byte keyhash})\n\n4 bytes locktime\n\n>This sums up to a total of 82 bytes for the non-witness part. So with a total non-witness blocksize of 1 million bytes we get a maximum of 12195 transactions. Assuming that all spent outputs were P2WPKH the witness part for each transaction consists of two pushes: one for the signature and one for the pubkey. These are around 72 bytes and 33 bytes long, and each need a length prefix of 1 byte. Additionally there is 1 byte witness version. So the total witness size is 108 bytes. With 3 MB of space in the witness block left, this brings us to about 27777 witnesses per block. So the limiting factor is the space in the non-witness part of the block, so that's the final number that we should consider.\n\n>Notice that I used the non-segwit serialization for the non-segwit part since that is what non-upgraded nodes will enfore. Notice also that this is an extreme example, since most transactions are not single-input-single-output. A corresponding non-segwit transaction would have a size of 192 bytes, which, together with the 1MB size limit brings us to 5208 transactions per block, **compared to 12195 max segwit transaction per block.**\n\n>The second part of your question regarding maximum UTXO in a block is rather easy. We'd like to amortize the overhead from the transaction structure, and maximize inputs + outputs. Since inputs are larger than outputs we will simple use a single input and compute the **maximum number of outputs that fits in a block which is 32256.** Since the outputs are non-segwit data, it also changes minimally from before the segwit activation (only the signature from the one input is moved to the segwit part). Therefore the maximum UTXO churn is 1 UTXO gets removed, 32256 get added. For comparison, without segwit the maximum number added was 32252. Notice that there may be other limits that I haven't considered, but this definitely are the upper limits, and these limits are unlikely to have changed during the activation of segwit.\n\n**12195/600 = 20 TPS for 10 minute average blocks max**\n\n**32256/600 = 53.76 TPS for 10 minute average blocks max for maximum batching in a block**\n\nOf course you know as well as I do Blocks are often found quicker than 10 minutes so these TPS numbers are variable and sometimes it will be higher than this**(and lower at times of course!)**. Also this doesn't include tx throughput on other layers which allows for millions of TPS.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i92kes1",
                                            "author": "ault92",
                                            "score": -1,
                                            "created_utc": 1652880456.0,
                                            "response": "> Of course you know as well as I do Blocks are often found quicker than 10 minutes so these TPS numbers are variable and sometimes it will be higher than this. \n\nThis is a bit dishonest, as blocks are obviously also sometimes way slower than 10 mins each, 10 mins is the average target and should be the figure you're using. To be completely fair it's probably a little under 10 mins as the general trend is for mining power to grow.\n\nThat said, even if we take the max of 53 TPS, that's 1.671bn TX's a year. There are 7.9bn people on earth. If all on-chain transactions other than lightning channel opening/closing stops, we can onboard 1.67bn people a year with optimum batching, and it will take ~4.72 years for everyone to open *one* lightning channel. This assumes nobody ever closes one, or wants more than 1 channel.\n\nObviously we're a long way from wanting to do that. But my point is that even with L2, there will come a time where the base layer will need to increase it's TX capacity if we want world adoption.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i92lu47",
                                                    "author": "bitusher",
                                                    "score": 7,
                                                    "created_utc": 1652881138.0,
                                                    "response": "Your post assumes lightning is the only way bitcoin scales where Bitcoin is simultaneously attempting to scale onchain, payment channels, drivechains/sidechains, eltoo, offchain custodial multisig banks like Hal suggested, statechains and other solutions \n\nAnother reality we must be cognizant of is the fact that the deep entrenched network effects of fiat won't magically disappear in a few years if we simply keep increasing the blocksize. \n\nThis is an uphill battle that Bitcoin is fighting and will take an incredible amount of effort over our lifetime to see the project succeeds. It is important to understand the longterm objectives and not have unrealistic expectations that damage Bitcoins security \n\nWith all this being said , I and many others aren't necessarily opposed to a hardfork (that must occur anyways due to the Year 2038 problem) which includes another large onchain increase with something like dynamic blocksize adjustments . Its just far too early to need this right now and perhaps we might not need it at all.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i92txvu",
                                                            "author": "n8dahwgg",
                                                            "score": 3,
                                                            "created_utc": 1652884765.0,
                                                            "response": "Can you explain the 2038 bug? Thanks for your post btw deff learned a few things from iT",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i92ua98",
                                                                    "author": "bitusher",
                                                                    "score": 5,
                                                                    "created_utc": 1652884910.0,
                                                                    "response": "unix timestamp bug \n\nhttps://en.wikipedia.org/wiki/Year_2038_problem\n\nSince Bitcoin uses an unsigned integer we have another 68 years though so must hardfork before 2106‬",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i92ucw0",
                                                                            "author": "n8dahwgg",
                                                                            "score": 4,
                                                                            "created_utc": 1652884941.0,
                                                                            "response": "Thanks!",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "i94lk6s",
                                                            "author": "DigitaleDukaten",
                                                            "score": 2,
                                                            "created_utc": 1652910805.0,
                                                            "response": "So much ❤️ to you sir. Tysm",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "i92rjbh",
                                                            "author": "TheChoosey1",
                                                            "score": -1,
                                                            "created_utc": 1652883729.0,
                                                            "response": "Fuck you. No hard forks.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i92tybz",
                                                                    "author": "ault92",
                                                                    "score": 4,
                                                                    "created_utc": 1652884770.0,
                                                                    "response": "Bitcoin uses a 32bit *unsigned* integer for timestamps on blocks etc. Because it's unsigned, it's not a problem until 2108 rather than 2038, but we will at some point before then need a fork of some form to deal with the timestamps running out otherwise.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                },
                                                                {
                                                                    "id": "i92t8h0",
                                                                    "author": "bitusher",
                                                                    "score": 2,
                                                                    "created_utc": 1652884465.0,
                                                                    "response": "How do we fix the  Year 2038 problem without a hardfork ? this requires a hardfork before the year 2106‬ to fix the unix timestamp bug.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                },
                                                                {
                                                                    "id": "i92vmo4",
                                                                    "author": "bitusher",
                                                                    "score": 2,
                                                                    "created_utc": 1652885477.0,
                                                                    "response": "https://satoshi.nakamotoinstitute.org/posts/bitcointalk/threads/171/?view=satoshi\n\n>\"unsigned int is good until 2106.  Surely the network will have to be totally revamped at least once by then.\"\n\n>\"There should not be any signed int.  If you've found a signed int somewhere, please tell me (within the next 25 years please) and I'll change it to unsigned int.\" - satoshi",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "i92tnef",
                                                            "author": "ault92",
                                                            "score": 1,
                                                            "created_utc": 1652884639.0,
                                                            "response": "Totally, I'm not saying we need to scale on chain now, or that we are certain to need to do it at any point in my lifetime, I just don't feel it's quite right to say (not that you directly did, but others certainly have) that LN solves all problems.\n\nEven if just China alone use LN, and nobody else uses bitcoin at all, there is only enough onchain capacity for everyone to open OR close 1.2 LN channels per year *assuming maximum batching*, which lets face it, isn't realistic.\n\nIt might be 100 years before we reach that level of utilisation, but at some point we (hopefully) will reach it, and we need to be aware there's a good chance we will need to scale on chain capacity at some point.\n\nWe totally have other priorities right now, I mean tx fees are really (probably unhealthily) low recently anyway, I just think there will come a time where we need to do something to scale the onchain capacity. Dynamic blocksizes would indeed make sense.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i92ut4c",
                                                                    "author": "bitusher",
                                                                    "score": 2,
                                                                    "created_utc": 1652885133.0,
                                                                    "response": "Also keep in mind that lightning is an evolving protocol and many improvements can help onboard new users like channel factories and eltoo used in conjunction.  \n\n> we need to do something to scale the onchain capacity. \n\nPerhaps , we don't know yet and as you suggest there are much bigger priorities and we aren't even using all the available onchain blockspace either because segwit usage is not above 90%, not everyone is taking advantage of batching , and no one is using the scaling benefits of MAST yet",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i93jxtn",
                                            "author": "azatbinici",
                                            "score": 1,
                                            "created_utc": 1652895355.0,
                                            "response": "The fact that people are well enough concerned with the fees and that actually makes sense.\n\nI indeed agree to the points that you have mentioned above.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i94hqy5",
                            "author": "chris18927",
                            "score": 1,
                            "created_utc": 1652909170.0,
                            "response": "I see what the fair point indeed is and that absolutely makes sense though!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i91h7n5",
                    "author": "under_dnuorg",
                    "score": 14,
                    "created_utc": 1652851348.0,
                    "response": "Scalability is a never ending dynamic- it’s a matter of substitutions- staying ahead of the curve. Grouping onchain txs is a concrete concept that’s been evolving for some time.\n\nScaling is solved through innovation- one of my personal favorites right now is transactions using inherited ids. These txs support factory protocols that scale to an unbounded number of parties and channels, and allow all of the channels in the factory to be bought and sold by anyone, with a single on-chain transaction- one on chain transaction could replace thousands or millions of anyprev transactions.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i91hs6p",
                            "author": "Centmo",
                            "score": 1,
                            "created_utc": 1652851761.0,
                            "response": "You may be right that this will be solved in other ways. Do you have any links so I can read more on inherited IDs?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i91hv7z",
                                    "author": "under_dnuorg",
                                    "score": 4,
                                    "created_utc": 1652851825.0,
                                    "response": "https://github.com/JohnLaw2/btc-iids cheers\n\nI also previously made a post on this https://www.reddit.com/r/Bitcoin/comments/t8h6ex/john_law_scaling_bitcoin_with_inherited_ids_an/?utm_source=share&utm_medium=ios_app&utm_name=iossmf",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i92blm4",
                    "author": "3DprintRC",
                    "score": 4,
                    "created_utc": 1652875855.0,
                    "response": "Imagine a chain of banks letting people host their wallets there. The bank can then have its own L2 with debit cards connected to the wallet. Transactions with that card will happen on that level and only periodically be updated with the blockchain.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i93gop9",
                            "author": "Centmo",
                            "score": 1,
                            "created_utc": 1652894039.0,
                            "response": "Yes I could see this. Online banks, insured, and audited to ensure 1:1 of deposits to BTC holdings.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i91imj3",
                    "author": "nullama",
                    "score": 12,
                    "created_utc": 1652852384.0,
                    "response": "It's only slow to enter or exit L2.\n\nYou're assuming that everyone is entering and exiting all the time, whereas in reality that's not the case.\n\nLightning can scale way better than the rough numbers you're putting here.\n\nAlso, lightning is supposed to be for small quantities. In a similar way, you don't have all your savings in your wallet inside your pocket.\n\nAnd on top of that, heaps of people will be using custodial wallets for lightning, because, again, it's just a few sats, so it shouldn't matter too much.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i91iz0a",
                            "author": "Centmo",
                            "score": 3,
                            "created_utc": 1652852639.0,
                            "response": "This is what I used to think, until I actually ran the numbers. Let me know which of my numbers you think is off.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i91lbtn",
                                    "author": "nullama",
                                    "score": 6,
                                    "created_utc": 1652854448.0,
                                    "response": "> If half of all transactions were a new user opening their first L2 channel, it would take about 50 years to bring 4B people onto L2\n\nI think the vast majority of users of lightning will probably be using some kind of custodial solution, like Wallet of Satoshi, Blue Wallet, etc, or some non-custodial one like Muun where you don't have to setup your own lightning channels. Very few people will actually be opening and closing channels themselves.\n\nSimilar to how now even though millions of people are using Bitcoin on-chain, [there's only about 50 thousand Bitcoin nodes](https://luke.dashjr.org/programs/bitcoin/files/charts/historical.html)",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i91m4w1",
                                            "author": "Centmo",
                                            "score": 2,
                                            "created_utc": 1652855085.0,
                                            "response": "Right. This is how Strike works too right? I could see this for the vast majority of users.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i91mp3l",
                                                    "author": "Centmo",
                                                    "score": 1,
                                                    "created_utc": 1652855543.0,
                                                    "response": "They could still store their savings in custodial held Bitcoin and escape inflation. Also if the custodian is some company based in Switzerland, some dictatorship won’t be able to confiscate.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i94taor",
                                            "author": "BitcoinUser263895",
                                            "score": 1,
                                            "created_utc": 1652914224.0,
                                            "response": "Those custodial solutions only have a small window of usefulness.\n\nThey are only used currently as receive balance management can be tricky.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i94t5z4",
                                    "author": "BitcoinUser263895",
                                    "score": 1,
                                    "created_utc": 1652914165.0,
                                    "response": ">  I actually ran the numbers.\n\nYour numbers are based on missing tech.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i93a23s",
                            "author": "mredda",
                            "score": 1,
                            "created_utc": 1652891390.0,
                            "response": "You need an on-chain transaction every time you want to credit a lightning channel, right?\n\nHow can you credit a lightning channel using your on-chain funds otherwise?\n\nIf this is the case, then lightning is dead because on-chain transactions will be quite expensive in the future, or Bitcoin will be dead because of the opposite.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i94t3jx",
                                    "author": "BitcoinUser263895",
                                    "score": 1,
                                    "created_utc": 1652914135.0,
                                    "response": "> You need an on-chain transaction every time you want to credit a lightning channel, right?\n\nNo.\n\nChannel Factories and Inherited IDs.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i92bo5n",
                    "author": "ipcoffeepot",
                    "score": 3,
                    "created_utc": 1652875897.0,
                    "response": "One of the (many) reasons people are talking about covenants these days are because you can use them to build channel factories, which makes it possible to batch open many (hundreds or thousands) of channels for trustless peers in a single transaction. We’ll need some form of high density channel batching in the next few years, or lightning will tend to be custodial for most people. There are also interesting models being explored like Federated Chaumian Mints connected over lightning, where you end up with federated custody. Not as good as fully self-custodial, but a lot better than single-custodian and can be done without a soft fork.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i91m5sd",
                    "author": "Decapitated_Tomato",
                    "score": 7,
                    "created_utc": 1652855103.0,
                    "response": "Even in the poorest of poor countries technology has improved. It's harder to find 2005-2008 computers than it is to find cheap 2015 / recent computers/chips capable of running a node.\n\nMining difficulty increases because of that fact. Blocksize has no reason not to do the same thing. Even if it grows at the rate of the slowest increasing country.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i94svou",
                            "author": "BitcoinUser263895",
                            "score": 1,
                            "created_utc": 1652914036.0,
                            "response": "> Blocksize has no reason not to do the same thing.\n\nThe smaller we keep the blockchain, the better.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i91g80i",
                    "author": "Nada_Lives",
                    "score": 3,
                    "created_utc": 1652850650.0,
                    "response": "What is the base layer of the fiat system called? What are the chances of you getting the sale of your new Toyota handled on that?\n\nI don't see a problem here at all.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i91gj5q",
                            "author": "Centmo",
                            "score": 2,
                            "created_utc": 1652850873.0,
                            "response": "The whole point here is to improve upon the existing system.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i91j5i7",
                                    "author": "Nada_Lives",
                                    "score": 3,
                                    "created_utc": 1652852777.0,
                                    "response": "Doesn't BTC + LN solve the problem?\n\nHow is revisiting the blockwars an improvement?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i91jq6k",
                                            "author": "Centmo",
                                            "score": 3,
                                            "created_utc": 1652853205.0,
                                            "response": "I thought so too, but the math doesn’t add up when you consider billions of users.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i921fuh",
                    "author": "Perringer",
                    "score": 5,
                    "created_utc": 1652868794.0,
                    "response": "Lightning channels can be created without interacting with L1. [Sidecar.](https://lightning.engineering/posts/2021-05-26-sidecar-channels)",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i928z5p",
                            "author": "Perringer",
                            "score": 1,
                            "created_utc": 1652874272.0,
                            "response": "So what I'm hearing with this downvote is that you won't acknowledge that your concerns are unfounded and there are no longer any L1 obstacles to scaling on L2.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i91olxa",
                    "author": "GoingDeezNuts",
                    "score": 2,
                    "created_utc": 1652857128.0,
                    "response": "Generally speaking bitcoin will ultimately be used as a \"Store of Value\" and it will likely represent a small portion of each person/entities portfolio.   Like 5% for pensions, corporate treasuries, or high net worth individuals. \n\nAs those folks are unlikely to ever spend the last 5% of their portfolio it will not be used frequently for transactions imo.  It will be used for rebalancing purposes and perhaps for large acquisitions. \n\nThere will be some users saving for homes and larger purchases as well but IMO this will be less common than it is today once btc approaches it's terminal value.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i91pafp",
                            "author": "Crafty_Supermarket15",
                            "score": 1,
                            "created_utc": 1652857698.0,
                            "response": "What’s your estimate for final price discovery levels?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i91psfj",
                                    "author": "GoingDeezNuts",
                                    "score": 1,
                                    "created_utc": 1652858141.0,
                                    "response": "Hard to say in dollar terms because of the rapid devaluation.  \n\nBut generally I agree with the consensus estimate of $500k-$5 million by 2040 when new supply ceases.  \n\nIf btc is roughly $30k now that's about 17x - 170x.\n\n\nWhen I'm making decisions to save , invest, pay down debt,vacation etc I generally say \"ok if bitcoin is worth $1 million in 2040 (which is a relatively fair median outcome imo)  would I prefer to buy bitcoin today at this price or do that other thing.  \n\nIn other words say i get my hand on $1,000 check net of taxes and have no immediate need (rent, truck payment, etc) I tell myself if I invest in btc today I'm looking at roughly ~$33k expected return in 2040 when I reach 58 years old.  \n\nThat is today's opportunity cost of using that money to vacation in Florida, buy a new tv, buy an NFT, etc.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i91xy4p",
                                            "author": "wwmore11",
                                            "score": 1,
                                            "created_utc": 1652865669.0,
                                            "response": "You realize all bitcoin will be mined in 2140 not 2040? Not that if matters much, because most the supply is already mined today at almost 88%. Halvings will slowly become less dynamic price driving events over time. 500k isn’t an outlandish price target by 2040. 5 million is a crazy target unless the dollar is so debased that the fiat value is almost worthless in realized trade for true goods/services. I believe you’re talking about 105 trillion market cap. That’s over 10x the gold market and over 2x the current US bond market.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i925iwz",
                                                    "author": "lib3rty47",
                                                    "score": 1,
                                                    "created_utc": 1652871956.0,
                                                    "response": ">debased that the fiat value is almost worthless in realized trade for true goods/services.\n\nNothing like a good old bail out during a financial crisis won't fix.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i939siy",
                                                            "author": "wwmore11",
                                                            "score": 2,
                                                            "created_utc": 1652891285.0,
                                                            "response": "Confused by this comment. Bailouts typically debase fiat value more.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i92oreb",
                                            "author": "oldwhiteoak",
                                            "score": 1,
                                            "created_utc": 1652882483.0,
                                            "response": "Where does the estimate of 500k-5mil come from? I am ballparking 800k max with some very positive assumptions.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i91l62o",
                    "author": "Decapitated_Tomato",
                    "score": 4,
                    "created_utc": 1652854322.0,
                    "response": "As long as a trusted or centralized party is needed to use Bitcoin normally (after base layer is too crowded), governments have a much easier job of morphing BTC in something they can control, just like the current financial system.\n\nYou talked about regular people using the base layer but I think they won't even have the chance to use it because of big corporations and institutions that don't mind paying a fee of $200(0 on their multi million transactions.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i91lxf6",
                            "author": "Centmo",
                            "score": 1,
                            "created_utc": 1652854916.0,
                            "response": "I think you may be right.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i94sybf",
                            "author": "BitcoinUser263895",
                            "score": 1,
                            "created_utc": 1652914069.0,
                            "response": "Channel Factories.\n\nInherited IDs.\n\nLightning Network is scalable.\n\nThis is not a problem.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i91qilm",
                    "author": "jk_14r",
                    "score": 2,
                    "created_utc": 1652858777.0,
                    "response": "I have opened LN channel in Phoenix Wallet in A.D. 2020. And: Never Close ;)\n\nThe majority of Average Joes will go to custodial solutions like Wallet_of_Satoshi - if you like it or not.\n\nThat's how it worked, how it works and how it will work - due to human lazyness... (that's what you are missing ;)",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i91vz5g",
                            "author": "jk_14r",
                            "score": 1,
                            "created_utc": 1652863825.0,
                            "response": "P.S. February 2020 - more than 2 years ;)",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i91uqy7",
                    "author": "Raphae1",
                    "score": 2,
                    "created_utc": 1652862655.0,
                    "response": "There are only 100 million Bitcoin users, many of which already have lightning channels. And btw you can keep your channel for years. There is no need to close them every month.  \n\n\nBesides there are custodial lightning wallets as well. As a matter of fact, many bitcoin „owners“ currently don‘t even withdraw their coins from exchanges let alone store them in lightning wallets.  \n\n\nIn summary, we only need to cross the bridge, when we get there.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i94sq31",
                            "author": "BitcoinUser263895",
                            "score": 1,
                            "created_utc": 1652913965.0,
                            "response": "There is not a 1-to-1 relationship between channel creation transactions and users. The entire narrative is based on falsehood.\n\nCustodial on-ramps are not required for Lightning Network to scale.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i921g6b",
                    "author": "Lazy-Substance-5161",
                    "score": 2,
                    "created_utc": 1652868802.0,
                    "response": "Of course, with Lightning!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i923dgz",
                    "author": "sciencetaco",
                    "score": 2,
                    "created_utc": 1652870367.0,
                    "response": "If it hasn’t already happened, some very smart people will figure out a non-custodial way of getting new users into LN without having to perform on-chain transactions.\n\nThere will be major operators providing and managing liquidity across the network, and their onchain transactions will likely be less frequent and larger transactions. Like major internet-bank settlements today. Almost everyone else will be natively using LN and never need the base chain.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i92b90h",
                    "author": "Gadopsis",
                    "score": 2,
                    "created_utc": 1652875649.0,
                    "response": "The short answer is no",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i92d23d",
                    "author": "NYKNYb",
                    "score": 2,
                    "created_utc": 1652876685.0,
                    "response": "\"Am I missing something?\"\r  \n\r  \nYes. The protocol is immutable.\n\nBitcoin doesn't need to be fixed.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i921z31",
                    "author": "Legal_Sentence_1234",
                    "score": 2,
                    "created_utc": 1652869232.0,
                    "response": "No",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i91y9k2",
                    "author": "coinjaf",
                    "score": 1,
                    "created_utc": 1652865967.0,
                    "response": "> not counting SegWit\n\nWhy would you be so ignorant and deceiving? Just to justify the obvious falsehood you said before that?\n\n> aware of the history of the block size wars\n\nAnd then repeats the exact same lies and nonsense.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i91v4dz",
                    "author": "Ok-Mango5075",
                    "score": 1,
                    "created_utc": 1652863005.0,
                    "response": "Once you go lightning problem solved. I hated the extra step to go lightning at first. Resisted for all I was worth. Now new entrants can actually start with lightning and absolutely resist going on chain. Actually you can trade in commerce without ever getting an actual BTC wallet. Wake up everybody it all ready scales at the speed of light(ning).!!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i928nlj",
                    "author": "igadjeed",
                    "score": 0,
                    "created_utc": 1652874068.0,
                    "response": "> Am I missing something?\n\nYour starting assumption is unjustified. Bitcoin was never intended to be a world currency with billions of users\n\n> Why can’t block size increase as these technologies get cheaper and faster?\n\nHigher block size has a non-linear effect of increasing the RAM footprint of a node. RAM is not getting cheaper",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i93h3rj",
                            "author": "Centmo",
                            "score": 0,
                            "created_utc": 1652894209.0,
                            "response": "I don’t think RAM plays into this.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i93lyi5",
                                    "author": "igadjeed",
                                    "score": 1,
                                    "created_utc": 1652896162.0,
                                    "response": "You're clueless",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i92pr2v",
                    "author": "aj989510",
                    "score": 1,
                    "created_utc": 1652882931.0,
                    "response": "I think the number of users is going to grow a lot now. Bitcoin is beginning to perform its important function and many people understand this.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i931qel",
                            "author": "lizeqiand55d",
                            "score": 1,
                            "created_utc": 1652887994.0,
                            "response": "That is what we can see by the demand of buy orders gradually increasing at a rapid rate!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i92s49q",
                    "author": "coinarmy",
                    "score": 1,
                    "created_utc": 1652883983.0,
                    "response": "Using bitcoin on second layers is like using less pure gold.   \nTo use bitcoin is enough to hold it. you don't need to make transactions on the main chain.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i93h183",
                            "author": "Centmo",
                            "score": 1,
                            "created_utc": 1652894181.0,
                            "response": "Maybe not less pure gold, but less secure note which is backed by pure digital gold.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i941g0j",
                    "author": "djw1966",
                    "score": 1,
                    "created_utc": 1652902458.0,
                    "response": "The future is what tends to remain unseen though. Like we have a better future with Bitcoin!\n\nPeople want what is good for them there is nothing you missed out here I totally agree with that!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i943wx0",
                            "author": "Centmo",
                            "score": 1,
                            "created_utc": 1652903453.0,
                            "response": "After reading all the comments, here is what I missed. \n\nHyperbitcoinizion may look like this. 99% of users use custodial wallets. If the custodian is trusted, insured, and audited to ensure 1:1 holding of Bitcoin to deposits then it reduces user counterparty risk. If the custodian is registered in some stable country friendly to innovative banking like Switzerland, then user funds are protected from confiscation by abusive governments. Also, since user wealth is denominated in BTC, they are protected from inflation in their local fiat (which is really a hidden tax on the poorest). On-chain L1 transactions are expensive, and used primarily by corporations, institutions, nations, high-value tx. \n\nAlternatively, maybe some new innovation allows billions to open their own Lightning channels and self-custody with the current base layer block limitation.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i94rrr3",
                    "author": "BitcoinUser263895",
                    "score": 1,
                    "created_utc": 1652913535.0,
                    "response": "Lightning Network is scalable.\n\nScalable means infinitely, not \"Add more hardware\" version of \"scaling\" which involves block size increases.\n\n>  the network can only support 13M users\n\nNo.\n\n> If half of all transactions were a new user opening their first L2 channel\n\nChannel Factories. Inherited IDs. It's not a 1-to-1 relationship. 1 transaction can open many channels.\n\n> it would take about 50 years to bring 4B people onto L2\n\nNo.\n\n>  BUT, storage keeps getting cheaper\n\nStorage isn't the bottleneck. Bandwidth is. \n\nSome places in the world it would already take you 2 months to download the Bitcoin blockchain.\n\n> Bitcoin base layer ends up being something that only the top 1% can use\n\nNo.\n\n> Am I missing something?\n\nYes.\n\n> 99% of users use custodial wallets.\n\nNo. Once again. Lightning Network is scalable.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i926ogf",
                    "author": "daadanu",
                    "score": -2,
                    "created_utc": 1652872763.0,
                    "response": "Could billion of users focus their attention on Bitcoin? - YES\n\nPromoting second layers of bitcoin is alchemy, at some point they will understand the difference between less pure bitcoin and the original one that satoshi left.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}