{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uym4w3",
            "title": "dont be those type of fools",
            "url": "https://i.redd.it/yqkjcu262x191.jpg",
            "author": "Cryptornd2",
            "created_utc": 1653612748.0,
            "score": 5,
            "num_comments": 1,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "ia4yfbj",
                    "author": "jamaicanmonk",
                    "score": 1,
                    "created_utc": 1653613164.0,
                    "response": "People who do this and then whine about losing money 😑 cant stand it",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uym19e",
            "title": "Why Bitcoin Won't Move From Proof-of-Work to Proof-of-Stake?",
            "url": "https://thenewscrypto.com/why-bitcoin-wont-move-from-proof-of-work-to-proof-of-stake/",
            "author": "Loud_Dingo7261",
            "created_utc": 1653612441.0,
            "score": 1,
            "num_comments": 0,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uym1d9",
            "title": "Anyone put their fiat where their mouth is?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uym1d9/anyone_put_their_fiat_where_their_mouth_is/",
            "author": "planet_hallows",
            "created_utc": 1653612450.0,
            "score": 0,
            "num_comments": 37,
            "subreddit": "Bitcoin",
            "selftext": "I'm a maxi HODL, or at least I talk like one. But I have less than 2% of my net worth in BTC. I think it's mostly because I expect the powers to be to shut it down before it can really take off or threaten centrally controlled fiat. I'm not sure how, but I think they'll find a way.\n\nDoes anyone else have a significant portion of their net worth in BTC? If you don't trust the anonymity of reddit I suppose you probably shouldn't say exactly how much you have, but say whatever you're comfortable with, and why it's not more.",
            "stickied": false,
            "comments": [
                {
                    "id": "ia500bn",
                    "author": "wwmore11",
                    "score": 10,
                    "created_utc": 1653613946.0,
                    "response": "Govt can’t just shut down bitcoin, but they certainly can regulate it, restrict it’s legal adoption, and destroy valuations in fiat.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia558xe",
                            "author": "NiceDoctorBeam",
                            "score": 5,
                            "created_utc": 1653616485.0,
                            "response": "No.  Governments can only regulate their own fiat currencies.  \n\nBob sends Bitcoin to Alice.  No government was involved.  No government regulations applied to their transaction.  No government can stop Bob from doing it again, and again.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia5cxbc",
                                    "author": "Ground_Lazy",
                                    "score": 5,
                                    "created_utc": 1653620283.0,
                                    "response": "Feds prints double the money to fund the war, keep half the stash , bob and alice just lost 25% of their buying power",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia5fxoz",
                                            "author": "recessiontime",
                                            "score": 2,
                                            "created_utc": 1653621821.0,
                                            "response": "Feds can only print fiat not btc. Bob sent alice 1 btc, they didn't lose purchasing power.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "ia5x439",
                                            "author": "tokyo_aces",
                                            "score": 2,
                                            "created_utc": 1653632760.0,
                                            "response": "If Bob and Alice had kept their BTC as cash, when the Fed doubles the amount of USD in circulation that automatically cuts 50% off their purchasing power.\n\nIn this closed system discussion where we posit *only* 2 people using Bitcoin, they would be damned in either case - holding BTC or holding cash.\n\nThankfully we have a much larger Bitcoin system.  Therefore when the government doubles circulation, people who hold Bitcoin *do not lose purchasing power*.  They can either\n\n1. use the BTC in a BTC marketplace for goods and services, since there are so many companies and people that accept Bitcoin now.\n2. sell the BTC to cash at now double the fiat price\\*\\*, and conduct business in fiat where necessary.  They neither gained nor lost purchase power despite a doubling of USD holdings, since USD was inflated.\n\nI think you can see Bob and Alice would be happy with either #1 or #2.\n\n&#x200B;\n\n\\*\\* of course this is not an instant price reflection, and price in real life depends on many factors.  However if currency A is suddenly twice as common as before, and currency B has not changed circulation, all things being equal, the price of B w.r.t. A will double.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "ia5mgfr",
                                    "author": "wwmore11",
                                    "score": 1,
                                    "created_utc": 1653625466.0,
                                    "response": "Govt can regulate to legally restrict businesses from accepting bitcoin as legal tender (to be clear I don’t the U.S. will do this, they’ll just tax it to levels that restrict beyond feasible everyday trade use and deploy cbdc, store of value may hold but it won’t change the world). Sure any person or entity can send/receive bitcoin, but imo it needs to be exchangeable for goods, services, or traded for fiat to accomplish anything meaningful in the long run. If fiat crashes and burns maybe bitcoin is an answer, but that outcome comes with more pain than most want to admit.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia5tqvn",
                                            "author": "hodl_on_boi",
                                            "score": 1,
                                            "created_utc": 1653630282.0,
                                            "response": "Bitcoin is so much more than a currency. It’s the most secure immutable ledger there is currently. A better comparison than bitcoin vs usd would be bitcoin vs tcp. Rather than a currency it’s a new way of keeping account for value (and things). It can be used for decentralized identity for example (check Microsoft’s ION for example). Layer 2 applications will bring tremendous value to the world which will translate in demand for bitcoin and entries in blocks on the blockchain, which are both scarce. I personally think the scarcity of block space will be the ultimate driver of Bitcoin value.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia5ug2k",
                                                    "author": "wwmore11",
                                                    "score": 1,
                                                    "created_utc": 1653630784.0,
                                                    "response": "Bitcoin can make all our wildest dreams come true.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "ia84svu",
                                            "author": "NiceDoctorBeam",
                                            "score": 1,
                                            "created_utc": 1653677236.0,
                                            "response": "If Bob and Alice agree to **trade** some of Bob's BTC for Alice's bike, there is no way the government can stop it or regulate it.  \n\nNobody here said anything about \"legal tender\" until you brought it up.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia8bkwk",
                                                    "author": "wwmore11",
                                                    "score": 1,
                                                    "created_utc": 1653680257.0,
                                                    "response": "Fair. But that’s just some underground refugee form of currency. How do you expect that small amount of utility to support such ridiculous valuations when hardly anyone in this sub has ever even bought one item with their bitcoin?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "ia8oykg",
                                                            "author": "NiceDoctorBeam",
                                                            "score": 1,
                                                            "created_utc": 1653686426.0,
                                                            "response": "No.  There's nothing underground about Bitcoin.  \n\nWhy do you insist on bickering about things you clearly don't understand?",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "ia9dcm9",
                                                                    "author": "wwmore11",
                                                                    "score": 1,
                                                                    "created_utc": 1653698686.0,
                                                                    "response": "How many people are transferring bitcoin between each other today for serviceable reasons at a basic txn level? Explain to me how if a govt did pass a law banning bitcoin for payments (the US likely will not do this, but will create resistance through KYC and taxation), how that is good for bitcoins adoption and the price valuations this community is obsessed with? Trading bitcoin today for anything, results in massive capital gains tax implications. That may not be imposed or regulated well at this time, but do you assume it won’t be at some point? I’m confused why you think I’m bickering for making fair statements about the challenges bitcoin will face in a path toward utility. Store of value is fine I guess, but it’s not so simple as you’re making it seem to achieve widespread adoption. Number won’t go up forever if it’s not easy to use at some point, unless the network becomes something utilitarian for other reasons.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "ia556a4",
                            "author": "planet_hallows",
                            "score": 2,
                            "created_utc": 1653616449.0,
                            "response": "Which is what I meant by \"they'll find a way\". It will still exist on the black market, but you risk jail and seizure of any assets you can hide (like real estate).\n\nI suppose they [already do that with fiat using \"asset forfeiture\"](https://www.youtube.com/watch?v=MsIxzQXdWzY) and [\"eminent domain\"](https://www.youtube.com/watch?v=9yRHmAfiMSs) so what's the difference?\n\nI do sincerely believe that, once it becomes the dominant currency, BTC can't be stopped and will help curb such abuses. But I think the Illuminati or whoever have enough fight in them that we may not see that in my lifetime.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia7h96i",
                                    "author": "Spl00ky",
                                    "score": 2,
                                    "created_utc": 1653667348.0,
                                    "response": "Governments need not seize or make bitcoin illegal to possess. All they have to do is make it illegal for businesses to accept bitcoin as payment. Bitcoin worked fine at $1, $100, $1k and $10k and would work fine at those prices if it were to ever reach those levels again.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia8fmaz",
                                            "author": "planet_hallows",
                                            "score": 1,
                                            "created_utc": 1653682078.0,
                                            "response": "It's all about global acceptance. Making it illegal to accept is a disincentive rather than a hard stop. If BTC were accepted elsewhere and the dollar the government does allow is devalued enough, then both business and consumers will take the risk. If enough people do it, their law will become unenforceable, especially when the government is weak due to the falling dollar. You can't pay cops to enforce laws with over-inflated dollars.\n\nI suspect this is a tipping point type of thing. It changes very slowly up to a point. Then it happens almost overnight. This guy thinks he knows what to look for though: https://youtu.be/ajEAloBrp2g",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia4xj16",
                    "author": "Wolfos9",
                    "score": 16,
                    "created_utc": 1653612718.0,
                    "response": "I haven't done the math but about.... 99% of my net worth I'd say.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia6hh5e",
                            "author": "McKnuckle_Brewery",
                            "score": 1,
                            "created_utc": 1653649968.0,
                            "response": "So, about half your net worth now vs. 6 months ago.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia6j1ic",
                                    "author": "Wolfos9",
                                    "score": 3,
                                    "created_utc": 1653651049.0,
                                    "response": "Using that specific time sample? Yes that's fairly accurate.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia5krfp",
                    "author": "Scrapin-Nee",
                    "score": 5,
                    "created_utc": 1653624475.0,
                    "response": "Nah you don’t even talk like one, significant lack of conviction. It’s ok though, everyday is just another step towards the inevitability that is Bitcoin. Yours truly, a toxic Bitcoin Maximalist.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia4yshh",
                    "author": "Micksar",
                    "score": 3,
                    "created_utc": 1653613340.0,
                    "response": "If I put all my money into BTC in the middle of a bear market and I need to buy something, I’d have to sell my BTC at a loss… or if it’s a gain, I’d have to pay tax on it. I’m only putting money into BTC as a retirement/savings fund.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia51qhh",
                    "author": "Mallardshead",
                    "score": 10,
                    "created_utc": 1653614793.0,
                    "response": "99%. Started as 5%. But as BTC relentlessly appreciates over time against everything else, it naturally crowds everything else out. I've been \"hyperbitcoinized\" you could say.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia5dd8n",
                    "author": "bandoonparade",
                    "score": 3,
                    "created_utc": 1653620508.0,
                    "response": "Nice try, IRS",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia50fth",
                    "author": "BusinessBreakfast3",
                    "score": 2,
                    "created_utc": 1653614159.0,
                    "response": "Powers to be? Lol\n\nYes, 50% of my multi hundred thousand portfolio.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia55xbm",
                    "author": "Danjodylo",
                    "score": 2,
                    "created_utc": 1653616818.0,
                    "response": "Less than 2% and significant portion sound at odds.  But it's good to keep evaluating and dipping toes in. \n\nFor me over 40% and growing during this blessing of a time.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia4y682",
                    "author": "NiceDoctorBeam",
                    "score": 6,
                    "created_utc": 1653613040.0,
                    "response": "You lack understanding.  Even worse, you make important financial decisions based upon your lack of understanding.  \n\nOh well.  \n\nYou owe it to yourself to learn the facts about what Bitcoin actually is, the basics of how it works, why it was invented (the perils and pitfalls of fiat currency).  \n\nIntro: The Trust Machine (22 min):  \nhttps://www.youtube.com/watch?v=ZKwqNgG-Sv4\n\nSaylor Explains:  \nhttps://www.reddit.com/r/Bitcoin/comments/s54g8x/send_this_to_your_contacts_interested_in_bitcoin/\n\nRead: \"The Bitcoin Standard,\" by S. Ammous",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia51353",
                    "author": "Brettanomyces78",
                    "score": 1,
                    "created_utc": 1653614477.0,
                    "response": "I tried that once.  Tasted terrible.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia5catw",
                    "author": "JTennant83",
                    "score": 1,
                    "created_utc": 1653619965.0,
                    "response": "20-25% with goals for 60-70% in 15-20 years",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia5elm2",
                    "author": "ilikedevo",
                    "score": 1,
                    "created_utc": 1653621151.0,
                    "response": "Less than 2%",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia5g3c8",
                    "author": "fiedo87",
                    "score": 1,
                    "created_utc": 1653621902.0,
                    "response": "I have my life savings into it and living off of it at 34 years living comfortably. I got into it in 2018. I have only increased my holdings since then and have only become more of a maxi the more I learn. If bitcoin does fail, we are all screwed anyway because then were stuck using CBDCs controlled by the government. bitcoin failing will take all other cryptos with it. this however, will not happen.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia5h8ou",
                    "author": "Black_Labs_Matter69",
                    "score": 1,
                    "created_utc": 1653622503.0,
                    "response": "Most of my net worth is the equity in my home…but I have enough bitcoin to buy a nice car so it does scare me in the sense that I have a lot of money invested in something that I’m brand new to.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia5kqw9",
                    "author": "papejay88",
                    "score": 1,
                    "created_utc": 1653624466.0,
                    "response": "I’m fully, 100% invested in btc. Nothing else.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia5o50a",
                    "author": "Sufficient_Tooth_949",
                    "score": 1,
                    "created_utc": 1653626506.0,
                    "response": "I'm 50/50 fiat/Bitcoin....it would be more but I'm keeping a 6 month emergency savings in fiat....plus just want a few grand in case I see a new toy I want, but I'm certain eventually I'll have far more in Bitcoin that fiat",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia69b3l",
                    "author": "clickworker2019",
                    "score": 1,
                    "created_utc": 1653643350.0,
                    "response": "Yes, around 10%. It's the maximum I'm willing to invest in a high-risk currency like bitcoin.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia8n2gp",
                    "author": "CulturedButtermilk86",
                    "score": 1,
                    "created_utc": 1653685521.0,
                    "response": "401k in stocks, everything outside of that 100% in bitcoin.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia65ltd",
                    "author": "Puzzled-Network",
                    "score": 0,
                    "created_utc": 1653639998.0,
                    "response": "Sel.ling Cry+pto $US-DT in Ku+Coin Exch+ange P-2-P Section\n\nTotal of 543 US+DT Available.\n\nNe+ed fu+nds for emer+gency use..\n\nNe+ed money Hospi+taliza+tion of bro+ther.\n\nSa+fe & Reli-able Tran+saction..\n\nAvoid sc+am..\n\nPM me for more Information.\n\n👍👍",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}