{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uwgqrn",
            "title": "Help me explain to my sister why they can’t just make another Bitcoin that would become more popular then Bitcoin.",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uwgqrn/help_me_explain_to_my_sister_why_they_cant_just/",
            "author": "ToTheGodDamnMoon69",
            "created_utc": 1653359750.0,
            "score": 0,
            "num_comments": 33,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9rjd53",
                    "author": "nullama",
                    "score": 17,
                    "created_utc": 1653361677.0,
                    "response": "It would be similar to creating a new Internet.\n\nIt makes no sense, because the current Internet works great, it's decentralized, keeps getting better over time, and it's already deployed everywhere.\n\nYou can, of course, create new layers on top of the Internet, like the World Wide Web (www), and keep building more diverse and advanced stuff on top of the foundational block which is the Internet.\n\nSame with Bitcoin, we're now seeing how lightning is being used on top of Bitcoin as the base layer, and there are even services and apps running on top of lightning([sphinx is one example of this](https://sphinx.chat/)), so we already have a 3rd layer on top of Bitcoin.\n\nIt's just not going to happen, in the same way that we're not going to have a more popular Internet than the current Internet.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ro5vl",
                    "author": "bigLeafTree",
                    "score": 6,
                    "created_utc": 1653364373.0,
                    "response": "Bitcoin had a perfect launch. It was the first, creator disappeared, never sold a coin, making changes to it is hard, lots of miners keep networks very secure.\n\n  It is impossible or extremely hard to replicate those.\n\n  Also the question makes little sense if you think about it. Why invest in Google, someone can make another google and became more popular! Why hold dollars, someone else can create other dollars!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9s0d2g",
                    "author": "BusinessBreakfast3",
                    "score": 3,
                    "created_utc": 1653372733.0,
                    "response": "Ask her why doesn't she do it.\n\nThe code is there, copy it, and name it whatever you like. Why won't she succeed?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9rkutx",
                    "author": "bluehoodie94",
                    "score": 2,
                    "created_utc": 1653362479.0,
                    "response": "It is possible, if the new coin is better than bitcoin and all 19k other coin...",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9rqk0j",
                            "author": "life762",
                            "score": 2,
                            "created_utc": 1653365815.0,
                            "response": "This is the correct answer, though some might hesitate to admit it. Better to face reality, though.\n\nHuman innovation doesn't stop. Seashells are better than cows. Gold is better than seashells. Bitcoin is better than gold. At some point something will be better than Bitcoin.\n\nI don't know what it will be. If I could imagine it, I would invent it. I can say for sure that none of the myriad crypto coins are better than Bitcoin, so probably whatever is better than Bitcoin hasn't been invented, yet. And I'm not holding my breath.\n\nIt isn't possible to be harder money than Bitcoin, which is already perfectly scarce. So whatever is better than Bitcoin will have to innovate in other areas. Also, it's not really enough to be a little better than Bitcoin. Whatever replaces Bitcoin has to be a lot better. It's a tall order, so I suspect Bitcoin will be the best money for a long while.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9s44jl",
                            "author": "LuKeNuKuM",
                            "score": 1,
                            "created_utc": 1653375836.0,
                            "response": "Yes, but even if it was better, it would hard to hide the creator's identity and indeed the group/business behind it. Part of bitcoin's power is that it's not controlled and doesn't have that Achilles heel.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9rg61c",
                    "author": "CryptoCrumbSniffer",
                    "score": 5,
                    "created_utc": 1653360047.0,
                    "response": "Look up first-mover advantage. Simply, it was the first Blockchain based cryptocurrency.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9rjkln",
                            "author": "roland8855",
                            "score": 2,
                            "created_utc": 1653361785.0,
                            "response": "This gives bitcoin an advantage.  It doesn't prevent another crypto currency from becoming more popular.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9rgpnb",
                            "author": "Catsupsam",
                            "score": 0,
                            "created_utc": 1653360325.0,
                            "response": "Wrong",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9rgsrk",
                                    "author": "CryptoCrumbSniffer",
                                    "score": 0,
                                    "created_utc": 1653360370.0,
                                    "response": "Care to explain?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9rh0qy",
                                            "author": "mantits-",
                                            "score": 0,
                                            "created_utc": 1653360486.0,
                                            "response": "It wasn’t the first blockchain based currency.\n\nIt was the first one to get extremely popular though.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9rh7aq",
                                                    "author": "CryptoCrumbSniffer",
                                                    "score": 1,
                                                    "created_utc": 1653360582.0,
                                                    "response": "What was the others before it?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9ridlr",
                                                            "author": "Ok_Aerie3546",
                                                            "score": -1,
                                                            "created_utc": 1653361177.0,
                                                            "response": "Hashcash",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9rs6zb",
                                                                    "author": "bitsteiner",
                                                                    "score": 2,
                                                                    "created_utc": 1653366838.0,
                                                                    "response": "Hashcash is a technology, not a crypto currency. It did not solve the Byzantine Generals Problem, a requirement for a crypto currency.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9rylkr",
                                                                            "author": "Ok_Aerie3546",
                                                                            "score": 1,
                                                                            "created_utc": 1653371360.0,
                                                                            "response": "True",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "id": "i9risc1",
                                                                    "author": "CryptoCrumbSniffer",
                                                                    "score": 2,
                                                                    "created_utc": 1653361376.0,
                                                                    "response": "It was not used for cryptocurrency, it was used to prevent email spam. Thus my statement that Bitcoin was the first Blockchain based cryptocurrency is true.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9rfqpn",
                    "author": "Lux_Locks",
                    "score": 1,
                    "created_utc": 1653359834.0,
                    "response": "They’d need to make another Satoshi. That would be hard because no one knows the recipe.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9riodt",
                    "author": "Nada_Lives",
                    "score": 1,
                    "created_utc": 1653361321.0,
                    "response": "Ask her if there can ever be another Joshua Bassett.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9rrqy2",
                    "author": "bitsteiner",
                    "score": 1,
                    "created_utc": 1653366553.0,
                    "response": "It needed a new quality, I can't be just a copy of existing technology.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9rv4pc",
                    "author": "savinelli_smoker",
                    "score": 1,
                    "created_utc": 1653368809.0,
                    "response": "It needs to be A LOT better than bitcoin to have a chance. But right now Bitcoin pretty much tick all the boxes of being a good money (or on its way to tick those boxes), so it’s hard to come up with something sooo much better. And copying existing code won’t work because you have to start from the beginning spreading the network. \n\nLyn Alden puts it nicely: you can download every page of Wikipedia (it’s possible, it’s all open source), put it on your server and call it KittyPedia and try compete with wiki. It won’t work because everyone is linked to wiki all references and bookmarks and api are linked to wiki, network effect will just reinforce itself and it’s very hard to overcome.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9s5t5s",
                            "author": "igadjeed",
                            "score": 1,
                            "created_utc": 1653377312.0,
                            "response": "> Wikipedia\n\nNot only possible. There are dozens of mirror copies of Wikipedia",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9rw8n0",
                    "author": "DudeBroManCthulhu",
                    "score": 1,
                    "created_utc": 1653369605.0,
                    "response": "That would be called a shitcoin.  There are thousands.  Go make one.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9rwxit",
                    "author": "Ernest-Everhard42",
                    "score": 1,
                    "created_utc": 1653370110.0,
                    "response": "Sister might be right.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9s3ocx",
                    "author": "MrQ01",
                    "score": 1,
                    "created_utc": 1653375452.0,
                    "response": "Considering that people have made 16'000 cryptocurrencies, some of which have attempted to be improvements over BTC, and that they succeed then the free market can move its $0.5 trillion....\n\nYou could just respind \"I don't know, why can't they and why haven't they?\"\n\nYou can also ask what she advises we should do about BTC if indeed someone can make a better version, but then ask whether that same course of action also applied when you switch the word \"Bitcoin\" with \"cell phone\" or \"internet provider\"..... or \"software company\".",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9s5o9z",
                            "author": "igadjeed",
                            "score": 1,
                            "created_utc": 1653377190.0,
                            "response": "> what she advises we should do about BTC if indeed someone can make a better version\n\nKeep a handful of nodes running, as a kind of living museum for the previous best electronic cash invention",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9s5dpb",
                    "author": "dlq84",
                    "score": 1,
                    "created_utc": 1653376930.0,
                    "response": "There are thousands of projects that have tried. Non of them even comes close.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9s5iac",
                    "author": "StoicTechInvestor",
                    "score": 1,
                    "created_utc": 1653377042.0,
                    "response": "Immaculate conception",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9s5okp",
                    "author": "zambooka187",
                    "score": 1,
                    "created_utc": 1653377197.0,
                    "response": "Could someone explain to me why another crypto can’t become more popular than Bitcoin? If cryptos eventually become widely adopted as payment methods then bitcoin has huge disadvantages compared to many other existing coins. I’d envisage a scenario where bitcoin might assume a similar kind of role as gold - but where other coins are the ones widely used.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9sa0h1",
                    "author": "sloaleks",
                    "score": 1,
                    "created_utc": 1653381190.0,
                    "response": "Easy, nobody can create a new first one, a new primus. Now, almost any smart dev can create a newchain, with a coin with similar principles. But it will never be the first.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uwgqhd",
            "title": "This is range that I think we are looking at for Bitcoin.",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uwgqhd/this_is_range_that_i_think_we_are_looking_at_for/",
            "author": "thinkinoutlewd",
            "created_utc": 1653359724.0,
            "score": 0,
            "num_comments": 7,
            "subreddit": "Bitcoin",
            "selftext": "For people that haven't experienced a bear market before, I'm going to give you a range if the death cross is bearish for Bitcoin (I give it a 10 percent chance to bounce). The bear market is where all the gaps tend to get filled... After all, 90% of all gaps get filled.  There's a gap around 20k and one around 14.5k.  There my friends is your buy range.  I'm going to start my DCA on that entire range just in case we bounce off of the 20k range.  Historically going below the previous top would be a first for a Bitcoin cycle but I believe we will close at least one gap.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9rigkd",
                    "author": "jgarcya",
                    "score": 4,
                    "created_utc": 1653361218.0,
                    "response": "Just figure an 80%+ decline from ath...\n\nI believe we may see 15k flash low..\n\nI agree with your estimates.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9riol5",
                            "author": "thinkinoutlewd",
                            "score": 2,
                            "created_utc": 1653361324.0,
                            "response": "Thank you.  I'm kind of conflicted about it not finding support at the previous ATH and bouncing off, but there's a first time for everything..",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9rjlno",
                                    "author": "jgarcya",
                                    "score": 3,
                                    "created_utc": 1653361801.0,
                                    "response": "What will happen, is this will be the greatest shakeout in btc history( due to economy and world events)... Everyone will panic in Nov/Dec..\n\nBitcoin will fall super fast from old ATH.... War/virus will be the reason...\n\nRetail will panic and sell.... We may see a small sell off from institutions...\n\nThen institutions will swipe in as the rest of the world is hemorging from bad economy, too much debt, and $10/ gal gas...\n\nThe rich will buy up supply super fast... Bringing us to old ATH 20k levels until 2023...\n\nI expect a similar move in March 2023, like March/April 2019...\n\nIf you miss this dip at sub 20k... You will miss the opportunity of a lifetime...\n\nWhen it starts running in 2023.. It will be too late for small investors..\n\nHighs in 2025 100k plus conservatively.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9rkb0o",
                                            "author": "thinkinoutlewd",
                                            "score": 2,
                                            "created_utc": 1653362184.0,
                                            "response": "This is a time of excitement for me.  This is where the ground work is laid for truly life changing purchasing power.  I'm excited about Bitcoin's future as well as the ALT shakeout that will put the best projects in the front of the line for retail investors.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9rkmbx",
                                                    "author": "jgarcya",
                                                    "score": 2,
                                                    "created_utc": 1653362354.0,
                                                    "response": "I agree... I entered right in March of 2019... Changed my life...\n\nI will be buying the dip around 23k in small amounts... Increasing size of purchases as it drops...\n\nWould love to see .1 btc = $1500",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9u343q",
                                            "author": "LuKeNuKuM",
                                            "score": 1,
                                            "created_utc": 1653415839.0,
                                            "response": "I like your conviction.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9s9pdj",
                    "author": "Mallardshead",
                    "score": 2,
                    "created_utc": 1653380891.0,
                    "response": "$400k",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}