{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "up7obz",
            "title": "1 Bitcoin = 1 Bitcoin and Hash Rate is at an all time high — that’s all.",
            "url": "https://coinmarketcap.com/currencies/bitcoin/",
            "author": "satoshishash",
            "created_utc": 1652496000.0,
            "score": 58,
            "num_comments": 42,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8jo9no",
                    "author": "mgd09292007",
                    "score": 4,
                    "created_utc": 1652506704.0,
                    "response": "ELI5?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8jp0qr",
                            "author": "satoshishash",
                            "score": 8,
                            "created_utc": 1652507251.0,
                            "response": "The chart shows Bitcoin’s 1 hour trading chart in green and the goldish color straight line represents 1 Bitcoin. The significance is that although Bitcoins’ price may change, it’s still 1 Bitcoin (out of the 21 million total there will ever be. A strong cap on supply is more unique and important than it may initially sound.) \nPeople who believe Bitcoin will be a base layer for all financial activities believe the importance is attaining a supply of Bitcoin (or satoshis, satoshis = 1/100m of 1 Bitcoin), we don’t care about the current price because it’s not a short term investment.\n\nHash rate is the relative security of a network. Bitcoin has the highest hashrate compared to all cryptocurrencies. \nBitcoins network is therefore most secure and hardest to attack.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8j6k16",
                    "author": "queer_mentat",
                    "score": 6,
                    "created_utc": 1652496076.0,
                    "response": "But what about all the FUD from people who think shitcoins are the same as Bitcoin?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8j6x9g",
                            "author": "satoshishash",
                            "score": 7,
                            "created_utc": 1652496272.0,
                            "response": "They don’t get it. Can’t help them all understand. Like Satoshi said, I don’t have time to explain.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "upkv9p",
            "title": "Hard wallet for btc that allows for multiple accounts",
            "url": "https://www.reddit.com/r/Bitcoin/comments/upkv9p/hard_wallet_for_btc_that_allows_for_multiple/",
            "author": "zandor435",
            "created_utc": 1652545815.0,
            "score": 3,
            "num_comments": 12,
            "subreddit": "Bitcoin",
            "selftext": "I have a name brand  hard wallet.  However I have been storing a small amount of btc for other family members on some exchanges.  I’d like to keep all of this btc on the same hard wallet (so I only have one recovery seed).  But I’d like to not co mingle our btc. \n\nIs anyone doing anything like this and willing to share some thoughts?\n\nAppreciate any suggestions.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8lcpp0",
                    "author": "technotrader",
                    "score": 5,
                    "created_utc": 1652546236.0,
                    "response": "Use the password feature of your BIP39 - compatible wallet. The same seed plus a unique password for each family member will generate an entirely distinct set of addresses.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8le3nd",
                    "author": "BusterGrundle",
                    "score": 3,
                    "created_utc": 1652546856.0,
                    "response": "I use a ledger nano X and have separate BTC accounts for family. It's really easy to set up.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "up0lj7",
            "title": "Anyone know if this is bad or normal?",
            "url": "https://www.reddit.com/gallery/up0lj7",
            "author": "JaydenWatters",
            "created_utc": 1652473599.0,
            "score": 4,
            "num_comments": 16,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8hw1re",
                    "author": "ndgoLiberty",
                    "score": 4,
                    "created_utc": 1652473830.0,
                    "response": "I wouldn’t say it’s normal for the last 10 months but it does happen. If you had replace by fee I would say boost it to 15sats/vbyte but you didn’t so now you just have to wait.\n\nMaybe days. Next time check mempool.space to determine what transaction fee you need to pay.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8hyjve",
                    "author": "SmoothGoing",
                    "score": 5,
                    "created_utc": 1652474922.0,
                    "response": "It's normal. Transaction fees are based on demand for block space. If you underpay the fee you have to wait. Learn how fees work https://www.reddit.com/r/Bitcoin/comments/jkw0l5/transaction_stuck_read_this/",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8i2r0m",
                    "author": "pityaka",
                    "score": 3,
                    "created_utc": 1652476791.0,
                    "response": "Don't worry like everyone said it will clear. The low transaction fee has lowered the priority but it will get sorted 👍",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uppg2r",
            "title": "Alternative to Coinbase",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uppg2r/alternative_to_coinbase/",
            "author": "bbbbound",
            "created_utc": 1652559332.0,
            "score": 10,
            "num_comments": 50,
            "subreddit": "Bitcoin",
            "selftext": "Hi guys,  which exchange do you recommend?  Looking at Swan, Gemini, etc.  Just stacking, not trading.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8m94v1",
                    "author": "senfmeister",
                    "score": 21,
                    "created_utc": 1652561135.0,
                    "response": "Strike",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8n565p",
                            "author": "JubJubsFunFactory",
                            "score": 3,
                            "created_utc": 1652576440.0,
                            "response": "This is the way",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8m8xhj",
                    "author": "comfyggs",
                    "score": 11,
                    "created_utc": 1652561041.0,
                    "response": "Kraken",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8mf7ko",
                    "author": "jermmany",
                    "score": 8,
                    "created_utc": 1652563944.0,
                    "response": "Strike",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8mg1va",
                    "author": "shreveportfixit",
                    "score": 7,
                    "created_utc": 1652564330.0,
                    "response": "Whatever you choose, withdraw your coins to cold storage regularly.   Do not use an exchange as your savings wallet.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8mghc6",
                    "author": "TheOpeningBell",
                    "score": 7,
                    "created_utc": 1652564528.0,
                    "response": "Strike",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8mhlkg",
                    "author": "Percyheckendorf",
                    "score": 6,
                    "created_utc": 1652565049.0,
                    "response": "Strike",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8m5lxz",
                    "author": "Har0ldDemure",
                    "score": 12,
                    "created_utc": 1652559512.0,
                    "response": "I like Gemini for its 10 free monthly withdrawals and kraken",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8m7pfm",
                            "author": "brotherRozo",
                            "score": 7,
                            "created_utc": 1652560480.0,
                            "response": "I wanna trust the Winklevoss twins because they may be able to get revenge on Zuckerberg one day, but I also don’t wanna trust them because they’re super rich dudes",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8m8qba",
                                    "author": "Brettanomyces78",
                                    "score": 5,
                                    "created_utc": 1652560949.0,
                                    "response": "Any owners or CEOs of exchanges are super rich.  Not sure how this is relevant.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8maoh8",
                                            "author": "brotherRozo",
                                            "score": 5,
                                            "created_utc": 1652561854.0,
                                            "response": "Fear not! You can be certain it is irrelevant. To calm your worries good sir",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8m9c80",
                    "author": "bryguy4436",
                    "score": 7,
                    "created_utc": 1652561233.0,
                    "response": "Buy on strike, transfer to HWW",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8mabj3",
                    "author": "wesblog",
                    "score": 3,
                    "created_utc": 1652561686.0,
                    "response": "It is always best to have an account open with at least 2 exchanges in case one goes down and you need to withdraw funds. I use Gemini, Bitstamp, Binance, Crypto.com",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8nba1m",
                    "author": "Early-Gift3928",
                    "score": 3,
                    "created_utc": 1652579625.0,
                    "response": "Kraken. Fuck Strike.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8m6wt1",
                    "author": "SmoothGoing",
                    "score": 7,
                    "created_utc": 1652560107.0,
                    "response": "Every large exchange is an alternative to coinbase.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8m7k0p",
                    "author": "Financial_Pianist209",
                    "score": 4,
                    "created_utc": 1652560411.0,
                    "response": "Kucoin is the best!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8mkefm",
                    "author": "escape1979uk",
                    "score": 3,
                    "created_utc": 1652566358.0,
                    "response": "Coinbase is fine... just transfer off immediately",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "upnjt6",
            "title": "It's never a bad idea to read and analyze anti-bitcoin sentiments. Here's Why.",
            "url": "https://www.reddit.com/r/Bitcoin/comments/upnjt6/its_never_a_bad_idea_to_read_and_analyze/",
            "author": "ResponsibleWhile6991",
            "created_utc": 1652553724.0,
            "score": 205,
            "num_comments": 129,
            "subreddit": "Bitcoin",
            "selftext": "You can't be unbiased if you're just hanging around in an echo chamber. Even if you think Bitcoin is the future, even if you think those against it are uneducated and don't understand anything, it's probably still a good idea to search out the best arguments against what you're investing in.\n\nListening to other people's perspectives is never a bad idea, especially with something still so new. Even if you disagree with somebody, hearing the other side of the argument is always good so you can understand their reasoning. \n\nI am not saying that you need to listen and do what people with opposing opinions are telling you, but on this subreddit, I constantly see posts deleted, or people attacking others in comments for absolutely no reason. This subreddit should be for open discussion for all views regarding Bitcoin.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8mo825",
                    "author": "Dazzling_Marzipan474",
                    "score": 46,
                    "created_utc": 1652568153.0,
                    "response": "Pfft. My girlfriend said I'd lose all my money if I bought crypto. Jokes on her, I'm only down 60%.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8lzmbt",
                    "author": "hurray_for_boobies",
                    "score": 41,
                    "created_utc": 1652556734.0,
                    "response": "So true.\n\nThe biggest challenge is probably finding knowledgeable critics, who know both sides of the argument and have identified credible concerns.\n\nThe recent What Bitcoin Did podcast about the risks of hyperbitcoinization was a rare gem that fits this category.\n\nIt's also what I was hoping /r/buttcoin to be but unfortunately most of it is conflating Bitcoin with some crappy wannabe cryptocurrencies or some scam NFT's to score cheap wins, not really well thought out criticism. I guess I should have known... it's practically in the name :-D",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8n22lh",
                            "author": "diradder",
                            "score": 8,
                            "created_utc": 1652574865.0,
                            "response": "If you want to get exposed to staunch anti-crypto but usually pretty tech-oriented people, visit Hacker News.\n\nI'm always impressed how the sentiment there is so anti-crypto and it's a bit less trollish/satirical than buttcoin.\n\nI don't think you'll get through to them though, most are completely unwilling to admit Bitcoin is different from other cryptocurrencies and the few who might concede this evidence will just insist it is not needed/useful and that in any case it's wasteful.\n\nUnfortunately these people will only consider Bitcoin useful when they will have no other choice (hyperinflation, war, etc.). I don't wish it upon them, maybe they'll never need Bitcoin, but it's still interesting to read them at times. I wouldn't waste my time debating them, but I do think about how to address their concern/criticism for conversation with people who are more open-minded.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8m3whg",
                            "author": "TheUnstoppableBTC",
                            "score": 14,
                            "created_utc": 1652558729.0,
                            "response": "buttcoin can only screech about Tether and Bored ape nfts these days. Their perpetually imminent Tether crash is their messiah. I’m sure such a thing would impact on the short term BTC-USD price, just as we saw with UST, but would naturally have no effect on the network whatsoever. \n\nBTC has slugged off the UST fallout and has a track record anti-fragility to a level which boarders on the eerie. I suspect the UST collapse would immunise bitcoin to further stablecoin issues to a degree.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8mzgna",
                            "author": "seambizzle",
                            "score": 4,
                            "created_utc": 1652573538.0,
                            "response": ">The biggest challenge is probably finding knowledgeable critics\n\n it's hard to find them cuz they are all advocates for bitcoin. A lot of them at first hated bitcoin, but took the time to learn and understand it, then realized how wrong they were.  Most of the guests I hear on my bitcoin podcasts (what bitcoin did, Pomps podcast, we study billionaires BTC episodes..) were once these types of people.  So many who were against bitcoin, only to change perspectives and become an advocate.  I have never heard from someone who was the opposite.  Someone who loved bitcoin only to hate it.  They don't exist",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8npi3e",
                                    "author": "incompletemischief",
                                    "score": 5,
                                    "created_utc": 1652587497.0,
                                    "response": "There's a lot of self awareness lacking here. You're so far in an echo chamber that you don't even believe anyone has ever left it because you can't see the exit anymore.\n\nI no longer advocate for bitcoin and think it's garbage so there's your first. Ironically I don't like to discuss it in detail on reddit for the reasons the OP outlined.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8m495z",
                    "author": "SahnSuolulous",
                    "score": 5,
                    "created_utc": 1652558892.0,
                    "response": "The more information we have, the better.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8lxx9b",
                    "author": "dadlif3",
                    "score": 33,
                    "created_utc": 1652555934.0,
                    "response": "What reddit should be vs what it actually is are two completely separate things. It SHOULD be an area for free speech and active discourse between opposing points of view but it IS an echo chamber and center for self-affirming group-think.\n\nThat said I absolutely agree with seeking out an opposing point of view. Most of the vocal critics of Bitcoin demonstrate a fundamental misunderstanding of the network and therefore I ignore their criticism because it is either uninformed or misinformed.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8msfyl",
                    "author": "jmw74",
                    "score": 4,
                    "created_utc": 1652570115.0,
                    "response": "Every objection to bitcoin was discussed back in 2010-13. Archives are still om bitcointalk.org but you have to wade through a lot of crap to find good discussions.\n\nPersonally I feel like I've heard them all. My mind is made up unless somebody's got something new.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8lzmok",
                    "author": "voltsmeter",
                    "score": 3,
                    "created_utc": 1652556738.0,
                    "response": "I agree, one can easily go to r/economy for bitcoin negativity.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8mb5tb",
                            "author": "OldMercenary",
                            "score": 3,
                            "created_utc": 1652562078.0,
                            "response": "r/buttcoin is even better plus you get the added benefit of unintelligible logic and random insults.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8mfpcu",
                                    "author": "voltsmeter",
                                    "score": 4,
                                    "created_utc": 1652564168.0,
                                    "response": "Buttcoin is the worst. They get a kick off of other’s misfortune",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8lxsw3",
                    "author": "TheUnstoppableBTC",
                    "score": 5,
                    "created_utc": 1652555876.0,
                    "response": "OP, have you come across many legitimate critiques? There don’t appear to be many",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8max6u",
                            "author": "Earth2Andy",
                            "score": 15,
                            "created_utc": 1652561969.0,
                            "response": "OK, I’ll bite….\n\n1/ Bitcoin will never become a day to day currency.  Bitcoin is not scalable to be used for day to day currency purposes.  Even with the lighting network overlaid there are still transaction costs to open and close a channel.  The fees associated, based on the energy consumed, make this unscalable in it’s current form.  (Happy to go into plenty more reasons why it won’t be used as a currency too, such as it’s deflationary nature, but scalability is the easiest one to cover).\n\n2/ Bitcoin will not be taken seriously as a stable store of value for another at least another 40 years, probably longer.  To be a more attractive as a store of value than the currently available options, the price of Bitcoin needs to be predictable over the long term.  Risk models for other stable assets like bonds or metals still price in events from the 70s and 80s.  Even if the price of Bitcoin stabilized today, the regular 50+% drops Bitcoin has experienced in the last decade will be priced into it’s risk profile making it unattractive as a store of value (note wild upside is not a plus for a stable store of value, that’s a feature of a speculation vehicle).  The volatility of Bitcoin has only gone up in the last 5 years not down.  This is not an indicator of it being a stable store of value any time soon.\n\n3/ Bitcoin isn’t a good uncorrelated asset.  There was for a while a school of thought that said Bitcoin was very useful as part of a portfolio, because it high upside that moved in an uncorrelated way to the rest of the market, allowing it to perform a diversification role in a balanced portfolio.  That is no longer the case, Bitcoin tracks the NASDAQ.  Maybe one day this will change, but that’s where it is right now.\n\n4/ Intrinsic demand.  The value of every currency is ultimately based supply and demand.  There is intrinsic demand for USD, every tax paying person or business in the US pays their taxes in Bitcoin.  The largest single buyer of goods and services in the world (us govt) will only pay you in USD.  Every time a gallon of gas is purchased anywhere on earth, some of that transaction ends up in USD.  Bitcoin cannot match that any time soon.\n\nSo it’s not useful as a currency, it’s not useful as a store of value, it’s not useful to stabilize a portfolio and there’s no intrinsic demand.\n\nThese are my arguments against Bitcoin.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "uppfke",
            "title": "Turkish Lira resumes path to hyperinflation.",
            "url": "https://i.redd.it/psbqmite1iz81.png",
            "author": "hyperinflationUSA",
            "created_utc": 1652559290.0,
            "score": 20,
            "num_comments": 7,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8mclji",
                    "author": "qainin",
                    "score": 7,
                    "created_utc": 1652562737.0,
                    "response": "Erdogan just pissed off Sweden, Finland and all their friends.\n\nThere will be a massive attack on the Turkish Lira on Monday. It's will be a bloodbath.\n\nYou can't lose money shorting the Lira.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8n0b3d",
                            "author": "Pouch-PH",
                            "score": 3,
                            "created_utc": 1652573974.0,
                            "response": "Perhaps if they started backing the Lira with bitcoin....",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "upcrw5",
            "title": "We need to stop thinking in terms of 'buying' and 'selling'",
            "url": "https://www.reddit.com/r/Bitcoin/comments/upcrw5/we_need_to_stop_thinking_in_terms_of_buying_and/",
            "author": "tallreagan",
            "created_utc": 1652516556.0,
            "score": 3,
            "num_comments": 14,
            "subreddit": "Bitcoin",
            "selftext": "You are converting your fiat shitcoins, the ones you don't need to pay the bills of this month anyway,  to the hardest money ever invented.\n\nWhy would you ever convert that back?",
            "stickied": false,
            "comments": [
                {
                    "id": "i8k0fwl",
                    "author": "AdMountain8413",
                    "score": 5,
                    "created_utc": 1652516610.0,
                    "response": "What is „selling“?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8k68oc",
                            "author": "Perfect_Orgsm",
                            "score": 4,
                            "created_utc": 1652521843.0,
                            "response": "I think they mean \"shelling\", that's when you collect shells around the beach",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8kbh3v",
                    "author": "Hughski",
                    "score": 3,
                    "created_utc": 1652526279.0,
                    "response": "Because it’s still hard to use BitCoins transactionally in a lot of cases. It’s been solid as an investment but as a currency it’s not exactly mainstream… that’s pretty much why.\n\nPanic selling during and because of a dip is obviously stupid but if you actually need to buy something from your investment during a dip, you’re gonna be in trouble.\n\nOf course that’s the same as with all investment but I guess it’s why BitCoin is better thought of as an asset than as a currency for the time being (at least outside of some niche albeit growing cases).",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "upp3q2",
            "title": "Been Buying Bitcoin every month since October 2017 (56 months)",
            "url": "https://www.reddit.com/r/Bitcoin/comments/upp3q2/been_buying_bitcoin_every_month_since_october/",
            "author": "jamespunk",
            "created_utc": 1652558335.0,
            "score": 711,
            "num_comments": 200,
            "subreddit": "Bitcoin",
            "selftext": "So I got obsessed with bitcoin back in October 2017. Was really bummed I found it so late and it was too late to have any sizeable amount of bitcoin anymore. Decided to buy as much as possible and tightened the budget to buy maximum amount every month. Been doing that for 56 months and gonna continue until my stack gives me freedom/security enough to quit the fiat hamster wheel. Decided to document my journey in a blog. Enjoy!\n\n[https://er-bybitcoin.com/stacking-em-volume-22-may-2022/](https://er-bybitcoin.com/stacking-em-volume-22-may-2022/)",
            "stickied": false,
            "comments": [
                {
                    "id": "i8m57du",
                    "author": "bitcoin_islander",
                    "score": 333,
                    "created_utc": 1652559330.0,
                    "response": "Same here. Used to throw 50% of my paychecks into crypto from 2018-2020. No one believed that I went from 5k to my name to 500k in crypto at the all time high. You dont need to believe in math, it just works people. Anyway, I quit my job in 2020 and I wish you can soon as well.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8mc7uj",
                            "author": "Lazy-Substance-5161",
                            "score": 73,
                            "created_utc": 1652562560.0,
                            "response": "Oh god same happened to me 2 years after you, except the gains of course lol",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8mn1qp",
                            "author": "botolo",
                            "score": 20,
                            "created_utc": 1652567605.0,
                            "response": "How do you survive? Do you sell some of your BTC every month to pay for rent and other stuff?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8ms3mm",
                                    "author": "CampyUke98",
                                    "score": 22,
                                    "created_utc": 1652569951.0,
                                    "response": "Look up FIRE lifestyle",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8ndrdq",
                                            "author": "BroncoFanInOR",
                                            "score": 5,
                                            "created_utc": 1652580908.0,
                                            "response": "Thanks for that - I hadn't heard of FIRE before and was an interesting read.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8nbo9j",
                            "author": "MonkeyThrowing",
                            "score": 40,
                            "created_utc": 1652579822.0,
                            "response": "I threw my bonus into Crypto about a year ago … I now have 1/2 bonus.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8ntl4s",
                                    "author": "somesortofidiot",
                                    "score": 11,
                                    "created_utc": 1652590032.0,
                                    "response": "If it was BTC, you still have your bonus.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8n2x5v",
                            "author": "harkmubb",
                            "score": 7,
                            "created_utc": 1652575284.0,
                            "response": "In Toronto I don't think I'd quit my job if I made $2M lol",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8n8qhc",
                            "author": "AnnonBayBridge",
                            "score": 13,
                            "created_utc": 1652578307.0,
                            "response": "You quit your job on $500K?? I mean it’s good money but it’s not *that* good. Unless you got a lower paying stress free job or something",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8nltaz",
                                    "author": "strangerpie",
                                    "score": 5,
                                    "created_utc": 1652585327.0,
                                    "response": "Nowadays public apartments are going for close to a million here on the resale market, 500k is very little and can't stretch out until retirement. Unless it's somewhere rural or some small town where you can grow your own food and live simply, I guess? If housing is not an issue and she has some inherited property then maybe it's still livable on that amount too.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8ntq29",
                                            "author": "somesortofidiot",
                                            "score": 9,
                                            "created_utc": 1652590118.0,
                                            "response": "Even if you dumped your 500k into passive income streams...that's not enough to live on. \n\nFolks that retire with $1m in a retirement fund are going to struggle before end of life.\n\n$5m is the new $1m",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8m8xlv",
                            "author": "noahk_h",
                            "score": 25,
                            "created_utc": 1652561042.0,
                            "response": "Username checks out",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8m927z",
                                    "author": "Woodpecker3453",
                                    "score": 63,
                                    "created_utc": 1652561101.0,
                                    "response": "Cos I'm a Islaaand Boiii",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8mq6rp",
                                            "author": "Hefty_Jicama",
                                            "score": 14,
                                            "created_utc": 1652569076.0,
                                            "response": "Please no",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8mpaa6",
                            "author": "blackhat8287",
                            "score": 8,
                            "created_utc": 1652568651.0,
                            "response": "Congrats on your conviction but serious question, is 500k enough to quit your job? Unless you mean you have 500k Bitcoin 🤓",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8mgrqg",
                            "author": "Pezotecom",
                            "score": 6,
                            "created_utc": 1652564661.0,
                            "response": "'crypto'",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8mvwv3",
                            "author": "o5mfiHTNsH748KVq",
                            "score": 6,
                            "created_utc": 1652571766.0,
                            "response": "I'll keep my DCA going because I believe institutional investors will pump it again. It would take some dramatic legislation to make me change anything about my auto purchases other than increasing them.\n\nDo I believe in cryptocurrencies? Not particularly. Do I believe investors will milk any opportunity into the ground through sketchy means unless somehow forced to stop? Absolutely.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8n0j99",
                            "author": "darcewaters",
                            "score": 6,
                            "created_utc": 1652574090.0,
                            "response": "you quit your job after having 500K in crypto? why?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8n62yw",
                                    "author": "matadorius",
                                    "score": 6,
                                    "created_utc": 1652576914.0,
                                    "response": "He invested 50% of her salary for 24months and only had 5k at his name i am.guessing his salary is not significantly high",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8mrruk",
                            "author": "gltovar",
                            "score": 7,
                            "created_utc": 1652569796.0,
                            "response": "\" it just works people\" recognize this is a \"survival bias\" statement. We are a million monkeys on a million typewriters, most often we celebrate and surface success and forget common failure.  https://freakonomics.com/podcast/the-folly-of-prediction/",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8mwoiq",
                                    "author": "runningdreams",
                                    "score": 7,
                                    "created_utc": 1652572142.0,
                                    "response": "Yes, but the difference in the analogy is everyone could have just done what the guy said he did. The monkey typewriter analogy illustrates just pure randomness with no agency or ability to maneuver.\n\nSo yes it's survivorship bias. But it's not really the monkey/typewriter analogy.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8mmvw0",
                            "author": "eterneraki",
                            "score": 3,
                            "created_utc": 1652567530.0,
                            "response": "Do you live in an extremely low cost of living area?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8mv7zb",
                                    "author": "luisvel",
                                    "score": 12,
                                    "created_utc": 1652571431.0,
                                    "response": "Remember people can also live outside the US. \nFor example, you can live very well with 2.5k a month in most of Europe.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8n4e11",
                                            "author": "Evgenii89",
                                            "score": 20,
                                            "created_utc": 1652576033.0,
                                            "response": "No no, the whole world is America and other places are just a myth.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8m7rjo",
                    "author": "gunsoverbutter",
                    "score": 62,
                    "created_utc": 1652560506.0,
                    "response": "Just curious, where do you recommend storing your Bitcoin?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8matgv",
                            "author": "x2c3v4b5",
                            "score": 70,
                            "created_utc": 1652561920.0,
                            "response": "Cold storage is best. Air gapped and multi-signature if you really want to go to the extreme of security at the expense of convenience.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8myhkm",
                                    "author": "IJustLoveWinning",
                                    "score": 6,
                                    "created_utc": 1652573042.0,
                                    "response": "Is a Ledger good enough? Right now, my coins are still on exchanges and I want to move it.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8n5zdp",
                                            "author": "x2c3v4b5",
                                            "score": 9,
                                            "created_utc": 1652576860.0,
                                            "response": "Yes, the device itself is fine; however, be aware that they have had their database leaked in regards to their client information. \n\nTheir physical device is fine, their IT security has had an infringement.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8nnecg",
                                                    "author": "nerdiestnerdballer",
                                                    "score": 6,
                                                    "created_utc": 1652586244.0,
                                                    "response": "Well said",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i8mcgzi",
                                    "author": "Lazy-Substance-5161",
                                    "score": 14,
                                    "created_utc": 1652562678.0,
                                    "response": "How do you set up multi sig, and can you explain what air gapped is? ty.\n\nedit:  currently i have my seed phrase stamped in metal and well hidden. Is it recommended to take more steps for security?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8mjygu",
                                            "author": "x2c3v4b5",
                                            "score": 26,
                                            "created_utc": 1652566149.0,
                                            "response": "Your seed phrase security setup is fine. Just get a cold storage device. \n\nAir gapped means that the CPU you use is NEVER connected to the internet.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8muqj6",
                                                    "author": "VPNApe",
                                                    "score": 9,
                                                    "created_utc": 1652571197.0,
                                                    "response": "How do you send Bitcoin without the internet?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8mvspm",
                                                            "author": "sholt1142",
                                                            "score": 17,
                                                            "created_utc": 1652571709.0,
                                                            "response": "Build an unsigned transaction, move to cold computer, sign the file, send back to hot computer, then broadcast.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8mza23",
                                                                    "author": "VPNApe",
                                                                    "score": 78,
                                                                    "created_utc": 1652573443.0,
                                                                    "response": "That made absolutely no sense to me",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i8n7g4z",
                                                                            "author": "sholt1142",
                                                                            "score": 56,
                                                                            "created_utc": 1652577627.0,
                                                                            "response": "When you try to send BTC on the bitcoin network, what is actually happening is that a specific type of file is constructed (a transaction request file) that contains identifiers to the UTXO(s) on the blockchain (your unspent BTC), the amount of BTC you want to send, and a receiving address. That file is then \"signed\" with cryptography in order to become valid. Those can be two separate steps done on two different computers, the only thing that matters is that the right file is broadcast to the network to be added in a block.  \n\n\nFun Fact: people have successfully sent BTC over HAM radio. Of course it still needs a willing party on the other end to connect to the internet, but as long as you can get the file to a node, the network takes care of the rest.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        },
                                                                        {
                                                                            "id": "i8n84ea",
                                                                            "author": "LongColtBandito",
                                                                            "score": 15,
                                                                            "created_utc": 1652577980.0,
                                                                            "response": "Yeah I’m with you none of that made any sense. I have some reading to do",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        },
                                                                        {
                                                                            "id": "i8n0cjj",
                                                                            "author": "pyh00ma",
                                                                            "score": 9,
                                                                            "created_utc": 1652573995.0,
                                                                            "response": "You can build a transaction. Let's say, \"wallet bc1q sends 5 BTC\". First, you need to sign the transaction with your private key, so you and only you can prove you want to send this 5 BTC. Then, you broadcast the transaction to the Blockchain, where the transaction either fails or succeeds",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "i8n5vfy",
                                                            "author": "BitcoinUser263895",
                                                            "score": 3,
                                                            "created_utc": 1652576802.0,
                                                            "response": "*Partially Signed Bitcoin Transactions* are passed back and forth from an internet connected device to an offline one.\n\nThe private keys never touch a network.\n\nEither a hardware wallet or a software wallet (like Electrum) running on an OS (like TailsOS) that has never and will never be connected to the internet.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i8me4wg",
                                            "author": "CryptoBehemoth",
                                            "score": 10,
                                            "created_utc": 1652563449.0,
                                            "response": "That should be enough to prevent loss by accident. That's technically close to the coldest of storage. But the reason people recommend cold storage devices usually is because they let you interact with the blockchain in a way that you know is safe. Imo it's a useful safety for the less technically savvy among us who still want to opt for self-custody.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i8n5h95",
                                            "author": "BitcoinUser263895",
                                            "score": 3,
                                            "created_utc": 1652576600.0,
                                            "response": "You're fine.\n\nAir-gapped just refers to not connecting the seed to the internet but signing transactions offline.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8nab1n",
                            "author": "beef-medallions",
                            "score": 6,
                            "created_utc": 1652579140.0,
                            "response": "Ledger nano x",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8mvq9e",
                            "author": "Kind_Barracuda2402",
                            "score": 26,
                            "created_utc": 1652571676.0,
                            "response": "I would recommend storing them at this address here\nbc1qnmcqc8pzhj7pqksrejy7ycgz09j2fegdulyngx",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8m4urc",
                    "author": "sophieoliver123",
                    "score": 46,
                    "created_utc": 1652559168.0,
                    "response": "I enjoy reading your posts.  Goes to prove a good DCA strategy works really well over time",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8m3qk4",
                    "author": "bigglesmac",
                    "score": 37,
                    "created_utc": 1652558655.0,
                    "response": "Beauty - this is cool op. Keep stacking sats!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8m8mdl",
                    "author": "encryptzee",
                    "score": 12,
                    "created_utc": 1652560900.0,
                    "response": "Can’t wait for my green line to rise above my dashed line. Great job staying the course. Funny how everyone always feels like they got in too late.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8m70t9",
                    "author": "mikesevnteen",
                    "score": 10,
                    "created_utc": 1652560161.0,
                    "response": "Your constancy can be envied.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8mboti",
                    "author": "SenatorAstronomer",
                    "score": 8,
                    "created_utc": 1652562316.0,
                    "response": "Ignore the haters, I enjoy reading your blog each time it comes out.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8m3rjy",
                    "author": "18476",
                    "score": 10,
                    "created_utc": 1652558667.0,
                    "response": "You honestly have never sold any ever? Anyway, i have been saying what you said about staking for the longest time and got beat up verbally for it. A long time back it seems alot of articles dissapeared about how that staking was connected to the derivatives game and being leveraged. Hedgefunds have been stated to have about 20% of thier net worth in this crypto game. It really does all line up.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8m4khw",
                    "author": "DestructorEFX",
                    "score": 6,
                    "created_utc": 1652559037.0,
                    "response": "Amazing as always! Your chart inspired me to do the same in Excel!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8mf4vo",
                            "author": "Into-the-Beyond",
                            "score": 9,
                            "created_utc": 1652563911.0,
                            "response": "I use MS paint, that way I can draw the lines however I want and ain’t nothin’ will tell me I’m wrong.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8miphe",
                    "author": "ANGELINA__JOLIE",
                    "score": 6,
                    "created_utc": 1652565569.0,
                    "response": "So your goal is 1 millions Euro. Funny that house prices are around that price now. so if you're young and just want to start a life and family. i think even bitcoin my not be able to fix this, even if you're a 2017 investor. \n\nbut if you already have a house. you're good. I think the main issue for everyone is buying a place to live in.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8mpqlh",
                            "author": "lunaticz0r",
                            "score": 9,
                            "created_utc": 1652568868.0,
                            "response": "lol 1million euro houses normal? Bit of an overstatement there bud and I live in a fairly expensive market in The Netherlands.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8myhdu",
                                    "author": "Temerity2",
                                    "score": 3,
                                    "created_utc": 1652573040.0,
                                    "response": "What's a 3 bedroom house on the outskirts of any major city cost roughly?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8mqp19",
                            "author": "Smokey-1733",
                            "score": 3,
                            "created_utc": 1652569314.0,
                            "response": "You'll find when you end up will 1 million euro worth of BTC, houses become less of an important consideration. You'll just want more BTC, as it can provide you with any luxury you think is important at the time, yes even a house if that's what you want. This whole nothing is more important than owning a house narrative, is becoming quite old.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8m7hlo",
                    "author": "Romsel87",
                    "score": 3,
                    "created_utc": 1652560380.0,
                    "response": "Are you going back to fiat when you reach your goal?",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "upl5wg",
            "title": "40% of all dollars were printed in 2020.",
            "url": "https://www.reddit.com/r/Bitcoin/comments/upl5wg/40_of_all_dollars_were_printed_in_2020/",
            "author": "_RetroDigital_",
            "created_utc": 1652546664.0,
            "score": 454,
            "num_comments": 160,
            "subreddit": "Bitcoin",
            "selftext": "Read that title carefully. 40%. It doesn't even include the dollars printed in 2021, and the first quarter of 2022.\n\nPeople around Reddit are saying \"the dollar is getting stronger!!1\". No it isn't. It is getting stronger compared to other currencies that haven't stopped the money printing. I don't care who you are or what bridge you are trying to sell me...printing 40+% of all your nations currency in the span of 2 years IS going to have repercussions going forward that we haven't felt yet. \n\nThe BTC to Dollar exchange rate is being affected by the fact that those who purchased BTC as a speculative asset are moving their money out of BTC back into dollars because they are fearful of a market crash. But your SATS haven't lost value in compared to the other SATS on the market...they will only go up in time.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8ldz7w",
                    "author": "Informal-Act1282",
                    "score": 101,
                    "created_utc": 1652546801.0,
                    "response": "The dollar is not getting stronger just more expensive to borrow due to interest rate increases, yikes.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8m71y5",
                            "author": "ralphyb0b",
                            "score": 10,
                            "created_utc": 1652560175.0,
                            "response": "It is more expensive relative to other currencies, which is really all that matters.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8ndzq9",
                                    "author": "kob112358",
                                    "score": 3,
                                    "created_utc": 1652581031.0,
                                    "response": "I wouldn’t say being stronger is all that matters, however it’s a very important aspect. If the wealth we’ve currently accumulated decreases by 50%, I’d say that’s pretty damn important.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8lngqi",
                            "author": "Keith_Kong",
                            "score": 24,
                            "created_utc": 1652551123.0,
                            "response": "Right, it’s more expensive to create more dollars, so it’s harder to leverage up investments. Bitcoin = investment right now so Bitcoin go down.\n\nIn future, Bitcoin go up.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8lw07d",
                                    "author": "Informal-Act1282",
                                    "score": 13,
                                    "created_utc": 1652555031.0,
                                    "response": "People cant borrow so they are selling their invrstments to afford stuff",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8lw7rx",
                                            "author": "Keith_Kong",
                                            "score": 19,
                                            "created_utc": 1652555127.0,
                                            "response": "That’s probably true in some cases, but most of it is wealthy institutions deleveraging their margin. They aren’t selling so they can afford their weekly bananas going up 25 cents.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8nasf5",
                            "author": "milkman1218",
                            "score": 3,
                            "created_utc": 1652579384.0,
                            "response": "Being young is hard. Luckily I have my youth to out live this madness, hopefully, I'm pretty bullish on life.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8mbxvw",
                    "author": "BerryMas0n",
                    "score": 42,
                    "created_utc": 1652562430.0,
                    "response": "Why keep spreading this wrong number and make the BTC community appear mathematically challenged?\n\nThe actual change in M2 was 25%, not 40%. Change in M3 was less. M1 isn't relevant since it doesn't consider bank accounts as money.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8mv6j0",
                            "author": "chk0123456",
                            "score": 9,
                            "created_utc": 1652571411.0,
                            "response": "This is the right answer, not the 40% or even the 70% some people are making up.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8nf6kd",
                            "author": "DrSkoolie",
                            "score": 6,
                            "created_utc": 1652581657.0,
                            "response": "ELI5: What's the difference between M1, M2 and M3?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8lm37i",
                    "author": "TheHodlingHermit",
                    "score": 27,
                    "created_utc": 1652550498.0,
                    "response": "DXY looks \"strong\" because other fiat is doing even more shitty. All fiat can suck my nutsack.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8lp760",
                            "author": "ShittingOutPosts",
                            "score": 4,
                            "created_utc": 1652551906.0,
                            "response": "All fiat currencies are trending towards zero.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8m7fn6",
                    "author": "BeastMiners",
                    "score": 44,
                    "created_utc": 1652560355.0,
                    "response": "40% of PRINTED dollars. Don't mislead.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8muu3k",
                            "author": "ForeignAdagio9169",
                            "score": 3,
                            "created_utc": 1652571245.0,
                            "response": "How much digital dollar was added then?",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8njqk5",
                            "author": "PlayActingAnarchist",
                            "score": 4,
                            "created_utc": 1652584142.0,
                            "response": "That is not right. The amount of actual money printed and put into circulation in 2020 was only $146 million, which is comfortably below average.\n\nWhat happened was that the Fed increased its balance sheet by 40% ($6.5 trillion), temporarily taking ownership of assets whose prices had fallen to free up liquidity at banks. They do this sort of thing every time there is an economic shock, recession, etc., because their mandate is to keep the economy afloat and keep unemployment as low as possible. If they don't free up liquidity in times of crisis, then they risk deflation, which typically leads to depression and sky-high unemployment.\n\nNow they are shrinking the balance sheet by $90-95 billion per month. If growing the balance sheet is equivalent to printing money (but it really isn't), then shrinking the balance sheet is equivalent to burning money (but it really isn't).",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8mbthk",
                            "author": "-send_me_bitcoin-",
                            "score": 24,
                            "created_utc": 1652562374.0,
                            "response": "He's pretty dumb and probably doesn't know the difference, I doubt he meant to mislead.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8mg0vx",
                                    "author": "JayKane123",
                                    "score": 9,
                                    "created_utc": 1652564316.0,
                                    "response": "Can you explain the difference to a retard",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8mjwdb",
                                            "author": "NewChallengers_",
                                            "score": 18,
                                            "created_utc": 1652566121.0,
                                            "response": "Only 3% of dollars in the economy are printed, in cash form. So this means like 1.3% of all total dollars in the world were created in the last year, M1 instead of 40% like it makes it sound (M2, look those M1 etc terms up on Google to learn more about how money supply is counted)",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8lyv2v",
                    "author": "KGandtheVividGirls",
                    "score": 6,
                    "created_utc": 1652556377.0,
                    "response": "The dollar is for moving value around in the economy. Nobody with even half a brain has their wealth in dollars in any significant way. They own assets that are valued in dollars. Also the US Navy pretty much assures trade in USD. Bitcoin will do whatever it does…. As interest rates FINALLY start going up",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8m3617",
                    "author": "ianyboo",
                    "score": 4,
                    "created_utc": 1652558394.0,
                    "response": "This feels like a pretty basic question but something I've been wondering: what does it mean for Bitcoin if a lot of it is being purchased with printed money? Like let's say the American government issues $2,000 stimulus checks to every American and they all buy a bunch of Bitcoin... Would that new money be artificially messing around with the price of Bitcoin?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8mkezx",
                    "author": "Space_Is_Hope",
                    "score": 5,
                    "created_utc": 1652566366.0,
                    "response": "Do you have a source ? Would like to have one to show people when I talk to them about inflation.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8mkfir",
                    "author": "Space_Is_Hope",
                    "score": 4,
                    "created_utc": 1652566373.0,
                    "response": "Do you have a source ? Would like to have one to show people when I talk to them about inflation.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8lvt7k",
                    "author": "dfunkmedia",
                    "score": 6,
                    "created_utc": 1652554939.0,
                    "response": "You know we had this same argument back in 2008 and everything turned out _fin..._\n\nOh fuck",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8n0mu5",
                    "author": "ExtremelyQualified",
                    "score": 3,
                    "created_utc": 1652574142.0,
                    "response": "This is not true, but it is true that over 60% of all Tether in existence was printed in the past year. So if you care about printing, care about it for BTC also.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8lv3bo",
                    "author": "livewhilealive",
                    "score": 6,
                    "created_utc": 1652554605.0,
                    "response": "Printed? I don’t think anything’s been actually printed",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8m72y8",
                    "author": "RemindMeToBlink",
                    "score": 4,
                    "created_utc": 1652560188.0,
                    "response": "Almost everyone is buying bitcoin as a speculative asset, since that’s what it is. Nobody is interested in it as a technology to replace fiat currency. Everyone wants to buy bitcoin, have it sky rocket in price and sell it for an actual usable currency the USD.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8lydzj",
                    "author": "Peccataclamantia",
                    "score": 5,
                    "created_utc": 1652556150.0,
                    "response": "Totally wrong.\n\nIn a subjective free-float zero sum debt based money system there is NO money supply.\n\nRepeat after me. There is no money supply.\n\nAll dollars are claims on someones sweat equity. That is all.Your neighbor flipping burgers at mcdonalds may have qualified for a mortgage and those new ‘dollars’ are backed by his future burger flipping.\n\nYou are always either a creditor or a debtor or a combination of both in this system. The majority of the population is a debtor-creditor being overweight towards the debtor side.\n\nThe collateral that backs the dollars(loans) is completely arbitrary and subjective. The majority of collateral is entirely virtual gambling debts, ie mortgages secured by the \\*belief\\* that home values always go up.\n\nHardly any of the dollars are secured by knowable principles that govern the universe and allow higher output innovation to occur.\n\nThe collateral is all guesses.\n\nWhat causes the instability of this system? The debts grow at compounding rates due to usury being a fundamental presupposition. All dollars(debts) are issued with interest that compounds at arbitrarily set rates. \\*There are no objective reasons for why an interest rate is what it is\\* just like a sports stadium has arbitrary rules.\n\nThere is always a shortage of sufficient credit worthy borrowers in this system which causes offered goods/service to always exceed money.\n\nWhere does the inflation come from? Again usury. Compounding requires prices to \\*increase\\* if innovation isn‘t increasing productivity fast enough. What has kept prices lower? Wage arbitrage ie wage slavery. Enslaving inferior cultures has allowed the NY-London based dollar system to work this long.\n\nAs the labor force collapses due to the unrepayability of the debts, the total liabilities will be collaterallized by fewer and fewer sweat equity meaning a nominal inflation and physical deflation.\n\nThe physical economy is \\*deflating\\* while the virtual-dollar economy is hyper inflating.\n\nCan bitcoin ’protect you’?\n\nNo.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8mbqjd",
                            "author": "BenGrahamButler",
                            "score": 3,
                            "created_utc": 1652562336.0,
                            "response": "This is an intelligent comment.  I wish I had the economics chops to tackle it but I don’t, so instead I’ll wait for a superior intellect to contribute.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8mgfhh",
                                    "author": "JayKane123",
                                    "score": 3,
                                    "created_utc": 1652564503.0,
                                    "response": "Someone smart please translate into idiot for me",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "id": "upqfio",
            "title": "This is why Bitcoin is important! The Federal Reserve & Inflation explained in 90 seconds!",
            "url": "https://www.youtube.com/watch?v=w3VaS8P3j3w",
            "author": "TonyLiberty",
            "created_utc": 1652562424.0,
            "score": 7,
            "num_comments": 9,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": []
        }
    ]
}