{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "v1kr96",
            "title": "How to Mine BTC",
            "url": "https://fb.watch/dlveB_zBz2/",
            "author": "crocodileeye",
            "created_utc": 1653982102.0,
            "score": 0,
            "num_comments": 0,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "v1kusd",
            "title": "Apparently we are all sociopaths 😂",
            "url": "https://i.redd.it/pdknflhslr291.jpg",
            "author": "TheHipHouse",
            "created_utc": 1653982552.0,
            "score": 2,
            "num_comments": 15,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "iamzu3z",
                    "author": "Consequenceplz",
                    "score": 1,
                    "created_utc": 1653982825.0,
                    "response": "Someone should tell him that all tradable assets are traded on a zero sum basis... If you want productivity you buy and build businesses. If you want the opposite of that you get into government. Having a positive attitude about the thing or having empathy in financial contexts (what a thought) doesn't change these things... What a load",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ian032g",
                            "author": "ndgoLiberty",
                            "score": 1,
                            "created_utc": 1653983048.0,
                            "response": "Yep. Stonk trading doesn’t directly affect the company at all. The equity is already sold. At best you’re just exit liquidity for the company and it’s insiders.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "ian06yv",
                            "author": "TheHipHouse",
                            "score": 1,
                            "created_utc": 1653983148.0,
                            "response": "If your in it to get rich in anything empathy is not a trait you can have. And let’s say you sold Bitcoin to somebody at peak they can always wait till the next all time high to sell again later. It’s not like we are committing fraud and you sell someone an advertised brand new house and they open the front door and it’s 100 years old and everything is rotted out",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ian0msj",
                                    "author": "Degree0",
                                    "score": 1,
                                    "created_utc": 1653983543.0,
                                    "response": "Buttcoin is a sub for the Butthurt. /r  ButthurtOverHavingNoBitcoin who's with me",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iamzwnc",
                    "author": "schooner-of-old",
                    "score": 1,
                    "created_utc": 1653982887.0,
                    "response": "Holy shit that last line is fucking hilarious 😂\n\n\nOne cannot claim to be participating in productive discussion about Bitcoin and then also go and say that lmao",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iamzz7s",
                    "author": "ndgoLiberty",
                    "score": 1,
                    "created_utc": 1653982952.0,
                    "response": "all those words and I still can’t figure one who’s side this guy is on",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ian025e",
                            "author": "schooner-of-old",
                            "score": 1,
                            "created_utc": 1653983026.0,
                            "response": "The person in the screenshot is staunchly anti-Bitcoin and is responding to a comment by OP I’m guessing",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ian0bar",
                    "author": "wwmore11",
                    "score": 1,
                    "created_utc": 1653983257.0,
                    "response": "Crypto and bitcoin are speculative investments, we get it buttcoin. Their markets are likely manipulated, filled with fraud, aid in ecological problems, are riddled with criminality, and certainly the culture surrounding them is at times ridiculous (queue memecoins, moons, lambos, maxi dreamers, tether, etc). We get it buttcoin. How is that any different than most any economic market in the world? The future is unknown. We get it buttcoin. Crypto could fail. But hey, 13 years later bitcoin is still here, still has a path to be determined, is far more relevant in the public eye than ever, and has plenty of room to grow. Screw that sub. It’s just a hater echo chamber attaching itself to anything and everything it can that fits their narrative. That said, it’s the same thing in here, right? Here’s to 10 more years of their shouting from the sidelines.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ian0k4r",
                            "author": "TheHipHouse",
                            "score": 1,
                            "created_utc": 1653983477.0,
                            "response": "Next Bitcoin halving, don’t know what I am more excited for the new all time high. Or just to make daily posts ripping on them with all the cool stuff we’re going to do with our btc gains",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ian21hk",
                                    "author": "wwmore11",
                                    "score": 1,
                                    "created_utc": 1653984832.0,
                                    "response": "Important to note that the halving effect will lessen over time. The supply is already minted at 90% today. The demand for current supply will hold much more weight determining immediate term valuations than the fractional decrease in minted supply post halving effect. The hype will still be there which should always gain attention in trade volume at halving, but I don’t actually see the waves of growth staying as exponential in the future. Far more important for adoption to increase  the demand than halving at this point.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ian25a1",
                                            "author": "TheHipHouse",
                                            "score": 1,
                                            "created_utc": 1653984930.0,
                                            "response": "I agree 100%",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ian1h9z",
                    "author": "StoicTechInvestor",
                    "score": 1,
                    "created_utc": 1653984311.0,
                    "response": "Just look at the uncontrolled emotion and absolute lack of grammar and punctuation. It's almost like the author is mentally ill or something. I hope they are ok🙏",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ian1or1",
                    "author": "solomonsatoshi",
                    "score": 1,
                    "created_utc": 1653984502.0,
                    "response": "Have you been trolling the sad arse buttcoiners again?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ian1rbk",
                            "author": "TheHipHouse",
                            "score": 1,
                            "created_utc": 1653984568.0,
                            "response": "Always don’t forget we are sociopaths, and trolling butt hurt buttcoiners is in our nature",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ian2cyi",
                    "author": "ender-steve",
                    "score": 1,
                    "created_utc": 1653985126.0,
                    "response": "I mean yeah do you disagree with him?",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}