{
    "subreddit": "BitcoinBeginners",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "urhibe",
            "title": "Why do different exchanges often display different prices for Bitcoin #BTC?",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/urhibe/why_do_different_exchanges_often_display/",
            "author": "samMannyDesigns",
            "created_utc": 1652774674.0,
            "score": 1,
            "num_comments": 6,
            "subreddit": "BitcoinBeginners",
            "selftext": "I am an absolute beginner in the cryptoverse and honestly it's quite overwhelming the various decisions one has to make. Anyway, my main concern at the moment is the varying prices of Bitcoin on different places such as Binance, Coinbase, Kraken, Coingecko etc. I'm trying to understand the rationale for this. Any help will be highly appreciated.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8x7ufa",
                    "author": "AutoModerator",
                    "score": 2,
                    "created_utc": 1652774675.0,
                    "response": "WassaWassaWassup! Scam Alert! Scammers are particularly active on this sub. They operate via private messages and private chat. If you receive private messages, be extremely careful. Use the **report** link to report any suspicious private message to Reddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BitcoinBeginners) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8xg0vv",
                    "author": "MuchTemperature6776",
                    "score": 1,
                    "created_utc": 1652782108.0,
                    "response": "They probably don’t get it in real time when you look at the current price and only updates it every N second,minute whatever. Bitcoin probably fluctuates enough that seconds apart will show differences.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8xu3so",
                    "author": "bitusher",
                    "score": 1,
                    "created_utc": 1652791460.0,
                    "response": "Every exchange has its own liquidity pool thus different market prices. Usually arbitrage reduces these differences to small amount but different regulatory restrictions , risk profiles, and other fees (binance having insanely high withdraw fees) can keep large market price differences.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8xv634",
                    "author": "planet_hallows",
                    "score": 1,
                    "created_utc": 1652792019.0,
                    "response": "The price an exchange lists is based on the lowest offer to sell on that exchange and the highest offer to buy on that exchange. When the lowest sell is lower than the highest buy, a trade happens and the price moves.\n\nDifferent investors will have offers on different exchanges, so they won't ever all have the same price. Traders look for these price differences and buy where it's lower and sell where it's higher. That's called arbitrage, and it causes the prices to converge to similar but not identical amounts.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "urhk4v",
            "title": "How can I buy Bitcoin underage?",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/urhk4v/how_can_i_buy_bitcoin_underage/",
            "author": "Hard_Boss",
            "created_utc": 1652774911.0,
            "score": 9,
            "num_comments": 16,
            "subreddit": "BitcoinBeginners",
            "selftext": "I am currently 15 and I want to buy Bitcoin. How can I do this or what apps/websites can I use that don’t require an ID verification?",
            "stickied": false,
            "comments": [
                {
                    "id": "i8x8f1t",
                    "author": "sos755",
                    "score": 2,
                    "created_utc": 1652775214.0,
                    "response": "You could ask your parents to buy it for you. Also, you can buy it from friends or at a Bitcoin meetup, or from a Bitcoin ATM.\n\nBTW, there are no age restrictions on buying bitcoins in the U.S. Generally, the issue is that you must be 18 to open an account at a financial institution.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8x8ots",
                            "author": "Hard_Boss",
                            "score": 1,
                            "created_utc": 1652775469.0,
                            "response": "Where can I find these Bitcoin meetups? And I’m from Switzerland just for clarification",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8xdi38",
                                    "author": "MuchTemperature6776",
                                    "score": 1,
                                    "created_utc": 1652779911.0,
                                    "response": "Switzerland has many ATMs for Bitcoin, so you could just use one of those if possible.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8xdn23",
                                            "author": "Hard_Boss",
                                            "score": 2,
                                            "created_utc": 1652780038.0,
                                            "response": "Are there also online methods? Bc I live in a incredibly rural area and it’s a long way into a city",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8xnwv3",
                    "author": "bitusher",
                    "score": 2,
                    "created_utc": 1652787882.0,
                    "response": "Best option is to speak with a parent and let them help you. Its wise to tell them that you want to start saving for college or a future business and want to invest in stocks(index fund), Bitcoin , and a fiat savings in preparation. Most parents will have no problem helping you and even be proud when you invest this way.\n\nmany people visit atms that only require sms verification for smaller amounts in this list - https://coinatmradar.com/\n\nOther options are any way that doesn't require verification like this list -\n\nhttps://www.reddit.com/r/BitcoinBeginners/comments/d7s0ph/cryptocurrency_exchange_buysell_cash_wire_wwo/f13z7vb/\n\nhttps://github.com/cointastical/P2P-Trading-Exchanges",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8x83m8",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1652774912.0,
                    "response": "WassaWassaWassup! Scam Alert! Scammers are particularly active on this sub. They operate via private messages and private chat. If you receive private messages, be extremely careful. Use the **report** link to report any suspicious private message to Reddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BitcoinBeginners) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8x97iv",
                    "author": "Fernxtwo",
                    "score": 1,
                    "created_utc": 1652775945.0,
                    "response": "Face to face, in a public place, a coffee shop or something. I'd post in some local FB groups.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8xhz8l",
                    "author": "Roguenad",
                    "score": 1,
                    "created_utc": 1652783720.0,
                    "response": "Have someone of age buy and keep in their name till you're of age ,that's what I did.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8xvesp",
                    "author": "unrottentomto",
                    "score": 1,
                    "created_utc": 1652792148.0,
                    "response": "Basically what I did is set up a account based on a adults name, then you can trade and buy crypto yourself. You can also pay your friends or adults cash in turn of crypto to your wallet. \n\nIf your parents don't let you, you can make a account that doesn't require verification (ID etc.) and just phone number and email, and pay cash to adult or friend to send cyrpto to your wallet. Its just like Paypal... You can buy, but you can receive and send.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8xtox2",
                    "author": "mrglubglub",
                    "score": 0,
                    "created_utc": 1652791245.0,
                    "response": "Please don't buy bitcoin at 15. The people here are peices of trash that have no concern for you and every concern for you buying in to their pyramid scheme.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}