{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "szayax",
            "title": "I came to Bitcoin for the gains but i will stay for the revolution. I will say NO to CBDC!",
            "url": "https://v.redd.it/1mjfnr835jj81",
            "author": "XLScrypto",
            "created_utc": 1645599318.0,
            "score": 2242,
            "num_comments": 377,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "hy2neml",
                    "author": "YarOldeOrchard",
                    "score": 139,
                    "created_utc": 1645600057.0,
                    "response": "Horrifying, but not a surprise at all",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hy4iwbz",
                            "author": "gmax9000",
                            "score": 5,
                            "created_utc": 1645638102.0,
                            "response": "Your sentiment holds true for many things, we have no control over these days.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hy4gciw",
                            "author": "fcthen",
                            "score": 4,
                            "created_utc": 1645637141.0,
                            "response": "True that, we were not prepared but we know these things.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hy3zwu4",
                            "author": "VeryChillBro",
                            "score": -10,
                            "created_utc": 1645630783.0,
                            "response": "So if someone hires me to mow their lawn, and they pay me in CBDC, how does the government approve or disapprove of the transaction? How do they know that I'm selling my labour, an approved loaf of government bread, or a gram of crystal meth? Government controlling what we buy through a CBDC is pretty far fetched.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hy40jxr",
                                    "author": "LibRightEcon",
                                    "score": 40,
                                    "created_utc": 1645631043.0,
                                    "response": "> how does the government approve or disapprove of the transaction? \n\nThey know exactly who you are sending funds to, and who that person is and what their business is that you are likely buying. \n\nThey can freeze or reverse any transaction, even if the guy already spent it, they can unravel it all. \n\nyou underestimate just how nasty it is.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hy44g3m",
                                            "author": "VeryChillBro",
                                            "score": -7,
                                            "created_utc": 1645632591.0,
                                            "response": "I'm failing to grasp how a government, or any authority, would know what the transaction is for. Please take a second to explain it to me: so I put up a couch on craigslist for 80 CBDC, you come over to purchase it. I help you load it into your pickup, and then we pull out our phones to complete the transaction. You send the CBDC to me, and the government somehow is watching us? Like a guy with binoculars pulls out his radio and is like \"Don't let the transaction through!\" or maybe the transaction is rolled back later and you get a free couch? Confused.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hy45r1f",
                                                    "author": "LibRightEcon",
                                                    "score": 22,
                                                    "created_utc": 1645633095.0,
                                                    "response": "They let it though. its a small amount, and neither of you are on any particular watch-list or flagged for de-humanization, yet.\n\nTry to send 100,000 CBDC and suddenly your and his accounts are frozen. And not just your main bank account, everything. Your salary, your bills, your whole life is frozen. Anything with the stink of your name now gets scrutinized.\n\nYou head to the bank service dept and beg for an explanation, or service.  You spend hours on the phone or in lines. They run you in circles everyday. \n\n\"We cannot tell you if your account is frozen, or if it is why it is frozen\"\n\nIf you are lucky, maybe they are satisfied with you being a good little servant, and let you go, after some steep fines. If not, you are basically an exile in your own home.\n\nFuck that future.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "hy474qw",
                                                    "author": "totally_not_shitting",
                                                    "score": 14,
                                                    "created_utc": 1645633625.0,
                                                    "response": "It's way easier than that. They can track every single purchase you or the seller have ever made. Maybe the guy you're buying the couch off has a shady past and they don't let it go through. They're removing cash from the equation. The reason people like cash so much is it's easy to use AND nobody can take it away",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "hy5ixbr",
                                                            "author": "midipoet",
                                                            "score": 2,
                                                            "created_utc": 1645651713.0,
                                                            "response": "> They can track every single purchase you or the seller have ever made.\n\nYou can also do this in Bitcoin. \n\nIf anything, Bitcoin has paved the way for the dystopian future that is presented by some of CBDCs.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "hy4jy4e",
                                                    "author": "new00000003",
                                                    "score": 5,
                                                    "created_utc": 1645638498.0,
                                                    "response": "Who is to say you would be allowed to send CBDC peer to peer? Maybe you are both classified only as consumers. In the consumer role you may only receive income from an approved approved employers list, and may only spend that income with retailers from an approved vendors list. \n\nTo get on the approved vendors list or the approved employers list would surely be an application fee just too much for your etsy shop or restaurant, but a drop in the bucket for a giant corporation.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "hy51zu6",
                                                    "author": "falconpunchpro",
                                                    "score": 4,
                                                    "created_utc": 1645645446.0,
                                                    "response": "Did you know that every time you walk into a store with a cellphone in your pocket, you generate enough data that marketers can effectively predict what you're there to buy? They know what aisles you stand in, they know how long you stand there, and they know how often you go there. \n\nNow imagine you went to a street corner for 30 seconds and made a $20 transaction with a known drug dealer. You *really* think the government can't figure out what you're doing?\n\nIt's all about metadata, man. Amazon knows what you want before you do, and the government isn't far behind.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "hy7jrj4",
                                                            "author": "Heph333",
                                                            "score": 1,
                                                            "created_utc": 1645684713.0,
                                                            "response": "The government isn't behind at all. Who do you think is the biggest purchaser of metadata? They no longer have to track everyone. The population has instead given more than the government could ever have dreamed of... And willingly. The government juat has to purchase it from Google, Facebook, etc.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "hy4mxk3",
                                                    "author": "GimmeDatDaddyButter",
                                                    "score": 2,
                                                    "created_utc": 1645639698.0,
                                                    "response": "Very easily. It will be similar to a POS transaction at a store. You will have to label what you're selling and what kind of transaction it is. You as the buyer will confirm you're buying what the person says they are selling. If you commit fraud and are caught, they will give harsh penalties. Extremely simple from a programmatic viewpoint.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "hy4rjxh",
                                                    "author": "kj4ezj",
                                                    "score": 2,
                                                    "created_utc": 1645641463.0,
                                                    "response": "The part where they see you listed a couch on Craigslist for 80 CBDC and then four hours later a transfer is attempted to you for 80 CBDC. This isn't exactly rocket science, it can be automated. They've unraveled much more complicated financial schemes than this one.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "hy4ppj4",
                                                    "author": "Dormant123",
                                                    "score": 1,
                                                    "created_utc": 1645640768.0,
                                                    "response": "Through taxes. You don’t file taxes but sent someone 15 grand? \n\n“How’d you get the money, sir?”",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "hy7jw02",
                                                            "author": "Heph333",
                                                            "score": 1,
                                                            "created_utc": 1645684789.0,
                                                            "response": "There will be no more filing of taxes with CBDC. Taxation will be automated.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "hy5izbn",
                                                    "author": "drbennett75",
                                                    "score": 1,
                                                    "created_utc": 1645651734.0,
                                                    "response": "If you’re in the US, go try to deposit $10k in cash at any bank. \n\nHow will they know?  They’ll ask. \n\n“Please open your CBDC wallet and upload selfies of both parties of the transaction, and a picture of the couch being sold, and stand by for automated approval.”\n\n“Sorry, your transaction was flagged for additional verification, please stand by.”\n\n“We are unable to determine whether this is an acceptable transaction remotely, as the couch appears to be the same model frequently found in drug houses. Please bring both parties and the couch to the nearest verification office for approval.”",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "hy9ho70",
                                                            "author": "VeryChillBro",
                                                            "score": 0,
                                                            "created_utc": 1645722525.0,
                                                            "response": "The scenario you're describing would make a functional economy impossible. Why would a government ever want to do this? Without a functional economy to tax, governments have no money, and no power. This guy on this podcast is completely full of shit.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "hy9iafl",
                                                                    "author": "drbennett75",
                                                                    "score": 0,
                                                                    "created_utc": 1645722759.0,
                                                                    "response": "If you examine your statements closely, you’ll notice that you didn’t really make an argument — you chained together a few logical fallacies. This guide might help you: https://owl.purdue.edu/owl/general_writing/academic_writing/logic_in_argumentative_writing/fallacies.html",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "hy7irtf",
                                                    "author": "Heph333",
                                                    "score": 1,
                                                    "created_utc": 1645684121.0,
                                                    "response": "They own the \"blockchain\" that the CBDC uses. You will have to enter what the transaction is for. Taxes will likely be taken out on the spot.\nNobody has to do anything.... It's fully automated. This is initially far more about making sure every transaction is taxed than anything else. As the tech evolves and data is collected it will then be applied to control the population as that is the ultimate purpose of taxes. To control behavior. Individuals accounts will be coded with what sorts of transactions are allowed. Whether their balance earns interest or pays it. And it will all be fully automated with just a few manual tweaks here and there. Imagine the bureaucracy you'll have to wade through when there's an error.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "hy9h1cz",
                                                            "author": "VeryChillBro",
                                                            "score": 2,
                                                            "created_utc": 1645722285.0,
                                                            "response": "In spite of all the downvotes I'm getting, I still don't understand how the government would know what is being bought and sold. Let's say you have an illegal good that I want to purchase. So, we pull out our CBDC wallets and I give you the money that you want. So you've handed me the crystal meth. Now, I enter in the wallet that I'm paying you for two hours work repointing my stone wall. Pretty fucking simple system to get around.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "hy9i7nh",
                                                                    "author": "Heph333",
                                                                    "score": 1,
                                                                    "created_utc": 1645722729.0,
                                                                    "response": "It'll be much harder to manufacture drugs when every transaction is monitored. They have AI algorithms that'll pick up that pattern in a second. For now, cash is how they go undetected.\n\nThey're far more concerned with tracking how much & who than with what. That is an  exponential leap forward in their level of control.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "hy47r0e",
                                                    "author": "xdozex",
                                                    "score": -8,
                                                    "created_utc": 1645633863.0,
                                                    "response": "This is all tin-foil hat bullshit being perpetuated as factual plans that WILL be implemented through CBDCs.\n\nYes, if a central bank or central authority controls the chain, I'm sure they can freeze accounts. But I wouldn't expect them to not have this mechanism. People are acting like it's some revolutionary new system that will give them more control. When they should be looking at it as a digital version of the current system we all live with now. Unless people are sitting on piles of cash, and only transact direct p2p, there's not really anything in a CBDC that they can't already do to a person keeping money in traditional bank accounts.\n\nIf I'm going to be using traditional fiat for most of my living expenses, I'd welcome a CBDC to replace the USD in the bank.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "hy49ay7",
                                                            "author": "poco",
                                                            "score": 7,
                                                            "created_utc": 1645634462.0,
                                                            "response": "The difference is who controls the CBDC vs who controls the bank.  Bank transactions are not trackable by the government unless they are large enough.  Yes, they can get warrants to access your account information, but it requires a court order of some form.\n\nIf the government was the bank, do they need a court order to inspect the accounts?",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "hy4dgmo",
                                                                    "author": "Dangerous-Honey-4481",
                                                                    "score": 6,
                                                                    "created_utc": 1645636035.0,
                                                                    "response": "Exactly THIS...  If Trudeau can freeze truckers bank accounts without a warrant or ANY legal justification, then the CBDC will be a nightmare for all of us who are already under the thumbs of the elite.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "hy4ii6m",
                                                                            "author": "togetherwem0m0",
                                                                            "score": -5,
                                                                            "created_utc": 1645637955.0,
                                                                            "response": "There is ample justification to act within the legal framework to interfere with the financial operations of a gang of people actively disrupting society. They did actual real harm to other people with their protest and they should be subject to accountability for their actions",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "hy4kmbg",
                                                                                    "author": "madeinthe80sg",
                                                                                    "score": 4,
                                                                                    "created_utc": 1645638748.0,
                                                                                    "response": "Agreed - use the existing legal framework and due process. No need for war time powers.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "hy5eatp",
                                                                                            "author": "Dangerous-Honey-4481",
                                                                                            "score": 3,
                                                                                            "created_utc": 1645650012.0,
                                                                                            "response": "^ THIS",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "id": "hy4jr7m",
                                                                            "author": "xdozex",
                                                                            "score": -1,
                                                                            "created_utc": 1645638427.0,
                                                                            "response": "Lol, ignoring my personal opinion on that whole situation, I'm not sure if you realize that CBDCs would change nothing. At a high level it would be a tool used between financial institutions. If it did expand to be something everyday people could use, it would basically be a digital version of our existing system. Everything people are claiming to be afraid of with this crack-pot's inaccurate breakdown on Rogan, is ALREADY POSSIBLE AND HAPPENING ALL THE TIME TODAY. \n\nI reiterate, CBDCs change nothing!!",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "id": "hy4aom3",
                                                                    "author": "xdozex",
                                                                    "score": -3,
                                                                    "created_utc": 1645634982.0,
                                                                    "response": "Absolutely no reason to assume the same laws wouldn't apply here as well. Just because a digital currency makes it easier to trace does not mean suddenly everyone will be tracing you and restricting your spending, just because they can.\n\nLet's assume, a bank did control the entire digital currency system that all people begin using as an alternative to cash. And let's say the government decided for some reason, that no new laws need to be passed to regulate how central banks can manage or operate these CBDCs.. why would any bank give a single shit if you sent me $10 worth of some digital token to pay for your share of dinner last night? Or what incentive would a bank have to limit who I transact with?\n\nRealistically, just like how regular, everyday users can't borrow money from the Federal Reserve, I'm assuming we won't be able to access any digital token that the Federal Reserve creates. I'm assuming it will be more like a digital system used by financial institutions that make the actual operational stuff happen faster, cheaper, with smoother record keeping.\n\nIf/when we do get a digital USD alternative, it would be completely crazy to assume it would happen through a bank with no oversight from the federal government.\n\nAnd to top everything off, nobody's forcing anyone to use a digital alternative system. If we eventually phased out cash, it would happen over tens of years, not months.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "hy4dsmv",
                                                                            "author": "poco",
                                                                            "score": 2,
                                                                            "created_utc": 1645636162.0,
                                                                            "response": ">Let's assume, a bank did control the entire digital currency system that all people begin using as an alternative to cash. ...\n\nAre we talking about a bank issuing their own currency?\n\n>Realistically, just like how regular, everyday users can't borrow money from the Federal Reserve, I'm assuming we won't be able to access any digital token that the Federal Reserve creates. I'm assuming it will be more like a digital system used by financial institutions that make the actual operational stuff happen faster, cheaper, with smoother record keeping.\n\nBanks already operate digitally, particularly between themselves.  You don't think that there are literal trucks of cash moving from the fed and back to borrowers every night?\n\n>If/when we do get a digital USD alternative, it would be completely crazy to assume it would happen through a bank with no oversight from the federal government.\n\nHold on, so is it operated by a bank or not?  If not then everything you said above is meaningless and what I said applies.  If the fe federal government issues and runs the digital currency then they can see every transaction without permission.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "hy4m1q3",
                                                                                    "author": "xdozex",
                                                                                    "score": 1,
                                                                                    "created_utc": 1645639331.0,
                                                                                    "response": "I bounced between a bank-run digital currency and a federal run digital currency because the original message I was replying to seemed to suggest one or both would be the issuers. \n\nI don't believe any individual bank will be able to create a digital USD alternative on their own. If a CBDC did drop, it would likely be organized through the government and coordinated through the Federal Reserve. At least, that's my best guess. \n\nAnd yes, I fully expect any transactions made through a federally controlled chain to be traceable, but I'm also not naive in thinking they can't/don't trace transactions made in normal bank accounts today. Yes they need a warrant to peer into transaction history, and I'd expect the same requirement to be in place in a digital system. \n\nBut tracing transactions was never really the big scary perspective being pitched in the video above. He was suggesting that the government would be monitoring ALL transactions, and actively deciding who each person gets to transact with. And as important as anyone person thinks they are, nobody gives a shit if you order a Big Mac from McDonalds, and certainly won't be intervening to block transactions to McDonalds if for some reason good ol' Ronald pissed them off. \n\nJust because the system would be a big upgrade from what we use today, does not mean existing laws just get tossed out the window.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "hy4zw4a",
                                                                                            "author": "poco",
                                                                                            "score": 1,
                                                                                            "created_utc": 1645644645.0,
                                                                                            "response": "How is it that different that what we use today.  Almost everything is done digitally.\n\nThe only difference between today's world, where each user keeps their own records of who owns what (each bank tracks the deposit accounts and central banks track who owes them what) and what I've seen proposed, is that the entire system would be public or controlled by one entity.\n\nIt would be the equivalent of creating one bank and requiring every citizen to have an account there and all transactions must happen through that one central bank.  Is that the future we want?  Just one bank?\n\nIf you say \"no, banks would exist and they would do transactions like today and reconcile between each other using a central system\" then how is that better than what we have today?",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "id": "hy4i91g",
                                                                                    "author": "togetherwem0m0",
                                                                                    "score": 0,
                                                                                    "created_utc": 1645637857.0,
                                                                                    "response": "The federal reserve is a bank. They are not part of the federal government. They have been granted authority to operate by the federal government, but they are not the government.\n\nIn the context of currency issuers, I trust the federal reserve to operate anstablecoin more than I would trust binance or any other corporation",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "id": "hy4xmip",
                                                                            "author": "mtndewaddict",
                                                                            "score": 1,
                                                                            "created_utc": 1645643790.0,
                                                                            "response": ">  Just because a digital currency makes it easier to trace does not mean suddenly everyone will be tracing you and restricting your spending, just because they can.\n\nThey already are doing this for your phone calls and text messages. Why would they not continue their standard practices of collect everything and use for later if needed when we give them an easy to trace digital system.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "hy4k0ce",
                                                            "author": "Kaffikup",
                                                            "score": 1,
                                                            "created_utc": 1645638521.0,
                                                            "response": "so you don't think its possible for western governments to overreach is then authority to invade your privacy? If we can think up these things on a stupid subreddit im sure the government is already testing those technologies. Also even though money is mostly digital now, there are still custodians of that money. If we get a CBDC all that data is centralized in the govt and easily manipulated.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "hy4f9jr",
                                                    "author": "BenTG",
                                                    "score": -4,
                                                    "created_utc": 1645636729.0,
                                                    "response": "The reason it doesn’t quite make sense to you is that you’re a rational thinking human, and your gut instinct — that this is tin-foil-hat conspiratorial nonsense — is right on the money.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "hy530n5",
                                            "author": "1561KWP",
                                            "score": 1,
                                            "created_utc": 1645645835.0,
                                            "response": "credit cards already to do this.  Not exactly the same but close to it.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "hy4jk3n",
                                    "author": "Kaffikup",
                                    "score": 2,
                                    "created_utc": 1645638351.0,
                                    "response": "you might get away with buying that meth for a couple years but if that person gets busted all their transactions will be traced back and all of a sudden you are pulled in front of a court 20 years later after getting clean. Even banks don't keep transactional records for that long and atleast the govt has to request that data.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "hy47pia",
                                    "author": "etmetm",
                                    "score": 1,
                                    "created_utc": 1645633847.0,
                                    "response": "It's later when you spend that money on something they retroactively deem \"terrorism\" without due process (donating 25 CAD to truckers in Canada while they were still on the road) they cut off your bank account.\n\nAlso maybe you've violated other laws they've passed such as speeding, not seeing a doctor when they mandate it, protesting, riding public transport with invalid ticket or something they can then suspend your CBDC account.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "hy5rkp8",
                            "author": "B-A-R-F-S-C-A-R-F",
                            "score": 1,
                            "created_utc": 1645654961.0,
                            "response": "buy privacy coins.\n\nencryption is our only way out",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hy2ryx5",
                    "author": "jaumenuez",
                    "score": 29,
                    "created_utc": 1645603590.0,
                    "response": "Who is this guy?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hy3hp52",
                            "author": "Reddituser1551",
                            "score": 44,
                            "created_utc": 1645622599.0,
                            "response": "Majid Nawaz",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hy61y3w",
                                    "author": "wgpb3l",
                                    "score": 1,
                                    "created_utc": 1645659229.0,
                                    "response": "Can you tell me more about this guy? I can't find him.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "hy5dlju",
                            "author": "morebeansplease",
                            "score": -3,
                            "created_utc": 1645649757.0,
                            "response": "Another jackass radio show personality that makes money by scaring people.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hy3hqtf",
                    "author": "moved-to-brazil",
                    "score": 24,
                    "created_utc": 1645622623.0,
                    "response": "im not ready for the bitcorn famine",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hypu6cl",
                            "author": "Steve_at_Reddit",
                            "score": 1,
                            "created_utc": 1646009611.0,
                            "response": "Bircorn is a genetically modified strain of Bitcoin",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hy38ulz",
                    "author": "Ru9on",
                    "score": 81,
                    "created_utc": 1645617270.0,
                    "response": "We should start to insist on getting payed in BTC. The sooner you can close and delete your bank account the better.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hy572ra",
                            "author": "clevariant",
                            "score": 5,
                            "created_utc": 1645647366.0,
                            "response": "Maybe what's needed is an ATM that runs on lightening.  Avoid paying bitcoin fees when you want to withdraw cash.  You could transfer a few thousand into the service's lightening channel, and then withdraw cash whenever you need it, paying only lightening fees and a little more for the ATM.\n\nWould that work?  I'd use that service.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hy79nsk",
                            "author": "kolodapavlo",
                            "score": 4,
                            "created_utc": 1645679163.0,
                            "response": "A good idea but it's not possible in my city, I am sorry for that.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hy38v9q",
                            "author": "Paid-Not-Payed-Bot",
                            "score": 55,
                            "created_utc": 1645617283.0,
                            "response": "> on getting *paid* in BTC.\n\nFTFY.\n\nAlthough *payed* exists (the reason why autocorrection didn't help you), it is only correct in:\n\n * Nautical context, when it means to paint a surface, or to cover with something like tar or resin in order to make it waterproof or corrosion-resistant. *The deck is yet to be payed.*\n\n * *Payed out* when letting strings, cables or ropes out, by slacking them. *The rope is payed out! You can pull now.*\n\nUnfortunately, I was unable to find nautical or rope-related words in your comment.\n\n*Beep, boop, I'm a bot*",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hy3gzey",
                                    "author": "Ru9on",
                                    "score": -40,
                                    "created_utc": 1645622222.0,
                                    "response": "The sooner English will stop being the global language the better\n\nEdit: vote hear for teem English! lol modern day Redditors. \n\nEdit 2: If you really felt the need to weigh in on my tongue in cheek reply to the grammar bot or vote for your favourite language you might need to lighten up and stop talking life so seriously. In any way, please don't hold back your frustrations and downvote this to oblivion. Let's goooooo",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hy44vfm",
                                            "author": "LibRightEcon",
                                            "score": 11,
                                            "created_utc": 1645632757.0,
                                            "response": "> The sooner English will stop being the global language the better\n\nEnglish came about as a creole of norse, anglo-frisian, and norman french, where existing conquered people adapted to the language of the victors mostly do to personal individual motives. It already has a history of being a common tongue. It spread largely to the huge global political power of imperial england, then by the american hegemon. \n\nBut today, the preeminance of english the language no longer has to do with english or american political might, nor the spattering of small english speaking nations like singapore, nor the great quantity of  english speakers in india. Now it is the corpus itself, the coded body of material, which gives it utility. The sheer volume of material, from entertainment, documentation, and science, which is done in English, and that fact that it is mostly digitally stored for perfect reproduction,  means the language has a permanent place near the top of language popularity. Even digital and internet communications is English first, with ascii being the first and simplest to encode of any glyphs.\n\nWhile it is a very complex and difficult language to be proficient in, it has some aspects of simplicity, and few accidents of history made it easy to spread technologically. The simplest writing system of any allowed to to easy to digitize. The lack of tones, insensitivity to vowel errors, and simple basic grammar allows it to be easily set to any music, and easily adapted to most speakers phoneme set. These are features expected in a creole.\n\nAlso, technology has shrunken the globe. The network effect tends to dominate in highly connected systems. In a poorly connected system, languages tend to rapidly deviate, such as the bloom of altcoins of every color and style. Just as bitcoin will one day kill all altcoins, English or some future creole of it, will one day be the de-jure earth common tongue, which it is in fact already is for the most part.\n\nEnglish is the language of the sky and sea, required by all those who leave the shores. English is already the language of outer space, and all space farers expect to have their instruments, documentation, and comms all in english. \n\nI myself would have preferred a logical and simple language, such as esperanto, but it was not to be. English, with all its quirks and warts, and become the official language of humanity. Since the world is fully interconnected, it may be too late to change that. The network effect guarantees that more value flows into english every day, at the expense of alternative languages. Everyday, alt languages shrink and lose value, becoming less relevant to the lives of future humans. I dont know when, but one day alt languages will become little more than historical artifacts to be studied as a hobby.\n\nI'm afraid the goose is cooked.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hy4jgel",
                                                    "author": "togetherwem0m0",
                                                    "score": 3,
                                                    "created_utc": 1645638312.0,
                                                    "response": "Nice post. Id relate the concept to surname simplification as well. Over time given enough generations, one surname becomes dominant, as the weaker surnames are eaten up by the larger one. It's a game of numbers with very few breakpoints to go a different direction.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "hy3h8wt",
                                            "author": "ishirleydo",
                                            "score": 7,
                                            "created_utc": 1645622363.0,
                                            "response": "How about Naʼvi?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hy5njjw",
                                                    "author": "RAabd177",
                                                    "score": 2,
                                                    "created_utc": 1645653414.0,
                                                    "response": "Sounds great, now I just need a person who can teach me that.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "hy3nhyz",
                                                    "author": "Nissepool",
                                                    "score": 1,
                                                    "created_utc": 1645625445.0,
                                                    "response": "I prefer morse code",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "hy5h9av",
                                                            "author": "Goodfella_17",
                                                            "score": 7,
                                                            "created_utc": 1645651104.0,
                                                            "response": "The best one, then we all should be quite and calm lol",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "hy5nug3",
                                                                    "author": "ishirleydo",
                                                                    "score": 1,
                                                                    "created_utc": 1645653526.0,
                                                                    "response": "And quiet too.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "hy5y7w8",
                                                                            "author": "Nissepool",
                                                                            "score": 2,
                                                                            "created_utc": 1645657649.0,
                                                                            "response": "Yes indeed, quite",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "hy3q64a",
                                                            "author": "fuzzytradr",
                                                            "score": 2,
                                                            "created_utc": 1645626668.0,
                                                            "response": "How about a Norse code?",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "hy4t2jb",
                                                                    "author": "Nissepool",
                                                                    "score": 0,
                                                                    "created_utc": 1645642044.0,
                                                                    "response": "Like runes? Sure",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "hy696fe",
                                            "author": "louiejenksta",
                                            "score": 3,
                                            "created_utc": 1645662392.0,
                                            "response": "We should start speaking Hindi, I heard about that in India lol.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "hy3ntfb",
                                            "author": "RonPaulWasR1ght",
                                            "score": -2,
                                            "created_utc": 1645625596.0,
                                            "response": "I don't think the language has anything to do with anything.  Tyranny rules in many nations that don't speak English (and in some that do).",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hy78hbj",
                                                    "author": "anhducsc",
                                                    "score": 1,
                                                    "created_utc": 1645678582.0,
                                                    "response": "True, we should never blame any language for things like that.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "hy5t8ry",
                                    "author": "B-A-R-F-S-C-A-R-F",
                                    "score": 1,
                                    "created_utc": 1645655624.0,
                                    "response": ">buy privacy coins.  \n>  \n>encryption is our only way out of this hellhole",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "hy5d893",
                            "author": "Str8Fac3",
                            "score": 1,
                            "created_utc": 1645649622.0,
                            "response": "ExitTheFed",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hy5dbmj",
                            "author": "evertrollz",
                            "score": 1,
                            "created_utc": 1645649656.0,
                            "response": "Close your bank account to pay your mortgage to your *checks note* bank?",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hy5su0x",
                            "author": "NegotiationNice9291",
                            "score": 1,
                            "created_utc": 1645655461.0,
                            "response": "Canadians are the first in line who needs to do this ASAP",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hy572qg",
                            "author": "ajphoenix",
                            "score": 0,
                            "created_utc": 1645647365.0,
                            "response": "Lmao Yea I would love to see my salary dump 20 percent in a day.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hy3dkf7",
                    "author": "BelenkaZdarova",
                    "score": 18,
                    "created_utc": 1645620302.0,
                    "response": "This is madness",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy3ibqo",
                    "author": "LivingMeatOfTheEarth",
                    "score": 13,
                    "created_utc": 1645622926.0,
                    "response": "11:11 #Bitcorn",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hypue2n",
                            "author": "Steve_at_Reddit",
                            "score": 2,
                            "created_utc": 1646009712.0,
                            "response": "Bitcorn = GMO",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hy452mr",
                    "author": "bigdaddysexy69",
                    "score": 10,
                    "created_utc": 1645632835.0,
                    "response": "The crazy thing is half of America will want this and vote this into office because they are lazy dumb commies who want the government to take care of them from cradle to coffin",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy3e4ec",
                    "author": "Bonzeno",
                    "score": 35,
                    "created_utc": 1645620621.0,
                    "response": "Which black mirror episode is he talking about?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hy3hj43",
                            "author": "mfalivestock",
                            "score": 31,
                            "created_utc": 1645622513.0,
                            "response": "Season 3 episode 1. Nosedive.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hy3mayd",
                                    "author": "lezorte",
                                    "score": 29,
                                    "created_utc": 1645624885.0,
                                    "response": "Let's not forget Community season 5 episode 8. I'm convinced that China's system was modeled after MeowMeowBeanz",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hy432xt",
                                            "author": "Flammable_Flatulence",
                                            "score": 11,
                                            "created_utc": 1645632050.0,
                                            "response": "Most people don't know the community Episode was made 2 years prior to the Black Mirror episode.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hy48cwc",
                                                    "author": "lezorte",
                                                    "score": 10,
                                                    "created_utc": 1645634099.0,
                                                    "response": "Dan Harmon be like \"guys, it was meant to be a joke!\"",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "hy4styt",
                                                    "author": "BHN1618",
                                                    "score": 4,
                                                    "created_utc": 1645641952.0,
                                                    "response": "thanks for sharing that. Community is an amazing show that says a lot under the guise of simply college life.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "hy3k55t",
                                    "author": "Bonzeno",
                                    "score": 3,
                                    "created_utc": 1645623846.0,
                                    "response": "Thanks",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hy2xf2t",
                    "author": "sakiman117",
                    "score": 98,
                    "created_utc": 1645608076.0,
                    "response": "He is correct about what is happening…it will get worse.\nPrepare for the struggle for control over your life.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hy3vc5d",
                            "author": "tjackson_12",
                            "score": 15,
                            "created_utc": 1645628898.0,
                            "response": "Yea I don’t see this not happening. The US already published their white paper on their currency",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hy46f57",
                                    "author": "massivecalvesbro",
                                    "score": 12,
                                    "created_utc": 1645633351.0,
                                    "response": "Link?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hy5nmvu",
                                            "author": "CryptoBehemoth",
                                            "score": 2,
                                            "created_utc": 1645653448.0,
                                            "response": "I want to read that too!",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hy64xe6",
                                                    "author": "tjackson_12",
                                                    "score": 2,
                                                    "created_utc": 1645660512.0,
                                                    "response": "Just posted that link.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "hy3u73p",
                            "author": "makerkz",
                            "score": 4,
                            "created_utc": 1645628414.0,
                            "response": "I hope people will understand his words, it's pretty important.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hy63p75",
                                    "author": "kcherryDURHAM",
                                    "score": 1,
                                    "created_utc": 1645659978.0,
                                    "response": "Loud and clear!!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hy3p63v",
                    "author": "push_squares",
                    "score": 66,
                    "created_utc": 1645626220.0,
                    "response": "Man the most valuable thing he said for all the cornballs in this sub. \n\n“It’s not left or right anymore it’s up or down, it’s about power and those who don’t have power.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hy4e7e1",
                            "author": "Slapshot382",
                            "score": 12,
                            "created_utc": 1645636320.0,
                            "response": "Thank you. The people will win and truth will prevail. Let those who unite within truth and freedom win. \n\nOur global leaders have overstepped their boundaries severely. \n\nLet the world unite.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hy797y2",
                            "author": "czgheib",
                            "score": 2,
                            "created_utc": 1645678949.0,
                            "response": "I noticed that too.\n.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hy4jn9z",
                            "author": "togetherwem0m0",
                            "score": -4,
                            "created_utc": 1645638385.0,
                            "response": "While I agree with this, I don't cbdc as an us vs them proposition. It's a digital stable coin run by a regulated bank with authority from the government. It's no different than what we have today",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hy4qfc4",
                                    "author": "push_squares",
                                    "score": 4,
                                    "created_utc": 1645641036.0,
                                    "response": "It’s a lot different pertaining to the frameworks of a social credit system. Our money currently cannot be denied based on any type of social scoring or data analysis. \n\nHopefully you have more sats than common sense",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hy4u4zv",
                                            "author": "togetherwem0m0",
                                            "score": 0,
                                            "created_utc": 1645642450.0,
                                            "response": "why do you think a cbdc would be linked to a social credit system? is there any evidence of this?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hy4xvbk",
                                                    "author": "push_squares",
                                                    "score": 2,
                                                    "created_utc": 1645643884.0,
                                                    "response": "Are you dense this is over half of the conversation being had in the clip OP posted.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "hy51byk",
                                                            "author": "togetherwem0m0",
                                                            "score": -1,
                                                            "created_utc": 1645645194.0,
                                                            "response": "I fundamentally disagree with their interpretation of what's going on. Their framing is incorrect and to me seems to be intentionally so.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "hy63anv",
                                                                    "author": "oxnaes",
                                                                    "score": 2,
                                                                    "created_utc": 1645659804.0,
                                                                    "response": "The potential is there if we go down this road. Do we want to give a handful of unelected officials (Fed) that kind of power? \n\"Let me control a nation's money, \nand I do not care who writes the laws\" -some oldschool banker",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "hy69kh9",
                                                                            "author": "togetherwem0m0",
                                                                            "score": 0,
                                                                            "created_utc": 1645662569.0,
                                                                            "response": "There is zero indication of going down that road though. The only thing we have is the speculation of some people on a stupid podcast that was elevated by Joe Rogan who is a certified moron.\n\nWe could also go down that path without cbdc as well. All the tools to do this exist today. We can oppose them and be just fine. What I'm saying is we wouldn't react to misinformation the way that we are. Cbdc is healthy for the crypto ecosystem, extremely healthy. Resistance to it born out of a misunderstanding propagated by known idiot Joe Rogan is wrong-headed",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "id": "hy52xrw",
                                                                    "author": "push_squares",
                                                                    "score": 1,
                                                                    "created_utc": 1645645806.0,
                                                                    "response": "Nobody is asking you of your opinion, you literally stated your opinion hoping to engage in some sort of trivial debate or conversation. That’s fine you’re entitled to think however you would like. Nobody has to care or converse with you though I’m not sure what you’re looking for.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "hy57nhz",
                                                                            "author": "togetherwem0m0",
                                                                            "score": 0,
                                                                            "created_utc": 1645647578.0,
                                                                            "response": "in this thread: idiots that are in a discussion forum that tell people their opinions aren't asked for.\n\nfuck off",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "hy692sg",
                                                                                    "author": "push_squares",
                                                                                    "score": 1,
                                                                                    "created_utc": 1645662346.0,
                                                                                    "response": "Boo hoo",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                },
                                                                                {
                                                                                    "id": "hy69f88",
                                                                                    "author": "push_squares",
                                                                                    "score": 1,
                                                                                    "created_utc": 1645662503.0,
                                                                                    "response": "Take your downvotes and go home make sure to buy the dip to",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "hy5ctjs",
                            "author": "morebeansplease",
                            "score": -2,
                            "created_utc": 1645649474.0,
                            "response": "The Right is about hierarchies or power structures.\n\nThe Left is about equality or lack of power structures.\n\nPlease help me understand how what you're saying makes any sense.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hy6987l",
                                    "author": "push_squares",
                                    "score": 2,
                                    "created_utc": 1645662415.0,
                                    "response": "I didn’t say anything that doesn’t make sense it’s literally quoted from the video clip that was posted. If you can’t make sense of what is being said I don’t know how I can help you.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hy6ass0",
                                            "author": "morebeansplease",
                                            "score": -1,
                                            "created_utc": 1645663117.0,
                                            "response": "Wait, you don't understand it enough to explain it, yet you quoted it. My bad for asking the sheep to explain what the shepherd said.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hy6ec5k",
                                                    "author": "push_squares",
                                                    "score": 2,
                                                    "created_utc": 1645664706.0,
                                                    "response": "Lol you’re something else, \n\nHow is it not clear “ it’s not about left or right”, this is referring to the political spectrum and the division among citizens and their respective parties. It’s been about power and who does or does not possess it.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "hy6h8q0",
                                                            "author": "morebeansplease",
                                                            "score": 0,
                                                            "created_utc": 1645666022.0,
                                                            "response": "Uh..  what? Where do you think the power structures in society come from? Are they magic or perhaps invisible? Because from what I can tell, politics, or the governance of a country, would seem to be what creates and maintains power structures. \n\nHelp me out. What definition of power structures are you using that isn't political?",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "hy6el5i",
                                                    "author": "push_squares",
                                                    "score": 1,
                                                    "created_utc": 1645664821.0,
                                                    "response": "From your comments it seems you’re still actively participating in polarized political spectrums. I’m sorry I’m not going to argue with you though have fun.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "hy6gvjf",
                                                            "author": "morebeansplease",
                                                            "score": 0,
                                                            "created_utc": 1645665858.0,
                                                            "response": "That's a funny way to say dictionary definitions. Being informed isn't for everyone. Good for you setting up boundaries.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "hy6h5rp",
                                                                    "author": "push_squares",
                                                                    "score": 1,
                                                                    "created_utc": 1645665986.0,
                                                                    "response": "You’re NGMI",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "hy6j59y",
                                                                            "author": "morebeansplease",
                                                                            "score": 1,
                                                                            "created_utc": 1645666871.0,
                                                                            "response": "Ohh, look at that, a thought terminating cliché. Also, I just got out-grouped. Oh gosh, my social capital is now in question. I must redeem my standing in this conversation or risk the dreaded belittling, out-group, down vote brigade. What will the other sheep think of me then. Can my self-esteem handle that!\n\nHey you, little sheep, can you show some respect, you're talking to a shepherd. \n\nThe way I see it is you got two options. You can either establish good faith and participate in the conversation. Or you can continue to act childish. Wait, or, last minute introduction, maybe surprise me and just stop talking. Now we got three options... So many to choose from. I'm so excited to see the very predictable incoming response will be.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "hy9cjky",
                                                                                    "author": "push_squares",
                                                                                    "score": 1,
                                                                                    "created_utc": 1645720587.0,
                                                                                    "response": "You’re the only one who cares enough to continue to write novels? I’m not even sure what you’re trying to talk about at this point.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "hy9d7oy",
                                                                                            "author": "morebeansplease",
                                                                                            "score": 0,
                                                                                            "created_utc": 1645720841.0,
                                                                                            "response": "Sheep don't understand the reasoning behind the shepherd. They don't use language to better understand the world. Instead they use language to give and recieve instructions.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hy2rdm1",
                    "author": "Complete-Elk-1913",
                    "score": 59,
                    "created_utc": 1645603128.0,
                    "response": "Agreed we stand against this now we will never have to deal with it later",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hy4rvvi",
                            "author": "wsladd01",
                            "score": 10,
                            "created_utc": 1645641590.0,
                            "response": "Indeed, we all should stand against this right now, it's important.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hy5cjtf",
                            "author": "morebeansplease",
                            "score": -1,
                            "created_utc": 1645649377.0,
                            "response": "When they forced the needy onto EBT, did you stand up for them?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hy3xdv7",
                    "author": "NoahB76",
                    "score": 10,
                    "created_utc": 1645629745.0,
                    "response": "Well he is not wrong and I appreciate his every word here.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy3aazu",
                    "author": "ThisPartIsDifficult",
                    "score": 23,
                    "created_utc": 1645618264.0,
                    "response": "China's already done this with the Yuan",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy2tvt1",
                    "author": "Sully0387",
                    "score": 49,
                    "created_utc": 1645605150.0,
                    "response": "This was a great podcast",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hy4aaf9",
                            "author": "fijikin",
                            "score": -17,
                            "created_utc": 1645634835.0,
                            "response": "The guy was speaking absolute nonsense for three hours. Was a slightly diluted Alex Jones. Nothing he said was even remotely reliable.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hy4ct8b",
                                    "author": "arrogoth",
                                    "score": 9,
                                    "created_utc": 1645635789.0,
                                    "response": "Wasn't Alex Jones proven right about a ton of shit years ago including kiddy Island when everyone said he was insane.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hy4iyr7",
                                            "author": "fijikin",
                                            "score": -3,
                                            "created_utc": 1645638128.0,
                                            "response": "Is you fling enough shit some of it will stick. Alex Jones is a rabble rouser.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hy5da7m",
                                                    "author": "jakefligner",
                                                    "score": 2,
                                                    "created_utc": 1645649641.0,
                                                    "response": "He was right.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "hy5lg2l",
                                                            "author": "W1nd",
                                                            "score": 1,
                                                            "created_utc": 1645652636.0,
                                                            "response": "About Sandy hook?",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "hy4ftop",
                                    "author": "Sully0387",
                                    "score": 3,
                                    "created_utc": 1645636941.0,
                                    "response": "Some of it was nonsense to be fair but he also had a few valid points which can be evidenced.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hy4jevo",
                                            "author": "fijikin",
                                            "score": 1,
                                            "created_utc": 1645638297.0,
                                            "response": "What was the evidence? Emperor palatine? The daily mail headlines? Calling random politicians communist? Repeatedly saying psy op? He said absolutely nothing of substance. \n\nJoe was good on calling him out and questioning him in the first hour, but seemed to just start accepting what he said as fact in the latter part. \n\nHe argues more with qualified scientists than he did with this guy.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "hy4ljto",
                                            "author": "LetMeFuckYourFace",
                                            "score": 1,
                                            "created_utc": 1645639125.0,
                                            "response": "Anyone with a British accent start spewing shit and people will listen.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "hy4m52q",
                                    "author": "PowerToThePanels",
                                    "score": 1,
                                    "created_utc": 1645639370.0,
                                    "response": "He predicted Russia shutting off gas to Europe, and the price of energy skyrocketing. \n\nThe price has already increased since Putin invaded Ukraine yesterday. And Nord Stream 2 has been cancelled by Germany.\n\nFamine is next!",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hy4my5s",
                                            "author": "fijikin",
                                            "score": 2,
                                            "created_utc": 1645639705.0,
                                            "response": "He predicted war or the potential for it would increase fossil fuel prices? He must be an oracle.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hy52q6p",
                                                    "author": "PowerToThePanels",
                                                    "score": 2,
                                                    "created_utc": 1645645726.0,
                                                    "response": "This video was from before Russia's invasion. He predicted it would increase gas prices if they did invade. So we're right on schedule.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hy3lmp5",
                    "author": "TammyString-Tugger",
                    "score": 6,
                    "created_utc": 1645624561.0,
                    "response": "Very interesting. I’ll have to listen to the whole pod. Here in Melbourne it took about 8 months of the first lockdown for the government to move towards increasing its “executive power”.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy43dho",
                    "author": "retirementdreams",
                    "score": 7,
                    "created_utc": 1645632167.0,
                    "response": "You better memorize your seed phrase people.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hy5f1az",
                            "author": "IndiRefEarthLeaveSol",
                            "score": 3,
                            "created_utc": 1645650281.0,
                            "response": "Tattoo it on your bum cheek :D",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hy4kbcj",
                    "author": "madeinthe80sg",
                    "score": 7,
                    "created_utc": 1645638633.0,
                    "response": "Financial deplatforming is already happening in Canada. PM is using emergency powers (instead of existing laws) to shutdown viewpoints that are unacceptable to him. \n\nOf course he claims it’s because the protestors are planning to overthrow him with their loud horns and bouncy castles 🤪\n\nThis is the beginning of western authoritarianism. \n\nOur leaders and their financial backers are tired of having to work with the commoners in a democracy. \n\nBack to the olden days of the rich few ruling over the many poor.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy59qyt",
                    "author": "Saabaka",
                    "score": 4,
                    "created_utc": 1645648354.0,
                    "response": "This is fucked up, loved his every fucking words though.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy3k9iu",
                    "author": "melagerfinchylager",
                    "score": 28,
                    "created_utc": 1645623904.0,
                    "response": "Joe needs to get more bitcoiners on. This shit is important man!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hy3r7f4",
                            "author": "seambizzle",
                            "score": 2,
                            "created_utc": 1645627130.0,
                            "response": "I haven’t listened to this one yet \n\nJoe has a massive audience and can get almost any guest. But I’d rather have someone who kinda understands bitcoin who is interviewing these people. Joe doesn’t know much about it so he won’t really know the questions to ask or having to steer the conversation a different way if needed. It’s better for the interviewer to understand the things he is asking questions about.  That’s how the listeners and audience will truly learn.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hy42b6a",
                                    "author": "CourageousBellPepper",
                                    "score": 11,
                                    "created_utc": 1645631748.0,
                                    "response": "I think the opposite. People appreciate learning about it at the same pace as he does because he asks questions that the uninformed listener has. Plus, his very relatable “holy shit” moments of clarity are great shareable content.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "hy42mtq",
                                    "author": "flawy12",
                                    "score": 4,
                                    "created_utc": 1645631875.0,
                                    "response": "That seems counterintuitive to me, Joe would be like any other...well average Joe...so instead of asking questions about technical stuff that cryptobros might like but would make most people's eyes glaze over, he would ask the type of questions that a noob would ask.\n\nA laymen audience won't learn anything if you bombard them with overly technical stuff.\n\nJoe would be good for asking the type of questions most people would and that would be good for opening the door, then people could seek out others more specialized sources to get deeper into the weeds.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "hy4oph5",
                                    "author": "steadywing",
                                    "score": 3,
                                    "created_utc": 1645640387.0,
                                    "response": "I just wanted to echo what others have said. I see where youre coming from, but there are many other podcasts which range from focusing on bitcoin to those who dabble in it and everywhere between.\n\nFor those who need introduced to the urgency of the situation and arent all that familiar with btc, Joe is the perfect host because the listener can more easily follow the topic because Joe is a layman's filter for the complexity of the topic AND he has the biggest audience/widest reach. \n\nFor those who want to learn more/deeper such as yourself, there are so many more places to go and do that digging. But for those who dont know much, they wont even be able to digest a deeper conversation at all.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hy2rykp",
                    "author": "echojunge",
                    "score": 22,
                    "created_utc": 1645603583.0,
                    "response": "we are in the „then they fight you“ phase",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy3fcl7",
                    "author": "Salt-Traffic59",
                    "score": 6,
                    "created_utc": 1645621323.0,
                    "response": "bitcoiners go to war",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy40zfk",
                    "author": "Admirable-Hyena5040",
                    "score": 3,
                    "created_utc": 1645631217.0,
                    "response": "They want to track every coin's life path. From minting to the hot dog stand to the babysitter to the load of bread. Terrifying, actually.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy3ezxv",
                    "author": "TheRealNotaredditor",
                    "score": 11,
                    "created_utc": 1645621124.0,
                    "response": "Resist.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy3mvcu",
                    "author": "abhilodha",
                    "score": 11,
                    "created_utc": 1645625150.0,
                    "response": "bitcoin is not programmable as afar as main chain is concerned.\n\n&#x200B;\n\nhowever altcoins are shitcoins",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hy3nsai",
                            "author": "PanserKalle",
                            "score": 5,
                            "created_utc": 1645625581.0,
                            "response": "Atleast not without consensus",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hy3tgvy",
                            "author": "Zambito1",
                            "score": 2,
                            "created_utc": 1645628103.0,
                            "response": "It is if you don't use the wacky definition of \"programmable\" this guy pulled from nowhere.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hy3kbc0",
                    "author": "SpecialistRough3962",
                    "score": 4,
                    "created_utc": 1645623929.0,
                    "response": "This sounds like the book ready player one.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy3ndbu",
                    "author": "Nissepool",
                    "score": 5,
                    "created_utc": 1645625386.0,
                    "response": "I came for the revolution but will stay for the gains.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hy4rwpw",
                            "author": "neomax96",
                            "score": 8,
                            "created_utc": 1645641599.0,
                            "response": "That's just like me, we all want to earn more from it lol.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hy3siu1",
                    "author": "cryotosensei",
                    "score": 3,
                    "created_utc": 1645627700.0,
                    "response": "Bitcoin is the guardian of my soul!!!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy3syyg",
                    "author": "lessioa",
                    "score": 5,
                    "created_utc": 1645627891.0,
                    "response": "Buy the dip",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy41jry",
                    "author": "7yod",
                    "score": 2,
                    "created_utc": 1645631441.0,
                    "response": "Very likely to happen in 2022. \nSo guess BTC will have a tough time but eventually will win.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy3vvbt",
                    "author": "MK12594",
                    "score": 11,
                    "created_utc": 1645629121.0,
                    "response": "I advise everyone to listen to the full conversation, it gives even more context and understanding of this clip. The JRE podcast should be protected at all costs.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy3cvqn",
                    "author": "Vigilias",
                    "score": 25,
                    "created_utc": 1645619898.0,
                    "response": "CBDCs won't be optional. \n\n&#x200B;\n\nIn Canada right now, there's an attack on self-custodial wallets. I don't know what the answer is, but the ruling class is coming for our assets and bitcoin is safe until the country we want to live in starts attacking it.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hy5199b",
                            "author": "BeardFondler",
                            "score": 7,
                            "created_utc": 1645645165.0,
                            "response": "I read about that news recently and it made me start looking into buying a hardware wallet. My assets are earning a lot in a centralized platform, but I rather not earn any interests than losing it all when Trudeau orders to freeze all my crypto assets.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hy5dsuc",
                            "author": "morebeansplease",
                            "score": -1,
                            "created_utc": 1645649832.0,
                            "response": "Why do you say ruling class instead of the capitalists. Like, do you really not understand who the ruling class is.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hy5wcug",
                                    "author": "Yes_or_yas",
                                    "score": 1,
                                    "created_utc": 1645656880.0,
                                    "response": "Capitalism is a framework that is exploited by those in power. Canada is a prime example of that in this particular moment. Anyone who tells you what is “for the best” isn’t working in your best interest.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hy5xt3n",
                                            "author": "morebeansplease",
                                            "score": 1,
                                            "created_utc": 1645657477.0,
                                            "response": "> Capitalism is a framework that is exploited by those in power.\n\nAgreed, capitalism is currently enforcing the hierarchies. But what version of capitalism doesn't create and enforce hierarchies?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hy6b3b8",
                                                    "author": "Yes_or_yas",
                                                    "score": 1,
                                                    "created_utc": 1645663252.0,
                                                    "response": "I think it’s less about the framework and more about accountability. We don’t have any incentive to hold those who abuse their power accountable. Perfect example is what’s going on with GME and AMC and short selling. Decentralization is literally why will eliminate the ability to exploit capitalism (at least in the way it is now) and redistribute much of the wealth that is currently being hoarded",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "hy6hrw9",
                                                            "author": "morebeansplease",
                                                            "score": 1,
                                                            "created_utc": 1645666263.0,
                                                            "response": "> I think it’s less about the framework and more about accountability.\n\nThe framework is the thing which does the accountability though... right? What else is going to hold actions accountable?\n\nUnder capitalism the elites have the power and use it to control the lower classes, as OP said, *the ruling class*. \n\nWhat am I missing?",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hy3mzjt",
                    "author": "junk_it",
                    "score": 7,
                    "created_utc": 1645625205.0,
                    "response": "\"It's an internal civil war in a hybrid war context over truth and information.\"\n\nwoah",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy3v7q8",
                    "author": "Hefty_Jicama",
                    "score": 3,
                    "created_utc": 1645628847.0,
                    "response": "What he is explaining is very progressive. My friend worked in gov Jerry brown admin and he was pro making beef completely illegal. This would put it on the black market and do the same thing the war on drugs is doing",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hy3zxu0",
                            "author": "directorschultz",
                            "score": 2,
                            "created_utc": 1645630794.0,
                            "response": "Anyone can raise their own meat or sneak out into the woods and take some for yourself. They can’t stop it. War on Calories will be lost from the jump.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hy7apl5",
                    "author": "jinjin299",
                    "score": 3,
                    "created_utc": 1645679689.0,
                    "response": "Damn this is crazy, I was so shocked after watching the video.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy3fy21",
                    "author": "Tobin1776",
                    "score": 19,
                    "created_utc": 1645621657.0,
                    "response": "This is terrifying. But can anyone who’s been paying attention say they’re surprised? The Great Reset is not a conspiracy theory.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy3lilu",
                    "author": "BeardyBish",
                    "score": 2,
                    "created_utc": 1645624505.0,
                    "response": "whats the QR code?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hy42mn2",
                            "author": "retirementdreams",
                            "score": 1,
                            "created_utc": 1645631873.0,
                            "response": "I didn't scan it, but I do wonder how many people actually saw it there.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hy3r5k4",
                    "author": "Wellhellob",
                    "score": 2,
                    "created_utc": 1645627106.0,
                    "response": "Good speech.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy3zu2q",
                    "author": "perpetualWSOL",
                    "score": 2,
                    "created_utc": 1645630751.0,
                    "response": "Its amazing that ancaps took this long to say I dont want people in my ledgers",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy44o7k",
                    "author": "7yod",
                    "score": 2,
                    "created_utc": 1645632679.0,
                    "response": "How will it impact the value of BTC? I see 2 opposite outcomes. Which one do you think is more likely to happen?\nMore people will buy BTC because they don’t want CDBC? Or BTC got banned so people sell it in panic 😱?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hy6i83z",
                            "author": "StrivingPlusThriving",
                            "score": 2,
                            "created_utc": 1645666461.0,
                            "response": "Good question. Someone earlier mentioned, 'bad for BTC price at first, but then BTC ends up winning.' That seems like a plausible path to me.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hy486am",
                    "author": "DrKhaan",
                    "score": 2,
                    "created_utc": 1645634028.0,
                    "response": "What’s the name of this guy",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy4c4s5",
                    "author": "Lindqvistx",
                    "score": 2,
                    "created_utc": 1645635530.0,
                    "response": "Bitcorn <3",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy4kdry",
                    "author": "SE4NLN415",
                    "score": 2,
                    "created_utc": 1645638659.0,
                    "response": "Actually for your own sake you should refuse CBDC.\n\nCheck out songpinganq on Twitter he shows ppl's lives in China. Very dystopian.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy3v4np",
                    "author": "antikama",
                    "score": 3,
                    "created_utc": 1645628813.0,
                    "response": "Theres no chance in hell Im buying a centralised central bank digital currency. Bitcoin is better in just about every single way",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hy6iny9",
                            "author": "StrivingPlusThriving",
                            "score": 1,
                            "created_utc": 1645666658.0,
                            "response": "My understanding is that the ultimate plan, if it comes to pass, is that for anyone with money in a bank, this will not be optional. Your dollars in your bank will be converted to CBDC overnight basically.\n\n[https://www.federalreserve.gov/central-bank-digital-currency.htm](https://www.federalreserve.gov/central-bank-digital-currency.htm)",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hy44ngn",
                    "author": "djcarpentier",
                    "score": 3,
                    "created_utc": 1645632671.0,
                    "response": "This is also why the JRE is vilified in the mainstream media.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy3kmwg",
                    "author": "fincurry",
                    "score": 3,
                    "created_utc": 1645624085.0,
                    "response": "I can't but think that Canadian government that behaves like a rabid dog escaping mental asylum (for dogs) with all its push to freeze assets and ruin people's lives works to further BTC adoption more than hours of Super Bowl ads.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy3vpos",
                    "author": "copys4sale",
                    "score": 2,
                    "created_utc": 1645629055.0,
                    "response": "Well, I’m here because only of gains..and safety as well. I mean It’s better to keep your money in USDT than in banks..",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hy58p9p",
                            "author": "autumn_feelings",
                            "score": 2,
                            "created_utc": 1645647969.0,
                            "response": "Lol no",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hy38ctt",
                    "author": "Girryarty",
                    "score": 0,
                    "created_utc": 1645616920.0,
                    "response": "It seems to me that many people came to crypto after the 2008 crisis. At first I used bitcoin as a protection for my funds, as an investment, after that I decided to leave the banking sector and use tether as well. It was the best decision of my life",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy3lozt",
                    "author": "NoShitsGivenAtAll",
                    "score": -2,
                    "created_utc": 1645624592.0,
                    "response": "We've been saying this for years, and idiot leftists called us conspiracy theorists. It's time to pay for the idiocracy, the leftists defended, with blood to get a smidge of your freedoms back. Enjoy the decline.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hy3o60f",
                            "author": "Nissepool",
                            "score": 7,
                            "created_utc": 1645625759.0,
                            "response": "Lol there’s nothing Left about the US. Just less right.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hy4waf2",
                                    "author": "Steak_N_Cocunuts",
                                    "score": 0,
                                    "created_utc": 1645643273.0,
                                    "response": "You are smoking fucking crack.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "hy3wfnh",
                            "author": "Lumn8tion",
                            "score": 1,
                            "created_utc": 1645629356.0,
                            "response": "Oh JFC. Go away.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hy3w6ja",
                    "author": "Quagdarr",
                    "score": 0,
                    "created_utc": 1645629250.0,
                    "response": "Canadas PM showcased the dangers of CBDCs. Comply regardless of what we say and how absurd it is…OR ELSE! We literally lock people out. Not to go nuts but similar to book of revelations and those who don’t take the mark of the beast are locked out of society.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy3vwfh",
                    "author": "halt_spell",
                    "score": 1,
                    "created_utc": 1645629134.0,
                    "response": "Btcer for a while here.\n\nWe should not be saying \"no\" to central bank digital currencies. A government controlled payment system would be a huge improvement over paying Visa or PayPal for every single internet transaction. Honey badger doesn't need to suppress competition to thrive. Honey badger welcomes competition and will keep other systems accountable or offer a safe haven where those systems are not managed ethically.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy47ikd",
                    "author": "drewcer",
                    "score": 1,
                    "created_utc": 1645633773.0,
                    "response": "This is why they're so desperate to cancel Joe Rogan.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy3kz5z",
                    "author": "Tebasaki",
                    "score": -3,
                    "created_utc": 1645624248.0,
                    "response": "China was waaaay ahead of everyone else one this. But really, they can already to all this. Shit they don't have access to you bank accounts now? They don't know how much you make and how and where you spend it? Nothing changes for them. Keep stacking.\n\nAlso, Rogan is a terrible platform to preach. I'm not saying it's wrong, but it would be like teaming up with the bad guy in a hostage situation and telling the cops you want people to understand how high the caloric count is in eggs.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy36uf3",
                    "author": "scythe314",
                    "score": 1,
                    "created_utc": 1645615818.0,
                    "response": "Wasnt this posted yesterday?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hy4cklo",
                            "author": "Vaginosis-Psychosis",
                            "score": 1,
                            "created_utc": 1645635698.0,
                            "response": "That never happens on Reddit!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hy3tytc",
                    "author": "Popular-Appearance24",
                    "score": 1,
                    "created_utc": 1645628316.0,
                    "response": "It is still a push system verses a pull system.\nMaybe you just don't understand?\nCBDC doesn't make the bank control your funds. \nIt's still tradeable, poolable, movable. \nBut a cbdc can not pull your fund from you.\nIt is still more safe than the current system.\nWhy? Because of the difference in pull mechanism which a bank approves a transaction and a push system where you approve the transaction. \nEducate your self before making one sided arguments. \nYou will not get rid of centralized and corporate entities.\nThey have all the wealth. \nA truelly decentralized monetary system makes room. even for centralized banks.\nWhy?\nBecause that is the way of a decentralized and free internet. \nCould they block you from transacting on their blockchain? Sure... maybe... by not giving you push rights. But then why would u use their chain?\nBut other blockchains have bridges. \nIt's impossible to stop once I have push rights. \nThat is the difference between centralized banks and cbdc. \nIf cbdc doesn't give u push rights.... \nThen it is not a cbdc it is just a regular centralized bank.\nOr worse not a bank and a rationing system. \nIf it is a rationing system Don't be stupid and put your money in something that allows rationing of your money.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy40dsx",
                    "author": "dazzz58",
                    "score": 1,
                    "created_utc": 1645630974.0,
                    "response": "Good talk",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy5c8s5",
                    "author": "morebeansplease",
                    "score": 1,
                    "created_utc": 1645649270.0,
                    "response": "How many of these people talking think poor folks shouldn't get money for food and instead should be restricted to EBT. \n\nThis looks like a whole lot of rules for thee but not for me.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy365gi",
                    "author": "Firm-Pay-4288",
                    "score": -15,
                    "created_utc": 1645615290.0,
                    "response": "The dollar is already digital, spread across multiple servers and tracked by kyc/aml. That is a CBDC. If you are protesting a central bank digital currency you are about 30 years to late.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hy39z0b",
                            "author": "VanillaGoy",
                            "score": 11,
                            "created_utc": 1645618040.0,
                            "response": "Ok redditor for a day definitely not a shill.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hy4jksq",
                                    "author": "Firm-Pay-4288",
                                    "score": 1,
                                    "created_utc": 1645638359.0,
                                    "response": "Yeah I was literally just born in a digital vat of goo and formed myself on reddit. A stupid little digital baby who knows nothing.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "hy3agon",
                            "author": "plague_rattt",
                            "score": 4,
                            "created_utc": 1645618372.0,
                            "response": "They don't tell me what I can and can't buy with my money right now.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hy4jibr",
                                    "author": "Firm-Pay-4288",
                                    "score": 1,
                                    "created_utc": 1645638333.0,
                                    "response": "They can and do freeze accounts pretty damn often. Does the trick.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "hy3of4v",
                            "author": "franklylivinglife",
                            "score": 1,
                            "created_utc": 1645625880.0,
                            "response": "Dude why are you being downvoted?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hy3q1z8",
                                    "author": "DesignerAccount",
                                    "score": 4,
                                    "created_utc": 1645626616.0,
                                    "response": "Because it's false? I can take my cash and spend it exactly however I want, if they agree with it or not. CBDCs would be intrinsically different.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hy4jxi6",
                                            "author": "Firm-Pay-4288",
                                            "score": 1,
                                            "created_utc": 1645638492.0,
                                            "response": "Bullshit they can freeze your account. It's pretty common.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hy4liml",
                                                    "author": "DesignerAccount",
                                                    "score": 1,
                                                    "created_utc": 1645639111.0,
                                                    "response": "What about \"my cash\" is not clear? Did I say anything about \"my account\"? Once you have cash, you can spend it anyway you want. This would not be true with CBDC.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "hy5kg5o",
                                                            "author": "Firm-Pay-4288",
                                                            "score": 1,
                                                            "created_utc": 1645652276.0,
                                                            "response": "To an extent, physical bills can be traced, kinda like chain analysis and following a paper trail.\n\nThe simple solution to not being tracked by cbdc is not using it. They arnt replacing the dollar, they are using it alongside the dollar. It is actually kinda dumb because it won't scale, it's not like gov has broke physics and solved the trillema.  Whatever a CBDC is im telling you, it's a dumb buzzword and basically the same as whatever digital dollar they use now but jankier. They'll need lightning to make it work and It will still fail.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "hy6jk9m",
                                                                    "author": "DesignerAccount",
                                                                    "score": 1,
                                                                    "created_utc": 1645667052.0,
                                                                    "response": "You are confused. CBs have no issues with the trilemma because it's not decentralized so they get scale and consensus with no problems, which is the only thing that matters. And they will not use any BlOcKcHaIn TeCh but a simpler SQL server.\n\nCash is a different beast, you should think about it some more.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "hy4jvdl",
                                    "author": "Firm-Pay-4288",
                                    "score": 1,
                                    "created_utc": 1645638470.0,
                                    "response": "Lol I have no idea. Gov shills?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hy405vs",
                    "author": "N4hire",
                    "score": 1,
                    "created_utc": 1645630883.0,
                    "response": "Sure. Very damn possible, but people will find out and will go batshit crazy about it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy42cbp",
                    "author": "justfart_",
                    "score": 1,
                    "created_utc": 1645631760.0,
                    "response": "Can someone please share the link to this? I want to share it with friends and family",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy45lqw",
                    "author": "let_me_type",
                    "score": 1,
                    "created_utc": 1645633039.0,
                    "response": "Such a large strawman you can see it from space.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy47rc8",
                    "author": "fredbeans312",
                    "score": 1,
                    "created_utc": 1645633866.0,
                    "response": "A underline way of Marshall Law introduced.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy48qnd",
                    "author": "Bone-Head-J",
                    "score": 1,
                    "created_utc": 1645634248.0,
                    "response": "There won’t be a famine for the Bitcorners… we can always just eat our Bitcorn :)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy49cnu",
                    "author": "plaidcat50",
                    "score": 1,
                    "created_utc": 1645634480.0,
                    "response": "*hears about food stamp programs*\n\nHooooooooly shit",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy4a745",
                    "author": "Dont_Say_No_to_Panda",
                    "score": 1,
                    "created_utc": 1645634802.0,
                    "response": "This is always confusing to me because that acronym will forever mean Coinbase Debit Card to me.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy4fcnb",
                    "author": "sandervk1",
                    "score": 1,
                    "created_utc": 1645636761.0,
                    "response": "That's shocking, I don't know what will happen in the future now.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy4h2wx",
                    "author": "AlexWD",
                    "score": 1,
                    "created_utc": 1645637415.0,
                    "response": "This is great, it’s going to drive people to realize how important bitcoin is.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy4ie82",
                    "author": "isdbull",
                    "score": 1,
                    "created_utc": 1645637914.0,
                    "response": "Not for the anally retentive:\n\nBeans are a great currency. If watered well in good soil, the returns are manifold.\n\nCentrally controlled digital currency, whose use can be restricted by a third party, can be a problem ... especially when you are not the party that controls it.\n\nThe increase of bean supply does not maim the intrinsic value of a single bean. Not so with fiat or digital currency - the increase of its supply, reduces the overall perceived value of an inherently valueless artifact.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hy4k5el",
                            "author": "crimeo",
                            "score": 1,
                            "created_utc": 1645638572.0,
                            "response": "> The increase of bean supply does not maim the intrinsic value of a single bean.\n\nYes it does, for the exact same reason that fiat USD inflation happens. Higher supply, same demand makes the price of ANY/EVERY product drop",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hy4u3p6",
                                    "author": "isdbull",
                                    "score": 1,
                                    "created_utc": 1645642436.0,
                                    "response": "No it does not. Beans undergo an endless inflationary-deflationary cycle. And you are confusing value with price.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hy4irue",
                    "author": "gmax9000",
                    "score": 1,
                    "created_utc": 1645638056.0,
                    "response": "Joe Rogan's platform might be too powerful after all...",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hy4kkvz",
                            "author": "SE4NLN415",
                            "score": 1,
                            "created_utc": 1645638733.0,
                            "response": "more powerful than people screaming their keyboards off on Twitter for years for sure. Establishment don't want normies to know.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hy4ix4l",
                    "author": "casper_sti",
                    "score": 1,
                    "created_utc": 1645638111.0,
                    "response": "Scary",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy4l5td",
                    "author": "Slapshot382",
                    "score": 1,
                    "created_utc": 1645638964.0,
                    "response": "This explains exactly what is going on and people will be okay with a CBDC. We must fight this. \n\nShare this video, knowledge is power. Teach your family and friends before it’s too late.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy4l8y6",
                    "author": "tisuy",
                    "score": 1,
                    "created_utc": 1645638999.0,
                    "response": "And the profit has become indifferent to you? Well, well. We'll see.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy4p1s8",
                    "author": "1_900_mixalot",
                    "score": 1,
                    "created_utc": 1645640518.0,
                    "response": "Central Bank Digital Currency? I'm too lazy to Google it and I hope I'm still a good guesser.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy4qp8r",
                    "author": "woyaozhangpan",
                    "score": 1,
                    "created_utc": 1645641141.0,
                    "response": "This is clearly a war going on outside, we can't do anything more than that.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy4s70a",
                    "author": "Ebolaqtt",
                    "score": 1,
                    "created_utc": 1645641710.0,
                    "response": "Joow guys,which episode is that?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy4t33f",
                    "author": "oocoo_isle",
                    "score": 1,
                    "created_utc": 1645642050.0,
                    "response": "This has been 'the plan' for at least 30 years but I'm glad someone is speaking out about it on a large platform like JRE and giving us updates on the specifics. The canadian bank account freeze crisis will tell you exactly how they will use this.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy4tn1f",
                    "author": "nphare",
                    "score": 1,
                    "created_utc": 1645642260.0,
                    "response": "They will tell you where you can go and what you can buy. They are at the same time buying Bitcoin so the rules won’t apply to them.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy4u3tl",
                    "author": "NoMoreMandates",
                    "score": 1,
                    "created_utc": 1645642437.0,
                    "response": "I really don’t see the population around the globe putting up with this. Yes I believe CBDC’s are inevitable but I can’t see it getting to such a state",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hy6je1v",
                            "author": "StrivingPlusThriving",
                            "score": 1,
                            "created_utc": 1645666977.0,
                            "response": "Given events from the far and recent past, the only way to avoid the dystopia is to take the necessary actions now to prevent bad decisions by our leaders.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hy6jjxs",
                                    "author": "StrivingPlusThriving",
                                    "score": 1,
                                    "created_utc": 1645667048.0,
                                    "response": "To clarify, I mean vote for people who are in favor of your freedoms. This goes for a world with or without CBDC.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hy4ua58",
                    "author": "z1ggy16",
                    "score": 1,
                    "created_utc": 1645642504.0,
                    "response": "I guess my question is, how does BTC preeminently stop this from happening? If I started today converting all my cash to BTC, how does it gives me leverage 15 years from now when I'm paid entirely in CBDC and the entire economy, including exchanges, only run off that digital currency as the medium? Government will just stop and flag any transactions to the Blockchain, no?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hy6k0e8",
                            "author": "StrivingPlusThriving",
                            "score": 1,
                            "created_utc": 1645667246.0,
                            "response": "There are alternatives to total government control. Especially, voting for leaders who are pro-freedom. There are also technological alternatives. Many recent posts here and in the Crypto subreddit have explanations of options. Learn them and live free. Neglect to learn them, and you will be stuck in your dilemma.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hy4w8wc",
                    "author": "Suske10",
                    "score": 1,
                    "created_utc": 1645643257.0,
                    "response": "Comment for visibility",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy4wh86",
                    "author": "dextersh",
                    "score": 1,
                    "created_utc": 1645643347.0,
                    "response": "I don't think that they will even try such control. It would have to be implemented veryyyyyy slow and in small increments for many decades so the people allow it, and even then it will be to a point.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy4wtrm",
                    "author": "TriumphantAtlast",
                    "score": 1,
                    "created_utc": 1645643481.0,
                    "response": "CBDCs are nothing more than fancy food stamps. \n\nHelp people understand that trading your labor for a CBDC is working for food stamps.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy51mnt",
                    "author": "chuckleoctopus",
                    "score": 1,
                    "created_utc": 1645645305.0,
                    "response": "UBI via a CBDC is not a bad idea. Also most food stamps currently have healthy eating requirements. This is just an amalgamation of those ideas as long as it doesn't replace fiat or crypto.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy52v86",
                    "author": "arnelb",
                    "score": 1,
                    "created_utc": 1645645780.0,
                    "response": "\"In Sweden, Skandinaviska Enskilda Banken AB (publ) CFO Masih Yazdi recently warned that if customers moved their money out of deposit accounts and into the e-krona, it could deprive banks of funding and risk instability in the wider system.\" \n\nThe banks are fully aware of the risks with crypto currency and are even afraid of the upcoming CBDC.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy54e4n",
                    "author": "DOG-ZILLA",
                    "score": 1,
                    "created_utc": 1645646360.0,
                    "response": "Here's what you can say to people on the right:  \n\"A CBDC will allow a Democratic government to prevent you from buying guns\"\n\nHere's what you can say to people on the left:  \n\"A CBDC will allow a Republican government to prevent you from funding LGBTQ+ rights\"\n\nLike Majid says, it's not left and right anymore. It's up and down. Those that have the power against those that do not. The left and right argument is a red herring designed to keep us arguing amongst ourselves.\n\nYou can use the arguments above with people you know who haven't realised this yet. Soon they'll see a CBDC as a huge problem against your rights. And soon they'll see that the \"left\" and the \"right\" have much more in common than we think.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy5aooy",
                    "author": "LancelotGoD",
                    "score": 1,
                    "created_utc": 1645648701.0,
                    "response": "We stand against this bro, we don't want anything else.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy5bmbs",
                    "author": "kayalsh2002",
                    "score": 1,
                    "created_utc": 1645649044.0,
                    "response": "The sooner we close our bank accounts, the better.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy5d334",
                    "author": "rambumriott",
                    "score": 1,
                    "created_utc": 1645649570.0,
                    "response": "people will just start selling things labelled as other things in a black market",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy5dfnf",
                    "author": "evcham",
                    "score": 1,
                    "created_utc": 1645649696.0,
                    "response": "Garsh, wut kernda CoNsPiRaCy is THIS!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy5dunw",
                    "author": "3ditTrader",
                    "score": 1,
                    "created_utc": 1645649850.0,
                    "response": "Bull is coming",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy5egoq",
                    "author": "Damageplan77",
                    "score": 1,
                    "created_utc": 1645650071.0,
                    "response": "CBDCs are just another control system. We have them now they are just not setup to be any kind of advantage to average people. \n\nIts my opinion that CBDCs can be used to remove a hidden dark money system from existence. People can control the ledger systems, it doesnt have to be the government. \n\nI think both sides want this change to CBDCs good and bad. Something to think about...",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy5f9yq",
                    "author": "littlebrushwooddog",
                    "score": 1,
                    "created_utc": 1645650371.0,
                    "response": "Huge interview! Thanks for highlighting this part for the masses",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy5g3v1",
                    "author": "IndiRefEarthLeaveSol",
                    "score": 1,
                    "created_utc": 1645650678.0,
                    "response": "Basically, many among us are going to be doing the dying for this eventual decentralized world. Good luck to us all. What a time to be alive, utterly sad too.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy5nwgf",
                    "author": "AI_8",
                    "score": 1,
                    "created_utc": 1645653547.0,
                    "response": "interesting!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy5renn",
                    "author": "Jetstreamsideburns",
                    "score": 1,
                    "created_utc": 1645654895.0,
                    "response": "can someone link the source from what he is saying as to the intent of this programable money or is he speculating?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy61gva",
                    "author": "type102",
                    "score": 1,
                    "created_utc": 1645659024.0,
                    "response": "That guy is right, but I think that bitcoin is flawed because at the end of the day it's still money - and it's worse than paper money because it is more manipulatable (as he explained by talking about 'programable money').   \n\n\nI think that bitcoin has a place right by cash, but I also think that as a culture we (all of humanity) have to move past the concept of money all together.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy62nqj",
                    "author": "benfrancois",
                    "score": 1,
                    "created_utc": 1645659535.0,
                    "response": "Majid is a muppet",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy68bgj",
                    "author": "ViroquaExpatriate",
                    "score": 1,
                    "created_utc": 1645662007.0,
                    "response": "Hopefully the idea of CBDC fades away like The North American Union and the Amero did. We shall see.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy69nck",
                    "author": "tjsurvives",
                    "score": 1,
                    "created_utc": 1645662604.0,
                    "response": "We have been talking about this on the conspiracy sub for years and die hard tin foil hats have been talking about it for decades. We told you but we were laughed at.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy6a5zc",
                    "author": "ithakaa",
                    "score": 1,
                    "created_utc": 1645662835.0,
                    "response": "i honestly do not understand the histeria... \n\nAre we so naive that we thought our governments were not tracking payments?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy6iwrd",
                    "author": "Nosirrah666",
                    "score": 1,
                    "created_utc": 1645666766.0,
                    "response": "Bullish on britcoin",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy6lkpx",
                    "author": "Bitcrazy-472",
                    "score": 1,
                    "created_utc": 1645667932.0,
                    "response": "Me, too.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy6luah",
                    "author": "thinkingperson",
                    "score": 1,
                    "created_utc": 1645668051.0,
                    "response": "Stop saying that it is like the Chinese social credit system because throughout history, Kings and Emperors, Kingdoms and Dynasties has always done this. To control. To dictate. To rule.\n\nTo think that we are following the Chinese is relegate this evil away.\n\nThis is in our history. To begin with, US and Canada will not exist if this was not the case in Great Britain and Europe.\n\nThis is not a Chinese issue. This is our issue. Own it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy6n18j",
                    "author": "Living_Pie205",
                    "score": 1,
                    "created_utc": 1645668581.0,
                    "response": "Whats his name and what episode is this ?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy6oulo",
                    "author": "tsrdd",
                    "score": 1,
                    "created_utc": 1645669392.0,
                    "response": "That's correct, the situation is pretty fucked up nowadays.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy6q383",
                    "author": "Crypto_bro999",
                    "score": 1,
                    "created_utc": 1645669949.0,
                    "response": "Sounds bullish. That's exactly why I invest my usdt in bitcoin every time it dops. The bitcoin revolution is coming.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy6rlpn",
                    "author": "ProfessorPurrrrfect",
                    "score": 1,
                    "created_utc": 1645670628.0,
                    "response": "CbDCs are a Trojan horse for BTC",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy6te21",
                    "author": "13004715392",
                    "score": 1,
                    "created_utc": 1645671436.0,
                    "response": "We are in a war now, I don't know what to say after that.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy6wxt0",
                    "author": "NorthernLights1123",
                    "score": 1,
                    "created_utc": 1645673057.0,
                    "response": "Bruh",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy7209o",
                    "author": "noelparrish",
                    "score": 1,
                    "created_utc": 1645675434.0,
                    "response": "I like the mindset, don’t be easily disappointed by bearish. Success starts with you, crypto made it possible to create your own staking platfrom with farmxyz. It requires hardwork to be successful",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy74nj4",
                    "author": "Rate_Gullible",
                    "score": 1,
                    "created_utc": 1645676702.0,
                    "response": "Take a piece of paper, put a line down the middle and put on each side what the government has done right and wrong… any rational person knows the outcome… CBDCs are trash.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy7egc9",
                    "author": "Bitesizecrypto35",
                    "score": 1,
                    "created_utc": 1645681665.0,
                    "response": "Why is it always btc.    Why not an alt coin.  WITH BTC. 🤷‍♂️",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy7js52",
                    "author": "PhophetSenapi",
                    "score": 1,
                    "created_utc": 1645684723.0,
                    "response": "“Government Controlled.” Not going to happen.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hypv96h",
                    "author": "Steve_at_Reddit",
                    "score": 1,
                    "created_utc": 1646010117.0,
                    "response": "The US government (and its employers: Mega-Corporayions) use Weapons of Mass Distraction. Namely media propaganda.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hypwdx0",
                    "author": "Steve_at_Reddit",
                    "score": 1,
                    "created_utc": 1646010645.0,
                    "response": "If you want to see a real eye-opener on how the US/CIA/IMF/UN/WorldBank really operate around the world, read (or listen to on Audible) \"The New Confessions Of An Economic HitMan\"\nHere's a taster.. https://youtu.be/aLc3ehhPIKA",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hyqiblk",
                    "author": "MichaelPaulE",
                    "score": 1,
                    "created_utc": 1646020870.0,
                    "response": "This is horrific, it's the very thing  I was fighting against when I created peer-to-peer. It started in spring 2007 when within 30 minutes of each other I watched the yahoo news had on a charity begging for mosquito nets as children were dying and a advertizement for overstocked nets 95% off. The problem was the  country had no currency exchange with the second that needed the nets and physical usd was the only thing the first could receive as there was no digital network for that country. The problem I was focused on and trying to solve was the trust issue as the nations didn't trust each other and children were dying. I spent almost 6 months researching different digital networks paypal and so on trying to find a solution concluding there wasn't one avalible. Next I figued I would design a concept then get funding for someone to build a team to try and put it together, it's when I formed that Satoshi Nakomoto psudonym with emails and all the stuff needed.  This is the same time when I talked with Nick Szabo. His name was the first one I came across when doing history research in digital currencies. I had discussed with him how \"we\", meaning me and the team I was going to put together, were working on a concept similar to his but using pow based on unlikely chanced dublicate blocks and was going to use a agreed on ledger to bypass the need for trust. In early 2008 I was dealing with trying to manage the financial crisis, like most people, but I was also still formulating how the digital exchange and currency should work. So I sent emails to a group of crypto currency people, most of which were not encouraging, that's why I decided I would just have to start coding myself. I decided to use c++ as it's one of the few languaged I don't have published code for and decided to use free publically avalible tools as anyone could acess them. I decided to start with the ledger and the encryption. I decided to use sha256 as it was openly avalible and latter versions had issues. I had seen Back had built something similar to what I was building and decided I would immitate him including writing style and computer settings. I  couldn't get it exact though as other factors that go into random generation were out of my control. Hal seemed to be the only one intrested so I recurited him into the work team, which was now 2. We communicated quite often via a messenger often I would pick his brain with questions then go look up what was known or avalible as code I could draw ideas from. I was also still learning to code C++ at that time and trying to recruit help. Anyways off topic now and I don't have my ghost writer anymore so the main point is this smack in the face of the very concept of digital currency as it should be just like paper backs.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hz1oazw",
                    "author": "jalanst",
                    "score": 1,
                    "created_utc": 1646227568.0,
                    "response": "Good luck trying to make me work for that kind of vouchers",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hzz3hxr",
                    "author": "SeigniorageFrog",
                    "score": 1,
                    "created_utc": 1646835802.0,
                    "response": "This thread is a good read for more background info on how CBDC's are being designed right now:  \nhttps://twitter.com/samcallah/status/1473815145545551873\n\nAnd if you want to start understanding how you can still maintain freedom under the rule of CBDC's  this is a good watch. This guy explains what SWIFT does, but more than that he explains how banks interoperate across borders which is very important to understand right now.  \nhttps://media.ccc.de/v/33c3-8315-a\\_world\\_without\\_blockchain",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy4eh6f",
                    "author": "Holski7",
                    "score": -1,
                    "created_utc": 1645636426.0,
                    "response": "god joe rogan and his guests are so dumb. Why does everything have to be a horror movie plot to them. Cant they have one level take at least?\n\nHe sounds like an old boomer who is just petrified by things he doesnt understand. I bet its all performative, and not authentic. But that makes it worse IMHO",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy3zfwy",
                    "author": "pcre",
                    "score": -2,
                    "created_utc": 1645630589.0,
                    "response": "That is why it is so important, that you help the trucker exchange BTC for cash now. Even if you can not change it back to fiat on a centralized exchange. The transaction history will witness history. Every Bitcoin address on the blacklist might be worth a fortune in 30 years of now. It is like the tea party in 1776.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy419tr",
                    "author": "GrimSeraph",
                    "score": -2,
                    "created_utc": 1645631331.0,
                    "response": "Just gonna leave this here.\n\nhttps://patentscope.wipo.int/search/en/detail.jsf?docId=WO2020060606",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hy7wmtr",
                            "author": "GrimSeraph",
                            "score": 1,
                            "created_utc": 1645693345.0,
                            "response": "for those downvoting, this is a patent owned by microsoft to use the human body to mine crypto, provided that body completes a task.\n\nSeems pretty pertinent to me.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hy4xkhl",
                    "author": "NandoCa1rissian",
                    "score": -2,
                    "created_utc": 1645643768.0,
                    "response": "This guys a dick",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy391vs",
                    "author": "FlashFront_Inc",
                    "score": 0,
                    "created_utc": 1645617411.0,
                    "response": "Giod",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy3i2bh",
                    "author": "Turkeyyboyyy",
                    "score": 0,
                    "created_utc": 1645622790.0,
                    "response": "you know this is a great idea !! At least for childcare and charity money.  Other then that fuck it",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy40d2u",
                    "author": "Crookedhorn112",
                    "score": 0,
                    "created_utc": 1645630966.0,
                    "response": "Central Banks mimicking crypto puts us one step closer to the death of Fiat. It will be so much easier for average people to convert their savings to crypto if their paychecks are in CBDC",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy51iyu",
                    "author": "instagrammademedoit",
                    "score": 0,
                    "created_utc": 1645645265.0,
                    "response": "RReee:LEASE the AI!!!   just echolocate with the 5G aaanddd REaallly WA$Teur SoMeTRACKMDOWN... XD",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}