{
    "subreddit": "BitcoinBeginners",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uztsz4",
            "title": "Is there a minimum number of people that must believe in bitcoin in order for it to avoid a 90% crash in value? 🤔",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/uztsz4/is_there_a_minimum_number_of_people_that_must/",
            "author": "MountainousFog",
            "created_utc": 1653764402.0,
            "score": 69,
            "num_comments": 76,
            "subreddit": "BitcoinBeginners",
            "selftext": "BTC is at $29,000 now but if half the people holding BTC were to watch a youtube video that made them want to divest in crypto, would the value fall by half or would it likely fall by 90 percent or more?\n\nIn the early days of bitcoin, only a few dozen people believed in it. I'm just curious if there is a mathematical relationship between number of adopters (those who hold $100 or more worth of bitcoin) with respect to the value of bitcoin. I assume more people = higher price and that fewer people = lower price. Is this thinking correct?\n\n___\n\n**TL;DR:** Is there a minimum number of people that must believe in bitcoin in order for it to avoid a 90% crash in value? 🤔",
            "stickied": false,
            "comments": [
                {
                    "id": "iacdmkc",
                    "author": "AlphaSengirVampire",
                    "score": 24,
                    "created_utc": 1653764921.0,
                    "response": "I’d say there is a hard floor either way, and that’s the cost of mining, in the 5k range. Also with all the infrastructure in place I doubt it goes under 10k ever again even with a hard crash.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iad2wxq",
                            "author": "igadjeed",
                            "score": 17,
                            "created_utc": 1653776930.0,
                            "response": "The cost of mining falls as miners retire. It can not possibly create a price floor",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iacn8df",
                            "author": "bitusher",
                            "score": 5,
                            "created_utc": 1653769547.0,
                            "response": ">and that’s the cost of mining, in the 5k range.\n\nWhere are you getting this number ? The cost mining is usually near the price of bitcoin due to difficulty dynamically adjusting",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iacygne",
                                    "author": "ndgoLiberty",
                                    "score": 4,
                                    "created_utc": 1653774792.0,
                                    "response": "One of the publicly traded miners said they were profitable until 6k in a recent earnings report",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iaczkns",
                                            "author": "bitusher",
                                            "score": 2,
                                            "created_utc": 1653775315.0,
                                            "response": "This might simply reflect their profitability not including sunk costs in equipment and or electrical contracts",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iad6p4m",
                                                    "author": "ndgoLiberty",
                                                    "score": -5,
                                                    "created_utc": 1653778814.0,
                                                    "response": "Nobody cares about that at all.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iad7hyl",
                                                            "author": "bitusher",
                                                            "score": 1,
                                                            "created_utc": 1653779219.0,
                                                            "response": "I care about education , and wanted to clarify that the cost of mining a Bitcoin is no where near 5k usd as was originally implied.\n\nIn the context of the OP question it is relevant only to suggest miner costs insomuch as the ability for miners to forego selling their mined Bitcoin if the price drops too much . Since monetary inflation is so low this would be a minor variable in how low the price could drop and a much more important variable involves larger whales deciding to sell their bitcoin and buyers like myself not being able to buy this bitcoin quick enough",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "iad8ajp",
                                                                    "author": "ndgoLiberty",
                                                                    "score": 0,
                                                                    "created_utc": 1653779639.0,
                                                                    "response": "I for one don’t know of any publicly traded miners who are gonna be going bankrupt even if they become negatively profitable.\n\nAnd many of them sell their coins already. Only a couple have a HODL HODL strategy.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "iadzr4k",
                                                                            "author": "bitusher",
                                                                            "score": 1,
                                                                            "created_utc": 1653795000.0,
                                                                            "response": ">Only a couple have a HODL HODL strategy.\n\nThis is exactly my point with regards to the context of the OP question",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "iacsux1",
                                    "author": "PK_Subban1",
                                    "score": 4,
                                    "created_utc": 1653772196.0,
                                    "response": "not true, in bull runs it exceeds the cost of mining significantly for long periods",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iacv591",
                                            "author": "bitusher",
                                            "score": 2,
                                            "created_utc": 1653773306.0,
                                            "response": "Difficulty retargets every 2016 blocks and new ASICs can come online fairly quickly. When I mine I don't notice long periods of higher profitability during bull market cycles but the opposite where New hashrate will sometimes come online much quicker hurting profitability.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "iacyjlr",
                            "author": "ndgoLiberty",
                            "score": -1,
                            "created_utc": 1653774830.0,
                            "response": "It could easily go under the miner break even price for years. Just because it hasn’t done that in the past doesn’t mean it won’t start.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iacgt06",
                    "author": "ArchiMode25",
                    "score": 13,
                    "created_utc": 1653766401.0,
                    "response": "Well it hasn't had a 90% crash I dont think, could be wrong. 84% in 2014/2015 and 84% in 2018/2019 were the most I believe. \n\n200WMA is generally the strongest support. That is currently around $22,000. It's gone below the 200WMA but for only for a moment. Personally I think 18k-22k is well within play and an absolute low of 10k this cycle. Although I don't think it would hit 10k. 84% down from ATH of 68k would be $10,880. So it's possible for sure.\n\nTo answer your questions the more spread out bitcoin is the less volatile it will be. This will take a long time though. There are still many singular holders that possess large percentages of BTC. Could take decades if not longer to thin it out. This cycle should tell us a lot. If 22-25k is the low then that means only a 60-70% drop instead of the normal 84%. If that happens then that answers your question right there. Look back at 2018/2019. BTC was hitting a 6k-ish low for almost a year before dropping another 50% to around 3,200 around the end of 2018. It stayed in the 3k-4k range for about 3 months in 2019 IIRC. Then it hit around 3,800 again in 2020 for COVID crash. That didnt last long though. Volatility fluctuations, of 10-20% only, could still take decades.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iad2t9p",
                    "author": "igadjeed",
                    "score": 3,
                    "created_utc": 1653776882.0,
                    "response": "> Is there a minimum number of people\n\nThe question assumes the market is linear. It is non-linear. Most speculators are followers. Whether they decide to follow optimism or pessimism from one day to the next depends on what they believe other people are doing\n\n> believe in bitcoin\n\nIt's not really a religious cult, even though the behavior is very similar",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iacurtw",
                    "author": "werstummer",
                    "score": 1,
                    "created_utc": 1653773125.0,
                    "response": "Ask yourself, \n*  are there many people who think they will sell BTC for more then they bought at? \n*  are there any other reasons to hold Bitcoin other then just sell for more $$$ ? \n\nIf everybody sold and you were left with your Bitcoins, what would you do with them?\n\nIf you believe, there is no reason to be afraid.\nIf you want to sell for more $$$, there is no indicator to tell do it just right now. You just have to believe, that others will buy your bitcoins for more then you bought.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iad2in1",
                            "author": "MountainousFog",
                            "score": 2,
                            "created_utc": 1653776739.0,
                            "response": "> If everybody sold and you were left with your Bitcoins, what would you do with them?\n\nIf everybody but me sold their bitcoins, they would be worthless as there wouldn't be any remaining buyers... 😅",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iad3s6u",
                                    "author": "werstummer",
                                    "score": 1,
                                    "created_utc": 1653777359.0,
                                    "response": "Its an extreme, but its solves the puzzle if bitcoin is worth anything.\n\nIf you were left with all the uranium in the world by yourself, can you make money out of it? (or food, ammo or barbie dolls)",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iad9j3h",
                                            "author": "MountainousFog",
                                            "score": -1,
                                            "created_utc": 1653780279.0,
                                            "response": "> If you were left with all the uranium in the world by yourself, can you make money out of it? (or food, ammo or barbie dolls)\n\nI assume if you had all the world's food, you could barter it to starving beautiful women for sex?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iaek7dy",
                                                    "author": "Miadas20",
                                                    "score": 3,
                                                    "created_utc": 1653810249.0,
                                                    "response": "I'm always amazed at the new lows humanity achieves on the internet. What a shit thing to say heading into a global food crisis with raging inflation.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "iadaest",
                                                    "author": "werstummer",
                                                    "score": 1,
                                                    "created_utc": 1653780752.0,
                                                    "response": "ultimately even USD is useless - i dont have much, just because of that. But have drinks, good food and anything i need or want.\nEdit: right women follow just because i don't care about unneeded things like money and have things that serves purpose - you can buy much with money, but if you have money and not spend them, they become useless.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iadch92",
                    "author": "DigitalAssetsBull",
                    "score": 1,
                    "created_utc": 1653781843.0,
                    "response": "Yes, there is absolutely value between the number of adopters and the value of Bitcoin. \n\nRaoul Pal (ex-Goldman Sachs and Bitcoin advocate) often talks about user adoption, the S-curve and Metcalfe's law. We are just at the beginning of the S-curve in Metcalfe's law. This technology is getting adopted like crazy.\n\nBitcoin is being adopted faster than the internet. I highly recommend following Raoul Pal on YouTube (Realvision) or alternatively check out my YouTube channel, which you can find in my profile.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iadjh07",
                            "author": "putyograsseson",
                            "score": 5,
                            "created_utc": 1653785663.0,
                            "response": "Could you perhaps link some metrics that demonstrate how bitcoin gets faster adopted than the internet?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iaeebw1",
                    "author": "SnooApples3402",
                    "score": 1,
                    "created_utc": 1653805233.0,
                    "response": "Supply and demand really. If there’s no demand, then the price will fall. \n\nSimple economics. 4 corners are doing a special on it this week on the ABC",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaehfqk",
                    "author": "Damgalnuna000",
                    "score": 1,
                    "created_utc": 1653807828.0,
                    "response": "Yes 5 ppl!\n\nWhole countries believe in it so should be fine 😬",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaes57e",
                    "author": "Apprehensive-Ad5145",
                    "score": 1,
                    "created_utc": 1653817418.0,
                    "response": "Sorry my computer cant predict government manipulation",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaf456y",
                    "author": "SaggeeDot",
                    "score": 1,
                    "created_utc": 1653827035.0,
                    "response": "4",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iafj0cr",
                    "author": "Rubelmusicwould8374",
                    "score": 1,
                    "created_utc": 1653834987.0,
                    "response": "This is exactly the moment that I absolutely do not understand. What does affect the price of Bitcoin?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iafyf82",
                    "author": "Ok-Cauliflower-5335",
                    "score": 1,
                    "created_utc": 1653841887.0,
                    "response": "I think BTC will keep decreasing and reach 23k$",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iacciqc",
                    "author": "AutoModerator",
                    "score": 0,
                    "created_utc": 1653764402.0,
                    "response": "WassaWassaWassup! Scam Alert! Scammers are particularly active on this sub. They operate via private messages and private chat. If you receive private messages, be extremely careful. Use the **report** link to report any suspicious private message to Reddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BitcoinBeginners) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}