{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uxm0v0",
            "title": "There are 58 million millionaires, why haven't they bought all the bitcoin if it's so scarce?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uxm0v0/there_are_58_million_millionaires_why_havent_they/",
            "author": "metalmansteve",
            "created_utc": 1653498500.0,
            "score": 137,
            "num_comments": 305,
            "subreddit": "Bitcoin",
            "selftext": "Asking as a bitcoin supporter. It's confusing to me.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9yjbs4",
                    "author": "WhittledSpork",
                    "score": 98,
                    "created_utc": 1653499192.0,
                    "response": "Clearly they aren't all \"believers\".\n\nHowever, assuming they were believers, if they tried to buy all of it currently in circulation it would drive the price up. At which point, other millionaires would sell as they became tens of millionaires and so forth and so on. There will, more than likely, always be another currency available to transact in - so the inherent scarcity of BTC doesn't preclude the ability and good idea to realize gains.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia0tfmb",
                            "author": "Surething_bud",
                            "score": 21,
                            "created_utc": 1653535009.0,
                            "response": "Yes, there will always be circulation of Bitcoin. Even if people aren't \"selling\" it for fiat... if the value of BTC goes high enough, they will exchange it for goods and services. Which has the same effect of putting BTC back into circulation.\n\nThe idea that someday all the Bitcoin will be \"gone\" is a misunderstanding of the way markets/pricing works. It's nonsensical. There will always be Bitcoin available to buy, that's what the price represents... If there aren't sellers at a certain price, it will increase until there are sellers.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia21y17",
                                    "author": "WoodyRM",
                                    "score": 1,
                                    "created_utc": 1653567788.0,
                                    "response": "Does that make it impossible for bitcoin to become a stable coin?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "ia17cs1",
                            "author": "Phil_Drill",
                            "score": 5,
                            "created_utc": 1653543804.0,
                            "response": "I feel like the risk to a millionaire in buying 1 BTC is so insignificant though, that it barely even warrants “believing”. Right now, if your net worth is $1 mil, buying 1 BTC is spending 3% of your net worth. That would be like me buying a new computer. Except a new computer will be worthless in 5 years and BTC will either be worth more, or worst case scenario, 75% less.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia1rpb7",
                                    "author": "ChrimsonChin988",
                                    "score": 1,
                                    "created_utc": 1653561051.0,
                                    "response": "I completely agree yet it's not reality.\n\nI know plenty of deca and hecta millionaires. Most do not own a single sat. They think it's stupid or are uninterested. \n\nThey are unwilling to put in a completely insignificant amount of 30k, even if they know they might be missing something and the payout could potentially be huge. \n\nI've given up trying to teach them anything about it. Now I just wait for 100k and see if they will listen then.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "ia185o1",
                            "author": "theneworld",
                            "score": 0,
                            "created_utc": 1653544413.0,
                            "response": "> However, assuming they were believers, if they tried to buy all of it currently in circulation it would drive the price up. \n\n\nNot really. Fractional reserve/paper bitcoin. The idea that bitcoin will become the optimal a store of value when it can be diluted by powerful entities is nonsensical. Not your keys not your bitcoin does not work for the majority of people, when you trust third parties in all probability they are going to abuse their power and run fractional reserve scam. Do I have some insider knowledge that it is in fact happening? No, but it is naive to assume that it isn't. This is the Achilles' heel of bitcoin as store of value thesis. \n\nBitcoin is a currency of the internet, that is why it was invented and how it should be used, not as some kind of a collectible you HODL in cold storage, it cannot function as a collectible because there is too much of it and the “imaginary supply” can be diluted, the imaginary supply defines the price.  \n\nThey can always print more imaginary bitcoin, and there is nothing we can do about it. The idea of Bitcoin as the future of store of value is over.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia1oen1",
                                    "author": "Charming-Meringue-68",
                                    "score": 1,
                                    "created_utc": 1653558320.0,
                                    "response": "Holding your own keys is really quite easy, for anyone that wants to",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia1oxfm",
                                            "author": "theneworld",
                                            "score": 0,
                                            "created_utc": 1653558781.0,
                                            "response": "Doesn't negate my point, lots of people give away their bitcoin for many reasons. As long as you have big institutions that control the keys, you can forget about 21 million bitcoin hard cap. They can print imaginary bitcoin, even more easily than central planners can print fiat. Which make bitcoin store of value idea absurd. There is  21 million bitcoin, but it gets in all probability diluted by imaginary bitcoin, imaginary bitcoin controls the price of real bitcoin.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9ykrh8",
                    "author": "FarCanary",
                    "score": 317,
                    "created_utc": 1653499740.0,
                    "response": "People who benefit from a system are unlikely to want to change to a new system.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia0e0wa",
                            "author": "Bearwaze",
                            "score": 5,
                            "created_utc": 1653527713.0,
                            "response": "This is a fair point, but store of wealth hoarding and mass adoption for a meaning full use case all can’t coalesce. You have to spend it for people to want to use it. With more adaptation within retail spaces will ensure it’s validity and help raise the price significantly.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9ythpz",
                            "author": "good_karma1122",
                            "score": 18,
                            "created_utc": 1653503162.0,
                            "response": "This ⬆️",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia03dvi",
                                    "author": "eterneraki",
                                    "score": 27,
                                    "created_utc": 1653522733.0,
                                    "response": "No. The vast majority of them are just clueless about bitcoin. there's no mass conspiracy to \"keep the system alive\". If Bitcoin is *inherently* better as a store of value, they'll buy some as a hedge at the very least. 30k for 1 btc is absolutely nothing to someone like that. They just dont know better",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia05n9m",
                                            "author": "CompSciGuy256",
                                            "score": 12,
                                            "created_utc": 1653523799.0,
                                            "response": "Are you trying to suggest that those with extreme wealth may NOT be the smartest people in the room!?\n\nLe Gasp! How dare thee!\n\nLoL",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia09sip",
                                                    "author": "cliff_smiff",
                                                    "score": 11,
                                                    "created_utc": 1653525752.0,
                                                    "response": "We are the smartest people in the room, obviously!",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "ia14daj",
                                            "author": "jackfirefish",
                                            "score": 5,
                                            "created_utc": 1653541668.0,
                                            "response": "Categorically incorrect and flawed thinking. As I've made more money I surround myself with people of similar caliber. As your network grows and your wealth grows, you are always in communication with your network about opportunities. I can assure you, a \"vast majority\" of \\_self-made\\_ millionaires are not clueless about anything.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia24c31",
                                                    "author": "eterneraki",
                                                    "score": 1,
                                                    "created_utc": 1653569078.0,
                                                    "response": ">self-made millionaires are not clueless about anything\n\nLet's not get arrogant here. I'm self-made and have a high net worth and i'm still just as clueless as everyone else about 99% of topics because being rich does not give me unlimited time and brain power. I have a strong network and a lot of random general knowledge but understanding bitcoin enough to invest in it took me a few years of on and off conversation. And that's being a highly technical person.\n\nBitcoin is a movement that did not start with the rich, you need more than a strong network to adopt it because it's still in the fringes right now. MAYBE if it was mainstream you can question a rich dude about why he hasn't looked into it, but you have to get past the phase where people are shrugging it off as a fad first",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "ia09n0b",
                                            "author": "lampstax",
                                            "score": 3,
                                            "created_utc": 1653525681.0,
                                            "response": "BTC isn't acting as a good hedge for anything right now.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia0aqxf",
                                                    "author": "eterneraki",
                                                    "score": 8,
                                                    "created_utc": 1653526204.0,
                                                    "response": "Anyone who has any clue about how BTC works would be a complete idiot to think it's a short term hedge. It's a volatile emerging digital asset. Long term? No brainer imo",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "ia0jvvq",
                                                            "author": "lampstax",
                                                            "score": 1,
                                                            "created_utc": 1653530421.0,
                                                            "response": "Long term agreed.   Short to mid term there is more downside and will continue to correlate with tech.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "ia1poue",
                                                                    "author": "nicolai8372",
                                                                    "score": 1,
                                                                    "created_utc": 1653559423.0,
                                                                    "response": "How long is the long term?",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "ia0jx5r",
                                                            "author": "lampstax",
                                                            "score": 0,
                                                            "created_utc": 1653530437.0,
                                                            "response": "Long term agreed.   Short to mid term there is more downside and will continue to correlate with tech and risk assets.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "ia08800",
                                            "author": "Shibarmy4life",
                                            "score": 1,
                                            "created_utc": 1653525012.0,
                                            "response": "True",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "ia0g6rf",
                                            "author": "newplayerentered",
                                            "score": 1,
                                            "created_utc": 1653528698.0,
                                            "response": "In that case, do you think more millionaires have capability to learn about bitcoin a strengths that us plebs who have to worry about more manane stuff day in and day out?\n\nSerious question, not pulling shit.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia0ivxp",
                                                    "author": "eterneraki",
                                                    "score": 5,
                                                    "created_utc": 1653529949.0,
                                                    "response": "Bitcoin is one of billions of other things that a millionaire might be interested in learning about. You know what is mundane to a lot of bored rich people though? Money lol\n\nIt makes sense that the people paying the most attention are the ones that are banking on it getting them out of the rat race",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "ia0o7y9",
                                                            "author": "Potato_Donkey_1",
                                                            "score": 7,
                                                            "created_utc": 1653532462.0,
                                                            "response": "This reminds me of a Maryanne Williamson observation: At one time, she didn't want to date anybody who had a lot of money because she figured they would only talk about boring, boring money. But dating poets and musicians and the like revealed that people who don't have much money talk all the time about money.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "ia0w8s1",
                                            "author": "maxcoiner",
                                            "score": 0,
                                            "created_utc": 1653536543.0,
                                            "response": "Being clueless about a thing is exactly what you should expect people to be when they are disincentivized to learn about it. u/FarCanary was right, that's the real problem here.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9z2wno",
                            "author": "idkBro021",
                            "score": 6,
                            "created_utc": 1653506909.0,
                            "response": "could u explain how this will replace our current system",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9zjvak",
                                    "author": "Accomplished-Row5989",
                                    "score": 11,
                                    "created_utc": 1653513866.0,
                                    "response": "Layer 2 is a means of exchange Lightning you can buy stuff with bitrefill like groceries & lots of other things. You can also send Peer 2 Peer faster than visa on Lightning. Layer 1 is only for store of value. \nIt is replacing the current system already with these two layers.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9znfce",
                                            "author": "idkBro021",
                                            "score": 1,
                                            "created_utc": 1653515404.0,
                                            "response": "what happens if countries ban the use for purchase internally and let’s say all do this",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9zqxs2",
                                                    "author": "itsnotthatdeepbrah",
                                                    "score": 12,
                                                    "created_utc": 1653516948.0,
                                                    "response": "Many countries have already tried to ban it. Bitcoin network just shrugs it off and continues running. Miners will just relocate to where they’re not stifled by regulations. The question is why would a country decide to ban it and give it’s competition an advantage? China has already shot itself in the foot by forcing all the miners, and their capital, to the US.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "ia01b5a",
                                                            "author": "CHA05-R31GN5",
                                                            "score": 2,
                                                            "created_utc": 1653521743.0,
                                                            "response": "Maybe China made the decision on more than what you superficially believe. A lot more complexity to market manipulation, determining leverage, and how to capitalize off positions than what you attribute as them pushing back. The publicly broadcasted media is just their stage for the play they've written. It's not like Banks, Wall Street, and governments just woke up in the past year or so and said, \"Hey, this has billions flowing through it daily. Maybe we should take a look see.\" One only has to glance back to 2017 and realize that wasn't a one off whereby suddenly \"retail\" panic sold to plunge crypto prices to ridiculous lows...all at the same time.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "ia0jikl",
                                                                    "author": "JohnnySixguns",
                                                                    "score": 8,
                                                                    "created_utc": 1653530247.0,
                                                                    "response": "Yes. The reasons are much more complex as you state. \n\nGovernments do fear BTC though for the simple reason that it is finite and usurps their power to print. China is less vulnerable to BTC compared to the U.S. though because they can’t print into oblivion with the same effectiveness as the U.S.  \n\nOnce the dollar starts it’s death spiral - which could be a matter of years or decades -  that will be the dawn of BTC as the new king. \n\nI also believe we will see the U.S. initially try to create a rival to BTC in the form of a U.S. central bank digital dollar. \n\nIt won’t work and will actually accelerate the adoption of Bitcoin. \n\nThe fact that America is a democracy with a huge number of its citizens investing vast sums of wealth in bitcoin, and BTC’s decentralized nature is what will keep it alive and “trusted” insofar as one can trust a trustless system. \n\nWhen the central banks try to roll out their digital dollar rival, American will ask?  WTF do we need this for?\n\nTheir awareness will increase, their curiosity will lead to learning, and the timing will be perfect because Bitcoin, Lightning, Strike, and other consumer oriented services will be maturing and allow BTC to become more accessible and the on ramp will be easier. \n\nIt’s just a question of when.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "ia1pzvv",
                                                                            "author": "CHA05-R31GN5",
                                                                            "score": 1,
                                                                            "created_utc": 1653559670.0,
                                                                            "response": "Governments are operated by industry of various financial markets. They don’t fear what they have control of with leverage in exchange value or supply. You’d be naive that this hasn’t been in the works for years since the supply constraints of the source suppliers for the existence of this asset.\n\nhttps://www.ign.com/articles/nvidia-sec-fine-settlement-gaming-gpus-crypto-miners-purchased\n\n2017 was evidence that crypto had been secured by the coordinated crash. Retail are chaotic in their habits of trade and wouldn’t follow synchronized trades to dump the exchange value of more than one asset. Wall Street and Banks aren’t regulated on crypto assets. And when they aren’t regulated, then they are given free reign to not be held accountable when leeching from it. So, the gist is that you applaud mining farms, 24/7 unregulated global trading, ETFs, trusts, stable coins, options contracts, futures, Public exchange IPOs, large commercial advertising, lending, marginalized collateral provided by broker’s and other companies, and so on. These are all things you say “they” fear from making much greater profits than retail and can control exchange value of which are the majority who are even invested. The majority of people didn’t mine crypto at cheap rates who’ve been holding onto it for years like you want to believe. The majority of people who own crypto bought it with money or used other assets bought with money that they plan on exchanging back to since crypto is still well in its infancy for reaching the exchange utility as fiat. What you fail to realize is that people didn’t buy crypto to hold until it completely replaces it. It wasn’t given to them or acquired through very cheap means that they can discount losses from it for many years.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        },
                                                                        {
                                                                            "id": "ia1r70r",
                                                                            "author": "Correct-Respect2425",
                                                                            "score": 1,
                                                                            "created_utc": 1653560651.0,
                                                                            "response": "Sure. I find it astonishing that people dont see how incredibly hard it is to change behaviour of any adult animal. Anyone who ever had or trained animals know that very young have incredible neuro plasticity, but at some point the difficulty of inflicting new behavioral changes increase with age exponentially. It is very hard to actually change your own behaviour using your own will once you are after ~25. It takes persistent focus and time. It is order of magnitude harder to change someone else's behaviour, especially if there is no immidiate conditioning to reinforce it. Multiply this extremely high behavioral momentum with critical majority which is statistically not very smart (being smart helps a lot with any complex cognitive / behavioral learning). And you know why the 'raison d'etre' of bitcoin is not yet catching up and price appears to be soo deeply oversold based on bitcoin's \"physics\" promises..\nPrice reflects all-collective perception / behaviour. Not fundamental technical properties of the asset. Unfortunately such significant collective behavioral change may inherently need perhaps decades, unless there is no catastrophy / emergency in the society where behaving consistently with reality (bitcoin fundamentals) became key survival advantage compared to the 'old behaviour'. \n\nJust think how long it took church to pass baton over the minds of people back into the hands of individual. Based on then available fundamental theory, church being redundant, false and almost completely toxic and counterproductive entity could be broadly estabilished by educated minds already by early 15th century. Yet it took up to 19th century to make behaviour of the masses consistent with objective reality. Think of the unnecessarily self-inflicted wars, suffering and witch burning in ~400 years of the masses not being able to make beliefs/behaviour consistent with reality..\n\nNow information flow is many orders of magnitude faster and not soo violently repressed. Perhaps we can hope that next paradigm shifts could take as little time as generational change. \n\nBitcoin's success of course cant be judged by the old money (people's) failure to immidiatelly and significantly change their behaviour when most cant confront much more trivial and low hanging irrational beliefs in their lifetime.. How this is not self evident to all is beyond me.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i9zu60e",
                                    "author": "devjabi",
                                    "score": 3,
                                    "created_utc": 1653518404.0,
                                    "response": "Bitcoin is bar none the best form of collateral on earth. All banks will end up issuing stablecoins backed by a treasury including BTC. This includes central banks.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia084re",
                                            "author": "One_Bullfrog_3554",
                                            "score": 1,
                                            "created_utc": 1653524969.0,
                                            "response": "It’s gold they have gold in real life guys",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia0k0b6",
                                                    "author": "Far_Perception_3815",
                                                    "score": 1,
                                                    "created_utc": 1653530477.0,
                                                    "response": "It’s just not the same, ya know? PAXG is a nice digital gold.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "ia0wigu",
                                                    "author": "maxcoiner",
                                                    "score": 1,
                                                    "created_utc": 1653536697.0,
                                                    "response": "Not for long. Gold is absolutely archaic and nearly impossible to use, even for banks.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i9z4flr",
                                    "author": "keto_brain",
                                    "score": -10,
                                    "created_utc": 1653507531.0,
                                    "response": "BTC will never replace the current system. Confirmations on the BTC blockchain take way too long. Everyone says \"Oh Lightning Network is the way\" but Lightning Network is a “layer 2” payment protocol that’s distinct from Bitcoin’s base-layer.\n\nLightning Network reintroduces temporary trust and centralization. Lightning is a trade-off. Users sacrifice the security and trustlessness of Bitcoin’s blockchain to temporarily gain faster and cheaper fees. They can leave Lightning at any time and reclaim these benefits; but again, risks are elevated until they exit Lightning.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9z5si7",
                                            "author": "FirstTimeLongTime_69",
                                            "score": 24,
                                            "created_utc": 1653508071.0,
                                            "response": "I'm fine with \"temporarily trusting\" a Lightning network node/app to pay for a coffee or groceries. I'm not fine with trusting central banks and governments to not debase the currency for their own benefit. What you're essentially saying is \"Bitcoin is orders of magnitude better than the current system, but because it isn't perfect in every way it cannot replace the current system.\" I disagree with that.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9z6rr9",
                                                    "author": "keto_brain",
                                                    "score": -3,
                                                    "created_utc": 1653508461.0,
                                                    "response": "I am saying BTC in and of itself can never replace the current system because multiple confirmations on the block chain take way too long. I'd hardly call it \"not perfect\" its fundamental architecture prevents it from being used to buy milk from walmart.   \n\n\nThe more people say things like \"I'm fine with temporary losing trust to gain speed\" is just another door that gets open for hackers, the problem is that unlike when your credit card gets used you cannot call Chase and ask for your money back. If you or a company lose BTC in a transaction there is no getting that money back.   \n\n\nI never said BTC is \"orders of magnitude better then the current system\" as a matter of fact I can list other reasons why it sucks compared to the current system. Multiple verifications on the blockchain being one, the complexity of hardware wallets for the average consumer being another, the decentralized nature of the ledger is a 3rd. If your grannie accidently sends her crypto to the wrong public address that BTC is lost for ever. If Coinbase gets hacked all all their customer's private keys exposed all that BTC is lose, etc..",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9z8e6b",
                                                            "author": "jalanst",
                                                            "score": 6,
                                                            "created_utc": 1653509111.0,
                                                            "response": "Well elaborated criticism, with knowledge. Thanks. In my opinion the tech is still very young (12 years) and surely btc was not made to replace the actual payment system, but to counterbalance it and offer alternatives to pressure it into giving more advantages to users.\n\n Cheers",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9z9cgb",
                                                                    "author": "keto_brain",
                                                                    "score": 1,
                                                                    "created_utc": 1653509500.0,
                                                                    "response": "Yes in the grand scheme of things blockchain is relatively new technology, the question I always ask myself is BTC the Netscape Navigator of the Crypto world. Meaning the first product in a given space rarely ends up being the long term champion. BTC is the first and hottest mainstream currency but if/when a new better faster crypto enters the market. BTC investors or speculators should be prepared to move when that happens so they don't get caught holding the bag.   \n\n\nI don't think BTC is like a lump of gold you can burry in your back yard and forget about for 20 years investors or speculators rather need to keep up with market trends and be ready to move when the market does.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9zy2b3",
                                                                            "author": "Self_Blumpkin",
                                                                            "score": 4,
                                                                            "created_utc": 1653520210.0,
                                                                            "response": "I agree with this statement. First mover advantage usually only lasts a limited amount of time. \n\nOnce exchanges stop using it as a base trade pair against every single alt coin there’s room for another coin to move in. \n\nThe devils advocate argument though is gold. For a stupid amount of time gold has been a trading mechanism, a currency, a store of value. It’s no longer used as a traditional currency. \n\nBUT: countries stack it like crazy, it’s still very much a store of value. I see bitcoin going this route. So in that case, it ends up being the “gold” of cryptocurrency. Countries will stack it like crazy and try to hoard as much of it as they can. You can buy it as an investment, it will have a market. It won’t be used as a traditional currency. In this case I see the possibility for an alt coin to come along as a true decentralized digital currency. Close to zero fees to transact on the network, likely a proof of stake architecture. \n\nWhatever coin it ends up being will need a perfect storm of code, exposure, partners, etc. it will need to be talked about on the nightly news. It will need a UX / UI that is second to none. It can’t be premined. It needs to be created by a passionate person or persons who create it for altruistic reasons, not to get rich. \n\nPlenty of coins that could be used as a currency have been created but most of them were premined / airdropped to shit, or were basically created to make their creators rich. \n\nThe code will need to be flawless. That basically removes smart contract abilities. No layer two garbage. A super lightweight blockchain. \n\nI think we need a leapfrog jump in storage / storage speed capabilities before something like this will be logically possible too. Storing the world’s transactions, indefinitely will only be possible if the nodes today are super computers lol. So major emphasis on lightweight. \n\nIt’s possible. \n\nAfter writing all that out I feel like I changed my own mind. I feel like BTC is like a chunk of gold you can bury in your yard for 20 years and feel relatively good about its safety.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        },
                                                                        {
                                                                            "id": "i9zazm3",
                                                                            "author": "jalanst",
                                                                            "score": 3,
                                                                            "created_utc": 1653510165.0,
                                                                            "response": "Yeah that is the question I ask myself too as a non developer. The thing is that I'm not sure that you can offer the advantages btc offers without its disadvantages. I mean, maybe btc is destined to be some kind of value asset and then some other fork of it, or another crypto will take the position of being the day to day cash payment.\nI guess we will store our savings in something hard (as the austrian school would define hard cash, BTC), and then we will convert it to other softer assets to make payments.\n\nBut man, things are evolving so fast that I don't dare to make even 10 year predictions",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9z6udu",
                            "author": "Miserable-Narwhal-84",
                            "score": 6,
                            "created_utc": 1653508490.0,
                            "response": "Correct, they are called cantillionares. Or rent seeking parasites as I like to refer to them.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9zb4dr",
                                    "author": "Nearby_You_313",
                                    "score": 9,
                                    "created_utc": 1653510218.0,
                                    "response": "You don't think someone should be able to rent their house?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9zlexl",
                                            "author": "technicallynottrue",
                                            "score": 1,
                                            "created_utc": 1653514533.0,
                                            "response": "Nope residential homes should be for residential use not commercial use.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9znujj",
                                                    "author": "Nearby_You_313",
                                                    "score": 7,
                                                    "created_utc": 1653515585.0,
                                                    "response": "If you think through that, you're talking about seriously undermining people's rights.\n\nFor example, what if I move and buy a new house and the market is a horrible time to sell? Are you going to force me to sell at a loss? What if I'm underwater and can't afford it? Seems similar to illegal search and seizure (seizure in this case) in that you're forcing me to give up property against my will.\n\nAdditionally, many property owners make hardly anything from a house rental. After management fees (commonly 10%) plus saving for expenditures like new roof/etc that must be planned for, they're lucky to get a bit more than breaking even. You do it anyways because it's someone else paying down your mortgage, but that's often the only real benefit. (I know multiple property owners that rent but don't do it myself.)",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9zqst3",
                                                            "author": "somethingimadeup",
                                                            "score": 5,
                                                            "created_utc": 1653516886.0,
                                                            "response": "I agree with you, but also there’s obviously a difference between paying rent you never get back and paying off an asset you still own. Saying you “make hardly anything” is disingenuous because technically breaking even is 100% profit because you still own the asset",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9zro8c",
                                                                    "author": "Nearby_You_313",
                                                                    "score": 3,
                                                                    "created_utc": 1653517279.0,
                                                                    "response": "Both have benefits, though. Don't look at someone owning a house as immediately in a better position than a renter. For example, many people get stuck in an underwater mortgage and can't relocate, even if their job prospects in the area dry up and their house drops in value, they possibly foreclosed on, etc.\n\nI'm actually concerned about moving in about two years as economic data looks like a major recession (worse than now) is coming and house values will likely plummet. If we rented, that wouldn't be a problem.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9zs4j6",
                                                                            "author": "somethingimadeup",
                                                                            "score": 2,
                                                                            "created_utc": 1653517481.0,
                                                                            "response": "Yeah absolutely it’s not simple I’m just pointing out that there’s a huge difference. If you pay $2000/month in rent for 5 years you’ve lost $120,000 if you pay $2000/month to a mortgage you haven’t lost that",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "ia03zci",
                                                                                    "author": "blarghusmaximus",
                                                                                    "score": 6,
                                                                                    "created_utc": 1653523019.0,
                                                                                    "response": "$2000 month rent is not equivalent to a 2000 month mortgage. You aint even looked at insurance, property taxes, shit\n\njust this month, I had to renew my insurance policy so  I had to pay --\n\n&#x200B;\n\n200 for an inspcetion\n\nthat inspection found\n\n500 worth of AC work\n\n600 in electrical work\n\n250 in plumbing work\n\nin the last 3 years ive replacedA) the AC unit (5k)\n\nB) the water heater (1k)\n\nC) repairs to external siding / stucco of the house (3k)\n\nand in the next 5-7 years Ive got to replace a roof thats gonna cost me probably $20,000\n\nYour mortgage is just the entry fee, man. Dont fucking play  \n\n\nAnd you know what? Tomorrow my washing machine could go out and I'm out another 1k for that. Maybe the fridge. The stove. Someone could break a window.   \n\n\nThe mortage is just the fucking entry fee",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "ia0qkrx",
                                                                                            "author": "vaper_32",
                                                                                            "score": 1,
                                                                                            "created_utc": 1653533569.0,
                                                                                            "response": "Pardon my ignorance, what is the insurance for when you have to pay for all the stuff including externally enforced damage like somebody breaking your windows??",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "id": "i9zsbvh",
                                                                                    "author": "Nearby_You_313",
                                                                                    "score": 2,
                                                                                    "created_utc": 1653517573.0,
                                                                                    "response": "Actually you might. We're looking at housing values possibly plummeting, so unless we could stay long enough to recoup the loss, we may very well be out that much.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i9zsyst",
                                                                                            "author": "somethingimadeup",
                                                                                            "score": 2,
                                                                                            "created_utc": 1653517859.0,
                                                                                            "response": "Fair point",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        },
                                                                                        {
                                                                                            "id": "ia0rwtw",
                                                                                            "author": "ALifeLongLearner",
                                                                                            "score": 1,
                                                                                            "created_utc": 1653534230.0,
                                                                                            "response": "Huh Whaaaaaaaaaaaaaaaaaaaat? Rent-seeking has got nothing to do with house rents, my man. It's an economic concept where people try to gain something for nothing.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "ia0td94",
                                                            "author": "ilikedevo",
                                                            "score": 2,
                                                            "created_utc": 1653534975.0,
                                                            "response": "I have a commercial rental space. I don’t make much profit but it does increase in value.  Buying rental properties is risky business but in my case I use part of the building for my business.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "ia1zvh4",
                                                    "author": "TigerMaskVI",
                                                    "score": 1,
                                                    "created_utc": 1653566593.0,
                                                    "response": "Property should be used for whatever the property owner wants, get fucked",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i9zczni",
                                    "author": "StonksPeasant",
                                    "score": 6,
                                    "created_utc": 1653510978.0,
                                    "response": "This is pretty unfair to characterize all of them or even most of them in this manner",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9zde7n",
                                    "author": "civilian411",
                                    "score": 1,
                                    "created_utc": 1653511144.0,
                                    "response": "Matthew?",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9zejjb",
                                    "author": "bestsloper",
                                    "score": 1,
                                    "created_utc": 1653511620.0,
                                    "response": "Cantillon?! I love that beer!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9zcqfr",
                            "author": "jbcraigs",
                            "score": 4,
                            "created_utc": 1653510873.0,
                            "response": "Damn! You really glued that tinfoil hat to your head didn’t you?!",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "ia031uw",
                            "author": "Gingerfalcon",
                            "score": 2,
                            "created_utc": 1653522573.0,
                            "response": "this makes sense, people who’ve generated wealth don’t take risks or invest in things they don’t know 100%. /s",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9zvm1z",
                            "author": "JeremyLinForever",
                            "score": 1,
                            "created_utc": 1653519067.0,
                            "response": "Until it’s too late… lol",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9yjd32",
                    "author": "MeanDrawer6874",
                    "score": 45,
                    "created_utc": 1653499205.0,
                    "response": "The better question is why hasn't one become batman!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9zy8qt",
                            "author": "Self_Blumpkin",
                            "score": 5,
                            "created_utc": 1653520296.0,
                            "response": "No one has never seen me and Batman in the same room at the same time. \n\nJust throwing that out there",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9yzwtg",
                            "author": "spilledmind",
                            "score": 3,
                            "created_utc": 1653505699.0,
                            "response": "I think some of them do become Batman in some ways but with less fighting, a suit, and a bat light.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9z66r9",
                                    "author": "MeanDrawer6874",
                                    "score": 5,
                                    "created_utc": 1653508227.0,
                                    "response": "One man is not enough there needs to be a symbol",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9z6ogr",
                                            "author": "spilledmind",
                                            "score": 2,
                                            "created_utc": 1653508425.0,
                                            "response": "[there is](https://decentralizedgear.com/collections/all-products/products/1989-batcoin-1)",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "ia0hdkc",
                            "author": "VPNApe",
                            "score": 2,
                            "created_utc": 1653529243.0,
                            "response": "Because Batman would die on day one irl.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "ia1jcg6",
                            "author": "ksmred",
                            "score": 1,
                            "created_utc": 1653553796.0,
                            "response": "Robert Pattinson is a millionaire, and he is Batman",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9zra4d",
                    "author": "phudgeoff",
                    "score": 11,
                    "created_utc": 1653517104.0,
                    "response": "Vast majority of those millionaires are still trying to set the time on their VHS players and you're asking why they aren't buying bitcoin?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ztbk9",
                            "author": "Reddittellmewhy",
                            "score": 5,
                            "created_utc": 1653518019.0,
                            "response": "Fact.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9ymfpk",
                    "author": "AcessFull",
                    "score": 59,
                    "created_utc": 1653500397.0,
                    "response": "Millionaire doesn't mean what it used to.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9zq2sb",
                            "author": "brows1ng",
                            "score": 13,
                            "created_utc": 1653516560.0,
                            "response": "I’m pretty sure someone who bought a $200k house 15-20 years ago worth $1+ million today, and still holds it now is considered a millionaire, right?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9zroax",
                                    "author": "DonnaHuee",
                                    "score": 4,
                                    "created_utc": 1653517280.0,
                                    "response": "For most account, your primary residence is not included in being considered a millionaire. I actually read about this recently and was surprised about that.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9zu7zn",
                                            "author": "brows1ng",
                                            "score": 8,
                                            "created_utc": 1653518429.0,
                                            "response": "Is that right? Kinda interesting considering Tesla stock puts you on the billionaire list. Houses are pretty liquid these days.\n\nMy next thought is the boomer generation - I’m sure plenty of people in their 50-60’s have 401k’s that have grown over $1 million at this point in their lives. At least in the US. Hard to retire without that much helping supplement as passive income these days.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia0u094",
                                                    "author": "ilikedevo",
                                                    "score": 4,
                                                    "created_utc": 1653535309.0,
                                                    "response": "1 million averaging a 6% return is only 60k a year.  Most people I know are aiming for 2 million for retirement.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i9zx853",
                                                    "author": "DonnaHuee",
                                                    "score": 1,
                                                    "created_utc": 1653519817.0,
                                                    "response": "[https://www.kiplinger.com/slideshow/investing/t052-s001-10-things-you-must-know-becoming-millionaire/index.html](https://www.kiplinger.com/slideshow/investing/t052-s001-10-things-you-must-know-becoming-millionaire/index.html)\n\nI’m honestly a bit confused now. The third paragraph makes it sound like it’s not included, but the fourth makes it sound like the equity you have in your house is included. \n\nSo idk now.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "ia01ps4",
                                                            "author": "CHA05-R31GN5",
                                                            "score": 3,
                                                            "created_utc": 1653521941.0,
                                                            "response": "Personal net worth includes equity from real estate which is an asset.",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "ia22mq4",
                                                            "author": "communomancer",
                                                            "score": 1,
                                                            "created_utc": 1653568167.0,
                                                            "response": "They're two different standards. I'm a millionaire easy by the second (simple assets minus liabilities) but nowhere near the first (a million dollars in easily investable assets...the standard for \"wealth research\").\n\nI don't know which standard the \"58 million millionaires\" the OP is referring to is using, though. I do kinda find it hard to believe that there would be 58 million people who reach the second standard, but the world is a big and surprising place.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "ia167dq",
                                            "author": "enja1231",
                                            "score": 2,
                                            "created_utc": 1653542972.0,
                                            "response": "In USA, being an “accredited investor” requires $1million net worth NOT including equity in primary residence.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "ia0evwp",
                                            "author": "Puzzled_Bread_6412",
                                            "score": 1,
                                            "created_utc": 1653528104.0,
                                            "response": "I’d include primary residence equity in a net worth calculation.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia0id51",
                                                    "author": "DonnaHuee",
                                                    "score": 1,
                                                    "created_utc": 1653529704.0,
                                                    "response": "Yeah that makes sense",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "ia15goo",
                                    "author": "Mr_pb_hole",
                                    "score": 1,
                                    "created_utc": 1653542445.0,
                                    "response": "Very few houses have gone from 200k to 1mil in the last 20 years. My parent hit the lotto by buying a 330k house in the mid 90s and then selling it for 922 in 07 right before the crash",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9zeqzc",
                    "author": "AndyZuggle",
                    "score": 42,
                    "created_utc": 1653511706.0,
                    "response": "Most millionaires are not rich.  They are just regular people who are a bit farther along in life.  Most millionaires fall into one or both of these two categories:\n\nRetirees with a paid-off house and a retirement fund.  They have no desire to rock the boat, they just want to enjoy the next decade or two as best they can.\n\nSmall businesses owners (including farmers) who have all of their assets tied up in the business.  They can't invest, and might be struggling financially.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia01smh",
                            "author": "Sugarman4",
                            "score": 8,
                            "created_utc": 1653521978.0,
                            "response": "In short. You only have to 'get' rich once. Afterwards why gamble on shit?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia0huy8",
                                    "author": "VPNApe",
                                    "score": 3,
                                    "created_utc": 1653529462.0,
                                    "response": "Well at this point Bitcoin is insurance against the fiat collapse which is looking more and more likely every time the global economy takes a dump.\n\nNOT investing in Bitcoin is risky.\n\nThat being said most people that are retried don't bother keeping up with the times. So many people with bond heavy portfolios are going to eat shit.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia1mx6k",
                                            "author": "Apprehensive_Loan776",
                                            "score": 1,
                                            "created_utc": 1653557014.0,
                                            "response": "Yeah but your basic millionaire doesn’t hold much fiat. They have property, maybe their small business and some stocks. \nOften there will be a mortgage over the property (short fiat, long real property) so they don’t have this problem of losing value in savings.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "ia0to6f",
                                    "author": "Thenarza",
                                    "score": 1,
                                    "created_utc": 1653535135.0,
                                    "response": "According to Elon, to put people on Mars and save humanity for the future.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9zvqoe",
                            "author": "alexneef",
                            "score": 5,
                            "created_utc": 1653519126.0,
                            "response": "This is a good answer. Also many of the millionaires have.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "ia0tnjv",
                            "author": "ilikedevo",
                            "score": 2,
                            "created_utc": 1653535126.0,
                            "response": "Depends where you live. In Seattle if your over 50 and a millionaire you’re still kinda poor.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9yyrv9",
                    "author": "0x1a3c3e7",
                    "score": 7,
                    "created_utc": 1653505241.0,
                    "response": "Because they aren't millionaires in fiat, they're millionaires in stocks, bonds, real estate and commercial businesses that make more money more consistently than Bitcoin can.  Most investors have high time preference, which means they want to see meaningful ROIs in months, not years.  In order to buy Bitcoin, they would have to liquidate some assets and forfeit the income generated from them, and that's too much of a tradeoff.\n\nIf I ever become a millionaire, I want to create a fast food restaurant franchise based on my idea of a fully automated kitchen.  A robotic arm slides across the ceiling between the refrigerator and freezer rooms in the back and brings the food to the cooking machines in the kitchen area.  The machines then cook the food with precise heat and timing so that every order is al dente.  And I would have windows along the drive through, so people can watch the food cooking and getting wrapped and bagged without ever coming in contact with human hands. :)",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9zzcg2",
                            "author": "seraph321",
                            "score": 2,
                            "created_utc": 1653520815.0,
                            "response": "(off topic comment I normally would delete, but figured why not)\n\nThat business idea sounds like a great way to burn through tends of millions in R&D. If you really believe in it, you'd be a lot better off convincing VC's to invest rather than trying to self-fund it, which you wouldn't be able to do with anything less than $10m. \n\nMcDonalds and others have been trying to automate as much of their kitchens as possible for decades, btw. It's a bit harder than it sounds. Rising labor prices are certainly incentivising it more now, but only the big boys have the resources to fund the research and manufacturing at scale. I don't think VC's would be into funding an automated restaurant startup, but if you really had some amazing patents and tech, you could maybe build systems to sell. If you could actually find the talent and chip supplies...",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9ymcu6",
                    "author": "Keith_Kong",
                    "score": 33,
                    "created_utc": 1653500365.0,
                    "response": "If you're a millionaire, you don't just buy a million dollars of Bitcoin. You buy 1% of your liquid net-worth in Bitcoin. Many are too old to understand Bitcoin so they will never buy it at this stage in its life. Many more than you think have already bought *some*.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9z2si8",
                            "author": "FTMNL",
                            "score": 6,
                            "created_utc": 1653506861.0,
                            "response": "Bitcoin market cap is only 0,07% of the total amount of money worldwide.\nImagine the price if only 1% of that getting into Bitcoin.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9z3c93",
                                    "author": "Keith_Kong",
                                    "score": 6,
                                    "created_utc": 1653507086.0,
                                    "response": "Yeah pretty amazing thought, shows how early we are–which is cool, but–also shows how far away we are from global reserve status.\n\nPrice simply can’t grow as fast as it wants to reach those levels. It’s unpopular, but my most likely scenario for Bitcoin is that it takes decades before we start seeing a true decrease in volatility and a transition to being a stable, global medium of exchange.\n\nUntil then, it’s a long term store of value and a short term gamble.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9zdc1a",
                                            "author": "PRMan99",
                                            "score": -1,
                                            "created_utc": 1653511120.0,
                                            "response": "Long-term it will be force-replaced by CBDCs which will require the global ID (aka mark of the beast) to use.\n\nHow long is the question.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9zfvki",
                                                    "author": "Keith_Kong",
                                                    "score": 2,
                                                    "created_utc": 1653512179.0,
                                                    "response": "I strongly disagree with the inevitability of this outcome. The WEF itself is so far away from that kind of influence. The central banks around the world are still extremely autonomous in their decision making around exactly what a CBDC should look like or even if one should exist. Many at the WEF conference were even arguing against a CBDC for the US, favoring regulated stablecoins instead.\n\nDoes the US still get a CBDC? Perhaps. Do all central banks just give up their autonomy for a global CBDC… they might as well adopt Bitcoin in that case.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "ia03p3s",
                                                    "author": "SubstantialNinja",
                                                    "score": 2,
                                                    "created_utc": 1653522882.0,
                                                    "response": "The bankers will never let it happen. They need the current system of lending other people deposits for profit. If they have CBDC's people can keep their money in their own wallets and no deposits to lend out. \n\nhttps://www.bloomberg.com/news/articles/2022-05-23/wall-street-bank-lobby-lines-up-against-us-digital-dollar-plans",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9zqxgb",
                                            "author": "DrizzyDoe",
                                            "score": 1,
                                            "created_utc": 1653516944.0,
                                            "response": "I'm hoping to see it more commonly used as a MoE by 2050 ish. I really don't think people understand how long this process will take.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9zw012",
                                                    "author": "Keith_Kong",
                                                    "score": 1,
                                                    "created_utc": 1653519247.0,
                                                    "response": "Agreed, the returns necessary to get there alone tells you everything you need to know.\n\nCould be faster than 2050 if nation states forced it to just explode in a rush of increased strong trust. But even then I’m just not sure you can avoid corrections via early holders taking massive profits along the way. That, or holders just become massively wealthy overnight which makes no sense.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "ia0igjr",
                                                    "author": "VPNApe",
                                                    "score": 1,
                                                    "created_utc": 1653529749.0,
                                                    "response": "I honestly don't see it taking that long. Adoption is going up exponentially. I'm expecting most major retailers to accept it within 5-10 years. \n\nIt really is as simple as just updating checkout software to integrate with the lightning network. If El Salvador can do it in basically no time it can't be that hard.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9yqx94",
                            "author": "WittyStick",
                            "score": 9,
                            "created_utc": 1653502153.0,
                            "response": "If all the millionaire's in the world wanted to put 1% of their wealth into bitcoin, there still aren't enough bitcoin to go round.\n\nKnowing this, it would be extremely silly to be a millionaire and not immediately put at least 1% of your net-worth into bitcoin, just in-case.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9zd59g",
                                    "author": "PRMan99",
                                    "score": 7,
                                    "created_utc": 1653511042.0,
                                    "response": ">  there still aren't enough bitcoin to go round.\n\nThere are always enough bitcoin to go around.  It's just a matter of decimal places.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9yjfys",
                    "author": "Sir_John_Barleycorn",
                    "score": 12,
                    "created_utc": 1653499236.0,
                    "response": "Curious what it means to be a “millionaire” in this. I’m a millionaire when you look at my home price. But I sure don’t have money like a millionaire.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9yq07k",
                            "author": "Wazam0",
                            "score": 4,
                            "created_utc": 1653501792.0,
                            "response": "If you own the home outright then congrats you’re a millionaire lol",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9z1ekq",
                                    "author": "Sir_John_Barleycorn",
                                    "score": 1,
                                    "created_utc": 1653506301.0,
                                    "response": "I don’t own it outright. Just the equity.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "ia0vepz",
                                    "author": "ilikedevo",
                                    "score": 1,
                                    "created_utc": 1653536071.0,
                                    "response": "If you bought your house long enough ago to have it paid off you are a millionaire but you only save like $1500 a month. My property taxes are higher than my first house payment.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9ze145",
                            "author": "civilian411",
                            "score": 2,
                            "created_utc": 1653511406.0,
                            "response": "In the Bay Area you could have bought a home for $500k and now it’s worth $2M.  House rich but poor or something like that",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9zthz6",
                                    "author": "Sir_John_Barleycorn",
                                    "score": 1,
                                    "created_utc": 1653518100.0,
                                    "response": "Exactly",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9zyhw6",
                            "author": "seraph321",
                            "score": 1,
                            "created_utc": 1653520418.0,
                            "response": ">But I sure don’t have money like a millionaire.\n\nI mean... you would if you sold your house? I'm not sure what 'having money like a millionaire' means to you. To me, having $1 million in liquid assets just means I can spend roughly $40k/year, which only funds a very modest lifestyle in most first-world countries, especially if renting. And that's assuming you want to have almost all of it in fairly high-risk investments, which I don't tend to do. But you *could* do that. \n\nThe 'millionaire' label is clearly obsolete for describing someone who's 'rich'. *Maybe,* you could say 'financially independent'. The minimum on rich has moved to at least $5-10 million these days, and even then, it's not like that range affords huge flexes if you've stopped earning outside investments.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "ia0bmz9",
                            "author": "Hefty-Interview4460",
                            "score": 1,
                            "created_utc": 1653526620.0,
                            "response": "What liability do you have ? You re a milionaire if your asset - liability can be marked up above 1 million USD, simple as that. Your home price doesnt make you a milionaire if you started paying 1k in mortgage last month and have 2 millions debt left to pay.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia169kg",
                                    "author": "Sir_John_Barleycorn",
                                    "score": 1,
                                    "created_utc": 1653543017.0,
                                    "response": "Yes, I know how equity works.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia05v8g",
                    "author": "Sudden-Owl-3571",
                    "score": 5,
                    "created_utc": 1653523904.0,
                    "response": "Rich often doesn’t translate to smart…",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia07dxe",
                            "author": "YaBoyLaKroy",
                            "score": 3,
                            "created_utc": 1653524620.0,
                            "response": "this. people have hard time accepting the fact that most (not all) rich people are stupid.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9zxjjv",
                    "author": "heyhihowyahdurn",
                    "score": 3,
                    "created_utc": 1653519964.0,
                    "response": "Most are real estate millionaires on paper and not in cash. Also if they are real estate millionaires they probably see bitcoin and crypto as a whole as way to volatile.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9yippo",
                    "author": "NiceDoctorBeam",
                    "score": 19,
                    "created_utc": 1653498953.0,
                    "response": "Being rich doesn't mean you're smart.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9z9n8b",
                            "author": "horsecyack",
                            "score": 1,
                            "created_utc": 1653509623.0,
                            "response": "A very smart poor phuck",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9z3wze",
                    "author": "SeanyBlaze",
                    "score": 4,
                    "created_utc": 1653507320.0,
                    "response": "there are 7.9 billion people on earth, why haven't they bought all the bitcoin if it's so scarce?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9zcipb",
                    "author": "jbcraigs",
                    "score": 2,
                    "created_utc": 1653510785.0,
                    "response": "There are 58 million millionaires! Why have they not bought All the truffles when they are so rare!!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ze95x",
                    "author": "CommunicationFun4921",
                    "score": 2,
                    "created_utc": 1653511500.0,
                    "response": "Most millionaires money is in illiquid assets like the house they live in and companies that they own.\n\nMy grandpa was a millionaire, but it was because he owned a lakeside cabin in a resort town that was built by my great, great grandfather when the resort town was just some backwater lumber town.  He didn't sell it until a few years before his death when he was too old to live there and it broke his heart to do it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9zfy83",
                    "author": "talanhorne",
                    "score": 2,
                    "created_utc": 1653512210.0,
                    "response": "A lot of them are old and senile. \\\\\\*shrug\\\\\\*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9zper9",
                    "author": "oboshoe",
                    "score": 2,
                    "created_utc": 1653516266.0,
                    "response": "My Mom's a millionaire.\n\n\"hey Mom.  you should buy some bitcoin\"\n\n\"oh no....I don't know anything about bits and coins and all that new fancy computer money\"",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9zrb3d",
                    "author": "pgpwnd",
                    "score": 2,
                    "created_utc": 1653517116.0,
                    "response": "too early for that",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia0un8v",
                    "author": "noyrb1",
                    "score": 2,
                    "created_utc": 1653535653.0,
                    "response": "It just became mainstream recently and lack of regulatory framework",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia1ymi7",
                            "author": "rookie0489",
                            "score": 1,
                            "created_utc": 1653565825.0,
                            "response": "This is a type of Framework which is not want to work in a longer term.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia0z4g4",
                    "author": "jonesmatty",
                    "score": 2,
                    "created_utc": 1653538247.0,
                    "response": "The simple answer is that millionaires get their advice from trusted advisors who are part of the broken financial system. Those advisors get their advice from those bankers, hedge fund managers, bond traders, and the Federal Reserve that depend on the broken financial system to extract their wealth in \"small\" fees from the masses. Spouses stay in abusive relationships, employees work their while lives for shitty bosses for shitty pay, people of every level fear upsetting the status quo more than they want something good for them.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia16qwb",
                    "author": "Namaste_T2_",
                    "score": 2,
                    "created_utc": 1653543359.0,
                    "response": "Maybe their net worth is a million bucks but they don’t have much money in the bank",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia1bpps",
                    "author": "ardevd",
                    "score": 2,
                    "created_utc": 1653547206.0,
                    "response": "Also, most “millionaires” don’t sit around with millions of cash wondering what to spend it on. They invest in various assets and manage their risk accordingly. Many have probably allocated a small amount to Bitcoin but it’s not really palatable for most of them to sell everything (with all the tax implications that comes with) and YOLO it all into\na single asset. Not everyone can be Michael\nSaylor.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia1dbua",
                    "author": "Kirk8829",
                    "score": 2,
                    "created_utc": 1653548515.0,
                    "response": "“Millionaire” usually means a person with a net worth of over a million dollars. Usually they aren’t gonna sell some of their assets that is usually generating them income to invent in Bitcoin. They probably invest if they invest in Bitcoin at all, very small amounts. OP doesn’t understand we are the new incoming “new money” of the future. Buy, hodl and diversify",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9yhzek",
                    "author": "IceWallow97",
                    "score": 5,
                    "created_utc": 1653498667.0,
                    "response": "All the bitcoin that is circulating is already bought, someone holds it and only sells it for the price they want IF they want, nobody can buy something that people aren't selling for example. There's around 2 million BTC left to be mined, that's it. Did I answer your question?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ywmrr",
                    "author": "southbayellay",
                    "score": 2,
                    "created_utc": 1653504393.0,
                    "response": "There are 2000 miles coast to coast, why haven’t I gotten my PhD yet?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9yuo4h",
                    "author": "s4burf",
                    "score": 2,
                    "created_utc": 1653503627.0,
                    "response": "It has no inherent value.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9z9imn",
                            "author": "Lord_Smedley",
                            "score": 3,
                            "created_utc": 1653509570.0,
                            "response": "\"Inherent.\"\n\nWell then, what *does* have inherent value? Value arises either from a service performed, a good purchased, or a scarcity that others desire. Rich people who don't need any more goods or services opt for scarce assets others want, seeing these as a \"long-term store of value.\"\n\nAnd in this context, bitcoin has properties that other long-term store of values don't. particularly it's uncensorable, easily transported, capped at 21 million units, etc.\n\nIf you're going to claim bitcoin has no inherent value, it might be to your advantage reputationally and financially to stop talking for a few days and to [educate yourself](https://www.casebitcoin.com/) about why bitcoin has clear advantages over gold, the dollar, real estate, and fine art.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9z6yni",
                    "author": "NeatFrogs",
                    "score": 1,
                    "created_utc": 1653508539.0,
                    "response": "Who says these millionaires haven't been accumulating bitcoin? Why do you think the price is in the $10s of thousands per coin? \n\nAsk yourself: How would you even know if the rich bought up all of the coins?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9znhwk",
                    "author": "sciencemodsaretrash",
                    "score": 1,
                    "created_utc": 1653515434.0,
                    "response": "That’s like saying why don’t all millionaires buy all the gold, or silver, ect… cuz they don’t want to",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9yptrl",
                    "author": "yacnamron",
                    "score": 1,
                    "created_utc": 1653501722.0,
                    "response": "What if someone has well over $1m in his BTC wallet thanks to buying drugs from Ross many years ago? Does he get factored in on that 58 million millionaires list?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9yrpn9",
                    "author": "jvvmh",
                    "score": 1,
                    "created_utc": 1653502467.0,
                    "response": "supply and demand.\n\nsupply of bitcoin available for sale comes from bitcoin miners and bitcoin holders that are willing to sell. \n\ndemand of bitcoin comes from people/entities that want some bitcoin.\n\nprice goes up as buyers overwhelm sellers, until price high enough to create more sellers than buyers.\n\nprice goes down as sellers overwhelm buyers, until price low enough to create more buyers than sellers.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9yu1bk",
                    "author": "Any-Explanation-6877",
                    "score": 1,
                    "created_utc": 1653503376.0,
                    "response": "Don't worry. They will when this \"pandemic treaty\" is over",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9yvvat",
                    "author": "borrelliborr",
                    "score": 1,
                    "created_utc": 1653504093.0,
                    "response": "Because they are in it to make more money. They would buy and sell depending on the current price to accumulate more. Buying and holding is not the way if you want to maximize gains. Also a big portion of them don’t believe in bitcoin.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ywah8",
                    "author": "hemzer",
                    "score": 1,
                    "created_utc": 1653504259.0,
                    "response": "How old are they?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9yy4u2",
                    "author": "nikosnelson",
                    "score": 1,
                    "created_utc": 1653504985.0,
                    "response": "Because not all bitcoins are for sale",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9yyv47",
                    "author": "jatttitude",
                    "score": 1,
                    "created_utc": 1653505276.0,
                    "response": "coz they don’t believe in this new technology and their old way of making money is working",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9z278j",
                    "author": "Euphoric-Surprise293",
                    "score": 1,
                    "created_utc": 1653506621.0,
                    "response": "Because they are already rich",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9z3kla",
                    "author": "Universal_Contrarian",
                    "score": 1,
                    "created_utc": 1653507181.0,
                    "response": "1 out of 6 retirees in the US have million dollar 401k’s… “millionaire” doesn’t mean what most think, by definition. Are you really that rich when you have to live off of that for decades?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9z6di6",
                    "author": "fjjjfjfnfnfng",
                    "score": 1,
                    "created_utc": 1653508302.0,
                    "response": "They prefer cantillionism",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9z6v8n",
                    "author": "jmh300",
                    "score": 1,
                    "created_utc": 1653508500.0,
                    "response": "Busy elsewhere",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9z7bl7",
                    "author": "FerrisMichaels",
                    "score": 1,
                    "created_utc": 1653508685.0,
                    "response": "They think that a better protocol is going to come along and replace it, just like how the rest of the world spent the 70's, 80's, and much of the 90's thinking \"internet is a decent proof of concept, but something better is going to replace it\". Google \"the protocol wars\".",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9z8mji",
                    "author": "uncontrollableop",
                    "score": 1,
                    "created_utc": 1653509205.0,
                    "response": "it's not all for sale first of all. and if they tried to do it all at once, or even over 5 years, it would drive the price to the point where they would stop buying. so it takes time.   \n\nor to look at it another way, they are doing exactly that.  \n\nor yet another, every single bitcoin in existence has already been purchased, whether from an exchange or trade or paid with hardware and mining.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9zeogk",
                    "author": "markb_uk",
                    "score": 1,
                    "created_utc": 1653511676.0,
                    "response": "Most people's 'wealth' is tied up in the house that they live in. You could live on what you scrounge from a food bank but be a millionaire, this is more common than you think in the major cities of the world. \n\nMost people would not risk lending against their house to buy BTC.\n\nMillionaire does not mean you have a million in cash just hanging around doing nothing.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9zfgth",
                    "author": "Boe_Ning",
                    "score": 1,
                    "created_utc": 1653512005.0,
                    "response": "Because not all 58 million millionaires share the same perspective on Bitcoin as you......................................................................................",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9zg9ah",
                    "author": "PumperNikel0",
                    "score": 1,
                    "created_utc": 1653512337.0,
                    "response": "They’re not into the “trend” yet. Soon, they will flock as quick as they did with exclusivity (Bored Apes) and realization.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9zi1g2",
                    "author": "ecclesiastes215",
                    "score": 1,
                    "created_utc": 1653513084.0,
                    "response": "Lots of people are millionaires, lots of people don't care about Bitcoin. \n\nAnd if you are comfortable with the amount of money you have it may not feel as urgent to get in on any particular scarce commodity.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9zjmb2",
                    "author": "mathaiser",
                    "score": 1,
                    "created_utc": 1653513763.0,
                    "response": "If you already “won the game” you probably don’t need a moon shot to get more money.  Probably you diversified into lower risk places to earn a reasonable rate of return on large amounts of capital to ensure your longevity.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9zpz36",
                            "author": "oboshoe",
                            "score": 1,
                            "created_utc": 1653516513.0,
                            "response": "Honestly.   becoming a millionaire is just a the minimum buy-in for the \"the game\"",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9zmu2a",
                    "author": "thunderousbloodyfart",
                    "score": 1,
                    "created_utc": 1653515147.0,
                    "response": "We are early.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9zn7of",
                    "author": "silverfire626",
                    "score": 1,
                    "created_utc": 1653515312.0,
                    "response": "Because they are looking at wealth preservation vs growth",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9zocng",
                    "author": "BigPlayCrypto",
                    "score": 1,
                    "created_utc": 1653515801.0,
                    "response": "I actually like that question 🙋🏾‍♂️",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9zptg7",
                    "author": "Independent-Algae-12",
                    "score": 1,
                    "created_utc": 1653516444.0,
                    "response": "Most people don’t “really” understand it. Some who do are afraid the government does not recognize it as a store of value and they could end up with a bag full of crap with government intervention. Folks start dumping bitcoin every time there’s news of a country trying to ban or regulate it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9zq5tm",
                    "author": "eamonbourke",
                    "score": 1,
                    "created_utc": 1653516598.0,
                    "response": "Bitcoin is now a Stable Coin.\nIt has held at $30,000 approx for the last month.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9zqcdt",
                    "author": "Zealousideal_Lab537",
                    "score": 1,
                    "created_utc": 1653516680.0,
                    "response": "When the printing press was invented, mass adoption didn't come straight away, there was a strong push back by the church which had a monopoly on book copy righting, which was done manually.\n\nThe same happened to email, governments had and still have huge investment in physical letters. Given enough time, more and more of those millionaires will jump in, being unable to accumulate one bitcoin each.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9zqo34",
                    "author": "FancyTeacupLore",
                    "score": 1,
                    "created_utc": 1653516828.0,
                    "response": "Vast majority of millionaires are older. The vast majority of bitcoin investors are Millennials, Gen Z, and younger Gen X. Boomers gonna boom, then that wealth is transferred to people who are actually going to use the system.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9zszh4",
                    "author": "No-Hovercraft9960",
                    "score": 1,
                    "created_utc": 1653517868.0,
                    "response": "They don't need it... for now",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9zud57",
                    "author": "laughncow",
                    "score": 1,
                    "created_utc": 1653518493.0,
                    "response": "Vast majority are old school also . Most don’t believe it is a technology breakthrough yet because they don’t understand it",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9zvssv",
                    "author": "Big_Party_4731",
                    "score": 1,
                    "created_utc": 1653519153.0,
                    "response": "How many of those 58 million millionaires are millionaires when you exclude the value of their primary house they live in?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9zvu95",
                    "author": "VVaId0",
                    "score": 1,
                    "created_utc": 1653519171.0,
                    "response": "They can't buy what isn't for sale.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9zxgcx",
                    "author": "anon1moos",
                    "score": 1,
                    "created_utc": 1653519923.0,
                    "response": "in NE USA and California being a millionaire means you own a house.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9zxv39",
                    "author": "K0rbenKen0bi",
                    "score": 1,
                    "created_utc": 1653520117.0,
                    "response": "Their financial advisor told them not to",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia000id",
                    "author": "CautiousBad6469",
                    "score": 1,
                    "created_utc": 1653521125.0,
                    "response": "Because they’d rather get .01 percent interest on their money in a bank.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia00q2g",
                    "author": "CatOfGrey",
                    "score": 1,
                    "created_utc": 1653521463.0,
                    "response": "The future of Bitcoin is assumed to be a 'currency'.  It is to be a stable valued thing. \n\nRight now, it's not.  It is a new product with an uncertain future price - nobody knows whether the future value is going to be \"5000 loaves of bread to the Bitcoin\" or \"10 million loaves of bread to the Bitcoin\". \n\nSince it is brand new, its price behaves like other risky assets - like a tech stock.  Putting material amounts of money in risky assets is not a good idea from a financial planning perspective.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia041f6",
                    "author": "bcyng",
                    "score": 1,
                    "created_utc": 1653523046.0,
                    "response": "Every bitcoin is owned by someone. They have bought (or mined) all of them. Are they all millionaires? No.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia04ar5",
                    "author": "babyshark75",
                    "score": 1,
                    "created_utc": 1653523171.0,
                    "response": "why are you confused? 58 millionaires got rich off of fiat, do you think they will get rich off of BTC? why would they changed if it worked for them?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia04gn2",
                    "author": "Foinatorol",
                    "score": 1,
                    "created_utc": 1653523248.0,
                    "response": "They’re millionaires; not geniuses!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia05aym",
                    "author": "HaikuHaiku",
                    "score": 1,
                    "created_utc": 1653523638.0,
                    "response": "Depends how you measure millionaire. A LOT of \"millionaires\" are only millionaires based on the value of their house, for example. A more honest definition of millionaire would be someone who has 1 million in investable and reasonably liquid assets.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia07of0",
                    "author": "satoshisfeverdream",
                    "score": 1,
                    "created_utc": 1653524756.0,
                    "response": "Cause they’ve been too busy to try and buy .5 each.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia08j0e",
                    "author": "TechieTravis",
                    "score": 1,
                    "created_utc": 1653525156.0,
                    "response": "People who are already rich and living comfortably do not think about crypto or care about it. Why would they invest their money in something so volatile with a small chance of gain when they can invest in things that are more dependable for them?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia0909q",
                    "author": "just_thisGuy",
                    "score": 1,
                    "created_utc": 1653525382.0,
                    "response": "There are plenty of people that own a house worth near a million (particularly now with home prices getting crazy), does that make them a millionaire? their actual income might be $100k per year, with kids and all that, they probably don’t have any real free money, and most 401k probably still don’t offer a good way to get into bitcoin. Many of those same people are really old and probably just got the DVD player working.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia1m4vi",
                            "author": "Funnel1Cvq",
                            "score": 3,
                            "created_utc": 1653556313.0,
                            "response": "Just it has already been working for a lot of people as of now as well,.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia094lf",
                    "author": "Iranoutofhotsauce",
                    "score": 1,
                    "created_utc": 1653525440.0,
                    "response": "Old",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia1gs9q",
                            "author": "wytslyts",
                            "score": 1,
                            "created_utc": 1653551496.0,
                            "response": "We told or new we have already had sent it has been working for a lot of people.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia09l7c",
                    "author": "hi_Joe_joe_mama",
                    "score": 1,
                    "created_utc": 1653525658.0,
                    "response": "Why they don't buy all gold or all silver also ?\nYou see there is multiple way to invest you money and most millionaires have multiple investment here and there you don't pit all your eggs in one basket",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia0a4bo",
                    "author": "Daikataro",
                    "score": 1,
                    "created_utc": 1653525908.0,
                    "response": "Half of them don't even know BTC exists.\n\nMore than two thirds of the ones that do, think it's \"magical internet money\" and will never invest.\n\nThe others are actively playing the game.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia1orh3",
                            "author": "InfinityBucks",
                            "score": 1,
                            "created_utc": 1653558632.0,
                            "response": "I don't really understand it how they are going to invest with this kind of privacy.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia0a8yh",
                    "author": "Aggravating_Line9021",
                    "score": 1,
                    "created_utc": 1653525969.0,
                    "response": "Rich people invest less as most of them are better financially literate and understand there is no underlying value with BTC…..",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia0adxu",
                    "author": "Hefty-Interview4460",
                    "score": 1,
                    "created_utc": 1653526034.0,
                    "response": "Because you dont become millionaires by random all ining on speculative casino chips...",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia0b6w5",
                    "author": "sean488",
                    "score": 1,
                    "created_utc": 1653526411.0,
                    "response": "Because if you are smart you don't invest everything in one item.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia1j246",
                            "author": "tzli1988",
                            "score": 1,
                            "created_utc": 1653553535.0,
                            "response": "No doubt about the fact that we need a little bit of mind working as well.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia0ct9c",
                    "author": "BeefFeast",
                    "score": 1,
                    "created_utc": 1653527153.0,
                    "response": "Lmao bc millionaires are house rich not liquid rich… the Uber wealthy(the ones with liquid cash) could give 2 shits about BTC or it’s hedge bc they have enough for multiple lifetimes already. I talked to a gentleman who runs a $300M investment firm in December, he laughed when I asked if he’d ever use BTC as an investment, then proceeded to shit on it and it’s inability to actually be the backbone for a multi trillion dollar economy. (Can’t expand and contract as needed, inequality never before seen, energy consumption for that scale)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia0el1c",
                    "author": "Filmerd",
                    "score": 1,
                    "created_utc": 1653527970.0,
                    "response": "There's a question of how fast their current store of value will debase. And how fast they will migrate into alternative assets.\n\nWe might be at 8% inflation, but people who profited off the fiat system are in no hurry to move out of a system that benefits them. BTC is a total bottom up scenario.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia0ep33",
                    "author": "LonghaulTrader",
                    "score": 1,
                    "created_utc": 1653528020.0,
                    "response": "A millionaire is someone with a Net Worth if $1 million +. A lot of the millionaires don’t actually have a ton of money to spend, and they don’t want to spend it on speculative plays. A majority of the millionaires have their net worth in equity in their house and retirement funds.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia0fso0",
                    "author": "ReedoIncognito",
                    "score": 1,
                    "created_utc": 1653528513.0,
                    "response": "25-year rule is in play here. It's a blessing, not a curse if you understand the asset",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia21goz",
                            "author": "wsop168",
                            "score": 1,
                            "created_utc": 1653567523.0,
                            "response": "I got into the need to understand that how acids are going to work lol.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia0gk4u",
                    "author": "OdoIcontradictmyself",
                    "score": 1,
                    "created_utc": 1653528867.0,
                    "response": "Which is more true:\n\nHere to find out if the moon is really made of cheese\n\nHere because I am withdrawing my consent from a corrupt and bloated financial system \n\nHere because I deeply understand Bitcoin and believe in the technology as the base layer of our future",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia0h19w",
                    "author": "VPNApe",
                    "score": 1,
                    "created_utc": 1653529086.0,
                    "response": "Am a millionaire and have invested some in Bitcoin. I would like to invest more but my stocks are down and I'm probably gonna be stuck holding for years\n\nI do have cash set aside but I'm only willing to buy a little at these levels. Give me 20k btc and I'll gladly buy several whole coins.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia0h4bv",
                    "author": "someGuyJeez",
                    "score": 1,
                    "created_utc": 1653529125.0,
                    "response": "How many of those millionaires own bitcoin? Probably quite a few",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia19kip",
                            "author": "schotts66",
                            "score": 1,
                            "created_utc": 1653545505.0,
                            "response": "Probability is very low but we had already sent it has worked for a lot of people.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia0iuf0",
                    "author": "onetwobingo",
                    "score": 1,
                    "created_utc": 1653529929.0,
                    "response": "Old habits die hard",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia1hfzo",
                            "author": "SupaBTCeisGay",
                            "score": 3,
                            "created_utc": 1653552083.0,
                            "response": "No doubt about it because you had will have to follow that.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia1wmh8",
                                    "author": "onetwobingo",
                                    "score": 1,
                                    "created_utc": 1653564564.0,
                                    "response": "Eventually they ll jump on board … Bitcoin is here to stay… is part of the network … same as your house and your life …",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia0pcpn",
                    "author": "KevinsOnTilt",
                    "score": 1,
                    "created_utc": 1653532988.0,
                    "response": "If you’ve retired you may care less about “future tech”. They are living the life they want.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia1o990",
                            "author": "2269683",
                            "score": 1,
                            "created_utc": 1653558187.0,
                            "response": "Your lady want a lot of stuff out of it and I don't really know how they are going to get it.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia0r2jh",
                    "author": "nickvicious",
                    "score": 1,
                    "created_utc": 1653533813.0,
                    "response": "If you're already a millionaire, would you really care about chasing the next golden egg? Probably not, you're probably already living comfy off your current investments and sources of revenue. Although I am sure this will start to change over time.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia0rm7m",
                    "author": "holyknight00",
                    "score": 1,
                    "created_utc": 1653534084.0,
                    "response": "if you have really a lot of money you transition from investing to wealth management. Not the same thing.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia0sbv1",
                    "author": "MiamiHeatAllDay",
                    "score": 1,
                    "created_utc": 1653534441.0,
                    "response": "Many millionaires are in slow growth low risk mode and are satisfied maintaining their wealth.\n\nThose who are struggling are much more risk tolerant and pursue volatility",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia0sddq",
                    "author": "Surething_bud",
                    "score": 1,
                    "created_utc": 1653534463.0,
                    "response": "You're a little confused about how asset prices work. There will always be people selling Bitcoin. If there are no sellers at a given price, then the price will increase until there are people who decide to sell. \n\nAnd on the flip side there will always be people buying it as well... if there are no buyers at a given price, then the price will decrease until there are people who decide to buy.\n\nThis will rinse/repeat forever. There will always be Bitcoin in circulation. It will never be \"gone\". The price is what changes.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia1lvpm",
                            "author": "tunahantek",
                            "score": 1,
                            "created_utc": 1653556085.0,
                            "response": "Just the prices are definitely increasing but it is not going to make any change.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia1z7rh",
                                    "author": "Surething_bud",
                                    "score": 1,
                                    "created_utc": 1653566193.0,
                                    "response": "I'm not sure what you mean by change? Like wealth distribution? Bitcoin can't solve that problem. No currency or asset can.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia0stjt",
                    "author": "dig_bick_super_man",
                    "score": 1,
                    "created_utc": 1653534691.0,
                    "response": "Hence why it’s still new, and we’re still early. It was only 2 years ago when most people knew a total of dog shit about bitcoin, and 90% of shit coins didn’t exist.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia1mzil",
                            "author": "cottenself",
                            "score": 1,
                            "created_utc": 1653557070.0,
                            "response": "No doubt about the fact that this is the reason why they are not trying this.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia0t936",
                    "author": "LooperGamer",
                    "score": 1,
                    "created_utc": 1653534914.0,
                    "response": "Why buy something that’s gone down 50% when fiats only gone -9%",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia1nx5t",
                            "author": "chuvstvin",
                            "score": 1,
                            "created_utc": 1653557893.0,
                            "response": "Is definitely going to be more than 50% if it got started like that.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia0tcn2",
                    "author": "amerricka369",
                    "score": 1,
                    "created_utc": 1653534967.0,
                    "response": "many millionaires have a good portion of their wealth in non liquid assets (real estate, 401k, private companies etc). Another good portion are older and not interested in the level of risk (uncertainty) associated with it (while also probably not understanding it).  Another big portion are managed by wealth advisors who have not been interested in putting client money into it due to custodial and risk and tax issues.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia1nlgo",
                            "author": "magnat007",
                            "score": 1,
                            "created_utc": 1653557613.0,
                            "response": "The most type of issues are what we are expecting I want to be private companies only.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia0tiu8",
                    "author": "jwvanhouten",
                    "score": 1,
                    "created_utc": 1653535056.0,
                    "response": "Because they’re entrenched in a legacy system. They don’t realize it yet.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia1zoly",
                            "author": "zozulya3",
                            "score": 1,
                            "created_utc": 1653566479.0,
                            "response": "Any particular reason that how they are going to realise it and start Legacy system.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia0u9n4",
                    "author": "Scaramoosh1",
                    "score": 1,
                    "created_utc": 1653535447.0,
                    "response": "If we’re including every shmoe in a million dollar house with no other assets, they’re probably cash poor. That might slice off a sizable portion.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia1g1a7",
                            "author": "hea8y",
                            "score": 1,
                            "created_utc": 1653550834.0,
                            "response": "Proportion is what we had seen that it had constantly been increased.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia0vbf1",
                    "author": "neekoriss",
                    "score": 1,
                    "created_utc": 1653536022.0,
                    "response": "most millionaires are average retirees whose net worth is tied up in home equity and 401ks",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia0vd5v",
                    "author": "Johndrc",
                    "score": 1,
                    "created_utc": 1653536048.0,
                    "response": "They become rich in past system. Why will they give their prosper to newcomer..\n\nBitcoin is your weapon against imbalance of society, all you have to do is educate yourself.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia0wsgt",
                    "author": "PeacefullyFighting",
                    "score": 1,
                    "created_utc": 1653536861.0,
                    "response": "Do you have a Roth IRA 401k account? Or do you have any other investment assets? If yes then I say, why is all of it not I'm Bitcoin? \n\nIt's an asset class most see as having a huge risk but also the potential to have Huge gains. I don't know if your new to crypto but I would recommend not putting everything into it. \n\nI made a long reply to someone talking about the need to max out your 401k employer match before even considering investing in crypto",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia0xtts",
                    "author": "blopblipbloup",
                    "score": 1,
                    "created_utc": 1653537472.0,
                    "response": "Still early",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia0ylbs",
                    "author": "M13Calvin",
                    "score": 1,
                    "created_utc": 1653537923.0,
                    "response": "This is like asking why all the (gold, Amazon stock, real estate... whatever...) isn't bought by millionaires. It's virtually impossible for anyone to buy *all* of everything. It seems like you misunderstand how markets work. If you try to buy buy buy, the price will go up. So just some exposure is the name of the game. And add to your position slowly as the price becomes favorable.\n\nLike, if some group of rich people wanted to buy ALL the BTC tomorrow, think what that would entail... first they'd buy some, and the price would go up, then buying the rest would get more and more expensive. It's not like BTC is just \"for sale\" at the market price. There are sellers who will sell now at 29-30k, but once you buy from all of them, the next sellers want 35k, then 40k, etc.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia11h8w",
                    "author": "jiye_jiye",
                    "score": 1,
                    "created_utc": 1653539730.0,
                    "response": "maybe they did and it crashed 50% and they’re no longer millionaires",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia13jfr",
                    "author": "Hot-Canceld",
                    "score": 1,
                    "created_utc": 1653541100.0,
                    "response": "they don't get it",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia14nb3",
                    "author": "OppressorOppressed",
                    "score": 1,
                    "created_utc": 1653541867.0,
                    "response": "Not enough btc for all of them to have 1",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia17izt",
                    "author": "DeepExtrovert",
                    "score": 1,
                    "created_utc": 1653543934.0,
                    "response": "Because they probably wouldn't still be millionaires had they bought it, which is why they are millionaires to begin with.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia19a2m",
                    "author": "OldMercenary",
                    "score": 1,
                    "created_utc": 1653545276.0,
                    "response": "Millionaires don't just have cash sitting in a bank to gamble on emerging markets, they're wealth is in assets mostly and they haven't made their millions in this industry, so they will stick to what they know.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia1ct0w",
                    "author": "RevolutionaryStrider",
                    "score": 1,
                    "created_utc": 1653548090.0,
                    "response": "A Rich Gambler could afford to buy all the lottery tickets and does so. Such a person is an idiot.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia1f1hk",
                    "author": "zfride",
                    "score": 1,
                    "created_utc": 1653549954.0,
                    "response": "because money does not make you smart, it only make you look smart.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia1g3wp",
                    "author": "ThePronto8",
                    "score": 1,
                    "created_utc": 1653550897.0,
                    "response": "Why havent they all bought Apple shares? Why havent they all bought Gold? Some people just don’t worry about these sort of investments.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia1g3xb",
                    "author": "coupleofquid",
                    "score": 1,
                    "created_utc": 1653550897.0,
                    "response": "They’re probably happy with the system that’s made them millionaires",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia1glo5",
                    "author": "Misterman098",
                    "score": 1,
                    "created_utc": 1653551338.0,
                    "response": "Because they obviously have ways to make real money.  Why risk it on what is still mostly speculation?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia1iyui",
                    "author": "calculateHash",
                    "score": 1,
                    "created_utc": 1653553451.0,
                    "response": "Because most people still don't believe in Bitcoin. Some of them actually hate the idea and I would assume that will continue to be the case for many years.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia1jo33",
                    "author": "MrQ01",
                    "score": 1,
                    "created_utc": 1653554086.0,
                    "response": "Same reason why Elon Musk bought in at $30k price instead of $100 price.\n\nSame reason El Salvador first bought in at $50k instead of $100.\n\nSame reason Lily Allen didn't accept 200,000 BTC in 2009.\n\nSame reason Michael Saylor was bearish until 2012 and then flipped completely in 2020.\n\nSame reason most of us probably didn't buy in at $100 in 2013. A person could have been in the top 1% global bitcoin holders.... for $28. Imagine how much Bitcoin would be now if instead of being childish, market analysts at the time said \"I reckon that by 2022, Bitcoin price should be at least 10x.... to $1000 per coin\" - everybody would have piled in.\n\n&#x200B;\n\nShort answer - people undervalue Bitcoin, and will continue to be undervalue it.... until they don't.\n\nSo our job is to be ahead of the millionaires and not followers - and dollar cost average on this cheap Bitcoin.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia1ls7c",
                    "author": "Girryarty",
                    "score": 1,
                    "created_utc": 1653555995.0,
                    "response": "There are millionaires who invest their usdt in bitcoin, but there are few of them because investing large funds requires a detailed study of the crypto market. And not everyone is willing to take risks",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia1ltff",
                    "author": "adm928",
                    "score": 1,
                    "created_utc": 1653556026.0,
                    "response": "Because they might not be interested, have you considered that scenario?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia1macg",
                    "author": "HappyEstablishment90",
                    "score": 1,
                    "created_utc": 1653556449.0,
                    "response": "I love Bitcoin but millionaires in what currency",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia1met6",
                    "author": "NYKNYb",
                    "score": 1,
                    "created_utc": 1653556561.0,
                    "response": "Because they're fucking boomers that's why.\n\nGood thing is the actual wealth is transferring from them to satoshi millionaires.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia1ogyr",
                    "author": "BlazingJava",
                    "score": 1,
                    "created_utc": 1653558376.0,
                    "response": "Most millionares have their fortunes in stocks business real estate etc.\n\nThey would have to reallocate their wealth to btc.\n\nLike shark tank Kevin O'Leary he uses percentages, like with TSLA stock he exposed 5% of his wealth to it, when TSLA too off to new ATH he kept selling it to keep it representing 5% of it's exposure",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia1olu0",
                    "author": "useemrlymad",
                    "score": 1,
                    "created_utc": 1653558496.0,
                    "response": "because they wanna keep their money",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia1q7sd",
                    "author": "Hows-your-bollocks",
                    "score": 1,
                    "created_utc": 1653559852.0,
                    "response": "People mostly buy bitcoin to one day convert back to dollars to buy things. You can’t buy anything with bitcoin.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia1qq73",
                    "author": "Negotiation_Only_",
                    "score": 1,
                    "created_utc": 1653560281.0,
                    "response": "Because they don’t need it and they don’t care. Their money long and generational. \n\nIt seems like Bitcoin is a new generation sort of thing.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia1qrad",
                    "author": "Eww_vegans",
                    "score": 1,
                    "created_utc": 1653560306.0,
                    "response": "Coz they live in places where you need to be a millionaire just to get by. Just coz your little house is worth a million bucks doesn't mean you have spare cash.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia1th9y",
                    "author": "Apprehensive_Panda_1",
                    "score": 1,
                    "created_utc": 1653562393.0,
                    "response": "Do they all HAVE a million dollars maybe some are “worth” a million dollars and would have to sell all their shit to HAVE a million dollars",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia1twa4",
                    "author": "Nice_Warthog",
                    "score": 1,
                    "created_utc": 1653562698.0,
                    "response": "I can make DogMoonInu coin and it can be scarce. Scarcity doesn’t directly imply value",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia1vdhr",
                    "author": "BTCstack3r",
                    "score": 1,
                    "created_utc": 1653563733.0,
                    "response": "Look at Warren Buffett for example. They didnt do their homework. \n\nBesides that many of those millionaires simply dont NEED bitcoin. They have succesfull businesses, they own houses, yachts, paintings, stocks, gold, land, wines.\n\nEven the world burns down, they likely survive anyway. People like in El Salvador need bitcoin and can't buy any of this stuff.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia1x8qt",
                    "author": "1entreprenewer",
                    "score": 1,
                    "created_utc": 1653564962.0,
                    "response": "Most millionaires don’t have that much in liquid assets. Real estate, businesses… it’s not like they can just liquidate and buy Bitcoin. Also Bitcoin is considered risky. Most won’t put even 10% of Nw into it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia1y2n2",
                    "author": "qt512",
                    "score": 1,
                    "created_utc": 1653565482.0,
                    "response": "because most \"millionaires\" live paycheck to paycheck. a quarter of the ppl in the US who own a home they bought 20-40 years ago or inherited are \"millionaires\"",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia20og6",
                    "author": "starshiporion22",
                    "score": 1,
                    "created_utc": 1653567072.0,
                    "response": "There’s loads of stuff millionaires can buy, not all of them are into crypto. If you made your millions in real estate why would you adopt something else. They just buy more real estate. Also having a million bucks isn’t all that anymore. Most houses in decent areas cost 1 million. 30 years ago if you had 1 million you were rich, especially with houses costing a few 100k, property tax was low, health insurance, food, energy bills. 1 million would go a long way.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia23y8q",
                    "author": "fotvan",
                    "score": 1,
                    "created_utc": 1653568873.0,
                    "response": "What makes you think they should be interested in this? They may simply not consider Bitcoin a worthy asset to invest in.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ype1o",
                    "author": "WritingFun8769",
                    "score": -1,
                    "created_utc": 1653501552.0,
                    "response": "bitcoin doesn’t allow for capital accumulation like other forms of investment. those elites want to grow their wealth to exorbitant amounts out of greed, and bitcoin doesn’t allow for that.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9yr2dp",
                    "author": "LeonardSmallsJr",
                    "score": -1,
                    "created_utc": 1653502209.0,
                    "response": "My kidney stones are also scarce. Where’s the line of millionaire buyers? There’s a lot more to Bitcoin than just scarcity and a lot of people either don’t understand the benefit or are okay with something else. It’s okay to me as I have a slow monkey child’s understanding and am building on that.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ytvcg",
                            "author": "Any-Explanation-6877",
                            "score": 2,
                            "created_utc": 1653503310.0,
                            "response": "Pretty sure bitcoin is more scarce than kidney stones lol",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "uxm9s2",
            "title": "JPMorgan backs bitcoin to rise 28% and says cryptocurrencies are now its preferred alternative asset",
            "url": "https://markets.businessinsider.com/news/currencies/bitcoin-outlook-jpmorgan-cryptocurrencies-alternative-assets-2022-5",
            "author": "CoHemperor",
            "created_utc": 1653499190.0,
            "score": 513,
            "num_comments": 133,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9z552n",
                    "author": "ruck_my_life",
                    "score": 76,
                    "created_utc": 1653507811.0,
                    "response": "I don't care if he's seen the light. Jamie Dimon can still slurp my whole ass.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia00ltk",
                            "author": "Farrellfernandez",
                            "score": 26,
                            "created_utc": 1653521408.0,
                            "response": "Jamie Dimon is a POS",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia1vf2z",
                                    "author": "_Time_Traveler__",
                                    "score": 4,
                                    "created_utc": 1653563764.0,
                                    "response": "Jamie Dimon is a SOB",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia4xpim",
                                            "author": "j64462388",
                                            "score": 1,
                                            "created_utc": 1653612808.0,
                                            "response": "That's what I was gonna say and thank you for that shit.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "ia4avu7",
                                    "author": "nodedude7",
                                    "score": 1,
                                    "created_utc": 1653601971.0,
                                    "response": "Proof of Shithead",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "ia4b9us",
                                    "author": "OrlovZ",
                                    "score": 1,
                                    "created_utc": 1653602138.0,
                                    "response": "What's POS? Can you explain me a bit about that please?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "ia04ft3",
                            "author": "TextileWasp",
                            "score": 15,
                            "created_utc": 1653523237.0,
                            "response": "Take a number. Literally millions of people are in line for this jackass to slurp their asses.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia0i8gw",
                                    "author": "horsecyack",
                                    "score": 6,
                                    "created_utc": 1653529641.0,
                                    "response": "Horsey is here 🐴",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia1dct2",
                                            "author": "Walmart_Warrior_420",
                                            "score": 3,
                                            "created_utc": 1653548538.0,
                                            "response": "thank you for your service    ( ͡° ͜ʖ ͡°)",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia5dfyc",
                                                    "author": "foxxzee",
                                                    "score": 1,
                                                    "created_utc": 1653620546.0,
                                                    "response": "Man is giving a good service for a fucking long time lol.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "ia46qdz",
                                            "author": "wsop168",
                                            "score": 1,
                                            "created_utc": 1653600139.0,
                                            "response": "The best thing is here and we all have to admit that shit XD",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "ia3obke",
                                    "author": "gi4no88",
                                    "score": 1,
                                    "created_utc": 1653592368.0,
                                    "response": "Give me a number too and I want that shit before anyone lol.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "ia1p4ib",
                            "author": "Heph333",
                            "score": 3,
                            "created_utc": 1653558952.0,
                            "response": "He hasn't seen the light. He's the same POS using the news to get rich. What does that tell you?... He's trying to get the herd to buy now. Why? I have no fuckin idea. Either they want to dump their holdings or they're done accumulating.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "ia235e8",
                            "author": "Dazzling_Marzipan474",
                            "score": 3,
                            "created_utc": 1653568450.0,
                            "response": "How on earth is he not in jail? 😩",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "ia19eoz",
                            "author": "__cnav__",
                            "score": 2,
                            "created_utc": 1653545378.0,
                            "response": "That sounds like a good time",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "ia0kmkf",
                            "author": "winkersRaccoon",
                            "score": 1,
                            "created_utc": 1653530762.0,
                            "response": "Why exactly? I saw him in that WeWork show and they made him out to be chill. What’s the real story?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia0xmb3",
                                    "author": "bitcoin_islander",
                                    "score": 8,
                                    "created_utc": 1653537347.0,
                                    "response": "In the fall of 2017 Jamie Dimon said he will FIRE anyone at his company who even thinks of buying bitcoin",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia122a1",
                                            "author": "winkersRaccoon",
                                            "score": 2,
                                            "created_utc": 1653540107.0,
                                            "response": "Investment policy? I mean I know saying that in this sub is a crime, but it’s not in real life.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9ypj58",
                    "author": "coinfeeds-bot",
                    "score": 27,
                    "created_utc": 1653501608.0,
                    "response": "tldr; The investment bank now thinks bitcoin and digital assets should rebound after the great sell-off of 2021 and 2022.\n\n*This summary is auto generated by a bot and not meant to replace reading the original article. As always, DYOR.*",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia1ga3h",
                            "author": "Phil_Drill",
                            "score": 3,
                            "created_utc": 1653551050.0,
                            "response": "Rebound to… less than $40k? Woweeeee",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9yoewx",
                    "author": "mrmiya",
                    "score": 55,
                    "created_utc": 1653501167.0,
                    "response": "BTC>real estate",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9yr1ro",
                            "author": "thefullmcnulty",
                            "score": 61,
                            "created_utc": 1653502203.0,
                            "response": "Imagine going through all of the hassle of buying a townhouse - paying realtor fees and TX fees, renting the units out, paying insurance premiums and property and rental revenue taxes, fixing and maintaining the property as needed, keeping tenants happy, dealing with the city / county and neighbors…. \n\nOr, taking that capital, buying bitcoin and holding the asset for free forever in an immaterial, 100% secure, cryptographic vault. And while you hodl your sats a global network of the world’s most talented developers, entrepreneurs, investors, and enthusiasts build and expand the capabilities of the global network 24/7/365. \n\nBitcoin is the best money / monetary network / SoV ever created and it’s not even close.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9yziru",
                                    "author": "JerryLeeDog",
                                    "score": 48,
                                    "created_utc": 1653505539.0,
                                    "response": "In theory it sounds great. As a landlord and BTC advocate, I'll tell you that real estate can make you a ton of very safe and predictable money, unlike BTC. Sure BTC will \"likely\" be the future but we have no clue what's in store, and anyone who bets on it with all they got is absolutely taking a risk. \n\nTaxes and costs for rental properties aren't shit compared to equity and profits when you rent houses in a good area. And it's completely hands off with a good property manager. \n\nI own 2 units in MD and live in California. Don't do anything but recieve payments every month and watch my equity grow. This is why real estate is king right now and very expensive to own",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia0x5x5",
                                            "author": "maxcoiner",
                                            "score": 14,
                                            "created_utc": 1653537075.0,
                                            "response": "I've seen people do something similar in LA and got absolutely ruined by frivolous lawsuits. Even with a property manager keeping everything in great shape, risk is always present in real estate. Hell, a fire, riot, tornado, meteor, etc, could literally wipe out your property &/or income at any time. \n\nWith bitcoin there really is only one risk: \"Will the price continue to go up in the future.\" If you believe the supply is limited and the adoption will continue, then the answer is always yes. No external events nor unhappy tenants will be able to change that.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia11x71",
                                                    "author": "bitcoin_islander",
                                                    "score": 3,
                                                    "created_utc": 1653540019.0,
                                                    "response": "Perfectly said",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9z2qyx",
                                            "author": "thefullmcnulty",
                                            "score": 14,
                                            "created_utc": 1653506844.0,
                                            "response": "The rental hustle can be optimized but those costs are still present and you did have to put in the work to setup your situation. \n\nHousing has been monetized far beyond its cost of production because it’s been the best SoV option for those who need to park cash. \n\nHistorically low interest rates have contributed to the feeding frenzy / bidding wars driving up real estate prices as well. \n\nI do not think it’s sustainable long-term (or even medium-term) and risk of a real estate price collapse is certainly lurking. \n\nBitcoin has a lot of attractive features as a SoV that real estate doesn’t. Real estate has features that bitcoin doesn’t too. I’m not suggesting one will replace the other but if I had a million dollars to invest I personally would invest half in bitcoin and half in a rental property. Just three years ago I had no understanding of bitcoin. \n\nI also feel that real estate is over priced and bitcoin is severely under priced. I can’t buy $500 worth of real estate on my phone either.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia0nidp",
                                                    "author": "olliec420",
                                                    "score": 6,
                                                    "created_utc": 1653532124.0,
                                                    "response": "> I do not think it’s sustainable long-term (or even medium-term) and risk of a real estate price collapse is certainly lurking.\n\nAnd not to mention, we saw that the government can say people don't have to pay their landlords when a \"crisis\" happens which could leave smaller leveraged landlords fucked.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "ia0nugb",
                                                            "author": "thefullmcnulty",
                                                            "score": 3,
                                                            "created_utc": 1653532286.0,
                                                            "response": "Great point. The protocol for property is variable and those uncertainties do not seem priced in.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i9z65vu",
                                                    "author": "JerryLeeDog",
                                                    "score": 3,
                                                    "created_utc": 1653508217.0,
                                                    "response": "There's a reason real estate is hard to buy. It's extremely sought after. Anyone who has the ability to own real-estate would be crazy to pass it up imo. \n\nI could take thousands in passive income and buy BTC with it while my houses also get paid off for free if I wanted to. \n\nYes, I painted, got sealed 10 yr smoke alarms and then got a property manager. That was the extend of the work in my case. Made my money back in ~60 days.\n\nEdit: I should add that I already owned this particular house before making it a rental. I got a job offer in and moved out of state.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9z6yjo",
                                                            "author": "thefullmcnulty",
                                                            "score": 11,
                                                            "created_utc": 1653508538.0,
                                                            "response": "Real estate is hard to buy and sell - one of its main weaknesses. It’s hard to buy and sell because of the illiquid nature of the asset and all of the regulations and institutions needed to just transfer the property and money between buyers and sellers.\n\nI’ve been involved with my families multiple rental properties for decades. They are a lot of work over time. You’re totally minimizing these realties to suit your position. \n\nPassive income is nice of course but it’s especially risky to get involved now with real estate being at the horizon of a historic bubble.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9zt9ul",
                                                                    "author": "gorilla--",
                                                                    "score": 3,
                                                                    "created_utc": 1653517998.0,
                                                                    "response": "Yup",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                },
                                                                {
                                                                    "id": "i9z84c8",
                                                                    "author": "JerryLeeDog",
                                                                    "score": 2,
                                                                    "created_utc": 1653509001.0,
                                                                    "response": "I'm praying for a crash so my property taxes go down honestly. I'd never sell a house that is paying for itself, and paying me passively. \n\nSure, there are things you need to do that constitute \"work\" but I don't need to suit my position; There is a reason houses are being gobbled up like never before by very wealthy people, investors and institutions who want to rent just like me and make hands-off money. Or else normal families could go out and actually buy rn. But they can't because of demand. \n\nMarket dictates demand and prices. As rentals I already own and rent, I don't care about selling prices because it'll never be for sale. \n\nI'd like to have this diversification in addition to the BTC I buy every single day!",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9zedx8",
                                                                            "author": "thefullmcnulty",
                                                                            "score": 2,
                                                                            "created_utc": 1653511554.0,
                                                                            "response": "I mostly agree with you. Passive income is worth the work of owning / operating a rental. Selling is generally the wrong move too. But the monetary leaks associated with RE and the work required to run the operation(s) really add up over time. This is coming from someone who grew up working on rentals - a 16 unit apartment complex, 3 single family homes and a 3000 square foot retail building. Owned by my grandma and my parents. \n\nI am very partial to bitcoin because it requires none of the thousands of hours of work that I saw go into and helped put into those places over the last 3 decades. Not to mention all of the admin and the capital expended on taking care of the properties. 30 years is a while and things do go wrong. It’s not all peaches and cream. \n\nI’m 50/50 on bitcoin and real estate as my hard assets and I’m a hard asset guy. They complement each other is some ways. But bitcoin has entered the chat.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i9zhn9l",
                                                                                    "author": "JerryLeeDog",
                                                                                    "score": 3,
                                                                                    "created_utc": 1653512916.0,
                                                                                    "response": "Real estate and BTC is a great 1-2 combo. I'm excited for the future 🙌",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i9zj4qc",
                                                                                            "author": "thefullmcnulty",
                                                                                            "score": 3,
                                                                                            "created_utc": 1653513556.0,
                                                                                            "response": "Likewise. I’m in awe of how bitcoin is being built globally, with no coordination, through a positive incentive structure. Watching a global money / network go from zero to a reliable neutral standard is a rare opportunity. Be well!",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "id": "ia0yovn",
                                                                    "author": "bitcoin_islander",
                                                                    "score": 1,
                                                                    "created_utc": 1653537982.0,
                                                                    "response": "Just sold both my condos. No more being a landlord for me, only bitcoin.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9z9p0b",
                                            "author": "SadIdiot219",
                                            "score": 3,
                                            "created_utc": 1653509643.0,
                                            "response": "Are you willing to share the property manager you are using? I am thinking of buying an income property.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9za1ad",
                                                    "author": "JerryLeeDog",
                                                    "score": 4,
                                                    "created_utc": 1653509783.0,
                                                    "response": "If you are near Annapolis MD; Provision Property Management is the BEST. \n\nI started out with a terrible manager so now I pay a little more but sleep great",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9zd9x5",
                                                            "author": "SadIdiot219",
                                                            "score": 3,
                                                            "created_utc": 1653511096.0,
                                                            "response": "Thanks!",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "ia0532m",
                                            "author": "SorryMusician6165",
                                            "score": 3,
                                            "created_utc": 1653523535.0,
                                            "response": "You take a gamble with real estate too. If the government collapses then your real estate may no longer be yours.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia0yzue",
                                                    "author": "bitcoin_islander",
                                                    "score": 4,
                                                    "created_utc": 1653538168.0,
                                                    "response": "Yeah like the recently \"liberated\" London properties of Russian billionaires. \n\nCant liberate me of my bitcoin tho.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9zw08m",
                                            "author": "Lurked_Emerging",
                                            "score": 5,
                                            "created_utc": 1653519249.0,
                                            "response": "Rentals aren't good long term imo. Property value is speculated such that if any debt is on your property you will lose it if/when bitcoin absorbs the speculative value out of properties reducing it to it's utilitarian value.\n\nThis speculation is all that keeps rent worthwhile, if utilitarian value was all that controlled property value then renters would be able to buy property.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i9z1qkf",
                                            "author": "ccoolsat",
                                            "score": 3,
                                            "created_utc": 1653506433.0,
                                            "response": "Someone talking sense. Rarity in this echo chamber",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "ia1c4w6",
                                            "author": "chance_waters",
                                            "score": 1,
                                            "created_utc": 1653547539.0,
                                            "response": "And the rent for profit and buy with leverage destroys society completely and widens the wealth gap in a tangible way that effects necessities.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia2vxi4",
                                                    "author": "JerryLeeDog",
                                                    "score": 1,
                                                    "created_utc": 1653581000.0,
                                                    "response": "I'd never use leverage and I lived in the duplex for years after I bought it. I actually saved it as our family house, or else my grandmother would have had to sell it off. \n\nI only got to rent it becuase I got a job off in San Diego and moved across the country. Was a no brainer",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "ia0xxs8",
                                    "author": "bitcoin_islander",
                                    "score": 4,
                                    "created_utc": 1653537536.0,
                                    "response": "This ^\n\n99% of the world hasnt realized yet that their mansions, lofts, and townhouses are illiquid, prone to fires and damage, take time and hassle to keep up. Once they realize and start flipping their real estate for bitcoin it will be a crazy rocket straight up to $1m.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia0z9xa",
                                            "author": "thefullmcnulty",
                                            "score": 1,
                                            "created_utc": 1653538341.0,
                                            "response": "[I think a lot of signs point to real estate being in dangerous territory](https://old.reddit.com/r/wallstreetbets/comments/uwuplq/what_do_you_mean_you_have_seen_it_before_its/)",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia139k4",
                                                    "author": "bitcoin_islander",
                                                    "score": 1,
                                                    "created_utc": 1653540912.0,
                                                    "response": "Lol yeah I saw that post. What a bunch of clowns.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "ia19zuz",
                                                            "author": "thefullmcnulty",
                                                            "score": 1,
                                                            "created_utc": 1653545839.0,
                                                            "response": "Unreal",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i9yuxg0",
                                    "author": "BitcoinFan7",
                                    "score": 2,
                                    "created_utc": 1653503725.0,
                                    "response": "And still destroy your real estate returns by 100x minimum over the life of your mortgage.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9z2v02",
                                            "author": "thefullmcnulty",
                                            "score": 2,
                                            "created_utc": 1653506890.0,
                                            "response": "CAGR is king.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i9zjftc",
                                            "author": "BuiltToSpinback",
                                            "score": 2,
                                            "created_utc": 1653513686.0,
                                            "response": "Can you expand on this? Forgive my ignorance",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9zr0z9",
                                                    "author": "BitcoinFan7",
                                                    "score": 4,
                                                    "created_utc": 1653516988.0,
                                                    "response": "Real estate over the life of the mortgage could reasonably be expected to 2x-5x or so over a 30 year mortgage.  Bitcoin due to scarcity and the endless government fiat printing should very conservatively be expected to do 10x-20x that.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i9zyvrl",
                                    "author": "Farrellfernandez",
                                    "score": 2,
                                    "created_utc": 1653520599.0,
                                    "response": "Great Comment 👍",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "ia0ydu0",
                                    "author": "digihippie",
                                    "score": 1,
                                    "created_utc": 1653537800.0,
                                    "response": "Protocol, Bitcoin is protocol.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "ia0ie68",
                                    "author": "horsecyack",
                                    "score": 0,
                                    "created_utc": 1653529718.0,
                                    "response": "So romanticized here",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia0lfjn",
                                            "author": "thefullmcnulty",
                                            "score": 0,
                                            "created_utc": 1653531143.0,
                                            "response": "Yeah in reality buying real estate is actually a lot more difficult and tedious and expensive than I’m leading on. Next time I’ll be more thorough in explaining all of the layers of friction involved in investment properties.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia0lki0",
                                                    "author": "horsecyack",
                                                    "score": -1,
                                                    "created_utc": 1653531208.0,
                                                    "response": "I just bought one it was super easy",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "ia0lp3v",
                                                            "author": "thefullmcnulty",
                                                            "score": 0,
                                                            "created_utc": 1653531268.0,
                                                            "response": "🥱",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9yknpl",
                    "author": "EnergySilly3061",
                    "score": 26,
                    "created_utc": 1653499700.0,
                    "response": "The banks have loaded up, time for retail to pump",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9zbbw4",
                            "author": "SigTauBigT",
                            "score": 11,
                            "created_utc": 1653510303.0,
                            "response": "I agree. I cringe when I see financial news about bitcoin going up. I feel like it is just whoever owns that news site trying to pump it so they can dump. I miss the good old days of a slow increase over time in price.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia1reru",
                                    "author": "statypan",
                                    "score": 2,
                                    "created_utc": 1653560821.0,
                                    "response": "Yeah these 10% in 5 minute period pumps ….. I have mixed feelings. Manipulation + algorithmic trading most likely.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "ia16evb",
                            "author": "BTCMachineElf",
                            "score": 3,
                            "created_utc": 1653543124.0,
                            "response": "The manipulation in the news cycles is so obvious. There is a clear shift in tone when we hit the top and bottom. Everything bitcoin is doom and gloom, then suddenly, stories of hyper bullish sentiment by large institutions. The public is being played, meanwhile I'm still hodling.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9z8e4w",
                    "author": "CryptoMemesLOL",
                    "score": 8,
                    "created_utc": 1653509111.0,
                    "response": "YEah RIghT, everything they ever said was always the opposite of what was happening.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia5easr",
                            "author": "mattjackwillBTC",
                            "score": 1,
                            "created_utc": 1653620993.0,
                            "response": "Lol I just love the way you wrote YEah RIghT there lmao.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia024zc",
                    "author": "ryanlmcl0101",
                    "score": 7,
                    "created_utc": 1653522138.0,
                    "response": "First JP Morgan hates it now they say it’s going up - fuck these clowns. They don’t know shit.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia16l1d",
                            "author": "BTCMachineElf",
                            "score": 3,
                            "created_utc": 1653543245.0,
                            "response": "They do know shit. They just lie about what they think to get ahead of the market.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia4ylba",
                                    "author": "chamawaiian",
                                    "score": 1,
                                    "created_utc": 1653613244.0,
                                    "response": "Well yeah they are smart and that's why they are here.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "ia42vnq",
                            "author": "dvyal",
                            "score": 1,
                            "created_utc": 1653598468.0,
                            "response": "They are always like that and they never gonna change.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9zsz2f",
                    "author": "Wilson_Mining",
                    "score": 3,
                    "created_utc": 1653517863.0,
                    "response": "My my my how the turn tables",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia4dll8",
                            "author": "kruchenyk",
                            "score": 1,
                            "created_utc": 1653603179.0,
                            "response": "This is like something common these days my brother lol.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia1p1tr",
                    "author": "Heph333",
                    "score": 3,
                    "created_utc": 1653558887.0,
                    "response": "So they're trying to get the herd to buy now. That's a red flag.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia4i1ca",
                            "author": "wedath",
                            "score": 1,
                            "created_utc": 1653605228.0,
                            "response": "They are buying and waiting for some other things right now.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9yrxbo",
                    "author": "dantebayer",
                    "score": 5,
                    "created_utc": 1653502552.0,
                    "response": "What is their reasoning other than they bought a bunch themselves. Im bullish too but would like to hear their case. I couldnt read the article because i use a adblocker, but of course they ask me if im ok with cookies and put them on my PC before they tell me i have to disable adblock. And there was a 3rd popup, its like that website is some random crypto click bait site but its supposed to be MSM.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia0iywp",
                            "author": "horsecyack",
                            "score": -1,
                            "created_utc": 1653529990.0,
                            "response": "It’s not like anything will be taken from you or you will be violated if you disabled your ad block and accepted cookies for 10 seconds",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia0tryy",
                                    "author": "LooperGamer",
                                    "score": 1,
                                    "created_utc": 1653535191.0,
                                    "response": "You accept cookies until you revoke permissions. Again.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "ia2ks7d",
                                    "author": "dantebayer",
                                    "score": 1,
                                    "created_utc": 1653576495.0,
                                    "response": "dude i dont like all that flickering and moving stuff on a webpage its distracting its got nothing to do with greed. they could ask me for sats in return for a clean browsing experience and i would probably pay",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9yz5ll",
                    "author": "DudeWhatThe",
                    "score": 8,
                    "created_utc": 1653505392.0,
                    "response": "I personally don't care what JP Morgan thinks. BTC doesn't need their opinion to succeed.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9yzmqu",
                            "author": "FlipnHodl",
                            "score": 6,
                            "created_utc": 1653505584.0,
                            "response": "It’ll surely help though.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9z6jc7",
                                    "author": "DudeWhatThe",
                                    "score": 3,
                                    "created_utc": 1653508366.0,
                                    "response": "Will it? They flip flop on BTC all the time. I don't care for JP Morgan manipulating the masses into buying or selling. I ignore their opinion and stick with fundamentals.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia4ak9p",
                                            "author": "gapemedia1",
                                            "score": 3,
                                            "created_utc": 1653601828.0,
                                            "response": "We can't say anything right now, but yeah he won't gonna help.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i9zcc6n",
                                            "author": "FlipnHodl",
                                            "score": 3,
                                            "created_utc": 1653510712.0,
                                            "response": "Last cycle these clowns had to risk losing their jobs in order to support bitcoin in an investment portfolio. Next cycle they will risk losing their jobs if they don’t support bitcoin in an investment portfolio. It’s a big deal.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9zlsql",
                                                    "author": "DudeWhatThe",
                                                    "score": 3,
                                                    "created_utc": 1653514702.0,
                                                    "response": "They aren’t losing their jobs over bitcoin. This is a legacy bank that only cares about making money. They either loaded their bags and are pumping it so they can dump or they are coming out with some new futures product they want to lure people into so they can manipulate prices. My opinion anyway.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i9zdmy0",
                                                    "author": "pink_raya",
                                                    "score": 2,
                                                    "created_utc": 1653511244.0,
                                                    "response": "not for bitcoin.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9zfx40",
                    "author": "Experienced_AP",
                    "score": 3,
                    "created_utc": 1653512197.0,
                    "response": "Please excuse my cynicism.\n\nGet ready for a pump and dump.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia5guud",
                            "author": "braham222",
                            "score": 1,
                            "created_utc": 1653622302.0,
                            "response": "Here we go again and we have to wait and watch now.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9zyoww",
                    "author": "ReedoIncognito",
                    "score": 4,
                    "created_utc": 1653520508.0,
                    "response": "😆 Sounds like ol' JP is underwater. Welcome to the HODL-DOOOME, JP! Now keep quiet and enjoy bear season 🐻",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9zwig5",
                    "author": "statoshinakapoopoo",
                    "score": 2,
                    "created_utc": 1653519486.0,
                    "response": "BTC does not care!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia3p2zk",
                            "author": "rjt12501",
                            "score": 1,
                            "created_utc": 1653592683.0,
                            "response": "BTC is with the people and it will always gonna be like that.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia0cd1j",
                    "author": "GodOfOdium",
                    "score": 2,
                    "created_utc": 1653526949.0,
                    "response": "Did Jamie do the flip? \nSlimy bastard all the while he was berating Bitcoin did he stack up?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia0m9n5",
                    "author": "Or1gin91",
                    "score": 2,
                    "created_utc": 1653531535.0,
                    "response": "I wonder what price they bought in at",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia5byag",
                            "author": "sodaubai",
                            "score": 1,
                            "created_utc": 1653619790.0,
                            "response": "I really want them to drop the price, I wanna know that.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia10aoi",
                    "author": "Psynaut",
                    "score": 2,
                    "created_utc": 1653538972.0,
                    "response": "6 years ago they would fire bank employees for buying bitcoin or transferring funds into or out of it with their personal accounts, or speaking about it in a branch to customers, even in casual conversation.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia11iij",
                    "author": "Dakotahah",
                    "score": 2,
                    "created_utc": 1653539753.0,
                    "response": "We filled our bags and are ready to dump on you again - JPM",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia3ji6y",
                            "author": "6PEJHEB",
                            "score": 1,
                            "created_utc": 1653590391.0,
                            "response": "This is the best short version and thanks for that shit.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia1fsuk",
                    "author": "18476",
                    "score": 2,
                    "created_utc": 1653550626.0,
                    "response": "Lol good ol JP, one of the top bailout recipients last meltdown. Trust me bro.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia3kym3",
                            "author": "buddyranking",
                            "score": 1,
                            "created_utc": 1653590985.0,
                            "response": "That trust me bro at the end is just hitting me again and again.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia1ktkt",
                    "author": "Sea_Conversation2799",
                    "score": 2,
                    "created_utc": 1653555127.0,
                    "response": "So bear market incoming. They are almost always wrong or maniputing the market with their press",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia3ik4t",
                            "author": "Zyntx3",
                            "score": 2,
                            "created_utc": 1653590002.0,
                            "response": "Damn man, I am tired of bear market, not another one lol.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia1xdq8",
                    "author": "thinkmobi",
                    "score": 2,
                    "created_utc": 1653565052.0,
                    "response": "Institutional pump&dump",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia3oclv",
                            "author": "geelucke",
                            "score": 1,
                            "created_utc": 1653592380.0,
                            "response": "They just wanna see that pump and dump shit for life.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9zjqml",
                    "author": "Longjumping-Egg-4538",
                    "score": 1,
                    "created_utc": 1653513813.0,
                    "response": "Haha nobody knows what will happen and if they did I would listen",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia3j08q",
                            "author": "ildaros",
                            "score": 1,
                            "created_utc": 1653590186.0,
                            "response": "I am glad that I know nothing right now, so good man lol.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9zzvby",
                    "author": "monsieurb1982",
                    "score": 1,
                    "created_utc": 1653521056.0,
                    "response": "Can someone explain me? \n\nBill Gates say Bitcoin worth nothing : People hate him.\n\nJPMorgan say the exact opposite : The very same people hate him.\n\nI just want to understand...\n\nI'm not a fan of these two btw...",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia0g0ic",
                            "author": "LanguageRadiant7420",
                            "score": 2,
                            "created_utc": 1653528617.0,
                            "response": "It is pretty common for people to hate billionaires these days. Not sure what you don’t understand.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia3t2lc",
                                    "author": "wrjrlr",
                                    "score": 2,
                                    "created_utc": 1653594336.0,
                                    "response": "Well I don't know why they do that but that's something shitty.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "ia5gh0u",
                            "author": "cherinichenko77",
                            "score": 1,
                            "created_utc": 1653622100.0,
                            "response": "I am so confused with these things, I better take a break.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia01c1z",
                    "author": "L0ckeandDemosthenes",
                    "score": 1,
                    "created_utc": 1653521756.0,
                    "response": "Around seven years ago my family member worked for chase corp and said they were creating their own digital currency and they wouldn't let bitcoin succeed. Oh how the turn tables.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia10pqx",
                    "author": "YaBoyLaKroy",
                    "score": 1,
                    "created_utc": 1653539238.0,
                    "response": "i will never do business with J.p. morgan. \n\ndeath to banks.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia4him2",
                            "author": "louisguidon",
                            "score": 5,
                            "created_utc": 1653604984.0,
                            "response": "Well that's a good thing right? We want to see death to banks.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia11pk0",
                    "author": "Zealousideal_Leg_630",
                    "score": 1,
                    "created_utc": 1653539878.0,
                    "response": "JP ready to pump and dump on your pretty faces. See you mid-Joon biatches.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia14fa9",
                    "author": "drew2f",
                    "score": 1,
                    "created_utc": 1653541708.0,
                    "response": "They've probably just provided a loan to tether lol. don't trust jomc at all",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia1e1bk",
                    "author": "theskankingdragon",
                    "score": 1,
                    "created_utc": 1653549103.0,
                    "response": "So they're gonna pump and dump.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia4hjx5",
                            "author": "bitcoinscapital2",
                            "score": 1,
                            "created_utc": 1653605001.0,
                            "response": "We just wanna see the pump, that's all we need right now.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia1fizf",
                    "author": "n8dahwgg",
                    "score": 1,
                    "created_utc": 1653550385.0,
                    "response": "Their public statement track record is horrific. Bet they have a bunch of open shorts and plan to dump",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia1fm0b",
                    "author": "Cute_Log_5817",
                    "score": 1,
                    "created_utc": 1653550458.0,
                    "response": "1 year and a half ago i showed a chase broker my robinhood account and they said to risky no crypto investments ! Now look lmao",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia1oem0",
                    "author": "bobbytabl3s",
                    "score": 1,
                    "created_utc": 1653558319.0,
                    "response": "Why so bearish?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia4tz4a",
                            "author": "mrparzyk",
                            "score": 1,
                            "created_utc": 1653610985.0,
                            "response": "They have to behave a bit more bullish because that's what we all need at the end of the fucking day and they have to understand that shit for real man lol, that's so bearish.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia29aua",
                    "author": "dondahdondon",
                    "score": 1,
                    "created_utc": 1653571535.0,
                    "response": "Is this considered the rumor or the news",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia56ula",
                            "author": "bailianjiao",
                            "score": 1,
                            "created_utc": 1653617264.0,
                            "response": "I guess it's a news but we can't say  anything right now lol.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia3jmon",
                    "author": "nefedbi4",
                    "score": 1,
                    "created_utc": 1653590439.0,
                    "response": "I am never going to understand these rich people man.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia3kgry",
                    "author": "suinegisgenius",
                    "score": 1,
                    "created_utc": 1653590782.0,
                    "response": "We are going to win and that's the only thing that I know.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia3o7z1",
                    "author": "titoutitou921",
                    "score": 1,
                    "created_utc": 1653592326.0,
                    "response": "I never wanted him to be with us but I don't mind now.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia3s9z1",
                    "author": "parkmbec",
                    "score": 1,
                    "created_utc": 1653594009.0,
                    "response": "What the fuck? They flip? I guess that's not something shocking lol.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia4oxjp",
                    "author": "KUZMICH350GS",
                    "score": 1,
                    "created_utc": 1653608513.0,
                    "response": "It's just something nice because BTC is better than any other shits and we all can agree on that, I don't know this guy but yeah I can believe that BTC is the best out there right now.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia51gtu",
                    "author": "Lerifod",
                    "score": 1,
                    "created_utc": 1653614663.0,
                    "response": "Well BTC will succeed even if this person says that or not.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia55xm3",
                    "author": "xiaoxiaokuku",
                    "score": 1,
                    "created_utc": 1653616822.0,
                    "response": "So they have decided to be with us now? Didn't care tho.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia59zq6",
                    "author": "gleaoradex",
                    "score": 1,
                    "created_utc": 1653618806.0,
                    "response": "Yeah they did that shit again which they like the most.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}