{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "urvdvw",
            "title": "is it possible to switch from one layer 2 like lightning to another layer 2 without interacting with the first layer?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/urvdvw/is_it_possible_to_switch_from_one_layer_2_like/",
            "author": "Decapitated_Tomato",
            "created_utc": 1652818826.0,
            "score": 2,
            "num_comments": 10,
            "subreddit": "Bitcoin",
            "selftext": "If it's is not possible that's going to cause problems if mass adoption is the end goal.\n\nThe most obvious problem is that fees will eventually get too high for normal people to switch from one layer 2 to another because you'd be competing with institutions for the 7 transactions per second.\n\nThe traditional system transfers a couple quadrillion of dollars on a yearly basis. If mass adoption happens Bitcoin ought to absorb at least a considerable chunk of these transactions. In many cases lightning will be the solution but the main chain will still be used as well, for big transactions, most likely by big corporations/institutions where a fee of $200(0) doesn't seem big at all.\n\nThere are also other problems if switching around requires an intersection with the first layer, but this one is the easiest to explain.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8zpi7q",
                    "author": "SmoothGoing",
                    "score": 1,
                    "created_utc": 1652819941.0,
                    "response": "Don't invent end goals for bitcoin and you won't be disappointed.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8zryss",
                            "author": "Decapitated_Tomato",
                            "score": 1,
                            "created_utc": 1652820956.0,
                            "response": "This isn't inventing a goal, it is the natural trajectory of a platform that benefits of the network effect. A network like Bitcoin should be able to properly handle that.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8zpyik",
                    "author": "WritingFun8769",
                    "score": 1,
                    "created_utc": 1652820127.0,
                    "response": "well lightning already exists—and is becoming wildly adopted—and so does liquid and perhaps others i’m unaware of, so i guess somebody would have to find a reason to try and compete with ln or liquid for that to be an actual problem;\n\nand most people, if they are making use of both layer 2’s already, are already accustomed to using two separate l2 systems, so that’s not much of an issue either;\n\nand that would be an issue like google vs other search engines: one (or more) will win out and become the default.\n\none nice thing about the bitcoin community, is it seems that most everybody recognizes that if something works best, then that’s the option to use. there isn’t a bunch of competing developers all trying to push through their way to the top. ln works, and i don’t see anybody trying to be divisive and say that everybody should start using something other than ln.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8zrpfs",
                            "author": "Decapitated_Tomato",
                            "score": 1,
                            "created_utc": 1652820849.0,
                            "response": "Nobody has any problems now because they could all without any problem transfer their money to either of those layer 2's with affordable fees. Once that isn't the case anymore only the people who are in already are okay.\n\nI know who can compete with ln or liquid; a government.\nIf you have to pay taxes then the choice is easy.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8zsilo",
                                    "author": "Raphae1",
                                    "score": 1,
                                    "created_utc": 1652821188.0,
                                    "response": "If you think, that‘s a problem, just offer a solution. It‘s pretty easy to develop a gateway that can receive via ln and send to a liquid address. I have my doubts, that you‘ll find high demand for that service, though.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8zsipn",
                                    "author": "WritingFun8769",
                                    "score": 1,
                                    "created_utc": 1652821189.0,
                                    "response": "ln tx fees are fractions of a cent; i’ve literally paid 1 sat to transfer my entire balance out of my wallet. why would that ever change?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8ztg4d",
                            "author": "Decapitated_Tomato",
                            "score": 1,
                            "created_utc": 1652821576.0,
                            "response": "Say you are the local supermarket, you obviously have to pay taxes. Bitcoin is everywhere, everyone pays with it. The government conveniently gives you the option to pay taxes in the currency that everyone uses to pay you; Bitcoin. You can either pay them over the main chain with enormous fees or you can pay them over the national layer 2.\n\nYou choose to use their second layer because it's cheaper and as fast as lightning network. The only catch is that it's under government control and they decide the rules.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8zuhbk",
                                    "author": "WritingFun8769",
                                    "score": 1,
                                    "created_utc": 1652822022.0,
                                    "response": "companies are already adopting the ln network for their bitcoin transactions; why would the government have a separate one, and why would anyone choose to use it over ln? if there is a tax on the food i buy that goes to the govt and i pay it through bitcoin because the tax is included in my purchase, then that will just be the norm; but the govt won’t have some weird power to make tx fees more expensive or something. \n\nyou seem the have an idea that bitcoin or lightning can be co-opted by the govt. it’s been proven time and time again that when govts try to control people regarding bitcoin, they find a way around it, because the govt can only do so much. they have no direct control over bitcoin or its layer-2’s.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8ztmw8",
                    "author": "Thanatos_1",
                    "score": 1,
                    "created_utc": 1652821658.0,
                    "response": "I think it's possible with so called \"sub atomic swaps\". With LN, you can switch between sats and shitcoins, as long as they support the LN primitives. So it should be able to swap sats on LN for Lsats on Liquid, for example, since Liquid can run LN.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8zucfs",
                    "author": "mossgathering",
                    "score": 1,
                    "created_utc": 1652821964.0,
                    "response": "People are experts and finding better ways of doing things.  If the scenario you describe actually develops and it's prohibitively expensive (or simply annoying) for people to switch from Layer 2A to Layer 2B, then I 100% guarantee, someone with come-up with a service that is easier and more efficient/cheaper, for a nominal fee.\n\nThere are already several services to A) move bitcoin from on chain to Lightning without having to open new channels, as long as you already have an open channel with inbound liquidity, B)  move bitcoin from on-chain to Lightning and open a channel for you, C) move bitcoin from Lighting to on-chain, without having to close your existing channel, as long as you already have a channel with enough outbound liquidity, D) etc.\n\nI'm certain that if there was enough demand to move bitcoin between Layer 2A and 2B, somebody would step up and provide a service to do so.  And soon after someone else will step up with another service that does it cheaper, faster, and/or otherwise better. This is one thing capitalism does really, really well.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "urv2cw",
            "title": "Dave Smith spreading the word on \"Separation of Money and State\"",
            "url": "https://v.redd.it/88zpksrse3091",
            "author": "jspsfx",
            "created_utc": 1652817969.0,
            "score": 426,
            "num_comments": 77,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8zkz4x",
                    "author": "jspsfx",
                    "score": 23,
                    "created_utc": 1652818050.0,
                    "response": "He is not the first to use this term obviously... It's been part of the bitcoin pitch the whole way. But he's a good messenger and this is a powerful term that will make sense to a lot of people",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i915xlv",
                            "author": "InterPool_sbn",
                            "score": 2,
                            "created_utc": 1652844368.0,
                            "response": "Definitely very worthwhile to share — thanks OP!",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i97jt6q",
                            "author": "gmax9000",
                            "score": 1,
                            "created_utc": 1652972444.0,
                            "response": "No disrespect, I get the vibe he's trying to say the government tries to get people to fund wars with their tax dollars. Nobody has a clue where their money goes after April 14th. You can't refuse to pay taxes because you don't agree with how they spend your money. You shall report your income and you shall pay taxes on your income whether you're paid in Bitcoin or cash. Am I wrong?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i92lofe",
                    "author": "gmax9000",
                    "score": 3,
                    "created_utc": 1652881062.0,
                    "response": "Bitcoin won't fix taxation, what are you gonna do refuse to pay? Good luck with that..",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i93234a",
                            "author": "Few_Budget_2510",
                            "score": 1,
                            "created_utc": 1652888140.0,
                            "response": "Wait, what is your position, that governments will pass taxes on bitcoin holders?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i97ial0",
                                    "author": "gmax9000",
                                    "score": 1,
                                    "created_utc": 1652971812.0,
                                    "response": "That is what makes sense to me, the government doesn't have to control Bitcoin, they control the people who must reside, work, purchase goods and services, license and register property, we cant control how the government spends tax dollars, but you shall pay taxes. There's going to have to be a new world order with these freedoms built in, you're not going to change this one..",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i95hoty",
                            "author": "Vipu2",
                            "score": 1,
                            "created_utc": 1652925645.0,
                            "response": "Taxation no but if Gov raises taxes by 20% to go to war people are not gonna like that.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9033xa",
                    "author": "0x1a3c3e7",
                    "score": 4,
                    "created_utc": 1652825790.0,
                    "response": "I just got an ad email from [crypto.com](https://crypto.com) for a Visa crypto card.\n\nCool but, why would anyone need or want Visa to process their crypto payments when the whole point of crypto is to DIY?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i90bx7r",
                            "author": "SpontiacB",
                            "score": 3,
                            "created_utc": 1652829906.0,
                            "response": "Nope!",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i91r61j",
                            "author": "totalolage",
                            "score": 2,
                            "created_utc": 1652859353.0,
                            "response": "because not everyone accepts crypto. A card like that lets you migrate fully to crypto without losing transactability with anyone who hasn't yet.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i923qad",
                            "author": "BtcKing1111",
                            "score": 2,
                            "created_utc": 1652870641.0,
                            "response": "Because every shop already has an existing POS. Building on top of that infrastructure is a quick win, instead of reinventing the wheel and needing to teach all retailers and staff how to use crypto wallets.\n\nI see the existing infrastructure, like MasterCard and private banks, will continue to exist, but they will eventually offer accounts where less tech savvy people can store Bitcoin.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i90qxe8",
                            "author": "tygamer15",
                            "score": 0,
                            "created_utc": 1652837059.0,
                            "response": "My understanding is that the bitcoin blockchain couldn't handle the amount of transactions visa does.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i91pmgv",
                                    "author": "btc-beginner",
                                    "score": 8,
                                    "created_utc": 1652857991.0,
                                    "response": "Lightning network, solves this. \n\nVisa, is also a layer 2 to the banking system.\n\nBank settlements are still slow (days).",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i926vos",
                                            "author": "rhelwig7",
                                            "score": -1,
                                            "created_utc": 1652872895.0,
                                            "response": "That's an interesting point, that Visa is a layer 2 tech. But just like with Visa, lightning will end up being a centralizing tech. I prefer using layer 1 in both cases (crypto & fiat) for the same reasons.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i96q3i0",
                                                    "author": "btc-beginner",
                                                    "score": 1,
                                                    "created_utc": 1652956836.0,
                                                    "response": "There is a centralized element to LN.\nHowever, it's very distributed. Run by individuals.\nAnd not a centralized entity, like visa. \n\nDue to the layer 1 decentralized nature. Anyone can invent a new and better LN. It's very likely we will se many competing layer 2 and 3 tech built on the Bitcoin blockchain.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9b8n50",
                                                            "author": "rhelwig7",
                                                            "score": 1,
                                                            "created_utc": 1653043121.0,
                                                            "response": "It is true that LN isn't explicitly centralized, but due to its features it will tend to be centralized in practice. The cost to onboard means that large entities (banks and large corporations) will have incentive to provide custodial wallets and people will choose that over the hassle and expense of using their own wallets.\n\nImagine the scenario where you try to buy something from Walmart (for example) when you don't yet have a wallet. You can download a wallet to your phone, being unsure if it is safe and costing you around $5 just to create your account, or you can use the WalmartWallet for free. You know the WalmartWallet will work just fine with Walmart and likely anyone else and you can trust that if anything goes wrong you can at least eventually get some help.\n\nThis sort of thing will be compounded by eventual transaction fees (small as they may be) for routing, and highly connected nodes will tend to get preferred. Think about what sort of entities will already have a ton of monetary connection - banks, large corporations, etc.\n\nThose of us who understand why cryptocurrency was invented will prefer a little cost and hassle to get freedom, but the masses don't know and don't care. They'll just go with whatever is easy, and the banksters will offer that. And that is my thesis as to why LN is centralizing.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i90r8gv",
                                    "author": "0x1a3c3e7",
                                    "score": 1,
                                    "created_utc": 1652837202.0,
                                    "response": "Ya, but it's practically idle right now.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i90f0wz",
                    "author": "ColdFusion3456",
                    "score": 5,
                    "created_utc": 1652831405.0,
                    "response": "The only separation I need is between me and my wife",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i91p3oz",
                            "author": "kyiv_star",
                            "score": 8,
                            "created_utc": 1652857533.0,
                            "response": "Why? She seems nice",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i913udh",
                    "author": "Feeling_Advantage108",
                    "score": 2,
                    "created_utc": 1652843281.0,
                    "response": "Fucking ALL of this.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i90s61x",
                    "author": "Future_981",
                    "score": 3,
                    "created_utc": 1652837636.0,
                    "response": "Well said. That also means voting democrat would be the worst possible choice out of all the choices.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i92r383",
                            "author": "anytownusa11",
                            "score": 3,
                            "created_utc": 1652883534.0,
                            "response": "I'm inclined to agree but the reality is that both political parties are 99% the same thing.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i93346a",
                                    "author": "Few_Budget_2510",
                                    "score": 2,
                                    "created_utc": 1652888560.0,
                                    "response": "*assuming the two of you are americans*\n\nFirst past the poll voting really needs to be understood as one of the deepest and most corrupt voting systems.\n\nIf we have Instant Run-off-Voting there *could* be meaningful deviation between parties.\n\nu/Future_981 I don't understand how you came to this conclusion from this video.  yeah 'libertarians' are called out specifically, but I don't see how: \n\n>voting democrat would be the worst possible choice.\n\nIt is *very* likely that the GOP and DNC are in lockstep together when it comes to *VOTING* on issues, sure they may talk a good talk about being fiscally responsible, but bro, look at voting records and the illusion fallls away and you see the bravado for what it is.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i960acs",
                                            "author": "duckbillphil",
                                            "score": 1,
                                            "created_utc": 1652935646.0,
                                            "response": "What you really want is range/score voting\n\nhttps://rangevoting.org\n\nhttps://rangevoting.org/rangeVirv.html",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i92jmcl",
                    "author": "DreadPirateNot",
                    "score": 2,
                    "created_utc": 1652880077.0,
                    "response": "We never have religious wars anymore? Maybe you should double check that source pal.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i905xrx",
                    "author": "bmuth95",
                    "score": -6,
                    "created_utc": 1652827088.0,
                    "response": "Is this guy an idiot? The fed is a private company 🤡",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i90cj2i",
                            "author": "B1oodless",
                            "score": 13,
                            "created_utc": 1652830197.0,
                            "response": "I'm sure you're trolling a bit, but we all know its private in name only.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i90dvom",
                                    "author": "huge43",
                                    "score": 2,
                                    "created_utc": 1652830851.0,
                                    "response": "I honestly am starting to think these dudes really believe the Fed is truly some private entity operating outside of their Government daddy. Seeing all these comments is distressing to say the least.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i92q6v5",
                                            "author": "NYKNYb",
                                            "score": 1,
                                            "created_utc": 1652883129.0,
                                            "response": "Governments are central banks' bitches, not the other way around.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i90xe6h",
                                    "author": "Berserkism",
                                    "score": -5,
                                    "created_utc": 1652840105.0,
                                    "response": "The dumbest shit I read today",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i927y4y",
                                            "author": "B1oodless",
                                            "score": 3,
                                            "created_utc": 1652873610.0,
                                            "response": "I'm guessing you don't read much.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i90ds1v",
                            "author": "ILikePracticalGifts",
                            "score": 11,
                            "created_utc": 1652830804.0,
                            "response": "Imagine there being a private company whose CEO is appointed by the government,\n\nwhose policy is informed by the government,\n\nwhose monopoly rule is based purely on government charter,\n\nand that same government will go to war to make sure your captive market stays captive.\n\n*Yeah…but it’s a private company…*",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i90h53l",
                                    "author": "bmuth95",
                                    "score": 4,
                                    "created_utc": 1652832438.0,
                                    "response": "In my eyes it's the other way around. I always saw it as the fed controlling the government.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i90icff",
                                            "author": "RonPaulSaves",
                                            "score": 3,
                                            "created_utc": 1652833025.0,
                                            "response": "The government has the power to end the fed. The fed does not have the power to end the government.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i92qa79",
                                                    "author": "NYKNYb",
                                                    "score": 2,
                                                    "created_utc": 1652883172.0,
                                                    "response": "Didn't some president try to do that and got killed?",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i90ikaa",
                                                    "author": "bmuth95",
                                                    "score": 3,
                                                    "created_utc": 1652833130.0,
                                                    "response": "Idk man, they control the money. I bet they could end the government if they really wanted too.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i90xksr",
                            "author": "Remarkable-Cat1337",
                            "score": 0,
                            "created_utc": 1652840193.0,
                            "response": "ignorance is a blessing",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i92fysb",
                    "author": "Krisbone",
                    "score": 1,
                    "created_utc": 1652878255.0,
                    "response": "Dave \"it's not rape if she is drunk\" Smith is not the spokesman we need.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i92vm0e",
                            "author": "thedrewf",
                            "score": 4,
                            "created_utc": 1652885469.0,
                            "response": "I’m gonna go off on a limb and say that you didn’t actually consume the episode from 5 years ago to even the one from a couple weeks ago where he covered exactly what was said.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i91unf9",
                    "author": "I-make-ada-spaghetti",
                    "score": 1,
                    "created_utc": 1652862560.0,
                    "response": "If the USA separates money from state before any other superpower it will get rolled.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8zz9fy",
                    "author": "Nada_Lives",
                    "score": -11,
                    "created_utc": 1652824072.0,
                    "response": "Money IS separate from government, at least in the U.S. The Federal Reserve is a private entity that uses the services of government to offer its private currency to the populace by contract. The government just enforces the contract, as is its duty under law.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i902864",
                            "author": "djabr0ni",
                            "score": 10,
                            "created_utc": 1652825391.0,
                            "response": "In theory, sure.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i909hjq",
                                    "author": "Nada_Lives",
                                    "score": -3,
                                    "created_utc": 1652828750.0,
                                    "response": "No, in law. You were just taught to let \"the authorities\" run it for you.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i90bzxg",
                                            "author": "djabr0ni",
                                            "score": 10,
                                            "created_utc": 1652829942.0,
                                            "response": "But not in practice. \"The authorities\" can and will do whatever the ruling class commands of them, including eliminating inconvenient poors.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i90oong",
                                                    "author": "whatthegeorge",
                                                    "score": 0,
                                                    "created_utc": 1652835995.0,
                                                    "response": "Tbh they’re more likely to keep you unhealthy alive and poor rather than kill you off; they can’t make money off you if you’re dead.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9177qx",
                            "author": "My_name_iz_Palygos",
                            "score": 1,
                            "created_utc": 1652845074.0,
                            "response": "Finally some one with actual fact and not an emotional perspective based on everyone is the bad guy except me theory’s.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i917qbm",
                                    "author": "Nada_Lives",
                                    "score": 2,
                                    "created_utc": 1652845363.0,
                                    "response": "Well, you can see how popular that is.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i90dm5g",
                            "author": "huge43",
                            "score": 0,
                            "created_utc": 1652830724.0,
                            "response": "If you think the federal reserve is \"truly\" separate from the government I have a bridge in Brooklyn to sell you. The Fed does what the Feds want.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i90l4hu",
                                    "author": "Nada_Lives",
                                    "score": 5,
                                    "created_utc": 1652834324.0,
                                    "response": "I would read your ownership documents first. I see you haven't read the Fed's.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i92bia2",
                            "author": "SethDusek5",
                            "score": 0,
                            "created_utc": 1652875802.0,
                            "response": "Imagine being this disingenuous. Holy fuck",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i92xbmo",
                                    "author": "Nada_Lives",
                                    "score": 1,
                                    "created_utc": 1652886181.0,
                                    "response": "Evidence: Show where in law 1 US 246 (Coinage Act) was repealed.\n\nEvidence: Show in law where the Federal Reserve \"dollar\" was adopted.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i92y28u",
                                            "author": "SethDusek5",
                                            "score": 1,
                                            "created_utc": 1652886486.0,
                                            "response": "An institution created by the government, with board members appointed by the President (part of the government) and confirmed by the Senate(part of the government), and responsible for the single allowed US currency (enforced by the government), which is minted by the Bureau of Engraving and Printing (part of the government), is infact actually a private entity. Gj",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i938i08",
                                                    "author": "Nada_Lives",
                                                    "score": 2,
                                                    "created_utc": 1652890765.0,
                                                    "response": "Show me, in law, the definition of the Federal Reserve \"dollar\". You'd think that something this fundamental would have a definition, wouldn't you?\n\nOkay, that one's a little tough. Show me the Federal Reserve's definition of the Federal Reserve dollar. Show me the standard by which it is measured.\n\nI showed  you the definition of the official United States  dollar. Why can't you show me the one that you cite?\n\nBecause yours is contractual. Accept it, and abide by the contract, which you have no knowledge of other than how it is enforced.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i91n07y",
                    "author": "GhostCop42",
                    "score": -3,
                    "created_utc": 1652855796.0,
                    "response": "He is ignorant.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i91n278",
                    "author": "ZombieTestie",
                    "score": 0,
                    "created_utc": 1652855844.0,
                    "response": "Los baby",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i92sm8i",
                    "author": "fiercygoat",
                    "score": 1,
                    "created_utc": 1652884198.0,
                    "response": "Great point he's making",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9317zn",
                    "author": "Few_Budget_2510",
                    "score": 1,
                    "created_utc": 1652887781.0,
                    "response": "First we separate the money from state.\n\nThen we separate the wealth from power.\n\nNext we become a [Type I civilization](https://en.wikipedia.org/wiki/Kardashev_scale).",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i93kqw9",
                    "author": "TheRealNJS",
                    "score": 1,
                    "created_utc": 1652895681.0,
                    "response": "Religious wars have not ended they are just not called religious anymore. The undercurrent of religious animosity has been present in a majority of the wars in the last 80 years.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i945yov",
                    "author": "deefdaffer",
                    "score": 1,
                    "created_utc": 1652904286.0,
                    "response": "When the state has infinite money they do silly stuff like create new bioweapons which they test on the populace and then just for laughs destroy their businesses and possibly starve them to death.  Other than that and the thousands of other atrocities that governments constantly commit, the state really isn't that bad.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9171xy",
                    "author": "My_name_iz_Palygos",
                    "score": -6,
                    "created_utc": 1652844984.0,
                    "response": "Never using this shit I will go back to Indian wampum before I ever trust an asset that can get emp’d , hacked, and virtually has no agreement between the people. It’s crap .",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9178os",
                    "author": "asm010998",
                    "score": 0,
                    "created_utc": 1652845089.0,
                    "response": "Well spoken. Bitcoin as a solution claim would be better with more detail/being displayed in this clip 👌🏼",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i91809l",
                    "author": "Cute_Objective6082",
                    "score": 0,
                    "created_utc": 1652845517.0,
                    "response": "Great podcast pbd is the best",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i919jfi",
                    "author": "Additional_Plan8781",
                    "score": 0,
                    "created_utc": 1652846401.0,
                    "response": "It's called Control.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i92he82",
                    "author": "BigPlayCrypto",
                    "score": 0,
                    "created_utc": 1652878988.0,
                    "response": "🤓",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i92q15t",
                    "author": "NYKNYb",
                    "score": 0,
                    "created_utc": 1652883057.0,
                    "response": "That would be a good start.\n\nAnd then \"separation of everything and state\".\n\nThey can keep the fucking post office, but they have to fund it through selling stamps, and no legal monopoly, let's see if they can even pull that off in a free market (they can't).",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i92r6i5",
                    "author": "Good_Equipment_1998",
                    "score": 0,
                    "created_utc": 1652883573.0,
                    "response": "✍️✍️🤫",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i92rciw",
                    "author": "Good_Equipment_1998",
                    "score": 0,
                    "created_utc": 1652883646.0,
                    "response": "400 Campony to world 🤫",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i93dkrz",
                    "author": "PeacefullyFighting",
                    "score": 0,
                    "created_utc": 1652892794.0,
                    "response": "This is by far the best argument for Bitcoin/crypto I've ever heard. It's relatable to something everyone knows, doesn't get into the tricky tacky back & fourth and gets straight to the point of why true believers feel so strongly about it. \n\nThe masses agree with getting money out of politics, you see it all the time. The problem is making that switch and literally take the value out of government currency.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}