{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "utvgy2",
            "title": "Bitcoin network integrity",
            "url": "https://www.reddit.com/r/Bitcoin/comments/utvgy2/bitcoin_network_integrity/",
            "author": "Mysterious-Emu-4503",
            "created_utc": 1653052382.0,
            "score": 1,
            "num_comments": 7,
            "subreddit": "Bitcoin",
            "selftext": "Goood morning,\n\nI was hoping someone could refer me to resources on bitcoins network integrity as it pertains to its supply and code. As demand rises there is a larger incentive for individuals to \"create more bitcoin\". I recently had a debate with a boomer and my arguement about game theory and incentives for the rest of the network to weed out the individual was not sticking. I need more research in this area.\n\n1). If a percentage of the network alters the code, does this create a fork and how? Has this ever happened? \n\n2) why would it never reach consesus to increase the supply. If 60% of the network was bribed what would happen?\n\n3.) I tried to argue that all assets have this problem but unlike all other assets the people who get to make that decision is far larger then any other asset class. What is a better way to explain that?",
            "stickied": false,
            "comments": [
                {
                    "id": "i9br7zg",
                    "author": "Squezeplay",
                    "score": 1,
                    "created_utc": 1653053123.0,
                    "response": "1. Bitcoin has no code, its a protocol. You can write your own node code if you wanted. As long as you operate within the protocol its fine. But if violate the protocol, like giving yourself coins or making unauthorized transfers, other nodes will just ignore you. If a percentage of the network does this, yes its a fork, its just a different protocol.\n2. That would a be a hard fork. Users can decide which fork they want to use. Since bitcoin's scarcity is a pretty core reason why most people use bitcoin, its unlikely a fork that alters the supply would become more popular than the original.\n3. Probably to just explain it like gold, its a digital asset but has scarcity. Why it has scarcity is a technical explanation that they should probably need to do their own research on.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9brv5o",
                            "author": "Mysterious-Emu-4503",
                            "score": 1,
                            "created_utc": 1653053409.0,
                            "response": "Thank you for taking the time to respond. The technical side is my weakest, where is a good place to start this research? Any books that go into the details that you are aware of?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9bu1us",
                                    "author": "Squezeplay",
                                    "score": 1,
                                    "created_utc": 1653054360.0,
                                    "response": "Try just searching on youtube, I'm sure there are ton of high level overviews of bitcoin specifically. Bitcoin itself is relatively simple once you get by initial misconceptions. You can go down the rabit hole on different consensus mechanisms, game theory, cryptography, etc. especially relating to other cryptocurrencies. So maybe just focus on bitcoin and proof of work first, public-key cryptography as well if you aren't familiar.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9bvk9d",
                                            "author": "Mysterious-Emu-4503",
                                            "score": 1,
                                            "created_utc": 1653055007.0,
                                            "response": "Thank u! Thats exactly what i need, i just didnt kno the right words to search for rofl.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9brs7w",
                    "author": "codingwithcoffee",
                    "score": 1,
                    "created_utc": 1653053373.0,
                    "response": "Bitcoin has a market cap of over $500 BILLION dollars. \n\nI think it is fair to say that this already presents enough of an incentive for nefarious actors to find ways to “create more bitcoin”.\n\nAnd yet bitcoin remains the most secure network on the planet by virtue of the decentralized ledger protected by all of the combined mining power. \n\nAnd it will remain secure - unless - those nefarious actors could somehow gain control of more than 50% of all of the mining hash power of the network. \n\nThe genius behind bitcoins design means that this is both financially ruinous to attempt - AND - if successful, the network (and therefore bitcoin itself) would be rendered worthless. Removing the incentive to attempt such an attack. \n\nNot sure it will help convince a boomer - as Satoshi famously said “If you don't believe me or don't get it, I don't have time to try to convince you, sorry.”",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9bt178",
                            "author": "Mysterious-Emu-4503",
                            "score": 1,
                            "created_utc": 1653053919.0,
                            "response": "Thank you. This is a great way to explain it. Its unfortunete they seemed to have little interest in learning anything but rather act as if they know something i do not, immediately creating a standoffish conversation instead of an enlightening back and forth. I feel bad for the boomers, the time where they were the knowledgeable ones was very brief.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}