{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "urh93a",
            "title": "HTML Coding For Beginners - Understanding HTML Tags",
            "url": "https://www.stsanemusic.com.ng/html-coding-for-beginners-understanding-html-tags/",
            "author": "CategoryElectrical65",
            "created_utc": 1652773517.0,
            "score": 0,
            "num_comments": 1,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8x9hdc",
                    "author": "coinfeeds-bot",
                    "score": 1,
                    "created_utc": 1652776206.0,
                    "response": "tldr; Having a basic knowledge of HTML is necessary for anyone who wants to build, manage or improve websites, from professional developers to marketers and small-time business owners. To learn HTML, you will need to study the various tags and understand how they behave while formatting a textual document. HTML makes use of various tags to format the content and these tags are enclosed within angle braces.\n\n*This summary is auto generated by a bot and not meant to replace reading the original article. As always, DYOR.*",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "urhf6b",
            "title": "Now's the time to mention Bitcoin to your friends and family that wish they had bought it when it was cheaper",
            "url": "https://www.reddit.com/r/Bitcoin/comments/urhf6b/nows_the_time_to_mention_bitcoin_to_your_friends/",
            "author": "Luminous_Emission",
            "created_utc": 1652774301.0,
            "score": 28,
            "num_comments": 29,
            "subreddit": "Bitcoin",
            "selftext": "I've come across several people in my life that wished they had bought Bitcoin when it was $600. Those people are probably no longer paying attention to Bitcoin and assume they just missed the boat. Well the boat is coming around for a second pass and we're getting another chance to buy at 30k so everyone that missed the 30k boat last summer now has a second chance to scoop some up while the gettin's good. I've only been buying for 1 year, but I'm already SOOOOO glad I started buying a year ago so I can only imagine how people that have been buying for several years must feel. One conversation with someone you care about could be the one that inspires them to start their Bitcoin journey rather staying a victim to a broken system that's keeping them poor. The price is low. The time is now. Make whatever adjustments you need to in order to buy as much as you can. Get rid of Netflix, get rid of Disney Plus, don't buy those expensive shoes, don't buy those expensive jeans, stop eating fast food all the dang time, and STACK LIKE YOUR LIFE DEPENDS ON IT, THE TIME IS NOW TO TAKE ADVANTAGE OF THIS OPPORTUNITY, THE NEXT 30K ISN'T PROMISED.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8x7snp",
                    "author": "Lolfcklol",
                    "score": 16,
                    "created_utc": 1652774631.0,
                    "response": "This is the kind of behavior that gets people to hate bitcoin. If your friends/family actually studied bitcoin, they would realize they didnt miss the boat. We have to educate those that want to be educated, not tell them BUY BUY ITS ON SALE, thats how you get more paper hands",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8x83wd",
                            "author": "Luminous_Emission",
                            "score": -6,
                            "created_utc": 1652774919.0,
                            "response": "Well you mention it to people that were ALREADY interested in it AND THEN they study it AND THEN BUY IT. You don't even have to understand something 100% to take advantage of it. Most people don't fully understand all the small details about how electricity works and yet they use electricity for their convenience in their lives.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8x8bpb",
                                    "author": "Lolfcklol",
                                    "score": 4,
                                    "created_utc": 1652775124.0,
                                    "response": "Using something and being invested in something is different. I know how to use an iphone, but I dont own apple stock.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8xcr6q",
                                            "author": "Luminous_Emission",
                                            "score": -2,
                                            "created_utc": 1652779221.0,
                                            "response": "You can still take advantage of it if you know it's a good product that provides a benefit, that's what I meant.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8xtkz8",
                                                    "author": "elmersglue17",
                                                    "score": 1,
                                                    "created_utc": 1652791189.0,
                                                    "response": "Dude, you are so cringe. Can you like, not? Listen to yourself…",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8xh0yf",
                    "author": "Thirdlegproduction",
                    "score": 10,
                    "created_utc": 1652782951.0,
                    "response": "Ahh you must be new to this.  \nWhat you think will happen where you and your friends achieve financial freedom an you'll go on luxury vacations together and everyone thinks you're cool for letting them in your money making ways.\n\nHere's what will happen...\n\n\\- People won't listen and will deeply hate you when the price moves up 10x.  \n\\- People will listen and then trade their btc for altcoins and lose most of it and they'll hate you.  \n\\- People will listen, hodl bitcoin and will credit their success to their own genius.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8xbhqf",
                    "author": "Llonga",
                    "score": 5,
                    "created_utc": 1652778058.0,
                    "response": "Yeah don’t do this. Let them do their own research. This approach is ‘culty’ and never ends well.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8xy7lg",
                            "author": "Designer-Freedom7638",
                            "score": 1,
                            "created_utc": 1652793564.0,
                            "response": "We shouldn't invest in something we don't believe in.  Why wouldn't we share something we truly believe in?  \n\nI know the answer.  But it makes me question whether investing into BTC is the right thing for people who think like you do.  If anyone is betting their retirement on it or going all in, then it would seem counterintuitive to then keep quiet about BTC.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8xk68u",
                    "author": "Throwaway4VPN",
                    "score": 2,
                    "created_utc": 1652785381.0,
                    "response": "I like my Netflix and sometimes some expensive shoes?  \nI'm not going to lower my quality of life to stack sats...  \n\n\nInvest what you can afford to lose... also chill, this attitude is why so many people are against Bitcoin right now. Teach people if they are interested, or advise people to read about it if not. Don't go forcing ideas on people. This is not the gwei..",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8xdfru",
                    "author": "VirtuaFighter6",
                    "score": 2,
                    "created_utc": 1652779855.0,
                    "response": "Stack stack stack, 2025 is coming.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8xafs4",
                    "author": "Cakey44",
                    "score": 1,
                    "created_utc": 1652777095.0,
                    "response": "using/ buying an iphone is most certainly an investment \n\n“to have given a lot of time and effort to something and care about it very much”",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8xkz6w",
                    "author": "sugarduck99",
                    "score": 1,
                    "created_utc": 1652785939.0,
                    "response": "Just shut up OP, you sound like a degen.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8xbs71",
                    "author": "hayseed_byte",
                    "score": 0,
                    "created_utc": 1652778320.0,
                    "response": "This is the start of crypto winter. I looking to buy btc at around $15k",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8xdkd1",
                            "author": "one_one12",
                            "score": 1,
                            "created_utc": 1652779969.0,
                            "response": "What makes you think it will fall to 15k?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8xsn8h",
                                    "author": "SimpleRelative9038",
                                    "score": 1,
                                    "created_utc": 1652790678.0,
                                    "response": "what makes you think it wouldnt?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8xt87l",
                                            "author": "SouthTippBass",
                                            "score": 1,
                                            "created_utc": 1652790993.0,
                                            "response": "Well, historically, Bitcoin never drops below its previous bull runs ATH. So that would be $19k I think?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8xvv61",
                                                    "author": "hayseed_byte",
                                                    "score": 1,
                                                    "created_utc": 1652792385.0,
                                                    "response": "Bitcoin has only existed during the longest economic bull run in a long time. It hasn't existed during an economic downturn/recession.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8xwd5w",
                                                            "author": "SouthTippBass",
                                                            "score": 1,
                                                            "created_utc": 1652792637.0,
                                                            "response": "Heard the same story back in 2018. Nobody knows what's going to happen.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i8xwr59",
                                    "author": "hayseed_byte",
                                    "score": 1,
                                    "created_utc": 1652792830.0,
                                    "response": "If the support at 29-30k doesn't hold, the next closest support level on the monthly chart is like $14k. It might crab for a few months and keep bouncing between $30k and $40k. Then it'll break down and you'll stop seeing posts like this. This isn't the bottom. There are too many shitcoins. Bitcoin dominance will go up even as the price goes down because alts will bleed HARD against btc and the shitcoins will die off.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8xmnm9",
                            "author": "debanked",
                            "score": 1,
                            "created_utc": 1652787075.0,
                            "response": "Start selling it down",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8xt0dt",
                            "author": "ApplicationAny1434",
                            "score": 1,
                            "created_utc": 1652790878.0,
                            "response": "I told to everyone since may 2021 its bear time....now its 1.8 years till halving  ..means it will be priced in before the block reward get halved....say 6 month before.\n\nyou get around 1.2 years for a bearcycle plus complete bullmarket to new highs 100-200k",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8xg6g7",
                    "author": "SeanyBlaze",
                    "score": 1,
                    "created_utc": 1652782241.0,
                    "response": "Honsetly i think the best way is to just lead by example. I'll never tell someone where they should invest their money",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8xjbre",
                            "author": "Luminous_Emission",
                            "score": 2,
                            "created_utc": 1652784762.0,
                            "response": "My point is that if they were interested in it but thought it was too late to buy (and stopped keeping track of the price), you could mention that it's low again and maybe they'll buy. I guess I lot of people misunderstood the part where I said to mention it to people that were already interested in it that way you aren't shoving it down their throats.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8xohz6",
                    "author": "Fizzifish",
                    "score": 1,
                    "created_utc": 1652788250.0,
                    "response": "Nvr do this. Especially to your loved ones. Especially If they cannot stomach the volatility and have no experience in investing. You are no different from the dumb influencers who shill their tokens. \n\nThis is one of the dumbest advice given. It doesn’t matter if they were interested. They will get Bitcoin at the price they deserve.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8xqehy",
                    "author": "kytheon",
                    "score": 1,
                    "created_utc": 1652789400.0,
                    "response": "Watch them not take your advice until we’re back at 50, crash back to 30 and then panic sell. And you lose friends/family. Source: I did this with my friends in 2017/2018",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8xe51h",
                    "author": "piotrek211",
                    "score": -1,
                    "created_utc": 1652780483.0,
                    "response": "Oh yeah because there is no such a thing as a marketcap and btc can just grow and grow. Better wait for sub $10k.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8x9jjj",
                    "author": "ThatL1ttleGuy",
                    "score": 0,
                    "created_utc": 1652776262.0,
                    "response": "I don't push it on my loved ones. I have mentioned it a few times and tried to explain it to them in basic terms.. I bring it up every now and then and if they seem interested I try to inform them more of what it is and will be and say look into it. In the end it's up to them.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8xt4gd",
                    "author": "VPNApe",
                    "score": 1,
                    "created_utc": 1652790938.0,
                    "response": "Nah. They're mostly dead broke or raging liberals who want the govt to print even more money. They won't understand till $1000 buys a burger.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}