{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "v13z9j",
            "title": "In Bitcoin The Nodes Are Sovereign | The Miners Are Just Hired Security Providers, They Do Not Control Bitcoin, But Serve At The Nodes Pleasure | Miners Are in No Position To Dictate Terms To Anyone | Saifedean Ammous | Verify And Validate Bitcoin by Running a Node",
            "url": "https://v.redd.it/uzky5ytn3n291",
            "author": "Fiach_Dubh",
            "created_utc": 1653928128.0,
            "score": 149,
            "num_comments": 27,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "iakci5s",
                    "author": "New_Dawn",
                    "score": 20,
                    "created_utc": 1653930862.0,
                    "response": "Fired up a full node recently. Feels good man.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iak8nto",
                    "author": "NitronBot106",
                    "score": 11,
                    "created_utc": 1653929167.0,
                    "response": "Not your keys, not your coin. Not your node, not your rules.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iakwwqh",
                    "author": "Simple_Yam",
                    "score": 3,
                    "created_utc": 1653940184.0,
                    "response": "I wish we stopped the \"miners have no power\" bullshit. Decentralized block production is as important as the individual number of full nodes on the network. \nYou cannot have censorship resistance without miner decentralization.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iam6u3f",
                            "author": "Fiach_Dubh",
                            "score": 1,
                            "created_utc": 1653963207.0,
                            "response": "I don't disagree, BUT\n\nI feel that there is a general over emphasis on miners in the mainstream. reminding users here and everywhere else where the real power lies is important. \n\nIn Your Own Full Node. Run One.\n\nSide Note: Bitcoin mining stocks are also shitcoins.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ialxwyy",
                    "author": "OfWhomIAmChief",
                    "score": 2,
                    "created_utc": 1653958639.0,
                    "response": "Miners vote on changes to the network, nodes do not. For example:\n\nThe Taproot rule change was literally voted on by miners. They cast their votes by putting special values into their mined blocks that indicated if they approved of the change. The only way to vote was to produce a mined block - which by definition only miners can do. Google BIP9 to see how this voting mechanism works.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iam5u4g",
                            "author": "Fiach_Dubh",
                            "score": 3,
                            "created_utc": 1653962686.0,
                            "response": "There is much more to this then meets the eye.\n\nNodes are the ones validating and enforcing all current and new rules. Miners go along for the ride.\n\nSpeedy trial was a mining activated soft fork that coordinated the miners to activate taproot (or recognize taproot transactions as valid) at a certain block height. This coordination is done so miners are all on the same page and there is not a minority chain split mistakenly. \n\nThe consequence of a miner not being on the main chain is that they could mine on top of an old block, when a new valid block (with now valid taproot transactions) has already been found that they should have been mining on top of. \n\nThe ultimate consequence of this to the miner is they would miss out on a reward mining on an old already solved block.\n\nThe ultimate consequence for the network could be a minority fork or longer chain reorgs than normal, not ideal, but manageable.\n\nThus this upgrade process was not really a vote. it was a coordination event to ensure smooth activation. \n\nConsensus for that activation was achieved through a long process (years) of developer review & community awareness (ie end user node runners). This consensus process was the real \"voting\" mechanism of the upgrade process.\n\nThe MASF speedy trial proposal was submitted by node runners, community members and developers to the miners as a subtle non contentious push. \n\nMiners were given a nice pre-ultimatum. The message was, we have community consensus on taproot, activate taproot by this height volentarily or maybe we'll come back with a more forceful activation proposal...like a user activated soft fork enforced by node runners (uasf).\n\nThus the miners did not have a final say in this vote, they simply ratified the vote already approved by the community and the community could have ratified itself had the miners not ratified it on their own.\n\nit's a bit of a dance. But ultimately the sovereignty lies in the nodes. The miners are along for the ride, though serve an important function, though it's often exaggerated over nodes. Which is not technically correct.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iakczxz",
                    "author": "Simmen77",
                    "score": 5,
                    "created_utc": 1653931081.0,
                    "response": "I don't like Ammous. Too extreme (especially his views on climate change) and too loud. I wonder why he is being glorified that much",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ial3ei4",
                            "author": "MrRGnome",
                            "score": 7,
                            "created_utc": 1653943267.0,
                            "response": "Broken clocks. Judge an argument on its merit not its speaker - and 100% lets stop glorifying people it's antithetical to Bitcoin.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iakhbgr",
                            "author": "caploves1019",
                            "score": 12,
                            "created_utc": 1653932997.0,
                            "response": "Provide the counterargument publicly on your own platform, ask to debate him, show specifically where he is incorrect on common terms.\n\nFun side note, Bitcoin doesn't care what Saifedean or you think about the weather.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iam67om",
                            "author": "RolosHat",
                            "score": 1,
                            "created_utc": 1653962880.0,
                            "response": "Because he wrote a book that orange pilled thousands, it’s some of the best bitcoin work out there",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iakhbpa",
                            "author": "NonTokeableFungin",
                            "score": -7,
                            "created_utc": 1653933000.0,
                            "response": "Well - just follow the OP here. He’s politically extreme himself.    \nLong on emotion.    \nShort on rationale.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iaknsi5",
                                    "author": "PerformanceVarious45",
                                    "score": 2,
                                    "created_utc": 1653935922.0,
                                    "response": "You realize he is an anarchist... the exact opposite of a political extremist.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iakp29h",
                                            "author": "NonTokeableFungin",
                                            "score": 1,
                                            "created_utc": 1653936503.0,
                                            "response": "Ok.  \nSo an Anarchist is someone who advocates for Anarchy as political structure. Yes ?\n\nSo, let’s have an example of a successful Anarchy.\n\nIf you don’t mind let’s limit our scope.  How ‘bout we limit it to :      \n1. Planet Earth, and  2. all of Human History ?",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ial8vr9",
                    "author": "MrRGnome",
                    "score": 2,
                    "created_utc": 1653945893.0,
                    "response": "Someone show me the sequel to this: Not all nodes matter only your node matters, and a node isn't a vote it's sovereignty. Number of nodes is as easily fabricated as spinning up an aws instance.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ialejck",
                            "author": "Fiach_Dubh",
                            "score": 1,
                            "created_utc": 1653948704.0,
                            "response": ">Number of nodes is as easily fabricated as spinning up an aws instance.\n\nhe did say this soon afterwards, but started down the shitcoin nodes rabbit hole, and thought it best to cut the clip short.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iakxumi",
                    "author": "ivodh",
                    "score": -1,
                    "created_utc": 1653940626.0,
                    "response": "So a POS chain with full node capabilities which are widely distributed provide the same amount of decentralisation? Is that what hes saying?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iakz7h1",
                            "author": "Fiach_Dubh",
                            "score": 7,
                            "created_utc": 1653941270.0,
                            "response": "no. not at all. \n\nPOS is a reproduction of the fiat system. the integrity of a POS system is for sale to whales.\n\nThe integrity of a POW system such as Bitcoin is not for sale.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "ial53zs",
                            "author": "putyograsseson",
                            "score": 4,
                            "created_utc": 1653944075.0,
                            "response": "afaik there isn’t a single POS chain that allows their nodes to run on 100 dollar hardware like Bitcoin does",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "ial4qkw",
                            "author": "MrRGnome",
                            "score": 2,
                            "created_utc": 1653943897.0,
                            "response": "You can have any number of people contributing to anything in a way they control and have it be decentralized. DHT torrents are decentralized. Ad hoc community organizations are decentralized. But just like how miners are not responsible for our properties of decentralization, they are responsible for our properties of economic security. The problem with PoS is it does not fulfill the role of economic security or decentralization. The economic security is locked in at whatever the cheapest price to acquire a minority stake ever was and 99% of shitcoins conflate the roles of nodes and miners/pos, or node and light client. The resource management is so poor in shitcoins that only a few full nodes ever run and the few validators serving all these users become the protocol.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "ialh9nd",
                            "author": "bbasara007",
                            "score": 2,
                            "created_utc": 1653950062.0,
                            "response": "a POS chain is a few whales that own 40% of the network deciding what happens to it (look how do kwon abused luna). POW is a few whales that own 40% of the network that cant decide shit that happens to it and cant change a single fucking thing about it no matter how much bitcoin they own. \n\nkeep buying your shitcoins.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iald7gq",
                    "author": "coin-drone",
                    "score": 1,
                    "created_utc": 1653948044.0,
                    "response": "How much average data does a full node use per month?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ialemg6",
                            "author": "Fiach_Dubh",
                            "score": 1,
                            "created_utc": 1653948748.0,
                            "response": "depends on how many peers you are connected to, you can configure the node to connect to a few or lots of peers. your choice.\n\nthe initial download of all the data is just under 400GB though. afterwards, it's not that much data per month.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iambhqf",
                    "author": "CoHemperor",
                    "score": 1,
                    "created_utc": 1653965655.0,
                    "response": "That was a great explanation",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iamfriu",
                    "author": "gubatron",
                    "score": 1,
                    "created_utc": 1653968085.0,
                    "response": "good luck getting any blocks without miners...",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iamioia",
                    "author": "bodhi_rio",
                    "score": 1,
                    "created_utc": 1653969880.0,
                    "response": "That’s awesome. Bitcoin is a such a neat and sophisticated system that it’s mind boggling how revolutionary it really is.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iakyehc",
                    "author": "JSeol360",
                    "score": -1,
                    "created_utc": 1653940885.0,
                    "response": "Why does this guy always ramble on and on when he can literally ask his question in less than 2 seconds",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "v13urp",
            "title": "Inflation in Germany hits 70 years high",
            "url": "https://www.forbes.com/sites/simonconstable/2022/05/30/highest-german-inflation-in-70-years--to-prompt-hike-in-euro-borrowing-costs/?sh=35d58b2f5922",
            "author": "bitsteiner",
            "created_utc": 1653927765.0,
            "score": 267,
            "num_comments": 99,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "iakmol9",
                    "author": "vitalyevodin",
                    "score": 40,
                    "created_utc": 1653935421.0,
                    "response": "“it will come, in due course”",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iakr46q",
                            "author": "__Error404",
                            "score": 17,
                            "created_utc": 1653937459.0,
                            "response": "Man that was eerie when she said that...implying inflation will just vanish and fix itself eventually",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iakrtkn",
                                    "author": "vitalyevodin",
                                    "score": 12,
                                    "created_utc": 1653937793.0,
                                    "response": "why do you think about, you know, all this inflation and all economical stuff that destroy your saving if you just can invest your money in “love and confidence”",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iam4eom",
                                            "author": "irResist",
                                            "score": 6,
                                            "created_utc": 1653961951.0,
                                            "response": "when you are rich all you need is love and confidence, lol",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "iamme6w",
                                    "author": "Prelsidio",
                                    "score": 6,
                                    "created_utc": 1653972316.0,
                                    "response": "That lady gives Cruela vibes.\n\nThe previous one was an abuser.\n\nThey sure know how to pick them.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "iakr07k",
                            "author": "lessioa",
                            "score": 2,
                            "created_utc": 1653937407.0,
                            "response": "Yah",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iamv2vj",
                            "author": "Starkgaryen69",
                            "score": 1,
                            "created_utc": 1653978746.0,
                            "response": "“Yahh.”",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iakkq35",
                    "author": "GodBlessYouNow",
                    "score": 14,
                    "created_utc": 1653934540.0,
                    "response": "Poor  regular folks",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iak6l41",
                    "author": "coinfeeds-bot",
                    "score": 12,
                    "created_utc": 1653928253.0,
                    "response": "tldr; Germany registered consumer price inflation at 7.9%, the highest level since 1952, the year Britain’s Queen Elizabeth II took the throne. The inflationary jump of 0.5% from the previously reading, was primarily down to surging energy and food cost increases, according to a recent report from Capital Economics. This will likely lead the way to far higher borrowing costs for euro borrowers, the report added.\n\n*This summary is auto generated by a bot and not meant to replace reading the original article. As always, DYOR.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaktcuz",
                    "author": "Sonjariffic",
                    "score": 7,
                    "created_utc": 1653938513.0,
                    "response": "They can take my buying power, but they can’t take mah cryptooooo.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iak7n1t",
                    "author": "New_Dawn",
                    "score": 58,
                    "created_utc": 1653928715.0,
                    "response": "Fiat collapsing in front of our eye balls.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iakc1ic",
                            "author": "Walla_Walla_26",
                            "score": 15,
                            "created_utc": 1653930657.0,
                            "response": "Ukrainians converted a good amount of savings to crypto currency when the war started. Fiat is great if there’s a bank to go to for redemption. If not…",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iakzj5s",
                                    "author": "Jezzes",
                                    "score": 28,
                                    "created_utc": 1653941427.0,
                                    "response": "I knew Bitcoinization would not be something fun to watch.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ialahu1",
                                            "author": "hemzer",
                                            "score": 4,
                                            "created_utc": 1653946687.0,
                                            "response": "it is sad..but it seems to the masses learn by their own pain.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ian5w19",
                                                    "author": "bigLeafTree",
                                                    "score": 1,
                                                    "created_utc": 1653988359.0,
                                                    "response": "Im not sure they learn the right lessons thou. Most support war, and defend lockdowns, which are the root cause of the inflation. And they blame the rich for all the problems.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "ial4r2m",
                                            "author": "Walla_Walla_26",
                                            "score": 4,
                                            "created_utc": 1653943904.0,
                                            "response": "Sucks that the pressure cooker is war",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "ian0578",
                                    "author": "cocoabeachbrews",
                                    "score": 1,
                                    "created_utc": 1653983103.0,
                                    "response": "Imagine being a Ukrainian refuge who converted everything they could sell into Bitcoin before fleeing about 2 years from now when the next halving cycle kicks off.   Hope they HODL some of it!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "ial6odt",
                            "author": "BritishBoyRZ",
                            "score": 4,
                            "created_utc": 1653944821.0,
                            "response": "Lol not really, I love BTC but people in this sub are way too quick to jump to extreme conclusions\n\nGermany is at the most acute end of the inflation knife when it comes to input prices given the scale of their reliance on external gas/oil/power.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "ial7b1a",
                            "author": "daarhi",
                            "score": 3,
                            "created_utc": 1653945125.0,
                            "response": "Btc is good and all but can’t claim victory for it when btc itself is collapsing.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iam2ktw",
                                    "author": "Doc_1200_GO",
                                    "score": 2,
                                    "created_utc": 1653961025.0,
                                    "response": "Exactly the only thing collapsing faster than fiat is crypto.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "ial02p5",
                            "author": "JambonBeurreMidi",
                            "score": 2,
                            "created_utc": 1653941690.0,
                            "response": "while fiat is doomed to fail, what they mean by inflation is inflation of prices I believe, not inflation as we know it\n\nprice can increase without money getting devalued\n\nthis is misleading, it's not inflation, it's consumer goods increasing in price (even though the root cause is inflation)\n\nthis isn't fiat collapsing, even though it is collapsing, it's very slow",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ial8vjj",
                                    "author": "Western_Boris",
                                    "score": 0,
                                    "created_utc": 1653945890.0,
                                    "response": "Without inflation price of everything would be going cheaper as the human kind becomes more and more effective producing stuff like food and products. Automation etc you know.\n\nInflation by money printing is the thing ruining our purchasing power and making everything cost more. Faster than our paychecks grow. And destroying the planet on the way because of overspending inflation is encouraging.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ialekdi",
                                            "author": "sleeknub",
                                            "score": 0,
                                            "created_utc": 1653948718.0,
                                            "response": "You are making that guy’s point.  The reason prices are going up so much in Germany right now (relative to other places) is because they have just become much less effective at producing stuff, partially by choice and partially due to war.\n\nThere is real inflation going on too, but when you artificially decide to cut off a resource or a war artificially creates scarcity, that can cause prices to go up because it actually costs more in real terms to make stuff.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ialhhyf",
                                                    "author": "Western_Boris",
                                                    "score": -1,
                                                    "created_utc": 1653950177.0,
                                                    "response": "That is incorrect. Germans are not all human kind and human kind is not becoming suddenly less effective on manufacturing products.\n\nWar does not change that. Sure war is pushing some prices up but the inflation by printing more and more money is what I am talking here. It happens all the time, with war and without war.\n\nManufacturing products comes cheaper and cheaper because we learn to make it more effective but prices go up all the time because our money system is inflationary by design.  We just create (well the central banks create) more and more money which makes every dollar and euro become worth less and less, thus the price of items grow.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "ialjl2y",
                                                            "author": "sleeknub",
                                                            "score": 0,
                                                            "created_utc": 1653951242.0,
                                                            "response": "That’s great that you can recognize that Germans are not all human kind, but this post is about Germany.  The extreme inflation in Germany, in excess of what is going on around the world, is due to war and choices that make them less effective at manufacturing.  That is true for some of the inflation in the rest of the world right now too.  By the way, war absolutely can make a country suddenly less effective at manufacturing products.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "ialk9ts",
                                                                    "author": "Western_Boris",
                                                                    "score": -1,
                                                                    "created_utc": 1653951594.0,
                                                                    "response": "You sir do not seem to understand me so I'm not gonna spend more time with you. Maybe someday you will understand when someone else says the same thing I told you. Good luck.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "iallob0",
                                                                            "author": "sleeknub",
                                                                            "score": 1,
                                                                            "created_utc": 1653952310.0,
                                                                            "response": "Lol.  I understand perfectly. You don’t seem to understand the point being made.  This is a post about Germany.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "iana61r",
                            "author": "Irrelesmoke",
                            "score": 1,
                            "created_utc": 1653992163.0,
                            "response": "That's right and that's why we need Bitcoin right now man.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iake9ys",
                    "author": "northernedge24",
                    "score": 24,
                    "created_utc": 1653931641.0,
                    "response": "Nah, it's....... TRANSITORY 😜",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iakml4c",
                            "author": "dantebayer",
                            "score": 11,
                            "created_utc": 1653935379.0,
                            "response": "Sure 7% inflation may be transitory but if we get 2-3 years of 7% inflation and then back to normal 1-2% inflation its not like anything got cheaper",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iakxw0u",
                                    "author": "Bottommount",
                                    "score": 11,
                                    "created_utc": 1653940644.0,
                                    "response": "Yeah, it never transits in reverse",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "iali9vc",
                                    "author": "CryptoBehemoth",
                                    "score": 3,
                                    "created_utc": 1653950569.0,
                                    "response": "It's transitory towards more inflation",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "iakofls",
                                    "author": "TopTierTuna",
                                    "score": 4,
                                    "created_utc": 1653936215.0,
                                    "response": "7% is only transitory on its way to 8%.  8% is transitory on its way to 9%.  Etc.  That's what they meant by transitory.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iakub03",
                                            "author": "Bedroom-Eastern",
                                            "score": 1,
                                            "created_utc": 1653938958.0,
                                            "response": "Some ECB people said this i think.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "iamezgn",
                                    "author": "Dont_Say_No_to_Panda",
                                    "score": 1,
                                    "created_utc": 1653967628.0,
                                    "response": "Look up the last time we were in a deflationary environment, what was that like? And the time before that.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ialac49",
                    "author": "hemzer",
                    "score": 5,
                    "created_utc": 1653946607.0,
                    "response": "Transitory ......    \nrelax have a pilsner...  \nlook the other way, there's some bread and circus over there.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ial9jn6",
                    "author": "psysc0rpi0n",
                    "score": 3,
                    "created_utc": 1653946219.0,
                    "response": "War is perfect to excuse inflation. Don't worry.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ialcxfl",
                    "author": "sebikun",
                    "score": 5,
                    "created_utc": 1653947904.0,
                    "response": "Don't worry ECB president Lagarde will handle it. Just trust her!\n\nhttps://www.theguardian.com/world/2016/dec/19/christine-lagarde-avoids-sentence-despite-guilty-verdict-in-negligence-trial#:~:text=Christine%20Lagarde%20has%20been%20found,but%20avoided%20a%20jail%20sentence.\n\n\nOnly trust never verify!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ialistd",
                    "author": "YoCantChangeYourName",
                    "score": 5,
                    "created_utc": 1653950840.0,
                    "response": "We know what happend last time....",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iak7kbr",
                    "author": "JMBBZ",
                    "score": 6,
                    "created_utc": 1653928681.0,
                    "response": "At least the ECB is contemplating to ditch those idiot negative rates",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iakbudy",
                            "author": "Walla_Walla_26",
                            "score": 4,
                            "created_utc": 1653930569.0,
                            "response": "Rates were not designed to go negative but what the hell why not",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iakxk8z",
                                    "author": "JMBBZ",
                                    "score": 2,
                                    "created_utc": 1653940489.0,
                                    "response": "Tell me all about it……:(",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ial00dr",
                                            "author": "Walla_Walla_26",
                                            "score": 2,
                                            "created_utc": 1653941659.0,
                                            "response": "It’s an interesting tool they have and started applying negative rates around the 08-09 financial crisis. Just read up a little and did not know that Switzerland did this in the 70’s to combat currency appreciation",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iakuqg2",
                    "author": "Responsible-Olive879",
                    "score": 3,
                    "created_utc": 1653939160.0,
                    "response": "Germany be taking it up its tail pipe for the metropole across the Atlantic,as predicted.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iakz4iq",
                    "author": "Altruistic_Baker_423",
                    "score": 3,
                    "created_utc": 1653941229.0,
                    "response": "This is how hyperbitcoinization accelerated in 2022…",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iakqgl5",
                    "author": "Constant-Ad9398",
                    "score": 6,
                    "created_utc": 1653937150.0,
                    "response": "How the fiat system is still operating is beyond me",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iakxh7a",
                            "author": "thefullmcnulty",
                            "score": 3,
                            "created_utc": 1653940449.0,
                            "response": "Exponential technologies have offset the fiat collapse but it is all coming to an end. \n\nI personally think CBDC’s will be the pivot when legacy fiat systems collapse. It will just be more of the same. \n\nSo thankful for bitcoin.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iakxbje",
                            "author": "ElephantsAreHeavy",
                            "score": 5,
                            "created_utc": 1653940374.0,
                            "response": "Never underestimate the stupidity of people in large groups.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ial7v35",
                                    "author": "ZetZet",
                                    "score": 1,
                                    "created_utc": 1653945395.0,
                                    "response": "Okay, but how would Bitcoin help the situation?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ialic23",
                                            "author": "CryptoBehemoth",
                                            "score": 6,
                                            "created_utc": 1653950600.0,
                                            "response": "Because it takes power away from the group and gives it to individuals",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ialiscm",
                                                    "author": "ZetZet",
                                                    "score": 1,
                                                    "created_utc": 1653950833.0,
                                                    "response": "How does it do that? Why doesn't gold do that? Also how do you fix the simple issue of those who got in early? Will they be royalty now in the grand scheme of Bitcoin world saving?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iallmsc",
                                                            "author": "CryptoBehemoth",
                                                            "score": 4,
                                                            "created_utc": 1653952288.0,
                                                            "response": "Gold does not do that because if you have a lot of it, you need other people to help you use it. Whereas with Bitcoin, once you have a device capable of reading the blockchain and an Internet connection, you can pretty much do whatever you want with your money without anyone else getting involved. I believe this is the first tool in history to truly democratize economic sovereignty. It has the power to make us longer term thinkers, better at math and logical thinking. If anything, the royalty that will be born of Bitcoin will be the first true royalty.\n\nEdti: (lmao sorry for the grandiose tone, I'm reading Nietzsche these days :P)",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "ialxwq1",
                                                                    "author": "Constant_Mouse_1140",
                                                                    "score": 3,
                                                                    "created_utc": 1653958635.0,
                                                                    "response": "This is baffling - how are you talking about democratization and royalty in the same breath here? And economic sovereignty? What the hell - the concept of sovereignty, or supreme reign, or the supremacy of statehood or its rules, is the fundamental basis of “fiat” currency, which is to say, a currency backed by the reputation and good credit of the state. Jesus. I wish the people pushing for the end of the current monetary system understood it.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "iam8a3m",
                                                                            "author": "Explodicle",
                                                                            "score": 3,
                                                                            "created_utc": 1653963960.0,
                                                                            "response": "Semantically you're right. I think in context, \"democratize economic sovereignty\" means \"let ordinary people have a real say in how the economy works\", and \"true royalty\" refers to meritocracy (as opposed to divine right).\n\nBut on the other hand, do we expect this level of precision from people supporting the current monetary system?\n\n> It is well enough that people of the nation do not understand our banking and monetary system, for if they did, I believe there would be a revolution before tomorrow morning.\n\n- not Ford but I like the quote anyways",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "id": "ialn9p2",
                                                                    "author": "ZetZet",
                                                                    "score": -1,
                                                                    "created_utc": 1653953135.0,
                                                                    "response": ">you can pretty much do whatever you want with your money without anyone else getting involved\n\n\nfucking what? Money is a tool for exchanging value between two parties, you NEED another person to be involved, even if it's just one. \n\n\n>\nIt has the power to make us longer term thinkers, better at math and logical thinking.\n\n\nBitcoin religion?",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "iamayki",
                                                                            "author": "CryptoBehemoth",
                                                                            "score": 3,
                                                                            "created_utc": 1653965368.0,
                                                                            "response": "Money is a psychotechnology that has been molding our brains and us for millenia now. Bitcoin is the most refined form of money we have ever seen, and as gold has reigned supreme for thousands of years, so I see Bitcoin going off into the distant future. I believe it has the power to make people smarter by providing better evolutionary pressures on us, making our environment more conducive to the growth of healthy behaviours.\n\nAs for the first part of your comment, I meant to refer to the resistance to censorship of Bitcoin. That was poorly phrased, I admit.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iakuksn",
                    "author": "Generationhodl",
                    "score": 2,
                    "created_utc": 1653939086.0,
                    "response": "As long as fiat loses value, I see no limit on how high bitcoin can go. Wait till more and more banks try to buy bitcoin, will be some interesting years ahead when you own some Sats. I'm pretty sure a lot of people here are millionaires already without knowing.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iakxkb9",
                            "author": "ElephantsAreHeavy",
                            "score": 6,
                            "created_utc": 1653940490.0,
                            "response": "Bitcoin is seriously undervalued at the moment. Its real valuation (imho) lies currently between 250k and 500k. Yes, I pull these numbers out of my well-educated ass based on personal opinions and valuation on global socioeconomic events.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iam9nfg",
                                    "author": "Riker-Was-Here",
                                    "score": 1,
                                    "created_utc": 1653964674.0,
                                    "response": "You aren't wrong. The winklevii have predicted 500K per coin for a while now, and that is a conservative estimate.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ial039w",
                    "author": "CaptainAntwat",
                    "score": 2,
                    "created_utc": 1653941698.0,
                    "response": "And people in America think we’ve peaked in our inflation 😂 it’s like they see the prices increasing all around them but want so badly for the stock market to rally that they’ll tell themselves a lie",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ial4iq3",
                    "author": "ContWord2346",
                    "score": 2,
                    "created_utc": 1653943795.0,
                    "response": "For now.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iamljfu",
                            "author": "megasoso",
                            "score": 1,
                            "created_utc": 1653971746.0,
                            "response": "For the future, they should adopt Bitcoin, that would be good.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ialylhy",
                    "author": "Guest1019",
                    "score": 2,
                    "created_utc": 1653958982.0,
                    "response": "Wonder if their right wing is blaming Joe Biden ???",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iamnh8t",
                    "author": "Girryarty",
                    "score": 2,
                    "created_utc": 1653973056.0,
                    "response": "This is an indication that the economic system is unstable. People should protect themselves and their funds from inflation and invest usdt in bitcoin",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ian1byd",
                    "author": "Bitcoin__Hodler",
                    "score": 2,
                    "created_utc": 1653984179.0,
                    "response": ">Our forecast is for core inflation to remain above 2% throughout this year and next.\n\ngenius",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ialb9uj",
                    "author": "jeywgosjeb",
                    "score": 1,
                    "created_utc": 1653947075.0,
                    "response": "I’ll be the dumb one, I don’t understand how a fixed value currency can be good in a growing population. If population increases each year by 3% then in my mind you would need some sort of inflation to account for those new people",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ialrcmo",
                            "author": "cryptosareagirlsbf",
                            "score": 3,
                            "created_utc": 1653955270.0,
                            "response": "Not if you can divide your existing units of money into smaller units, all gradually increasing in value.\n\nAnd anyway, it's not like the newly printed money is handed out to the newly borns or the immigrants. It's put in wealthy people's pockets, and it's staying there.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iam28lp",
                                    "author": "jeywgosjeb",
                                    "score": 1,
                                    "created_utc": 1653960852.0,
                                    "response": "No but there’s more money in circulation. \n\nDividing money is the same as inflation though, and then you’ll just forever have smaller fractions - and you’ll have people like Michael saylor who would be the wealthiest person ever. Not sure if that works. I could be missing something though",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iam5c0m",
                                            "author": "cryptosareagirlsbf",
                                            "score": 1,
                                            "created_utc": 1653962431.0,
                                            "response": "I think you are confusing money with value. Value is the economic 'pie' we all get to share. Money is just how many slices you cut up that pie into. If I've earned a slice for myself, and instead of calling it a slice someone decides it's now called two halves or a hundred cents - I don't care, I've still got enough food, still got my two halves, and I'm happy for others to transact in halves instead of whole slices if that works for them. It's just different units for expressing the same value.\n\nBut if someone decides that suddenly we have to have more slices (print more money), and they've not changed the size of the economic pie (total value of products and services), my slice has to be smaller to accomodate the change. It's less value for the same unit of money now. My slice of the pie is suddenly only a half of a slice, even though I've earned a whole slice fair and square - and I do care about that, because that's theft and now I'm hungry and angry, and if I'm hungry enough, I may start a conflict or a revolution over it, and those tend to be unpleasant.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iami3qw",
                                                    "author": "jeywgosjeb",
                                                    "score": 3,
                                                    "created_utc": 1653969522.0,
                                                    "response": "That’s fair good break down",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "iamfjir",
                            "author": "Dont_Say_No_to_Panda",
                            "score": 2,
                            "created_utc": 1653967955.0,
                            "response": "Didn’t you hear? Elon says our population is deflationary because rich people aren’t having enough kids… checkmate libtards.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "ialx07j",
                            "author": "trufin2038",
                            "score": 1,
                            "created_utc": 1653958171.0,
                            "response": "Theft is never beneficial",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iala274",
                    "author": "JimBloc",
                    "score": 1,
                    "created_utc": 1653946472.0,
                    "response": "Well, personally I think Europe should support a proxy war in its own back yard, isolating it self from its energy and raw material supplies, pushing up manufacturing costs and living standards down, this should help with inflation and gdp.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iakbw1d",
                    "author": "VPNApe",
                    "score": -11,
                    "created_utc": 1653930590.0,
                    "response": "Can't wait until Europe's beloved socialist programs crumble when they have to spend more on military. Tired of the USA subsidizing the good life abroad.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iakx4gv",
                    "author": "ElephantsAreHeavy",
                    "score": 1,
                    "created_utc": 1653940283.0,
                    "response": "If my fiat gets inflated away, I will be fine. I have inflation-resistant investments, as well as bitcoin. Furthermore, I am looking for a new job, time to inflate my expected salary.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iamb3l4",
                    "author": "juno998",
                    "score": 1,
                    "created_utc": 1653965440.0,
                    "response": "This is going to happen with all the countries, we better prepare ourselves.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iamfzbq",
                    "author": "davescilken",
                    "score": 1,
                    "created_utc": 1653968214.0,
                    "response": "Bratcoin",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iamivnx",
                    "author": "tichou26",
                    "score": 1,
                    "created_utc": 1653970005.0,
                    "response": "I hope germans will understand that inflation is bad right now.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ian2idl",
                    "author": "Starfordo",
                    "score": 1,
                    "created_utc": 1653985260.0,
                    "response": "I hope their government will understand the importance of crypto.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ian6xo6",
                    "author": "gusbtc",
                    "score": 1,
                    "created_utc": 1653989331.0,
                    "response": "BTC is the best option for germany right now my brother.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ian7ddr",
                    "author": "patrickcoole",
                    "score": 1,
                    "created_utc": 1653989726.0,
                    "response": "They should adopt bitcoin now, it's the time for them man.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iana7w9",
                    "author": "DrDease",
                    "score": 1,
                    "created_utc": 1653992209.0,
                    "response": "And we all know what happened over 70 years ago…",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iakmg51",
                    "author": "dantebayer",
                    "score": -4,
                    "created_utc": 1653935319.0,
                    "response": "Is there anything the government told us it would solve, that it has actually solved?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iakxzf6",
                            "author": "ojedaforpresident",
                            "score": 6,
                            "created_utc": 1653940689.0,
                            "response": "You’ve never driven in Germany, taken public transport in Germany, our used any of their other public infrastructure, I imagine. \n\nI’m not here to defend either “side”, but this is just libertarian brain rot seeping into your Reddit comments.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ial2709",
                                    "author": "dantebayer",
                                    "score": -3,
                                    "created_utc": 1653942700.0,
                                    "response": "public infrastructure is a racket",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ial6le8",
                                            "author": "ojedaforpresident",
                                            "score": 3,
                                            "created_utc": 1653944782.0,
                                            "response": "Right. Brain rot.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ial92g4",
                                                    "author": "dantebayer",
                                                    "score": -4,
                                                    "created_utc": 1653945985.0,
                                                    "response": "the opposite. government is a term designed to make your brain rot",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "iamq08g",
                                            "author": "megabazz",
                                            "score": 1,
                                            "created_utc": 1653974831.0,
                                            "response": "You do know private companies build that public infrastructure right? Isn’t that the trickle down and job creation you guys want?",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iakvf7u",
                    "author": "errlu",
                    "score": -2,
                    "created_utc": 1653939485.0,
                    "response": "Oho. WWIII incoming. Germans are like locusts, but instead of crowding, they react to inflation.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iakxp5z",
                            "author": "ElephantsAreHeavy",
                            "score": 5,
                            "created_utc": 1653940555.0,
                            "response": "Actually... Inflation was a consequence.... Anyway... Germany is not even the worst when it comes to inflation in the eurozone. Not by a long shot.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iakyi11",
                                    "author": "errlu",
                                    "score": 2,
                                    "created_utc": 1653940932.0,
                                    "response": "Ofc not. They are the ones who control the europrinter, everyone in Eurozone is getting fucked by them, they suffer the least.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iaku2dg",
                    "author": "Bedroom-Eastern",
                    "score": -2,
                    "created_utc": 1653938845.0,
                    "response": "Germany loves inflation.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ializy5",
                            "author": "NakamotoScheme",
                            "score": 5,
                            "created_utc": 1653950942.0,
                            "response": "No, they don't.\n\n*The Bundesbank was greatly respected for its control of inflation through the second half of the 20th century. This made the German Mark one of the most respected currencies, and the Bundesbank gained substantial indirect influence in many European countries.*\n\nSource: [https://en.wikipedia.org/wiki/Deutsche\\_Bundesbank](https://en.wikipedia.org/wiki/Deutsche_Bundesbank)",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iamda4z",
                    "author": "RogueR1",
                    "score": 0,
                    "created_utc": 1653966643.0,
                    "response": "I'm afraid the world markets are going to shit themselves. Only way out of these situations are bigger conflict like war. Geopolitics etc. Restructuring of power",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}