{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uxbunu",
            "title": "My cryptocurrency portfolio",
            "url": "https://v.redd.it/vh128zirok191",
            "author": "Dimmao_meme",
            "created_utc": 1653462964.0,
            "score": 11,
            "num_comments": 4,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9wqs6w",
                    "author": "DmitryMate",
                    "score": 1,
                    "created_utc": 1653463744.0,
                    "response": "All jokes aside. I don't see any way the hamster got into this situation without human help",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9wqxfh",
                            "author": "ivgur",
                            "score": 1,
                            "created_utc": 1653463870.0,
                            "response": "\"influencers\" promoting coins seems like the same thing😂",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9wrfe7",
                            "author": "HungryLikeTheWolf99",
                            "score": 1,
                            "created_utc": 1653464304.0,
                            "response": "Not to mention, /r/donthelpjustfilm",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9wpzbu",
                    "author": "Puzzleface62",
                    "score": 1,
                    "created_utc": 1653463073.0,
                    "response": "At least he finally figured it out.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uxbthu",
            "title": "Seeing Bitcoin as property",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uxbthu/seeing_bitcoin_as_property/",
            "author": "LuKeNuKuM",
            "created_utc": 1653462827.0,
            "score": 54,
            "num_comments": 25,
            "subreddit": "Bitcoin",
            "selftext": "I've been listening and watching a fair bit of Michael Saylor's interviews and yesterday it really hit home what he was saying about Bitcoin being property; the penny dropped. I'd heard him say it previously but it hadn't truly registered with me. It makes perfect sense and when people talk of 'investing' in BTC this can be confused with investing in stocks and shares and other assets such as gold or real estate.\n\nYou literally own a thing, it's in your hands but you don't have all the crap that comes with it.\n\nIn the case of real estate you don't have to factor in future costs of maintenance or unexpected fees. You don't need insurance like you might for a piece of art or bottles of wine. You don't have high ongoing security costs like you would with gold. You don't have to rely on a bunch of company directors making wise decisions for your investment share to become more valuable. You don't have to worry that your fund manager is picking the right stocks at the right time. \n\nAll these sorts of investments cost you either financially or mentally over time and this is often incalculable and unknown. This will eat away at your investment and is often lost when you're trying to work out the value.\n\nIf you're confident in Bitcoin then you own the perfect property. Everything has a risk but to me is clear that you can dodge all those other risks by holding BTC.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9wqnjo",
                    "author": "CoinCorner_Sam",
                    "score": 20,
                    "created_utc": 1653463635.0,
                    "response": "> In the case of real estate you don't have to factor in future costs of maintenance or unexpected fees.\n\nAlso in the case of real estate, to make it more valuable, you're the one paying for the upgrades. In case of Bitcoin, the success is shared by everyone. If some coder, living in Argentina, Nigeria or Thailand, makes Bitcoin somehow better (new type of wallet, Layer, etc), we all will benefit from it. In case of the upgraded property, it's only its owner.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9wsi2u",
                            "author": "LuKeNuKuM",
                            "score": 6,
                            "created_utc": 1653465261.0,
                            "response": "Good point! Yet another thing I don't need to worry about.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9x7wgb",
                                    "author": "erefernow",
                                    "score": 5,
                                    "created_utc": 1653478040.0,
                                    "response": "Real estate also has annual property taxes and insurance.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9xvour",
                            "author": "dantebayer",
                            "score": 5,
                            "created_utc": 1653489865.0,
                            "response": "Allow me to retort. If a house owner upgrades his property the neighborhood benefits ever so slightly in a number of ways. For example abandoned properties drag down the property value in the neighborhood and also increases the burden for plumbing/internet/electricity/road infrastructure because it shared by one less person.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "ia09t1r",
                            "author": "Aggravating_Line9021",
                            "score": 1,
                            "created_utc": 1653525759.0,
                            "response": "You got this exactly wrong; BTC cannot be considered property because there is no underlying value. A house is a house, a company has products and customers, BTC has nothing that drives value…..",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9wq40h",
                    "author": "Into_The_Wilderness1",
                    "score": 7,
                    "created_utc": 1653463181.0,
                    "response": "It's a huge point that is often missed. A security will be treated much differently from property, and the risk you take with the former is possibly harsher regulation, as well as having to rely on a \"company\" to deliver value and drive growth of the project.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9wt2x6",
                            "author": "LuKeNuKuM",
                            "score": 4,
                            "created_utc": 1653465774.0,
                            "response": "That's it, it's out of your hands. Whilst I originally saw bitcoin as an investment I now see it as a perfect way to just save what I've earned. It's a distinction I hadn't really tuned into and even more of a reason to hodl.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9wyv9l",
                    "author": "Mektzer",
                    "score": 7,
                    "created_utc": 1653471040.0,
                    "response": "Many people have been criticizing bitcoin for being digital. \"It's nothing, just digital numbers, It has no tangible value.\" They did the same with the internet at the time. One day they will realize that bitcoin being digital is its biggest strenght.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9x14w6",
                            "author": "LuKeNuKuM",
                            "score": 3,
                            "created_utc": 1653473010.0,
                            "response": "I agree, a thing just has a value assigned to it by the person looking at it and there's infinite variables they will use to calculate it's perceived value. The universe doesn't care about value but people do and when they eventually work out that bitcoin is a great way to hold value they can convert it to something tangible when they need to.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9wrfts",
                    "author": "johnathondeaux",
                    "score": 11,
                    "created_utc": 1653464315.0,
                    "response": "It's actually worse than that in the case of real estate and gold, in the UK and presumably in other places, even when you own a home outright, the queen owns the land it is built on and so can seize it for any reason at any time such as what happened during d-day in 1944 when people's homes were used to house troops waiting to cross the channel.\n\nGold can similarly be seized like what happened in the 1910s (correct me if wrong year) in the US when they outlawed owning gold or buying gold.\n\nBTC cannot be seized unless you give away your seed phrase, BTC is the first and the only true property because nobody can sieze it from you unless you allow them to do so.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9wsm6n",
                            "author": "LuKeNuKuM",
                            "score": 7,
                            "created_utc": 1653465365.0,
                            "response": "Yes precisely, I'd forgotten about underlying leases. I didn't realise there was that sort of power to be able to reclaim your own property, scary stuff.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9xwhfw",
                            "author": "DesignerAccount",
                            "score": 2,
                            "created_utc": 1653490187.0,
                            "response": ">It's actually worse than that in the case of real estate and gold, in the UK and presumably in other places, even when you own a home outright, the queen owns the land it is built on and so can seize it for any reason at any time such as what happened during d-day in 1944 when people's homes were used to house troops waiting to cross the channel.\n\nNot if it's freehold, I believe she cannot. My understanding is there were discussions in the Lords for each piece of land sold by the Queen as freehold to be, but once approved, she doesn't actually own it anymore. She still owns most of it, but a freehold house you own the lot, stock and barrel.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9yoslp",
                    "author": "Minticecream123",
                    "score": 2,
                    "created_utc": 1653501318.0,
                    "response": "Bitcoin is a fantastic asset; immutable, digital, liquid, private, incredible returns in its limited history.  However it’s not something that pays you every month to own.  Every asset has its own risks associated.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9zpsyg",
                            "author": "sheepywolf",
                            "score": 1,
                            "created_utc": 1653516437.0,
                            "response": "Well said",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9wsu8e",
                    "author": "Crawlero",
                    "score": 3,
                    "created_utc": 1653465569.0,
                    "response": "Right.  Now ask yourself what the meaning of your life is, knowing your current actions will effect not only your current life, but potentially the lives of your grandchildren.  Are you not worth more than a bag of bones, when the product of your labor and decisions carries forward after you?  Are you still around in some way?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9wtle9",
                            "author": "LuKeNuKuM",
                            "score": 1,
                            "created_utc": 1653466243.0,
                            "response": "To leave something for your descendants is a great aspiration but I think it also relies on the person passing the wisdom down with the treasure. So many people have stories of how some historic fortune in their family was lost to unwise investments, gambling or alcohol. I'm making a note of that! thanks.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9ygv8n",
                    "author": "vember_94",
                    "score": 2,
                    "created_utc": 1653498228.0,
                    "response": "I can live and raise a family inside bitcoin? Nice! Now I see it’s value!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9yzf2j",
                            "author": "donmulatito",
                            "score": 1,
                            "created_utc": 1653505497.0,
                            "response": "Your home is great, but you don't need more that one to live in.. there are trillions of dollars of real estate that is that is owned simply for the preservation of wealth. From small mom & pop investors to 10-100+ million dollar properties that the buyer never steps foot in simply because there is no better place to stick their money.\n\nSo the case for bitcoin as property is that it could be a more liquid, more sovereign investment where enormous amounts of capital can be stored that cannot be eroded away over time by insurance, tax, maintenance costs, decay etc.\n\nIts a hard one to get your head around at the beginning (especially if you are not tasked with preserving large amounts of capital)  but I do believe this will be a big part of the paradigm shift that grows BTC adoption, especially among the ultra wealthy and institutions.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9zpitw",
                                    "author": "sheepywolf",
                                    "score": 1,
                                    "created_utc": 1653516314.0,
                                    "response": "Well, when you do manage large amount of capital and want to secure it, spreading your risk across different assets is the way. Aside from that, brick and mortar has an underlying value, and property has a long and proven track of being a relatively safe investment. Perhaps seeing bitcoin as property is hard to wrap your head because it's not a good comparison. Bitcoin may well have a bigger upside, but let's not pretend it isn't a much more risky asset to put your money in.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia03szc",
                                            "author": "donmulatito",
                                            "score": 1,
                                            "created_utc": 1653522934.0,
                                            "response": "Nobody ever said it would be the only thing that anyone will ever invest it.  If BTC consumed only 10% of Stocks, bonds and real estate that would be a BTC well over 1 Million. \n\nAt current conditions, yes maybe you could consider BTC more volatile than real estate but the idea is as the market matures(as all markets do) the volatility will decrease. Also, maybe you don't recall just 14 years ago real estate prices dropped 50-80% just about everywhere in the US and took a decade to recover.. and you would still have to pay all the taxes and expenses on top of that and be subject to any regulations of zoning, rent control, etc. \n\nThey can always make more brick and mortar. There will only be 21 Million BTC.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9x94x4",
                    "author": "klauskinski79",
                    "score": 1,
                    "created_utc": 1653478828.0,
                    "response": "Sure but the point is “if you are confident in Bitcoin” is not the whole point. The question is “if everybody is confident in bitcoin”. Otherwise you just own some random numbers. To be fair this is not too different from art or gold where the uses like “making an apartment prettier and impressing guests” is kinda thin but well it is at least harder to duplicate than crypto with its 5000000 coins. So you need to be confident that humanity will decide that YOUR coin is valuable and not the 49999999 other ones.\n\nI think I agree that bitcoin seems to have the best chances. It is stable, no scammy founder is in control, supply is limited, it has great mindshare and survived a lot of crashes. \n\nI just am pretty sceptical about Saylor. Yes he is the boss of a large and pretty successful company but a lot of the stuff he says about bitcoin is just nonsensical bullshit. One time I watched an interview where he compared bitcoin mining to “accumulating energy”. Which is absolute bullshit since it doesn’t really matter for bitcoin how many mathematical riddles you solved. There is no energy to be accumulated but it sounded cool. It seems to me he just will say anything and everything that sounds cool so tons of people invest in bitcoin and make his investment bigger. I mean fair play to him but …",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9xi2hu",
                    "author": "No_Release6675",
                    "score": 1,
                    "created_utc": 1653483764.0,
                    "response": "Well said",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9yiqri",
                    "author": "Keith_Kong",
                    "score": 1,
                    "created_utc": 1653498964.0,
                    "response": "It's more a statement on the current laws around Bitcoin than it is a statement about the technology and nature of Bitcoin itself. The way it's taxed and the current state of adoption makes it *behave* like property. But in the future it may become larger, less volatile, and the capital gains tax could be removed. It would then stop behaving like property and instead would act as capital.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia099a5",
                    "author": "Creed_____Bratton",
                    "score": 1,
                    "created_utc": 1653525502.0,
                    "response": ">You don't need insurance like you might for a piece of art or bottles of wine. You don't have high ongoing security costs like you would with gold. You don't have to rely on a bunch of company directors making wise decisions for your investment share to become more valuable. You don't have to worry that your fund manager is picking the right stocks at the right time. \n\nCorrect me if I wrong, but don't a small number of wallets own an incredible number of coins?  Do you have to worry about them deciding to cash out and implode the price? Honest question",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uxbnqw",
            "title": "Bitcoin in El Salvador - Part 2 with Nayib Bukele — What Bitcoin Did",
            "url": "https://www.whatbitcoindid.com/podcast/bitcoin-in-el-salvador-part-2",
            "author": "mccormack555",
            "created_utc": 1653462135.0,
            "score": 36,
            "num_comments": 2,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9wrko3",
                    "author": "vinceforcalifornia",
                    "score": 1,
                    "created_utc": 1653464433.0,
                    "response": "Was part 1 the June 23 2021 episode?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia1kelo",
                    "author": "Beautiful_Finger_451",
                    "score": 1,
                    "created_utc": 1653554753.0,
                    "response": "With Bitcoin dropping in price, it’s cheaper for him to buy more, and more costly for people that own it to now have to sell it, but after the global depression, things will resume and bitcoin will suck up more attention and value.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}