{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uwig3a",
            "title": "Typical average understanding of market dynamics.",
            "url": "https://www.reddit.com/r/malaysia/comments/uvyeq8/makna_inflasi_sebenarnya/i9rp8an/?utm_source=share&utm_medium=ios_app&utm_name=iossmf&context=3",
            "author": "FutureNotBleak",
            "created_utc": 1653365776.0,
            "score": 6,
            "num_comments": 15,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9s3t7z",
                    "author": "igadjeed",
                    "score": 1,
                    "created_utc": 1653375570.0,
                    "response": "Fiat inflation is not relevant to Bitcoin",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9s4dhq",
                            "author": "FutureNotBleak",
                            "score": 1,
                            "created_utc": 1653376050.0,
                            "response": "It’s relevant to the people who hold Bitcoin. Look I’m all in on Bitcoin but I don’t bury my head in the sand like an ostrich. Don’t be a parrot.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9rqleh",
                    "author": "FutureNotBleak",
                    "score": 0,
                    "created_utc": 1653365839.0,
                    "response": "This is what that Reddit user said: \n\nStart quote. \n\nYou've oversimplified things -\n\nMoney supply as a factor of inflation is only part (and a small part in the case of most countries except the monetary pariahs like el Salvador, Zimbabwe, etc) of the picture. Another consideration is the change in the 'typical basket' of goods that we've come to purchase that has changed over time, and the ability of an economy to produce good and services over time and whether or not that has slowed / increased relative to the demand/ increase in standards of living. There are of course many other considerations.\n\nYou can't just pin it to \"printing money\", the so called direct costs to an increase in money supply is called seignorage and if you look it up the actual impact as a proportion to gdp is relatively tiny in most countries.\n\nBesides, a healthy amount of inflation (1-4% or depending on the country) is necessary for an economy to thrive.\n\nIf you consider the opposite case, where suppose we have a monetary system where we cannot expand the money supply, the implications are far worse. Goods and services will be deflationary since an economy always produces more but you only have fixed currency in circulation. This incentivices postponing spending and investment perpetually, leading to a deflationary spiral. You remove the ability for central banks to respond to shocks, leading to more volatile swings and longer recessions and crises when they do happen (and they will always happen). Flexible MS is a policy tool and is a very beneficial one.\n\nEnd quote.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9rqss9",
                            "author": "Swimming_Ad2716",
                            "score": 2,
                            "created_utc": 1653365967.0,
                            "response": "That’s pretty good as a summary, what’s the issue here?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9rqwhu",
                                    "author": "FutureNotBleak",
                                    "score": 1,
                                    "created_utc": 1653366028.0,
                                    "response": "Money printing is the problem, not the solution. Many “educated” people still think money printing is the solution.\n\nAlso, they think inflation is necessary/healthy.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9rrh29",
                                            "author": "Swimming_Ad2716",
                                            "score": -1,
                                            "created_utc": 1653366381.0,
                                            "response": "Oh man. Have you looked into econ theory at all?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9rrji7",
                                                    "author": "FutureNotBleak",
                                                    "score": 2,
                                                    "created_utc": 1653366424.0,
                                                    "response": "So you think inflation is a good thing?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9rrxfd",
                                                            "author": "Swimming_Ad2716",
                                                            "score": -1,
                                                            "created_utc": 1653366666.0,
                                                            "response": "I mean, there are other issues with your post. All fiat is “printed” (actually not physically, most money is just created electronically), so without printing, there wouldn’t be any money.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9rs28q",
                                                                    "author": "FutureNotBleak",
                                                                    "score": 0,
                                                                    "created_utc": 1653366751.0,
                                                                    "response": "All “money” in the current system is debt.\n\nAlso, why do you choose Bitcoin?",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9rsadr",
                                                                            "author": "Swimming_Ad2716",
                                                                            "score": -1,
                                                                            "created_utc": 1653366897.0,
                                                                            "response": "I like the adrenaline of the market volatility.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9s1ouw",
                                            "author": "Dont_Say_No_to_Panda",
                                            "score": 1,
                                            "created_utc": 1653373810.0,
                                            "response": "Can you explain what part of the last paragraph is incorrect?\n\nBtw, it’s concerning that every “money printer go brrr” poster like yourself never seems to acknowledge that the Fed removes money from circulation all of the time also.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9s4ptt",
                                                    "author": "FutureNotBleak",
                                                    "score": 1,
                                                    "created_utc": 1653376346.0,
                                                    "response": "So yes, the fed has done QT in the past. No arguments on that. At the same time, have you seen their balance sheet?",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i9s4zen",
                                                    "author": "PerformanceVarious45",
                                                    "score": 1,
                                                    "created_utc": 1653376583.0,
                                                    "response": "The FED can't just steal money from circulation like you and a few others ive seen now are claiming as \"fiat burning\". Someone owns that money that was printed and it can't simply be erased. The FED can only sell bonds and take in that money, but a bond will eventually need to be paid out and that money will have to be printed.\n\nMarket manipulation is the real problem.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9s3s4u",
                                            "author": "igadjeed",
                                            "score": 1,
                                            "created_utc": 1653375543.0,
                                            "response": "> Money printing is the problem\n\nIt's not. Even in Zimbabwe, the problem was that government policy not respecting property ownership led to workers withdrawing their labor from the mainstream economy. There was a collapse in tax revenue and the government could not pay its own workers. They printed money to be able to pay police, army and bureaucrats. Hyperinflation followed  \n\nElsewhere, there's no money printing. Economic stimulation issues bonds to borrow money to distribute into the economy. A bond is a debt instrument. It does not cause inflation",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9s4aui",
                                                    "author": "FutureNotBleak",
                                                    "score": 1,
                                                    "created_utc": 1653375983.0,
                                                    "response": "If you say so.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}