{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uqpaiu",
            "title": "When my friends say \" Bitcoin and cryptocurrencies Are Scam\" if i could do this i do. Idiots 🤣. still in 19 century",
            "url": "https://i.redd.it/p5wlu2qk6sz81.jpg",
            "author": "AggressiveAwareness2",
            "created_utc": 1652681999.0,
            "score": 52,
            "num_comments": 29,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8srslm",
                    "author": "aj2704",
                    "score": 10,
                    "created_utc": 1652691589.0,
                    "response": "It can't actually go to zero. Someone would always be willing to pay a dollar for it. At least that much.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8stu06",
                    "author": "The_Estranger_0001",
                    "score": 3,
                    "created_utc": 1652693454.0,
                    "response": "That brain is as good as new! 100% unused.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8t177t",
                    "author": "TronixPhonics",
                    "score": 3,
                    "created_utc": 1652699468.0,
                    "response": "Another repost from the farmer. You should change your username to AgressiveReposter2 or AgressiveShitCoinPromoter2 or.....",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8solk8",
                    "author": "Verallendingen",
                    "score": 7,
                    "created_utc": 1652688655.0,
                    "response": "they are 50% right.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8szun2",
                    "author": "csgoboy2021",
                    "score": 2,
                    "created_utc": 1652698507.0,
                    "response": "Bitcoin won’t go down to zero but also won’t hit million or even two hundred thousand usd in next few years at least.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8u4iuy",
                            "author": "goodorca",
                            "score": 1,
                            "created_utc": 1652718428.0,
                            "response": "It sure could",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8t24pu",
                    "author": "Arete_Ronin",
                    "score": 2,
                    "created_utc": 1652700101.0,
                    "response": "Early 1900s: 'automobiles are a joke, they'll never beat a horse driven carriage'\n\n1930s: 'if people were meant to fly they'd have wings, I don't trust that the plane won't just fall from the sky'\n\n1980s: 'the internet is only for governments, scientists, and geeks.  Ot has no practical use case'\n\n2000s: 'the iPhone (and all smart phones) are wildly over hyped, they'll never reach mass adoption'\n\nNew things scare people.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8tgdpp",
                            "author": "Mormorspannekakerore",
                            "score": 1,
                            "created_utc": 1652708147.0,
                            "response": "This is cherry picking. Most things fail, and you picked the few that didn’t. Doesn’t make bitcoin any less speculative.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8tjuht",
                                    "author": "Arete_Ronin",
                                    "score": 1,
                                    "created_utc": 1652709770.0,
                                    "response": "By your logic no one can use evidence to substantiate any claim...",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8tlvgf",
                                            "author": "Mormorspannekakerore",
                                            "score": 3,
                                            "created_utc": 1652710682.0,
                                            "response": "You could, but where is the evidence here? Is there any correlation between BTC and the Internet? Yes, of course. Is there correlation between BTC and tulips? Yes there is. \n\nWhy is the internet analogy valid, but you throw away the opinion of anyone who disagrees? \n\nJust because two incidents just so happens to have some common traits doesn’t mean that these traits are the sole causation. Bitcoin might become sucsessfull, who am I to say otherwise, but no matter what, I can assure you it’s not because people doubted. It’s because people started to believe, and as of now that doesn’t seem to be the case. We simply have no idea if people want to start adopting BTC, and hence investing in it can only be speculative.\n\nBut hey, you’ve got it figured out no?",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8shdxw",
                    "author": "MorrisSchaefer",
                    "score": 4,
                    "created_utc": 1652682584.0,
                    "response": "Cryptocurrencies are scams. Bitcoin is not.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8slud6",
                            "author": "Asum_chum",
                            "score": 1,
                            "created_utc": 1652686226.0,
                            "response": "Yep, OPs friends are 50% correct.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8sikwx",
                            "author": "ndgoLiberty",
                            "score": 1,
                            "created_utc": 1652683533.0,
                            "response": "This right here. Yes.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8si1i1",
                            "author": "chente08",
                            "score": -2,
                            "created_utc": 1652683108.0,
                            "response": "Wrong",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8sjdpl",
                    "author": "ProperProfit2724",
                    "score": 2,
                    "created_utc": 1652684174.0,
                    "response": "Bruh what",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8snutd",
                    "author": "blopblipbloup",
                    "score": 2,
                    "created_utc": 1652687998.0,
                    "response": "We are buying Bitcoin at a discount, they will buying it at a fair price",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8sijug",
                    "author": "ndgoLiberty",
                    "score": 1,
                    "created_utc": 1652683510.0,
                    "response": "They’re half right. cRyPtOe is a scam. All of it every little bit.\n\nThere is only one successful cryptocurrency and that is bitcoin.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8sm5le",
                    "author": "Regular_Chapter_788",
                    "score": 0,
                    "created_utc": 1652686504.0,
                    "response": ">When my friends say \" Bitcoin and cryptocurrencies Are Scam\"\n\nThey are half right.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8sta6p",
                    "author": "Hodl2",
                    "score": 0,
                    "created_utc": 1652692940.0,
                    "response": "Crapto is a scam so they're 50% right. Learn why craptoes are scams",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8sw69r",
                    "author": "SouthfieldRoyalOak",
                    "score": 0,
                    "created_utc": 1652695538.0,
                    "response": "they’re half right",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8t73zw",
                    "author": "kushbom",
                    "score": 1,
                    "created_utc": 1652703251.0,
                    "response": "Hopefully they stay quiet when im doing this to them . Cheers",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8tnk2s",
                    "author": "Arete_Ronin",
                    "score": 1,
                    "created_utc": 1652711414.0,
                    "response": "Nope.  People like to reference tulip mania and BTC (because they understand neither and are trying to find a pejorative). PLEASE give me that one.  And you seem like smart guy, seriously make your case.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8twy1b",
                    "author": "DownvoteKink",
                    "score": 1,
                    "created_utc": 1652715357.0,
                    "response": "At some point it's definitely going to 0.  Will that be in a year, or 100 years?  Not really sure.\n\nUsing enough energy to power a small country to enable 5 transactions a second just ain't going to cut it, chief.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ujlwl",
                    "author": "50EMA",
                    "score": 1,
                    "created_utc": 1652724391.0,
                    "response": "Bitcoin won’t but all the other altcoins besides maybe five of them will",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8t3po2",
                    "author": "TyranaSoreWristWreck",
                    "score": -1,
                    "created_utc": 1652701147.0,
                    "response": "Shitcoins *are* scams",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uqp879",
            "title": "Mentor Monday, May 16, 2022: Ask all your bitcoin questions!",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uqp879/mentor_monday_may_16_2022_ask_all_your_bitcoin/",
            "author": "rBitcoinMod",
            "created_utc": 1652681735.0,
            "score": 12,
            "num_comments": 41,
            "subreddit": "Bitcoin",
            "selftext": "Ask (and answer!) away! Here are the general rules:\r\n\r\n* If you'd like to learn something, ask.\r\n* If you'd like to share knowledge, answer.\r\n* Any question about Bitcoin is fair game.\r\n\r\nAnd don't forget to check out /r/BitcoinBeginners\r\n\r\nYou can sort by new to see the latest questions that may not be answered yet.",
            "stickied": true,
            "comments": [
                {
                    "id": "i8svj54",
                    "author": "Stop_Technical",
                    "score": 3,
                    "created_utc": 1652694989.0,
                    "response": "I live in a country where crypto gains are taxed 56% and losses can be deducted 26%, making it very hard to trade. Now, I got a stash of crypto, mainly BTC that I have been adding to since '17. Even if I'm irresponsibly long BTC, compared to everything else in my private economy 🙈- I kindda feel like its a forced hold, through the bull/bear cycles, as brutal as that has been. Is it, or is there a better way? Thx🙏",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8u9zwy",
                            "author": "10kpizza",
                            "score": 1,
                            "created_utc": 1652720589.0,
                            "response": "That's why you avoid KYC. If they don't know you have it, they can't tax it.\n\nWhat you could do now is move to another country which has lower or zero taxes on gains.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8tf3si",
                    "author": "zooms",
                    "score": 2,
                    "created_utc": 1652707523.0,
                    "response": "Can a BIP passphrase (AKA 25th word) be something you make up and can remember such as a song lyric or several phrases up to the 100 character limit?\n\nOr does it have to be strictly random like the rest of the seed phrase? eg dice rolls and random number generator levels of random",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8tgerw",
                            "author": "Rannasha",
                            "score": 5,
                            "created_utc": 1652708161.0,
                            "response": "> Can a BIP passphrase (AKA 25th word)\n\n\"25th word\" is a poor term for the BIP39 passphrase, because it suggests that it should be a word like just like the 24 others, and not a passphrase.\n\nThat said, there are very few restrictions on what the passphrase looks like. According to the [specs](https://github.com/bitcoin/bips/blob/master/bip-0039.mediawiki), it can be any string of UTF8 characters. The passphrase is simply used as a salt in the hashing function, which means it can be as long as you want it to be.\n\nSo your passphrase could be \"1234\", the full collected works of Shakespeare, an unintelligible sequence of random characters and glyphs from various non-Latin alphabets, or any combination of these.\n\nThe actual restrictions on what you can use will be dictated by the device or application you use as a wallet. A software wallet on a computer will probably allow you more flexibility in what you can enter. But even then there may be limits on length and (possibly) character set. A hardware wallet, with a very minimal interface will probably not let you enter anything much more exotic than simple alphanumeric passphrases.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8ui57v",
                            "author": "bitcoin_barry",
                            "score": 1,
                            "created_utc": 1652723819.0,
                            "response": "It depends on what you expect of the passphrase.\n\nImagine a physical key (the important parts of it) split into 2 parts. The bigger part of the key has most of what is needed to open a lock.\n\nMost setups are like this. If your passphrase is compromised, it's all good, the seed is impossible to guess but if someone gets your seed, the passphrase is as secure as a password to a website. It's often less than you think.\n\nSo as long as you concede that the seed is still the most important part, it shouldn't be considered safe because of the passphrase, then you can treat the passphrase as a time delay protection. An attacker *will* break into your wallet, but the passphrase dictates how long it would take.\n\nAs long as you get all of that, then you understand that the passphrase gives you the ability to empty the wallet before anyone else as long as you have a way to know when the seed has been compromised.\n\nIf you will monitor the seed yearly,  you need a very secure password. Song lyrics is not a great idea as that will probably be in a hackers dictionary attack tool (including variations)\n\nIf you will monitor it weekly, it might be good enough as long as you take concerns seriously.\n\nI like seed XOR btw. It gives you 2 parts that are both hard as fuck to guess making it pretty versatile. Call Paula",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8sto19",
                    "author": "Crawlero",
                    "score": 2,
                    "created_utc": 1652693299.0,
                    "response": "So, lightning, I am asking myself whether it solves our scaling problems whatsoever (and I am a typing chimp so correct me where I'm wrong here).  Ideally, it allows us to compress the number of transactions required on-chain, but there is presumably a theoretical limit to this right?  At the end of the day, if there are 1 million users that would like to settle, that is an absolute minimum of 1 million transactions sent to the chain, even if this cuts down from 10 or 100 million transactions this starts to look worrisome.  What happens when we have 50 million people using lightning, all who would like to settle once per month, its mathematically impossible, isn't it?  I know layer 1 isn't supposed to be daily transactions, but will normal people EVER be able to afford to settle or perform on chain transactions?  Will this mean that lightning will be the only form of bitcoin many will ever see?  Really, if opening a channel requires an on-chain action (from what I understand it does), will that make it impossible for normal people to even open a payment channel?  Will we all be at the mercy of trust based bitcoin bankers, transacting on layer 3?\n\nEdit\\* and to be clear, I love bitcoin, I just practice adversarial thinking.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8sy210",
                            "author": "CallingVoid",
                            "score": 5,
                            "created_utc": 1652697107.0,
                            "response": "You don't need to settle once a month, and you probably won't. A lightning channel can be used for as many transactions as you like for as long as possible. There are also potential solutions to channel creation in the pipeline (like channel factories) that could mitigate the issue.\n\nIf hyperbitcoininisation comes to pass then the base layer will become fiscally impractical for the every day user to interact with (but critically, not impossible at all). It may be that only big companies end up settling on chain. And maybe that is ok! Buying and using sats on the lightning network is the same as buying and selling bitcoin.\n\nWho knows what L3 on top of lightning might look like. It is possible that in the distant future it's the principal way to handle bitcoin, but there is nothing to suggest you will be at the mercy of a bitcoin bank any more than L2 makes you at the mercy of one imo.\n\nHell, as robust as lightning is, it may be that someone comes up with something even better and everyone jumps ship for that.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8t543u",
                                    "author": "Crawlero",
                                    "score": 3,
                                    "created_utc": 1652702035.0,
                                    "response": "Channel factories sound interesting.  By L3 I mean in the sense Saylor describes it, trust based exchanges; by this I mean we would only be able to afford trading on platforms relying on trust, and my reasoning is that opening a channel alone could become difficult, hopefully we will see some solutions like these channel factories.  Not needing to settle every month is one thing, but looking out over the horizon the basic math says it could take years to settle transactions if we have a billion users; now I can try to amend my thinking to say maybe the average person doesn't need to settle, but I'll need to think on that one.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8u7ism",
                                    "author": "11thHourSorrow",
                                    "score": 1,
                                    "created_utc": 1652719616.0,
                                    "response": "Is there any chance that people with only a little bit of bitcoin could get their wealth \"stuck\", as it were? In other words, they've got enough on L1 that it wouldn't be a trivial amount for them, but since the \"hyperbitcoinization event\", the fees are so high, it would be impossible for them to move that bitcoin anywhere without getting wiped out.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8uei4v",
                                            "author": "CallingVoid",
                                            "score": 1,
                                            "created_utc": 1652722389.0,
                                            "response": "I suppose it's plausible but I would consider it unlikely.\n\nI personally don't believe hyperbitcoininisation is very likely, but I could be wrong.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8vwsgk",
                            "author": "bitcoin_barry",
                            "score": 1,
                            "created_utc": 1652745552.0,
                            "response": "Bitcoin on Lightning is effectively settled. Correct, it isn't AS settled as if it were settled on chain, but it is only a tiny bit less settled.\n\nNote: lightning is made up of pairs of people, so there are always 2 people per channel. They = your channel partner.\n\nAs long as you are a good actor, three outcomes can happen:\n1. Whenever you settle on chain, you get what you deserve and they get what they deserve\n2. If they are not around when you want to close, you force close, you may pay a higher fee, but all is good in the end minus fees.\n3. If they try to cheat you, your computer has a week to catch them out and get the full amoount back (not just what you are owed, but what they are owed too as a penalty to them for cheating).\n\nIf you don't trust yourself to have a computer running at least once a week, then watchtowers will handle the penalty for you. There are a bunch of people offering this service for free!\n\nThey get nothing from it either, its just cheap to do as they are probably using their computer for other things too. They don't even need your keys to do the job.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8thwb8",
                    "author": "WokeUpButCantGetUp",
                    "score": 1,
                    "created_utc": 1652708865.0,
                    "response": "Hi, I want to ask about my position on futures. \n\nI have some money on futures, my entry price is 37.600 and my liquidation price is 24600. Do you think btc can hit 37.600 before it drops to 24.600's?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8tp7vk",
                            "author": "MMinjin",
                            "score": 2,
                            "created_utc": 1652712128.0,
                            "response": "It could but it would be pure gambling. You better have a really good return to make a bet like that. I wouldn't.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8uk994",
                            "author": "anvivi",
                            "score": 1,
                            "created_utc": 1652724649.0,
                            "response": "Now that Bitcoin has begun to pull back, it is currently a small pullback",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8ucn9c",
                    "author": "BonesGR",
                    "score": 1,
                    "created_utc": 1652721648.0,
                    "response": "A little background first: I am renting rooms out for cash and my sister agreed to pay with bitcoin on CashApp because how simple it is. She doesn’t have to buy it she just has to have a debit card and hit send. But CashApp has yet to verify my Bitcoin account for two months now.\n\nQuestion: anyone know how I can collect bitcoin from her, so that I don’t have to wait months to be verified to use the bitcoin network, some app that is really simple like CashApp?\n\nEdit: I am in the U.S.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8v95wj",
                            "author": "bitcoin_barry",
                            "score": 2,
                            "created_utc": 1652734793.0,
                            "response": "I'd recommend muun, or phoenix wallet. These support lightning network so payment will be fast and cheap.\n\nIf you still want cashapp to hold your bitcoin later, you can move it over later but ideally you move towards more self custody. Not your keys not your Bitcoin.\n\nPs. Both of those wallets are self custodial so you have the keys and no one can take your bitcoin from you.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8ueslq",
                            "author": "senfmeister",
                            "score": 1,
                            "created_utc": 1652722504.0,
                            "response": "Any Bitcoin wallet will work, Samourai is one example. \n\n(edit: As long as you want to keep her payments as Bitcoin, anyway)",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8upoby",
                    "author": "LatterSun6415",
                    "score": 1,
                    "created_utc": 1652726829.0,
                    "response": "Selling all my crypto tomorrow and going to use the loss as a capital gains write off in the future. Then going to buy back 25% of the $ I have left each week in crypto for a month. Thoughts?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8v02dt",
                            "author": "Cats_n_Porn",
                            "score": 2,
                            "created_utc": 1652731077.0,
                            "response": "Don't buy crypto. Buy Bitcoin.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8v2cpj",
                            "author": "CallingVoid",
                            "score": 1,
                            "created_utc": 1652732017.0,
                            "response": "Depending on your country you may have 'bed and breakfast' tax rules that prevent this. Check your local tax law.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8uyutg",
                    "author": "Vehrnicus",
                    "score": 1,
                    "created_utc": 1652730587.0,
                    "response": "How can we know government agencies won't shut down exchanges once Bitcoin actually becomes \"accepted\"? They own the ISPs that run the internet, literally all the wires Bitcoin is transmitted on, and can revoke domains with a click. Encrypted or not, you can't stop network engineers at alphabet agencies...",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8v8sch",
                            "author": "bitcoin_barry",
                            "score": 1,
                            "created_utc": 1652734642.0,
                            "response": "That's not really how the internet works, but as governments become more Draconian, the general public get access to and learn more privacy tools and practices.\n\nSo, Tor will be normal. VPN will be normal. Using bitcoin without using exchanges will be normal.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8vakj0",
                                    "author": "Vehrnicus",
                                    "score": 1,
                                    "created_utc": 1652735374.0,
                                    "response": "Tor has been broken for almost a decade btw.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8vdgni",
                                            "author": "bitcoin_barry",
                                            "score": 1,
                                            "created_utc": 1652736604.0,
                                            "response": "Not really, broken is quite absolute. It is theorised that agencies have infiltrated enough entry and exit points to get a good view of the network activity, but e2e hidden services are still secure.\n\n\nThat said, yes there are will be more tools like i2p that make privacy less inconvenient without compromising security.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8v76f8",
                    "author": "Cats_n_Porn",
                    "score": 1,
                    "created_utc": 1652733992.0,
                    "response": "How is chain analysis able to tell how much is in a single wallet when you use different addresses for transactions?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8v8f86",
                            "author": "bitcoin_barry",
                            "score": 1,
                            "created_utc": 1652734496.0,
                            "response": "Metadata.\n\nSay you buy from Coinbase and send to a new address each time.\n\nCoinbase sells your data as \"anonymous\" data to chainalysis (grouped data but without identifying info)\n\nChainalysis looks at patterns and amounts to probabilistically differentiate between spends and deposits.\n\nYou spend from two outputs because you have a large bill and one address doesn't have enough to cover the cost. Chainalysis confirms one of their assumptions and uses it to re-enforce their predictive models.\n\nIf you have a regular buying pattern, they detect and use it to improve their models.\n\nIf you use addresses together from different sources, they learn about more of your bitcoin.\n\nSomething like that and more. It's their day job to find more ways to demystify our wallets.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8v9drh",
                                    "author": "Cats_n_Porn",
                                    "score": 1,
                                    "created_utc": 1652734878.0,
                                    "response": "Ah bastard Coinbase selling my data.\n\nAlthough even with this explanation it seems like it wouldn't be possible to determine statistics like x% of wallets hold 0.01 BTC completely accurately. If someone sent 0.005 from two different exchanges and then never spent any then that wouldn't show up as a 0.01+ wallet.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8vacuz",
                                            "author": "bitcoin_barry",
                                            "score": 2,
                                            "created_utc": 1652735284.0,
                                            "response": "Like I said, they collect a LOT of data from many sources.\n\nTheir data is statistical, not factual although courts tend to give no fucks about that when it comes to any sort of science.\n\nBut there is a scary amount of power in big data and machine learning too. It's why we've been so concerned as a society about all the data collection by big tech companies.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8vgmau",
                                                    "author": "Pantzzzzless",
                                                    "score": 0,
                                                    "created_utc": 1652737973.0,
                                                    "response": "> It's why we've been so concerned as a society about all the data collection by big tech companies.\n\nHave we been observing different societies?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8vlheh",
                                                            "author": "hardware4ursoftware",
                                                            "score": 1,
                                                            "created_utc": 1652740135.0,
                                                            "response": "No, it’s because people with brains can understand the consequences of such actions.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8vpmru",
                                                                    "author": "Pantzzzzless",
                                                                    "score": 1,
                                                                    "created_utc": 1652742060.0,
                                                                    "response": "> people with brains\n\nAgain lol, I don't think we are seeing the same society.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "i8vvlsa",
                                                            "author": "bitcoin_barry",
                                                            "score": 1,
                                                            "created_utc": 1652744961.0,
                                                            "response": "maybe, I am in the EU where data privacy has been a growing concern.\n\nGDPR and all that.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8vgs7k",
                    "author": "bitcoin_barry",
                    "score": 1,
                    "created_utc": 1652738044.0,
                    "response": "Maybe, I'm in the EU where privacy has been a growing concern.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8vw992",
                    "author": "imnotnotbryce",
                    "score": 1,
                    "created_utc": 1652745283.0,
                    "response": "Hey guys, finally planning to buy my first bit of crypto in btc. Noticed there was a dip happening so I got all set up with kraken and have been waiting for an ideal point to buy. I’m only gonna buy like 20-50 bucks worth to start off so I’m sure it’s not going to matter too much… but I would like to buy in at the lowest point I can. \n\nWhat’s the word with when to buy? Noticed it’s hovering around 29-30k recently, should I wait for it to dip more or should I just pull the trigger around 29?\n\nThanks for any advice ✌🏻",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8t6y4h",
                    "author": "Tatzdan1492",
                    "score": -2,
                    "created_utc": 1652703152.0,
                    "response": "has anyone some good counter arguments regarding this interview:\n\nhttps://www.currentaffairs.org/2022/05/why-this-computer-scientist-says-all-cryptocurrency-should-die-in-a-fire/\n\nIs it just a giant zero-sum game or is he missing something?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8tbtq3",
                            "author": "SleepCom",
                            "score": 3,
                            "created_utc": 1652705858.0,
                            "response": "Reads like some reddit conversation (and about as valuable as one too). \n\nHe's just using the same old attacks and amplifying them. He knows enough about how bitcoin works, but he doesn't like how it works. He mentions the fact that it uses the energy of a small country to secure the network, but just gives his opinion that it's not worth it (needs to be green). Then he goes on about how it's not equal, and it costs money to transact, and people use it for drugs, etc. etc. etc. The whole thing is just some guys rant with nothing special added to it. I was excited maybe to hear some new angle of attack on bitcoin, but this article was pretty amateur. All I know now is that this guy doesn't like the way bitcoin is designed and believes it's one of the great horrors of technology that has risen from the depths of the internet.\n\n**EDIT**: I wanted to add how stupid I think this article is. Nothing in the interview was actually interesting or even presented in an interesting manner. It reads like some freshman college paper. I'm surprised this person has a job writing professionally.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}