{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uo2iwh",
            "title": "Panic in the crypto market has Janet Yellen's attention",
            "url": "https://www.cnn.com/2022/05/12/investing/premarket-stocks-trading/index.html",
            "author": "Kianna_hd",
            "created_utc": 1652366149.0,
            "score": 4,
            "num_comments": 21,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8bp4dq",
                    "author": "StannisBaratheon6969",
                    "score": 8,
                    "created_utc": 1652367004.0,
                    "response": "Anything that has her attention is in trouble……",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "unte7y",
            "title": "Building On Bitcoin Question",
            "url": "https://www.reddit.com/r/Bitcoin/comments/unte7y/building_on_bitcoin_question/",
            "author": "m1100010",
            "created_utc": 1652332047.0,
            "score": 3,
            "num_comments": 2,
            "subreddit": "Bitcoin",
            "selftext": "I'm trying to build a website that confirms bitcoin payments from a buyer address to a seller address before delivering a product. The goal is to have the buyer pay minimal fees, and be non-custodial, giving the seller more profit as they scale.\n\nIs there any open source project that already does this sort of payment confirmation, that I could learn from or integrate with?\n\nI realize that I could probably do this just using the node API, but why re-invent it if it already exists?\n\nThis won't be a silk road clone, or deal in illegal goods or services, incase you're wondering.",
            "stickied": false,
            "comments": []
        },
        {
            "id": "unsbe4",
            "title": "Coinbase Status and Exchange Recommendation?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/unsbe4/coinbase_status_and_exchange_recommendation/",
            "author": "thatguyattheplace",
            "created_utc": 1652328292.0,
            "score": 3,
            "num_comments": 4,
            "subreddit": "Bitcoin",
            "selftext": "Is coinbase facing a bankruptcy risk right now? The news makes it sound dire for them (which sounds like opportunistic FUD) and the CEO says they’re fine (which is the damage control I would go with if I were CEO of a flailing company). I’ve been using coinbase to buy Bitcoin for a while. I move my coin to cold storage when my funds become available. Is there an exchange that you recommend over Coinbase? If so, why? Thanks!",
            "stickied": false,
            "comments": [
                {
                    "id": "i8a69yp",
                    "author": "JustDalek_",
                    "score": 4,
                    "created_utc": 1652331940.0,
                    "response": "i thought they were just legally required to disclose it?. being a public traded company and all?  \n\n\nEither way, I just moved everything to my ledger that doesnt have insane gas fees.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "umu7gw",
            "title": "Savings",
            "url": "https://www.reddit.com/r/Bitcoin/comments/umu7gw/savings/",
            "author": "One-Anteater860",
            "created_utc": 1652220652.0,
            "score": 4,
            "num_comments": 23,
            "subreddit": "Bitcoin",
            "selftext": "How many would suggest I put most of my savings into bit right with these low prices. If so how long do you think it’ll be before I see a return?",
            "stickied": false,
            "comments": [
                {
                    "id": "i83whrw",
                    "author": "twalker14",
                    "score": 24,
                    "created_utc": 1652220792.0,
                    "response": "You can only decide this for yourself, don’t ask strangers on the internet for financial advice",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i83yiqu",
                            "author": "jeywgosjeb",
                            "score": 10,
                            "created_utc": 1652221680.0,
                            "response": "This is terrible advice, always listen to strangers :P",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i83xabx",
                    "author": "CryptoChewie",
                    "score": 5,
                    "created_utc": 1652221141.0,
                    "response": "I did. My savings are depreciating in value faster than my ability to make more by working. \n\nThe only guarantee in life with money is that other people want your money and they will get it. Learning to lock it away from yourself is the key. I feel Bitcoin helps me do this better and more often than other ways. So have fun with it. Don’t make it too stressful or have too many conditions; instead consider after a year or two: did you build your financial wealth more or did your consumption change in a positive way?\n\nBut you asked for specifics: I would recommend 50% of your fiat savings converted into BTC soon while the price is staying low, and do not think about needing it before fall 2024. Sell before then at your own risk and only because you need gas money or desperate.\n\nBut get in the game, stay for a while, participate regularly, and learn all you can. Your knowledge will serve you well in this industry. There is more than the price. A lot to geek out on and profit from.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i83ykpe",
                            "author": "jeywgosjeb",
                            "score": 3,
                            "created_utc": 1652221703.0,
                            "response": "Lol best opening line ever",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i83wy5q",
                    "author": "GroveTh2",
                    "score": 4,
                    "created_utc": 1652220993.0,
                    "response": "Wait and see how this goes. It may drop more. And dont believe in people that say they know. No one knows.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i83x7an",
                    "author": "DavidKens",
                    "score": 7,
                    "created_utc": 1652221104.0,
                    "response": "Do not put most of your savings into Bitcoin. This is a terrible idea. \n\nBitcoin is amazing in many ways - but it’s not (yet) a place to put most of your savings.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i83z00u",
                            "author": "Keith_Kong",
                            "score": 10,
                            "created_utc": 1652221891.0,
                            "response": "Oops.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i84582h",
                                    "author": "veggiecrunchwrap",
                                    "score": 7,
                                    "created_utc": 1652224654.0,
                                    "response": "Oops.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}