{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uvjc1i",
            "title": "it’s all about perspective…",
            "url": "https://i.redd.it/3q6ex5ng63191.jpg",
            "author": "hbdrumma",
            "created_utc": 1653250985.0,
            "score": 1348,
            "num_comments": 72,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9lvsil",
                    "author": "distinctdino",
                    "score": 74,
                    "created_utc": 1653253186.0,
                    "response": "\\- Can be counterfeit",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9m3f3c",
                            "author": "SAVETHEWHALESS",
                            "score": 29,
                            "created_utc": 1653256781.0,
                            "response": "The best way to counterfeit it is on the stock market by short selling shares they don’t own. Free money. Then make the company go bankrupt and you magically have a jackpot with tax leniency for your magic money. See Toys r us, Sears, blockbuster",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9m6vlc",
                                    "author": "ContWord2346",
                                    "score": 2,
                                    "created_utc": 1653258454.0,
                                    "response": "💩",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9mb7zn",
                                    "author": "greghumphries",
                                    "score": 1,
                                    "created_utc": 1653260658.0,
                                    "response": "Tell me you're in the GME bagholder сult without telling me you're in the GME bagholder сult.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9mdd57",
                                            "author": "VitalikForPresident",
                                            "score": 1,
                                            "created_utc": 1653261779.0,
                                            "response": "Your a clown🤡 Hedge funds have shorted GME stock over 100%. That means buying shares of GME is literally free money because the hedge funds have to buy all of the shares to cover there shorts. We own the float. We set the price. When the hedge funds buy the shares to cover there shorts the mother of all short squeezes will happen and GME will be worth millions of dollars per share. The squeeze will last for months or even years. I wont let the hedge funds buy my shares for less than $10 million each. Just read the DD on r/Superstonk and then buy GME and DRS your shares. DYOR this is not financial advice.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i9mef36",
                                            "author": "chodaranger",
                                            "score": 1,
                                            "created_utc": 1653262330.0,
                                            "response": "Is his comment untrue?",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i9mdgmz",
                                            "author": "kellnoidiii",
                                            "score": 1,
                                            "created_utc": 1653261830.0,
                                            "response": "So sad when you see them IRL.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9mf70m",
                            "author": "Chefzor",
                            "score": 1,
                            "created_utc": 1653262737.0,
                            "response": "- Can be spent",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9lvc0z",
                    "author": "baconcheeseburgarian",
                    "score": 24,
                    "created_utc": 1653252975.0,
                    "response": "12 nodes.  Remember, they each have fiefdoms they manage.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9m2icl",
                    "author": "DarkBlaze99",
                    "score": 21,
                    "created_utc": 1653256341.0,
                    "response": "Except the currency is backed by one of the biggest military powers...\n\nThe only reason the Dollar or any currency has intrinsic value is usually due to the military/state backing it.\n\nOf course it does suck that they (USA) do just print money whenever they feel like it.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9m9q6y",
                            "author": "notapersonaltrainer",
                            "score": 1,
                            "created_utc": 1653259894.0,
                            "response": "You are talking about security not backing. You don't get to redeem your dollars for nukes and the government closed the gold window in '71. USD is explicitly unbacked. A centralized ledger relies completely on kinetic security and trust of the administrators.\n\nBacking is added to a paper or centralized digital ledger to impute trust that administrators will not abuse the infinite supply inherent in these ledgers. The idea is if they do there is a redemption mechanism to call the supply bluff (ie everyone tries to withdraw their USD gold backing at once). \n\nThe Nixon Shock illustrates why this isn't a reliable system unless the scarcity is inherent to the ledger itself. The Ruble is now \"gold backed\" but that is meaningless unless you trust Putin to honor the redemption mechanism. \n\nThe breakthrough of Bitcoin is a ledger that does not require an external mechanism to maintain supply. It's the first digital ledger with the scarcity mechanism built in. The impossibility of a Nixon shock is not a bug, it is *the* feature.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9m8gre",
                            "author": "thefullmcnulty",
                            "score": 1,
                            "created_utc": 1653259254.0,
                            "response": "No fiat has intrinsic value and none claim to. You mean just “value”.\n\nFiats are backed by proof of war though.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9m9ba6",
                            "author": "Motor-boat",
                            "score": 1,
                            "created_utc": 1653259685.0,
                            "response": "I feel like (kinda just spit-balling here) the US had the greatest military might in the past because it was backed by the most rapidly expanding economy in history. Now, as the US economy sputters along with borrowed time and free money, we're transitioning into a purely politically driven military state; and, as we know from history, those kinds states don't survive too long.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9ma9rl",
                            "author": "rodeBaksteen",
                            "score": 1,
                            "created_utc": 1653260174.0,
                            "response": "How does the military back anything? When shit hits the fan those papers will be better spent as toilet paper.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9me10p",
                            "author": "MonkeyBananaPotato",
                            "score": 1,
                            "created_utc": 1653262126.0,
                            "response": "I wish they’d *print* money. Only 11% of money physically exists and over half of it is overseas.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9meqck",
                            "author": "hbdrumma",
                            "score": 1,
                            "created_utc": 1653262492.0,
                            "response": "Totally agree with u on this",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9m5cey",
                    "author": "Starkgaryen69",
                    "score": 3,
                    "created_utc": 1653257706.0,
                    "response": "Grade A shitcoin",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9m9135",
                    "author": "wenchanger",
                    "score": 1,
                    "created_utc": 1653259541.0,
                    "response": "so fucking true",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9lzgbb",
                    "author": "lcarusLives",
                    "score": 7,
                    "created_utc": 1653254885.0,
                    "response": "Had me in the first half.  God damn that's poor tokenomics.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9m5qq0",
                    "author": "volocom7",
                    "score": 2,
                    "created_utc": 1653257902.0,
                    "response": "Oh shittt",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9m630i",
                    "author": "alkyboy",
                    "score": 2,
                    "created_utc": 1653258063.0,
                    "response": "Damn.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9m6mxn",
                    "author": "lil_intern",
                    "score": 2,
                    "created_utc": 1653258335.0,
                    "response": "1 percent owns more than 30% of the supply I thought it was more like 40-50",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9malay",
                    "author": "pcvcolin",
                    "score": 1,
                    "created_utc": 1653260339.0,
                    "response": "This is a good point, confidence or lack thereof in some system is a critical factor to remember, not merely supply or other characteristics of a coin or system.  And as we see these behaviors continue with respect to the management of the dollar, the confidence continues to drop in it and this contributes to the decline of purchasing power (purchasing power of the dollar has in fact, been in decline for a great many years, though remarkably and notably we have seen inflation rise and buying / purchasing power drop lately more significantly).\n\nBitcoin does provide an option (a buffer) against this, but only if one is thinking rationally and making careful long term steps.  Reasonable approaches involve [DCA](https://dcabtc.com) into a hardware wallet or a Wyoming licensed institution.  Those who panic (and make frequent trades in and out of bitcoin) are likely not going to fare well in the long term.  Periodic acquisition (not \"day trading for gains\") is a safe pathway through catastrophic conditions.  It is also worth noting that simple acquisition doesn't have tax consequences in the U.S. whether you are acquiring it to store directly on a hardware wallet or putting dollars into an crypto IRA (such as iTrustCapital where you'd then buy bitcoin).  \n\nEDIT, NOTE:  In this discussion linked below, I explain why we are on a glide path to recession in 2022 and what will constitute a full economic hard crash in 2023. There is still time to prepare for this, and many people with sufficient preparation can find a way to ride it out although the shocks are already being felt.  It will not be easy, though.\n\nSee:\n\n[https://np.reddit.com/r/Bitcoin/comments/udx62t/mfw\\_the\\_us\\_gov\\_prints\\_another\\_trillion/i6kej31/?utm\\_source=share&utm\\_medium=web2x&context=3](https://np.reddit.com/r/Bitcoin/comments/udx62t/mfw_the_us_gov_prints_another_trillion/i6kej31/?utm_source=share&utm_medium=web2x&context=3)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9mcl5a",
                    "author": "Any-Shoulder-9140",
                    "score": 1,
                    "created_utc": 1653261374.0,
                    "response": "And one of the technique these scammers use is \"Hype the coin -> Drive the demand -> Sell at higher price.\" Pathetic.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9mcnmv",
                    "author": "Even-Translator4080",
                    "score": 1,
                    "created_utc": 1653261411.0,
                    "response": "- if you don't pay your taxes with it men with guns come",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9mdhfk",
                    "author": "co-oper8",
                    "score": 1,
                    "created_utc": 1653261842.0,
                    "response": "Haha. Understanding crypto starts with explaining the usd!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9memzo",
                    "author": "little_lamb_chop",
                    "score": 1,
                    "created_utc": 1653262445.0,
                    "response": "Try my new cryptocurrency, GoogolCoin! Max supply of 10^100 coins!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9lrtkt",
                    "author": "Ayeonee",
                    "score": 7,
                    "created_utc": 1653251370.0,
                    "response": "😂😂😂",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9m1p5s",
                    "author": "Big_Swede89",
                    "score": 6,
                    "created_utc": 1653255956.0,
                    "response": "I like BTC as a store of value but replacing the dollar seems problematic. Every transaction is a taxable event. Doesn’t seem very feasible to calculate your taxable gain/loss every time you buy a pack of gum…",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9m8vkx",
                            "author": "thefullmcnulty",
                            "score": 1,
                            "created_utc": 1653259462.0,
                            "response": "If bitcoin replaced fiat it would not be taxed as investment. Instead bitcoin would be treated as currency / medium-of-exchange and the adopting society’s / societies unit of account.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9mb75x",
                                    "author": "hmiamid",
                                    "score": 1,
                                    "created_utc": 1653260646.0,
                                    "response": "How would it be feasible to declare revenues for a company, or even my salary if I get paid in btc? Do I convert it to USD or the irs has to create new entries in the filing system to allow btc?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9mdq74",
                                            "author": "thefullmcnulty",
                                            "score": 1,
                                            "created_utc": 1653261970.0,
                                            "response": "[Bitcoin is triple entry accounting](https://youtu.be/hv34SPq4y_M). Every transaction is already immutably recorded and can be analyzed as needed. Chain-alysis already does this. \n\nThe tools could easily be developed as they have been for fiat. Except fiat is a giant interconnected series of systems and protocols that require trust to work. Bitcoin is immutable truth and requires no trust. It’s all there to be seen on the base-layer. \n\nBitcoin is a significantly better system than anything currently available and is the first innovation in accounting in 700 years. \n\n\nThe difference between trust-based double entry accounting and immutable public truth of triple entry accounting is such a profound leap forward it’s hard to comprehend at this early stage.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9m232c",
                            "author": "1moreOz",
                            "score": 4,
                            "created_utc": 1653256141.0,
                            "response": "Fuck (excessive) taxes",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9m3vnb",
                                    "author": "GildedSilverBitcoins",
                                    "score": 3,
                                    "created_utc": 1653256995.0,
                                    "response": "It's Proof of Stake. \n\nIt's not a bug, its a feature.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9me7gt",
                            "author": "slump_g0d",
                            "score": 1,
                            "created_utc": 1653262220.0,
                            "response": "Yeah it’s called a sales tax 🤦‍♂️ it’s not Bitcoin specific lol.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9m5447",
                    "author": "apesex67",
                    "score": 5,
                    "created_utc": 1653257591.0,
                    "response": "Now look up how many Bitcoins are held by whales.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9mbpnu",
                            "author": "plixtern",
                            "score": 1,
                            "created_utc": 1653260913.0,
                            "response": "That's not really possible to do because it's not possible to tell which bitcoin addresses belong to exchanges and which bitcoin addresses belong to whales.  Many people stupidly keep their bitcoin on an exchange and many of the top bitcoin addresses belong to exchanges.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9m22ni",
                    "author": "MissNewbieDollar",
                    "score": 2,
                    "created_utc": 1653256136.0,
                    "response": "Fucking Perfect. 🤞💰😆",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9m5s4f",
                    "author": "DanfromCalgary",
                    "score": 3,
                    "created_utc": 1653257921.0,
                    "response": "Can you show me where they increased the global supply of dollars by 25% in the last 6 months. \n\nOr is this wack as fuck",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9m7blq",
                            "author": "fellowpleb",
                            "score": 4,
                            "created_utc": 1653258679.0,
                            "response": "We don't know the date of the tweet. During the pandemic they printed something like 8 trillion dollars",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9m7f8p",
                            "author": "hbdrumma",
                            "score": 1,
                            "created_utc": 1653258731.0,
                            "response": "Just look up the M2 money supply on trading view",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9m8g53",
                                    "author": "H_is_for_Human",
                                    "score": 1,
                                    "created_utc": 1653259245.0,
                                    "response": "The definition of M2 was changed in May 2020. People not understanding this has been the basis of much FUD.\n\n\"Before May 2020, M2 consists of M1 plus (1) savings deposits (including money market deposit accounts); (2) small-denomination time deposits (time deposits in amounts of less than $100,000) less individual retirement account (IRA) and Keogh balances at depository institutions; and (3) balances in retail money market funds (MMFs) less IRA and Keogh balances at MMFs.\n\nBeginning May 2020, M2 consists of M1 plus (1) small-denomination time deposits (time deposits in amounts of less than $100,000) less IRA and Keogh balances at depository institutions; and (2) balances in retail MMFs less IRA and Keogh balances at MMFs. Seasonally adjusted M2 is constructed by summing savings deposits (before May 2020), small-denomination time deposits, and retail MMFs, each seasonally adjusted separately, and adding this result to seasonally adjusted M1.\"",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9m7j9t",
                                    "author": "DanfromCalgary",
                                    "score": 2,
                                    "created_utc": 1653258789.0,
                                    "response": "It wasn't my post to prove tho..\n\nSo im guessing not than",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9lxt28",
                    "author": "schrodster",
                    "score": 2,
                    "created_utc": 1653254111.0,
                    "response": "So good",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9m38g7",
                    "author": "Minegrow",
                    "score": 2,
                    "created_utc": 1653256691.0,
                    "response": "- actually has a purpose",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9lth1o",
                    "author": "Zyoman",
                    "score": 1,
                    "created_utc": 1653252125.0,
                    "response": "True!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9lvaek",
                    "author": "Main_Sergeant_40",
                    "score": 1,
                    "created_utc": 1653252954.0,
                    "response": "Nice share. USD holders getting rekt",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9m4aax",
                    "author": "lacMu",
                    "score": 1,
                    "created_utc": 1653257185.0,
                    "response": "Oh snap",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9mathf",
                    "author": "Littleboyhugs",
                    "score": 1,
                    "created_utc": 1653260452.0,
                    "response": "Comparing the USD to the scam rugpull infested crypto marketplace is just silly.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9lylio",
                    "author": "200kBR",
                    "score": -1,
                    "created_utc": 1653254478.0,
                    "response": "This makes me wish my whole bankroll was in BTC",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9mbr7x",
                    "author": "hcollector",
                    "score": 1,
                    "created_utc": 1653260937.0,
                    "response": "Cringe. At the end of the day 99.9% of bitcoin people only care about the dollar value of their coin.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9m7blr",
                    "author": "Bluebillion",
                    "score": 1,
                    "created_utc": 1653258679.0,
                    "response": "I agree with you guys. Give me these shitcoins I will take them off your hands no problem.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9m8dc1",
                    "author": "Nomad_Bill",
                    "score": 1,
                    "created_utc": 1653259208.0,
                    "response": "Bitcoin will never fully replace the dollar, any more than Linux will ever fully replace Windows/iOS.\n\nJust like in the operating system market, the currency markets will have a place for both decentralized/open-source (BTC), and centralized/closed-source/proprietary (USD/Euro/Yuan).",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9mbcv7",
                    "author": "pezdal",
                    "score": 1,
                    "created_utc": 1653260728.0,
                    "response": "\\- (loosely) pegged to Tether",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9mbplc",
                    "author": "C0ncentratedAwesome",
                    "score": 1,
                    "created_utc": 1653260912.0,
                    "response": "90% of that supply is not in circulation.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9mbpz1",
                    "author": "caspertahghoest",
                    "score": 1,
                    "created_utc": 1653260918.0,
                    "response": "LOL",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9mde0x",
                    "author": "manofftherails",
                    "score": 1,
                    "created_utc": 1653261791.0,
                    "response": "isn’t it just 25% of the physical supply, like bills and coins, that’s been minted in the last 6 months not the entire supply",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9me9r2",
                    "author": "RowAdmirable7014",
                    "score": 1,
                    "created_utc": 1653262254.0,
                    "response": "Gonna load up when bitcoin reaches 4000 level",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9meep8",
                    "author": "Chicho_rodriguez",
                    "score": 1,
                    "created_utc": 1653262324.0,
                    "response": "How is Bitcoin considered a currency when it is traded  as the most volatile asset that has ever existed?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9meilu",
                    "author": "andrew_shields_",
                    "score": 1,
                    "created_utc": 1653262382.0,
                    "response": "“No supply cap” is a bit misleading. There’s a soft cap that can be moved up when it suits the fed or the good standing of the economy long term.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9merwv",
                    "author": "ajlunce",
                    "score": 1,
                    "created_utc": 1653262515.0,
                    "response": "It's different be a used the United States has an army and a state. That's the difference.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9mey5j",
                    "author": "Nearby_You_313",
                    "score": 1,
                    "created_utc": 1653262605.0,
                    "response": "So tired of this joke. It's been told so many times it's on life support at this point.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9m0gsp",
                    "author": "509BandwidthLimit",
                    "score": 0,
                    "created_utc": 1653255368.0,
                    "response": "Waiting for the gold & silver boyz to enter the chat.....",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9mcmeg",
                    "author": "New-Worldliness3134",
                    "score": 1,
                    "created_utc": 1653261393.0,
                    "response": "It's the world reserve currency, so I'm pretty sure you're the weirdo here, not every financial institution on the planet.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}