{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uvlzwq",
            "title": "Took self custody of my keys today",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uvlzwq/took_self_custody_of_my_keys_today/",
            "author": "tappicola",
            "created_utc": 1653258843.0,
            "score": 9,
            "num_comments": 3,
            "subreddit": "Bitcoin",
            "selftext": "It's been a long journey full of hazards from starting out in the shitcoin casinos last year, to educating myself about Bitcoin, and finally taking custody of my keys today. Life keeps getting more stressful and complicated as I get older and start a family. Now ownership of my coins is no longer something I have to worry about and it feels great.\n\nGrabbed a Bitbox and steel plate stamping kit. It was ridiculously easy. Sent my coins off the exchanges and waited anxiously for confirmations. Wiped and restored a few times to feel comfortable with the process.\n\nThanks to this sub for all the knowledge and community \n\nP.S. Hey Coinbase I know you keep asking me to verify myself again and Crypto.com you've been so persistent with your unsolicited shitcoin notifications. Both of you please go fuck yourselves with a rusty pipe.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9mbz71",
                    "author": "NiceDoctorBeam",
                    "score": 1,
                    "created_utc": 1653261054.0,
                    "response": "Poor little pipe.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9mcroz",
                    "author": "caploves1019",
                    "score": 1,
                    "created_utc": 1653261471.0,
                    "response": "All paths lead to Bitcoin.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9mfaj6",
                    "author": "llewsor",
                    "score": 1,
                    "created_utc": 1653262788.0,
                    "response": "well looks like you got it now. happy hodling.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uvly1c",
            "title": "Is Bitcoin really that resiliant?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uvly1c/is_bitcoin_really_that_resiliant/",
            "author": "acajic",
            "created_utc": 1653258678.0,
            "score": 5,
            "num_comments": 9,
            "subreddit": "Bitcoin",
            "selftext": "Seeing all the Bitcoin evangelists out there, I'm thinking - these guys just lack pessimistic imagination.  \nI'm already sold on most of what they are saying - I see Bitcoin as the currency of the Internet.   \nSounds grand, but how resiliant is the Internet actually? Would it really be impossible that China disconnects itself from the global internet at some point? How does blockchain react to long periods of multiple networks working in parralel, unaware of each other? In my understanding, that would lead to whole bunch of transactions getting reversed because the network that collected the longer chain - wins.  \n\n\nSurely, that would crash Bitcoin?",
            "stickied": false,
            "comments": [
                {
                    "id": "i9m9yi5",
                    "author": "bitcoin_barry",
                    "score": 6,
                    "created_utc": 1653260013.0,
                    "response": "A split would end up with two forks of Bitcoin running in parallel; this much is true.\n\nHowever, Bitcoin doesn't run on the WWW, as much as it just needs a bridge to synchronise. It doesn't rely on DNS or SSL certificates, which are some of the main centralising factors of the world wide web.\n\nThe blockchain already gets shared to a satellite, so in China, it only takes someone to sync with the satellite and then share that data online to bridge the network.\n\nThat isn't the best solution IMO, because China, being just one country is more likely to have the minority hash rate, so the network will seem to favour everyone else's transactions over theirs because the bridge sending txs to the rest of us is small and slow.\n\nAnyway, assuming that never happens, then after some time, the two forks encounter each other. Well this doesn't \"crash\" Bitcoin, Bitcoin just resolves the conflict by taking the biggest chain (in terms of proof of work) and sends the other transactions to the mempool to be re-confirmed.\n\nCan this lead to a double spend, sure it can, but it will take a lot of effort for one person (they'd need to physically travel between countries to pull it off).\n\nTo be honest, I just don't think Bitcoin can be pulled apart for very long. Think of any two real Bitcoin networks as distant lovers, they will find a way to find each other.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9macp1",
                    "author": "xtarsia",
                    "score": 2,
                    "created_utc": 1653260216.0,
                    "response": "That would result in China hard forking tho wouldn't it?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9mcqd3",
                            "author": "NiceDoctorBeam",
                            "score": 1,
                            "created_utc": 1653261451.0,
                            "response": "It would result in \"officials\" being bribed to \"look the other way\" as various Chinese people continued to us the global Internet for all manner of things, including (but not limited to) Bitcoin.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9mcil1",
                    "author": "NiceDoctorBeam",
                    "score": 2,
                    "created_utc": 1653261337.0,
                    "response": "Learn about the Internet Protocol.  The Internet is not \"one thing\".  The Internet is a collection of many \"local networks\", some big, some small - they are all interconnected via routers which run the Internet Protocol.  \n\n> how resiliant is the Internet actually?  \n\nIt has been designed and built to continue operating even after a nuclear war.  \n\nYou owe it to yourself to learn more, to learn what Bitcoin actually IS, the basics of how Bitcoin works, and the reasons it was invented and why it continues to thrive.  \n\nIntro: The Trust Machine (22 min):  \nhttps://www.youtube.com/watch?v=ZKwqNgG-Sv4  \n\nSaylor Explains:  \nhttps://www.reddit.com/r/Bitcoin/comments/s54g8x/send_this_to_your_contacts_interested_in_bitcoin/  \n\nRead: \"The Bitcoin Standard,\" by S. Ammous",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9m8nph",
                    "author": "swgo1",
                    "score": 1,
                    "created_utc": 1653259350.0,
                    "response": "Interesting.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9mc6t7",
                    "author": "Independent-Snow-129",
                    "score": 1,
                    "created_utc": 1653261166.0,
                    "response": "It doesn't completely disconnect TOR, VPN, blockstream satellite and more options !",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9medz3",
                    "author": "VisualAntelope4611",
                    "score": 1,
                    "created_utc": 1653262314.0,
                    "response": "Crash Bitcoin? Bitcoin doesn't care what it's value is and nothing will make it ever go away. It could be 5 cents a coin and it would still persist and be used.\n\nAll these investors and speculators are just noise and meaningless in grand scheme. \n\nFoolish to store your wealth in a transfer medium. It only needs to be stable enough to complete the transfer, which it is. \n\nPeople that store wealth there are just throwing darts at the board.\n\nGood luck",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9mpd22",
                    "author": "uncontrollableop",
                    "score": 1,
                    "created_utc": 1653268074.0,
                    "response": "crash? is that fatal?",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}