{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uy8rza",
            "title": "Bitcoin is Insurance on a Failing Financial System with Greg Foss - A must watch episode from a must watch podcast!",
            "url": "https://youtu.be/6EcZn_cbtGI",
            "author": "NYKNYb",
            "created_utc": 1653575030.0,
            "score": 40,
            "num_comments": 4,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "ia2hdq5",
                    "author": "NYKNYb",
                    "score": 2,
                    "created_utc": 1653575077.0,
                    "response": "Hey guys!\n\nCan you put a description or a comment on a link that you post?\n\nI couldn't figure it out.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia3dpxd",
                    "author": "bittenbycoin",
                    "score": 2,
                    "created_utc": 1653588028.0,
                    "response": "I didn't listen to this yet, but I did watch the interview of Foss and Max Keiser on Swan Signal live from May 25 2022. \n\nThe stuff he talks about is way above my pay grade, I mean I've heard of gamma rays before but  gamma squeezes are new to me.\n\nWould be great if some knowledgeable people could listen to his \"insurance\" thesis and either echo or counter his thoughts.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia4aogg",
                    "author": "Away_Future913",
                    "score": 1,
                    "created_utc": 1653601880.0,
                    "response": "Wow, this is heart warming to know that we this close to having the Akiragal \n\nWow, this is heart warming to know that we this close to having the Akiragal soon",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia3qquq",
                    "author": "Prestigious_Run2055",
                    "score": 0,
                    "created_utc": 1653593372.0,
                    "response": "Akiragal deserves praise for her bravery in defending the community and ensuring a more engaging gameverse for gamers.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uy8sii",
            "title": "cost basis in the clouds above me",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uy8sii/cost_basis_in_the_clouds_above_me/",
            "author": "TownConscious",
            "created_utc": 1653575072.0,
            "score": 12,
            "num_comments": 24,
            "subreddit": "Bitcoin",
            "selftext": "I'm a class of 2021 inductee.  I spent 25k of my hard earned money and bought in at 58k.  I put another 10k into it at 50k.  But since then I've dca'd into it at 500 usd fiat per week.  My cost basis is around 40k, but I own about 1.1 bitcoin.  Its very frustrating to know that if I'd waited 5 months I'd be at about 2 bitcoin at least.  This doesn't at all mitigate my belief in bitcoins long term potential, I'm happy to be a part of this community despite the fact that I'm at a huge disadvantage.  Anyway yall have a great day and just know that there's people around like me, and you should be happy that you got into it at a time that's so much better than people like me! \n\np.s- I've drank a whole bottle of pino noir and this is my personal stream of consciousness at this moment, please forgive my odd writing style as I'm quite intoxicated.",
            "stickied": false,
            "comments": [
                {
                    "id": "ia2ijg8",
                    "author": "NiceDoctorBeam",
                    "score": 8,
                    "created_utc": 1653575566.0,
                    "response": "Pino Noir.  \n\nWell, then, get some Italian \"French bread\" and some really, really good Blue Cheese, aged.\n\nTear (do not cut) the bread into chunks.  Arrange pieces onto a cookie sheet.  Stuff chunks of the cheese into the nooks and crannies.  \n\nPut the sheet under your broiler.  Keep an eye.  When browned enough, pull them from the oven.  Open another bottle, wash down the 'cheese toast'.  Enjoy.  \n\nHold your Bitcoin.  When I first bought, there was an 85% drop.  I held.  It's worth it.  I promise.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia4439b",
                            "author": "TownConscious",
                            "score": 2,
                            "created_utc": 1653598987.0,
                            "response": "I slept it off, woke up, read your reply and now I'm HUNGRY.  Thanks a lot man.  Yes I'll HODL until the cows come home and hope for the best i suppose.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia4fk3k",
                                    "author": "NiceDoctorBeam",
                                    "score": 1,
                                    "created_utc": 1653604074.0,
                                    "response": "I used to work in a gourmet grocery store.  \n\nSome of the customers would share what they were making, and how... I would get hungry.  Some of them were professional chefs, others just loved to cook.  \n\nI was learning to cook.  I still am.  \n\nI'm going to learn to make carnitas - tender and spicy Mexican pork roast cut into chunks and pan-grilled for a good sear on one side.  \n\nOne of my friends usually has the cooking channel playing on the TV when I visit.  That usually makes me hungry.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia2pv4j",
                    "author": "bluecollarsavant29",
                    "score": 2,
                    "created_utc": 1653578572.0,
                    "response": "Same, bro. Same.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia43sgg",
                    "author": "Wolfos9",
                    "score": 2,
                    "created_utc": 1653598859.0,
                    "response": "Honestly, it's easy to think short term like that when you're not in the game that long. I also aped in in 2021 and have had similar thoughts. My average price was near ATH for a while but I've been slowly DCAing the average buy price down now I'm at like 40k I think and it's continually going down. But regardless of that I'm not upset because I'm thinking long term and BTC is at some point going back up and beyond ATH so I'm happy. It's way too easy when you have hindsight to complain.\n\nAlso, BTC was invented to replace the Fiat system not as an investment to get rich. Keep that in mind. It's meant to make people bankless and independent.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia4532d",
                            "author": "TownConscious",
                            "score": 2,
                            "created_utc": 1653599419.0,
                            "response": "Were in a very similar boat my friend, lets win in the long term!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia2vpu0",
                    "author": "Hefty-Interview4460",
                    "score": 3,
                    "created_utc": 1653580916.0,
                    "response": "First, bitcoin is not a belief, it's a risky speculative asset that hasn't yet been fully price-discovered. Maybe, for the utility it provides, it's not worth what you're still paying for it. Be careful, remember that your blind warm belief is someone else's cold hard profit.\n\nWhat you can do is reduce your exposure: diversify, and not into shitcoin, but in other uncorrelated assets (buy Euros, tobacco stocks, some gold exposure and a mortgage for a flat in Canada, or whatever completely isolated asset) so your mind is not ENTIRELY spinning around your mistake but can stroll around a variety of ups and down. I do that, and there's always something green, plus, you can rebalance.\n\nRebalancing, which only works if you're diversified enough, allows you to sell when one asset becomes outsized in your portfolio to buy an undersized asset. For myself I have stocks in all continents: sometimes the US stocks, which I want at 30% of my stock investment, become 35% because they grow too high in value: I sell and buy Chinese stocks, dumping because Jack Ma blurted an insult. Then the month after, it's the opposite. I sell when too high, buy when too low, stay at the same relative size but the pie grows.\n\nDo not consider bitcoin as a religion, an ideology, a goal for the world, a revolution or a technology. It's a way to make a buck for when you retire and can't work at McDonald's anymore.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia449zp",
                            "author": "TownConscious",
                            "score": 1,
                            "created_utc": 1653599067.0,
                            "response": "I'll never have to work at McDonalds but thank you for you reply. Bitcoin is about 10% of my portfolio that includes real estate, mutual funds and my wifes 401k.  Thank you for your reply!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia36rf7",
                    "author": "Tiggsweld",
                    "score": 3,
                    "created_utc": 1653585243.0,
                    "response": "Set limit orders.   Btc is traded like the market.  The huge moves will come but not as often.   Given 24 hr market and BTC is maturing a bit, take a look at the 4 hr chart with Bollinger trend lines.  Set your limit orders a hundred or 2 above the lower channel trend line.  We have been in a 29,400 to 30k high end, but dips to low 28s really quick and is scoffed up fast.  Happened today as well.  Took less than an hour to get right back to 29500 from 28,100.  If u set the orders low they will click.  If it blasts off move your order up to the lower end of where it stabilizes.  Having an order in the books will also help with buying pressure.  It can halt the drops with enough orders.  \n\nJust buying spot price is feeding the bears and shorts.  Set orders and build up the books.  If your next DCA comes and your order hasn't converted, adjust as needed and set another order.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia44gk7",
                            "author": "TownConscious",
                            "score": 1,
                            "created_utc": 1653599146.0,
                            "response": "I own a business and don't have the time to sit on a computer and look at graphs.  That's why I  just dca and forget about it.  It just sucks that I got into it at the time that I did man.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia3x2ai",
                    "author": "igadjeed",
                    "score": 1,
                    "created_utc": 1653596004.0,
                    "response": "> please forgive\n\nNo",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia44yma",
                            "author": "TownConscious",
                            "score": 0,
                            "created_utc": 1653599365.0,
                            "response": "Your unwillingness to forgive me has been accepted.  I took a whole bottle to the dome and played league of legends for 4 hours.  When my wife finds out she will, do absolutely nothing and Ill go about my day knowing I did the right thing.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia47p0z",
                                    "author": "igadjeed",
                                    "score": 1,
                                    "created_utc": 1653600563.0,
                                    "response": "There are few things more boring than a person boasting about intoxication",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia4a3kt",
                                            "author": "TownConscious",
                                            "score": 0,
                                            "created_utc": 1653601626.0,
                                            "response": "Damn you are grumpy as hell.  I'm guessing you are old, poor and in bad health.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia2r44w",
                    "author": "konokonohamaru",
                    "score": 1,
                    "created_utc": 1653579075.0,
                    "response": "So you're class of 2021 and you somehow have 35k to spare as well as 500 a week of cash to put in. \n\nYou'll be fine",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia44li0",
                            "author": "TownConscious",
                            "score": 2,
                            "created_utc": 1653599205.0,
                            "response": "I own a profitable trucking business and have payed attention to finances for only about 5 years now.  I used to be a stoner video gamer and was poor.  I think I'll be fine as well thank you for the kind words home boy.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia44mo4",
                                    "author": "Paid-Not-Payed-Bot",
                                    "score": 1,
                                    "created_utc": 1653599220.0,
                                    "response": "> and have *paid* attention to\n\nFTFY.\n\nAlthough *payed* exists (the reason why autocorrection didn't help you), it is only correct in:\n\n * Nautical context, when it means to paint a surface, or to cover with something like tar or resin in order to make it waterproof or corrosion-resistant. *The deck is yet to be payed.*\n\n * *Payed out* when letting strings, cables or ropes out, by slacking them. *The rope is payed out! You can pull now.*\n\nUnfortunately, I was unable to find nautical or rope-related words in your comment.\n\n*Beep, boop, I'm a bot*",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia2yxsi",
                    "author": "atmc80",
                    "score": 1,
                    "created_utc": 1653582183.0,
                    "response": "I’m class of 2019. My experience was more sideways and started slower figuring it was the speculative part of my portfolio. My resolve to stack definitely waned at periods that I should have been reducing my DCA and stacking harder. Someday we’ll be at a point where 40k is a bargain. Just gotta do the time.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia44opn",
                            "author": "TownConscious",
                            "score": 1,
                            "created_utc": 1653599245.0,
                            "response": "word, time will heal this wound (hopefully) :D",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia3r2r1",
                    "author": "OpticallyMosache",
                    "score": 1,
                    "created_utc": 1653593511.0,
                    "response": "Two ways to look at it:\n\n1. You got drawn into the hype period of BTC and are now paying the price of admission. Your purchases provided the exit liquidity to the 2017 holders that bought at the top. Your turn will come in the next hype cycle when you can gradually sell some of your coin and know a return to the 200WMA or further crash is inevitable.\n2. You invested in an asset class that has huge upside potential over the next 10-20 years. Your $40k BTC will 5-10X and you'll be happy with your portfolio. Just hodl a ride out the cycles.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia44srf",
                            "author": "TownConscious",
                            "score": 1,
                            "created_utc": 1653599294.0,
                            "response": "Your point number two gives me hope and solace that this move will eventually pay off.  Thank you.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia48t01",
                    "author": "Twoubleff",
                    "score": 1,
                    "created_utc": 1653601058.0,
                    "response": "You'll be fine, everyone made that experience at some time. some at $60, $600, $6,000 or $60,000. They'd all have more BTC today for all of them it won't matter. Congrats to be one of the 21 million people EVER to become a full-coiner, you made it! You won. Instead of trying to get more by trying to time the market, start to not care about the price anymore and DCA for ease of mind.\n\nYou made it, that's all that matters. Focus your energy on securing that Bitcoin now.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia4aio8",
                            "author": "TownConscious",
                            "score": 1,
                            "created_utc": 1653601809.0,
                            "response": "I buy via Strike the immediately transfer to a Ledger hardware wallet.  Thanks for the reply sir.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia60l5r",
                                    "author": "Twoubleff",
                                    "score": 1,
                                    "created_utc": 1653635555.0,
                                    "response": "perfect. secure your seed is most important now. learn about multi sig at some point, there are companies helping with that like unchained or casa. you can do it yourself with specter or sparrow wallet. think about bus factor and inheritance.\n\nHappy Hodling",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}