{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ush460",
            "title": "For the first time in history using the Bitcoin layer 2 blockchain Liquid, by Blockstream, the MAVEN NFT Marketplace, Real Estate Division, recently completed a property sale as an NFT in Central America.",
            "url": "https://markets.financialcontent.com/ibtimes/article/247pressrelease-2022-5-18-transferring-real-property-as-an-nft-becomes-reality-in-latin-america",
            "author": "CoinCorner_Sam",
            "created_utc": 1652892094.0,
            "score": 1,
            "num_comments": 3,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i93gzp5",
                    "author": "NiceDoctorBeam",
                    "score": 1,
                    "created_utc": 1652894164.0,
                    "response": "NFTs are scams.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i93mnze",
                            "author": "CoinCorner_Sam",
                            "score": 3,
                            "created_utc": 1652896442.0,
                            "response": "Is it you Mark? You're correct if we're talking about jpegs. Although we aren't in this case.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i95vuyg",
                    "author": "jkkkiiu9",
                    "score": 1,
                    "created_utc": 1652932903.0,
                    "response": "🔥 DINOSTEP.APP 🔥\n\n🦖 The First Move To Earn App With Virtual Dinosaurs\n👟 Earn while building healthy habits with the Dino\n✨ Varied NFTs\n💵 Passive Income Features\n💎 App Activation Code & NFT Drop For Fair Launch Contributors\n\n🚀 Fair Launch Starts On May 9th",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "ushas5",
            "title": "Why so many stablecoins?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/ushas5/why_so_many_stablecoins/",
            "author": "bidnspec",
            "created_utc": 1652892614.0,
            "score": 3,
            "num_comments": 20,
            "subreddit": "Bitcoin",
            "selftext": "Over 70% of bitcoin transactions involve stablecoins. (mostly Tether). Does that mean most purchases are by institutions and crypto whales? If it were individuals,  why would they buy tethers instead of just using their funds directly to acquire bitcoin?\n\n[https://newmoneyreview.com/index.php/2021/10/11/tether-dominates-bitcoin-trading/](https://newmoneyreview.com/index.php/2021/10/11/tether-dominates-bitcoin-trading/)\n\nI am also concern this maybe a sign of manipulation since Tether said they don't want to reveal their \"secret sauce.\"",
            "stickied": false,
            "comments": [
                {
                    "id": "i93grsg",
                    "author": "NiceDoctorBeam",
                    "score": 6,
                    "created_utc": 1652894074.0,
                    "response": "Criminal activities are lucrative.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i93emm6",
                    "author": "SmoothGoing",
                    "score": 3,
                    "created_utc": 1652893212.0,
                    "response": "Transactions don't involve fiat or any other coins. Trading does. Trades against stablecoins are taxable events but people think they aren't.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i93eo9v",
                    "author": "uncontrollableop",
                    "score": 1,
                    "created_utc": 1652893229.0,
                    "response": "\"most purchases\" in terms of volume obviously. whales control every market though all of time.  tether is easier to move than dollars.  that's why they were created. regulations are essentially a tax. so new tech that can circumvent regulation is a cost saving opportunity.     \n\nin fact tether spawned an entire class of bitcoin exchange which don't even require a banking relationship to operate a bitcoin/dollar exchange. the idea became very popular because fiat payment rails are very censorious and very difficult to gain access to.   it's near impossible, and costs millions of dollars to just find a bank willing to attempt a business relationship with a bitcoin exchange.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i987gjt",
                            "author": "igadjeed",
                            "score": 1,
                            "created_utc": 1652982007.0,
                            "response": "> tether spawned an entire class of bitcoin exchange which don't even require a banking relationship\n\nThese exchanges existed before Tether, but to use them the trader has to pick a coin as an intermediate for moving between exchanges and for holding during trading breaks. Bitcoin was the obvious choice, but is occasionally volatile. Stablecoins solve the \"which coin to use as intermediate\" problem with a choice which is supposedly not volatile (RIP UST)",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i93u07w",
                    "author": "hi3r0fant",
                    "score": 1,
                    "created_utc": 1652899415.0,
                    "response": "You buy stables , you stake them somewhere for ~10%.\nAfter a while and while you have some rewards you buy more BTC than you would with your initial fiat amount",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i955bq0",
                    "author": "manxkarst",
                    "score": 1,
                    "created_utc": 1652919887.0,
                    "response": "I’ll answer this one. Most bitcoin transactions are done in tether because of arbitration. You can buy bitcoin on one exchange at a low price with USDT in one country and then use another exchange in a different country to sell bitcoin at a higher price. This can happen a lot faster than using fiat",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i957vaq",
                            "author": "bidnspec",
                            "score": 2,
                            "created_utc": 1652921086.0,
                            "response": "I under stand from that standpoint but  when the managers of the primary currency refuse to subject it to an independent audit, many wonder if they essentially have a license to counterfeit by abandoning the pledge for 1 to 1 reserves. That is what concerns me when I see ramp job after ramp job by some big time players whose primary objective is not to increase their position but to jack the price up. It is very similar to the same hijinks that went on in the nasdaq in the late 90s.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i95ign5",
                                    "author": "manxkarst",
                                    "score": 1,
                                    "created_utc": 1652926000.0,
                                    "response": "When someone buys USDT. They are not getting counterfeit USD, but an IOU that is equal to $1. Tether is not backed by entirely by dollars, but is backed by cash equivalents and short term debt etc. etc. Tether and Bitfinex is still being watched by the NY attorney general’s office. They are required to publish attestations and segregate corporate and client accounts. From what I’ve read online, They are regulated by the NY attorney general until 2024. If tether does not follow what they say then further legal action may be taken against them. On tethers official website there is numerous warnings that USDT is not legal tender, and there is no insurance if anything happens to your USDT.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i989lmo",
                                            "author": "igadjeed",
                                            "score": 1,
                                            "created_utc": 1652982861.0,
                                            "response": "> backed by cash equivalents and short term debt etc. etc\n\nA large percentage of \"etc. etc\" are fake loans - paper which has no value, because they are no-recourse loans to related parties. They're claiming billions of asset value in these loans which have zero value\n\n> Tether and Bitfinex is still being watched by the NY attorney general’s office\n\nEvery deadline to publish details of asset backing has been met with a partial list of vague claims such as the one you made, and never an audit, contrary to the settlement",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i989223",
                                    "author": "igadjeed",
                                    "score": 1,
                                    "created_utc": 1652982641.0,
                                    "response": "> when the managers of the primary currency refuse to subject it to an independent audit, many wonder if they essentially have a license to counterfeit by abandoning the pledge for 1 to 1 reserves\n\nThis is old news, happened in 2017. Everybody knows Tether sacked their auditor because he wasn't flexible enough to lie about the fractional reserve. Even this week, the Tether CTO tweeted about their failure to publish audits\n\n> Ardoino said Tether is still working on an audit. \"Hopefully regulators will push more auditing firms to be more crypto friendly,\" he said\n\nThat is, \"Tether is special. Auditors have to publish what we tell them\"\n\n> jack the price up\n\nIt's a stablecoin. The price stays stable at USD1.00",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i97e7dh",
                    "author": "tripj33",
                    "score": 1,
                    "created_utc": 1652970060.0,
                    "response": "Because the easiest way to do this is through usdt",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i986zov",
                    "author": "igadjeed",
                    "score": 1,
                    "created_utc": 1652981817.0,
                    "response": "Most trading is on exchanges which don't do \"their funds\" in the sense of fiat money in a bank account. So, \"their funds\" are stablecoins  \n\nSay you want to trade Bitcoin and a portfolio of shitcoins across a few dozen exchanges. Most of those exchanges do not have a banking relationship. You can not send them USD. Also, if you're joining so many exchanges, it makes sense to only link a bank account to one exchange account  \n\nYou get a Kraken account, send USD to Kraken, buy USDT, send the USDT to your accounts at dozens of other exchanges, trade Bitcoin and shitcoins",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i93e8tq",
                    "author": "randsack",
                    "score": 0,
                    "created_utc": 1652893058.0,
                    "response": "I use stable coins to get off the volatility until I am able to re-buy or re-sell.\nLet's say I suspect a BTC crash, and don't want to buy a BTC Short coin, I can sit out the crash on the stable coin until I Feel ready to re-buy the dip.\n\nEdit: There are also a lot of exchanges that use coin pairs.\nYou can buy USDT / BTC and vise versa. When you sell it automatically gives you USDT. This is mostly for day trading the currency pair of your choice.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i93mukc",
                            "author": "jettblackson91",
                            "score": 1,
                            "created_utc": 1652896514.0,
                            "response": "I’ve never understood… What’s the advantage of this to just selling it for USD and having cash sitting in your USD wallet?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i93qyzf",
                                    "author": "mrmiya",
                                    "score": 0,
                                    "created_utc": 1652898171.0,
                                    "response": "USDT interest 12% per year. USD interest -8% inflation",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i93rbbw",
                                            "author": "jettblackson91",
                                            "score": 1,
                                            "created_utc": 1652898312.0,
                                            "response": "That makes sense, totally get that. Is it automatic or do you have to do something further to get the interest in say a USDT or USC?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i93upe7",
                                                    "author": "wesblog",
                                                    "score": 1,
                                                    "created_utc": 1652899705.0,
                                                    "response": "Depends on where you store your stablecoin. Some places require you to enter a lockup period like a CD, others just give you weekly interest on any crypto you hold with them.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "id": "ushckz",
            "title": "Russia could legalise cryptocurrencies as means of payment - industry minister",
            "url": "https://www.reddit.com/r/Bitcoin/comments/ushckz/russia_could_legalise_cryptocurrencies_as_means/",
            "author": "junkpott",
            "created_utc": 1652892753.0,
            "score": 79,
            "num_comments": 47,
            "subreddit": "Bitcoin",
            "selftext": "Please don't get too political on this. This is really huge, and I can assure you, that this guy's words can mean a lot (as the Russian newspapers are catching up with the news already)\n\n&#x200B;\n\nUPD: bad translation from Reuters. He actually said \"Cryptocurrency will DEFINITELY be legalized\"\n\n[https://www.reuters.com/business/finance/russia-could-legalise-cryptocurrencies-means-payment-industry-minister-2022-05-18/](https://www.reuters.com/business/finance/russia-could-legalise-cryptocurrencies-means-payment-industry-minister-2022-05-18/)",
            "stickied": false,
            "comments": [
                {
                    "id": "i9699of",
                    "author": "fjjjfjfnfnfng",
                    "score": 3,
                    "created_utc": 1652942170.0,
                    "response": "Russia should focus on bitcoin and separate it from the term “cryptocurrencies”, if they believe the crypto bullshit they’ll quickly figure out they are one call to AWS away from being  geoblocked, just like SWIFT",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9750c9",
                            "author": "cryptokingmylo",
                            "score": 1,
                            "created_utc": 1652965840.0,
                            "response": "I'm pretty sure they would host thier own..",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9404il",
                    "author": "donaudelta",
                    "score": 11,
                    "created_utc": 1652901919.0,
                    "response": "imagine crypto being used in shops and P2P like intended in Satoshi paper.... amazing!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i97k13h",
                            "author": "zhou010010",
                            "score": 1,
                            "created_utc": 1652972536.0,
                            "response": "That is what we look for the future is still yet unknown to us. I just hope that days turn out to be perfect!\n\nWe want crypto to dominate at much wider scale and people be more adaptive to it!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i93pouj",
                    "author": "Marcion_Sinope",
                    "score": 6,
                    "created_utc": 1652897652.0,
                    "response": "Good for bitcoin but bad that the world is under the thumb of an increasingly hostile and arrogant unipolar financial junta.\n\nThe central banks and the small inbred group of parasites that control them need their plug pulled.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i94qz6x",
                            "author": "turick",
                            "score": 9,
                            "created_utc": 1652913172.0,
                            "response": "That's the thing about bitcoin. EVERYONE can use it. The evil, immoral, despicable along with the good. It doesn't discriminate in ANY way. It doesn't care how old you are, your race, sex, gender, religion, etc.\n\nIt's a good thing that we are circumventing the centralized few who get to dictate who is good, who is bad, and who can keep their money and who can't.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i93n4wo",
                    "author": "Nada_Lives",
                    "score": 7,
                    "created_utc": 1652896629.0,
                    "response": "Russia, the U.S., and everyone else cannot do a thing to restrict the use of Bitcoin, legal or not.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i93ul0s",
                            "author": "Sudden-Owl-3571",
                            "score": 5,
                            "created_utc": 1652899655.0,
                            "response": "And the biggest winners will be earliest adopters…",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i97yajm",
                                    "author": "FrreshLemons",
                                    "score": 2,
                                    "created_utc": 1652978332.0,
                                    "response": "The earliest adopters and the long term holders are the one who get the benefits.\n\nBecause long term it is indeed all about the one who holds long gains the more.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i94raun",
                            "author": "turick",
                            "score": 2,
                            "created_utc": 1652913318.0,
                            "response": "So true. Look at the news coming out about Chinese mining... Outlawed and turns out they have a significant portion of the global hash rate.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i93wo7l",
                            "author": "Marokiii",
                            "score": 1,
                            "created_utc": 1652900506.0,
                            "response": "Can't they? They can't block the use of it for buying things on small scales but they could legally block people from buying crypto, they can block companies from legally operating in their own country, they can legislate mining farms at the energy provider level.\n\nIf the usa came out today with a legal way to ban people exchanging us $ for bitcoin than the price of bitcoin would drop like a stone and most likely never recover.\n\nEdit: a easy way to restrict the adoption of bitcoin... never adopt it as legal tender. That means no employer will be able to pay you with it. You won't be able to pay your taxes with it, you won't be able to pay any govt fee you need to pay, etc. That seems like an incredibly easy way to restrict the adoption of bitcoin and other cryptos.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i95iycy",
                                    "author": "planet_hallows",
                                    "score": 2,
                                    "created_utc": 1652926240.0,
                                    "response": "That's where the black market comes in. Imagine if every country but the big guys (usa, china, eu) adopted it as legal tender. International traders would then want it and us, Chinese and eu citizens would figure out ways to get paid and pay with it -- all tax free because it's illegal anyway.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i96v0sk",
                                            "author": "andres25d",
                                            "score": 1,
                                            "created_utc": 1652960248.0,
                                            "response": "I see why Black market is out a major concern for every country things like this should indeed be stopped!",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i93zdai",
                                    "author": "Nada_Lives",
                                    "score": 1,
                                    "created_utc": 1652901613.0,
                                    "response": "And they do! They block with all their benefits and services.\n\nBitcoin doesn't care.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i96oxo8",
                                            "author": "lordhobbington",
                                            "score": 1,
                                            "created_utc": 1652955923.0,
                                            "response": "That would be great like things should indeed be good not to bother about.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9843hl",
                                    "author": "jshouhbsb5",
                                    "score": 1,
                                    "created_utc": 1652980660.0,
                                    "response": "Why would someone just feel to restrict the adoption of Bitcoin like people should get more into it.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i986ksf",
                                            "author": "Marokiii",
                                            "score": 1,
                                            "created_utc": 1652981653.0,
                                            "response": "because countries need to control financial markets so that they can run the country properly.\n\nimagine if the world switched to bitcoin and the pandemic hit and people lost their job like they did, but then the govt said 'oops, we have no control over the financial markets, cant print or restrict accesss to money, cant provide stimulus, cant raise interest rates, cant do any of the things that people need govts to do to manage a country wide economy. \n\ncountries will move to ban crypto because they use huge amounts of power for no 'real' purpose that provides tangible economic benefits. as more and more effects of climate change are felt the drain on the power grid will become ever higher. we should be building more power plants to deal with that, but we can also restrict power consumption as well. \n\ncountries need tax revenue. unless the govt is able to track all the bitcoins and each transaction and who it went from to who it went to, and match those transactions to individual people and businesses than it will be used to avoid paying taxes. a bunch of people have responded to some of my other posts saying that they dont care if its banned since that means all transactions will be tax free. countries need people to pay taxes otherwise societies dont work.\n\neconomic sanctions are a very, very, very good thing. like perhaps the best thing to happen to global politics in the last 50 years. without the ability for countries to sanction other countries financially than that either means we let some countries run wild over smaller countries(like Russia invading Ukraine), or we on a global scale go to war to stop them. if it wasnt for global financial sanctions, we either would have had to leave Ukraine alone to fend for itself(providing arms without financially hitting Russia probably wouldnt have as been effective at saving Ukraine), or we would have had to go in militarily ourselves.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i96vmi2",
                            "author": "nic1058",
                            "score": 1,
                            "created_utc": 1652960624.0,
                            "response": "Indeed true though because Bitcoin is what indeed people look for as a worthy investment and none can take it's place.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i950m9h",
                    "author": "JimBloc",
                    "score": 2,
                    "created_utc": 1652917649.0,
                    "response": "We have to remember people that sanctions hurt people on ground. And no one sanctioned west for destroying half the Middle East, but then we liberated the s*** of them and their fucking  \nresources. Fuck yeah",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i97tzz9",
                            "author": "ghosn2013",
                            "score": 1,
                            "created_utc": 1652976606.0,
                            "response": "That would be better enough to just stick onto the point and let things go accordingly. \n\nWe should just put our main focus on the adoption and on how to people let know more about Bitcoin",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i93erqz",
                    "author": "Few_Budget_2510",
                    "score": -3,
                    "created_utc": 1652893267.0,
                    "response": "I think we would see a large sell off if Russia were to adopt Bitcoin and/or other cryptocurrencies.\n\nShort terms it might scare people off, but bitcoin as a project will not suffer and only be bolstered by such a situation.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i93fldv",
                            "author": "junkpott",
                            "score": 3,
                            "created_utc": 1652893595.0,
                            "response": "Totally agree. Although it is really relieving to hear such news, I'm afraid that the EU or the US can follow up with consequent bans as to keep the economic sanctions alive (you can't buy sh!t in Russia from foreign online stores atm). I think the government views this as a bypass of some sorts, not as a call for decentralization, sadly",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i93l5k4",
                            "author": "VPNApe",
                            "score": 3,
                            "created_utc": 1652895844.0,
                            "response": "If people understand Bitcoin then it won't scare them. If they don't understand Bitcoin they were going to flake for some random reason anyways",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i93t8ol",
                            "author": "PhotographOwn8836",
                            "score": 1,
                            "created_utc": 1652899100.0,
                            "response": "Perhaps a short term sell off with a quick rebound. Once Russia adopts Bitcoin every other country will feel the pressure of game theory 10 fold and it will be far more bullish than El Salvador adopting.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i93wv0d",
                                    "author": "Ajax_ZQN",
                                    "score": 1,
                                    "created_utc": 1652900583.0,
                                    "response": "I’ll just [leave this here](https://www.reddit.com/r/Bitcoin/comments/tm2e3k/why_us_government_is_afraid_of_el_salvador/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i94hpj9",
                                            "author": "kylelock8788",
                                            "score": 2,
                                            "created_utc": 1652909152.0,
                                            "response": "Great video of a network effect 👍🏼",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i97de5g",
                                                    "author": "hoangnd1",
                                                    "score": 1,
                                                    "created_utc": 1652969710.0,
                                                    "response": "Like it very much appreciation to the one who made this.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i97kr3l",
                                            "author": "daudinhhero",
                                            "score": 1,
                                            "created_utc": 1652972836.0,
                                            "response": "This indeed absolutely amazing though. Just liked it pretty well!",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i97nxb2",
                                    "author": "schoutna",
                                    "score": 1,
                                    "created_utc": 1652974154.0,
                                    "response": "But that would indeed take time for Russia to adapt Bitcoin. There is an 'if' whenever we talk adaption in Russia!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i94kzhr",
                    "author": "Stimorolgum",
                    "score": 0,
                    "created_utc": 1652910554.0,
                    "response": "The war in Ukraine is for the Petro dollar",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i94qrfh",
                            "author": "Stardust8356",
                            "score": 2,
                            "created_utc": 1652913074.0,
                            "response": "how's so",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i94xgqi",
                            "author": "pierreman",
                            "score": 0,
                            "created_utc": 1652916164.0,
                            "response": "All wars since WW1 have been about oil and land.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i960o9j",
                                    "author": "Stimorolgum",
                                    "score": 1,
                                    "created_utc": 1652935900.0,
                                    "response": "And if you can force governments to only use dollar in world trade you get the oil for free",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i98g5b2",
                                            "author": "Petr1951",
                                            "score": 3,
                                            "created_utc": 1652985549.0,
                                            "response": "How can force government to trade oil for free. That ain't gonna happen though we know that well!",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i98gs1f",
                                                    "author": "Stimorolgum",
                                                    "score": 1,
                                                    "created_utc": 1652985808.0,
                                                    "response": "If you are the federal reserve you print the dollar for free.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i98o7jf",
                                    "author": "nowa5151",
                                    "score": 1,
                                    "created_utc": 1652988831.0,
                                    "response": "Are you just sure about that like I see some hidden truths are still lying beneath and we are still unaware about that!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i95w9wc",
                    "author": "Johndrc",
                    "score": 1,
                    "created_utc": 1652933143.0,
                    "response": "Pamp",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i96swsu",
                    "author": "Bitcoin__Hodler",
                    "score": 1,
                    "created_utc": 1652958860.0,
                    "response": "Da!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i94liw6",
                    "author": "bitrequest",
                    "score": -1,
                    "created_utc": 1652910789.0,
                    "response": "Bitcoin should not have to wait for permission.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i96x46s",
                            "author": "Dosermen",
                            "score": 1,
                            "created_utc": 1652961536.0,
                            "response": "Umm I see that though it even requires permission though.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i957n4w",
                    "author": "NegotiationNice9291",
                    "score": 0,
                    "created_utc": 1652920978.0,
                    "response": "They do everything shitty and I doubt this time it'll somehow be different",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i96py7w",
                            "author": "magnat007",
                            "score": 1,
                            "created_utc": 1652956728.0,
                            "response": "We can just hope for that but not everything is not that shitty enough.\n\nLet's just be positive enough and have some good hopes from the market nevertheless we ain't going anywhere though!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "ush7i5",
            "title": "Can someone here design a Bitcoin mining immersion T-Shirt?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/ush7i5/can_someone_here_design_a_bitcoin_mining/",
            "author": "Leader92",
            "created_utc": 1652892353.0,
            "score": 2,
            "num_comments": 4,
            "subreddit": "Bitcoin",
            "selftext": "I'm beyond advocating for Bitcoin, I'm now so consumed with mining that I want the price to go down to buy machines for cheap. Could someone design an S19 machine dipped into the liquid and be creative about it? (adding a fan and a radiator on the side with pipes) Something similar to this quality of drawing: \n\nhttps://preview.redd.it/3wli37kxj9091.jpg?width=1200&format=pjpg&auto=webp&s=ed8a0fd2125fcc6a9161921266c48253e1185e1a",
            "stickied": false,
            "comments": [
                {
                    "id": "i93r42a",
                    "author": "mrmiya",
                    "score": 1,
                    "created_utc": 1652898230.0,
                    "response": "Yea and then you sell the tshirts with artwork someone made for free, good plan😂",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i93rotw",
                            "author": "Leader92",
                            "score": 2,
                            "created_utc": 1652898464.0,
                            "response": "Why would someone do it for free? I’m willing to pay for sure.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i98md1f",
                                    "author": "mrmiya",
                                    "score": 1,
                                    "created_utc": 1652988074.0,
                                    "response": "I was jk haha, but what did you mean by “the liquid”?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "id": "ush4fl",
            "title": "marc andreessen recent takes on BTC",
            "url": "https://www.reddit.com/r/Bitcoin/comments/ush4fl/marc_andreessen_recent_takes_on_btc/",
            "author": "woxley",
            "created_utc": 1652892115.0,
            "score": 4,
            "num_comments": 8,
            "subreddit": "Bitcoin",
            "selftext": "Hi everyone Marc was recently on a podcast called EconTalk. \n\nReminded why i was bullish on btc and gave some surprising takes. \n\nA few I really liked: \n\n\\--80% of the world doesn't have access to a stable currency or the U.S. treasury\n\n\\--never been internet native money\n\n\\-- Obsolete technologies become art. Examples include horseback riding and the violin.\n\nI wrote a twitter thread on some of the big ideas: https://twitter.com/billyoxley15/status/1526954771432677376?s=20&t=nqoQuGmnTw5p6mM8vb8NcA",
            "stickied": false,
            "comments": [
                {
                    "id": "i93gx2k",
                    "author": "NiceDoctorBeam",
                    "score": 2,
                    "created_utc": 1652894134.0,
                    "response": "Violins are not obsolete.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i93nztu",
                            "author": "Nada_Lives",
                            "score": 1,
                            "created_utc": 1652896975.0,
                            "response": "Every day we hear news of street violins. Hope they never come here!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i95wgco",
                    "author": "JanPB",
                    "score": 1,
                    "created_utc": 1652933252.0,
                    "response": "Violin is not obsolete technology. It's a ludicrous claim.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i97by8o",
                            "author": "ScamJustice",
                            "score": 1,
                            "created_utc": 1652969076.0,
                            "response": "Electric violins have made regular violins obsolete",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i98xmiw",
                                    "author": "JanPB",
                                    "score": 1,
                                    "created_utc": 1652993386.0,
                                    "response": "Not even worth responding. (How's that for the Goedel sentence?)",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i989yh5",
                    "author": "igadjeed",
                    "score": 1,
                    "created_utc": 1652983007.0,
                    "response": "> I wrote a twitter thread\n\nYou must be desperate to be promoting your Twits here",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}