{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "v06fq1",
            "title": "矿机。有需要的联系",
            "url": "https://www.reddit.com/gallery/v06fq1",
            "author": "Alternative-Might473",
            "created_utc": 1653811095.0,
            "score": 1,
            "num_comments": 0,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "v06fts",
            "title": "Bitcoin Vietnam",
            "url": "https://www.reddit.com/r/Bitcoin/comments/v06fts/bitcoin_vietnam/",
            "author": "Internal-Ad232",
            "created_utc": 1653811109.0,
            "score": 1,
            "num_comments": 11,
            "subreddit": "Bitcoin",
            "selftext": "Can anyone share if Cryptocurrency trading, specifically BTC, is legal in Vietnam? I have been reading mixed things on the web. I currently add cash to a trading platform through a US based bank but am wanting to switch all of my deposits/withdrawals to go through my Vietnamese bank.",
            "stickied": false,
            "comments": [
                {
                    "id": "iaem53r",
                    "author": "BTCMachineElf",
                    "score": 6,
                    "created_utc": 1653811970.0,
                    "response": "I live in Vietnam. The only thing that's not legal is using it at point of sale. Everything else is fine. I highly recommend using [vbtc.exchange](https://vbtc.exchange) or [bitcoinvn.io](https://bitcoinvn.io),. they've been operating a long time and the staff is attentive and helpful, and can send money to any Vietnamese bank account.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaet8hx",
                            "author": "ColdFusion3456",
                            "score": 1,
                            "created_utc": 1653818406.0,
                            "response": "I buy stuff with it all the time. Them noodles. I’ll never tell where I buy. They can throw me in jail. I’ll never tell",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iaeue01",
                                    "author": "BTCMachineElf",
                                    "score": 1,
                                    "created_utc": 1653819425.0,
                                    "response": "LoL. That's right. Fight the power. :)\n\nThey have no way to enforce or be aware of such transactions. And theres a startup, Neutronpay, enabling lightning payments for retailers here, by exchanging bitcoin for VND at the point of sale. So that law is pretty impotent.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iaeld49",
                    "author": "dat9553",
                    "score": 2,
                    "created_utc": 1653811281.0,
                    "response": "VN thì tui dùng Aliniex",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaelh20",
                            "author": "Internal-Ad232",
                            "score": 1,
                            "created_utc": 1653811381.0,
                            "response": "Is it legal though is the question. I don’t want to have banking transactions to an exchange and then an audit that results in a fine if it’s illegal",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iaeltgr",
                                    "author": "dat9553",
                                    "score": 2,
                                    "created_utc": 1653811676.0,
                                    "response": "that's a Vietnamese exchange. If their business is illegal, it can't operate till this day",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iaem978",
                    "author": "Internal-Ad232",
                    "score": 1,
                    "created_utc": 1653812073.0,
                    "response": "As a follow up on this thread, do you have to report capital gains on BTC in Vietnam?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaenvpe",
                            "author": "BTCMachineElf",
                            "score": 2,
                            "created_utc": 1653813536.0,
                            "response": "Nobody here pays taxes on bitcoin/crypto gains.\n\nYou can even buy non-kyc using the links I gave you.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iaememc",
                    "author": "bluetuxedo22",
                    "score": 1,
                    "created_utc": 1653812210.0,
                    "response": "Binance should work if your in Vietnam.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaep7ap",
                    "author": "solomonsatoshi",
                    "score": 1,
                    "created_utc": 1653814746.0,
                    "response": "Under pressure from China, most of Asia is banning use of Bitcoin for MoE.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "v069bw",
            "title": "A solution to let the network scale",
            "url": "https://www.reddit.com/r/Bitcoin/comments/v069bw/a_solution_to_let_the_network_scale/",
            "author": "kemoyin_network",
            "created_utc": 1653810209.0,
            "score": 0,
            "num_comments": 21,
            "subreddit": "Bitcoin",
            "selftext": "Hi, I have made a few thought experiments about the scalability problem of bitcoin and wanted to present them to a wider community.\n\n# Scalability issue\n\nThe main problem with the scalability issue is that every node competes against each other, instead of working together. This inevitably let to centralization in mining power.\n\n# Solution\n\nScalability without compromises in security and decentralization can only be achieved when solving the inherent problem of the mining race. When two disjunct blocks are mined. Disjunct meaning that all transactions are unique. Then the work has been efficiently split in two. But only one of the blocks will survive the pruning in the long run. But if we were to allow merging of such blocks the network will scale as compute power has essentially been shared.\n\nThis leads to a duplication of mining fees and removes the capacity limit of 21 million bitcoin. To re-enable this the mining fee can be split in fractions of 2 and the chains that are going to be merged have to have at maximum a minted value corresponding to the original reward function at this time.\n\nFurther the time two branches are allowed to be separated has to be limited, to discourage forks and a large amount of retakes of transactions. ~~My suggestions is 144 blocks which corresponds to 1 day.~~ To detect the double spend transactions in a timely manner this is set to 2, which takes 20 minutes in a highly connected network. All chains that have a last common predecessor before this time, except the chain which has accumulated the most blocks will be discarded.\n\nA relative easy rule has to be that chains to merge have to have the same block height to keep the race to 10 minutes.\n\nA valid question for all of this appears here. Why would anyone reduce his mining reward. The answer goes back to economics. If one were to enhance ones own mining power he would be faster, but only for a short amount of time. But if he were to add a new branch then he could increase his value generation with throughput from mining fees without time limit.\n\n# Further problems\n\nWith infinite transaction throughput there is the problem with space to store the block chain (now a DAG), as it will grow with the amount of transactions and the current rule of 70 to 80 GB per year is not valid any more.\n\nIf I have overlooked something or this solution does not work, I am open for feedback and suggestions.\n\n&#x200B;\n\nEdit: changed branch separation from 144 to 2",
            "stickied": false,
            "comments": [
                {
                    "id": "iaf1ybp",
                    "author": "pink_raya",
                    "score": 9,
                    "created_utc": 1653825542.0,
                    "response": "just found out about bitcoin and I'm here to fix it, volume 76673838937.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaf5s79",
                            "author": "BTC_Deepfuckvalue",
                            "score": 5,
                            "created_utc": 1653828064.0,
                            "response": "Came here to say this 👍",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iaekvww",
                    "author": "Amoci",
                    "score": 6,
                    "created_utc": 1653810854.0,
                    "response": "Competition leads to decentralization, contrary to your proposition, and therefore making your post null. https://nbloom.people.stanford.edu/sites/g/files/sbiybj4746/f/bloomsadunvanreenen_aerpp.pdf",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaellcj",
                            "author": "kemoyin_network",
                            "score": -4,
                            "created_utc": 1653811482.0,
                            "response": "I do not understand, as the current protocol clearly incentivizes centralization (mining pool) to get a small portion of the reward. My proposal would lead to a competition on transaction throughput.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iaelxi1",
                                    "author": "Amoci",
                                    "score": 3,
                                    "created_utc": 1653811775.0,
                                    "response": "A mining pool is a solution to the problem: “How can a small miner (you) compete with a big miner?”\n\nIt allows many smaller miners to combine their power. It’s actually helping decentralization.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iaeohha",
                                            "author": "kemoyin_network",
                                            "score": -1,
                                            "created_utc": 1653814093.0,
                                            "response": "Ok, together with shared rewards and resources we solve a problem, but we make the underlying problem harder and with added resources the throughput does not change.\n\nA few years ago I read about a possible merger between two mining pools which would take over a large percentage of the mining power and there was a large outcry because of an impending 51% attack, but I cannot find an article about it.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iaeqp4c",
                                                    "author": "Amoci",
                                                    "score": 3,
                                                    "created_utc": 1653816088.0,
                                                    "response": ">Ok, together with shared rewards and resources we solve a problem, but we make the underlying problem harder and with added resources the throughput does not change.\n\nAlmost sounds like you're describing difficulty adjustment? Google: Bitcoin Difficulty Adjustment. Might be the answer you're looking for.\n\nAnd regardless of the article you cannot locate at the moment, the current situation is not the one in the article, thus it is pointless to cite.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iaelqzx",
                    "author": "codingwithcoffee",
                    "score": 3,
                    "created_utc": 1653811618.0,
                    "response": "Welcome to Reddit…\n\nCurious why you made no references to Lightning Network or any other previous attempts to address scaling (like increasing block size etc.).\n\nMy first reaction to this proposal is that it appears like it would allow every miner to effectively grow their own chain of transactions for up to an entire day - resulting in a massively increased difficulty to resolve the “correct” set(s) of chains to “merge” for all miners and nodes.\n\nAnd because the “day” starts for each miner at an arbitrary time, there would be miners with varying length chains all trying to get their chain to be “merged in” for up to 24 hours.\n\nTransactions could potentially be included in multiple blocks because until the chain is “confirmed” the transaction is available for other miners to include in a block. \n\nTransaction times would blow out because now you would need to potentially wait up to 24 hours to know your transaction had been confirmed (chain successfully merged).\n\nThe processing power to resolve and merge multiple potential blockchains would increase the complexity of mining exponentially - diverting miner processing power that would otherwise be securing the network through mining. \n\nAnd ultimately this undermines the security of the network - which is what gives Bitcoin its value. \n\nSorry - I don’t see it is a workable approach. \n\nBut hey - I am just a random stranger on the internet and certainly not the king of bitcoin!\n\nIf you want to pursue it - here is how to make a Bitcoin Proposal:\nhttps://river.com/learn/what-is-a-bitcoin-improvement-proposal-bip/#what-is-a-bitcoin-improvement-proposal\n\nHope it helps.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaeu1n4",
                            "author": "kemoyin_network",
                            "score": -4,
                            "created_utc": 1653819125.0,
                            "response": "The problem with the lightning network would be: What happens if it grows faster than it could tally up all transactions and commit them to the bitcoin blockchain. In my opinion this will lead to exactly the same problem we have now, just with compressed transactions.\n\nRemoving the block size limit could lead to spam and rapid growth of block chain size. But can be counteracted by miners that only allow transaction with a minimum fee. This would make the problem more elegant and simpler, but has been rejected by the community.\n\nAdditionally it would still lead to mining pools, as the arms race to be the first is still there.\n\nYes, the only way the overhead in merging the chains can be fixed is, if everyone does it frequently.\n\nThe resolving process, where m and n are the amount of possible dijunct transactions in each branch, will blow up to m\\*n which can be acceptable as long as m and n are small. O(m\\*n) could be decreased when sorting all transaction hashes in O((m+n)\\*log(m+n)) and then checking each neighbor hash.\n\nAnother thing is, if the miners do not cooperate and only try to solve the problem on their own it will come down to whoever has the branch with the most blocks after 24 hours. If there is a majority that plays nicely however, they would win in this scenario.\n\nEdit: Fixed formatting",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iafuyfx",
                                    "author": "codingwithcoffee",
                                    "score": 2,
                                    "created_utc": 1653840368.0,
                                    "response": "Lightning network will not “grow faster than it could tally up all transactions and commit them to the blockchain”. I think you may be confusing the Lightning Network as a whole with a single payment channel on the Lightning network. \n\nThe lightning network can theoretically scale to 1,000,000 transactions per second. Visa by comparison can scale to around 24,000 TPS and currently handles only around 1,700 TPS. There is plenty of capacity in the Lightning network. \n\n“If there is a majority that play nice…they would win” - do you see the problem here? In a system with massive financial incentives you are proposing a solution that relies on a majority “playing nice”. Game theory suggests this would attract a fair share of “bad actors”. The beauty of Bitcoin’s design (and the Lightning Network that works on top of it) is that there is no incentive for bad actors - in fact they are penalized. We don’t need to trust anyone to “play nice”. \n\nI suggest spending some time studying the Lightning Network. I think the problem you are trying to solve has already been solved.\n\nThis is a great collection of resources:\nhttps://www.lopp.net/lightning-information.html\n\nHope it helps.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iaewfry",
                    "author": "GaRGa77",
                    "score": 3,
                    "created_utc": 1653821249.0,
                    "response": "Go back to school",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaelq3k",
                    "author": "BTCMachineElf",
                    "score": 6,
                    "created_utc": 1653811597.0,
                    "response": "Lightning scales bitcoin. The problem is already solved.\n\nNo significant work goes into packing transactions into blocks. The only work done is in tweaking the nonce so that the hash beats the difficulty. Having two miners work on blocks with separate transactions does nothing to improve the network.\n\nAny altering of blocks to fix their header data to accommodate another unexpected block would change the hash and therefore require re-mining.\n\nAny changes to bitcoin must be backwards compatible with previous node software.\n\nSatoshi was a really smart guy, and some of the best minds in the world still work on bitcoin. If there was a better way to do things, they'd know.\n\n>The main problem with the scalability issue is that every node competes against each other\n\nMiners compete, not nodes. The main problem with scalability is maintaining decentralization and thus keeping the bar low for running a node.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaf5ytn",
                    "author": "Ima_Wreckyou",
                    "score": 2,
                    "created_utc": 1653828176.0,
                    "response": "I think you need to read about what PoW does before you make suggestions how to \"fix\" Bitcoin. Nothing about mining has anything to do with scalability.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iafjrlt",
                    "author": "na3than",
                    "score": 1,
                    "created_utc": 1653835344.0,
                    "response": "So, under your proposal, I could spend one UTXO multiple times as long as I submit each transaction to a different miner and leave town with the goods I receive before the end-of-day merge?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iag7upb",
                            "author": "kemoyin_network",
                            "score": 1,
                            "created_utc": 1653846155.0,
                            "response": "Yes, that is a problem. I will amend the limit branches are allowed to be separated from each other to 2, which still allows for scalability and the detects double spend transactions in 2 mined blocks.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iafl5yr",
                    "author": "na3than",
                    "score": 1,
                    "created_utc": 1653835970.0,
                    "response": "Let's say the blockchain splits into 100 branches. Since your proposal is meant to increase aggregate transaction throughput, let's say each branch captures similar transaction volume to the single chain we have today, generally in excess of 2000 transactions per block. How are you going to merge 100 × 2000 × 144 = 28.8 million transactions into a single 1 MB block at the end of the day?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iafpjg5",
                            "author": "kemoyin_network",
                            "score": 1,
                            "created_utc": 1653837941.0,
                            "response": "It still works like the regular bitcoin protocol. In this version the block header gets expanded by the amount of merged branches (4 Byte) and the hash values of each branch (n\\*32 Byte) which takes up 3204 Byte. The rest, minus the unchanged header space, of the 996748 Byte can still be filled with transaction data. (I took one mega byte instead of one mibi byte) ~~Another version would have only 32 Byte more overhead and can only merge 2 branches.~~",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iafxqvu",
                    "author": "NYKNYb",
                    "score": 1,
                    "created_utc": 1653841584.0,
                    "response": "Oh look that rando on Reddit wants to fix bitcoin 😂😂",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iagtzvz",
                    "author": "bizwebcopy",
                    "score": 1,
                    "created_utc": 1653856555.0,
                    "response": "Thanks for the input, Redditor for a day!",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}