{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uru9r7",
            "title": "Where does is stop...",
            "url": "https://i.redd.it/8h78vtvd83091.png",
            "author": "easywaytocrypto",
            "created_utc": 1652815820.0,
            "score": 3,
            "num_comments": 1,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8zgg8m",
                    "author": "wedahomeboys",
                    "score": 1,
                    "created_utc": 1652816183.0,
                    "response": "at zero, thats when",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uru6tl",
            "title": "Bank of England warns of recession and says inflation will hit 10%",
            "url": "https://www.yahoo.com/entertainment/uk-tip-recession-inflation-hit-112402103.html",
            "author": "bitsteiner",
            "created_utc": 1652815595.0,
            "score": 322,
            "num_comments": 92,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8zm34b",
                    "author": "coinfeeds-bot",
                    "score": 34,
                    "created_utc": 1652818508.0,
                    "response": "tldr; UK inflation will top 10% by the end of the year, the highest rate since 1982, the Bank of England has warned, as it put up interest rates for the fourth time in a row. Inflation is forecast to peak at 10%, up from a prior estimate of 8%, due to soaring energy and commodity prices that will deliver a historic hit to family incomes and company profits, it added.\n\n*This summary is auto generated by a bot and not meant to replace reading the original article. As always, DYOR.*",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i923fpm",
                            "author": "Worried-Taro2437",
                            "score": 7,
                            "created_utc": 1652870416.0,
                            "response": "25% maybe",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i900yey",
                    "author": "RandyJohnsonsBird",
                    "score": 139,
                    "created_utc": 1652824824.0,
                    "response": "It's fucking well over 10% now.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i90dns1",
                            "author": "dreiberg3",
                            "score": 68,
                            "created_utc": 1652830747.0,
                            "response": "In the US, our reported inflation rate is a little over 9%. But the things I spend money on in my day-to-day life are marked up anywhere between 10% and 50%. I can’t for the life of me figure out how they came up with the 9% figure.\n\nMaybe the people who come up with that figure buy different things than me. Like, maybe yachts or monogrammed sports cars haven’t seen the same markup up as poor people things like gas and food. I don’t know.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i90kez9",
                                    "author": "y90210",
                                    "score": 68,
                                    "created_utc": 1652833987.0,
                                    "response": "It's pretty easy. First they exclude several things that are prone to inflation, such as energy. Under the guise that they fluctuate too much. Then they exclude food by claiming if the cost goes up for steak, you'd buy an alternative instead. \n\nYou end up with a nonsense number as a result. If you want something closer, use the cpi calculations from the 80s or earlier. Those would give you 15%+ rates.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i90ljos",
                                            "author": "dreiberg3",
                                            "score": 27,
                                            "created_utc": 1652834523.0,
                                            "response": "Thank you - that is really helpful. But also WTF - food and energy are things that literally everyone pays for. Excluding them means that the reported rate of inflation is completely unrelated to the purchasing power of the “daily dollar.” I guess that is what I was complaining about in my first post, but it’s weird to learn that someone intentionally created a method to report inflation that excludes stuff like that.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i90nhf3",
                                                    "author": "y90210",
                                                    "score": 27,
                                                    "created_utc": 1652835433.0,
                                                    "response": "It makes sense that politicians bastardized it. It works for them in two major ways;\n\n1. Politicians can claim their excessive spending isn't causing inflation \n\n2. Social security payouts is tied to cpi, so the lower cpi is, the less they pay out to people on fixed incomes.\n\nMeanwhile Congress give themselves a 20% pay raise and SNAP food benefits had a 25% increase because they know the 8% number is bullshit.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i90qb43",
                                                            "author": "dreiberg3",
                                                            "score": 9,
                                                            "created_utc": 1652836769.0,
                                                            "response": "Wow - I had to go read a little bit about the social security thing. That is absolutely draconian.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i91k5ya",
                                                                    "author": "whitslack",
                                                                    "score": 4,
                                                                    "created_utc": 1652853547.0,
                                                                    "response": "What's draconian about \"Social Security\" (which is antisocial and not secure at all) is that we're forced to participate in it, even though we all know it's an insolvent Ponzi scheme.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i92a4i8",
                                                                            "author": "Arde1001",
                                                                            "score": 3,
                                                                            "created_utc": 1652874975.0,
                                                                            "response": "Nah social security is good, reduces crime, medical expenses for people, increases quality of life, equality and stability etc. It costs a lot, so there are incentives to cut corners, and also room for corruption if the system isnt rigid. Politicians love to cut corners and be corrupt which makes most social security systems incredibly bureucratic for no reason. UBI + Zero inflation currency like bitcoin on the other hand...",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        },
                                                                        {
                                                                            "id": "i91nb5s",
                                                                            "author": "Ernest-Everhard42",
                                                                            "score": -1,
                                                                            "created_utc": 1652856049.0,
                                                                            "response": "I’m no expert, but this isn’t true at all.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "i91w9zm",
                                                            "author": "Bitcoin__Hodler",
                                                            "score": 1,
                                                            "created_utc": 1652864117.0,
                                                            "response": " 3 . countries are heavily in debt and with fake (low) inflations numbers, they can lift that burden while telling the public, inflations is low.",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "i922st1",
                                                            "author": "InterPool_sbn",
                                                            "score": 1,
                                                            "created_utc": 1652869908.0,
                                                            "response": "Yep, the incentivizes are completely perverted under this fiat standard",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i90z6sn",
                                            "author": "chicken_afghani",
                                            "score": 3,
                                            "created_utc": 1652840963.0,
                                            "response": "And dont forget about housing costs, 30% of cpi… they have a BS way of measuring",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i91pujh",
                                            "author": "zampyx",
                                            "score": 5,
                                            "created_utc": 1652858193.0,
                                            "response": "Also they remove technological advancement in a discretionary way. For example if your phone added a 6th camera, that's tech so if the price went up who cares inflation is zero because the product is better. Ofc is still a phone and doesn't do anything more than what phones did the year before, also doesn't save you any money anywhere else, you just pay more for a phone which is totally not inflation.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i91w64d",
                                    "author": "Bitcoin__Hodler",
                                    "score": 2,
                                    "created_utc": 1652864015.0,
                                    "response": "> I can’t for the life of me figure out how they came up with the 9% figure.\n\nThey change the basket and calculations. you can come up with any number.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i90u4dz",
                                    "author": "IFThenElse42",
                                    "score": 4,
                                    "created_utc": 1652838548.0,
                                    "response": "Money supply went 10x in a few year, pretty sure the inflation is closer to 900%",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i90be3v",
                            "author": "RexMic",
                            "score": 15,
                            "created_utc": 1652829652.0,
                            "response": "Just print more and report last months inflation rate 😂",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i90cu6k",
                                    "author": "RandyJohnsonsBird",
                                    "score": 8,
                                    "created_utc": 1652830347.0,
                                    "response": "Right? The gen pop don't give a fuck anymore and are in the\" I just accept it stage\" of massive inflation",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i90nsr0",
                                            "author": "Life_is_Liquid25",
                                            "score": 7,
                                            "created_utc": 1652835583.0,
                                            "response": "That will change when people can no longer afford to eat…",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i90qnnk",
                                                    "author": "RandyJohnsonsBird",
                                                    "score": 4,
                                                    "created_utc": 1652836935.0,
                                                    "response": "I know it's anecdotal but I paid $5.60 a gallon for gas today. That's the most I've ever paid ever.  Pac NW US",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i90uu4n",
                                                            "author": "pushdose",
                                                            "score": 5,
                                                            "created_utc": 1652838888.0,
                                                            "response": "Don’t brag about your cheap gas to the Brits.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i91uekk",
                                                    "author": "heyitsmaximus",
                                                    "score": 1,
                                                    "created_utc": 1652862328.0,
                                                    "response": "Really scary what is happening with food shortages... loss of Ukraine crops could really hurt wheat supplied. Department of homeland security just issues a report saying that China now has 69% of the worlds grain stock piles.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i90fs6b",
                                    "author": "btceacc",
                                    "score": 2,
                                    "created_utc": 1652831776.0,
                                    "response": "That's what they've been doing for decades.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i91xleq",
                            "author": "Stock_Shaman",
                            "score": 4,
                            "created_utc": 1652865344.0,
                            "response": "When they strip out energy and food it's very easy for them to hide behind a lesser inflation figure. \n\nThe terms, CPI Vs Headline Inflation are two different beasts.\n\nOne being headline includes the important two biggest costs which are food and energy, the other being CPI is what every academic and Govt official focuses on..in order to make it feel ok.\n\nOne is to soothe you, the other should scare you..at least in this day and age. In fact, both should scare you..coz were in deep S***\n\nThe truth is this has been coming for a while.\n\nThis time last year J.Powell was screaming 'transitory'. Now that it's sticky, the likes of Bloomberg are saying inflation is good...fkn lol....invest in hard assets..or not..the choice is yours.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9212gw",
                            "author": "Ne710",
                            "score": 3,
                            "created_utc": 1652868470.0,
                            "response": "I’m a builder, in the UK everything i buy is up from 20-50%",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i92mcem",
                                    "author": "S-3TH",
                                    "score": 1,
                                    "created_utc": 1652881378.0,
                                    "response": "I’m a baker and same.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i93a179",
                                            "author": "LuKeNuKuM",
                                            "score": 1,
                                            "created_utc": 1652891379.0,
                                            "response": "It's beer that crystallises it for me. Not uncommon to pay £6 a pint!",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8zo3xe",
                    "author": "Asum_chum",
                    "score": 70,
                    "created_utc": 1652819352.0,
                    "response": "I have done nothing different since the last recession and yet I’m about to pay for it again?! Oh no, I have done one thing different. I now own bitcoin. \n\nFuck that greedy, jowled cunt and his greedy cunt mates.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i900jn7",
                            "author": "horsecyack",
                            "score": 5,
                            "created_utc": 1652824641.0,
                            "response": "Horsey will pay him a visit",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i92w0bl",
                            "author": "ropZismyking",
                            "score": 1,
                            "created_utc": 1652885634.0,
                            "response": "with your brother, fuck those cunts!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8zk7ah",
                    "author": "Wise-Application-144",
                    "score": 30,
                    "created_utc": 1652817727.0,
                    "response": "Called it. Transitory my arse.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i91sn6b",
                            "author": "itchyblood",
                            "score": 2,
                            "created_utc": 1652860700.0,
                            "response": "We all said this in summer of 2020. If only they listened",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8ztslo",
                    "author": "Snoo_69511",
                    "score": 6,
                    "created_utc": 1652821725.0,
                    "response": "Neat, inflations coming down!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i90npk8",
                    "author": "Dazzling_Marzipan474",
                    "score": 7,
                    "created_utc": 1652835540.0,
                    "response": "Over 10%? gas went up ANOTHER 12% in 2 days here ffs.    My rent went up 50% although it was cheap, my cigs went up 15%, groceries up like 22%. I know bc I have receipts all from last year from the app I use to get points from. All in 1 years time. We're all fucked!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i925p0m",
                            "author": "mtthghtn",
                            "score": 4,
                            "created_utc": 1652872076.0,
                            "response": "Might be time to pack in the cigs perhaps ?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i92pagt",
                                    "author": "Aromat_Junkie",
                                    "score": 1,
                                    "created_utc": 1652882724.0,
                                    "response": "> removal all carnal pleasures so I can spend more days on this soul crushing earth",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8zrw71",
                    "author": "SeaHam",
                    "score": 17,
                    "created_utc": 1652820926.0,
                    "response": "that means that it's closer to 15%",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i902mer",
                    "author": "Deep-Art3195",
                    "score": 6,
                    "created_utc": 1652825571.0,
                    "response": "You mean stagflation?!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i91bop5",
                            "author": "terabytetron",
                            "score": 2,
                            "created_utc": 1652847673.0,
                            "response": "No,.. Dragflation.\nShrinking economy with high inflation.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i91yuru",
                                    "author": "devenjames",
                                    "score": 3,
                                    "created_utc": 1652866512.0,
                                    "response": "Salted snail economy",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i91sfk8",
                    "author": "CallingVoid",
                    "score": 6,
                    "created_utc": 1652860500.0,
                    "response": "As other have said, this is bullshit. All my bills are up well above 10%. My food shop has gone up 25% at least (despite packet sites shrinking), fuel is up 10-20%, my rent is up 10%, my insurance is up 10%. Mobile/internet bills follow CPI at a minimum. I'm genuinely struggling to think of something that hasn't gone up by *at least* 10%. \n\nI'm likely going to get a sub 2% raise this year, so effectively it's going to be a >7% cut and that's highly conservative, based on CPI figures that are clearly made up. It's probably going to be more like a 10-15% pay cut if I'm lucky.\n\nThank fuck I've got some bitcoin.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i90wz4z",
                    "author": "brittleknight",
                    "score": 5,
                    "created_utc": 1652839910.0,
                    "response": "My guess is Inflation will hit 16% or higher by next spring. Food shortage hasnt even really started. This years crop is so fked that we will likely feel it for years. And that’s just the nitrates and potassium problems. Add in fuel costs and farmers selling their land at record prices to massive corps..",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i91mnt2",
                    "author": "leavingcarton",
                    "score": 5,
                    "created_utc": 1652855512.0,
                    "response": "They say 10% to keep the masses from getting out of hand but we all know that shit is far more than 10%",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i91nki0",
                    "author": "Outrageous_Duty_8738",
                    "score": 4,
                    "created_utc": 1652856261.0,
                    "response": "They lie they never give the true inflation figures",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8zpulx",
                    "author": "2xfun",
                    "score": 15,
                    "created_utc": 1652820082.0,
                    "response": "Wait until they figure out that the inflation has been higher than 10% since 71....",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8zr70t",
                            "author": "E-renter",
                            "score": 5,
                            "created_utc": 1652820636.0,
                            "response": "Maybe they plan to rein in inflation to bring it back down to 10%? nah.\n\nP.s. This applies equally to Canada and the USA",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8zsvkk",
                    "author": "varikonniemi",
                    "score": 19,
                    "created_utc": 1652821337.0,
                    "response": "The west is doing a collective harakiri in how they deal with Russia. Combined with decades of economy mismanagement will bring a day of reckoning like generations have not seen. And the sad part is that it was obvious since a loong time, the creation of Bitcoin for instance was inspired by frustration of this corruption.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8zwpy9",
                    "author": "RedditSucksss1",
                    "score": 8,
                    "created_utc": 1652822969.0,
                    "response": "We are already in a recession, plus inflation is way more then 10%.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8zsus4",
                    "author": "TomSurman",
                    "score": 11,
                    "created_utc": 1652821327.0,
                    "response": "I sure do love being warned of things that are already happening.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9067hr",
                            "author": "JimBloc",
                            "score": 16,
                            "created_utc": 1652827211.0,
                            "response": "The best thing is, he said no one could have seen this coming. Really!! printing money like its shit roll, and having next to no interest rate on money for last 12 years. Go on the Internet, you can buy anything and pay later, with next no interest, you can even buy your toilet and pay later, then you can us the money in your wallet to wipe your ass after... And no one could have seen this coming. Blind man on a galloping horse could seen this shit coming. But best thing is its not over, they'll put interest rates up to try cool markets, but then the gdp will go down, And they say o well putting interest rates up didn't work. Print more money lads..",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i90xn4b",
                                    "author": "bepositiveitsgood",
                                    "score": 1,
                                    "created_utc": 1652840224.0,
                                    "response": "This made me laugh broh. It is quite terrifying though",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8zrfuk",
                    "author": "tybamer",
                    "score": 4,
                    "created_utc": 1652820740.0,
                    "response": "another 10%",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i90q8nx",
                    "author": "hemzer",
                    "score": 4,
                    "created_utc": 1652836737.0,
                    "response": "The problem is that they printed all that money and gave it to the wrong people.... to well connected cantillionares",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i90fycw",
                    "author": "DeathScythe676",
                    "score": 2,
                    "created_utc": 1652831861.0,
                    "response": "they're saying the quiet part out loud",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i90nq0i",
                    "author": "Ignitus1",
                    "score": 2,
                    "created_utc": 1652835546.0,
                    "response": "We’re already in the recession, have been for months, and inflation is well over 10%.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i90ykgt",
                    "author": "Lagrimmett",
                    "score": 2,
                    "created_utc": 1652840657.0,
                    "response": "Will? I don’t care what they say, it’s here!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i91mq44",
                    "author": "ivgur",
                    "score": 2,
                    "created_utc": 1652855566.0,
                    "response": "getting scary tho. Either to take our assets or it will genuinely happen. Hyperinflation is no good news. We will be ducked for years. Keep some cash (nfa).",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i91nh10",
                    "author": "BtcNpcs",
                    "score": 2,
                    "created_utc": 1652856184.0,
                    "response": "$9,66 a gallon in Norway..",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i91pwdr",
                    "author": "connell83",
                    "score": 2,
                    "created_utc": 1652858240.0,
                    "response": "Nobody, not one person, on the news mentions money printing. Why?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i93curi",
                            "author": "LuKeNuKuM",
                            "score": 1,
                            "created_utc": 1652892505.0,
                            "response": "I genuinely think most people don't understand it. There is a delay between the 'hit'of the money being printed and the reality that it's now devalued what you were previously holding. It's so stealthy is hard to connect the dots even for journalists. By the time it's noticed there are other factors that get blamed. Economists have a whole raft of ideas about why inflation happens and it's often these that the media use. Sometimes you get a good article though. They're blaming the war and pandemic at the moment but this has been coming for a long long time. Debt doesn't go away.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i92whry",
                    "author": "OldMercenary",
                    "score": 2,
                    "created_utc": 1652885836.0,
                    "response": "Gotta be higher than 10% then",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i900xku",
                    "author": "Br0kenRabbitTV",
                    "score": 4,
                    "created_utc": 1652824814.0,
                    "response": "The cost of living here has gone crazy the last year, food, electric, gas fuel etc.. all up loads. It's not even worth mining here any more, I turned my rigs off in April as they now run at a cost.\n\nIn total I'm spending about 50% more than I was a year or two ago to live.\n\nWhat has this got to do with Bitcoin though?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i90a34z",
                            "author": "JimBloc",
                            "score": 4,
                            "created_utc": 1652829035.0,
                            "response": "Because bitcoin buys you more stuff every year and your government toilet roll buys you less stuff each year.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8zynex",
                    "author": "mightylfc",
                    "score": 3,
                    "created_utc": 1652823808.0,
                    "response": "This is an article from 2 weeks ago, and recession news are anything but bullish for Bitcoin",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i91qqjm",
                    "author": "connell83",
                    "score": 2,
                    "created_utc": 1652858969.0,
                    "response": "Only one answer to this. Bank of England print gbp to buy btc at a low, essentially free btc. Then announce to the world their move to be a btc standard. Result, UK becomes the wealthiest country on earth.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i901lk8",
                    "author": "Woodpecker3453",
                    "score": 1,
                    "created_utc": 1652825112.0,
                    "response": "A bit too late now, innit?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i90pgaw",
                    "author": "hemzer",
                    "score": 1,
                    "created_utc": 1652836362.0,
                    "response": "The Bank of England does need to worry. They are lucky that. The solution is there. Stack some Bitcoin . Simple.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i91cphr",
                    "author": "HallaganJack",
                    "score": -2,
                    "created_utc": 1652848316.0,
                    "response": "Dude Bitcoin is a hedge against inflation, just ignore the fact that it is down 60% percent in the last 6 months and mimics a high growth tech stock.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i91hw2d",
                            "author": "StrandedinaDesert",
                            "score": 2,
                            "created_utc": 1652851843.0,
                            "response": "Lol sad little brain doing it's best",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i908rsc",
                    "author": "Emotional-Emotion-85",
                    "score": -11,
                    "created_utc": 1652828413.0,
                    "response": "BTC doesn't solve this. I don't know why people are lumping the two together (besides meaningless up votes.) \n\nBTC has been plummeting. And don't give me that zoom out 10 years shit unless you bought 10 years ago.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i90djun",
                            "author": "DudeWhatThe",
                            "score": 7,
                            "created_utc": 1652830692.0,
                            "response": "Zoom out 2 years, not 10.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i90li9x",
                            "author": "jrecio26",
                            "score": -2,
                            "created_utc": 1652834504.0,
                            "response": "Lol you uneducated poor fool. There’s a ton of information and facts that you can confirm yourself out there. Go read and then come back and say BTC doesn’t solve anything with a straight face.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i90p00j",
                                    "author": "Emotional-Emotion-85",
                                    "score": 2,
                                    "created_utc": 1652836144.0,
                                    "response": "Ive been buying since 2019. During heavy inflation it will crash. Always.  When stocks tank it will crash. Always. It's correlated to every other investment.  I know a lot of teens and gas station clerks with. 0001 BTC post here but the moon bois are fucking annoying as shit.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i90pr9s",
                                            "author": "jrecio26",
                                            "score": 4,
                                            "created_utc": 1652836508.0,
                                            "response": "Can I have the winning lottery numbers while we’re at it too?",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i917xqg",
                                            "author": "No-Lemon-2287",
                                            "score": 2,
                                            "created_utc": 1652845477.0,
                                            "response": "2019. Got a real seasoned pro here, fellas.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i91py2n",
                                                    "author": "Emotional-Emotion-85",
                                                    "score": 0,
                                                    "created_utc": 1652858283.0,
                                                    "response": "Post history. \n\nRun!",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i91zzqh",
                                                            "author": "Fukdataxcode",
                                                            "score": 0,
                                                            "created_utc": 1652867527.0,
                                                            "response": "You don’t understand the tech behind bitcoin. Nor does the other 80-90% of the general population. If they did they’d buy more of it. And people like you wouldn’t be bashing it because you didn’t get rich in 2-3 years. This tech is for the long run. The people that bought bitcoin early were just early investors . As with any company you see value in. You buy early, accumulate, hold.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i90jto8",
                    "author": "wstylz",
                    "score": 1,
                    "created_utc": 1652833704.0,
                    "response": "Banks like inflation which raises interest rates and devalues your savings",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i91jfms",
                    "author": "Grouchy_Artichoke_90",
                    "score": 1,
                    "created_utc": 1652852987.0,
                    "response": "\"we fucked up again\"",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i91mw33",
                    "author": "InteractiveLedger",
                    "score": 1,
                    "created_utc": 1652855700.0,
                    "response": "Can someone explain why in the world do people not hoard assets as inflation soars? Instead, asset prices plummet when inflation soars.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i91qkto",
                            "author": "connell83",
                            "score": 3,
                            "created_utc": 1652858829.0,
                            "response": "Because, for the average person of the masses they don't have any spare savings anymore.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i91vi1a",
                    "author": "-TMT-",
                    "score": 1,
                    "created_utc": 1652863368.0,
                    "response": "Hello Bitcoin, my old friend.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i91w6va",
                    "author": "userxtrustno1",
                    "score": 1,
                    "created_utc": 1652864035.0,
                    "response": "Prettay good for Bitcoin!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i927jxj",
                    "author": "Liquids0ul",
                    "score": 1,
                    "created_utc": 1652873351.0,
                    "response": "Well they don’t want to tell us the right numbers right away they will start with 10 % for now so they prepare everyone on what’s gonna come",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i92tjj0",
                    "author": "fiercygoat",
                    "score": 1,
                    "created_utc": 1652884593.0,
                    "response": "This is getting out of hand",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i92we9j",
                    "author": "TupperwareTank",
                    "score": 1,
                    "created_utc": 1652885796.0,
                    "response": "When they fell comfortable saying it will hit 10% it means it already is more than that.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i933wju",
                            "author": "Dismal-Professor-521",
                            "score": 1,
                            "created_utc": 1652888882.0,
                            "response": "I couldn’t have worded it better",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "urudd5",
            "title": "Like some crypto with your Glazers? Kwik Trip getting Bitcoin ATMs",
            "url": "https://www.wsaw.com/2022/05/17/like-some-crypto-with-your-glazers-kwik-trip-getting-bitcoin-atms/",
            "author": "kten50_prime",
            "created_utc": 1652816092.0,
            "score": 19,
            "num_comments": 3,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8zm2s6",
                    "author": "coinfeeds-bot",
                    "score": 2,
                    "created_utc": 1652818505.0,
                    "response": "tldr; Kwik Trip has announced a partnership with Coinsource to put Bitcoin ATMs in more than 800 stores in Wisconsin, Minnesota, Illinois and Iowa. Coinsource describes itself as the leading Bitcoin ATM network in the United States. Kwik Trip Rewards members will have access to lower rates.\n\n*This summary is auto generated by a bot and not meant to replace reading the original article. As always, DYOR.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i91x9ig",
                    "author": "Brainsick001",
                    "score": 1,
                    "created_utc": 1652865030.0,
                    "response": "More adoption.. Good ... /evileyes",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}