{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "v0manq",
            "title": "The world's first Crypto building - 24-floor \"smart\" building with a Bitcoin mining farm in its basement (Belgrano, Argentina)",
            "url": "https://interestingengineering.com/next-pampa-20-crypto-building-bitcoin-mining",
            "author": "CoinCorner_Sam",
            "created_utc": 1653864189.0,
            "score": 3,
            "num_comments": 2,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "iah9ktw",
                    "author": "coinfeeds-bot",
                    "score": 1,
                    "created_utc": 1653864314.0,
                    "response": "tldr; A 24-floor building in Argentina will feature a Bitcoin mining farm in its basement. The objective is to generate an income for the building's operations, allowing it to cover the cost of the edifice's maintenance and upkeep. The building will also display different pieces of NFT art as decoration in its lobby.\n\n*This summary is auto generated by a bot and not meant to replace reading the original article. As always, DYOR.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iai2dew",
                    "author": "igadjeed",
                    "score": 1,
                    "created_utc": 1653879299.0,
                    "response": "> basement\n\nThis will end badly, the next time the river floods",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "v0mfab",
            "title": "Ex-Defence Minister of Russia proposes to print new money to replace the Russian assets seized in the West: \"The equivalent of this money, which is now under lock and key, we can create it at home, throw it into the economy.\" This is what Bitcoin defeats",
            "url": "https://mobile.twitter.com/nexta_tv/status/1530800279913914369",
            "author": "Cronik",
            "created_utc": 1653864602.0,
            "score": 35,
            "num_comments": 14,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "iahj6kb",
                    "author": "Mallardshead",
                    "score": 10,
                    "created_utc": 1653869362.0,
                    "response": "These are the imbeciles running governments across the world. Trump was great for America in that way, his ignorance exposing the complete folly of political prestige, which up until that time, was an iron curtain they guarded quite deftly. Bush was a war criminal, destabilizing the Middle-East, printing us into a two-decade war, killing millions of people, and super charged the surveillance state. Obama was a nightmare, bailing out banks, empowering Wall Street, printing us into oblivion, invading Libya, droning the shit out of who knows how many civilians. Trump printed non-stop, had no solutions for anything, got the supply chain disaster started in earnest with his Chinese tariffs, complained 24/7, enriched his own family, printed some more, bashed bitcoin, and cost us a fortune by proffering no common ground. Biden printed us into oblivion, fucked around in Ukraine with his lying son, and is busy overseeing hyperinflation of the US dollar with disastrous sanctions, and no concept of the global economy. Not one of these fuckers ever did a damn thing that was good for America long-term, only what helped them or their party image in the daily news cycle, and at the very longest, in the next election.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iahsexy",
                    "author": "hVMjjxumF45DKy13",
                    "score": 2,
                    "created_utc": 1653874211.0,
                    "response": "Rogozin is and always has been a joke. He should spend more time working on his trampoline.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iahpvun",
                    "author": "tmbd03",
                    "score": 4,
                    "created_utc": 1653872898.0,
                    "response": "Its dangerous when nation states can seize other nation states property. Just think of what they can seize from you.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iahr3bb",
                            "author": "EvaUnit_03",
                            "score": 1,
                            "created_utc": 1653873533.0,
                            "response": "They all can, with willingness or force. Not even in the US do you have full rights to your property anymore. If its in the best interest of the government, they'll do it.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iahamxl",
                    "author": "SmoothGoing",
                    "score": -4,
                    "created_utc": 1653864861.0,
                    "response": "No one should have taken any assets that don't belong to them. Without rule of law and property rights no one can justify bitching about any aggression. No leg to stand on.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iahb10p",
                            "author": "EvaUnit_03",
                            "score": 5,
                            "created_utc": 1653865068.0,
                            "response": "Your comment hurts. The Russians tried to take property FIRST, and in response their property was taken and is most likely going to be given back to those they attempt to take from and the damage they caused. This is how law works as you can't actually imprison an entire landmass for its actions.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iahh9p0",
                                    "author": "SmoothGoing",
                                    "score": -2,
                                    "created_utc": 1653868346.0,
                                    "response": "False. No yacht owner tried to take anyone's  crap. The propaganda works, clearly.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iahj3qx",
                                            "author": "EvaUnit_03",
                                            "score": 5,
                                            "created_utc": 1653869321.0,
                                            "response": "Let's ask that yacht owner how he got that money, and you'd find that most of them work for the russian government. Its why putin even said they are enemies of Russia early on due to the fact they were taking russian government money to buy those yachts. Meaning those yachts were russian government property as far as putin was concerned.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iahjgen",
                                                    "author": "SmoothGoing",
                                                    "score": -3,
                                                    "created_utc": 1653869509.0,
                                                    "response": "If someone is doing something bad it's not your job to take their stuff. You are not the world police. I don't know who owns the yachts. Whether it is owned by one guy, by a company, or the government of some country, \"the west\" has no right whatsoever to take them.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iahkepj",
                                                            "author": "EvaUnit_03",
                                                            "score": 2,
                                                            "created_utc": 1653870016.0,
                                                            "response": "Last I checked every country on this planet has the rights to sieze property for any reason they see fit regardless if criminal activities are happening. I didn't take shit as I'm just a person, the governments did and they are acting against an enemy force on how they each see fit due to an unjust action. Yeah, id be pissed if someone took my shit, but if I was doing evil to get it, all fair, ill just do more evil to get it back. That is how the cartel do. You're trying to argue 2 wrongs don't make a right but that second wrong is in attempt to make somewhat right the first wrong because we know the force behind the first wrong won't do it of its own accord.\n\nThe fucking day you see someone defending a damn yacht owner whose part of a corrupt and warmongering nation, I mean seriously. Theyd sooner break both your legs and throw you into thr ocean off their yacht than give you the time if day.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "iahwk7z",
                                                                    "author": "SmoothGoing",
                                                                    "score": 0,
                                                                    "created_utc": 1653876319.0,
                                                                    "response": "It sucks how well the fake news works on feeble minds. You have no idea about what's really going on. Nations do ok until your tax money is used to spread regime change in them.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "iai2rh1",
                                                                            "author": "EvaUnit_03",
                                                                            "score": 1,
                                                                            "created_utc": 1653879501.0,
                                                                            "response": "\nThis guy...\n\nYou know  people are fucking dying on both fronts and you're concerned with yachts and mansions owned by corrupt political officials in other countries. Fuck you and the horse you rode in on my guy. \n\nI could give two fucks about what any news outlet says, I've payed attention to the videos uploaded by the people. I've watched the videos early on of a family being executed with children and their dogs. One dog ran away our of fear and came back to stay with the corpses of his family. Fuck any army that backs that kinda shit, including my own US army. They've done awful things too, but they've only ever purposefully sent our men to the woodchipper once, and we lost that war and the nation in question still stands so Russia could learn from our mistake. Russia is about to be in a world if hurt and if ANYTHING the news is saying is remotely true, the Russian empire is gonna crumble before mine. A puric victory, but a victory none the less.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iai5fr5",
                    "author": "1UazZNfbWi",
                    "score": 1,
                    "created_utc": 1653880836.0,
                    "response": "Their Rai stone has sunk, but it can still be used.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "v0mg62",
            "title": "How to explain bitcoin to newbies?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/v0mg62/how_to_explain_bitcoin_to_newbies/",
            "author": "onestrikelol",
            "created_utc": 1653864682.0,
            "score": 7,
            "num_comments": 21,
            "subreddit": "Bitcoin",
            "selftext": "How do you explain bitcoin to someone that doesn’t know what is inflation or what bitcoin solves?\nSometimes when I try to explain to people what is inflation they don’t get what is it and why is bad for them.",
            "stickied": false,
            "comments": [
                {
                    "id": "iahb0kg",
                    "author": "solomonsatoshi",
                    "score": 11,
                    "created_utc": 1653865062.0,
                    "response": "Start by explaining how FIAT debt slavery MONEY works.\n\nOnly in that context, once it is understood, does Bitcoin make full sense.\n\n(So talking about inflation *is* a good place to start but wider context/understanding is required)\n\nHow many people understand how fiat works?\n\nMy guess is less than 1% of the general population and maybe 10-20% of Bitcoiners.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iahiag7",
                            "author": "caploves1019",
                            "score": 5,
                            "created_utc": 1653868895.0,
                            "response": "I would argue all bitcoiners understand fiat but not all people who hold bitcoin are bitcoiners.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iaicm0v",
                    "author": "WhatBands",
                    "score": 2,
                    "created_utc": 1653884875.0,
                    "response": "If I asked you what inflation was how would you answer me?\n\nI would say if there are 100 people and 100 Apple‘s for sale, each person has one dollar and each Apple cost one dollar to buy, the Fed steps in and print some money so now everyone has two dollars, the price of Apple‘s must go up.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaipbfb",
                    "author": "MrQ01",
                    "score": 2,
                    "created_utc": 1653894020.0,
                    "response": "What exactly dont they understand about inflation (forget talking to them about Botcoin for now)?\n\nAsk them if theyve noticed increases in costs of living  If they're one of the feel people who haven't noticed, or dont care about rising cost of living then inflation wouldn't be important to them.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iahg0pg",
                    "author": "VPNApe",
                    "score": 4,
                    "created_utc": 1653867690.0,
                    "response": "If they are too stupid to understand inflation they're too stupid to understand bitcoin",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaicouz",
                            "author": "WhatBands",
                            "score": 2,
                            "created_utc": 1653884926.0,
                            "response": "Ha ha, absolutely right. Inflation is such a baby topic compared to bitcoin.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iaiqe39",
                            "author": "dlq84",
                            "score": 1,
                            "created_utc": 1653894910.0,
                            "response": "Or maybe OP is terrible at explaining things.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iai4rl2",
                    "author": "rdgabino",
                    "score": 2,
                    "created_utc": 1653880511.0,
                    "response": "ON WHAT IT DOES\n\nBitcoin is a network, like a Western Union, that allows you to send money (btc) from one place to the other frictionless and instantly with very low fees. \n\nThe difference with WU is that there is no company behind. Just a bunch of computers that make sure the transactions are logged perpetually into the ledger (database). \n\nON HOW IT DOES IT\n\nSending money from one place to the other, works more or less like a bank but faster. \n\nYou have an address (think as the Account number you have with the bank) and a then your Passphrase (think as the PIN Number you use at your ATM). You also have the Address of the other party you want to send the money to. \n\nYou input their Address and how much money you want to send. When you hit send, your transaction goes to the Mempool where transactions wait until they are picked up by a miner. \n\nTransactions are then put into a block by different miners. Every miner has a slightly different block that is still not valid. They have around 10 min to find a random number by hashing (scrambling) the information of the block. Depending on the difficulty level, the Hash has o have a certain amount of zeros in front. As hashing is a random process, the computers basically have to \"guess\" that number that starts with a certain amount of zeros by changing a number inside the block. That number is called a Nonce. \n\nOnce you guessed the number with certain zeros in front, you sent that block to all the nodes. They certify that your block has the right amount of zeros in front, when hashed by a system called sha-256 (this always brings the same number if you input the same info). \n\nOnce ALL the nodes certify your block as valid, a new block is formed in the Bitcoin Blockchain. As a result of your effort (Proof of Work) you are awarded Fees + Block Rewards (at this epoch 6.25 BTC).\n\nThere will only be a little less than 21 million bitcoins. You can't create more bitcoins. And that's where the value is. \n\nThe rules can't be changed unless every node agrees. \n\n&#x200B;\n\nThis is a very aerial description with a lot of simplification but I think that I would explain it more or less like this to people. I hope it helps.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iahhvzg",
                    "author": "ItsPushOver",
                    "score": 1,
                    "created_utc": 1653868679.0,
                    "response": "Tell them they know about as much as the next guy, the president, and that fat chip eating fucker Charles Hoskinson.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iahc21m",
                    "author": "Harleychillin93",
                    "score": 1,
                    "created_utc": 1653865602.0,
                    "response": "I like saying the simplest way I can say bitcoin ins \"unsoverign money\" but that any deeper explanation requires a philophical conversation about money and sovereignty.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaij81p",
                    "author": "BTCMachineElf",
                    "score": 1,
                    "created_utc": 1653889265.0,
                    "response": ">I try to explain to people what is inflation they don’t get what is it and why is bad for them.\n\nEverybody can see shit getting more expensive. Meanwhile their wages are not going up. What is not to understand?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaioc4t",
                            "author": "onestrikelol",
                            "score": 2,
                            "created_utc": 1653893216.0,
                            "response": "Yeah sounds simple. But believe me that some people still don’t understand",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iaisjqd",
                    "author": "Bitcoin__Hodler",
                    "score": 1,
                    "created_utc": 1653896777.0,
                    "response": "Inflation = your money rots",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaitd3h",
                    "author": "NearbyTurnover",
                    "score": 1,
                    "created_utc": 1653897500.0,
                    "response": "Re: Bitcoin does NOT violate Mises' Regression Theorem\n2010-08-27 - Link\n\nAs a thought experiment, imagine there was a base metal as scarce as gold but with the following properties:\n\n- boring grey in colour\n- not a good conductor of electricity\n- not particularly strong, but not ductile or easily malleable either\n- not useful for any practical or ornamental purpose\n\nand one special, magical property:\n- can be transported over a communications channel\n\nIf it somehow acquired any value at all for whatever reason, then anyone wanting to transfer wealth over a long distance could buy some, transmit it, and have the recipient sell it.\n\nMaybe it could get an initial value circularly as you've suggested, by people foreseeing its potential usefulness for exchange. (I would definitely want some) Maybe collectors, any random reason could spark it.\n\nI think the traditional qualifications for money were written with the assumption that there are so many competing objects in the world that are scarce, an object with the automatic bootstrap of intrinsic value will surely win out over those without intrinsic value. But if there were nothing in the world with intrinsic value that could be used as money, only scarce but no intrinsic value, I think people would still take up something.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaj85q4",
                    "author": "RandomPlayerCSGO",
                    "score": 1,
                    "created_utc": 1653910378.0,
                    "response": "Need to first explain what money is and how governments monopolize money to steal from us",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iajav82",
                    "author": "Halo22B",
                    "score": 1,
                    "created_utc": 1653912274.0,
                    "response": "FFS....inflation is explained as follows....you have a pizza  cut into 4 slices...you and 3 friends each get one (perfect)...a new friend shows up and wants a slice....you cut the pizza again (8slices) ...now every body gets a slice aaaaaand you have 3 left over....you made more pizza right? Everybody feels fuller on their smaller piece right?.....even a 6yr old will understand.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iajbuv8",
                    "author": "The_Estranger_0001",
                    "score": 1,
                    "created_utc": 1653912924.0,
                    "response": "Frankly, if someone doesn’t understand what inflation is (especially we are living in a high inflation environment right now), I really don’t think that person should think about investing in anything. \n\nIt’s okay to explain Bitcoin if they understand the basics, but if they don’t understand anything, they will just blame you when they lose a penny.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iai26lr",
                    "author": "igadjeed",
                    "score": -2,
                    "created_utc": 1653879200.0,
                    "response": "Inflation is not relevant to Bitcoin  \nThat's why they won't listen to you",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaj9uq2",
                            "author": "MilesPower",
                            "score": 1,
                            "created_utc": 1653911587.0,
                            "response": "The Times 03/Jan/2009 \"Chancellor on brink of second bailout for banks.\"",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iahhwmf",
                    "author": "4nln415",
                    "score": 0,
                    "created_utc": 1653868689.0,
                    "response": "1 Show them the property of gold and compare it to bitcoin \n2 world before separation from church and state now money and state \n3 gold backed currency vs infinite money printing’s result and now can’t be fucked with backed\n4 absolute scarcity, sovereign…blah blah blah\n\nIntroduce them to Michael Saylor and Safidean?",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}