{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uuthsr",
            "title": "“Why I am not going to buy a computer” - Wendell Berry essay from 1987. Does this type of thinking seem familiar?",
            "url": "https://classes.matthewjbrown.net/teaching-files/philtech/berry-computer.pdf",
            "author": "sleepapneainvestor",
            "created_utc": 1653159237.0,
            "score": 74,
            "num_comments": 31,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9hawxi",
                    "author": "Skorpex",
                    "score": 47,
                    "created_utc": 1653159696.0,
                    "response": "When the time comes, they won’t use it because they want to. They will use it because they have to.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ig47q",
                            "author": "arbalest_22",
                            "score": 5,
                            "created_utc": 1653181016.0,
                            "response": "Just like Pootie Tang.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9ho23h",
                    "author": "dfunkmedia",
                    "score": 13,
                    "created_utc": 1653166180.0,
                    "response": "He defeats his own argument with his criteria that something should be cheaper, easier to repair, locally made, and produce better results than Dante's _Inferno_ to be worthwhile. A typewriter requires vastly more energy to produce than paper and ink. It requires machines and factories that are virtually impossible without electricity or economies of scale. No blacksmith ever would undertake the production of typewriters in bulk, and if they did the resulting mining, smelting, and smithing operations would be an environmental disaster of monumental inefficiency - certainly not a boutique \"local\" operation run by people of ordinary skill. It's more expensive than paper and ink, and incapable of producing any leap in quality of output by itself. Left alone with no human operator it produces the exact same result as a pen- nothing.\n\nHis reasoning is entirely vacuous and pretentious, dressed up in noble ideations that make him sound like a superior person but ultimately resolve nothing and fail to even defend his current choices.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ie06x",
                            "author": "No-Lemon-2287",
                            "score": 6,
                            "created_utc": 1653179867.0,
                            "response": "Sounds like an r/buttcoin regular",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9jktt9",
                            "author": "Skaldy101010",
                            "score": 1,
                            "created_utc": 1653208964.0,
                            "response": "Yes, it's just a long-winded way of saying \"I don't want to change\". He is just feeling pressured to give logical reasons for that.\n\nBut sometimes this subreddit seems similar. I suspect that for some people, faith comes before reasons. We see some shrill and lengthy posts here, all trying to justify bitcoin, but what if bitcoin goes nowhere from here, or even gets superceded by something else? Nobody knows the future.\n\nAdvocates of a \"new paradigm\" are always destined to become moaning \"boomers\" eventually. Kids today, meh.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9keezc",
                                    "author": "CryptoBehemoth",
                                    "score": 1,
                                    "created_utc": 1653229567.0,
                                    "response": "I don't think we are all condemned to become boomers. I've been advocating for drastic changes to society all my life, embracing new technologies and social innovations when they appear. I am moving with my times, and I don't see myself stopping ever.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9ht1l6",
                    "author": "TeamNuanceTeamNuance",
                    "score": 21,
                    "created_utc": 1653168710.0,
                    "response": "When Attack of the Clones came out 20 years ago, digital cameras and digital projectors were brand new. I asked the manager of the local theatre if they’d get a digital projector, as I heard the picture quality and focus was much crisper. He said NEVER EVER EVER EVER will movies be shot on digital cameras and NEVER EVER EVER EVER will projectors be digital, except for a few dumbass theatres following his pipe dream to show the movie in this new technology. He said George Lucas was a retard who deserves to die for thinking a camera could ever be digital and even dumber for “expecting the world to adopt a whole new set of projectors.” I think like 5 years later everything was digital. Suck the dick.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9idjtu",
                            "author": "CarniTato_YOUTUBE",
                            "score": 5,
                            "created_utc": 1653179620.0,
                            "response": "George Lucas gets a lot of shit but he and LucasArts always pioneered new technologies. Maybe those technologies were not fully matured yet, but ultimately, we can thank him for using them",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9kekit",
                                    "author": "CryptoBehemoth",
                                    "score": 1,
                                    "created_utc": 1653229638.0,
                                    "response": "I absolutely love what LucasArts used to be",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9hlhac",
                    "author": "Mostofyouareidiots",
                    "score": 5,
                    "created_utc": 1653164898.0,
                    "response": "The responses to his essay on page 2 are great too, it also reminds me of bitcoiners talking to modern luddites.\n\nAlso this guy is terrible at debating... he launches a full scale attack out the gate and then tries to play the victim after people call him out for being a hypocrite with a bad argument.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ixmwn",
                            "author": "tokyo_aces",
                            "score": 2,
                            "created_utc": 1653190679.0,
                            "response": "He also makes up responses that nobody wrote, clearly can't take a joke, and *entirely* misses the point about his wife, thinking it's a gender/class thing instead of a \"have other human being willing to do that in the first place, which most people don't have\" thing.\n\nIt's unfortunate because he has points, about cost (he's a farmer who can't afford it, as he said), energy sources, ability to repair (huge issue in the first days of PCs, still requires experts in cities, not farm country), computers not *necessarily* contributing positively to issues of the day, etc.  Then he goes and spoils these thought experiments by sitting on a high horse.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9hkuwg",
                    "author": "Spl00ky",
                    "score": 2,
                    "created_utc": 1653164583.0,
                    "response": "\"Why you should not upgrade your computer\"",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9hlm87",
                    "author": "Cornhorn72",
                    "score": 0,
                    "created_utc": 1653164968.0,
                    "response": "Computers have an existence, utility, and value that doesn't depend on your belief in them.  This guy didn't want to use it, but that wasn't threatening to the existence of the computer at all.  If everyone decided that Bitcoin wasn't real tomorrow, it would be.  No one who liked computers cared if this guy used one or not, they didn't need people to be evangelists.  You do, or your \"investment\" is worth nothing, which is why this paragraph pisses you off.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9hn435",
                            "author": "Mostofyouareidiots",
                            "score": 0,
                            "created_utc": 1653165713.0,
                            "response": "Redditor for 3 weeks and posts exclusively about crypto... it sounds like you're the one who is obsessed, not us.  Just like a computer- nobody cares if you use bitcoin.\n\nYou see yourself in the author, which is why this essay pisses you off.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9hnwmn",
                                    "author": "Cornhorn72",
                                    "score": -1,
                                    "created_utc": 1653166106.0,
                                    "response": "I'm not going to deny there's a fascination on my part, it's like watch a car crash that's about to happen that it's too late to prevent, how could you look away?  \n\nI joined reddit because so many of you people IRL won't shut up about this and I wanted to take a look.  It looks even worse than it sounds, and it sounds like the monologue of a cokehead.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9hvbak",
                                            "author": "Mostofyouareidiots",
                                            "score": 4,
                                            "created_utc": 1653169886.0,
                                            "response": "I'm not concerned, some people have been waiting over 12 years for the car crash so you might want to get comfortable with not looking away.\n\n> I joined reddit because so many of you people IRL won't shut up about this and I wanted to take a look. It looks even worse than it sounds, and it sounds like the monologue of a cokehead.\n\nThis attitude could apply to almost any new technology, just as OP's article demonstrates.  If I didn't know your post was talking about bitcoin then I could just as easily think you were talking about horseless carriages, the internet, social media, smart phones, etc.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i9ihjrp",
                                            "author": "VisionGuard",
                                            "score": 2,
                                            "created_utc": 1653181788.0,
                                            "response": ">I joined reddit because so many of you people IRL won't shut up about this\n\nI love how you nocoiners constantly whine about being victims about being blasted with news from bitcoiners when your ilk controls virtually every form of media.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9jposq",
                            "author": "FunSalt",
                            "score": 1,
                            "created_utc": 1653213474.0,
                            "response": "But people DO believe in bitcoin, and understand and value it’s utility.   If you were the only person in the world who believed in computers, you’d be screwed too because your computer would not be able to interface with the rest of the world and no one would make or support computers, so how is bitcoin any different?   Utility and adoption are occurring and increasing, I don’t think there is any denying that.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9hvrzw",
                    "author": "metalzip",
                    "score": -1,
                    "created_utc": 1653170125.0,
                    "response": ">Why then is not my first duty to reduce, so far as I can, my own consumption?\n\nwere americans really this cucked even before advent of russia-sponsored \"ecology\" movements?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9hjd1u",
                    "author": "roland8855",
                    "score": 1,
                    "created_utc": 1653163842.0,
                    "response": "Are you referring to the farmer's thinking or Wendell Barry's?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9hnoy5",
                            "author": "hey-now-relax",
                            "score": 1,
                            "created_utc": 1653166003.0,
                            "response": "Reminds me of Warren Buffet.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9hqblt",
                    "author": "ndgoLiberty",
                    "score": 1,
                    "created_utc": 1653167307.0,
                    "response": "To be fair he was right. If you waited until 1995 to buy a computer you got a better deal than the people who bought oversized calculators every 2 years.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ihoqx",
                            "author": "VisionGuard",
                            "score": 0,
                            "created_utc": 1653181860.0,
                            "response": "I'm forgetting the part in 1995 where the computer became smaller than a pencil and used no electricity (or whatever the eff he was complaining about).  Since he was \"right\".",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9icq7e",
                    "author": "Farrellfernandez",
                    "score": 1,
                    "created_utc": 1653179167.0,
                    "response": "Bitcoin will take over this Planet !!!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ijmty",
                    "author": "nightfury1989",
                    "score": 1,
                    "created_utc": 1653182896.0,
                    "response": "What a waste of time to write a letter",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9is459",
                    "author": "BeansBakerNumber5",
                    "score": 1,
                    "created_utc": 1653187534.0,
                    "response": "Irrelevant long long ago. Amazing how many are also clamoring to join him in the dustbin.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9iu7l0",
                    "author": "dft-salt-pasta",
                    "score": 1,
                    "created_utc": 1653188688.0,
                    "response": "If you bought a computer in 1987 it’d be pretty much worthless now.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9jkgcw",
                    "author": "Sealobo",
                    "score": 1,
                    "created_utc": 1653208621.0,
                    "response": "The future is hard to predict. But the trend can be clear as day.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}