{
    "subreddit": "BitcoinBeginners",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "umjhjy",
            "title": "why is Venmo discouraged for buying Bitcoin?",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/umjhjy/why_is_venmo_discouraged_for_buying_bitcoin/",
            "author": "Flashy-Professional9",
            "created_utc": 1652191492.0,
            "score": 13,
            "num_comments": 34,
            "subreddit": "BitcoinBeginners",
            "selftext": "Hi, I am extremely new at this. I bought $5 a month ago just to mess around with it. I checked it and it increased value. Not by a lot, but just a couple cents. \n\nNow it's down again and I've been seeing that it's a great idea to purchase more now that there's a dip. I purchased an additional $20 today. I know these are small quantities, but I want to dip my toe in before I go fully in.\n\nMy fear is that I will regret not purchasing a large amount whenever we start moving out of the dip. But my bigger question is why are people so against buying through Venmo?\n\nThis is what I've read so far from other posts (a lot of these don't elaborate on the why):\n\n\"Venmo bitcoins are fake bitcoins\" \nHow so?\n\n\"You don't really own bitcoins\"\nWhy not?\n\n\"It's not secure because they focus on other cryptocurrencies as well\"\nThis kinda makes sense as I could see them working on different crypto securities and stretching themselves thin. What would be an example of it not being secure? Will a hacker go in and take the coins?\n\nI've been using Venmo for a while and I'd say I trust Venmo to some degree. I've never used Coinbase or any other platform so I'm a little sketched out by them. How secure are they?",
            "stickied": false,
            "comments": [
                {
                    "id": "i8222ql",
                    "author": "ryachart",
                    "score": 7,
                    "created_utc": 1652194096.0,
                    "response": "They don’t let you withdraw. \n\nTherefore, you’re not buying Bitcoin you’re just buying a promise for Bitcoin and maybe you can withdraw later.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i822h24",
                    "author": "bitusher",
                    "score": 4,
                    "created_utc": 1652194255.0,
                    "response": "If you cannot withdraw your bitcoin you don't really own or control them . \n\nBitcoin is P2P currency. Storing bitcoins on exchanges, banks or web wallets makes you insecure and makes the whole ecosystem insecure indirectly by centralizing bitcoin. \n\nBitcoin is a bearer asset with ~immutable txs unlike fiat. This means that internal or external thieves  prefer to target what they can take and won't be reversed like digital fiat. Having centralized exchanges and banks store BTC makes it a desirable target for these attacks. \n\n\nThere are privacy concerns with storing your bitcoins with third parties\n\nYou are exposed to tax theft, asset forfeiture theft , civil theft \n\nYou are exposed to exit theft \n\nYou are exposed to the exchange refusing to support a split asset where they steal it , throw it away, or delaying a payout causing you to lose opportunity costs and profit\n\nYou place Bitcoin as a whole under more systemic risk by tempting exchanges to use fractional reserve banking and giving them too much influence\n\nYou potentially reduce the probability that your investment will appreciate in value because no exchanges are doing provable audits and they might be fractional. The more Bitcoin you personally control the more likely it will appreciate in value.\n\n**Never store your bitcoins in a web wallet, custodian , or exchange . You own 0 bitcoins if you do not control your private keys.**",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "ukkrms",
            "title": "Trezor One ($72) v. Ledger Nano S ($59) to store just bitcoin?",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/ukkrms/trezor_one_72_v_ledger_nano_s_59_to_store_just/",
            "author": "dmantzoor",
            "created_utc": 1651952526.0,
            "score": 3,
            "num_comments": 22,
            "subreddit": "BitcoinBeginners",
            "selftext": "Someone please make this decision for me. I was first told that cold wallets were extremely safe, especially Trezor and Ledger. Now, I'm reading things about hacks, open source v. cold source, with respect to these devices that worry me. I don't care about all the bells and whistles, being able to store X number of obscure coins....All i want is a safe device I can store a couple thousand on bitcoin and put off away in my safe. What's the move?",
            "stickied": false,
            "comments": [
                {
                    "id": "i7pvsay",
                    "author": "kuzkokronk",
                    "score": 3,
                    "created_utc": 1651955835.0,
                    "response": "Either is fine. But what you want to keep safe is the 24 word seed phrase, not really the hardware wallet itself.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "umyh9d",
            "title": "Whole BTC or more?",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/umyh9d/whole_btc_or_more/",
            "author": "m_rval",
            "created_utc": 1652233479.0,
            "score": 16,
            "num_comments": 44,
            "subreddit": "BitcoinBeginners",
            "selftext": "What would be the best place to buy 1 or 2 whole BTC? \n\nWould it be possible to avoid brokers?\n\n🤔🤔🤔🤔",
            "stickied": false,
            "comments": [
                {
                    "id": "i84p5fr",
                    "author": "BTCMachineElf",
                    "score": 16,
                    "created_utc": 1652233682.0,
                    "response": "It depends on what country you're in, but a major exchange is generally the cheapest and most reliable. Coinbase Pro or Gemini with Active Trader for low fees. \n\nBe sure to buy a hardware wallet like coldcard and take ownership of that bitcoin. Do not leave it on the exchange.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i84r87d",
                            "author": "m_rval",
                            "score": 3,
                            "created_utc": 1652234627.0,
                            "response": "Really dig your dmt/entheogen art btw!!!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i84op46",
                    "author": "AutoModerator",
                    "score": 5,
                    "created_utc": 1652233479.0,
                    "response": "WassaWassaWassup! Scam Alert! Scammers are particularly active on this sub. They operate via private messages and private chat. If you receive private messages, be extremely careful. Use the **report** link to report any suspicious private message to Reddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BitcoinBeginners) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i84othc",
                            "author": "m_rval",
                            "score": 3,
                            "created_utc": 1652233533.0,
                            "response": "Thank you good bot!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i84yx1w",
                    "author": "ndgoLiberty",
                    "score": 9,
                    "created_utc": 1652238198.0,
                    "response": "Wait until this guy finds out about the 6.15 BTC meme",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i85pt23",
                            "author": "FinibusBonorum",
                            "score": 5,
                            "created_utc": 1652255632.0,
                            "response": "?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i84sv5o",
                    "author": "BedJazzlike8577",
                    "score": 3,
                    "created_utc": 1652235382.0,
                    "response": "If you are in US, CoinbasePro is what you are looking for",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i856kkw",
                    "author": "Astropin",
                    "score": 3,
                    "created_utc": 1652242146.0,
                    "response": "If I was going to buy that amount I would use Swan bitcoin.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i85aj5g",
                    "author": "1entreprenewer",
                    "score": 3,
                    "created_utc": 1652244436.0,
                    "response": "KRAKEN",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i85dx2b",
                    "author": "Crypto_bro999",
                    "score": 3,
                    "created_utc": 1652246588.0,
                    "response": "The more the better. But don't forget to DCA.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i869x7a",
                    "author": "rastafarey25",
                    "score": 3,
                    "created_utc": 1652270803.0,
                    "response": "I use Netcoins. https://netcoins.ca/buy-bitcoin/",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "umzrsf",
            "title": "Noob Question. Sorry for my Ignorance.",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/umzrsf/noob_question_sorry_for_my_ignorance/",
            "author": "PlanAct",
            "created_utc": 1652237582.0,
            "score": 5,
            "num_comments": 19,
            "subreddit": "BitcoinBeginners",
            "selftext": "I am more interested in the socio-political nature of Bitcoin than it’s technological nature. However, I have a question. Does keeping your bitcoin in a trezor wallet is storing the bitcoin in the bitcoin network and no one can confiscate it? I don’t want to put it in exchanges and I don’t want my Bitcoins disappearing from my cold wallet. If any could shed some light into it I would be grateful.\n\nThanks!",
            "stickied": false,
            "comments": [
                {
                    "id": "i84yh1i",
                    "author": "BTCMachineElf",
                    "score": 5,
                    "created_utc": 1652237985.0,
                    "response": "Yes. If sent to your trezor, the bitcoin is sent to your address on the blockchain, locking it to your private key. It will be yours, unconfiscatable and uncensorable.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i84zn5f",
                            "author": "ndgoLiberty",
                            "score": 4,
                            "created_utc": 1652238556.0,
                            "response": "This. And you can just turn off the trezor, heck even lose it, and as long as you have your seed phrase you can always recover your funds.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i84yyb9",
                    "author": "cheezball_",
                    "score": 3,
                    "created_utc": 1652238214.0,
                    "response": "someone would need to know your Seed Phrase **Or** Have physical access to your Trezor and your know your Pin to actually take your Bitcoin from your Trezor",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i86nh81",
                    "author": "silvansalem",
                    "score": 3,
                    "created_utc": 1652277220.0,
                    "response": "Your bitcoin stays in the blockchain. What you do with your Trezor is generate a wallet with its own private/public key, and when you send your btc to that wallet what you do is \"link\" your btc to that key, so in the blockchain it's clear who is the owner of what. Trezor is a device to sign those transactions in a secure way. If you lose it you can buy another hardwallet, input your seed inside and generate the same keys so you can access your funds again, which are on the blockchain. You don't \"phisically\" have yout bitcoin in your trezor.\n\n&#x200B;\n\nWhen you have your coins in an exchange you can't see the seed (24 words) or your \"exchange wallet\". This is because when you buy Bitcoin in an exchange they show how much bitcoin you have in the exchange, but you can't be sure they bought that and saved it for you. Once you take them out of the exchange and send them into your hard wallet, you \"force\" the exchange to buy bitcoin or give you \"the real\" bitcoin, not just some numbers on your screen.\n\n&#x200B;\n\nThats the reason why people that want to hold long term need to take Bitcoin out of the exchange, so they can be sure they really have what they payed for.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "umy7qe",
            "title": "Help me get my BTC off exchanges!",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/umy7qe/help_me_get_my_btc_off_exchanges/",
            "author": "Steve_Holt-Bluth",
            "created_utc": 1652232665.0,
            "score": 3,
            "num_comments": 19,
            "subreddit": "BitcoinBeginners",
            "selftext": "I am getting more and more nervous about my BTC on exchanges. In short, I have BTC spread amongst various exchanges because I was new to crypto and enjoyed the minor interest gains from these programs but now I fully realize the risk of \"lending\" my coins to these companies and with the current market, who knows if all of them will survive.\n\nI bought a cold card and was investigating moving the btc off the exchanges and into a sparrow/cold card set up. I have been playing around with it, but don't feel fully comfortable with the sparrow/cold card system to move all my BTC to this platform yet.\n\n**Any suggestions to either: rapidly learn about sparrow/cold card (I have already read both FAQ/DOCS pages on their respective websites) and watched a few YouTube videos? OR**\n\n**Any suggestions for an alternative, safe, and possibly easier to comprehend storage system? The blue wallet has a great UI but their security was really lacking compared to sparrow.**\n\nMy reservation with sparrow/cold card is:\n\n1. I don't like how my BTC balance is displayed on the sparrow desktop app. If someone steals my computer and gains access they can see my btc balance and could do a $5 wrench attack to access my cold card.\n2. I have not practiced for worst case scenario (cold card is lost/destroyed) and I have to use seed phrase to re-access all my coins.\n3. I am not running a BTC node so sparrow is using public servers for my wallet.",
            "stickied": false,
            "comments": [
                {
                    "id": "i858xm0",
                    "author": "BTCMachineElf",
                    "score": 3,
                    "created_utc": 1652243478.0,
                    "response": "Instead of sparrow you could use electrum if you don't like the UI. I'm not familiar with sparrow. \n\nYou can't beat a coldcard. Try sending a trivial amount to your hardware wallet. It may help you gain confidence in it.\n\nNo matter what, you'll need to get your opsec right with the seed phrase. Any self-custody wallet relies on that.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}