{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uzixdn",
            "title": "CBDC = Prisoner without prison",
            "url": "https://i.redd.it/4s4v4y05f6291.jpg",
            "author": "KAX1107",
            "created_utc": 1653726072.0,
            "score": 1818,
            "num_comments": 414,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "iab12u8",
                    "author": "LankeeM9",
                    "score": 265,
                    "created_utc": 1653740866.0,
                    "response": "“Transaction declined”\n\n“Your Bitcoin is suspected to be associated with criminal activity, please wait patiently while the police arrive.”",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iabb8q4",
                            "author": "ChronoBasher",
                            "score": 102,
                            "created_utc": 1653746624.0,
                            "response": "Came to post this, heres another:\n\n\"Your Bitcoin address has donations to union accounts that conflict with our corporate policies.\"\n\n\"Your Bitcoin address has purchases related to \"unhealthy\" service providers, therefore we are increasing your insurance premiums.\"",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iabrxwu",
                                    "author": "Shaharlazaad",
                                    "score": -9,
                                    "created_utc": 1653754605.0,
                                    "response": "I don't get why you guys think this would be easier and not more difficult to implement on a Bitcoin system? \n\nMy name address phone number and likely more information then that is tied to my credit card, my bank account, PayPal, all the ways we use cash now aside from literal cold hard cash. Everything digital money requires you to attach identifying information to it. \n\nButcoin does not. Someone has to come along and figure out which wallet belongs to who based on whatever information they could gather. \n\nThat means if we were all using a Bitcoin system this brand of financial opression would be more difficult to implement then it would be with our current system. \n\nu/LankeeM9",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iabti23",
                                            "author": "Space_Lux",
                                            "score": 22,
                                            "created_utc": 1653755339.0,
                                            "response": "Not yet, its really easy. \nJust allow every company to only accept payments from verified wallets. Done.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "iacalfz",
                                            "author": "ChronoBasher",
                                            "score": 8,
                                            "created_utc": 1653763460.0,
                                            "response": "Merchants and healthcare orgs currently do not have access to all of your transaction histories. With Bitcoin they would?\n\nThey wouldn't even need your identity to restrict the transactions for the examples I gave?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iadlsjv",
                                                    "author": "Keith_Kong",
                                                    "score": 1,
                                                    "created_utc": 1653786953.0,
                                                    "response": "Not necessarily, most transactions will take place on layer 2’s which make payments a lot more private and its impossible to track everything there. In some cases you can deduce a certain wallets transactions but there’s always improvements to make this harder.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "iac4v2c",
                                            "author": "vinniethecrook",
                                            "score": 3,
                                            "created_utc": 1653760683.0,
                                            "response": "You’re missing the literal companies made to make tracking wallets easy for their customers",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "iabxm0i",
                                            "author": "Separate-Sentence-91",
                                            "score": 9,
                                            "created_utc": 1653757250.0,
                                            "response": "> Butcoin\n\nDon't you dare fix that typo",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iactw1o",
                                                    "author": "Shaggy_One",
                                                    "score": 1,
                                                    "created_utc": 1653772703.0,
                                                    "response": "Awh they changed it.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "iabd3qc",
                                    "author": "_Pohaku_",
                                    "score": -14,
                                    "created_utc": 1653747577.0,
                                    "response": "To be fair, on the latter point, people who choose unhealthy lifestyles should have to pay higher premiums than those who choose healthy. It’s how risk & insurance work.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iabl0rl",
                                            "author": "The_Particularist",
                                            "score": 9,
                                            "created_utc": 1653751371.0,
                                            "response": "And who gets to decide what \"unhealthy\" means? Insurance companies whose main source of profit are premiums?\n\nEDIT: People seem to miss the point I was trying to make. If a company's entire business model depends on declaring *more* things to be unhealthy, are you really going to trust them when they say something is unhealthy instead of assuming they have an ulterior motive to do so? Namely, increasing their own profits through higher premiums?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iabyxf7",
                                                    "author": "JoeyJoJo_1",
                                                    "score": 11,
                                                    "created_utc": 1653757865.0,
                                                    "response": "The older I get, the more I realise everybody on this fucking website is full of shit.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iacgtvn",
                                                            "author": "BigBadAl",
                                                            "score": 3,
                                                            "created_utc": 1653766413.0,
                                                            "response": "This sub is slowly turning into 4Chan.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "iabmrw8",
                                                    "author": "sailboat_explosion",
                                                    "score": 6,
                                                    "created_utc": 1653752193.0,
                                                    "response": "Sorry, yeah? The idea that you and only you can decide what is \"unhealthy\" is unrealistic and a bit silly.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "iabnwlm",
                                                    "author": "elperorojo",
                                                    "score": 4,
                                                    "created_utc": 1653752718.0,
                                                    "response": "Uhhhh yea. That’s how insurance works",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "iac1wuz",
                                                    "author": "Ivirsven1993",
                                                    "score": -2,
                                                    "created_utc": 1653759271.0,
                                                    "response": ">And who gets to decide what \"unhealthy\" means? Insurance companies whose main source of profit are premiums\n\nYes. If your are a smoker or morbidly obese or any number of things you are a higher risk. I wouldn't offer to cover your possible medical expenses if you couldn't lift your ass out of a chair for more than 5 minutes at a time",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iacpk4s",
                                                            "author": "SlowMotionPanic",
                                                            "score": 3,
                                                            "created_utc": 1653770599.0,
                                                            "response": "On that note, African Americans should be charged a higher premium because they are more prone to certain major diseases at earlier stages in their lives (such as certain cardiovascular conditions). \n\n\nPeople with bad credit are more likely to live unhealthy lifestyles. We should start rating health insurance based on credit, yes? \n\n\nYou can play this game all day. The law of large numbers averages it all out. *That* is how insurance works. Yours is an argument used to justify horrible shit like redlining in the industry’s past. \n\n\nHealthcare  shouldn’t be punitive. If you can’t grok that then maybe those death panels at private insurers have an opening for you.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "iacqqq0",
                                                                    "author": "Ivirsven1993",
                                                                    "score": -2,
                                                                    "created_utc": 1653771182.0,
                                                                    "response": "Ah yes, r-r-r-r-acism. Sorry but thats a tired argument that's been injected into every conversation and at this point it holds no weight. Have a nice day.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "iacpktf",
                                                    "author": "_Pohaku_",
                                                    "score": -2,
                                                    "created_utc": 1653770607.0,
                                                    "response": "Ah. So the concept that eating 5000 calories of cheeseburgers a day is unhealthier than eating a balanced diet of nutritious food is a subjective view, and not verifiable by any facts. Gotcha.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "iaccuws",
                                            "author": "Stevegrig",
                                            "score": 2,
                                            "created_utc": 1653764560.0,
                                            "response": "If crypto didn’t exist, what would you be doing right now?",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "iada8ac",
                                            "author": "nugymmer",
                                            "score": 1,
                                            "created_utc": 1653780655.0,
                                            "response": "Funny thing is health is a random crapshoot for the most part.\n\nLifestyle sure plays a part but your genes do too and to a much bigger extent.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "iacq0d4",
                                    "author": "yzhh1987",
                                    "score": -4,
                                    "created_utc": 1653770820.0,
                                    "response": "I guess you are pretty clueless how things really work.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "iacrp8c",
                                    "author": "qr52",
                                    "score": -2,
                                    "created_utc": 1653771629.0,
                                    "response": "Yet they can't take away your bitcoin.  Also, if we're already using bitcoin, they have zero power so this would never happen.  \n\nTheir ability to create money is what gives them power.  \n\nPerhaps you don't know only banks create US dollars. \n\nhttps://www.youtube.com/watch?v=JG5c8nhR3LE  \n\nYet another fed post in a bitcoin sub.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iacutnp",
                                            "author": "ChronoBasher",
                                            "score": 2,
                                            "created_utc": 1653773150.0,
                                            "response": "I'm not taking about the government or banks at all?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iacv0z3",
                                                    "author": "qr52",
                                                    "score": -2,
                                                    "created_utc": 1653773248.0,
                                                    "response": "The government is the tail.  Banks are the dog.  The dog wags the tail.  \n\nStill, bitcoin transactions can be hidden.  Try that with their cbdcs.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iacz8h4",
                                                            "author": "ChronoBasher",
                                                            "score": 2,
                                                            "created_utc": 1653775154.0,
                                                            "response": "My example was not with banks or the government?  My example was with a merchant and a health insurance company?",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "iad7b12",
                                                                    "author": "qr52",
                                                                    "score": -3,
                                                                    "created_utc": 1653779120.0,
                                                                    "response": "It's still stupid as you can hide your transactions.  You're simply a dollar sycophant.  Really an elitist sycophant.  \n\nAlso, banks influence the policies of every company and organization.   You get loans, you do what the banks say.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "iadaab5",
                                                                            "author": "ChronoBasher",
                                                                            "score": 1,
                                                                            "created_utc": 1653780685.0,
                                                                            "response": "To be fair, I think thier are problems with the current system too.  But I don't think Bitcoin or Blockchain is the solution.\n\nECASH has been the best solution I've see so far: https://lynch.house.gov/_cache/files/1/7/17e47e5a-2bff-42c1-b509-eb8a50931fa6/BDDFF183213326821B5C88B7F326EABB.ecashact-lynch.pdf",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "iadc0wb",
                                                                                    "author": "qr52",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653781604.0,
                                                                                    "response": "All bitcoin is is an open ledger of transactions with a capped supply of new units that are fairly and openly distributed to those that do work.  It is THE solution regardless of how many elite sycophants and employees come here and lie about it.",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                },
                                                                                {
                                                                                    "id": "iadc4fw",
                                                                                    "author": "qr52",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653781656.0,
                                                                                    "response": "There is NOTHING the banks or government will ever create that is better or more fair.  They simply want to enrich themselves.",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "iab9qyb",
                            "author": "haddock420",
                            "score": 30,
                            "created_utc": 1653745841.0,
                            "response": "I had a dream last night that I sent bitcoin to my Coinbase wallet and it got confiscated by the exchange because they determined that the bitcoin had been used by Yakuza criminals in the past.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iacv2oq",
                                    "author": "rjward1775",
                                    "score": 13,
                                    "created_utc": 1653773272.0,
                                    "response": "That would suck because almost all of my coins come directly from the yakuza.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "iabby85",
                                    "author": "lingi6",
                                    "score": 8,
                                    "created_utc": 1653746991.0,
                                    "response": "i hope it doesnt record my transaction for the call girl, can we write it off as grocery bill.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iacooa9",
                                            "author": "OneDollarToMillion",
                                            "score": 2,
                                            "created_utc": 1653770193.0,
                                            "response": "Yes you can write it as a grocery girl.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iad28j2",
                                                    "author": "celestialhopper",
                                                    "score": 1,
                                                    "created_utc": 1653776601.0,
                                                    "response": "A Gill, if you will.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "iadd9yp",
                                            "author": "Jazzysmooth11",
                                            "score": 2,
                                            "created_utc": 1653782278.0,
                                            "response": "Depends, did you eat it?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iadtvno",
                                                    "author": "Rod44546",
                                                    "score": 1,
                                                    "created_utc": 1653791516.0,
                                                    "response": "i eat tacos for all night",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "iacveig",
                                            "author": "333646",
                                            "score": 1,
                                            "created_utc": 1653773430.0,
                                            "response": "Think of Bitcoin as a bow. The more it goes down, the more it goes up",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "iacwsnu",
                                    "author": "Green-Bluebird-2955",
                                    "score": 3,
                                    "created_utc": 1653774044.0,
                                    "response": "Jokes on you for holding coins in a kyc exchange",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "iabj7al",
                            "author": "anonymouscitizen2",
                            "score": 10,
                            "created_utc": 1653750529.0,
                            "response": "The difference between the store declining a payment and the currency issuer/payment processor is tremendous. If the store declines the payment (like in your scenario) you can go to another store or trade with another person to get what you need. In the case of a CBDC your ability to transact with anybody can be shut down. \n\nThat is the major distinction and it is an extremely important one.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iade9m0",
                                    "author": "Kettleballer",
                                    "score": 2,
                                    "created_utc": 1653782810.0,
                                    "response": "I’m confused as to why OP thinks a private company’s decisions would have anything to do with how the government would control  a centralized crypto. If the company wants to refuse your payment because of “woke reason” it doesn’t matter what currency you use.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "iab7k29",
                            "author": "davidpmicklock",
                            "score": 13,
                            "created_utc": 1653744640.0,
                            "response": "Really? More so than any other government issued currency? Central bank digital currencies are going to be programmable which means the central authority will dictate when you can spend, and what you can spend on.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iabcxtu",
                                    "author": "Casino_Insider",
                                    "score": 1,
                                    "created_utc": 1653747497.0,
                                    "response": "Remember the last time your physical cash got refused somewhere?\n\nYeah, me neither.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iabptly",
                                            "author": "LordofNarwhals",
                                            "score": 13,
                                            "created_utc": 1653753615.0,
                                            "response": "Lots of restaurants in Sweden don't accept cash. That way they don't need to bother with all the security around cash registers and transportation.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "iaby0vn",
                                            "author": "LayPessimist",
                                            "score": 11,
                                            "created_utc": 1653757441.0,
                                            "response": "If you've been to Western Europe, you will find a lot of places that do not take cash anymore.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "iac216s",
                                            "author": "deadontheinternet",
                                            "score": 6,
                                            "created_utc": 1653759327.0,
                                            "response": "This happens to me weekly and literally every time I go to an NBA game? You’ve never heard of card only? Wild if serious",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "iabk9ug",
                                            "author": "davidpmicklock",
                                            "score": 17,
                                            "created_utc": 1653751022.0,
                                            "response": "Yes I do.  Two weeks ago at PNC Park in Pittsburgh. Cash refused. Debit or credit card only.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "iabe8yd",
                                            "author": "IDigYourStyle",
                                            "score": 13,
                                            "created_utc": 1653748135.0,
                                            "response": "I actually do, there is a bar/music venue here (Madison, WI) that is \"cashless\"... Their site says: \n\n\"We are a cashless facility meaning we are unable to accept cash as a form of payment. \n\nOur box office, coat check, and venue merch will only accept credit and debit.\n\nOur bars will only accept credit, debit, apple pay, and Google pay\"\n\nYour experience isn't universal.\n\nEdit: a word",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iabh9ib",
                                                    "author": "AE5NE",
                                                    "score": 6,
                                                    "created_utc": 1653749598.0,
                                                    "response": "This may be a response to a burglary/holdup incident",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iabsma9",
                                                            "author": "rokman",
                                                            "score": 6,
                                                            "created_utc": 1653754921.0,
                                                            "response": "or employees that steal; or the fact that moving cash to a bank has costs",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "iac26gy",
                                                            "author": "deadontheinternet",
                                                            "score": 1,
                                                            "created_utc": 1653759398.0,
                                                            "response": "Sounds like as good of a reason to go cashless as any",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "iack24o",
                                                    "author": "Gabilgatholite",
                                                    "score": 1,
                                                    "created_utc": 1653767993.0,
                                                    "response": "One could probably use cash to buy a prepaid debit card and then use said debit card to make electronic purchases...",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "iabdq3w",
                                            "author": "usersince2015",
                                            "score": 6,
                                            "created_utc": 1653747881.0,
                                            "response": "Remember the last time you used physical cash? I don't.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iabgk90",
                                                    "author": "NitronBot106",
                                                    "score": 14,
                                                    "created_utc": 1653749265.0,
                                                    "response": "Everytime I go to the dispensary",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iac282g",
                                                            "author": "deadontheinternet",
                                                            "score": 2,
                                                            "created_utc": 1653759420.0,
                                                            "response": "All of mine take card",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "iac7h45",
                                                                    "author": "NitronBot106",
                                                                    "score": 3,
                                                                    "created_utc": 1653761947.0,
                                                                    "response": "You mean your corporate surveillance card? I wouldn't never use that there or the liquor store or any other place of \"ill repute\". That's pretty much designated for gas and groceries, at least for me.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "iac8cv6",
                                                                            "author": "deadontheinternet",
                                                                            "score": 8,
                                                                            "created_utc": 1653762370.0,
                                                                            "response": "Pretty smart tbh. But I’m the type of person that likes to shove my dirtbag-ness in my governments face anyway",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "iad0o0y",
                                                    "author": "Reonlive420",
                                                    "score": 1,
                                                    "created_utc": 1653775842.0,
                                                    "response": "Most days. Fuck cashless society. Resist or be under total surveillance",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "iachm54",
                                            "author": "BigBadAl",
                                            "score": 1,
                                            "created_utc": 1653766788.0,
                                            "response": "[You'll struggle to get or spend cash in the UK](https://www.unbiased.co.uk/news/financial-adviser/cashless-uk-may-come-too-soon).\n\nLots of pubs, restaurants, and small shops are card only.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "iacjpea",
                                            "author": "Itsthatijustdontcare",
                                            "score": 1,
                                            "created_utc": 1653767823.0,
                                            "response": "Literally ANY time I try to spend a 100$",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "iact4hb",
                                            "author": "Congregator",
                                            "score": 1,
                                            "created_utc": 1653772329.0,
                                            "response": "Absolutely not the case where I live. There are a few shops near my house that recently quit allowing cash transactions- and that even includes tipping.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "iacctgn",
                                            "author": "romjpn",
                                            "score": 0,
                                            "created_utc": 1653764541.0,
                                            "response": "There's a shop near me that will only accept payment from applications. Apparently it's legal to refuse cash now. And even weirder, it's in Japan.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "iackez1",
                                    "author": "easyEggplant",
                                    "score": 1,
                                    "created_utc": 1653768167.0,
                                    "response": "Denver.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "iabcz4v",
                            "author": "Explodicle",
                            "score": 8,
                            "created_utc": 1653747515.0,
                            "response": "That's why the Lightning Network uses onion routing (like Tor) by default.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iacff1d",
                                    "author": "nowuknoimpaperthin",
                                    "score": -1,
                                    "created_utc": 1653765763.0,
                                    "response": "This doesn't really make a difference tbh. The opened channel utilizing multisig is confirmed on-chain once the transaction is completed. The wallet addresses will still be publicly recorded and verified just like any other.\n\nEveryone here is confusing the fungibility of bitcoin with associated addresses which are different, but related, use cases.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iaclpqw",
                                            "author": "johndoeisback",
                                            "score": 1,
                                            "created_utc": 1653768817.0,
                                            "response": ">This doesn't really make a difference tbh.\n\nIt does make a difference at payment level. The payments you make through that channel are private, nobody knows where they are going except you, and the recipient doesn't know where they are coming from. If you have other channels open then you may also be routing other people's payments.\n\nOnce you close the channel the \"dirty\" bitcoins will go to the counterparty of your channel, not the final destination of your payments.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "iacmyyk",
                                            "author": "Explodicle",
                                            "score": 1,
                                            "created_utc": 1653769433.0,
                                            "response": ">The opened channel utilizing multisig is confirmed on-chain once the transaction is completed. \n\nNo it's not. You can have thousands of transactions, being routed to hundreds of different recipients, without having to close the channel. \n\n> The wallet addresses will still be publicly recorded and verified just like any other.\n\nLightning invoices aren't the same thing as bitcoin addresses, and don't go on the blockchain. Only settlements between peers do. \n\n>Everyone here is confusing the fungibility of bitcoin with associated addresses which are different, but related, use cases.\n\nWhen you're receiving a Lightning payment, there's no way to check if the source bitcoin is \"clean\". So if I'm a drug dealer and I'm buying your alpaca socks, the only way you'd know my bitcoin address is by compromising every node along the route.\n\nNo offense, but did you hear all of this from a subreddit dedicated to an alternate cryptocurrency?",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "iabfqac",
                            "author": "JollySno",
                            "score": 2,
                            "created_utc": 1653748858.0,
                            "response": "Meanwhile, your fiat is known to be associated with criminal activity, move along sir",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iabet2x",
                            "author": "Zelgada",
                            "score": 1,
                            "created_utc": 1653748406.0,
                            "response": "Curious to see what happens with things like mimblewimble which will give transaction confidentiality.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iab8sla",
                            "author": "varikonniemi",
                            "score": -6,
                            "created_utc": 1653745325.0,
                            "response": "infinitely better than giving a bank the arbitrary authority to decline. At least with government you have easy legal routes to fight it.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iab9i3u",
                                    "author": "cfdeveloper",
                                    "score": 19,
                                    "created_utc": 1653745709.0,
                                    "response": ">government   \n>  \n>easy legal routes to fight it.\n\nLOL, yeah, ok.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iab9u2k",
                                            "author": "varikonniemi",
                                            "score": 4,
                                            "created_utc": 1653745887.0,
                                            "response": "trying to legally hold a bank responsible for what they do is infinitely harder than the government.\n\nThe bank has authority to act at their discretion. The government only what the law explicitly says.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iach6wi",
                                                    "author": "RecommendationNo6041",
                                                    "score": 1,
                                                    "created_utc": 1653766583.0,
                                                    "response": "What the law explicitly says is due to interpretation. Otherwise there were no need of lawyers at all.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "iabcnj5",
                                            "author": "solidstate25",
                                            "score": 2,
                                            "created_utc": 1653747354.0,
                                            "response": "Lmfao seriously",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "iabdlo1",
                                    "author": "jeuzero",
                                    "score": 1,
                                    "created_utc": 1653747821.0,
                                    "response": "Hahahahahahahahaha",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "iackp7a",
                            "author": "johndoeisback",
                            "score": 1,
                            "created_utc": 1653768307.0,
                            "response": "\"The fuckers are fast, too\"",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iacoklt",
                            "author": "OneDollarToMillion",
                            "score": 1,
                            "created_utc": 1653770146.0,
                            "response": "LOL This tweet has158 upvotes. Number 158 is equivalent of 911 in Czechia and Slovakia.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iacre4h",
                            "author": "qr52",
                            "score": 1,
                            "created_utc": 1653771484.0,
                            "response": "The difference is they can't take away your bitcoin.   \n\nNice try though.  \n\nEdit:  Also you can obfuscate your bitcoin.   \n\nSo this is yet another fed post here.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iadstxo",
                            "author": "LiteStig",
                            "score": 1,
                            "created_utc": 1653790914.0,
                            "response": "Maybe this crypto self custody thing is actually kinda useful",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iab0kqk",
                    "author": "joven_of_slave",
                    "score": 120,
                    "created_utc": 1653740533.0,
                    "response": "Decentralised is the way to go",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iacqw77",
                            "author": "casprove",
                            "score": 2,
                            "created_utc": 1653771254.0,
                            "response": "Well I won't be paying that way.\n\nI will use cash and if they don't want my money I will go elsewhere.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iadgwtn",
                                    "author": "joven_of_slave",
                                    "score": 1,
                                    "created_utc": 1653784244.0,
                                    "response": "I agree.  There should never be just one way to pay for something.  But id like to think that healthy competition will keep the others honest.   Probably wont happen that way, but i still think it could",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "iabb8k6",
                            "author": "waveobserver",
                            "score": 5,
                            "created_utc": 1653746622.0,
                            "response": "Central Bank Digital Control",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iabq8fe",
                                    "author": "atmskimm",
                                    "score": 1,
                                    "created_utc": 1653753806.0,
                                    "response": "And when they all start demanding you it with biometrics?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "iacf6x3",
                            "author": "justadogee",
                            "score": 0,
                            "created_utc": 1653765657.0,
                            "response": "There's no true decentralization of anything just a nice kids fairytale",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iab8cl7",
                    "author": "Puftwaffe",
                    "score": 156,
                    "created_utc": 1653745080.0,
                    "response": "Y’all love inventing situations to be mad at lmao",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iacmg87",
                            "author": "magic8boy",
                            "score": 27,
                            "created_utc": 1653769185.0,
                            "response": "fr its getting embarassing",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iaboo9a",
                            "author": "OnlythisiPad",
                            "score": -24,
                            "created_utc": 1653753077.0,
                            "response": "I can tell you’re pretty cool person but I have two questions for you:\n\nDid Canada freeze people’s bank accounts for donating to the truckers, yes or no?\n\nDoes China have a social credit system? Again, simple yes or no.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iabqdwc",
                                    "author": "caseypatrickdriscoll",
                                    "score": 38,
                                    "created_utc": 1653753875.0,
                                    "response": "Yes and yes. \n\nThose situations were real. This one was invented.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iacpzqa",
                                            "author": "New_Dawn",
                                            "score": 3,
                                            "created_utc": 1653770812.0,
                                            "response": "Whoosh...",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "iadnugz",
                                            "author": "cdjohn24",
                                            "score": 1,
                                            "created_utc": 1653788085.0,
                                            "response": "OPs bad he shouldn’t use anything but completely accurate depiction of issues",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "iabpxkg",
                                    "author": "12of12MGS",
                                    "score": 24,
                                    "created_utc": 1653753665.0,
                                    "response": "Yes and yes. \n\nAnd yet how does that make the picture accurate?",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "iabqw35",
                                    "author": "itchy118",
                                    "score": 24,
                                    "created_utc": 1653754111.0,
                                    "response": ">Did Canada freeze people’s bank accounts for donating to the truckers, yes or no?\n\nYou mean for financing an illegal occupation that made the lives of hundreds of thousands of downtown Ottawa residents hell for weeks while breaking countless laws?  They got off easy.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iac2hgv",
                                            "author": "deadontheinternet",
                                            "score": -6,
                                            "created_utc": 1653759545.0,
                                            "response": "By having funds frozen? I don’t like what they did either but this is a scary comment",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "iac2s0e",
                                    "author": "Mr_Mi1k",
                                    "score": 7,
                                    "created_utc": 1653759685.0,
                                    "response": "You’re confusing real things that happened with made up situations in your head. Learn to differentiate them buddy",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "iad8i92",
                            "author": "ketoh78",
                            "score": -1,
                            "created_utc": 1653779752.0,
                            "response": "Fuck you and your ignorance.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iaboi5i",
                            "author": "SmallerBork",
                            "score": -12,
                            "created_utc": 1653752999.0,
                            "response": "Is joke",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iabrtjc",
                    "author": "No-Marzipan-2423",
                    "score": 43,
                    "created_utc": 1653754548.0,
                    "response": "I'm against CBDC but this framing is asinine",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iacaenl",
                            "author": "Womec",
                            "score": 4,
                            "created_utc": 1653763368.0,
                            "response": "The pushback on this would be insane.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iacrw4j",
                            "author": "qr52",
                            "score": 2,
                            "created_utc": 1653771719.0,
                            "response": "I mean they are already saying they want to track your \"carbon footprint\" with cbdcs.  This isn't a far stretch at all.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iac3qw3",
                            "author": "Extension-Relation-3",
                            "score": 2,
                            "created_utc": 1653760148.0,
                            "response": "Agreed. Why does this have to be a CBDC problem? If in the future Twitter requires you pay to use their service they will have your government identity attached to your Twitter account so this will already be possible? Even that isn't required. Twitter, Facebook, etc definitely know your real identity based on their data collection and cross referencing with other data they get from data brokers.\n\n  \nTo be quite honest if they're not doing it now they wouldn't do it with a CBDC. So I don't think this is a good example of why a CBDC is bad.\n\n  \nNow on the other hand, the Treasury or the Fed doesn't know about every single dollar you spend, but with a CBDC they would.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iaawpdb",
                    "author": "PlotHole2017",
                    "score": 62,
                    "created_utc": 1653737940.0,
                    "response": "Really only a step removed from what's actually happening. PayPal closed accounts for two news outlets and as far as I've heard they still haven't given one of them back the $10,000 they had stored in their account.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iabiwur",
                            "author": "No_Release6675",
                            "score": 14,
                            "created_utc": 1653750391.0,
                            "response": "Paypal are thieves. Stay away from them",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iabxgw2",
                            "author": "ilikedatsyuk",
                            "score": 5,
                            "created_utc": 1653757187.0,
                            "response": "PayPal is not a bank.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iab3f42",
                            "author": "Mewmeister1337",
                            "score": 17,
                            "created_utc": 1653742277.0,
                            "response": "Paypal is notorious for something like this. Paypal also blocks a lot of companies from using it. For example everything „drug related“ im pretty sure porn is a no go too",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iabwa5z",
                                    "author": "Rrdro",
                                    "score": 0,
                                    "created_utc": 1653756639.0,
                                    "response": "Why do they care?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iachqby",
                                            "author": "RecommendationNo6041",
                                            "score": 1,
                                            "created_utc": 1653766846.0,
                                            "response": "US public opinion",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "iaayvux",
                            "author": "MuchTemperature6776",
                            "score": 19,
                            "created_utc": 1653739435.0,
                            "response": "Anymore you store with PayPal they can freeze according to their ToS I believe, so if you store $10000 with them then it’s your fault if that’s lost.\n\nI never store anything in my PayPal account and I’d never store a lot. It’s just way too risky because they will sometimes just freeze your account indefinitely for suspicious activity.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iab2ixk",
                            "author": "Rent_A_Cloud",
                            "score": 5,
                            "created_utc": 1653741753.0,
                            "response": "Why store on Paypal, i just pay directly...",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iacieu3",
                            "author": "874151",
                            "score": 2,
                            "created_utc": 1653767177.0,
                            "response": "PayPal is a private company though, not a government backed digital fiat",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iab8lsh",
                            "author": "diydude2",
                            "score": 1,
                            "created_utc": 1653745221.0,
                            "response": "This is why Bitcoin will replace PayPal.  Normies will figure it out eventually.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iaaxk0l",
                    "author": "BlazingJava",
                    "score": 74,
                    "created_utc": 1653738538.0,
                    "response": "Now we joke, later we can't say much because it will become reality",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iab2zxk",
                            "author": "cryptovist",
                            "score": 15,
                            "created_utc": 1653742036.0,
                            "response": "You will own nothing and still be happy, so you can just chill and wait..",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iabibw1",
                                    "author": "jacobbowserr",
                                    "score": 1,
                                    "created_utc": 1653750115.0,
                                    "response": "Right now I own nothing and I'm still happy",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "iab7oi6",
                            "author": "eudezet",
                            "score": 0,
                            "created_utc": 1653744710.0,
                            "response": "This is actually scary af. Is there even anything ordinary people can do? Even stacking bitcoin and gold won’t do much good if these psychopaths ban it. 1984 was really ahead of its time.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iabjolu",
                                    "author": "OwOegano_Returns",
                                    "score": -2,
                                    "created_utc": 1653750750.0,
                                    "response": "First time I have seen someone puke out the \"literally 1984\" ***completely unironically***. Crypto bros really are something else...",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iabodwz",
                                            "author": "hardboiledcop35",
                                            "score": 3,
                                            "created_utc": 1653752944.0,
                                            "response": "Is it cool to deny the real world accuracies of 1984 now? Go read pepper pig or something",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iac669n",
                                                    "author": "SupermarketNo3265",
                                                    "score": 1,
                                                    "created_utc": 1653761313.0,
                                                    "response": "What the fuck is pepper pig?",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "iacuyra",
                                                    "author": "Kanthabel_maniac",
                                                    "score": 1,
                                                    "created_utc": 1653773219.0,
                                                    "response": "can you read Pepper pig, where?",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "iabkmgj",
                                            "author": "godofpumpkins",
                                            "score": -1,
                                            "created_utc": 1653751183.0,
                                            "response": "More r/im14andthisisdeep material",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "iac5nbs",
                                            "author": "eudezet",
                                            "score": 1,
                                            "created_utc": 1653761057.0,
                                            "response": "Except I didn’t? And if you tell me that drawing parallels between 1984 and the reality we are living right now as well as the one we seem to be heading towards is me being edgy on the internet then I don’t really care about your opinion.\n\nEdit:\n\nYeah, you’re making fun of me for being a crypto bro with your post history? Lmao, go away, weirdo.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "iaci5ck",
                                    "author": "874151",
                                    "score": 1,
                                    "created_utc": 1653767049.0,
                                    "response": "It’s a fake post meant to scare you. It’s not actually scary.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iacphea",
                                            "author": "eudezet",
                                            "score": 1,
                                            "created_utc": 1653770562.0,
                                            "response": "You think that CBDC won’t give governments the power to actually turn this post into reality?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iadr5s7",
                                                    "author": "874151",
                                                    "score": 1,
                                                    "created_utc": 1653789962.0,
                                                    "response": "I think that\n1.\tIf the government were going to do that, it already would have (see: China)\n2.\tthis post was designed to mislead people into thinking this is happening now, on a sub prone to believing anything antigovernment that comes around\n3.\twe are a long way off from this happening, however likely it may be, and so panicking people about it now is legit just karma farming",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "iab86oh",
                            "author": "diydude2",
                            "score": -4,
                            "created_utc": 1653744991.0,
                            "response": "It will never become reality thanks to Bitcoin.\n\nHard money throws a real wrench in their plans for a digital ration card.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iabfqw0",
                    "author": "yourmakingittoeasy",
                    "score": 15,
                    "created_utc": 1653748867.0,
                    "response": "The strawiest of men",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iabrcy0",
                    "author": "GeologistEfficient89",
                    "score": 7,
                    "created_utc": 1653754333.0,
                    "response": "/r/thatwillneverhappen",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaavshz",
                    "author": "mrxsdcuqr7x284k6",
                    "score": 49,
                    "created_utc": 1653737287.0,
                    "response": "I like how the guy spreading hate speech on Twitter is the hero in this fanfic.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaax6xk",
                            "author": "NYKNYb",
                            "score": -16,
                            "created_utc": 1653738277.0,
                            "response": "Sure buddy",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iab0p5x",
                            "author": "BitcoinFan7",
                            "score": -18,
                            "created_utc": 1653740614.0,
                            "response": "Must be nice to be the one to be able to define what is allowed speech and what isn't.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iab27f9",
                                    "author": "mrxsdcuqr7x284k6",
                                    "score": 25,
                                    "created_utc": 1653741563.0,
                                    "response": "You have every right to restrict speech on your platform. You do have a platform, right?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iab41k9",
                                            "author": "BitcoinFan7",
                                            "score": -14,
                                            "created_utc": 1653742649.0,
                                            "response": "If you read carefully you will see it's not hate speech as defined by Twitter but by the bank.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iab66fl",
                                                    "author": "mrxsdcuqr7x284k6",
                                                    "score": 22,
                                                    "created_utc": 1653743867.0,
                                                    "response": "That's true. It's also true that your bank can already freeze your account for spreading hate speech on Twitter. They can freeze it for any reason that's not federally prohibited (racism, sexism, etc). CBDC's don't give them any extra power to lock your funds. They already have complete control.\n\nHere's something we can both agree on: self-custody your money in your own Bitcoin wallet and the bank won't be able to lock you out of it.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iab6x07",
                                                            "author": "BitcoinFan7",
                                                            "score": 3,
                                                            "created_utc": 1653744281.0,
                                                            "response": ">Here's something we can both agree on: self-custody your money in your own Bitcoin wallet and the bank won't be able to lock you out of it.\n\n💯",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "iaboqlm",
                                            "author": "SmallerBork",
                                            "score": 0,
                                            "created_utc": 1653753108.0,
                                            "response": "On the government's behalf though, nope.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "iabll5d",
                                            "author": "hardware4ursoftware",
                                            "score": -11,
                                            "created_utc": 1653751633.0,
                                            "response": "You’r logic is flawed. Once something becomes public domain. Such as twitter(it’s on the stock market) then yeah it’s everyone’s and not a “private platform” I may have used to many big words for you to understand tho.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iac06um",
                                                    "author": "Dont_Say_No_to_Panda",
                                                    "score": 3,
                                                    "created_utc": 1653758453.0,
                                                    "response": "Until the government buys a front rolling interest in Twitter and sets the policy, it is not “public domain” it is no different then a TV station or a book publisher.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iac6brf",
                                                            "author": "hardware4ursoftware",
                                                            "score": -4,
                                                            "created_utc": 1653761387.0,
                                                            "response": "To say a “publicly traded company” isn’t considered public domain is ridiculous.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "iabgvu3",
                            "author": "ArtMacCuinn",
                            "score": -15,
                            "created_utc": 1653749417.0,
                            "response": "By the modern definition of hate speech, you just committed hate speech right now by assuming the gender of the person in the meme.\n\nYour card is now declined.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iabolne",
                            "author": "SmallerBork",
                            "score": -11,
                            "created_utc": 1653753044.0,
                            "response": "Hate speech is free speech",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iaaylqn",
                    "author": "kaicoder",
                    "score": 12,
                    "created_utc": 1653739249.0,
                    "response": "In friendly western countries, it'll be more subtle like \"no discount given, full price payment plus 20% government tax because you didn't spend enough fiat this month\"",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iadwxui",
                            "author": "JA_Wolf",
                            "score": 1,
                            "created_utc": 1653793300.0,
                            "response": "You have to pay the nasty nono fees",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iaaqx1j",
                    "author": "dtr_ned",
                    "score": 20,
                    "created_utc": 1653733338.0,
                    "response": "Dictators who gave the order for genocides would have still been able to access their credit Suisse account - i don’t think they care too much about seizing your 7k because you tweeted something homophobic in 2011",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaar54i",
                            "author": "PiePerson15",
                            "score": 21,
                            "created_utc": 1653733542.0,
                            "response": "Keyword: people in power. Those perks don’t apply to the average joe",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iaarn53",
                                    "author": "dtr_ned",
                                    "score": 4,
                                    "created_utc": 1653733975.0,
                                    "response": "fair point",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "iaaxsm3",
                            "author": "Phuttbuckers",
                            "score": 9,
                            "created_utc": 1653738700.0,
                            "response": "There’s quite a few political figures and organizations who were literally banned from Bank of America and Paypal, and had their money in those places taken because of their political beliefs. I don’t agree with their views, but it’s still a thing that happens.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iac1b9a",
                                    "author": "deezx1010",
                                    "score": 1,
                                    "created_utc": 1653758986.0,
                                    "response": "Political figures like who?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iac0lw7",
                    "author": "Groundbreaking_Ad377",
                    "score": 2,
                    "created_utc": 1653758651.0,
                    "response": "This is pretty foolish. If a bank wanted to censor an individual, they would have exactly as much legal authority and technical ability to do so with or without a cbdc.\n\nIf you maybe replace \"bank\" with \"government\", you *might* have a point",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iac54i4",
                            "author": "LayPessimist",
                            "score": 2,
                            "created_utc": 1653760809.0,
                            "response": "Indeed. A bank should not have such authority anyway. They are no policing agency.\n\nSuch things are subject to due process in a properly functioning society.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iac1t8z",
                    "author": "walloon5",
                    "score": 2,
                    "created_utc": 1653759224.0,
                    "response": "CBDC / Social Credit System: You can have food after you delete your mean tweets",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iac8q4n",
                    "author": "ride_electric_bike",
                    "score": 2,
                    "created_utc": 1653762551.0,
                    "response": "Part of 2023 ESG credit system? Blackrocks next big idea",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iacdali",
                    "author": "justadogee",
                    "score": 2,
                    "created_utc": 1653764762.0,
                    "response": "Even worse , you can't use your cbdc to buy drugs or pay for sex",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaaqfut",
                    "author": "Phil_Drill",
                    "score": 27,
                    "created_utc": 1653732908.0,
                    "response": "There’s lots of reasons to adopt Bitcoin, but the dumbest ones I keep seeing are:\n\n1. main character syndrome where people think they’re important enough that someday their funds will be frozen by Interpol or the UN is going to issue sanctions on them in particular\n2. scared little boys who think their funds are going to be frozen because they’ll dare to say trans women aren’t women or something.\n\nHey buddy, they don’t even touch your bank account if you literally murder someone. That's why you have to use made-up hypotheticals like this to justify it.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaarfvy",
                            "author": "CryptoRevolution_",
                            "score": 28,
                            "created_utc": 1653733806.0,
                            "response": "Forgotten this already?\n\n[https://www.newsweek.com/banks-have-begun-freezing-accounts-linked-trucker-protest-1680649](https://www.newsweek.com/banks-have-begun-freezing-accounts-linked-trucker-protest-1680649)",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iab35yk",
                                    "author": "Phil_Drill",
                                    "score": -8,
                                    "created_utc": 1653742130.0,
                                    "response": ">Canada  \n\nFound the problem",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iab7ih4",
                                            "author": "Just1_More",
                                            "score": 5,
                                            "created_utc": 1653744615.0,
                                            "response": "You forget the [Patriot Act](https://www.aclu.org/issues/national-security/privacy-and-surveillance/surveillance-under-patriot-act)?\n\nWake up",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iaban7s",
                                                    "author": "Phil_Drill",
                                                    "score": 0,
                                                    "created_utc": 1653746316.0,
                                                    "response": "That says *monitor* banking activity, not seize control of it.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "iabzcln",
                                            "author": "LayPessimist",
                                            "score": -1,
                                            "created_utc": 1653758060.0,
                                            "response": "If it happened in Canada, a former western country, it can happen anywhere.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "iaarfk7",
                            "author": "ViridianZeal",
                            "score": 17,
                            "created_utc": 1653733798.0,
                            "response": "That last one is patently false. Where I live they can access your bank account for far less and I don't even live in some hell hole like China or Australia.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iab33t4",
                                    "author": "Phil_Drill",
                                    "score": 3,
                                    "created_utc": 1653742095.0,
                                    "response": "In the US at least, they can’t access your bank unless you financially benefitted from your crimes",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iab6n1f",
                                            "author": "Psynaut",
                                            "score": 5,
                                            "created_utc": 1653744125.0,
                                            "response": "Until they can.\n\nThe government couldn't stop you from having an abortion, until they could.\n\nThe police couldn't confiscate your cash with no proof or evidence other than a desire to do so, until they could.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iabahe0",
                                                    "author": "Phil_Drill",
                                                    "score": 6,
                                                    "created_utc": 1653746231.0,
                                                    "response": "By that logic, the government can't crack the code to get your bitcoin, until they can. They can't now, but maybe they will in the future. Supercomputers are only getting stronger. Better just abandon BTC now to be one step ahead of them.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iabbd2d",
                                                            "author": "Psynaut",
                                                            "score": 4,
                                                            "created_utc": 1653746686.0,
                                                            "response": "I see you sort of understand, but not completely.  First, you are comparing technological advancement to the government's ability to change laws, which are apples and oranges.  That's like comparing sunglasses and night time.\n\nI have worked in banking for a very long time, and if you think the government doesn't change rules, especially around financial monitoring, you are living with your head in the sand.  Laws change, and if you don't understand that you are probably young and think your reality is the only true reality.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "iabczko",
                                                                    "author": "Phil_Drill",
                                                                    "score": 8,
                                                                    "created_utc": 1653747521.0,
                                                                    "response": "I never said the government can't change laws. I'm saying the government could fund research and development efforts to crack and control the blockchain. If you're basing your \"now\" decisions on what is in the realm of possibilities in the future, then why not consider that one?",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "iabdu9m",
                                                                            "author": "LouRG3",
                                                                            "score": 2,
                                                                            "created_utc": 1653747936.0,
                                                                            "response": "Because he's already decided what he likes and doesn't like, and he won't hear sense or reason that contradicts it.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        },
                                                                        {
                                                                            "id": "iabog4i",
                                                                            "author": "Psynaut",
                                                                            "score": 1,
                                                                            "created_utc": 1653752972.0,
                                                                            "response": "> Better just abandon BTC now to be one step ahead of them.\n\nYou started the argument by asserting that my post was anti-bitcoin and promoting the elimination of BTC.  Now your argument is pivoting off in some other direction to assert I have not considered every possible threat to BTC in a post that wasn't about all possible threats to BTC.\n\nYou don't really seem to know what point you are trying to make. It seems like you just want an argument. Go find someone else, I'm going outside.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "iabasyz",
                            "author": "officialM3DL3Y",
                            "score": 0,
                            "created_utc": 1653746401.0,
                            "response": "You don't have to be the main character to be a victim of predatory inflation",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iabd6b5",
                                    "author": "Phil_Drill",
                                    "score": 5,
                                    "created_utc": 1653747611.0,
                                    "response": "I never criticized inflation as a reason for adoption.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iabe9rq",
                                            "author": "officialM3DL3Y",
                                            "score": -1,
                                            "created_utc": 1653748147.0,
                                            "response": "I know. Just pointing out you don't have to be special to be stolen from.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iabfztz",
                                                    "author": "Phil_Drill",
                                                    "score": 8,
                                                    "created_utc": 1653748989.0,
                                                    "response": "I also never said that. I’m laughing at people who want BTC *because* they think they’re special. Like, are you funding Iran’s nuclear program? Is your wealth ill-gotten from war crimes? No? Then chill the fuck out, Billy Badass.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iablepm",
                                                            "author": "officialM3DL3Y",
                                                            "score": 1,
                                                            "created_utc": 1653751549.0,
                                                            "response": "Ah good for you 👍",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "iabl8ge",
                            "author": "dubiousdexter",
                            "score": -3,
                            "created_utc": 1653751468.0,
                            "response": "Canadian government literally froze bank accounts of those who supported the Freedom Convoy. I never thought I'd see the day as a Canadian but here we are",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iab64az",
                            "author": "groypley90",
                            "score": -13,
                            "created_utc": 1653743834.0,
                            "response": "I buy Bitcoin because the government is delusional. The people who think men can become women also think printing money will people wealthy.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iabcgqp",
                                    "author": "Ranshin-da-anarchist",
                                    "score": 9,
                                    "created_utc": 1653747257.0,
                                    "response": "What the fuck does not being a transphobic loser have to do fiscal literacy?\n\nAlso you’re a transphobic loser and you should be ashamed of your shitty belief, fuck you.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iabf564",
                                            "author": "groypley90",
                                            "score": -7,
                                            "created_utc": 1653748571.0,
                                            "response": "\"Transphobic\", ok whatever. You won't guilt me with your moralizing language.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iablcwm",
                                                    "author": "Ranshin-da-anarchist",
                                                    "score": 6,
                                                    "created_utc": 1653751526.0,
                                                    "response": "Says a catholic 😆",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "iabf3u3",
                                            "author": "groypley90",
                                            "score": -6,
                                            "created_utc": 1653748552.0,
                                            "response": "\"Transphobic\", ok whatever. You won't guilt me with your moralizing language.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iabj04n",
                                                    "author": "JobEmbarrassed461",
                                                    "score": 9,
                                                    "created_utc": 1653750435.0,
                                                    "response": "No they're calling you weak and little because you can't handle the fact that someone you don't even know is different from you because it scares you.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "iabkdk8",
                                                    "author": "Ranshin-da-anarchist",
                                                    "score": 6,
                                                    "created_utc": 1653751069.0,
                                                    "response": "Whatever loser, I just think it’s funny when people who regurgitate tired ass right wing talking points think they know something.\n\nCringe AF",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "iadlhkf",
                            "author": "bigcockondablock",
                            "score": 1,
                            "created_utc": 1653786783.0,
                            "response": "Well said. This post irked me so thanks for this comment, lol.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iabnfgu",
                    "author": "trashcan_jan",
                    "score": 8,
                    "created_utc": 1653752496.0,
                    "response": "LOL oppression is when you can't say the n word on twitter. BTW, banks already exist, and they don't freeze your account for hateful tweets. This is so funny",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iac5kc0",
                            "author": "LayPessimist",
                            "score": 1,
                            "created_utc": 1653761018.0,
                            "response": ">\tand they don’t freeze your account YET for hateful tweets.\n\nftfy",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iabxqtd",
                    "author": "ilikedatsyuk",
                    "score": 8,
                    "created_utc": 1653757311.0,
                    "response": "This is made up and stupid.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iac35lf",
                            "author": "LayPessimist",
                            "score": -1,
                            "created_utc": 1653759865.0,
                            "response": "Just like ur comment",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iab9i7p",
                    "author": "Feisty_Tangerine_830",
                    "score": 8,
                    "created_utc": 1653745711.0,
                    "response": "What do you mean \"trans people should kill themselves\" qualifies as hate speech? 🙄",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iabpcjf",
                            "author": "SmallerBork",
                            "score": -13,
                            "created_utc": 1653753391.0,
                            "response": "How did we get to that? Hate speech is a left wing coined term, an evil fabrication to restrict plenty of things that aren't threats and encouraging suicide.\n\nI remember a story where a guy's girlfriend told him to kill himself multiple times in texts and when he did, she was sent to jail because that's not the same thing as saying the border is being overrun.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iabi7p2",
                    "author": "jacobbowserr",
                    "score": 3,
                    "created_utc": 1653750058.0,
                    "response": "You actually don't have to tweet ever",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iabyobh",
                    "author": "Dr__Waffles",
                    "score": 3,
                    "created_utc": 1653757745.0,
                    "response": "Sounds like a good rule to me",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iacswvq",
                    "author": "New_Dawn",
                    "score": 3,
                    "created_utc": 1653772224.0,
                    "response": "This satire is a jab at the left and their little speech codes. Judging by the comments you can see they don't like truth satire aimed at them.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaao8k3",
                    "author": "EmilyLovs",
                    "score": 10,
                    "created_utc": 1653730876.0,
                    "response": "Care to check what happened to the BTC holders in the trucker protest mate.?\n\n....Not your keys... not your coins?  Sound familiar.\n\nNot private... the biggest thug throws you in a cage until they are no longer your keys.\n\nCBDCs... the evil that enslaves the planet.... almost as evil as the blockCHAIN that shackles the slaves.\n\nPrivacy assets:  Get on the escape pod before this ship crashes mate.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iabe3qf",
                            "author": "Explodicle",
                            "score": 3,
                            "created_utc": 1653748065.0,
                            "response": "I'm having a little trouble understanding your wording. Are you saying the Canadian govt forced truckers to surrender their bitcoin, so we should buy altcoins?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iabmq1f",
                                    "author": "EmilyLovs",
                                    "score": 0,
                                    "created_utc": 1653752168.0,
                                    "response": "1) Yep.\n\n2) Privacy coins specifically.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iabo9ou",
                                            "author": "Explodicle",
                                            "score": 2,
                                            "created_utc": 1653752890.0,
                                            "response": "But why can't we just change Bitcoin so that privacy is the default, like in the Lightning Network?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iabqf7k",
                                                    "author": "EmilyLovs",
                                                    "score": -1,
                                                    "created_utc": 1653753892.0,
                                                    "response": "You have to on/off board lightning sometime mate.\n\nAnd those points can get pinched.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iabrq6g",
                                                            "author": "Explodicle",
                                                            "score": 2,
                                                            "created_utc": 1653754504.0,
                                                            "response": "Assuming we're going through exchanges, and not earning/spending crypto directly? If so, both altcoins and LN are subject to seizure, and can be moved off to a private wallet.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iabd3kf",
                    "author": "TickTockM",
                    "score": 3,
                    "created_utc": 1653747574.0,
                    "response": "dumb",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iabhckr",
                    "author": "ChronoHobo",
                    "score": 2,
                    "created_utc": 1653749638.0,
                    "response": " I’ve got a bridge in Brooklyn for sale if anyone here is interested.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iabts8n",
                    "author": "Hugh00Mungus",
                    "score": 2,
                    "created_utc": 1653755472.0,
                    "response": "Just don't do hate speech, so easy!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iac2txn",
                            "author": "LayPessimist",
                            "score": 2,
                            "created_utc": 1653759710.0,
                            "response": "But what is hate speech and who decides what is and isn't?\n\nDo you see the problem already? 🙂\n\nThat person (or group) has a lot of power.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iad8bul",
                                    "author": "Hugh00Mungus",
                                    "score": 1,
                                    "created_utc": 1653779658.0,
                                    "response": "It was an obvious poke at people telling others to just \"not break the law\".",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iac4akj",
                    "author": "JR-6420",
                    "score": 2,
                    "created_utc": 1653760410.0,
                    "response": "The point of this thread is to point out that your money is your money and nobody should be able to freeze it for anything you have said or done. It’s called freedom of speech known as the first amendment. The comments on this thread make me shake my head.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iac8xon",
                            "author": "91Caleb",
                            "score": 0,
                            "created_utc": 1653762654.0,
                            "response": "It’s not a real situation . Someone is just scared and made a shit meme",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iacg7gi",
                    "author": "reijin",
                    "score": 2,
                    "created_utc": 1653766127.0,
                    "response": "Grade A shit post. This could be done already with or without a CBDC. This is just fear mongering.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaciv9j",
                    "author": "SelahBare",
                    "score": 2,
                    "created_utc": 1653767403.0,
                    "response": "This photo is dumb",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaaruox",
                    "author": "thondera",
                    "score": 2,
                    "created_utc": 1653734144.0,
                    "response": "it's missing a convenient \"DELETE ALL\" button.\n\nBecause they already know",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iabtxjm",
                    "author": "Motionslickness08",
                    "score": 3,
                    "created_utc": 1653755543.0,
                    "response": "Man you guys act as if this wouldn’t solve some fucking problems. If you think this meme is funny that means your cool with hate speech, you know that right?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iacb6hs",
                            "author": "BashCo",
                            "score": 3,
                            "created_utc": 1653763746.0,
                            "response": "It's so crazy to watch redditors shift from liberty-centric toward authoritarian fascists over the years.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iac9eeg",
                            "author": "Blackwiz3rd",
                            "score": 2,
                            "created_utc": 1653762881.0,
                            "response": "Hate speech is anything you don’t like ?",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iac32gr",
                            "author": "LayPessimist",
                            "score": 0,
                            "created_utc": 1653759824.0,
                            "response": "What is \"hate speech\" anyway? And who decides what is and is not?\n\nLol.\n\nFuck the whole \"hate speech\" thing. I have freedom of speech.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iac8b1r",
                    "author": "jsaaiman",
                    "score": 2,
                    "created_utc": 1653762345.0,
                    "response": "Lol this is the made up reality the right fears that will literally never happen",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iacqxs8",
                            "author": "New_Dawn",
                            "score": 2,
                            "created_utc": 1653771275.0,
                            "response": "It's a legitimate fear for conservatives. GoFundMe cut off donations based on partisan politics. Go ahead and scoff and dismiss concerns of your political opponents. We'll see you at the polls.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iaav46b",
                    "author": "NevadaLancaster",
                    "score": 2,
                    "created_utc": 1653736786.0,
                    "response": "Evertime I give away my free award it's like 3 mins or less before I regret it. I am once again asking someone else to award this post.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaar518",
                    "author": "ertwister",
                    "score": -2,
                    "created_utc": 1653733539.0,
                    "response": "we will end up like China",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iabaj07",
                    "author": "LuckyRyder",
                    "score": 0,
                    "created_utc": 1653746254.0,
                    "response": "This is coming",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iab3fq3",
                    "author": "escape1979uk",
                    "score": 0,
                    "created_utc": 1653742287.0,
                    "response": "Yeah it appears as a joke, but just watch when you can't buy booze or cigarettes because your health insurance doesn't cover it \n\nOr when you're on welfare/benefits and can only buy the cheapest food or the cheapest diapers\n\nOr your card is declined for holidays / fuel because you have breached your carbon footprint for the year\n\nOr your donation to charity is declined because the sitting government has unilaterally decided they aren't worthy of your money because they don't fund causes they agree with \n\n&#x200B;\n\nAll jokes until it's reality. And it will be reality.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iabfe0o",
                            "author": "Mrpoopybutwhole2",
                            "score": 6,
                            "created_utc": 1653748692.0,
                            "response": "Yes that's how most misinformation works, it uses humor and repetition to make people paranoid and speculate over things that are not even close to reality. This post is a great example of that",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iabl01i",
                                    "author": "escape1979uk",
                                    "score": 0,
                                    "created_utc": 1653751361.0,
                                    "response": ">misinformation\n\nMate I'm in the UK. This shit is becoming reality faster than people are comfortable acknowledging.\n\nI'm no tinfoil hatter. I'm literally just joining some very visible dots.\n\nThe post might be hyperbolic, but the sentiment is very real  \n\n\nFYI - point 3 and 4 have already happened.   \nThere is a Credit Card that limits your spending based on carbon output and donators to the Truckers in Canada had their bank accounts frozen and access to the banking system removed.   \n\n\nYou can see these as outlying incidents, but I'm more inclined to see them as beta tests.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "iabc1y1",
                            "author": "FreshShart-1",
                            "score": 9,
                            "created_utc": 1653747044.0,
                            "response": "\"and it will be reality\" Objection, speculation.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iabdzec",
                                    "author": "LouRG3",
                                    "score": 3,
                                    "created_utc": 1653748006.0,
                                    "response": "This guy should be writing dystopian fanfiction...",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iabexk3",
                                            "author": "escape1979uk",
                                            "score": 0,
                                            "created_utc": 1653748466.0,
                                            "response": "The UK is already making a CBDC. The ONLY reason to create one is for surveillance and control\n\nIf you're interested we are also implementing:\n\n* Mandatory voter ID to supress non conservative voting\n* Electoral commission now under Tory control (previously non partisan)\n* Immigrants being off shored to Rwanda which has an abominable human rights record\n* Peaceful protesting made illegal when the Home office deem it to be \"disruptive\" (read: anything that the current government doesn't agree with)\n\n&#x200B;\n\nThis shit is already well under way. Dystopian fan fiction is fast becoming reality.\n\nAs soon as I have enough BTC I'm fucking off to Madeira..",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "iabm02n",
                            "author": "3DprintRC",
                            "score": 0,
                            "created_utc": 1653751828.0,
                            "response": "No.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iabmfs8",
                                    "author": "escape1979uk",
                                    "score": 1,
                                    "created_utc": 1653752034.0,
                                    "response": "Well, yes. \n\nBut it isn't my job to convince you otherwise.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iabefh3",
                    "author": "michaelb1",
                    "score": 1,
                    "created_utc": 1653748223.0,
                    "response": "Wait, so people think CBDC will delete the first amendment?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaccfhd",
                            "author": "LayPessimist",
                            "score": 1,
                            "created_utc": 1653764358.0,
                            "response": "Wait, you don't?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iad44th",
                                    "author": "michaelb1",
                                    "score": 1,
                                    "created_utc": 1653777532.0,
                                    "response": "Lol no I don’t think so. In OP’s scenario here the bank can close your account and give you your funds but they can’t steal your money because you said something they disagree with online. To tbink that is absolutely ridiculous. Get a grip people. \n\nI’m not here to debate. I just wish people would read books instead of inventing frightful scenarios online.\n\nBitcoin is inevitable. You don’t have to use scare tactics to sell it.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iab1g4c",
                    "author": "jonesocnosis",
                    "score": 0,
                    "created_utc": 1653741096.0,
                    "response": "Ah yes, the future.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iab83kf",
                            "author": "eudezet",
                            "score": -2,
                            "created_utc": 1653744943.0,
                            "response": "Unless you support trucker protest in Canada. Then it’s the present.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iaba574",
                                    "author": "jonesocnosis",
                                    "score": 0,
                                    "created_utc": 1653746052.0,
                                    "response": "For Canadians, the screen will say \"please move at least 100 km from the Ottawa protest to reactivate your money.\"",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iabptm7",
                    "author": "Type_9",
                    "score": -1,
                    "created_utc": 1653753615.0,
                    "response": "I'm sorry but if you cant refrain from posting hate speech, I have no sympathy for you.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iac3wcw",
                            "author": "So-Cal-Mountain-Man",
                            "score": 1,
                            "created_utc": 1653760219.0,
                            "response": "Where it is clear and blatant of course, but some other instances are not so clear. I am a US Navy Veteran, I worked in the online Vet anti-suicide movement for years and still have a ton of online Vet friends. So, if one were to just read comments, and DMs you could surmise I hate Vets, a Federally protected class btw, because I bash on every service including the Navy, say things like fuck off fucker, which in Vet speak means I love you brother. So, I would argue while using some slurs and referencing some racial and ethnic tropes it is pretty clear, others not so much.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iad9h4j",
                                    "author": "Type_9",
                                    "score": 0,
                                    "created_utc": 1653780251.0,
                                    "response": "Yeah like I said, hate speech. \n\nDon't know when saying the f word became hate speech",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "iacr8gj",
                            "author": "New_Dawn",
                            "score": 1,
                            "created_utc": 1653771414.0,
                            "response": "Who decides what's hate speech? You? Kiss our collective ass.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iad93ig",
                                    "author": "Type_9",
                                    "score": 1,
                                    "created_utc": 1653780056.0,
                                    "response": "I mean the fact you immediately jump to defence of hate speech is a little telling my guy",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iac0obj",
                    "author": "tmassofficial",
                    "score": 1,
                    "created_utc": 1653758683.0,
                    "response": "paypal closed accounts of right right people. \n\nthis isn't that farfetched",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iac0va9",
                    "author": "CryptographerNo927",
                    "score": 1,
                    "created_utc": 1653758775.0,
                    "response": "Jesus christ, is \"Use crypto so you can be as racist as you want!\" really the slogan we want to pursue?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iac4zjz",
                            "author": "LayPessimist",
                            "score": 1,
                            "created_utc": 1653760743.0,
                            "response": "More like \"use Bitcoin if you want to be able to have free speech\" apparently. Something we used to have before everything became \"hate speech\", whatever the fuck that means.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iac6qnu",
                                    "author": "CryptographerNo927",
                                    "score": 2,
                                    "created_utc": 1653761589.0,
                                    "response": "Free speech has never meant freedom from consequences it means freedom from the government. If banks want to police your speech thats their prerogative as a private institution.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iacpw3a",
                    "author": "lunar2solar",
                    "score": 1,
                    "created_utc": 1653770762.0,
                    "response": "This is not that far from reality. The empire will punish you financially for exposing their warmongering and pillaging overseas. Immunity from financial punishment is going to become critical.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iacrrzl",
                    "author": "LambdaArtemis",
                    "score": 1,
                    "created_utc": 1653771665.0,
                    "response": "You people are so fucking insane lmao",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iacrzum",
                    "author": "FDisk80",
                    "score": 1,
                    "created_utc": 1653771768.0,
                    "response": "This is already a thing, there are retailers that will ban your ass for ever purchasing at their retail shops if you piss them off enough on social media.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iacsq18",
                    "author": "DeePrDady",
                    "score": 1,
                    "created_utc": 1653772129.0,
                    "response": "Oh for Christ sake 😂 your tweets? Touch grass",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iad5k8f",
                    "author": "Salt-Truck-7882",
                    "score": 1,
                    "created_utc": 1653778244.0,
                    "response": "This sub is getting cringe.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iab8jmb",
                    "author": "berserker-ganger",
                    "score": 0,
                    "created_utc": 1653745188.0,
                    "response": "Cash is king",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iabftxl",
                    "author": "ZooMcGoo",
                    "score": 0,
                    "created_utc": 1653748909.0,
                    "response": "They could already do this with credit cards, so this is kind of silly.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iabu1ol",
                    "author": "SuppiluliumaKush",
                    "score": 0,
                    "created_utc": 1653755597.0,
                    "response": "Not many things would cause me to outright revolt but this would be one of them. If society ever got like this then I can't say what I'd do because I'd get banned from reddit.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iac5n2j",
                    "author": "Fine_Slip_8662",
                    "score": 0,
                    "created_utc": 1653761054.0,
                    "response": "Unironicly where we're going",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iacpef8",
                    "author": "DI0nysOO2",
                    "score": 0,
                    "created_utc": 1653770525.0,
                    "response": "Is this real? Like how can a bank link the card to a Twitter account?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iadu683",
                            "author": "wavrunrx",
                            "score": 1,
                            "created_utc": 1653791685.0,
                            "response": "basically, you're dumb",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iab2vur",
                    "author": "kwaker88",
                    "score": -1,
                    "created_utc": 1653741967.0,
                    "response": "I feel like they will be more subtle.\n\n\"Transactions have been frozen due to a violation of government mandates.\"",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaba17j",
                    "author": "Kooky_Organization30",
                    "score": -1,
                    "created_utc": 1653745992.0,
                    "response": "This looks photoshopped.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iabej7b",
                            "author": "QuikFalcon",
                            "score": 1,
                            "created_utc": 1653748274.0,
                            "response": "It's clearly satire.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iabfbsc",
                                    "author": "Kooky_Organization30",
                                    "score": 3,
                                    "created_utc": 1653748662.0,
                                    "response": "Other people commenting don’t seem to realize…",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "iac38s7",
                                    "author": "LayPessimist",
                                    "score": 0,
                                    "created_utc": 1653759907.0,
                                    "response": "Except for Canadians.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iac6ql9",
                                            "author": "QuikFalcon",
                                            "score": 2,
                                            "created_utc": 1653761588.0,
                                            "response": "Except, there’s a difference between jamming up a highway and being blocked cause of a Twitter post. I get where it’s going and I get the idea, but this scenario in this post IS satire. I’m sorry facts bother you people.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "iabfh0r",
                            "author": "Mrpoopybutwhole2",
                            "score": -1,
                            "created_utc": 1653748733.0,
                            "response": "Bro..",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iabg83h",
                                    "author": "Kooky_Organization30",
                                    "score": 5,
                                    "created_utc": 1653749099.0,
                                    "response": "Being nice. It’s obviously photoshopped. There are those in this subreddit who are dumb enough to believe this and I don’t want to outright call them dumb so I just say, “looks photoshopped.”",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iac3i5k",
                                            "author": "LayPessimist",
                                            "score": 0,
                                            "created_utc": 1653760032.0,
                                            "response": "Obviously. But the point is that this can happen anywhere. And it did in fact already happen in Canada.\n\nI would say you're dumb if you deny that. But I don't want to outright call them dumb so I'll just say they're ignorant.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iac4hvm",
                                                    "author": "Kooky_Organization30",
                                                    "score": 1,
                                                    "created_utc": 1653760508.0,
                                                    "response": "I got the point they were making. I made my post for the people who thought this was real as I saw a few comments asking.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iac7opk",
                    "author": "Cartographer0108",
                    "score": -1,
                    "created_utc": 1653762046.0,
                    "response": "So….go with Bitcoin so you can freely use hate speech?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iacrii9",
                            "author": "New_Dawn",
                            "score": 2,
                            "created_utc": 1653771542.0,
                            "response": "Who decides what's hate speech? You? Kiss our collective ass.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iac8809",
                    "author": "kihoti",
                    "score": -1,
                    "created_utc": 1653762304.0,
                    "response": "OP needs Bitcoin so he can keep being racist",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iabnuiz",
                    "author": "jcrsouza",
                    "score": 1,
                    "created_utc": 1653752692.0,
                    "response": "Did u sell btc at 60k for fiat? If yes you don't trust BTC..",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iabuie2",
                    "author": "kotumnik",
                    "score": 1,
                    "created_utc": 1653755814.0,
                    "response": "Though I'm not good at math but will choose this which is backed by math.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iabyhs9",
                    "author": "ankaa1118",
                    "score": 1,
                    "created_utc": 1653757660.0,
                    "response": "Money is really just a universal belief in something.\n\nBitcoin has built some universal belief in a short history. It’s still early for Bitcoin.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iacf2de",
                    "author": "stupidcookface",
                    "score": 1,
                    "created_utc": 1653765602.0,
                    "response": "This made me so furious at first...then I saw the sub it was posted in.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iacfy0m",
                    "author": "christ_lamber",
                    "score": 1,
                    "created_utc": 1653766008.0,
                    "response": "Illo  mercadona !!!!!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iachma2",
                    "author": "chelminers",
                    "score": 1,
                    "created_utc": 1653766790.0,
                    "response": "Both are needed, digital currency is investment, legal currency is life needs",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iacijr3",
                    "author": "gorilla--",
                    "score": 1,
                    "created_utc": 1653767246.0,
                    "response": "🙄 hyperbole is not going to get us anywhere",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iad1szr",
                    "author": "Crypto_bro999",
                    "score": 1,
                    "created_utc": 1653776393.0,
                    "response": "Why the hell someone will use CBDC? You all can just use usdt that is way better and more popular than this sh\\*t.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iad20uk",
                    "author": "Linkaiser",
                    "score": 1,
                    "created_utc": 1653776497.0,
                    "response": "I feel conflicted on what to say about this because while I understand what is the message... I am someone who does think online interactions should come with a consequence just like offline interactions.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iad6pkj",
                    "author": "Moris_BY",
                    "score": 1,
                    "created_utc": 1653778820.0,
                    "response": "People should have never stopped using cash, everyone loves flaunting there card out of convenience. People have become lazy and technology has taken over.\n\nPeople need to wake up. Not every new tech needs to be embraced!!!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iad8psp",
                    "author": "uncontrollableop",
                    "score": 1,
                    "created_utc": 1653779862.0,
                    "response": "don't worry, they have prisons too. and cbdcs will certainly be used to  imprison people.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iadgep5",
                    "author": "SpaceYowie",
                    "score": 1,
                    "created_utc": 1653783967.0,
                    "response": "Bitcoin would definitely be banned in this world.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iadij6b",
                    "author": "Lagavulin",
                    "score": 1,
                    "created_utc": 1653785143.0,
                    "response": "“M’am do you know how fast you were going? Here is your ticket and the $690 fine has been deducted from your account. If you wish to contest this ticket you may schedule a court date 4 months from now…”",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iadkjt2",
                    "author": "civandciva",
                    "score": 1,
                    "created_utc": 1653786261.0,
                    "response": "That's a lot. I thought this number was lower tbh . XD .",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iadot1y",
                    "author": "KabouyaY",
                    "score": 1,
                    "created_utc": 1653788628.0,
                    "response": "Ignore their URGING, use cash and cards frequently!\n\nHumans are not born to be tracked all the time! Remove unnecessary Apps from your phone!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iadp4kp",
                    "author": "pineapplejames",
                    "score": 1,
                    "created_utc": 1653788808.0,
                    "response": "ELI5: cbdc",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iadpvgm",
                    "author": "VarCrusador",
                    "score": 1,
                    "created_utc": 1653789230.0,
                    "response": "A lot of people joking that this won't happen seem to forget that it already has... first of all china, second of all gofundme freezing funds they politically disagree with and not giving the money back and such",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iadqtmy",
                    "author": "mouthwashabuser",
                    "score": 1,
                    "created_utc": 1653789771.0,
                    "response": "Wait is this real? What is CBDC?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iadu0wl",
                            "author": "wavrunrx",
                            "score": 1,
                            "created_utc": 1653791599.0,
                            "response": "its fake; whats your IQ ?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iadwd48",
                                    "author": "mouthwashabuser",
                                    "score": 1,
                                    "created_utc": 1653792957.0,
                                    "response": "Figured as much but it's 2022 can't ever know for sure. You still could've told me what the fuck CBDC is twat.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iadyx0n",
                                            "author": "wavrunrx",
                                            "score": 1,
                                            "created_utc": 1653794481.0,
                                            "response": "> CBDC\n\ncheck it out douche;\nhttps://www.investopedia.com/terms/c/central-bank-digital-currency-cbdc.asp",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iads0b3",
                    "author": "Rossmacca1",
                    "score": 1,
                    "created_utc": 1653790449.0,
                    "response": "Fiat is a system built on trust, while Bitcoin is a trustless system.\n\n With fiat, you have to believe in the financial system authenticity, but with Bitcoin everyone verifies everything.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iadt8fj",
                    "author": "Whoopsy101",
                    "score": 1,
                    "created_utc": 1653791147.0,
                    "response": "Welcome to China, please enjoy your stay",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iadtza0",
                            "author": "wavrunrx",
                            "score": 1,
                            "created_utc": 1653791574.0,
                            "response": "this is fake bro",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iadxgzm",
                    "author": "ride22",
                    "score": 1,
                    "created_utc": 1653793610.0,
                    "response": "I remember talking about this as a possibility years ago ( about 15 years ago) and being called a conspiracy theorists.   \n\nGood times",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iadxj7w",
                    "author": "Mroder1",
                    "score": 1,
                    "created_utc": 1653793649.0,
                    "response": "This isn’t a flex for Bitcoin, if you’re spewing hate speech then fuck you",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iadztd3",
                    "author": "Samu_Raimi",
                    "score": 1,
                    "created_utc": 1653795039.0,
                    "response": "To bypass this tap the español button.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iae0lwe",
                    "author": "Tottenham2665",
                    "score": 1,
                    "created_utc": 1653795543.0,
                    "response": "But unfortunately crypto is worth nothing according to the ecb president.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iabc0bn",
                    "author": "dag1979",
                    "score": -1,
                    "created_utc": 1653747021.0,
                    "response": "If UBI is ever implemented, you can bet it will be via CBDC and have restrictions. Probably not let you spend it on vices like drugs, alcohol, tobacco, gambling and anything else the current government finds “distasteful”.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iabch28",
                    "author": "57501015203025375030",
                    "score": -5,
                    "created_utc": 1653747261.0,
                    "response": "Is this real?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iabxo7k",
                            "author": "ilikedatsyuk",
                            "score": 2,
                            "created_utc": 1653757278.0,
                            "response": "No",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iac3b0e",
                                    "author": "LayPessimist",
                                    "score": 0,
                                    "created_utc": 1653759937.0,
                                    "response": "But it will be in a few years",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iac3ski",
                                            "author": "ilikedatsyuk",
                                            "score": 2,
                                            "created_utc": 1653760170.0,
                                            "response": "It won’t be.  Bitcoin has many advantages as it is.  We don’t need to invent made up fantasies to sell the concept.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iabc3eb",
                    "author": "WISETUCK",
                    "score": -2,
                    "created_utc": 1653747066.0,
                    "response": "veritably? further so than any different governance- published currency? Central bank digital currencies are coursing to exist programmable which means the middle rule will command when you can drop, and what you can spend.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iabesdf",
                    "author": "Classic_Cheek_161",
                    "score": -2,
                    "created_utc": 1653748396.0,
                    "response": "So many sheep are ready to be led to the slaughter. We need to win this war on our personal sovereignty.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iabfmul",
                    "author": "ESMullins",
                    "score": -2,
                    "created_utc": 1653748813.0,
                    "response": "Coming soon to the once wonderful USA",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iabje66",
                    "author": "abesWaves",
                    "score": -2,
                    "created_utc": 1653750616.0,
                    "response": "Don’t give them ideas",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iabdfun",
                    "author": "mrdougan",
                    "score": -1,
                    "created_utc": 1653747740.0,
                    "response": "Weirdly a lot of card machines are down in Germany",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iabsbcq",
                    "author": "sumwhatkiller",
                    "score": -1,
                    "created_utc": 1653754779.0,
                    "response": "Canadian Truckers vibes",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iabsov3",
                    "author": "383879art",
                    "score": -1,
                    "created_utc": 1653754954.0,
                    "response": "That's horrible. They should have bought BTC instead.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iabtc9i",
                    "author": "askme2222",
                    "score": -1,
                    "created_utc": 1653755262.0,
                    "response": "Bitcoin is built to appreciate but fiat depreciates. Bitcoin is the best currency",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iabxx74",
                    "author": "drafterman",
                    "score": -1,
                    "created_utc": 1653757394.0,
                    "response": "Holy shit, what banking institution is this?!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iac47pg",
                            "author": "KiwiMangoBanana",
                            "score": 2,
                            "created_utc": 1653760372.0,
                            "response": "None",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iac8v35",
                                    "author": "drafterman",
                                    "score": 1,
                                    "created_utc": 1653762618.0,
                                    "response": "Sorry, but this is a place for reliable information relevant to BitCoin. Get out of here with your FUD.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iacbs6k",
                                            "author": "KiwiMangoBanana",
                                            "score": 1,
                                            "created_utc": 1653764039.0,
                                            "response": "Huh? I literally just answered your question, as you seem to think that OP photo was real. It is not.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iactlpe",
                    "author": "thebumfromwinkies",
                    "score": -1,
                    "created_utc": 1653772564.0,
                    "response": "So you *want* to tweet hate speech?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iab3sge",
                    "author": "maininshadow",
                    "score": 0,
                    "created_utc": 1653742498.0,
                    "response": "lol as if it's reversible.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iac09sc",
                    "author": "CiphirSol",
                    "score": 0,
                    "created_utc": 1653758491.0,
                    "response": "Flawed system but the obvious fear-monger is obvious.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iac1naw",
                    "author": "Independent-Algae-12",
                    "score": 0,
                    "created_utc": 1653759145.0,
                    "response": "Oh come on, this has to be fake, right?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iac2dtg",
                    "author": "KyleThelegendxxXxx",
                    "score": 0,
                    "created_utc": 1653759497.0,
                    "response": "This even real?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iac42d9",
                    "author": "averyycuriousman",
                    "score": 0,
                    "created_utc": 1653760301.0,
                    "response": "Is this real?? What bank was this??",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaccx57",
                    "author": "SarahLazyCato",
                    "score": 0,
                    "created_utc": 1653764590.0,
                    "response": "How about an apology? Will that do?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iacitvm",
                    "author": "donkeyhunter007",
                    "score": 0,
                    "created_utc": 1653767384.0,
                    "response": "Is this real?????",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iacr646",
                    "author": "DanfromCalgary",
                    "score": 0,
                    "created_utc": 1653771385.0,
                    "response": "I've never understood people's jealous of the victimized. I can tell you that people that are oppressed aren't making posts about it every day  muffin",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iacsbvu",
                    "author": "tylerhbrown",
                    "score": 0,
                    "created_utc": 1653771934.0,
                    "response": "Meh, I’m fine with. Privacy has been an illusion for a long time.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaddo9i",
                    "author": "maxniewold",
                    "score": 0,
                    "created_utc": 1653782494.0,
                    "response": "Is this for real or a satire?",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}