{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uul99u",
            "title": "Bitcoin nodes question.",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uul99u/bitcoin_nodes_question/",
            "author": "supertree",
            "created_utc": 1653132844.0,
            "score": 6,
            "num_comments": 14,
            "subreddit": "Bitcoin",
            "selftext": "This is a question I have been trying to find an answer to but unable to so far. \n\nWhat is to stop the government (or anyone with the capability)from turning on 51% of the nodes tomorrow and then altering the consensus?",
            "stickied": false,
            "comments": [
                {
                    "id": "i9ftwgr",
                    "author": "TheGreatMuffin",
                    "score": 4,
                    "created_utc": 1653133140.0,
                    "response": "Having the majority of nodes doesn't achieve anything (much less in regards to consensus critical things) because bitcoin not a democratic system, and consensus changes don't depend on a particular amount of nodes.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ftwyr",
                    "author": "Block0922",
                    "score": 2,
                    "created_utc": 1653133150.0,
                    "response": "The money it takes to get 51% consensus, plus the power/energy to maintain that new consensus per hour. It's just not cost effective.\n\nAlso the other nodes that didn't join or that got orphaned off could technically fork and continue the true original chain.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9fyfpo",
                            "author": "22-Squealer",
                            "score": 1,
                            "created_utc": 1653136216.0,
                            "response": "There's also the practical issue of getting hold of enough miners to run that much hash rate. I doubt anyone could do that on the quiet, and that's before considering things like chip shortages.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9fu0nm",
                    "author": "DryTechnology5224",
                    "score": 1,
                    "created_utc": 1653133222.0,
                    "response": "They would need 51% of hashpower i think, not nodes.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9fu7fj",
                            "author": "TheGreatMuffin",
                            "score": 1,
                            "created_utc": 1653133359.0,
                            "response": "51% of hashpower can't simply change consensus critical things, not even 80% or 90%, because it's not a democratic system. Miners are not the (only one) authority on the network.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9fuutf",
                                    "author": "magneticman245",
                                    "score": 1,
                                    "created_utc": 1653133825.0,
                                    "response": "Yep, I think the only thing a 51% hashpower attack could achieve would be a double spend. If the majority hashpower tried to mine a chain which broke the protocol rules (e.g. increasing the block reward), those blocks would be rejected by nodes and couldn't propagate through the network.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9fv039",
                                            "author": "TheGreatMuffin",
                                            "score": 1,
                                            "created_utc": 1653133930.0,
                                            "response": "Yep, correct (small addition though: 51% if hashpower can also censor transactions, not only doublespend their own transactions)",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9fv9fz",
                                                    "author": "magneticman245",
                                                    "score": 1,
                                                    "created_utc": 1653134111.0,
                                                    "response": "Ah of course, I forgot about that. Luckily censoring transactions isn't a huge problem, because it would require the bad actor to control 51% of the hashrate indefinitely. Once the honest miners have majority, they will include the censored transactions. \n\nI think this differs to a double spend which only requires you to have 51% hashrate for a short time, until the recipient is confident they've received the payment, and then you don't need to mine the false chain anymore.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i9fvd1c",
                                    "author": "DryTechnology5224",
                                    "score": 1,
                                    "created_utc": 1653134181.0,
                                    "response": "But having 51% of hashpower could let you control certain things, couldn't it? Not changing the rules of bitcoin per say but something to do with the actual mining of transactions and blocks.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9fw80x",
                            "author": "Szabadsagharcos",
                            "score": 1,
                            "created_utc": 1653134763.0,
                            "response": "They need both(!). In addition they need the exchanges to follow their longer, but invalid chain.  \nSo basically anyone trying to do this needs 51+% of nodes, 51+% of hash power and big chunk/all of the market participants (exchanges, payment providers) too.  \nAll at once at the very second of the chain split and after.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9fvw7q",
                    "author": "SamWizza",
                    "score": 1,
                    "created_utc": 1653134548.0,
                    "response": "I’m sure there’s a mathematical answer here. BTC’s Total Hash Rate is at ATH and so is difficulty. Someone please deduce the cost of trying to run a 51% attack.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9fyhzh",
                    "author": "sonicode",
                    "score": 1,
                    "created_utc": 1653136257.0,
                    "response": "https://www.youtube.com/watch?v=KUd8ZGgm6Qo",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9fz48m",
                    "author": "Glugstar",
                    "score": 1,
                    "created_utc": 1653136643.0,
                    "response": "You can't alter other people's protocol rules, you can only alter your own.\n\nEven if they had 99.99% of nodes under their control, the other 00.01% can still freely decide to ignore them entirely.\n\nAssuming that there is substantial hashing power that also supports the new nodes, they still can't force anything. At most, they end up in a hard fork situation, two coins with two different rules. Next it's up to the market to choose the price for each, according to their utility for the buyer.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uul8o3",
            "title": "Regulation: two birds, one stone. My dark maximalism.",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uul8o3/regulation_two_birds_one_stone_my_dark_maximalism/",
            "author": "Mallardshead",
            "created_utc": 1653132776.0,
            "score": 371,
            "num_comments": 175,
            "subreddit": "Bitcoin",
            "selftext": "Regulation is coming for altcoins. Most of the 17,000 will disappear. This is the s-curve adoption shakeout we as bitcoiners have been warning about for years. SEC Chair Gary Gensler met with the FTC on Wednesday, and again reiterated that bitcoin is NOT a security, but that \"*Many, I'd say most of the others are securities*.\" \n\n[https://twitter.com/hodlerforlife/status/1527705100059258880?s=20&t=BVRnn-2FkOVJ37GwM7CtAw](https://twitter.com/hodlerforlife/status/1527705100059258880?s=20&t=BVRnn-2FkOVJ37GwM7CtAw)\n\nSome folks have suggested that getting designated a security won't affect their coin or protocol. They are terribly mistaken. This designation means you have to follow the established legal framework for securities:\n\n* You can't transfer a security to someone that is not registered to receive securities. If you do, in order to redeem it they must register. Otherwise you can transfer them freely as they are a property, but only to persons or institutions registered. International sales have their own sets of rules.\n* You cannot issue coins or tokens. This requires form S-3. \n* Insiders/Devs/DAO's cannot sell their securities without a form S-4. More importantly, they can no longer trade on material action before the public knows, which is an enormous problem currently, especially amongst exchanges. This is a crime if you are trading securities.\n\nAnd so on. There is no effort to rewrite American securities laws to accommodate the unique properties of crypto, which instead will meet the burden by complying with the rigor and legal framework everything else does.\n\nhttps://preview.redd.it/jvu60wzyct091.jpg?width=1074&format=pjpg&auto=webp&s=1e38929d5113fe526747b1a7c054527a3c402d0f\n\nThe coins-tokens-protocols that get designated securities don't have to comply of course. If they don't want to change their protocol, register their brass, and create a hierarchical chain of command for reporting, then:\n\n* They'll be delisted by every centralized exchange within 90 days\n* All their wallets/apps will be deleted from Apple and Google Play\n* No taxpaying company will accept them as payment\n* Promoting the ticker or coin in any way will be a crime\n* All major stablecoins will cease to operate within their protocols--and this might be the most insurmountable obstacle, because 85% of ALL altcoin volume is from stablecoins. That means nothing inside an alt protocol has established itself as money--except for stablecoins\n\n&#x200B;\n\n[Web3](https://preview.redd.it/36jdgpibdt091.jpg?width=1125&format=pjpg&auto=webp&s=3b3b04861391c022dd8c7af932637cbdd4d7d8ea)\n\nIf these projects were decentralized and impairment resistant to begin with, none of this would be happening. They just couldn't avoid those pre-mines for money though. Their founders loved the spotlight too. If they at least had fixed issuance, they could mitigate some of their problems. But besides BTC, few projects come to mind that can circumvent all these travails; the leading privacy coin certainly can; but even the coin beginning with *Lite* and the one represented by a dog symbol could be in danger of getting this black securities label. If delisted, the only real way to acquire these zombified things would be to take something that isn't a security (like BTC), transfer it to a DEX, then swap into it. Point is, getting designated a security is effectively a date with gravity from the 50th floor, because you are now in the sandbox with the same rules real public companies, real bonds, and real products must adhere to. Can your vaporware compete? Because if you're not money, what are you exactly? Nothing. You're an orgy of swaps, wraps, burns, mints, and stakes run by centralized dapps that do nothing but optimize token interactions to keep the orgy going. Here's a better way to say this: If your dapp is a centralized registered security with full KYC, why does it need a blockchain exactly? To shill its speculative token. There's no real business or service there. \n\nExchanges don't have profitable business models without a robust (expletive)coin market. Bitcoin isn't something they can control and the open source tech around it is a race to zero. Add in the fact that BTC has established itself as money, and you'll see a nascent circular economy already growing around BTC. When it gets big enough (goods services sold in BTC), then exchanges are really no longer necessary. So maybe they'll spin-off the bitcoin business, miners might acquire them, exchanges might consolidate, who knows. I do know the days of easy money are gone. \n\n&#x200B;\n\nhttps://preview.redd.it/ycsy7yblct091.jpg?width=1884&format=pjpg&auto=webp&s=6a30d46068016095e2677e693d4243158fd43a88\n\nI think Gary Gensler is a bit naive on what these security designations will do to these protocols that heretofore have been hiding behind the word *decentralization* and acting like they're going to do something of value someday. He also doesn't understand fully what impact it will have on exchanges either. Bitcoiners are smiling of course, because two birds are getting hit with one stone. Centralized bitcoin-only exchanges (and apps) like Block's CashApp, Strike, Swan, etcetera won't be burdened with any of this extra paperwork, insurance costs, lawsuits, lawyers, or blockchain forensic add-ons. \n\nMy dark maximalism really starts sweating through my shirt thinking about the bloody mess of red ink  we'll be mopping up though.\n\n&#x200B;\n\nhttps://preview.redd.it/bqs5urelet091.jpg?width=311&format=pjpg&auto=webp&s=669278e4ef4aaaf8d40995792a3cf227efa66d14",
            "stickied": false,
            "comments": [
                {
                    "id": "i9fuc7c",
                    "author": "jackrabid40",
                    "score": 93,
                    "created_utc": 1653133452.0,
                    "response": "Thanks for the effort that you put into this.  I will have to read several times to digest it",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9g84v4",
                            "author": "Lazy_Reflection_590",
                            "score": 11,
                            "created_utc": 1653141642.0,
                            "response": "I second the motion. 😅",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9gtfsz",
                                    "author": "DrewBrew95",
                                    "score": 6,
                                    "created_utc": 1653151547.0,
                                    "response": "I third this motion",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9hjgz6",
                                            "author": "SknkMnky",
                                            "score": 3,
                                            "created_utc": 1653163896.0,
                                            "response": "Bowl motion",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9htww4",
                                                    "author": "abethesecond",
                                                    "score": 2,
                                                    "created_utc": 1653169163.0,
                                                    "response": "Bowel*",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9iffxc",
                                                            "author": "40KMack",
                                                            "score": 2,
                                                            "created_utc": 1653180650.0,
                                                            "response": "I came for Bitcoin news but I left wanting a bowl cereal 🥣",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9ibu11",
                            "author": "Walmart_Warrior_420",
                            "score": -1,
                            "created_utc": 1653178681.0,
                            "response": "My wife's boyfriend is coming over soon and he's good at reading    ( ͡° ͜ʖ ͡°)",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9gqi65",
                    "author": "PoorerChoices",
                    "score": 9,
                    "created_utc": 1653150200.0,
                    "response": "Brilliant, thank you.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9gz5hs",
                    "author": "GJDMIULC",
                    "score": 7,
                    "created_utc": 1653154133.0,
                    "response": "* You can't transfer a security to someone that is not registered to receive securities. If you do, in order to redeem it they must register. Otherwise you can transfer them freely as they are a property, but only to persons or institutions registered. International sales have their own sets of rules.\n\n* You cannot issue coins or tokens. This requires form S-3.\n\n* Insiders/Devs/DAO's cannot sell their securities without a form S-4. More importantly, they can no longer trade on material action before the public knows, which is an enormous problem currently, especially amongst exchanges. This is a crime if you are trading securities.\n\nGo easy on me. Aren’t all three of the above inherently good? No more rugpulls, insider trading, ponzis? And existing legitimate altcoins can spend the legal fees needed to comply with securities laws and file the required S-1s, S-3s, etc?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9h2aix",
                            "author": "Mallardshead",
                            "score": 7,
                            "created_utc": 1653155575.0,
                            "response": "This might be good for something like OpenSea yes. It's deadly for everything else though because as a security, shareholders/tokenholders have legal ownership. The easy money that DAO's, devs, and VC's are accustomed to goes away. Oversight is amplified. The space is going to lose quite a bit of talent which goes to where the money is, which I believe will be the applications and real businesses built over the LN. Then there's the issue that the facade of *decentralization* is gone. Blockchain technology really has zero value without this. They are slow, expensive, and difficult to maintain things. Centralization makes things hyper fast, cheap, and efficient.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9hafpg",
                                    "author": "GJDMIULC",
                                    "score": 3,
                                    "created_utc": 1653159468.0,
                                    "response": "I don’t disagree. But couldn’t we argue that reporting obligations, oversight, general legal legitimacy, and US govt recognition would actually lead to greater inflow of capital and labor?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9j7t4l",
                                            "author": "maxcoiner",
                                            "score": 1,
                                            "created_utc": 1653197729.0,
                                            "response": "The way I see it is there are roughly 20,000 shitcoins out there and maybe 10 of them are sophisticated enough to fill out the forms and make their securities legalized when the hammer falls.\n\nIf that's the case, those 10 will get a metric ton of VC capital inflow because it's sure as hell leaving from those 19,990 other crapcoins. (Of course if VCs were smart they'd send it to bitcoin's ecosystem. Don't hold your breath.)",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9gq3wq",
                    "author": "deepoak40965",
                    "score": 55,
                    "created_utc": 1653150022.0,
                    "response": "Great post, shitcoins should get wrecked.  I started out with a mixed bag of everything (5-6) top ten tokens.  The more I read, researched and learned, I consolidated everything into Bitcoin as my knowledge progressed over 3-4 months. \n\nBitcoin is the way.  It is the digital gold standard, the native currency of the internet.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9gs1ta",
                            "author": "Mallardshead",
                            "score": 23,
                            "created_utc": 1653150916.0,
                            "response": "Pretty impressive at 3 months though. Shit takes most people years. Was there a sudden moment it clicked, or a mosaic of knowledge?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9gv0kl",
                                    "author": "deepoak40965",
                                    "score": 32,
                                    "created_utc": 1653152269.0,
                                    "response": "It was a mosaic, that took time and then finally all clicked when I truly grasped the concept of POW vs. POS.  Once I could see that all other coins are subject to a single leader, board or group of influential holders etc, and understood that bitcoin is a truly decentralized international computing network, it was game over. Realizing that the value is really the system and network by virtue of how it was originally and uniquely structured.  \n\nLove being a part of this movement.  We are all going to be on the right side of history.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9gvjn7",
                                            "author": "Mallardshead",
                                            "score": 10,
                                            "created_utc": 1653152503.0,
                                            "response": "# 💯",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9hb2hc",
                                    "author": "LordPrettyMax",
                                    "score": 7,
                                    "created_utc": 1653159769.0,
                                    "response": "I’ve been binging trader university on YouTube and am toxic Bitcoin maxi in 3 months too. Although I must say, I’m not too happy about this cause I do want to make some money from shitcoins",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9hc29m",
                                            "author": "Mallardshead",
                                            "score": 3,
                                            "created_utc": 1653160248.0,
                                            "response": "Mathew Kratter is toxic AF. He def watched The Northman recently. Dark maximalism is the subtext with his content. I wonder what set him off. He was once a sweet man that taught trading concepts.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9hyrai",
                                                    "author": "TitForSnack",
                                                    "score": 2,
                                                    "created_utc": 1653171668.0,
                                                    "response": "Anyone who's not toxic hasn't gone deep enough in the rabbit hole",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9hkchq",
                                            "author": "Kahoobbb",
                                            "score": 1,
                                            "created_utc": 1653164334.0,
                                            "response": "You are not a toxic btc maxi if you want to make money from shitcoins. That's just called being a bitcoin maxi.\n\nYou do realize there's a big difference between a toxic bitcoin maxi and a bitcoin maxi right?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9j8baj",
                                                    "author": "maxcoiner",
                                                    "score": 1,
                                                    "created_utc": 1653198119.0,
                                                    "response": "I don't think half of the shitcoiners out there can even separate toxicity from maximalism these days. It's all 'anti-my-investment-so-I-hate-you' to them.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i9i1g4w",
                                    "author": "nagato1125",
                                    "score": 1,
                                    "created_utc": 1653173066.0,
                                    "response": "3 months IS impressive. took me abt 2 years. but also took me to actually learn abt money to truly see the value in btc.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9i4ucv",
                                    "author": "Wombat1886",
                                    "score": 0,
                                    "created_utc": 1653174858.0,
                                    "response": "Read up on Saito. This is not a meme or some shitcoin, but a legitimate new consensus mechanism",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9ifg2s",
                                            "author": "Mallardshead",
                                            "score": 1,
                                            "created_utc": 1653180652.0,
                                            "response": "It's not a scam that's for sure, it's a fraud.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9jgjhg",
                                                    "author": "Wombat1886",
                                                    "score": 1,
                                                    "created_utc": 1653205065.0,
                                                    "response": "we will see. Of course never marry an alt coin and only put a 1-3% in one",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9hcbzv",
                            "author": "Vaginosis-Psychosis",
                            "score": 4,
                            "created_utc": 1653160382.0,
                            "response": "It took me 6 months.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9hgmzv",
                                    "author": "Miserable-Narwhal-84",
                                    "score": 2,
                                    "created_utc": 1653162495.0,
                                    "response": "Same here",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9igoey",
                            "author": "Steven81",
                            "score": 3,
                            "created_utc": 1653181316.0,
                            "response": "You do realize that like 90% of the Bitcoin volume comes from stablecoins. A stable coin holocaust implies as much as 90% of loss of value for Bitcoin.\n\nBitcoin is part of a greater ecosystem, which may or may not be purged. Bitcoin was at $1k when said ecosystem started being developed. What makes y'all think that Bitcoin won't go back to how it was when it was mostly or only its enthusiasts kind of thing?\n\nI don't think that a vindictive kind of regulation, mostly centered around trying to protect the value of the US dollar would be as much a cause for celebration for Bitcoin holders. Yeah, it will be spared from the \"crypto-apocalypse\", however it may well be capped in equal manner. As in, completely fail to b become the trillion $ asset it needs to be so that to have some worldwide relevance...",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9j8lrg",
                                    "author": "maxcoiner",
                                    "score": 1,
                                    "created_utc": 1653198355.0,
                                    "response": "Long before the hammer falls on shitcoins, the stablecoin sector will have it's cleansing. Two bills are in congress to do exactly that now, in fact.\n\nUSDC and those like it with full 1-to-1 dollar reserves and full transparency aren't going anywhere. If tether goes down that volume will likely just jump over to a full-reserve stablecoin within hours.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9g21fz",
                    "author": "Savik519",
                    "score": 36,
                    "created_utc": 1653138366.0,
                    "response": "I love this hellfire and brimstone Old Testament shit.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9gs4tn",
                    "author": "AOR66",
                    "score": 6,
                    "created_utc": 1653150953.0,
                    "response": "ill give you my upvote",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9gv99t",
                    "author": "GorillaP1mp",
                    "score": 5,
                    "created_utc": 1653152375.0,
                    "response": "They have to provide a utility if they really want to keep utility designation. I can find very little tokens that actually provide a utility",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9g1emq",
                    "author": "wkw3",
                    "score": 12,
                    "created_utc": 1653138009.0,
                    "response": "Agreed. Gensler has been saying as much for quite some time, but people keep whistling past the graveyard, or counting on the practical limitations of enforcement.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9g3n0f",
                    "author": "1entreprenewer",
                    "score": 18,
                    "created_utc": 1653139268.0,
                    "response": "Wow. This is brilliant thinking, and I hadn’t even considered it. I knew all shitcoins would eventually go to 0, I just didn’t realize how quickly.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9gprc8",
                    "author": "alxjnssn",
                    "score": 6,
                    "created_utc": 1653149864.0,
                    "response": "i am fucking throbbing bull after reading that",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9h380i",
                            "author": "cfdeveloper",
                            "score": 10,
                            "created_utc": 1653156005.0,
                            "response": "depending where located, one letter ***A*** in your sentence would really change your intent.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9gqjsx",
                            "author": "Mallardshead",
                            "score": 6,
                            "created_utc": 1653150221.0,
                            "response": "Number go⤴️",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9iu2su",
                            "author": "Phylaras",
                            "score": 1,
                            "created_utc": 1653188618.0,
                            "response": "Why? (I'm being honest here).\n\nRemember, BTC was worth less than $1k before the defi ecosystem took off. BTC will make it, sure, but I think you are underestimating the pain involved here.\n\nI think that only BTC is worth holding right now. I'd just rather a smarter way forward. BTC is massively the king right now. It doesn't have to be the only coin in existence to be worth $$$$. What's so bad about being the leader?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9j965t",
                                    "author": "maxcoiner",
                                    "score": 1,
                                    "created_utc": 1653198806.0,
                                    "response": "Bitcoin is the only DeFi that is decentralized. (And therefore will survive.)\n\nI'd even argue that all the people playing with defi would have been in bitcoin so once defi coins are made illegal they'll simply be forced to come back to Bitcoin. Have you checked out Sovryn? We've already got products just for them.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9gr3my",
                    "author": "Squirrel_Unfair",
                    "score": 3,
                    "created_utc": 1653150477.0,
                    "response": "Great analysis.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9grow9",
                    "author": "NYKNYb",
                    "score": 9,
                    "created_utc": 1653150752.0,
                    "response": "I guess we're gonna see which of those shitcoins are actually useful and decentralised and will therefore survive.\n\nSpoiler: it's none of them.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9grtgs",
                            "author": "Mallardshead",
                            "score": 3,
                            "created_utc": 1653150811.0,
                            "response": "# 💯",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9gwkyw",
                                    "author": "Agent007_x",
                                    "score": 3,
                                    "created_utc": 1653152969.0,
                                    "response": "It seems like all you forget America is just one country … not the whole world …",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9h2hz0",
                                            "author": "Hardinee",
                                            "score": 2,
                                            "created_utc": 1653155671.0,
                                            "response": "And who buys the most crypto?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9h3xx3",
                                                    "author": "Agent007_x",
                                                    "score": 0,
                                                    "created_utc": 1653156335.0,
                                                    "response": "right now the US is .. doesn’t mean that’ll be forever",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9gyfzj",
                                            "author": "Mallardshead",
                                            "score": 4,
                                            "created_utc": 1653153815.0,
                                            "response": "I never said ETH or alts were unusable abroad or even the US, I'm just saying they require stablecoins and robust exchange support to give them value. Bitcoin was born long before exchanges and stablecoins. So when the rest of the world uses these unregistered securities, I'm not certain they'll be worth much. And if they're not worth a whole lot, lose their liquidity, and won't pump, devs leave, DAO's weaken, security erodes, and protocols go zombie. Rat kings take things over. Everyone packs up like gypsies and goes to where the money is. Most recently that's been NFT jpegs. Before that it was DeFi middleware. Before that it was ICO vaporware. You'd assume that next it would be web3 or the meta verse, but when those terms are vaporware themselves... Eventually they all end up developing on the LN because that will be where the money is.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i9j8y64",
                                            "author": "maxcoiner",
                                            "score": 1,
                                            "created_utc": 1653198630.0,
                                            "response": "Normally I'd agree with you here, but US altcoin trading is the bread & butter of most every exchange on the planet, even if americans have to us a VPN to access them.\n\nThey're going to get wiped out, bro. Until now crypto exchanges were extremely profitable and after the hammer falls it'll be like running a wall street exchange with regulations under every paperclip... I don't see many surviving.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i9jfbzr",
                                            "author": "yndkings",
                                            "score": 1,
                                            "created_utc": 1653204011.0,
                                            "response": "….Having extradition agreements with the bulk of the world",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9ggzv4",
                    "author": "recessiontime",
                    "score": 40,
                    "created_utc": 1653145827.0,
                    "response": "This is the ugliest side of bitcoin maximalism. It's fine if you think bitcoin is the best and will win on its own merits, it's another thing to be cheering on government and banking regulations on the competition because it helps your bottom line. I wish you would look at yourself in the mirror and ask yourself whether this is in the spirit of libertarianism or cyberpunk?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9gmtnk",
                            "author": "Remarkable-Hall-9478",
                            "score": 40,
                            "created_utc": 1653148514.0,
                            "response": "Technically, yes it is in the spirit of cypherpunk. The entire point of the cryptography and cloak-and-dagger nature of the “cypher” part is to avoid providing critical information to powerful groups such as govts. The “punk” is explicitly fighting back against those groups. The word pretty much *literally* means “fight the system with cryptography and code”.\n\nThe cryptocurrency space has had a bit of a head start for a while here but has squandered its lead by getting fat, lazy, and greedy. People with no understanding or even remote interest or support for cypherpunk ideology have flooded in en masse because they think buying crypto more than a decade too late is a free ride to lambos and cocaine orgies. \n\nThe average “cryptards” these days can’t contribute even a modicum of development and do not understand the implications or correct context in which to view the technology. The space is dragged down by this whole “mass adoption” bullshit which really just turns into shilling scams to people who have never and never will have a legitimate use case for decentralized currency. The vast majority of the market is either a scam, a speculative trading vehicle, or both as an inverse of “build it and they will come”. Dumb money is here, many years too late btw, trying to make fortunes and so there are a thousand thousand dev teams meeting the demand for vaporware moonshot lottery tickets.\n\nIt’s not “cypherpunk” to just cross your fingers and hope the govt plays nice and lets you do whatever you want and ignore any law on the books because of “magic internet” faerie dust. It’s “cypherpunk” to be constantly engaged with the tension of the cat and mouse game being played.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9gnpoy",
                                    "author": "Mallardshead",
                                    "score": 15,
                                    "created_utc": 1653148920.0,
                                    "response": "🙏💯",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9gknzz",
                            "author": "phdbroscience350",
                            "score": 21,
                            "created_utc": 1653147527.0,
                            "response": "Yeah no, shitcoins remain shitcoins.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9gmq5o",
                            "author": "Natethegreat13",
                            "score": 27,
                            "created_utc": 1653148471.0,
                            "response": "“Crypto” has besmirched the Bitcoin name and I’m sick of it. They are not the same and I’m tired of people acting like they are",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9gse3p",
                            "author": "daOyster",
                            "score": 16,
                            "created_utc": 1653151071.0,
                            "response": "I think the disconnect here between you two is that you consider altcoins as fair competition and not as scams and get rich quick schemes for their founders that the majority of them are. Regulation is good if they help stop people taking advantage of the uninformed to take their money.\n\nIf you had two lemonade stands, one that steals it's ingredients and one that buys them, would you not cheer for regulation to stop the \"competition\" from profiting off of their immorally gained supplies? Or would you say nah to regulations and let the guy who keeps profiting off stolen goods succeed?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9gt5rp",
                                    "author": "recessiontime",
                                    "score": 3,
                                    "created_utc": 1653151419.0,
                                    "response": "The market can sort out the scams from the real deals without the government intervening and picking and choosing winners from losers.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9h1haz",
                                            "author": "Ima_Wreckyou",
                                            "score": 7,
                                            "created_utc": 1653155201.0,
                                            "response": "Not as long as we are not allowed to go after this scamers because the gouvernment has a monopoly on violence.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9j9bfw",
                                                    "author": "maxcoiner",
                                                    "score": 1,
                                                    "created_utc": 1653198926.0,
                                                    "response": "\\^ This right here.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9hg6bv",
                                            "author": "HurricaneHarvey7",
                                            "score": 0,
                                            "created_utc": 1653162262.0,
                                            "response": ">picking and choosing winners from losers\n\nWrong. If a project is a security then they need to abide by security laws.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9hkyg3",
                                                    "author": "deefdaffer",
                                                    "score": 2,
                                                    "created_utc": 1653164633.0,
                                                    "response": "Statist",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i9j41xd",
                                    "author": "AndyZuggle",
                                    "score": 0,
                                    "created_utc": 1653194937.0,
                                    "response": "Scams are fair competition.  We live in a merciless world.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9gqujx",
                            "author": "Ima_Wreckyou",
                            "score": 17,
                            "created_utc": 1653150360.0,
                            "response": "There isn't a Bitcoin Maxi actively pushing for this. We just said for a long time that this is what would happen and that this shitcoins are not decentralized, but mainly just another form of tech stocks (if it isn't an outright scam).\n\nIn stark contrast to that, just a few months back when banning PoW was on the table, we had shitcoiners ACTIVELY PUSHING FOR IT, going to the hearing and reciting energy FUD! Just because they want to get rid of Bitcoin.\n\nSo who is actually toxic here?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9grinj",
                                    "author": "recessiontime",
                                    "score": 6,
                                    "created_utc": 1653150670.0,
                                    "response": ">who is actually toxic here?\n\nAnyone that encourages using the state to gain a monopoly",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9ht7id",
                                            "author": "knut11",
                                            "score": 12,
                                            "created_utc": 1653168795.0,
                                            "response": "Monopoly?\n\nBitcoin is open source permission less code.\nAnyone can participate, and use this technology as they please.\n\nScamming ppl outright, by premining tokens, is just an outright scam.\n\nEven if most of these tokens gets outlawed. Many will countinue to exist.\nAnd new will spring up.\n\nBitcoin made the foundation for unstoppable code.\nThis is a new era in network technology.\n\nToo bad, too many smart ppl failed to realized the true potential, and focused on satisfying their own lust for greed and power..",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9hstsa",
                            "author": "ChrimsonChin988",
                            "score": 7,
                            "created_utc": 1653168598.0,
                            "response": "It absolutely is.\n\nLike OP mentions, if these altcoins were actually decentralized, they wouldn't get labelled as securities. But they are centralized. Which is why they will fail long-term in terms of being a currency. If the government cracks down now on them, they will not grow and no new shitcoins will be created with clueless people handing over their money to premining scammers.\n\nSome people believe and argue altcoins have value - I (and many other maxis) don't share the same sentiment. In my view they're all a distraction and the useful things they do have to offer will eventually be incorporated on the 2nd or 3rd layer of Bitcoin.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9gm3lg",
                            "author": "DesignerAccount",
                            "score": 7,
                            "created_utc": 1653148189.0,
                            "response": "Nonsense. This was ALWAYS the problem with shitcoins. Starry eyed talk about dEcEnTrAlIzAtIoN when there's leading figures behind it all, and how we're gonna stick it to the banks because we're decentralized with ~100 full nodes running, and all other such delusions deserve to get crushed under the weight of reality.\n\nIf you think maximalists are maximalists because we hate the idea of DeFi you're just dumb. And offensive to the people who spent 1000s, literally, of hours understanding Bitcoin. The problem is it cannot happen today, at least not in any significant way that true decentralization would imply. If you don't understand it, it's not my problem.\n\nPeople who put their in shitcoins deserve whatever will come at them. Which is the same shit that would have come to Bitcoin if, for example, we compromised with bIg BlOcKz terrorists. Decentralization is not such just because we wish it to be or because you copy Bitcoin's ideas, it must be fiercely defended and enabled. Not doing it was always going to end in disaster. If anything, it's surprising that the Fed/SEC waited as long as it did.\n\nPlay stupid games, win stupid prizes.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9hqo89",
                            "author": "CowboyTrout",
                            "score": 4,
                            "created_utc": 1653167486.0,
                            "response": "No this is the best side! \nYou clearly missed one of his key points.\n\nIf these projects weren’t a scam or a lie. Governments wouldn’t be able to so crack down on it so easily. \n\nWe have to eliminate these scams from our society. To many people have been and continue to be hurt by swindlers. This has happened before in American history. We are back into those dark time. \n\nYou might want anarchy, unfortunately we don’t have that in the real world. \n\nBitcoin is for everyone not just liberations.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9h5z1h",
                            "author": "Charming-Meringue-68",
                            "score": 2,
                            "created_utc": 1653157304.0,
                            "response": "Being informed and aware is not cheering",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9gt3tp",
                            "author": "Lurked_Emerging",
                            "score": 2,
                            "created_utc": 1653151394.0,
                            "response": "I mean s coins are scams and scams hurt people and governments most people would agree should first punish people that hurt other people in their jurisdiction before any other function.\n\nI'm not a no government type though but I assume they'd be ok with scammers getting payback for taking advantage of people.\n\nS coins will not be missed in 5 years, nevermind 20.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9gozbp",
                            "author": "Cirewess",
                            "score": -14,
                            "created_utc": 1653149501.0,
                            "response": "Guy is a dumbass; nobody is going to be using Bitcoin for everyday payments, sure buy a house with it great, but at the grocery store? No. Moving money across the world? Hell no, slow as hell even on the lightening network, the \"shitcoins\" you keep calling them already are faster and more effective. I love Bitcoin, it's a store of value like gold so please with this crap.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9gq2ri",
                                    "author": "Mallardshead",
                                    "score": 12,
                                    "created_utc": 1653150008.0,
                                    "response": "Lightning Network: speed of light, .0004¢, instant settlement. Try untethering your head from 2019. All those mainstream talking points are well behind us. We're already at the point we have offline payments with LNURL. And have NFC LN debit cards proliferating that can be synced to non-custodial wallets. Try keeping up. When your unregistered securities conspire to remove you of your paper *crypto* value, bitcoin will be waiting. You'll be using it and won't even know.\n\n**Dark Maximalism👤👥**",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9gq7kj",
                                            "author": "Cirewess",
                                            "score": -6,
                                            "created_utc": 1653150067.0,
                                            "response": "Worrd there's a shitcoin faster than that...and less of a fee. You'll be using it with your Bitcoin.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9gvzun",
                                                    "author": "generateduser29128",
                                                    "score": 5,
                                                    "created_utc": 1653152706.0,
                                                    "response": "Any layer 1 blockchain that stores global history is fundamentally not suited for worldwide everyday payments. \n\nLightning with history aggregation is actually a really good solution to the scaling problem. Any shitcoin claiming to scale on the base layer is literally full of shit.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9he41w",
                                                            "author": "_scampy",
                                                            "score": 4,
                                                            "created_utc": 1653161253.0,
                                                            "response": "Indeed. There's a certain fast and feeless alt beloved by r/cc which tried to do exactly this. To the surprise of nobody with a modicum of common sense, it has fallen prey to countless spam attacks and is down +95% from its 2018 ATH.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i9gqxxk",
                                                    "author": "Mallardshead",
                                                    "score": 3,
                                                    "created_utc": 1653150404.0,
                                                    "response": "Oh...so you found something that can move faster than the speed of light? You must be up for the Nobel Prize. And can you also explain how a fee below .0004¢ would make any material difference whatsoever? Would an email hitting your inbox in .00039 seconds instead of .0004 seconds make a difference as well?\n\n**Dark...**",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9grelr",
                                                            "author": "Cirewess",
                                                            "score": -5,
                                                            "created_utc": 1653150618.0,
                                                            "response": "Whoops, now it doesn't matter all of sudden, when something is faster than bitcoin it's doesn't matter but when it's slower it's a \"shitcoin\" lol when you move the big money a fee of .0001 will be a bigger difference from .0004",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9grm43",
                                                                    "author": "Mallardshead",
                                                                    "score": 2,
                                                                    "created_utc": 1653150716.0,
                                                                    "response": "# DARK MAXIMALISM👤👥",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9guwnx",
                                            "author": "unduly-noted",
                                            "score": 0,
                                            "created_utc": 1653152220.0,
                                            "response": "Do you actually think lightening network achieves consensus at the speed of light?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9gwfmx",
                                                    "author": "Mallardshead",
                                                    "score": 2,
                                                    "created_utc": 1653152902.0,
                                                    "response": "I've used the LN at plenty of point-of-service terminals in the real world and it's quite fast. Plenty of work yet to do though. Still too many failed payments that have to get re-tried. More nodes, liquidity, and solutions like Pickhardt Payments will solve this. Still not living in a Taproot world either. Quite young. It's all coming together though. Amazing to see.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i9grpbb",
                                    "author": "StrandedinaDesert",
                                    "score": 3,
                                    "created_utc": 1653150757.0,
                                    "response": "I've never gambled or bought drugs online with anything beside Bitcoin shrugs... Seemed to work perfectly fine to me",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9gq8sc",
                                    "author": "PoorerChoices",
                                    "score": 4,
                                    "created_utc": 1653150082.0,
                                    "response": "Slow as hell on lightening? Bro, you obviously don't use lightening. I do all time with friends to split lunch bill, etc. Fucking instataneous.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9gqg5k",
                                            "author": "Cirewess",
                                            "score": -7,
                                            "created_utc": 1653150175.0,
                                            "response": "Word, there's a faster \"shitcoin\", and less of a fee.\n\nAbout to be 1.1 million transactions per second.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9gx819",
                                                    "author": "generateduser29128",
                                                    "score": 3,
                                                    "created_utc": 1653153264.0,
                                                    "response": "I've built systems that can handle several million transactions per second. The problem is not the throughput or CPU/GPU usage, but storing all the data that gets generated. Dealing with multi-Gbit speeds quickly limits your nodes to large corporations with big datacenters. At that point your blockchain is just a poorly implemented PayPal.\n\nIt's also frankly unnecessary for everyone in the world to know about worldwide Starbucks coffee purchases. Scale locally on layer 2 and settle every once in a while on layer 1... Apply that to Blockchain and you end up with Lightning.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i9grtzj",
                                    "author": "StrandedinaDesert",
                                    "score": 1,
                                    "created_utc": 1653150817.0,
                                    "response": "Uve probably never used Bitcoin ever doubt u even have a wallet",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9gryne",
                                            "author": "Cirewess",
                                            "score": 0,
                                            "created_utc": 1653150877.0,
                                            "response": "Please do tell me when and how you've used it in your day to day life so far",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9hub5s",
                            "author": "InsideCold",
                            "score": 1,
                            "created_utc": 1653169368.0,
                            "response": "The cipherpunk movement is about using technology to protect the privacy, security and freedom of individuals. Shitcoins are not in the spirit of the cipherpunk movement anymore than someone promoting rot13 as a faster, better version of AES. Shitcoin promoters aren’t making the world a fairer, safer place. They’re just taking advantage of peoples’ naivety and greed to enrich themselves.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9hh1kk",
                    "author": "MattLDempsey",
                    "score": 5,
                    "created_utc": 1653162692.0,
                    "response": "Post this in r/cryptocurrency",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9j305d",
                            "author": "Pezzonovante__",
                            "score": 2,
                            "created_utc": 1653194206.0,
                            "response": "That might be an internet bloodbath. Redditors really love their shitcoins.. Frankly, I invest in a few projects that aren’t BTC, but I understand fully that I could lose all of those holdings. People talk about other projects being robust, but look at BTC still doing what it was set out to do.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9gmt93",
                    "author": "MythicMango",
                    "score": 2,
                    "created_utc": 1653148509.0,
                    "response": "How would the SEC go about enforcing regulation on thousands of tokens?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9goo8o",
                            "author": "Mallardshead",
                            "score": 4,
                            "created_utc": 1653149357.0,
                            "response": "By calling an exchange. Then by letting social media platforms know that advertising is illegal. Then by making sure the major dapps and wallets don't support unregistered securities. \n\nMost of the 17,000 are junk that don't need classification. If they ever become relevant they will.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9ho7o8",
                    "author": "CowboyTrout",
                    "score": 2,
                    "created_utc": 1653166255.0,
                    "response": "Wonderful post OP! \n\nAs the saying goes, all roads lead to bitcoin.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9hu7ib",
                    "author": "knut11",
                    "score": 2,
                    "created_utc": 1653169315.0,
                    "response": "17 000 scam WOW!\nIncredible how its grown into this.\n\nThere must be some good projects out there, or nah?\n\nBitcoin truley laid to foundation of a new era of network technomogy.\nAutonomous networks, with no centralized control.\n\nMoney cant be the only application for this. I imagine escrow, insurance and goverments are great applications. But most of this can be build as layer 2 and 3.\n\nThen again, with this technological foundation, no one can really be stopped from creating new premissionless networks.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ip38s",
                    "author": "BeerMonkeee",
                    "score": 2,
                    "created_utc": 1653185847.0,
                    "response": "Clearly needs to be some new rules and sub categories of securities as the legacy rules above won’t work for both the US or Cryptos affected",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9gefhx",
                    "author": "_scampy",
                    "score": 8,
                    "created_utc": 1653144645.0,
                    "response": "Based toxic maxi duck. Inject the hopium directly into my veins.\n\nHere's a question: If your thesis plays out, what happens with all the tokens that exchanges have locked up in staking contracts? You know the shitcoin I'm talking about.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ggvmc",
                    "author": "Scrapin-Nee",
                    "score": 4,
                    "created_utc": 1653145771.0,
                    "response": "Sounds about right. Hopefully they follow through and don’t just try and backstab BTC with the ESG narrative. BiTcOiN ShOuLd bE pRoOf oF sTaKe. Duuuuuuurr.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9gp5by",
                            "author": "Cirewess",
                            "score": 3,
                            "created_utc": 1653149579.0,
                            "response": "Sir, that is exactly what they're trying to do",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9hxtdd",
                            "author": "Sterlingz",
                            "score": 0,
                            "created_utc": 1653171179.0,
                            "response": "For every bitcoin maxi calling for the death of shitcoins via securities law, there's an ESG treehugger calling for the outright ban of PoW.\n\nThe best approach is to fight tooth and nail for the entire industry. Shitcoin regulation IS a slippery slope and at the very least, protocols built on LN will become subject to retarded laws and hamper their growth.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9gqm1h",
                    "author": "Futhamucker1",
                    "score": 4,
                    "created_utc": 1653150250.0,
                    "response": "There is a world outside of the USA",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9grhla",
                            "author": "Mallardshead",
                            "score": 7,
                            "created_utc": 1653150656.0,
                            "response": "Agreed. Unfortunately most of that world would gladly follow the US' precedent. And if they didn't have access to USDC...",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9gsy2q",
                            "author": "LastLivingSouls",
                            "score": 7,
                            "created_utc": 1653151321.0,
                            "response": "Yes, but in a financial sense, that world is very miniscule.  Nearly every financial policy is set based on what the US and the world reserve currency, USD, is doing.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9gzhu2",
                            "author": "generateduser29128",
                            "score": 1,
                            "created_utc": 1653154289.0,
                            "response": "Remove every coin with US VC funding and the top 50 list already looks very different.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9h1h2d",
                    "author": "EmilyLovs",
                    "score": 2,
                    "created_utc": 1653155198.0,
                    "response": "The SEC criminal enterprise jurisdiction ends at the US border my friend.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9h4go9",
                            "author": "This_gone_nanners",
                            "score": 8,
                            "created_utc": 1653156585.0,
                            "response": "It's cute that you think the power of the US stops at its borders.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9h74lt",
                                    "author": "EmilyLovs",
                                    "score": -3,
                                    "created_utc": 1653157859.0,
                                    "response": "Sure... ask those left behind in Afghanistan.  It's cute that you think the US hegemony still exists.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9h814i",
                                            "author": "This_gone_nanners",
                                            "score": 5,
                                            "created_utc": 1653158294.0,
                                            "response": "Thanks for the laugh.  Not at the suffering of those in Afganistan, but that you imply this means the US has no influence outside of its borders.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i9iu6nl",
                                            "author": "modefi_",
                                            "score": 1,
                                            "created_utc": 1653188674.0,
                                            "response": ">It's cute that you think the US hegemony still exists.\n\nYou... you don't? Really?\n\n&#x200B;\n\n&#x200B;\n\n***Really???***",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9j0giv",
                                                    "author": "EmilyLovs",
                                                    "score": 0,
                                                    "created_utc": 1653192484.0,
                                                    "response": "Empires fall slowly, slowly, then all at once.\n\nUS is at the all at once stage.\n\nAfghanistan was just the start.  Now oil is sold in Rubbles, and BTC.  The underpinning of that criminal enterprise (Federal Reserve Notes), has been kneecapped.  Without that global extraction operation (USD money printing), that enterprise dies.\n\nLets hope that the America that once was can rise from the ashes and never allow criminals the power of the purse again.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9h2gen",
                            "author": "Mallardshead",
                            "score": 8,
                            "created_utc": 1653155652.0,
                            "response": "But so does ETH and altcoin liquidity.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9h7qtj",
                                    "author": "EmilyLovs",
                                    "score": -4,
                                    "created_utc": 1653158156.0,
                                    "response": "You haven't traveled much have you.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9hajmn",
                                            "author": "Mallardshead",
                                            "score": 5,
                                            "created_utc": 1653159520.0,
                                            "response": "I'm not from the US. I'm not currently in the US.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9g5vcv",
                    "author": "Fair-Pool-5155",
                    "score": 1,
                    "created_utc": 1653140472.0,
                    "response": "Thank you for sharing your knowledge and thoughts 🙏🙏🙏",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9glzjf",
                    "author": "Technical_Emu_8567",
                    "score": -2,
                    "created_utc": 1653148139.0,
                    "response": "Go figure...\n\nA bitcoiner enthused about government regulation.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9gp3j4",
                            "author": "Mallardshead",
                            "score": 17,
                            "created_utc": 1653149556.0,
                            "response": "Enthused about eliminating the Madoff's, celebrities, cantillionaires, VC's, and scams before they recreate the current system more than they already have. I want progress, not suicides, distrust, and cries for bailouts.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9gp9e8",
                            "author": "Cirewess",
                            "score": -8,
                            "created_utc": 1653149631.0,
                            "response": "Makes absolutely no sense, it's comical that this sub encourages this mindset",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9hazak",
                    "author": "EuphoricPorridge",
                    "score": 1,
                    "created_utc": 1653159727.0,
                    "response": "*In the US",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9h2cn2",
                    "author": "coredweller1785",
                    "score": 1,
                    "created_utc": 1653155602.0,
                    "response": "When there is an ending there will be a beginning. \n\nI welcome regulation and I welcome consumer protection. \n\nI think a lot of good will bore out of this because projects will have guidelines to follow and be able to stake out their future better \n\nRight now there is so much uncertainty and user risk. As a highly technical software engineer who works in the crypto space I myself feel overwhelmed and uncomfortable.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9haa9c",
                            "author": "Mallardshead",
                            "score": 6,
                            "created_utc": 1653159392.0,
                            "response": "Energy can't be counterfeited. Bitcoin uses the one-directional entropy of energy to secure the ledger and control issuance. Simplicity is a fundamental security practice, and bitcoin exploits this with informational scarcity (block size, minimal scripting, etc). Bitcoin doesn't target a stable price. It targets a variable price. It's PoW can control issuance, and the free market sets the price. When it absorbs enough trust (value) its confidence curve (volatility) will flatten. This is a long, difficult, and organic step towards a transactional reserve currency from the simple store of value (collateral) phase.\n\nIt seems to me everyone tries replicating bitcoin the price's success by augmenting bitcoin the network's complexity. All gimmicks, from silly PoS consensus mechanisms, to messy scaling layers, all born in a time when exchanges and stablecoins already exist to Hansel and Gretal them fat. They don't realize the real innovation of bitcoin's stack is the energy  bonding it all together. They also seem to believe they can simply skip the store of value phase and be instantly accepted as a transactional currency to the world--which only fiat backed stablecoins can do. Everything is overwhelming because it's all a junkyard. There's only bitcoin.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9hc9fb",
                                    "author": "coredweller1785",
                                    "score": 1,
                                    "created_utc": 1653160347.0,
                                    "response": "I'm a bitcoin supporter and don't really mess with alts but I side with Buterin here. \n\n\"As Buterin learned more about the blockchain technology on which Bitcoin was built, he began to believe using it purely for currency was a waste. The blockchain, he thought, could serve as an efficient method for securing all sorts of assets: web applications, organizations, financial derivatives, nonpredatory loan programs, even wills. Each of these could be operated by “smart contracts,” code that could be programmed to carry out transactions without the need for intermediaries.\"\n\nThere is so much more to blockchain than crypto.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9hiuau",
                                            "author": "grim_goatboy69",
                                            "score": 1,
                                            "created_utc": 1653163583.0,
                                            "response": ">The blockchain, he thought, could serve as an efficient method\n\nA blockchain is maximally inefficient by design. It's not efficient at all because it requires everyone to come to consensus globally. The future of any successful project is to use the blockchain as little as possible.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9hk33p",
                                                    "author": "coredweller1785",
                                                    "score": 2,
                                                    "created_utc": 1653164202.0,
                                                    "response": "Well you cut off an important part so nice job cherry picking.\n\nIt is efficient at securing things that should be publicly available and not behind private walls or black boxes. His talk on public goods goes along with this well.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9hwbos",
                                                            "author": "grim_goatboy69",
                                                            "score": 2,
                                                            "created_utc": 1653170410.0,
                                                            "response": "It is not efficient at securing things. It is incredibly inefficient at securing things, which is why it should be limited to the things that only require that security. Hence, money itself. Not tokens, NFTs, scamcoins, etc. By trying to give everything security, you destroy the strong properties of the security itself. Basically, you can't have your cake and eat it too. This is why bitcoiners are so adamant about using layer 1 only for securing the Bitcoin asset itself, and not spreading the security budget thinly over a million different things.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9hm3xy",
                    "author": "deefdaffer",
                    "score": 1,
                    "created_utc": 1653165217.0,
                    "response": "Or all of us just say fuck these fucking laws.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9guq0r",
                    "author": "AugustusAurelius-III",
                    "score": -3,
                    "created_utc": 1653152136.0,
                    "response": "Garbage. Nothing but a Bitcoin maxi mindset.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9gve9w",
                            "author": "Mallardshead",
                            "score": 4,
                            "created_utc": 1653152437.0,
                            "response": "You could use a little more Marcus, a few more meditations on what's happening broadly, and why bitcoin is eating everything once considered the strength & utility of shitcoins.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9h35e5",
                    "author": "donaudelta",
                    "score": 0,
                    "created_utc": 1653155970.0,
                    "response": "what Bitcoin is talking Gensler? which one? ;-)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9hjc2i",
                    "author": "theneworld",
                    "score": 0,
                    "created_utc": 1653163829.0,
                    "response": "This will alienate millions of people, won’t help you get rich...",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9fuxxr",
                    "author": "StockAd229",
                    "score": -15,
                    "created_utc": 1653133886.0,
                    "response": "Sounds like fud",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9gt8g8",
                    "author": "AwaySupermarket3289",
                    "score": 1,
                    "created_utc": 1653151453.0,
                    "response": "I admit, I’m not smart enough to understand this.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9gxjtl",
                    "author": "noddingacquaintance",
                    "score": 1,
                    "created_utc": 1653153418.0,
                    "response": "**OP said 0.0004 ¢, not %**",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9gy8e5",
                    "author": "7GreekGod7",
                    "score": 1,
                    "created_utc": 1653153721.0,
                    "response": "Lol",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9gyiji",
                    "author": "mesavoida",
                    "score": 1,
                    "created_utc": 1653153847.0,
                    "response": "You can’t predict the future based on a Tweet. It’s an opinion. Some charges are coming but until it’s official it’s speculation.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9h3xgx",
                    "author": "polished_pole",
                    "score": 2,
                    "created_utc": 1653156329.0,
                    "response": "quietly carrying good work informing the plebs about the latest developments, i like this.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9hrtwj",
                    "author": "ChrimsonChin988",
                    "score": 1,
                    "created_utc": 1653168080.0,
                    "response": "What I can't wait to see is if all the scummy influencers, who were shilling shitcoins while being paid for it in said coin and dumping those coins on the public at the same time, are going to get sued for advertising an unlisted security.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9hxb14",
                    "author": "turick",
                    "score": 1,
                    "created_utc": 1653170914.0,
                    "response": "Great write up!! Thanks for this! Also don't forget River Financial as one of the great, bitcoin only brokerages with lightning support!\n\nIt's going to be very interesting to watch the shitcoin casino catch on fire when all the coins are deemed securities.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9i26bg",
                    "author": "FreeSpirit2019",
                    "score": 1,
                    "created_utc": 1653173445.0,
                    "response": "\" If your dapp is a fully registered security with KYC what do you need blockchain exactly ! \" \n\n🤪🤣🤪 Made my day !!!\n\nGreat article mate ! And to answer at your question for them ... they need blockchain somewhere around the title cause else they won't get the investments to build this shit up ! \n\nYet of we were to stay with the feet on the ground and think logical about it for a moment we must admit to ourselves 2 had truths : \n\n1 - Any blockchain is bound by the same lousy ass TRILLEMA : SCALABILITY - SECURITY - DECENTRIZATION ! You can only have 2 out of 3 so make your choice worthwhile !!!\n\n2 - Speaking about choice : We keep on forgetting that it's not about logic, matter of truth that lies in the token of choice but about people !!! People choose good or bad, and most of the times people defend their bad choice till the last breath 🤪🤣 it had a name in psichology I forgot... Maybe that's why so many shit projects are still standing !!! Untill they meet the Trillema then i's Game Over - No coin more to insert 🙂\n\nI 💚tly reccomend to all one of the greates books ever written about economy and humans \"Human Action\" by Ludwig vin Mises !!!\n\n✌️ & 💚",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ibjet",
                    "author": "ColdFusion3456",
                    "score": 1,
                    "created_utc": 1653178518.0,
                    "response": "Cool. But don't care. I haven't really cared about a whole lot these days.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9iwurb",
                            "author": "Mallardshead",
                            "score": 1,
                            "created_utc": 1653190202.0,
                            "response": "🆖🆙",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9iccm0",
                    "author": "Farrellfernandez",
                    "score": 1,
                    "created_utc": 1653178960.0,
                    "response": "All the other coins SUCK !!!!\nBitcoin RULES !!!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ifiaz",
                    "author": "thermalblac",
                    "score": 1,
                    "created_utc": 1653180685.0,
                    "response": "Hopefully Stacks and Sovryn die as well",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9iiidf",
                    "author": "Stockoholic",
                    "score": 1,
                    "created_utc": 1653182293.0,
                    "response": "great!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ijp7p",
                    "author": "oboshoe",
                    "score": 1,
                    "created_utc": 1653182931.0,
                    "response": "We will see the shitcoins going to exchanges that exist outside of the SEC reach.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9it2c0",
                    "author": "megafari",
                    "score": 1,
                    "created_utc": 1653188060.0,
                    "response": "So coinbase, binance, itrust, gemini, crypto.com etc etc miscalculated their business models without having a good read on the demise of the altcoin then?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9itbrx",
                            "author": "Mallardshead",
                            "score": 1,
                            "created_utc": 1653188203.0,
                            "response": "They were too greedy. Couldn't help themselves.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9j3ua9",
                    "author": "bbfruit",
                    "score": 1,
                    "created_utc": 1653194788.0,
                    "response": "So do I buy in now or no",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9j7ezz",
                    "author": "maxcoiner",
                    "score": 1,
                    "created_utc": 1653197425.0,
                    "response": "I agree fully but caution everyone here not to rub it in when it happens. When the shitcoins hit the fan, shitcoiners everywhere will have the same 2 choices: \n\n1. Sell these illegal tokens for bitcoin.\n2. Sell for dollars and give up on the space altogether. Maybe join r/buttcoin too. \n\nLEARN TO BE GRACIOUS, FOLKS! \n\nThey may not deserve your grace, but it'll help bitcoin if you do.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9jbmlo",
                    "author": "mjoh090",
                    "score": 1,
                    "created_utc": 1653200820.0,
                    "response": "If the exchanges that effectively provide the critical mass of support needed for the crypto retail market to exist, fail and disappear, how exactly will the value of bitcoin be determined in order for it to act as a medium of exchange, if that retail market is essentially destroyed?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9geejw",
                    "author": "horsecyack",
                    "score": -9,
                    "created_utc": 1653144633.0,
                    "response": "Meh not sure I buy this bs",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ga9kc",
                    "author": "Doge-SAE",
                    "score": -10,
                    "created_utc": 1653142694.0,
                    "response": "Ohhhh,  uuuuw… scary.  Should I sell all my assets now?  Hell NO!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9garm0",
                            "author": "Mallardshead",
                            "score": 9,
                            "created_utc": 1653142926.0,
                            "response": "\"Assets\"?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9gwnnx",
                    "author": "Agent007_x",
                    "score": -1,
                    "created_utc": 1653153003.0,
                    "response": "Just cause they might do this in America doesn’t mean the rest of the world will",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}