{
    "subreddit": "BitcoinBeginners",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uy7gcf",
            "title": "Why is cash app good or bad to do DCA with?",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/uy7gcf/why_is_cash_app_good_or_bad_to_do_dca_with/",
            "author": "chiver45",
            "created_utc": 1653571118.0,
            "score": 2,
            "num_comments": 4,
            "subreddit": "BitcoinBeginners",
            "selftext": "Hello i am new to investing in Bitcoin and I want to set up a DCA with cash app. Investing 200. a month. Is this a good or bad move and why? And if not do you have any other suggestions?\n\nThank you in advance for any help.",
            "stickied": false,
            "comments": [
                {
                    "id": "ia28exh",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653571118.0,
                    "response": "WassaWassaWassup! Scam Alert! Scammers are particularly active on this sub. They operate via private messages and private chat. If you receive private messages, be extremely careful. Use the **report** link to report any suspicious private message to Reddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BitcoinBeginners) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia29bh5",
                    "author": "BTCMachineElf",
                    "score": 1,
                    "created_utc": 1653571544.0,
                    "response": "CashApp is good. Fees are not bad, but Coinbase Pro or Gemini with Active Trader are better. Still it's super convenient. Go ahead and use it for now, while looking into other recommended services.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia2a34k",
                    "author": "azraelle_178",
                    "score": 1,
                    "created_utc": 1653571905.0,
                    "response": "Yes it is. There also other exchanges like Kraken, Coinbase or Binance but if you live in Canada, I suggest you use Netcoins. It's good for trading and storing cryptos. It's also perfect for DCA. As for the fees, they are at low cost so it's worry-free.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}