{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uqlk6t",
            "title": "How to achieve anonymity?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uqlk6t/how_to_achieve_anonymity/",
            "author": "BackInTheDay23",
            "created_utc": 1652668052.0,
            "score": 2,
            "num_comments": 10,
            "subreddit": "Bitcoin",
            "selftext": "Ever since I got into crypto I have been buying from centralized exchanges like crypto.com and Coinbase.\n\nAs my government is starting to introduce some regulations on crypto, I would like to keep a low profile.\n\nI am using a ledger nano S right now and I have all my Bitcoin on it. (which I purchased on Coinbase and crypto.com).\n\nSince Bitcoin is traceable, what can I do to become completely anonymous with it?\n\nThanks in advance.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8rvshc",
                    "author": "uncontrollableop",
                    "score": 6,
                    "created_utc": 1652668973.0,
                    "response": "at the very minimum, you have to move it from the addresses your kyc exchanges sent to.  that gives the bare minimum kind of plausible deniability to what happens next.  and of course when you do move it, make sure you use a tor native wallet, or a wallet linked to your own private node. there are of course other methods like coinjoin mixing if you want more than a plausible deniability.    \n\nbut being anonymous has just as much to do with your operational security as it has to do with your bitcoin procedures.  for example, obviously you can't order something shipped to your home address while remaining anonymous.  unless, again, mere plausible deniability suits your purpose.  you also have to avoid cameras, known ip addresses, and other forms of surveillance.  and these things have nothing to do with bitcoin.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8rwbc8",
                            "author": "BackInTheDay23",
                            "score": 1,
                            "created_utc": 1652669242.0,
                            "response": "The address I sent to is my personal cold wallet. Would I be able to reset it?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8rz7jr",
                                    "author": "caploves1019",
                                    "score": 1,
                                    "created_utc": 1652670768.0,
                                    "response": "Create a secondary hot wallet, send all to new wallet, then incrementally send chunks to your long term storage. Wait a few years, if you need more obfuscation, use a Samourai wallet mixer to coinjoin for a while before spending any.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8s4yrt",
                                            "author": "ndgoLiberty",
                                            "score": 0,
                                            "created_utc": 1652674110.0,
                                            "response": "Yeah if you send it all at once that’s gonna forensically tie your old cold wallet with your new cold wallet. Bitcoin anonymity isn’t worth it for me. Too much time and effort.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8s9v30",
                                                    "author": "caploves1019",
                                                    "score": 1,
                                                    "created_utc": 1652677183.0,
                                                    "response": "The first send is simply plausible deniability \"sorry, I quit bitcoin and gifted it all to a random stranger on the internet.  No, I am not going to track down their identity for you, that's your job.  Look?  Check my bank records, I see no random income equating to that transaction so like I said.  I donated it off to a stranger and am no longer affiliated to those coins.\"\n\n&#x200B;\n\nPart two ensures part one is not readily discovered 3 days later as an income at the same total value, thus revoking your plausibility.  This is not tax evasion as you would *eventually* have to declare income at present price point (much steeper than long term gains) if you were to ever sell bitcoin for fiat.  So if your theory is bitcoin wins after the collapse of fiat, you'll be paying your taxes in bitcoin anyway.  If your theory is bitcoin rides along side fiat, you will eventually have to cash bitcoin in to fiat to pay taxes and thus would have wanted to be declaring tax events on every transaction leading up to that point.  So it all anchors to what your long term strategy is and completely coincides with obeying local and federal laws without any fraud whatsoever.  You are simply either extending or shortening your time-preference.\n\n&#x200B;\n\nUnless a completely unethical tax on unrealized gains is implemented, in which case.... severe.... changes.... need to exist in that theoretical government tyranny.  Tax on unrealized gains is outright theft, there's no other way to look at it.\n\n&#x200B;\n\nEdit: to note, OP said he's used central exchanges to purchase all bitcoin anyway... There's literally no reason to keep those utxo separate as they're all KYC to him anyway.... Sending them all to one new wallet is just to add one tiny little shred of layer and push out the timeline a bit.  He's already kyc to that lump some of addresses at the purchased price point.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8tycv3",
                            "author": "I_Has_A_Hat",
                            "score": 1,
                            "created_utc": 1652715935.0,
                            "response": "Don't ledgers create a new address for every transaction?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8s4typ",
                    "author": "Boe_Ning",
                    "score": 5,
                    "created_utc": 1652674027.0,
                    "response": "Samourai wallet coinjoin.  Because of the flat mixing pool fee, it can be quite economical to mix if you have enough BTC.  On top of that, mixed BTC can remain in the mixing pool for as long as you want to continue mixing, increasing the degrees of separation from your original address, for no additional fee",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8s3lap",
                    "author": "solomonsatoshi",
                    "score": 3,
                    "created_utc": 1652673283.0,
                    "response": "[bisq.network](https://bisq.network)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8tja4f",
                    "author": "Independent-Snow-129",
                    "score": 1,
                    "created_utc": 1652709509.0,
                    "response": "MLB Hidden Ball Tricks on youtube!\n\nedited: *And he's out... \" Faked him out , the old veteran acted like he threw it back to the pitcher, kept it in his back pocket, carpender was off the bag and he tagged him! Take a look here, oh oh ! \"*",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}