{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uyndti",
            "title": "Can the Federal Reserve cartel go bankrupt? They claim to have “an infinite amount of cash…” Bitcoin actually fixes this",
            "url": "https://youtu.be/X6k0Ov1mqfk",
            "author": "thefullmcnulty",
            "created_utc": 1653616776.0,
            "score": 5,
            "num_comments": 12,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "ia57url",
                    "author": "uncontrollableop",
                    "score": 2,
                    "created_utc": 1653617759.0,
                    "response": "having cash doesn't keep you from going bankrupt. ask venezuela, or any number of other examples where their cash became worthless.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia58ke5",
                            "author": "thefullmcnulty",
                            "score": 1,
                            "created_utc": 1653618104.0,
                            "response": "This is exactly my point. \n\nThe infinite creation of usd as needed will destroy trust in the currency and it will go to zero.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia59lvl",
                                    "author": "solomonsatoshi",
                                    "score": 1,
                                    "created_utc": 1653618613.0,
                                    "response": "So far it has been without any real alternative -  monetary hegemony being built upon mercantile strength- post WW2 USA was unequalled in gold reserves and manufacturing capacity.\n\nThat has changed and now China has the largest productive economy and is of a mindset to challenge USD fiat hegemony.\n\nWithout the vast seigniorage harvested from monetary tributaries the USA is bankrupt.\n\nChina sets out to reverse engineer the monetary hegemony first imposed by Britain via Hong Kong, using DCEP digital Yuan.\n\nWhile Bitcoin provides a third way neutral and principled alternative that appeals to some Bitcoin triumph is far from guaranteed.\n\nThe brutal logic or empire is written in history- can an organic algorithm enable a new chapter in human evolution?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "ia58w5s",
                            "author": "hVMjjxumF45DKy13",
                            "score": 1,
                            "created_utc": 1653618261.0,
                            "response": "Technically that doesn't apply to the US because US sovereign debt is denominated in USD. Now, yes, the dollar could become worthless in a hyperinflation scenario, but the US would technically not be bankrupt--just poorer in real terms.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia5ag6r",
                                    "author": "solomonsatoshi",
                                    "score": 1,
                                    "created_utc": 1653619035.0,
                                    "response": "USA has not enjoyed a trade surplus for over 5 decades.\n\nIt has funded chronic deficits via its issuance of the global reserve currency.\n\nWithout the vast seigniorage income this gaves the USA would be bankrupt- ie unable to pay for its liabilities.\n\nIf an alternative system of international settlement, one for example based upon digital Yuan was to develop, collapse of USD and USA, could be swift and brutal.\n\nIf China demands payment for its produce and services be denominated in Yuan how many nations could afford to refuse?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia5gejm",
                                            "author": "hVMjjxumF45DKy13",
                                            "score": 2,
                                            "created_utc": 1653622064.0,
                                            "response": "You have basically identified the [Triffin dilemma](https://en.wikipedia.org/wiki/Triffin_dilemma). But the artificial demand for USD reserve assets doesn't mean that if USD is no longer the global reserve currency, then the US would be bankrupt (i.e. default on its obligations). Instead the US will go through a painful period of inflation where existing debt is monetized (i.e. paid in full with 'newly printed' dollars, which causes inflation) until the debt load is manageable. That doesn't mean a collapse, but probably something more like post-WWII UK.\n\nNote that the Triffin dilemma is currency-agnostic; it's a general problem with having a national currency serve as the global reserve currency. China could go ahead and try, but they would be faced with the same problem. And they're classic mercantilists who love their trade surpluses...",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia59g4q",
                    "author": "momoneyforme",
                    "score": 2,
                    "created_utc": 1653618534.0,
                    "response": "That is why the Federal Reserve through Goldman is shorting bitcoin futures naked.  They need it destroyed to keep power!!!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia5avqs",
                            "author": "solomonsatoshi",
                            "score": 1,
                            "created_utc": 1653619256.0,
                            "response": "Who does Ted Cruzs wife work for?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia5zw3g",
                    "author": "DomComm",
                    "score": 1,
                    "created_utc": 1653634971.0,
                    "response": "They cant go bk they just print another trillion dollars the next day",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia567t4",
                    "author": "solomonsatoshi",
                    "score": -2,
                    "created_utc": 1653616957.0,
                    "response": "USD vs DCEP vs BTC",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia56gt2",
                            "author": "thefullmcnulty",
                            "score": 1,
                            "created_utc": 1653617078.0,
                            "response": "Open network wins.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia58fp9",
                                    "author": "solomonsatoshi",
                                    "score": 1,
                                    "created_utc": 1653618042.0,
                                    "response": "There is no guarantee of that.\n\nMost of humanity, of fickle, frail insecurity and selfishness have and will sell out their freedoms and liberties for a Big Mac, or other temporary enticement.\n\nIMO this contest is far from predetermined - only time will tell whether freedom and liberty or state surveillance tyranny and autocracy ultimately triumph.\n\nThere may result a more multi-polar world.\n\nLadies and gentlemen \\~ Place your bets!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}