{
    "subreddit": "BitcoinBeginners",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uth4wz",
            "title": "Looking for learning platforms",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/uth4wz/looking_for_learning_platforms/",
            "author": "angrymdf42",
            "created_utc": 1653006557.0,
            "score": 1,
            "num_comments": 11,
            "subreddit": "BitcoinBeginners",
            "selftext": " \n\nHi fellow redditors, i am really new on this topic, i know basically nothing, i want to learn from the basics, so i wanted to ask you guys which platforms (not personal or private classes) do you recommend me to invest my time and money, i want a place where someone could teach me about trading, investing, mining, to see the predictions and trends and well, basically someone to show me how this all works and how to get advantage of this systems.\n\nSo please, if you know about a platform or trustable virtual classes I will really appreciate your information.\n\nThank you all for your time.",
            "stickied": false,
            "comments": [
                {
                    "id": "i99oyu1",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653006557.0,
                    "response": "WassaWassaWassup! Scam Alert! Scammers are particularly active on this sub. They operate via private messages and private chat. If you receive private messages, be extremely careful. Use the **report** link to report any suspicious private message to Reddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BitcoinBeginners) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9b14xy",
                    "author": "rastafarey25",
                    "score": 1,
                    "created_utc": 1653037213.0,
                    "response": "You should start at Netcoins crypto academy https://netcoins.ca/crypto-academy/, you can learn all the basic fundamentals you should know about bitcoin and blockchain there.\n\n&#x200B;\n\nThen after that, you can enroll in some free online courses about Bitcoin or cryptocurrency at udemy",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9bb4t2",
                            "author": "angrymdf42",
                            "score": 2,
                            "created_utc": 1653044781.0,
                            "response": "Than you so much",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9bk9v9",
                    "author": "Kelvchi",
                    "score": 1,
                    "created_utc": 1653049857.0,
                    "response": "I would suggest Bitay academy, it’s under Bitay exchange. You can browse and research about it. It’s actually free and you can know everything about the crypto ecosystem there including technical analysis and from what I know, their exchange gives trading experience without risk of losing money. Do your research on it",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9c89zp",
                    "author": "DudeIncogneto",
                    "score": 1,
                    "created_utc": 1653060165.0,
                    "response": "This has a lot of details and information without being too technical\n\nhttps://learnmeabitcoin.com/\n\nThis is also a good guide that covers tuff like wallets, nodes etc without being too technical. \n\nhttps://bitcoiner.guide/",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9d2uu3",
                    "author": "hypewaver",
                    "score": 1,
                    "created_utc": 1653072866.0,
                    "response": "Hey I suggest you read this [article](https://topforex.trade/academy/cryptocurrency-guide-buy-trade-crypto) \\- it's pretty extensive and covers basic crypto terms that are to know. After that you can just scroll through the [academy](https://topforex.trade/academy) articles, as I understood correctly they made by professional traders and analytics. And it's free, which was a main point for me when I found them",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9dkdg9",
                    "author": "Psychological-Ad212",
                    "score": 1,
                    "created_utc": 1653080829.0,
                    "response": "Try Binance Academy, they offer lessons from Beginner level to Advanced level with a variety of topics to choose from, also if you decide to trade crypto try getting comfortable on paper trading account which is available for free on TradingView platform, it uses fake money in real market data",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}