{
    "subreddit": "BitcoinBeginners",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uz28py",
            "title": "NatWest",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/uz28py/natwest/",
            "author": "KeepThePedalsTurning",
            "created_utc": 1653669550.0,
            "score": 0,
            "num_comments": 20,
            "subreddit": "BitcoinBeginners",
            "selftext": "Hi there, \n\nI’m looking to get into cryptocurrency so therefore looking for the best crypto exchange. \n\nI downloaded the Binance app earlier today as I’ve read they are one of the better exchanges and when trying to bank transfer money from my current account to my Binance account, payment was automatically blocked by the bank (NatWest) \n\nI tried transferring a smaller amount shortly after but this payment was also blocked. Is there a way to get around this or shall I try another exchange? I’m in the United Kingdom) \n\nThanks in advance.",
            "stickied": false,
            "comments": [
                {
                    "id": "ia7oi7i",
                    "author": "bitusher",
                    "score": 2,
                    "created_utc": 1653670304.0,
                    "response": "avoid binance. They are one of the most expensive exchanges due to their absurd withdrawal fees",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia7os6i",
                            "author": "KeepThePedalsTurning",
                            "score": 1,
                            "created_utc": 1653670417.0,
                            "response": "Thanks for your reply, which exchanges do you recommend? With low fees, if possible",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia7plvv",
                                    "author": "bitusher",
                                    "score": 2,
                                    "created_utc": 1653670757.0,
                                    "response": "gemini active trader has 10 free withdrawals a month",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "iaayq0x",
                                    "author": "krisycoll",
                                    "score": 1,
                                    "created_utc": 1653739329.0,
                                    "response": "Binance have a very high withdrawal fee. Its better if your bank block the transfer hahah\n\nI like Kraken: Its simple and you can withdraw for fee 0.0002 btc but now they let you withdraw trough Lightning network",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iaayuro",
                                            "author": "KeepThePedalsTurning",
                                            "score": 1,
                                            "created_utc": 1653739415.0,
                                            "response": "Hahah great comment, I’ve gone with Coinbase pro as my bank allows transfers. Will see how things go. Thank you",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia7mnwv",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653669551.0,
                    "response": "WassaWassaWassup! Scam Alert! Scammers are particularly active on this sub. They operate via private messages and private chat. If you receive private messages, be extremely careful. Use the **report** link to report any suspicious private message to Reddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BitcoinBeginners) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia7ooaw",
                    "author": "The_0b_Server",
                    "score": 1,
                    "created_utc": 1653670374.0,
                    "response": "Maybe you should ask the bank why they are refusing the payment. I have heard some banks in UK block payments to crypto exchanges before they get permission from the account holder. I know Santander UK is ok with payments to Binance so I don’t see why NatWest shouldn’t",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia7poh5",
                            "author": "KeepThePedalsTurning",
                            "score": 1,
                            "created_utc": 1653670787.0,
                            "response": "Thanks for your reply, that’s interesting. I’ll contact them and see what they say.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia7ytqo",
                                    "author": "bitusher",
                                    "score": 1,
                                    "created_utc": 1653674624.0,
                                    "response": "Binance is under investigation for its fraud and illegal activities so many banks blocked them .",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iaa1p76",
                                            "author": "WhiteGhost21",
                                            "score": 1,
                                            "created_utc": 1653712086.0,
                                            "response": "So was Nat West last year",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia7q8z7",
                    "author": "AssumptionKey1842",
                    "score": 1,
                    "created_utc": 1653671017.0,
                    "response": "You can set up an account with Revolut and send via that.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iab7vrj",
                    "author": "WolfAmoungst_Sheep",
                    "score": 1,
                    "created_utc": 1653744824.0,
                    "response": "Binance was blocked by most if not all major banks and building societies in the UK after a recent... ruling from the FCA (personally I had used Nationwide which blocked them first then after a few purchases through a Monzo account they blocked Binance also) but I had noticed that some banks had allowed transfers and card payments into the exchange back up after some clearing up of business practice/ location... This has been an on going saga for around a year or more, searching online you'll find relevant UK rulings and news around Binance and retail investors using their platform. Again personally for what its worth, after navigating through different exchanges from the UK if you wanted to DCA into Bitcoin. Coincorner is easily the best in terms of lower buy fee approx 30p almost insant free bank transfers into a councorner account. The spread on spot price is pretty bang on and lightening capability to withdraw out. Otherwise from a 'trading/ limit order buys/ sell' I've found FTX, Binance, Coinbase Pro to be decent, oh and Kucoin for dirty shitcoins.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iabpmjo",
                    "author": "MrQ01",
                    "score": 1,
                    "created_utc": 1653753523.0,
                    "response": "If you really want to use Binance, and NatWest are adament they won't deal with Binance, a way to get around it could be opening an account with Coinbase. Then you can buy crypto and transfer that crypto to Binance, where you can then exchange it if required.\n\nThis is an idea only - not financial advice and it's advised to confirm this can be done before actioning.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}