{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uqvltw",
            "title": "Satoshi = Ulbricht?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uqvltw/satoshi_ulbricht/",
            "author": "TruthSeeker-84",
            "created_utc": 1652706568.0,
            "score": 0,
            "num_comments": 6,
            "subreddit": "Bitcoin",
            "selftext": "Has anyone ever looked into the possibility that Satoshi is really Ross Ulbricht and the reason he hasn’t cashed out or posted since 2011 is he started Silk Road then got arrested?\n\nWhat a fucking master stroke that would have been.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8thb1d",
                    "author": "ollieeeeeeeeeeeeeeee",
                    "score": 1,
                    "created_utc": 1652708587.0,
                    "response": "Dunno but I knew a guy who got arrested in BKK with allegedly $850MM in BTC on him. He was #2 in command of a cyber crime group called “infraud”.\n\nVery nice bloke and you’d never know he was involved in that shit. Pretty sure he’s in a jail in Texas atm.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8thgfu",
                    "author": "Rannasha",
                    "score": 1,
                    "created_utc": 1652708657.0,
                    "response": "There's no indication that Ulbricht had the cryptography background to develop something like Bitcoin.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8ti13n",
                            "author": "TruthSeeker-84",
                            "score": 1,
                            "created_utc": 1652708927.0,
                            "response": "He didn’t have the background as a web developer or drug dealer either and look how well that went, initially. The guy was a bona fide genius who has an SAT of 1460. It’s not outside the realm of possibility. If you look at Satoshi’s earliest posts he asks for a lot of advice and help.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8tj98t",
                                    "author": "Rannasha",
                                    "score": 1,
                                    "created_utc": 1652709498.0,
                                    "response": "> He didn’t have the background as a web developer or drug dealer either and look how well that went,\n\nIt's a lot easier to become a web developer than it is to create a completely new type of digital currency. As for the drug dealer part, I don't think Ulbricht really did a whole lot of that himself. Silkroad was a marketplace, not a seller.\n\n> SAT of 1460\n\nWhich according to the SAT website puts him in the 96th percentile of people who have taken the SAT test. Quite high, but not necessarily genius level.\n\n> If you look at Satoshi’s earliest post he asks for a lot of advice and help.\n\nThe very first public communication from Satoshi was the release of the Bitcoin whitepaper. By then, he had already solved the key issues surrounding distributed consensus that had blocked previous attempts at a decentralized currency. Sure, he asked for help with implementation details later on, but when Satoshi entered the scene, the actual genius-level stuff was already done.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8tlg5x",
                                            "author": "TruthSeeker-84",
                                            "score": 1,
                                            "created_utc": 1652710491.0,
                                            "response": "I think he started his own mushroom farm to get the first few sales on SR. Pretty easy for anyone to do though I suppose.\n\nBut damn wouldn’t it he cool if it was him, or if he was involved in its creation. The timeline matches perfectly. I know it’s probably not him and much more likely to be Adam Back or Hal Finney.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i8tlscx",
                                    "author": "frequent_heron_2102",
                                    "score": 1,
                                    "created_utc": 1652710642.0,
                                    "response": "> He didn’t have the background as a web developer or drug dealer either and look how well that went, initially.\n\nHe was posting on forums asking very basic questions about PHP. And that was after Bitcoin's paper was released and the software was written.\n\nAnd as for how well it went... it went poorly. Because he's in prison now because of his own serious lapses in security.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "id": "uqvgrz",
            "title": "is bitcoin really hidden from authority?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uqvgrz/is_bitcoin_really_hidden_from_authority/",
            "author": "BijuuSwerve",
            "created_utc": 1652706142.0,
            "score": 1,
            "num_comments": 37,
            "subreddit": "Bitcoin",
            "selftext": "I ask this because alot people use sites like coinbase.com and that site knows your identity,address,phone numbers,etc. And after looking up what bitcoin is, im told that it's \"private\" and that\"the government nor can anyone else see you're activity with bitcoin\"but coinbase can easily report us for anything suspicious right?",
            "stickied": false,
            "comments": [
                {
                    "id": "i8tcuu1",
                    "author": "VariousTransition795",
                    "score": 3,
                    "created_utc": 1652706387.0,
                    "response": "BTC is pseudo-anonymous.\n\nIt is fully transparent.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8td2pj",
                            "author": "BijuuSwerve",
                            "score": 1,
                            "created_utc": 1652706502.0,
                            "response": "\"By pseudo-anonymity, we mean that a person will be linked to a public Bitcoin address, but no one will get to know the actual name or address.\" But coinbase knows both person and name???",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8tdjln",
                                    "author": "TheGreatMuffin",
                                    "score": 1,
                                    "created_utc": 1652706746.0,
                                    "response": ">  But coinbase knows both person and name???\n\nYou are not using bitcoin, you are using Coinbase. And yes, if you are using Coinbase (or whatever other KYC compliant platform), your privacy is basically non-existent.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8tdncc",
                                            "author": "BijuuSwerve",
                                            "score": 0,
                                            "created_utc": 1652706800.0,
                                            "response": "So how do i use bitcoin?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8tdz02",
                                                    "author": "TheGreatMuffin",
                                                    "score": 1,
                                                    "created_utc": 1652706965.0,
                                                    "response": "https://old.reddit.com/r/Bitcoin/comments/cjp2h9/crash_course_in_bitcoin_privacy_incl_reading/",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8tclox",
                    "author": "PedroCasonattii",
                    "score": 2,
                    "created_utc": 1652706259.0,
                    "response": "Your bitcoin is only private in a hard wallet. Nobody ever said your bitcoin is private with coinbase. If your BTC is coinbase, its coinbase who has your btc technically, not you. Hard wallet, other than that it is not private",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8tcq2q",
                            "author": "BijuuSwerve",
                            "score": 0,
                            "created_utc": 1652706319.0,
                            "response": "Oh,How can i learn about hard wallets?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8tjirq",
                                    "author": "blaze1234",
                                    "score": 2,
                                    "created_utc": 1652709620.0,
                                    "response": "HWWs are for security, as in theft protection.\n\nPrivacy is super difficult with BTC if you are truly a \"person of interest\" to government players.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8td0f6",
                                    "author": "PedroCasonattii",
                                    "score": 1,
                                    "created_utc": 1652706468.0,
                                    "response": "Youtube",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8td3zl",
                                            "author": "BijuuSwerve",
                                            "score": 0,
                                            "created_utc": 1652706520.0,
                                            "response": "K",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8tdwx5",
                    "author": "communomancer",
                    "score": 2,
                    "created_utc": 1652706935.0,
                    "response": ">\"the government nor can anyone else see you're activity with bitcoin\"\n\nWhoever is telling you that is full of it. It's possible to perform truly anonymous transactions, theoretically, but I would never get too overconfident about squaring off against forensic accountants.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8trk1g",
                    "author": "Nada_Lives",
                    "score": 2,
                    "created_utc": 1652713117.0,
                    "response": "Coinbase is not Bitcoin.\n\nCoinbase is a legacy fiat enterprise.\n\nCoinbase operates under the \"authority\".",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8tdk5x",
                    "author": "NiceDoctorBeam",
                    "score": 1,
                    "created_utc": 1652706754.0,
                    "response": "When the private keys are properly secured, nobody can confiscate your Bitcoin.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8tdogu",
                            "author": "BijuuSwerve",
                            "score": 1,
                            "created_utc": 1652706815.0,
                            "response": "How do i do this",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8thidy",
                                    "author": "NiceDoctorBeam",
                                    "score": 1,
                                    "created_utc": 1652708683.0,
                                    "response": "Most people use a good hardware wallet, then they properly back up their seed phrase.\n\nCreate two hand written copies,\n\nTriple check for accuracy. Use pencil, ink might fade. Protect the papers from moisture and insects.\n\nCarefully hide the copies in separate locations in case of fire, flood, etc.\n\nSafe deposit boxes are not secure enough. A home safe is too obvious in case of robbery/burglary. Think long and hard about your hiding places.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8thq4m",
                                            "author": "BijuuSwerve",
                                            "score": 1,
                                            "created_utc": 1652708784.0,
                                            "response": "I gotta research on hard wallets and all that lol.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8tpr74",
                                                    "author": "Oops-better-run",
                                                    "score": 1,
                                                    "created_utc": 1652712357.0,
                                                    "response": "Get a ledger nano s+ or ledger nano x, both are insanely good and you will not regret it!",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8tq4ju",
                                                            "author": "BijuuSwerve",
                                                            "score": 0,
                                                            "created_utc": 1652712515.0,
                                                            "response": "Alright, and i think i should keep the seed phrase in my phone notes which i can lock with a password.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8tq87w",
                                                                    "author": "Oops-better-run",
                                                                    "score": 1,
                                                                    "created_utc": 1652712559.0,
                                                                    "response": "No, don’t do that ever, never keep a seed phrase online",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i8tqa5f",
                                                                            "author": "Oops-better-run",
                                                                            "score": 1,
                                                                            "created_utc": 1652712580.0,
                                                                            "response": "Put it on the seed phrase handout that comes with a ledger and don’t put it absolutely anywhere online, locked or not",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        },
                                                                        {
                                                                            "id": "i8tqdpg",
                                                                            "author": "BijuuSwerve",
                                                                            "score": 1,
                                                                            "created_utc": 1652712622.0,
                                                                            "response": "Its not really linked to an account tho, its just in my digital notes as a local file. I dont think any thief would force me to open up my notes on my phone to them.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i8tqmah",
                                                                                    "author": "Oops-better-run",
                                                                                    "score": 1,
                                                                                    "created_utc": 1652712723.0,
                                                                                    "response": "It’s iCloud, it’s still safer to only keep it offline, why even chance it, you’ll never need to login using it and so you don’t need it for years probably or until you get a new ledger etc",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i8tqul1",
                                                                                            "author": "BijuuSwerve",
                                                                                            "score": 2,
                                                                                            "created_utc": 1652712820.0,
                                                                                            "response": "No its samsung notes on my note10 phone lol. Its nothing online",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "id": "i8tr4p3",
                                                                                    "author": "pink_raya",
                                                                                    "score": 1,
                                                                                    "created_utc": 1652712937.0,
                                                                                    "response": "not a good idea to keep it on anything connected to internet. this would make the hardware wallet useless. keep it offline, on a piece of paper or etched in steel.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i8trhqm",
                                                                                            "author": "BijuuSwerve",
                                                                                            "score": 1,
                                                                                            "created_utc": 1652713091.0,
                                                                                            "response": "I get what you're saying, but i have never in my 10 years of owning smart phones ever came across a virus or something of theft on my phones.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i8uejrw",
                                                    "author": "Beautiful-Relief-268",
                                                    "score": 1,
                                                    "created_utc": 1652722407.0,
                                                    "response": "Buy a metal wallet, it's fire proof",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8tg5cc",
                    "author": "CarbonCG",
                    "score": 1,
                    "created_utc": 1652708034.0,
                    "response": "The moment you buy btc on coinbase and send to your own wallet, a non-kyc wallet, such as paper or hardware - then technically no one can say you own those coins anymore. They can see clear as day where you sent coins to, but there’s no way of knowing if you paid for goods/services or just sent to new wallet to hodl forever.\n\nThe government can not access private wallets- when you hear of btc getting confiscated it’s because the feds found their private keys on laptop or something like that (silly criminals)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8tgrci",
                    "author": "swgo1",
                    "score": 1,
                    "created_utc": 1652708333.0,
                    "response": "Kinda....",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8tmzqb",
                    "author": "MrQ01",
                    "score": 1,
                    "created_utc": 1652711169.0,
                    "response": "No. It's a public blockchain. It's pseudo-anonymous because the blockchain itself doesn't require you provide your KYC, nor does it make your KYC visible. If you do interact with parties that do require KYC and they report it to the government, that's not a \"blockchain\" issue.\n\n \n\n>And after looking up what bitcoin is, im told that it's \"private\" and that\"the government nor can anyone else see you're activity with bitcoin\"\n\nEither your sources also mentioned the caveat of pseudo-anonymity, or you can consider the source as unreliable.\n\nJust to point out, this is no big secret hidden fact about Bitcoin. But it's good you worked it out despite your sources.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8tyr1l",
                    "author": "SmoothGoing",
                    "score": 1,
                    "created_utc": 1652716094.0,
                    "response": "Read the bitcoin privacy wiki.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8w80jt",
                    "author": "Suspicious-Cry-6756",
                    "score": 1,
                    "created_utc": 1652751176.0,
                    "response": "Bitcoin is not hidden not even if you keep on a cold wallet or any. You buy bitcoin for example through Binance and then transfer to your address so nope. There’s always a trace of what you are doing.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uqvjli",
            "title": "Bitcoin has one job, right?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uqvjli/bitcoin_has_one_job_right/",
            "author": "animavaleska",
            "created_utc": 1652706382.0,
            "score": 5,
            "num_comments": 8,
            "subreddit": "Bitcoin",
            "selftext": "So, I am seeking answers. I keep very good book of my actions, transactions, I keep track of the value, and I keep track of every tiny Satoshi or other Coin I own. All my crypto-activity is noted. It helps me stay calm and it also keeps me away from just doing dumb stuff because I have the barrier of noting it down (yes, it made me lose opportunity but it also prevented me from stupidity, so I personally am very happy).\n\nNow.\n\nA bit less than a week ago now (am still puzzled) I sent some BTC to the exchange because I wanted to trade for a coin I expect more upside of. Let's say, I had X BTC, and I sent X/2 to the exchange. Now what happened was, I didn't have X/2 in my Ledger-Wallet left, but X+X/2 BTC!! It just ADDED what I sent.... And also, my whole Ledger history adjusted everywhere with +X/2 !!\n\nI have SO MANY questions... And as said, I keep track very eagerly and I checked everything... And it is just as I described... I also checked the transaction stuff... There's NO additional transaction and the transaction numbers count up to what I *should* have (X/2) but still it shows me more.\n\nWhat should I do? I am afraid that if I send it to the exchange, it vanishes also what I *really* have left on my Ledger. Idk. I am very confused especially because it just casually adjusted the whole history.\n\nAm very very grateful for any help or advice. And thanks for reading!",
            "stickied": false,
            "comments": [
                {
                    "id": "i8tf5ir",
                    "author": "CarbonCG",
                    "score": 3,
                    "created_utc": 1652707546.0,
                    "response": "This is very strange, the only thing I can think of to explain is - the exchange messed up and send you a withdrawal instead of deposit which would be omega stupidity on their end..\n\nOn thing to just double check is your ledgers public btc address- just check on a few block explorers and if you see (more) btc than originally - you hit the jackpot xD\n\nIf you don’t see the (more) balance, it’s most likely an issue with ledger sync to your node.\n\nHappy to help investigate the blockchain if you wanna pm me your public btc address. (Ps never send anyone your private keys or anything remotely confidential)",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8xt0or",
                            "author": "animavaleska",
                            "score": 1,
                            "created_utc": 1652790883.0,
                            "response": "Oh yeah, checking the public address is a very good idea! Thank you, I'll try this!!\n\nAbout your guess on the exchange - that's pretty impossible since I signed and sent the Tx from the Ledger :') And also, I'd have an additional Tx which I don't have :') It's so strange.\n\nThank you very much for your help! :3",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8thrkz",
                    "author": "savinelli_smoker",
                    "score": 2,
                    "created_utc": 1652708803.0,
                    "response": "Try clear the cache of ledger live and let it sync again",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8tgtp2",
                    "author": "ndgoLiberty",
                    "score": 1,
                    "created_utc": 1652708364.0,
                    "response": "Re-sync your ledger. It doesn’t know how many bitcoin it has in it by design.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8tqel6",
                    "author": "Nada_Lives",
                    "score": 1,
                    "created_utc": 1652712632.0,
                    "response": "Bitcoin has one simple job: It reliably moves value from one spot on the chain to another. That is all!. Nothing else that you talk about here is a Bitcoin function.\n\nYou sent BTC to the exchange. Did they get it, yes or no?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8xtafz",
                            "author": "animavaleska",
                            "score": 1,
                            "created_utc": 1652791027.0,
                            "response": "Yes the title is sarcastic :D\n\nYes I got it on the exchange. The Tx worked fine!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8tdi3g",
                    "author": "SkipperJeff",
                    "score": 1,
                    "created_utc": 1652706724.0,
                    "response": "What exchange and what country?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8xtgaz",
                            "author": "animavaleska",
                            "score": 1,
                            "created_utc": 1652791117.0,
                            "response": "Won't tell you the country (somewhere in Europe), but the exchange is Coinbase (Pro)... But this shouldn't play into it at all since the Tx worked fine...",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "uqvm20",
            "title": "Spotted in the mall of Amstelveen, Netherlands. A Bitcoin/Crypto \"shop\"...",
            "url": "https://i.redd.it/duk1jnoo7uz81.jpg",
            "author": "AVirtualDuck",
            "created_utc": 1652706586.0,
            "score": 42,
            "num_comments": 15,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8tfqv4",
                    "author": "Sufficient_Tooth_949",
                    "score": 9,
                    "created_utc": 1652707836.0,
                    "response": "Interesting what do they actually sell? Is it just a crypto ATM or do they have shirts and hardware wallets or any physical goods?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8u9dyh",
                            "author": "Baron_NL",
                            "score": 2,
                            "created_utc": 1652720350.0,
                            "response": "I hear commercials of them daily on a business radio channel aswell. Never looked them up because it gives me a Robin Hood vibe.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8txbho",
                    "author": "NYKNYb",
                    "score": 3,
                    "created_utc": 1652715511.0,
                    "response": "Shitcoins advocates.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8tefz0",
                    "author": "ChavasRegal",
                    "score": 2,
                    "created_utc": 1652707199.0,
                    "response": "Sale now on!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8v7h96",
                    "author": "Walmart_Warrior_420",
                    "score": 2,
                    "created_utc": 1652734113.0,
                    "response": "The world famous Netherlands orange light district     ( ͡° ͜ʖ ͡°)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8v9m9d",
                    "author": "matador98",
                    "score": 2,
                    "created_utc": 1652734975.0,
                    "response": "Between these shops and all the super bowl commercials and celebrity endorsers, I think there are strong signs that Cypto has jumped the shark, much like pets.com during the tech bubble.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8u5ig8",
                    "author": "kytheon",
                    "score": 1,
                    "created_utc": 1652718827.0,
                    "response": "On one hand, it’s a step towards adoption. People passing by who can buy bitcoin as a impulse buy. On the other hand, the rates are probably really bad.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8xf1j1",
                            "author": "TheArabianNights",
                            "score": 1,
                            "created_utc": 1652781275.0,
                            "response": "You can't buy crypto, only trade it ....",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8xqvzw",
                                    "author": "kytheon",
                                    "score": 1,
                                    "created_utc": 1652789681.0,
                                    "response": "Trade it for what",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8xur27",
                                            "author": "TheArabianNights",
                                            "score": 1,
                                            "created_utc": 1652791802.0,
                                            "response": "You deposit fiat, exchange it for crypto, trade crypto for other crypto to make profit or losses, exchange your crypto for fiat, withdrawal fiat. \nYou CAN'T withdrawal crypto with these companies",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8xvd0c",
                                                    "author": "kytheon",
                                                    "score": 1,
                                                    "created_utc": 1652792121.0,
                                                    "response": "“Deposit fiat, exchange for crypto” sounds a lot like “buy crypto”. At a bakery I also deposit fiat and exchange it for bread.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8uy6vi",
                    "author": "fiercygoat",
                    "score": 1,
                    "created_utc": 1652730316.0,
                    "response": "This is so cool!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8w01bv",
                    "author": "TheArabianNights",
                    "score": 1,
                    "created_utc": 1652747180.0,
                    "response": "This is ONLY a trading platform, same as knaken and blox\nThey all advertise heavily everywhere in the Netherlands, but you CAN'T withdrawal your bitcoin. \nYou deposit fiat, buy crypto on their platform, sell your crypto for fiat, withdrawal fiat. \nThis shop is only an [information center](https://coinmerce.io/en/store/)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8xvoac",
                    "author": "TheArabianNights",
                    "score": 1,
                    "created_utc": 1652792287.0,
                    "response": "I was just explaining the process on their platform. You don't really buy crypto if you can't withdrawal them to your own wallet, here is the problem",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}