{
    "subreddit": "BitcoinBeginners",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uq2esb",
            "title": "Can exchanges “reverse” a BTC transaction in some way?",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/uq2esb/can_exchanges_reverse_a_btc_transaction_in_some/",
            "author": "Own_Ad_7321",
            "created_utc": 1652606752.0,
            "score": 6,
            "num_comments": 14,
            "subreddit": "BitcoinBeginners",
            "selftext": "So I am reading through the terms and conditions of the exchange that I am using atm. And I came across this section where they said they can \n\n“block, cancel, or reverse a Transaction you have authorized (even after Digital Assets and/or fiat currency have been debited from or credited to your Account)” if the government demands. \n\nI know BTC transactions are irreversible. So I am surprised why they have this statement🥲\n\nSo I am curious if somehow exchanges have some sort of way to reverse my transactions?\n\nI have withdrawn all my bitcoin from this exchange to my hardware wallet but I am worried they may “confiscate” it in the future.\n\nI am asking because the political climate in my country is about to get really bad and I criticize my government openly so Im worried they might “confiscate” of freeze my bitcoin.\n\nThank you in advance. Sorry if its a noob question😞😅✌🏽",
            "stickied": false,
            "comments": [
                {
                    "id": "i8ofm6h",
                    "author": "sciencetaco",
                    "score": 8,
                    "created_utc": 1652607624.0,
                    "response": "They cannot reverse a bitcoin transaction once it’s confirmed in your wallet. Nobody can! \n\nThey can probably cancel and reverse fiat transactions, as well as purchases and trades within their system. But a bitcoin transaction is irreversible. That’s the whole point!",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}