{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uybyho",
            "title": "Fat Protocol Thesis 🧩",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uybyho/fat_protocol_thesis/",
            "author": "Mallardshead",
            "created_utc": 1653583768.0,
            "score": 44,
            "num_comments": 11,
            "subreddit": "Bitcoin",
            "selftext": "If we think of Google, Amazon, Facebook, etcetera, as the applications of the internet, then we notice that the value accumulation is one-directional----->value flows from the base layer protocol (the internet) to its applications layer, thereby giving it tremendous value.\n\nWith bitcoin, we'll likely see value travel in the opposite direction, from the applications layer to the protocol layer (bitcoin).\n\nhttps://preview.redd.it/ytzv2km0ku191.jpg?width=1200&format=pjpg&auto=webp&s=c720c064ef7875b7eaf70e0c2a6c836a97f27602\n\nIn terms of crypto, the highest value use case for a coin or token is as **MONEY.**\n\nBitcoin is money. Stablecoins unfortunately are too. The problem there however, is that unlike bitcoin, stablecoins are a derivative of money (the USD). And the USD targets a stable price. In order to achieve this, you need central banks with complete authority and tools (debt, interest rates, printing, guns) to manipulate certain parts of the economy/world to achieve stability. It never works longterm. Bitcoin on the other hand doesn't target a stable price. It targets a variable price. It can control its ledger and issuance with the one-directional entropy of energy, and the free market decides the price. When it's absorbed enough trust (value), its confidence curve (volatility) will flatten. Nothing in the world will be able to compete with it. It's probably man's final money.\n\nStablecoins make up 85% of all altcoin protocol volume. This means nothing inside these altcoin protocols have established themselves as money except for stablecoins, and derivative versions of bitcoin (like the wrapped version).\n\nIf you take the Vitalik Buterin blockchain for example, its native token (starts with an E) is not money. It's a gas token required to ferry money and centralized dapp tokens around the blockchain. One of those forms of money it ferries around are stablecoins. And another form of money bitcoin (bitcoin, the wrapped version) is used to collateralize many dapps and structures. Both of these monies are hyper-centralized derivatives of the real version (USD and BTC).\n\nMy point is that the Vitalik Buterin chain suffers from a catastrophic flaw: its base layer is an IOU database, because ETH is not money, and is not the only thing that travels on its base layer. Tens of thousands of tokens do, and anyone that knows Solidity/Java can create one in <30 minutes. How does *fat protocol thesis* work here? It doesn't. The model is invalid.\n\nTake bitcoin though. It's a simple payment network. only bitcoin travels on that payment network. Above that is another layer. The Lighting Network ⚡️\n\nThe LN is not one thing. It's made up of several implementations (Core, LND, Eclair, etc) and they all work together by following what's called BOLT spec. The LND implementation of Lightning announced recently that they'll build support for stablecoins on and spec it. This is admittedly controversial to some, but is something I not just welcome but encourage. Remember, bitcoin is the base layer, and only bitcoin travels on that base layer. In fact, you can put anything on the LN: shitcoins, stablecoins, cbdc's, milk, sex, anything that has a MONEY value. I welcome all of it. The reason I do is because:\n\nEVERYTHING GETS SETTLED IN BTC\n\nAnd this is precisely how bitcoin will emerge as the ultimate collateral. Collateral is money. It'll be the asset that every other asset, product, and service is ultimately settled in and against, even if users don't know it or see it. That's where the USD peg and all fiat pegs for that matter disintegrate and flip, as the bitcoin's circular economy augments. The price of the bitcoin network then becomes quite obvious:\n\n# ∞/21M\n\nAbsorbing the value of everything. The infinity symbol we maxi's use because new goods and services can always be added to the economy.\n\nhttps://preview.redd.it/2n3o7rk0iu191.jpg?width=526&format=pjpg&auto=webp&s=551cb07281d307700d7f667c325eac0aca2f6666\n\nBitcoin connects everything. The internet of money. That means that unlike Visa, Amex, PayPal, Western Union, Twilio, etcetera--which are all discrete networks that are not operable with one another, are permissioned, regulated, and connected to banks--everyone will use the same network, the Lightning Network. The LN is what unleashes the unit-of-account or *medium of exchange* part of bitcoin's collateral by scaling it to light speed, instant settlement, and near zero cost to the world. Most of the new 1B users won't know they're even using the network anymore than they do HTTP when web browsing, it'll just disappear into the internet stack. And like I learned in El Salvador amongst the locals, that unit-of-account which we call sats, will just be called bitcoin. 1000 sats will be 1000 bitcoin, whole coins won't be a thing, which is the power of an asset repricing itself.\n\nI'll use $ in the example below because that's the base layer everything is settled in currently:\n\nAll Alice knows is she just sent $25 in value with a click from her Chase app, and seconds later Bob receives a notification that his Muun wallet received $25, then hands the strawberries from the farm stand to Alice. Bob waves goodbye, and with the app still open, he sends the $25 to his father in Zimbabwe to pay his phone bill which his father uses for an OnlyFans membership, which the performer uses to pay her Netflix, which pools it with other money to pay the kid in India in a small village with computer skills they hired remotely to code the color grading API for their editing studio in Brooklyn. All that's required for anybody in the world to get started is a free mobile app. Tap a button and you're banked.\n\nSo all the value moving ABOVE the base layer ultimately gets settled on the base layer, MONEY, which is also deflationary like the internet at large. The internet for example, shoehorned entertainment, libraries, universities, and the whole of known human history into small hard drives and servers, creating an overabundance of information. The internet of money will create an overabundance of goods and services OUTSIDE the money. One reason is because in the digital realm, the technology surrounding bitcoin will always trend towards its cost of production as information--which is close to zero. And partly because the part of the network tethered to the physical world (PoW) will create an overabundance of energy which will drive the cost of many assets to their utility value.\n\nI think this is how *fat protocol thesis* will play out for bitcoin. 🤷‍♂️",
            "stickied": false,
            "comments": [
                {
                    "id": "ia3tht7",
                    "author": "Geoknysis",
                    "score": 7,
                    "created_utc": 1653594510.0,
                    "response": "Honestly, this is the most mind blowing post I've read on Redit about Bitcoin, ever. The insight you have to the value and utility the network of Bitcoin has is just second to none. Well done!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia6ucaa",
                            "author": "Mallardshead",
                            "score": 1,
                            "created_utc": 1653657441.0,
                            "response": "🙏 Thx. What a complement. Humbled.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia7kjpd",
                                    "author": "Geoknysis",
                                    "score": 1,
                                    "created_utc": 1653668689.0,
                                    "response": "Seriously, though! So many people focus on the Bitcoin \"coin\" but the true value is in the network utility. You broke it down perfectly!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia4c8xc",
                    "author": "sciencetaco",
                    "score": 7,
                    "created_utc": 1653602568.0,
                    "response": "Please keep writing more posts like this!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia6fnks",
                    "author": "laggyx400",
                    "score": 2,
                    "created_utc": 1653648668.0,
                    "response": "Someone gets it! \n\nPeople don't need to understand Bitcoin or even know they're using it. Bitcoin enthusiasts will understand, maintain, and build out this future so the world at large doesn't have to. That's why I don't fear, but welcome, custodial solutions built on top of lightning. The decentralized layers underneath isolate the damage they can do outside of their reach while allowing them to interact with others in a trustless manner. Companies will have to open their walled gardens to interact with others or be left behind.\n\nPoW will allow energy producers to build projects that would otherwise have been unprofitable for long time frames. As halfenings occur, it'll free up that built out energy production for an even cheaper rate. The miners act as buffers to keep production at near 100% load, instantly available when needed elsewhere.\n\nIt will shape our world for the better.\n\nUgh, E just eats itself every time it tries to play money and copy Bitcoin in a way to raise it's value. It's useful value is inverse to it's price value. The more it makes it's holders, the more it drives it's users away. It's value will be trapped in that balance and need inflation to stay relevant.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia6us9z",
                            "author": "Mallardshead",
                            "score": 1,
                            "created_utc": 1653657653.0,
                            "response": "Couldn't agree more. Excellent summary.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia6k263",
                    "author": "SeanyBlaze",
                    "score": 2,
                    "created_utc": 1653651713.0,
                    "response": "Thank you! Great post 🙏",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia6ylp8",
                    "author": "pazsworld",
                    "score": 2,
                    "created_utc": 1653659461.0,
                    "response": "My man! \n\nMallard once again articulates the nuances and esoteric beauty of BTC moving forward.\n\n&#x200B;\n\nCheers",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia6yzof",
                            "author": "Mallardshead",
                            "score": 2,
                            "created_utc": 1653659642.0,
                            "response": "Thx! 🆖🆙⤴️ Let's stack these cheap sats!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia5vmx2",
                    "author": "sangderenard",
                    "score": 2,
                    "created_utc": 1653631650.0,
                    "response": "There are ways in which reading this articulated plainly causes me to feel like I can breathe freely, seeing a glimpse at the potential future.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}