{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "usc1rx",
            "title": "Were people in the past skeptical about stocks?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/usc1rx/were_people_in_the_past_skeptical_about_stocks/",
            "author": "Abdla32",
            "created_utc": 1652877873.0,
            "score": 1,
            "num_comments": 23,
            "subreddit": "Bitcoin",
            "selftext": "As bitcoin is a relatively new type of investment, I got a question.\n\nWhen stocks were a new idea/investments is there any history of people being skeptical/hesitant about it?",
            "stickied": false,
            "comments": [
                {
                    "id": "i92hpac",
                    "author": "usernamewastaken5",
                    "score": 11,
                    "created_utc": 1652879140.0,
                    "response": "I don't know what everyone is talking about\n\nPeople are STILL sceptical about stocks if they aren't educated on the subject",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i92mk4x",
                    "author": "Live-Law-5146",
                    "score": 2,
                    "created_utc": 1652881478.0,
                    "response": "Yes to some degree, when you did not have online brokers that you could just click through create accounts, transfer money and buy directly in your browser or mobile app. Even when the banks came online it was a hassle with getting the stock prices to put a market/limit order and most bought with the banks offerings which had spread. Before that it was even worse, where you had to buy the stock paper form and store safely - the exchanges were literally people yelling with paper slips across a room.  \nThe barrier of entry for investing in stocks have been almost entirely eliminated and you see way more retail investors i 2022 than in 1992. \n\n  \nI believe the cryptospace will be the same - we will get a better regulation (which hopefully will not be too restrictive), the spread/commission fees on exchanges will optimize, taxation law on crypto will become more fair and easier to report etc. - the barrier of entry will go down and more people can start investing. At the same time, the technology and market will mature and it will become less volatile, making more people willing to risk having assets allocated in the space.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i92gku0",
                    "author": "redhtbassplyr",
                    "score": 1,
                    "created_utc": 1652878573.0,
                    "response": "Not really because it wasn't a foreign concept even when the stock market was created. People commonly invested in people's businesses privately well before the stock market and the only thing that changed then it was easier to do so through a network and a broker to buy on the New York stock exchange instead of having to meet up with every investor. NYSE basically just facilitated and consolidated investors to shop at one place but was overly familiar to businessmen at this point. Take for instance the Dutch East India company for example that controlled and held the monopoly on trade for decades back in it's prime. The stock market wasn't established by any means, but investors waited in line to become shareholders and ride the wave of success and this was back in the 16th century. \n\nPlus stocks in general are pretty easy to understand as they are representative of a portion of control and ownership of the underlying company. Bitcoin is by no means a company and you don't own a share of any income earning business so it's very much less understood to most investors.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i92lgxo",
                            "author": "mossgathering",
                            "score": 1,
                            "created_utc": 1652880963.0,
                            "response": ">Plus stocks in general are pretty easy to understand as they are representative of a portion of control and ownership of the underlying company.\n\nI bet if you asked 100 random people on the street to describe what stocks are in their own words, fewer than 10 would reveal this level of understanding.  Ask them how the current price of any particular stock is determined, and you'll probably hear lots of them say, \"the stock exchange sets it,\" \"the government,\" or similar nonsense.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i92lut1",
                                    "author": "redhtbassplyr",
                                    "score": 1,
                                    "created_utc": 1652881147.0,
                                    "response": "So I should have said pretty easy to understand if you educate yourself and give it the time and effort to do so. There's people that still don't understand the concept of money nonetheless stocks. Totally get that and I wouldn't argue anything different. That was besides the point I was trying to make anyways but yes you're correct",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i92hkck",
                            "author": "Hank___Scorpio",
                            "score": 0,
                            "created_utc": 1652879072.0,
                            "response": "The type of person you're describing probably would have understood bitcoin with just as much relative ease. During the dotcom boom many people were trying to put internet stocks into the same ideallogical categories as people are doing now with crypto. They didn't understand the internet and absolutely railed against anyone calling it investing. To absolutely no one's shock the words speculative and gambling were abound.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i92ilyh",
                                    "author": "redhtbassplyr",
                                    "score": 2,
                                    "created_utc": 1652879592.0,
                                    "response": ">They didn't understand the internet and absolutely railed against anyone calling it investing\n\nEven though the internet was an unfamiliar concept investors were still investing in companies which was familiar to them. As opposed to Bitcoin which doesn't offer any hint of familiarity. Still not a great apples to apples analogy here. \n\nThis pattern has happened time and again while Bitcoin is something totally different. Investors that invested in the first railroad in America hadn't seen and didn't understand the concept of what a steam locomotive train looked like, because they didn't have to. All they had to know was they were investing in a business that found a new means of transportation to transport goods faster and safer through America's heartland. Again with Bitcoin the concept is just unfamiliar because it's not a business so investors don't understand the underlying technology and it's not a business so then they are left asking well what am I investing in.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i92ir70",
                                            "author": "Hank___Scorpio",
                                            "score": 0,
                                            "created_utc": 1652879665.0,
                                            "response": "We just gonna do the dance where you pick one imaginary example that suits your argument and assume that's the norm?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i92kzy7",
                                                    "author": "redhtbassplyr",
                                                    "score": 2,
                                                    "created_utc": 1652880739.0,
                                                    "response": "One is a business one is not. If you don't understand why some investors would be hesitant to invest in something that is not a business that I'm not sure what to tell you. That is in fact true I'm not saying that you won't find investors that are willing to take the plunge into something that is totally a new foreign concept, but I'm not sure how you don't understand why people would be hesitant to become investors. \n\nWarren Buffett did say that he would not invest in Bitcoin because Bitcoin is \" probably rat poison squared\" ..... If this is not evidence of a well-known investor that is hesitant to invest in Bitcoin because it's not a business like he's used to then I don't know what more evidence you need.\n\nI fully believe in Bitcoin and own a good bit. I'm an investor but that doesn't mean I can't put my self in someone else's shoes that doesn't have the same open mindness that I do and figure out reasons they would be hesitant",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i92l85b",
                                                            "author": "Hank___Scorpio",
                                                            "score": -1,
                                                            "created_utc": 1652880848.0,
                                                            "response": "Ah I see what you're doing. You're imagining everyone is you. Classic.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i92n5ze",
                                                                    "author": "redhtbassplyr",
                                                                    "score": 1,
                                                                    "created_utc": 1652881759.0,
                                                                    "response": "\n\nHypothetical scenario for ya. \n\nGo up to 100 people that have 401k portfolios.\n\nTell them to:\n\n 1) add the company AMD to their portfolio in the amount of $5,000 because it's a great computer company with good GPU products coming out in the next 5 years and this is the time to buy\n\n\n2) add $5,000 a Bitcoin to your portfolio, because it's a decentralized currency that is deflationary and will provide you insurance against inflation and is controlled by the people and cannot be manipulated by the government printing money\n\n\nOut of those 100 people hypothetically speaking do you think it's easier to convince them to becoming an investor and agree to option 1 or do you think it's easier to convince them of option 2?\n\nAll I'm saying is to most people it would be easier to convince of option 1. That's it and you're reading too much into it otherwise and seemingly taking offense for some reason. Sorry if I have offended you",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i92prvw",
                                                                            "author": "Hank___Scorpio",
                                                                            "score": 0,
                                                                            "created_utc": 1652882941.0,
                                                                            "response": "You're gonna play iq dick waving after misinterpreting OP's question from is there a history of people being skeptical to which is easier for investors to understand?",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i92q11r",
                                                                                    "author": "redhtbassplyr",
                                                                                    "score": 1,
                                                                                    "created_utc": 1652883056.0,
                                                                                    "response": "I answered OPs question in my first comment. See above. Live long and prosper 🖖",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i92qevy",
                                                                                            "author": "Hank___Scorpio",
                                                                                            "score": 0,
                                                                                            "created_utc": 1652883231.0,
                                                                                            "response": "From ad hominem to passive aggressive exit. Go get em champ.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i92fegt",
                    "author": "CJohnstone90",
                    "score": 0,
                    "created_utc": 1652877961.0,
                    "response": "Bitcoin is 13 years old..",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i92v8jv",
                            "author": "SirSkittles111",
                            "score": 1,
                            "created_utc": 1652885313.0,
                            "response": "Which is relatively new...",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i92y66c",
                                    "author": "CJohnstone90",
                                    "score": 1,
                                    "created_utc": 1652886531.0,
                                    "response": "Which would make Tesla, amazon, twitter etc or pretty much anything that’s “in” relatively new as well.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9333cq",
                                            "author": "wkw3",
                                            "score": 1,
                                            "created_utc": 1652888550.0,
                                            "response": "If Tesla, Amazon, and Twitter were the very first stocks, this would be a good point.\n\nIt's more like the first time the Dutch East India company offered shares.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i933496",
                                            "author": "SirSkittles111",
                                            "score": 1,
                                            "created_utc": 1652888561.0,
                                            "response": "Nobody is talking about individual companies. OP is only talking about the idea of stocks as a whole which has been around for 100s of years\n\nStop being pedantic",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i92gg41",
                    "author": "Rockstonerable",
                    "score": 1,
                    "created_utc": 1652878506.0,
                    "response": "People are always sceptical about new things",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i92uuqw",
                    "author": "Far-Answer1623",
                    "score": 1,
                    "created_utc": 1652885151.0,
                    "response": "I wouldn't think they would have been as skeptical as people are with Bitcoin.  I imagine the first stocks were actual physical assets like flour, wheat, banks, sugar, oil, railroads and so on.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i933dnm",
                    "author": "XXsforEyes",
                    "score": 1,
                    "created_utc": 1652888666.0,
                    "response": "People are STILL skeptical about stocks.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "usc56l",
            "title": "Estate planning",
            "url": "https://www.reddit.com/r/Bitcoin/comments/usc56l/estate_planning/",
            "author": "Cryptorich13",
            "created_utc": 1652878176.0,
            "score": 3,
            "num_comments": 13,
            "subreddit": "Bitcoin",
            "selftext": "I met with an attorney yesterday to go over estate planning, but even he didnt have a good answer for passing on my private keys, so I came up with this idea.\n\nSplit my 24 word private key into 4 groups of 6 words. \n\nLeave 6 words with my mother, Leave 6 words with my attorney, leave 6 words in my safe (out of order)\n\nGive my executor 6 words (in order) as well as my 25th word (Trezor). Give executor the correct order of my 6 words in my safe, the 6 words with my mother, the 6 words with my attorney. \n\nAll the words will be sealed in an altoids can type of thing, inscribed on cryptosteel and welded shut (so it must be ground open upon my death).\n\nIn the event of my death, my executor, lawyer, and mother are to give all the words to the executor and then he can execute my will per my wishes. \n\nAnyone else have a better idea? \n\nWhat do people with 6-7 figs do to ensure their crypto passes on in the event of their death?",
            "stickied": false,
            "comments": [
                {
                    "id": "i92k0dz",
                    "author": "stoic_goat_",
                    "score": 7,
                    "created_utc": 1652880266.0,
                    "response": "You should definitely make a treasure map.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i92lhza",
                            "author": "NomDeGuerrePmeDeTerr",
                            "score": 2,
                            "created_utc": 1652880977.0,
                            "response": "Lol, excellent comment",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i92xrug",
                    "author": "explosive_diahrrea",
                    "score": 2,
                    "created_utc": 1652886366.0,
                    "response": "would advise against splitting your keys that way; look up shamir's secret sharing.  That makes it a bit more robust if by some circumstance someone else in the group dies, the whole seed doesn't get rendered invalid.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i92hdip",
                    "author": "gsurfin",
                    "score": 2,
                    "created_utc": 1652878978.0,
                    "response": "Seems overly complicated to me. If you have 6-7 figures in crypto why not just get a safety deposit box and keep your phrase there. Hell you could even back your keys up on another Trezor/ledger and store it in there as well.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i92imnm",
                            "author": "mossgathering",
                            "score": 3,
                            "created_utc": 1652879602.0,
                            "response": "Safe deposit boxes are not nearly as safe as you might think.    \nhttps://www.cbc.ca/news/business/safety-deposit-boxes-missing-contents-1.5814592  \nhttps://www.nytimes.com/2019/07/19/business/safe-deposit-box-theft.html  \nhttps://www.nbclosangeles.com/news/safe-deposit-box-theft-missing-items-wells-fargo-bank/2112715/",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i92lmez",
                    "author": "NomDeGuerrePmeDeTerr",
                    "score": 1,
                    "created_utc": 1652881035.0,
                    "response": "Work with a corporate trustee?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i92ohnn",
                    "author": "sug-on_deez",
                    "score": 1,
                    "created_utc": 1652882362.0,
                    "response": "This you 🤓?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i93641u",
                    "author": "Big_mer_no_nose",
                    "score": 1,
                    "created_utc": 1652889781.0,
                    "response": "Look at institutional custody like Bitgo - super safe and you can control your keys so that even if Bitgo goes under you still have control of your assets.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i954kbf",
                    "author": "whitslack",
                    "score": 1,
                    "created_utc": 1652919525.0,
                    "response": "Dead man's switch. Just give each of your heirs a fresh private key (e.g., an unused paper wallet). Create a signed, timelocked transaction that spends your whole stack and pays out to your heirs in whatever amounts you wish. Set the timelock conveniently far in the future, such as for one year. Keep the signed transaction among your personal effects, such that you will notice if it's been disturbed. Halfway to the timelock expiry, destroy the transaction and create a new one with a fresh timelock. As long as you remain alive, the signed transaction in your possession will never be valid. After you die, your heirs will have to wait until the timelock expires, and then they can broadcast your signed transaction to receive the payouts that you intended. Periodically check in with your heirs to confirm that they haven't lost the keys you gave them. If you move (or add to) your stack, then you'll need to replace your signed transaction. If you find or suspect that your signed transaction has been compromised, then you should move your stack to a new address and replace the signed transaction.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9554j4",
                            "author": "Cryptorich13",
                            "score": 1,
                            "created_utc": 1652919791.0,
                            "response": "God damn thats genius but how the fuck do I do that?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i955kza",
                                    "author": "whitslack",
                                    "score": 1,
                                    "created_utc": 1652920009.0,
                                    "response": "The `bitcoin-tx` tool that comes with Bitcoin Core can do everything necessary to implement this strategy. It's mostly standard offline-transactions stuff. The only unusual bit is that the `nLockTime` field in the transaction is utilized.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i955xll",
                                            "author": "Cryptorich13",
                                            "score": 1,
                                            "created_utc": 1652920175.0,
                                            "response": "All I know is trezor, my dude. I need to learn more.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9564zv",
                                                    "author": "whitslack",
                                                    "score": 1,
                                                    "created_utc": 1652920272.0,
                                                    "response": "I've never used a Trezor, but using a Trezor to sign a time-locked transaction should be exactly the same as using a Trezor to sign an ordinary transaction. So I think your only hurdle to clear is figuring out how to construct the unsigned, time-locked transaction that you can then feed to your Trezor for signing.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}