{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uv95ba",
            "title": "Bitcoin Slump in Thailand: Crypto Company Incurs Massive Loss, More Downtrend Coming?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uv95ba/bitcoin_slump_in_thailand_crypto_company_incurs/",
            "author": "Raelynn765",
            "created_utc": 1653219259.0,
            "score": 16,
            "num_comments": 4,
            "subreddit": "Bitcoin",
            "selftext": "Thailand’s Jasmine Technology Solution Plc, the telecom-turned-crypto company, according to CoinQuora news today has lost more than a third of its value in the past month as confirmed by Bloomberg. The tech firm’s market capitalization has been cut down to 260 billion baht (US$7.6 billion) in the crypto crash of last week. The massive loss has also affected the firm’s biggest shareholders.  \n\n The Bangkok-based tech giant cashed in on the digital asset uproar and rapidly soar to become the 10th most-valuable company on the Stock Exchange of Thailand. It was on its way to becoming the largest Bitcoin farm in Southeast Asia. However, the current Bitcoin crash caused the company to suffer a massive setback.  Nevertheless, this is not an isolated incident. \nCoinbase founder Brian Armstrong’s fortune plummeted more than $11 billion to $2.2 billion in just a matter of six months. CEO of Galaxy Digital Michael Novogratz also lost $6 billion.\n\n  However, the situation is looking slightly better this week with a few coins like Kucoin Token(KSC), Bobcoin and Harmony making a marked upward movement. \n\nThe crypto community hopes that the circumstances will be better and go back to the previous state soon. Do you feel the market will be more bearish for a while?",
            "stickied": false,
            "comments": [
                {
                    "id": "i9jxjr9",
                    "author": "Outrageous_Depth_202",
                    "score": 1,
                    "created_utc": 1653219955.0,
                    "response": "👍🏻👍🏻",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9jxuje",
                    "author": "baconbitz0",
                    "score": 1,
                    "created_utc": 1653220175.0,
                    "response": "🖖",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}