{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "urjx80",
            "title": "Despite the Ban, China Is Still the Second Largest Bitcoin Miner",
            "url": "https://ccnews24.net/despite-the-ban-china-is-still-the-second-largest-bitcoin-miner/",
            "author": "MK333666",
            "created_utc": 1652785423.0,
            "score": 44,
            "num_comments": 8,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8xkxei",
                    "author": "Longjumping-Tie7445",
                    "score": 11,
                    "created_utc": 1652785904.0,
                    "response": "Just wait until they ban it later this year.  Then the numbers will come down. 😂",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8xl7np",
                    "author": "coinfeeds-bot",
                    "score": 3,
                    "created_utc": 1652786104.0,
                    "response": "tldr; The annual Bitcoin Electricity Consumption Index (CBECI) has shown that China still holds its position among the biggest miners and ended up only second to the US. The data shows that while the country’s share was reduced to 0% in July and August, following the ban, it was back to 22% in September, and is averaging around 21%.\n\n*This summary is auto generated by a bot and not meant to replace reading the original article. As always, DYOR.*",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8yd846",
                            "author": "Bitcoin__Hodler",
                            "score": 4,
                            "created_utc": 1652800204.0,
                            "response": "> The data shows that while the country’s share was reduced to 0% in July and August, following the ban, it was back to 22% in September, and is averaging around 21%.\n\nI pointed this out couple months ago. There was always a big amount of hashing left, miners didn´t switch it back on in September. Miners are using VPSs to hide their traffic.\nA website that states China has 0% of the global mining is not reliable. \nThe Cambridge Bitcoin Electricity Consumption Index is a scam with false data.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8y0iiv",
                    "author": "VitalBrazil88",
                    "score": 4,
                    "created_utc": 1652794677.0,
                    "response": "There's always gonna be bitcoin mining in China, otherwise, China FUD would stop working.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8xtamg",
                    "author": "VPNApe",
                    "score": 3,
                    "created_utc": 1652791030.0,
                    "response": "Well, yeah. I imagine the ban was just a way to make sure xi & friends get their cut or take total control of operations. \n\nY the fuq would they stop something that makes money",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8yr7zi",
                    "author": "jimmajamma4",
                    "score": 2,
                    "created_utc": 1652805961.0,
                    "response": "Didn't they get the memo.  Bitcoin mining is banned in China",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8zstrb",
                    "author": "bitusher",
                    "score": 1,
                    "created_utc": 1652821315.0,
                    "response": "That is the principle reason bitcoin uses electricity in its PoW algo as it is available all over the world in many different forms and cannot be stopped easily with any regulation. Regulations like we saw in china only strengthened the bitcoin network as it shutdown some larger ASIC farms and spread those ASICs all over china and elsewhere in a much more distributed matter . A typical ASIC will use ~3-4k watts which is well within the variance of normal household usage so as long as a home is using 3 or less ASICs they won't be easily found by regulators looking at the power grid.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ybhj9",
                    "author": "I-Know-What-To-Do",
                    "score": 0,
                    "created_utc": 1652799474.0,
                    "response": "Chicki Di Cha Chinese Chicken. Chicki Di Cha Chinese Chicken.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "urjy2s",
            "title": "Let's stop apologising for Bitcoin energy use or compare it to the banking industry. Bitcoin is good for the environment.",
            "url": "https://i.redd.it/2f0vzbt7q0091.png",
            "author": "JunoKat",
            "created_utc": 1652785504.0,
            "score": 27,
            "num_comments": 27,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8xp55l",
                    "author": "BrocoliAssassin",
                    "score": 15,
                    "created_utc": 1652788653.0,
                    "response": "There’s also another big one. The war for the dollar. Let me know when we are going to bomb other countries once they stop using Bitcoin…",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8yxcgz",
                            "author": "Crawlero",
                            "score": 3,
                            "created_utc": 1652808421.0,
                            "response": "What does backing bitcoin cost?  Electricity and some asics.  What does backing the dollar cost?  Several wars and more civilians murdered than the holocaust.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8z4frm",
                                    "author": "Basilides_the_false",
                                    "score": 1,
                                    "created_utc": 1652811272.0,
                                    "response": "War is the only thing now that justifies fiats existence. They rest in glitter cannons and unicorn farts.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8y709q",
                    "author": "BigDeezerrr",
                    "score": 6,
                    "created_utc": 1652797582.0,
                    "response": "Consumption is something that gets overlooked. Fiat systems incentivize constant consumption and discourage savings. How can you even measure the impact on the environment due to coerced consumption?\n\nInterested to see how the housing market would be impacted by a move to sound money. Everyone is looking to get rid of their cash and real estate has been massively inflated as a result. If people could just save their money and it wouldn't lose value would the housing market be the way it is right now?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8yesk7",
                            "author": "Altruistic-Sir-6329",
                            "score": 2,
                            "created_utc": 1652800865.0,
                            "response": "Was thinking about a rough way to measure this. Before we went off the gold exchange standard, the personal savings rate was trending upward to the 9-10% range. Under the fiat standard, the personal savings rate trended downward (besides the 2008 recession and pandemic). If we put the savings rate under the fiat standard at 4-5% (which is being conservative given the trajectory), then it's fair to say that the Bitcoin standard would reduce consumption by at least 5%. \n\nFurther, the personal saving rate does not take into consideration debt accumulated. Currently, median household debt is $59,800. Household debt as a percentage of GDP hovers around 80% vs. 40% in the 1970s. The reversal of this debt accumulation would reduce consumption by an even larger amount than 5%.\n\nCurrent PCE (Personal Consumption Expenditures) sits at almost $17T, 5% of that value would be $0.85T. Not to mention, this is not a one-off event, but a persistent drop in consumption as we transition. I would think this would be every environmentalists' wet dream.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8zxqu2",
                            "author": "Dazzling_Marzipan474",
                            "score": 1,
                            "created_utc": 1652823413.0,
                            "response": "https://cointelegraph.com/news/banking-system-consumes-two-times-more-energy-than-bitcoin-research\n Old article ( 1 year ago) just grabbed the 1st one I saw bc I don't have much time rn. But you get the point",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8xmzuq",
                    "author": "Fun_Square_8737",
                    "score": 10,
                    "created_utc": 1652787297.0,
                    "response": "Funny how critical people become of environmental damage when it’s comes to Bitcoin . It uses a significantly less amount of energy than already widely accepted things . Gets attacked for no reason",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8ykg5t",
                            "author": "h0twired",
                            "score": 1,
                            "created_utc": 1652803201.0,
                            "response": ">It uses a significantly less amount of energy than already widely accepted things\n\nDo you have some way to accurately quantify this statement?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8yobx3",
                                    "author": "Just1_More",
                                    "score": 3,
                                    "created_utc": 1652804804.0,
                                    "response": "Give [this a read](https://www.lynalden.com/bitcoin-energy/)",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8xtlu0",
                    "author": "VPNApe",
                    "score": 2,
                    "created_utc": 1652791201.0,
                    "response": "The west could switch entirely to renewables in just a handful of years. It's not difficult especially when nuclear energy is a thing.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ynll4",
                    "author": "battle-shark",
                    "score": 2,
                    "created_utc": 1652804508.0,
                    "response": "Regardless of how you feel about Bitcoin as a concept, worrying about energy use is just such a bad faith argument. The real issue is emissions and if we want to reduce those, the simplest way is to increase the grid’s percentage of renewable generation. This has the added benefit of reducing emissions for literally everything else connected to the grid as well. \n\nIt’s the same bad faith argument used for plastic waste. By putting responsibility on the consumer you shift the blame away from the manufacturer.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8yvyec",
                    "author": "Adamsd5",
                    "score": 1,
                    "created_utc": 1652807869.0,
                    "response": "This page shows a historic breakdown from 1800 to 2019 of energy consumption by source:\nhttps://ourworldindata.org/energy-mix\n\nFrom 2009 to 2019, global consumption went from 145,881 TWH to 173,340 TWH.  An increase of 27,459 TWH.  188 of that was bitcoin mining.  \n\nBitcoin mining is currently around 0.1% of consumption, and accounts for about 0.6% of the energy consumption increase in the past 10 years.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8z66o7",
                    "author": "apexisalonelyplace",
                    "score": 1,
                    "created_utc": 1652811988.0,
                    "response": "“Bitcoin is good for the environment” is a stupid thing to say. You can lie to yourself but fundamentally wrong. I love btc and all it does but to say this is a lie and doesn’t help the narrative. \n\nIf you want to say that the extreme energy usage will drive the switch to renewable energy, then that’s a different conversation. Keep it real \n\nDownvote me all you want your echo chamber doesn’t change reality.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8zfqwj",
                    "author": "metalzip",
                    "score": 1,
                    "created_utc": 1652815895.0,
                    "response": "galaxybrain.jpg - fuck the alleged human-made large change in global temperature trends\n\nredditors will seethe.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8zgxxq",
                    "author": "NYKNYb",
                    "score": 1,
                    "created_utc": 1652816383.0,
                    "response": "Renewable energy does not exist.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8zxvde",
                    "author": "WikiRando",
                    "score": 1,
                    "created_utc": 1652823468.0,
                    "response": "When someone brings up Bitcoin's energy use as an issue I immediately know that they know nothing about Bitcoin",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i901dac",
                    "author": "DownvoteKink",
                    "score": 1,
                    "created_utc": 1652825009.0,
                    "response": "Uses the energy of a small country to produce 7 transactions a second, max.  That's the most inefficient processor ever invented.  Could have done that for a billionth the cost on an Apple I in 1977.\n\nBitcoin is cancer.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8xypee",
                    "author": "h0twired",
                    "score": -1,
                    "created_utc": 1652793799.0,
                    "response": "How exactly does BTC encourage savings?\n\nBeing volatile to the point where one is scared to spend it, is not a positive trait for a currency.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8y6l8c",
                            "author": "phikapp1932",
                            "score": 3,
                            "created_utc": 1652797397.0,
                            "response": "No, the idea is because it’s “deflationary” in nature, that holding it will generate more value over time, so you’re encouraged to hold it. Whereas the dollar is inflationary and loses value yearly, so you’re encouraged to spend it.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8yai5i",
                                    "author": "h0twired",
                                    "score": 1,
                                    "created_utc": 1652799062.0,
                                    "response": "How is it inherently deflationary?  \n\nWhat is the guarantee that the line will go up?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8ydimr",
                                            "author": "phikapp1932",
                                            "score": 2,
                                            "created_utc": 1652800328.0,
                                            "response": "There is no guarantee that the line will go up. There is only a guarantee that there will only ever be 21million BTC in existence, while there is no upper limit to how many US dollars there are in existence. Thus, like physical gold, bitcoin is inherently deflationary. That does not mean it is guaranteed to increase in value. It only means that given a static set of conditions, it is mathematically true that it will not lose value based on available supply.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8yik0y",
                                                    "author": "TBirdyTom",
                                                    "score": 2,
                                                    "created_utc": 1652802424.0,
                                                    "response": "You do realise the value of something is only whatever value people give it? Scarcity does not make something valuable unless it is desirable (generally for a use). What happens when Bitcoin is no longer desirable?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8ywwll",
                                                            "author": "phikapp1932",
                                                            "score": 1,
                                                            "created_utc": 1652808247.0,
                                                            "response": "Scarcity is one of the four pillars of what makes something intrinsically valuable. Of course, something is only as valuable as what people think it’s worth. That’s true for everything. I’m not really sure what your point is, because all I’m saying is bitcoin is inherently deflationary while the US dollar is inherently inflationary. And this trait makes it so that people are not pressured to spend their bitcoin now, because it will not be devalued by introducing more supply in the future. Whereas the US dollar is devalued yearly through inflation…this makes people spend money now because it’s *guaranteed* to be worth less in the future. Im not even speculating on bitcoin’s true value.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8z0j3c",
                            "author": "Crawlero",
                            "score": 2,
                            "created_utc": 1652809688.0,
                            "response": "In an inflationary system, you have to always weigh investments against the rate your money devalues.  In a deflationary system, you weight investments against the rate your money increases in value.  If you were confident in company x making you money then you would want to invest in it without inflation, with inflation you might invest in company y knowing you are losing money because you lose less than money devaluation.  \n\nThe economy marches on driving innovations that are supposed to make life cheaper and easier for you.  In a deflationary system you would only invest if your investment was providing an economic good and outpacing competitors, ensuring investments are healthy and sustainable.  In an inflationary system you are basically guaranteed to misallocate resources.\n\nBitcoin has a way to go until its money, right now its an asset, it needs to eat the asset market before it can compete as a legit currency.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8yoztc",
                            "author": "Just1_More",
                            "score": 1,
                            "created_utc": 1652805070.0,
                            "response": "Here, [give this a read](https://nakamotoinstitute.org/mempool/bitcoin-is-not-too-volatile/).  I think it will help answer your question.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i901kv3",
                            "author": "DownvoteKink",
                            "score": 1,
                            "created_utc": 1652825103.0,
                            "response": "It doesn't.  It's a get rich quick scheme wrapped in a bunch of fluffy econ talk. (And I'm not talking about the EconTalk podcast, which is actually pretty entertaining)",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}