{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uysbq1",
            "title": "Why should I invest in bitcoin?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uysbq1/why_should_i_invest_in_bitcoin/",
            "author": "AurPer_89",
            "created_utc": 1653634545.0,
            "score": 3,
            "num_comments": 43,
            "subreddit": "Bitcoin",
            "selftext": "I have a question that has been bothering me for some time - and I'm sure bitcoin experts can help me out. \n\nI have the following assumptions: \n\n1. blockchain as a technology will establish itself in the financial world in the long run, as the elimination of intermediaries can increase overall welfare. \n2. this will lead to the coexistence of cryptocurrencies and traditional currencies.\n3. at the same time, new possibilities arise regarding the custody and trading of securities. \n\nNow - let's look at the long-term positioning of Bitcoin. There are probably two scenarios: \n\n1. **Bitcoin establishes itself as a means of payment.**   \nFor this scenario to occur, Bitcoin's value must level off and volatility must be reduced. Where this value lies cannot be predicted. At the same time, it is also not clear whether Bitcoin will prevail as the cryptocurrency in this scenario - or whether it will be one cryptocurrency, or whether several cryptocurrencies will establish themselves. This scenario would also have a strong impact on the effectiveness of monetary policy. At the same time, it would mean that Bitcoin and cryptocurrencies are no longer suitable as an investment from that point on. \n2. **Bitcoin establishes itself as an investment.**  \nIn this scenario, Bitcoin would be considered like gold or shares. One can assume that either way, the use of blockchains will also revolutionise the trading of traditional investments. In my view, this would mean that the two main advantages of Bitcoin as an investment would disappear: high liquidity and independence from financial intermediaries. If these advantages disappear, only scarcity remains as an argument why Bitcoin should establish itself as an investment. But if we realise that Bitcoin does not work as a means of payment, scarcity also loses importance.\n\nAnd now my question: why should I invest in Bitcoin?",
            "stickied": false,
            "comments": [
                {
                    "id": "ia604bo",
                    "author": "Keith_Kong",
                    "score": 16,
                    "created_utc": 1653635158.0,
                    "response": "Like many, you are coming at this from a functionality standpoint, smart contracts, tokenized stocks, wow!\n\nBitcoin has a fundamental advantage from both a decentralization and monetary perspective **as money.** Some people here will claim PoS systems are not secure, but I actually grant that they are secure in a certain fashion. They are secure from being exploited via 51% attacks (fake transactions).\n\nHowever, PoS systems give the power to fork the chain (and thus change the rules) to the largest stakeholders. This makes it much less neutral in terms of power dynamics between individuals and their wealth in the chain.\n\nThis might be fine for tokenized stocks, web3 whatever if that ever actually means something, etc. **but it will never be good for money itself** because it behaves like an equity. It's just not neutral enough to be non-state, non-stake holder controlled wealth.\n\nThe people in Bitcoin writing code can only change Bitcoin if the miners accept the changes. Miners can only change the code if the individuals running nodes accept the changes. Bitcoin has a balance of powers governance system similar to the US federal government and its three branches–only its a global set of actors in each branch making it exponentially more secure against undue changes.\n\nPoS chains have only one governance system: Stakeholders. If the majority of stake (not to be confused with the majority of individuals) wants to change the code, it changes.\n\nBitcoins purpose is to be political neutral, stateless, fixed supply sound ***money***. It will become both a store of value and a medium of exchange once it grows much larger (market cap is only 2% of USD circulating supply). It will eventually only grow to the extent that fiat expands, or in the case where fiat no longer exists it will grow in purchasing power as technology makes producing things cheaper.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia60r8z",
                            "author": "AurPer_89",
                            "score": 1,
                            "created_utc": 1653635702.0,
                            "response": "Thanks - this is helpful. If I understand you correctly, you say that investing in bitcoin now makes sense because of the potential - but you agree that at some point, when the potential is reached, Bitcoin will become a store of value (not an investment product) and a medium of exchange. Correct?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia61s44",
                                    "author": "Keith_Kong",
                                    "score": 9,
                                    "created_utc": 1653636592.0,
                                    "response": "Yes with some caveats to your assumptions. It will not stop acting as an investment until it reaches some kind of fully adopted status.\n\nIf that means it’s a reserve currency for smaller countries who wish to escape being dollarized it could very well stabilize in the next decade though I would expect some degree of volatility to exist in the exchange rate to USD.\n\nIf that means it’s the main reserve asset for all nations then it would need to at least 50X in value from here (to match USD global supply given its currently the largest reserve currency). That will not be able to happen for many decades IMO.\n\nIf it completely replaces all fiat and becomes the only money in the world then it has to grow A LOT more than 50X to represent the circulating supply of all fiat currencies. This has zero chance of happening for a very long time unless fiats experience an implosion (which could happen but I’m hoping for a slow faded death for the sake of humanity).\n\nGiven we have to both reach one of these stages and settle into it being the limits of Bitcoins adoption, it’s likely Bitcoin behaves more like an upward roaming store of value investment for the next 20-30 years, if not our entire lifetime.\n\nOthers believe this can happen much sooner but I don’t believe we can achieve this without some kind of massive societal upheaval because the amount of value that would need to switch over to Bitcoin is just astronomical.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia62hz9",
                                            "author": "AurPer_89",
                                            "score": 2,
                                            "created_utc": 1653637232.0,
                                            "response": "Brilliant - I like your arguments and how you analyse the situation. I would pay actually a lot to watch this movie to the end - however, given my age and the time period it may take, this could become difficult. Except, some guys solve the problem of immortality. Another thing which makes me unconfortable is how many of the current \"bitcoin-experts\" and \"bitcoin-investors\" really understand the mechanisms. But this is another story...",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia634gl",
                                                    "author": "Keith_Kong",
                                                    "score": 3,
                                                    "created_utc": 1653637788.0,
                                                    "response": "Yeah, I feel the same way about watching the full story play out. I’m low 30’s but I still have this feeling the story goes much longer than I do.\n\nI wouldn’t worry too much about the Bitcoin communities knowledge of itself though. You should see how many fiat investors have no idea how the Treasury and the Federal Reserve work together to print money lol",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "ia6f0a2",
                                            "author": "Fickle_Mix_3847",
                                            "score": 2,
                                            "created_utc": 1653648187.0,
                                            "response": "Had to give you an award for your efforts- great work.  I look forward to seeing how it plays out over time.  ☀️",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia6ym92",
                                                    "author": "Keith_Kong",
                                                    "score": 1,
                                                    "created_utc": 1653659468.0,
                                                    "response": "Why thank you!",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "ia80jk8",
                                            "author": "MadMaxwell92",
                                            "score": 1,
                                            "created_utc": 1653675380.0,
                                            "response": "We’ll all be dead when Bitcoin reaches full adoption. We will see many seasons for bitcoin in our lifetime and a global paradigm shift. I hope that the bitcoin I can accumulate can provide opportunity for my children to invest in opportunities that were not available to me.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia67vfp",
                    "author": "savinelli_smoker",
                    "score": 5,
                    "created_utc": 1653642052.0,
                    "response": "Bitcoin, not blockchain.\n\nReally. Try do some more research but not from the “blockchain” angle. It’s quite possible that Bitcoin will turn out to be the only successful blockchain. \n\nPersonally when I hear someone says “blockchain” I kinda assume that they don’t really get it.\n\nAlso, bitcoin, not crypto. For similar reason. This may come across as stupidly arrogant but the deeper you get into the more it makes sense. At least that my personal experience. Good luck.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia61iat",
                    "author": "Blimpleton",
                    "score": 3,
                    "created_utc": 1653636346.0,
                    "response": "If you dont understand why you should invest in bitcoin then you shouldnt. But maybe explore just a little bit more on why bitcoin has no true competition.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia61pdj",
                            "author": "AurPer_89",
                            "score": 1,
                            "created_utc": 1653636523.0,
                            "response": "What is your definition of true competition? Are you referring to the rule / governance of bitcoin? Or what is different from your perspective?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia7aab2",
                                    "author": "98gffg7728993d87",
                                    "score": 1,
                                    "created_utc": 1653664502.0,
                                    "response": "One thing I've noticed is no one really uses any of the other tokens they just invest in them. Bitcoin seems to be the only coin actually used to conduct business. Sure most business isn't done with bitcoin. But the other coins have no business being done. No transacting, pure investment. And the ones that do have transactions seems to only be investment based transactions. What do I mean by that? I mean no one ever solves their problem with the coin, they never buy anything they actually need or consume or use. They only transact for the purpose of investment specifically. Which is exactly what a bubble is, a bunch of people who just keep buying hoping to sell for more later, no one actually using the products",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia6adig",
                    "author": "slvbtc",
                    "score": 3,
                    "created_utc": 1653644333.0,
                    "response": "Bitcoin isnt an alternative to investments. Its an alternative to fiat money.\n\nWe dont invest in bitcoin we save in bitcoin.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia6h33g",
                            "author": "McKnuckle_Brewery",
                            "score": 1,
                            "created_utc": 1653649690.0,
                            "response": "It’s an alternative to fiat money that can’t really be fully used like fiat money, right?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia6uxrh",
                                    "author": "NiceDoctorBeam",
                                    "score": 3,
                                    "created_utc": 1653657724.0,
                                    "response": "Lightning Network and/or other 2nd layer technologies allow millions of transactions per second, quickly and inexpensively.  So, no, your statement is not correct.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia722e0",
                                            "author": "McKnuckle_Brewery",
                                            "score": 1,
                                            "created_utc": 1653661028.0,
                                            "response": "Doesn’t work at the diner where I’m having lunch today, though. Or at the gas station, grocery store, paying for gym membership, electric bill, etc. \n\nSo, no… it’s technology with *potential* but it isn’t actually here yet.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia5zi2x",
                    "author": "shadowbastrd",
                    "score": 8,
                    "created_utc": 1653634651.0,
                    "response": "You shouldn’t.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia60ted",
                            "author": "AurPer_89",
                            "score": 1,
                            "created_utc": 1653635754.0,
                            "response": "This is my intuition as well - however, since a lot of people do, I wonder if I may not see / understand something others do...",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia62pi5",
                                    "author": "Ok_Aerie3546",
                                    "score": 9,
                                    "created_utc": 1653637417.0,
                                    "response": "You really have the wrong assumptions. You really shouldnt. Spend more time learning about it before you take the plunge.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia62va0",
                                            "author": "AurPer_89",
                                            "score": 1,
                                            "created_utc": 1653637561.0,
                                            "response": "Which one is from your perspective wrong? I'm still far away from investing in bitcoin ;-)",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "ia62xb3",
                                    "author": "Dormage",
                                    "score": 1,
                                    "created_utc": 1653637613.0,
                                    "response": "The only reason would be if your looking for a proovable fixed asset. It could be among other commodities in your basket.\n\nIt may turn out it actually becomes a store of value which currently it is not. If it does, you want a peace od that limited digital property.\n\nIf it does not emerge as a store of value after this shitshow macro enivornment then there it wount have much going for it longrerm.\n\nGiven the shitshow happening around the world you may want to have a small bet on something that would survive the meltdown of fiat.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia5zx4v",
                    "author": "BLD7",
                    "score": 3,
                    "created_utc": 1653634994.0,
                    "response": "It’s not an investment to me. That implies I intend to buy Fiat with it after I just sold my fiat for Bitcoin. I have no intention of buying Fiat with it.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia61jlr",
                            "author": "AurPer_89",
                            "score": 1,
                            "created_utc": 1653636380.0,
                            "response": "So you are actually using it to buy things today? If yes, how do you handle the volatility? Since I assume many sellers still determine the price of theirs offers in Bitcoin based on the original value of the asset in FIAT, it must be very complex for you?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia6wpg8",
                                    "author": "NiceDoctorBeam",
                                    "score": 3,
                                    "created_utc": 1653658577.0,
                                    "response": "I think of it like this:  \n\nOnce upon a time a man was living in Zimbabwe.  He'd worked very hard, lived frugally, and had save up money for his old age and for his children to have someday.  \n\nThe man saw that his government and banking system were \"printing\" Zimbabwe Dollars like crazy.  The man saw inflation rising in his country.  \n\nThe man took the time to understand \"money\", and \"fiat currency\", and how \"money printing\" always leads to a debased currency.  Bitcoin hadn't been invented yet, so the many converted most of savings to gold coins.  \n\nIt didn't take long until a loaf of ordinary bread cost $800 trillion Zimbabwe Dollars - much more than the man's amount of savings at the time he converted to gold.  That man had managed to preserve the value of his savings, over time.  He protected himself from \"money printing\".\n\nI see people in first world countries today in a situation very similar to the one our friends in Zimbabwe faced a few decades ago.  Fiat currencies, even the US Dollar, are going to shit, via \"money printing\".  One difference, Bitcoin HAS been invented.  Bitcoin will be the next \"money\" used by people all over the globe.  \n\nYou still have a chance to convert your fiat currency into the better form of money while your fiat currency is still worth something, while Bitcoin is still cheap compared to where it's going, and before your government attempts to force you to use CDBC.  \n\nOr you can think you're so smart, do nothing, and find out the Bitcoiner's were right all along after you're wiped out or \"imprisoned\" via CDBC.\n\nIt's your future.  It's your responsibility.  You will enjoy or suffer the consequences of what you do with the information we'd provided you today, or not.  Choose wisely.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "ia693ho",
                                    "author": "Amoci",
                                    "score": 1,
                                    "created_utc": 1653643162.0,
                                    "response": "It’s only “complex” if you need to perform refunds. \n\nI found that it keeps merchants honest since they risk losing reputation to a tight community.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia5zw3y",
                    "author": "Royal-Author-669",
                    "score": 2,
                    "created_utc": 1653634971.0,
                    "response": "DYOR as I'm Not a Financial Advisor",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia63xpa",
                    "author": "lib3rty47",
                    "score": 2,
                    "created_utc": 1653638511.0,
                    "response": "Before looking at anything bitcoin related. I would suggest you understand what money is. Understand the first principles of money, the traits that make good money, what makes humanity need money and the history that has led to our system today. It is important to understand what money is first, properly define and set principles before tangling what bitcoin tries to solve and why we need it.\n\nThis is a great video of what I mean. \nhttps://youtu.be/d_34YjXAU5Y",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia6kepq",
                    "author": "DAKrause",
                    "score": 2,
                    "created_utc": 1653651935.0,
                    "response": "There is another option you may want to consider: BTC as unit of account for inter-institutional exchange.  Imagine this as a solution to the wire-house issue for settlement, especially around large amounts of value which need to be verified and transmitted quickly and securely.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia6mrib",
                    "author": "NYKNYb",
                    "score": 2,
                    "created_utc": 1653653375.0,
                    "response": "Blockchain isn't groundbreaking.\n\nBitcoin is.\n\nBitcoin destroys all scams, fiat and \"crypto\" aka shitcoins.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia6u84y",
                    "author": "NiceDoctorBeam",
                    "score": 2,
                    "created_utc": 1653657385.0,
                    "response": "You owe it to yourself to learn what Bitcoin actually IS, the basics of how it works, and the difference between Bitcoin and \"shit coins\".  \n\nIntro: The Trust Machine (22 min):  \nhttps://www.youtube.com/watch?v=ZKwqNgG-Sv4\n\nSaylor Explains:  \nhttps://www.reddit.com/r/Bitcoin/comments/s54g8x/send_this_to_your_contacts_interested_in_bitcoin/\n\nRead: \"The Bitcoin Standard,\" by S. Ammous  \n\nNick:  \nhttps://youtu.be/ic1ITcwnozY?t=858",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia66iqt",
                    "author": "Crypto_Degenerate69",
                    "score": 4,
                    "created_utc": 1653640826.0,
                    "response": "“If you don’t believe it or don’t get it, I don’t have the time to try to convince you, sorry.”",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia695n2",
                    "author": "clickworker2019",
                    "score": 1,
                    "created_utc": 1653643214.0,
                    "response": "You shouldn't. Unless you want to waste your money.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia6rb6h",
                    "author": "johndoeisback",
                    "score": 1,
                    "created_utc": 1653655916.0,
                    "response": "If you are wondering whether you should put money in Bitcoin or not then the answer is no",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia5zde6",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653634546.0,
                    "response": "Reddit is a poor source for seeking financial advice. Bitcoin is a risky investment. [Don't invest recklessly.](https://www.reddit.com/r/Bitcoin/comments/7gi55s/dont_invest_recklessly/) Don't invest anything you can't afford to lose. If you are looking to get rich quick, you came to the wrong place. Nobody has a crystal ball. Nobody can see the future. Please do your own research and make your own financial decisions.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Bitcoin) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia61idv",
                    "author": "ShopDiesel",
                    "score": 1,
                    "created_utc": 1653636349.0,
                    "response": "Watch cryptopia on Amazon prime.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia63bnt",
                    "author": "MrQ01",
                    "score": 1,
                    "created_utc": 1653637971.0,
                    "response": "Investment does not exclusively equal gold or shares. The fact is Bitcoin in my personal opinion is undervalued - namely because it is the only decentralised asset class and has one of, if not the, most strongest networks on Earth... and yet hasn't completely sold out. Since the world is changing its tune, people are \"getting their place\" now before mass adoption kicks in and potentially prices them out.\n\nThis is why it is seen as an investment - and that is why Bitcoin price is volatile, in addition to the leveraged trading going on. But that volatility is reducing throughout Bitcoin's lifetime. \n\nWaiting until it stabilises in order to involve yourself in Bitcoin makes yourself an end-user, like all of us will be, but not really a speculative investor - your minimalised risk comes with an expectancy of minimalised gain.\n\nBitcoin works as a means of payment thanks to layer 2 solutions such as the Lightning network - its the countries' infrastructure that need to catch up with Bitcoin, not the other way around.\n\nI'm not sure how adoption of Bitcoin by traditional finance therefore nullifies high liquidity and independence from financial intermediaries.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia652z9",
                    "author": "PublicAccessNetwork",
                    "score": 1,
                    "created_utc": 1653639534.0,
                    "response": "I need exit liquidity.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia6n8a6",
                    "author": "chazmusst",
                    "score": 1,
                    "created_utc": 1653653654.0,
                    "response": "Because there is a very high chance that at some point in the future someone will be willing to buy your bitcoin for a price higher than you paid for it.  That’s basically the strategy",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia6ww32",
                            "author": "NiceDoctorBeam",
                            "score": 1,
                            "created_utc": 1653658665.0,
                            "response": "That's part of it.  Yes.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia7w7g0",
                    "author": "w6gb23",
                    "score": 1,
                    "created_utc": 1653673505.0,
                    "response": "Bitcoin cannot be a means of payment because it's volatility will never go away, fixed supply is the feature that creates volatility. Volatility can decrease, but it will never go away.\n\nYou should invest in Bitcoin because:\n\nBitcoin makes up a reserve currency, one that's relatively fixed against the entire world economy.  The economy can grow or shrink, but Bitcoin is fixed in place.\n\nScarcity does not make up a good medium of exchange. But it makes up an excellent medium of wealth preservation. Thus, Bitcoin is now a good investment because it's not established, and it will be a good investment in the future, because once established, it'll be a gold standard for wealth preservation.\n\nFinally, Bitcoin cannot be seized by governments, which makes a point for a currency that preserves your wealth even against government coercion.\n\nJust an opinion, NFA, I hope it makes a point on how it's a good investment.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia80205",
                    "author": "MadMaxwell92",
                    "score": 1,
                    "created_utc": 1653675164.0,
                    "response": "The nice thing about bitcoin is it’s value is determined by the consensus of voluntary participants. If you don’t see the value in the bitcoin network over time and don’t want to be a participant than there’s more for me! I made the personal choice to move toward BTC because I believe there is no harder money on earth that is as transportable, salable, founded on a foundation that cannot be changed and cannot be altered by any participant without the consensus of the majority. I believe it’s safe, secure and as different financial markets slowly start realizing that it is more sound than fiat currency they will start to migrate toward the bitcoin network.\n\nThe bitcoin network likely will not be the solution to scalability as a payment system but will more likely replace the current major bank final settlements systems. Transactions will occur on something like lightning.\n\nI look at usd v bitcoin and I see an emerging payment system with defined rules v a devaluing payment system that can be manipulated to artificially impact markets. I believe with a base of sound money and truly free markets of trade and money people would be far better off than central authorities trying to treat human purchasing behavior like a physics experiment that has defined laws like conservation of energy etc. human behavior doesn’t have defined laws and calculus can’t predict human behavior.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia67d2n",
                    "author": "solomonsatoshi",
                    "score": 0,
                    "created_utc": 1653641584.0,
                    "response": "Why is Bitcoin over 70% of the value of all the other (18000+?) cryptos (excluding 'stable' coins)?\n\nBecause Bitcoin is the only truly decentralised blockchain form of money that has the integrity and potential to substitute for the dying fiat debt slavery cartel.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}