{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uvh7o3",
            "title": "Christine Lagarde Says Cryptos Are Worthless… Could This be The Right Time to Sell Off My Bitcoin?",
            "url": "https://www.reddit.com/r/btc/comments/uvh7o3/christine_lagarde_says_cryptos_are_worthless/",
            "author": "Trinitysjm",
            "created_utc": 1653244850.0,
            "score": 1,
            "num_comments": 0,
            "subreddit": "btc",
            "selftext": "According to \n\nhttps://bitcoinist.com/crypto-is-worthless-ecb-president/   \n\nThe President of the European Central Bank, Christine Lagarde, has issued a statement in which she warned that cryptocurrencies are worthless and should be regulated.\n\nLargade noted that in her opinion, cryptocurrencies are worthless as they are founded on nothing and there are no underlying assets to serve as a safety anchor. \n\nIn her statement made on Dutch television, she said that cryptocurrencies are highly speculative and extremely risky and that she is most concerned about those who do not understand the depth of risks involved in cryptocurrencies, and so would eventually lose everything.\n\nAlthough we could be quick to brush her statement aside, taking a quick glance at Bitcoin' current price shows that the token has dropped by more than half when compared to its All time high. The recent Luna and UST fiasco also corroborates Largade' opinion about cryptocurrencies being worthless, as millions of dollars went down the sink without any hope of recovery.\n\nHowever, seeing the continuous growth of different blockchain networks such as BNBchain, Zetrix, Solana and knowing that about $9.2 billion has been introduced into different blockchain projects in Q1 of 2022 according to\n\nhttps://techcrunch.com/2022/05/12/vc-investment-into-crypto-startups-peaked-right-before-everything-went-to-hell/?guccounter=1&guce_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmNvbS8&guce_referrer_sig=AQAAAB5OMGFCOk_gy2G26Uq-zsUcghpl-4XRFWp5lPVZ-HVHaheycLGuDT4-0qwdZUzKYlqoXHMcadEYZl5rAtnJgbrvcjo3VEOb3vW2VVumhMDdC-HKLPHvQR0QEi0p3Zb8pMB9Mk5EIJ3cldrjFUmov4vZ6x_iuqIY_kI-SrN20Pqg\n\nOne is therefore left to wonder which side of the divide is really correct. Is bitcoin and other cryptocurrencies ever going to rise again or are they truly worthless and should be sold off as quickly as possible?",
            "stickied": false,
            "comments": []
        }
    ]
}