{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "upmhxz",
            "title": "Are you in Cryptocurrency for the RIGHT Reasons?",
            "url": "https://v.redd.it/ssp8i2xnbhz81",
            "author": "Mafalzon",
            "created_utc": 1652550575.0,
            "score": 70,
            "num_comments": 25,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8mfmdf",
                    "author": "nikola-crypto",
                    "score": 6,
                    "created_utc": 1652564130.0,
                    "response": "People who think crypto is an “investment” or “asset” need to watch this. Also those who value crypto using its fiat trade value when the objective of crypto is to replace fiat itself lol",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8mly48",
                            "author": "localether",
                            "score": 3,
                            "created_utc": 1652567089.0,
                            "response": "The process of replacing fiat with crypto is market adoption. I would love to pay my bills p2p on a blockchain (no bitpay type bullshit), but there is not nearly enough adoption. But those of us in crypto are helping to push more adoption.\n\nThe big hurdle is ease of use. You have to be super careful when you are your own bank. We need some way to make using a wallet easier without diminishing security and without relying on a third party. Storing the private key and being able to recover from a lost/stolen device or a crashed hard drive.... this needs to be made easier.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8mrqpk",
                                    "author": "nikola-crypto",
                                    "score": 3,
                                    "created_utc": 1652569782.0,
                                    "response": "Totally agree. We need to make it easier to use crypto to drive mass adoption. The key here is it needs to be easier for the masses to use. I may be wrong but I think that it’s us technical people / people who have an in depth understanding of crypto that truly value the way in which crypto is implemented and what it means for being our own bank. Maybe the masses don’t care and maybe having so much control feels so risky to them that they rather not own that risk (of losing access to wallets etc). So maybe there is a need for a company/ companies to play the role of risk taker in terms of helping store wallets and facilitate transactions for the masses - in order to drive mass adoption we kinda need a transition plan from fiat to crypto and this may mean keeping the user experience the same or similar- meaning that if we can make using crypto feel the same as using fiat then maybe more people will feel safer switching to crypto",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8lmk9s",
                    "author": "Mafalzon",
                    "score": 8,
                    "created_utc": 1652550708.0,
                    "response": "The way I see it, there are 2 types of people in crypto.\n\n1. People who want to make as much money as possible.\n2. People who want to take power away from people who shouldn't have power to begin with.\n\nI'm in crypto to remove power from governments -- to stop predatory inflation -- to allow people all over the world to use a new borderless currency.\n\nWithout the need for permission, custodians, or the wealth required to \"fund liquidity channels.\" I support currencies like BitcoinCash that just work.\n\nWhat about you?\n\nWatch [my full video here on the Luna disaster,](https://youtu.be/AgJCaVQgF9I) and what we can learn from it.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8mccaa",
                            "author": "Bad_Chicken_2",
                            "score": 8,
                            "created_utc": 1652562617.0,
                            "response": "I don't see those as mutually exclusive. I want peer-to-peer money that everyone can use and that can't be centrally controlled, *and* I want to make as much money as I can.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8mhvrk",
                                    "author": "Mafalzon",
                                    "score": 3,
                                    "created_utc": 1652565182.0,
                                    "response": "That’s fair!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8lupsf",
                            "author": "LovelyDayHere",
                            "score": 6,
                            "created_utc": 1652554431.0,
                            "response": "While I think we can agree that there are people who should rather not have power, the Bitcoin whitepaper doesn't define this.\n\nBut it does say that Bitcoin is a system of electronic cash that removes the need for trust (using cryptography) and so it can solve a number of problems which arise when we need to rely on (trusted) intermediaries to the extent many people are currently forced to...\n\nBeyond that, as long as the members of the first group are made aware not to invest more into crypto than they can afford to lose, we should welcome them too, no? They include the entrepreneur types, the pragmatists who don't care so much about how it works but rather that it delivers on its promises.\n\nSelf-empowerment might be a bit more appealing way of marketing #2 rather than removing government power, even if ultimately, more power in the hands of the people means less centralized power and maybe that can be equated with \"remove power from governments\".\n\nBut let's keep in mind that people are frequently attached to their government, esp. if the previous government was worse. Ok, so governments right now aren't doing too well _on average_. We need to point out that it's money that often buys a ticket to freedom when government turns oppressive. And when the state or its subservient institutions (like central banks and their regulated downstream commercial banks) start to enforce state ideology, then suddenly the citizen's access to money can become precarious. We saw this in the case of Canada where big banks jumped in to play censors against the truckers who protested against violations of the peoples' rights, freezing peoples' accounts and handing over account details of suspected dissidents to government. This can easily happen anywhere, and cryptocurrencies help protect people against such \"emergency\" situations just as much as they can help in improving regular transacting (if governments / banks weren't putting regulation obstacles in the way all the time).",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8mkpu3",
                            "author": "localether",
                            "score": 3,
                            "created_utc": 1652566508.0,
                            "response": "1... check, 2... check. In it to change society and also make money.\n\nYou can do both...",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8mioge",
                            "author": "JapGOEShigH",
                            "score": 5,
                            "created_utc": 1652565556.0,
                            "response": "I'm in crypto, especially BCH, because it's money.\n\nIt's easy to use, fast, reliable and fair. Accessible to anyone with \"radio\" signal.\n\nLittle harder to handle as printed or stamped private keys. Still viable imo. \n\nAnd BCH has proven itself over and over to be resilient and here to stay.\n\nIt just works.\n\nu/chaintip",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "upol2x",
            "title": "Over $1.2 billion in bitcoin reserves remains unaccounted for by Luna Foundation Guard",
            "url": "https://www.theblockcrypto.com/post/146840/luna-foundation-guard-lfg-bitcoin-reserves-unaccounted?fbclid=IwAR1PwZA_lKBxoFSEsFcoOKqoOcOk-zS1jcXlRlXMaIcgKkOuLB7AwsbtaKA",
            "author": "Egon_1",
            "created_utc": 1652556796.0,
            "score": 23,
            "num_comments": 4,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8m048x",
                    "author": "TripleReward",
                    "score": 5,
                    "created_utc": 1652556964.0,
                    "response": "oops.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8o3sy4",
                    "author": "jessquit",
                    "score": 3,
                    "created_utc": 1652597578.0,
                    "response": "Bitcoiners who already lived through mtgox: *yawn* toldyaso",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uplmue",
            "title": "Bitcoin maxis are partially to blame for this entire #LUNA #UST debacle. Many of them endorsed it only because it pumped their #BTC bags. If it was another coin they wouldn’t have said anything, but b/c it was BTC they all gladly supported it while noobs got rekt. Shame!",
            "url": "https://twitter.com/davidshares/status/1525493768178245638",
            "author": "btcxio",
            "created_utc": 1652548012.0,
            "score": 24,
            "num_comments": 5,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8lkl8r",
                    "author": "shillstro",
                    "score": 9,
                    "created_utc": 1652549815.0,
                    "response": "BTC \"bitcoin\" is a community of ponzi and scammer members.\n\nTo clarify: /r/bitcoin: ponzi, scammers and bots.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "upl33o",
            "title": "Buying On Amazon With Crypto from Purse.IO We bought Gingerhead a cat tree with BCH! Full Video on Nick Chase YouTube - Link In Comments",
            "url": "https://v.redd.it/a82jxvc3zgz81",
            "author": "NickLibertarian",
            "created_utc": 1652546438.0,
            "score": 20,
            "num_comments": 12,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8ln453",
                    "author": "Mafalzon",
                    "score": 5,
                    "created_utc": 1652550960.0,
                    "response": "Awesome Nick!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ldtja",
                    "author": "Remora_101",
                    "score": 3,
                    "created_utc": 1652546728.0,
                    "response": "Well this is peak influencer 🤣 Not my cup of tea but I am probably not in the group of people he wants to address 😅",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8ldwa1",
                            "author": "NickLibertarian",
                            "score": 3,
                            "created_utc": 1652546763.0,
                            "response": "Peak influencer haha I like that",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}