{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uqt8u7",
            "title": "Can you spot the bitcoin in the pic?",
            "url": "/r/Currencycom/comments/uqt8nn/can_you_spot_the_bitcoin_in_the_pic/",
            "author": "currencycom",
            "created_utc": 1652698804.0,
            "score": 1,
            "num_comments": 0,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uqt5am",
            "title": "Price does affect IMHO",
            "url": "https://www.reddit.com/r/btc/comments/uqt5am/price_does_affect_imho/",
            "author": "johndoeisback",
            "created_utc": 1652698427.0,
            "score": 16,
            "num_comments": 51,
            "subreddit": "btc",
            "selftext": "I have this dilemma with BCH. I understand the P2P money narrative and I fully agree that BCH is 100x better than BTC for daily (aka small) payments. But here's the thing. In order to pay in BCH you need to hold BCH in the first place. And the BCH price has been going down. Yes, I know the same is happening to BTC (we're in a bear market after all, aren't we?), but BCH is dropping faster, **in other words the BCH/BTC rate is going down** (if we are not in the ATL in BCH/BTC, we're close!).\n\nSo essentially that's the dilemma: I want to use BCH but it's painful to hold BCH, so in the end I'm not using BCH as much as I'd like to. It looks like a vicious circle. Is there any way out of this? I understand most people believe that the solution is to keep adding stores and improving merchant support and the market will do the rest, but I'm not entirely sure about this.\n\nI'd like to hear your thoughts.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8t3tz5",
                    "author": "Br0kenRabbitTV",
                    "score": 10,
                    "created_utc": 1652701221.0,
                    "response": "You can hold whatever you like and simply swap for BCH before making a purchase, or even buy it at current market value when making a purchase. Most offer a discount for paying in crypto.\n\nIf we get retail transaction to the scale of something like Visa the price will stabilise..\n\n..speculative transactions are not helping at all IMHO.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8t4nep",
                            "author": "johndoeisback",
                            "score": 1,
                            "created_utc": 1652701746.0,
                            "response": ">You can hold whatever you like and simply swap for BCH before making a purchase\n\nIf I hold some other crypto then why would I swap it for BCH before making a purchase when I can simply pay with the other crypto directly?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8t5wgm",
                                    "author": "Br0kenRabbitTV",
                                    "score": 8,
                                    "created_utc": 1652702512.0,
                                    "response": "For the lower fees I'd assume, if you are holding coins like BTC or ETH.\n\nI guess I'm assuming you are holding on an exchange here, but you are also assuming the merchant will also be accepting the coins you hold as well. There are more BCH merchants.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8t9m41",
                                            "author": "johndoeisback",
                                            "score": 1,
                                            "created_utc": 1652704686.0,
                                            "response": "Let's assume I'd be using a self-custodial wallet and the crypto is supported by the merchant.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8taief",
                                                    "author": "Br0kenRabbitTV",
                                                    "score": 6,
                                                    "created_utc": 1652705168.0,
                                                    "response": "Then it would be pointless and you would have to suck up the higher fee regardless.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i8tans2",
                                                    "author": "Collaborationeur",
                                                    "score": 3,
                                                    "created_utc": 1652705247.0,
                                                    "response": "Excellent mindset!\n\nSee here: https://bitcoinfees.cash/",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i8t9se8",
                                    "author": "Meth-Heads",
                                    "score": 5,
                                    "created_utc": 1652704782.0,
                                    "response": "You sound Young so I'm going to assume you simply don't understand that this is a principled matter. A lot of young people tend to be more pragmatic when they simply don't understand what's going on around them. In this case what we are trying to do is bootstrap a brand new currency and replace government Fiat around the world. If you think that you're going to be able to dismantle the largest and most powerful organizations in the history of the world without some bumps along the way you are painfully mistaken. Of course big Banks and legacy institutions are manipulating the price of Bitcoin in order to slow its adoption. In the case of Bitcoin core they turned it into a Ponzi scheme for idiots to distract 90% of people in the case of Bitcoin cash they've been manipulating the price since it's inception.\n\nYou honestly sound like you would be better off in one of the other cryptocurrency subs where all they care about is going to the Moon and other retarded shit. Based on your questions you clearly don't understand the benefit of peer-to-peer digital cash.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8u9kp2",
                                            "author": "blockpine",
                                            "score": 6,
                                            "created_utc": 1652720423.0,
                                            "response": "You sound younger than OP does imho. Your condescending tone is doing nothing for our shared dream of bootstrapping a peer-to-peer electronic cash economy.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8tbi51",
                    "author": "TooDenseForXray",
                    "score": 9,
                    "created_utc": 1652705688.0,
                    "response": "\\>I have this dilemma with BCH. I understand the P2P money narrative and I fully agree that BCH is 100x better than BTC for daily (aka small) payments. \n\nSmall and large payment are a better experience with BCH\n\n\\>But here's the thing. In order to pay in BCH you need to hold BCH in the first place.\n\nYou don't necessarily have to own a large position of BCH to make payment.\n\nOwn a little and just rebuy your position after spending and you are back where you are.\n\n\\>So essentially that's the dilemma: I want to use BCH but it's painful to hold BCH, so in the end I'm not using BCH as much as I'd like to. It looks like a vicious circle. Is there any way out of this?\n\nIt depend if you think BCH has long term potential then it is not painful to own any, low price is actually an opportunity to slowly buy a large position at low cost.  \n\n\nIf you don't think so, it is fine. just buy a some amount that is useful to you and that's it.\n\n(actually crypto would be much more healthy if everybody did that)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8tbu5g",
                    "author": "Collaborationeur",
                    "score": 8,
                    "created_utc": 1652705865.0,
                    "response": "> Is there any way out of this?\n\nYes, you can have that by balancing your BCH income and spending.\n\nIf you regularly accept BCH for your services / goods / restaurant check splitting / etc and eagerly spend that BCH then you are less exposed to its value fluctuations!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8trm8s",
                            "author": "lurker81",
                            "score": 2,
                            "created_utc": 1652713143.0,
                            "response": "In other words, as soon as you get BCH, dump it ASAP or you'll lose purchasing power.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8twsi8",
                                    "author": "i_have_chosen_a_name",
                                    "score": 4,
                                    "created_utc": 1652715294.0,
                                    "response": "spend and replace and adjust your strategy based upon we are in a bull market (going away from all time low) or in a bear market (going towards all time low).\n\nIn a bull market you can afford to hold BCH a little bit longer.\n\nIn a bear market you have to spend it asap. \n\nOr you could buy  BCH once, sell it for flexUSD (which you can hold on a hardware wallet) and then everytime you want to send some BCH you can use your flexUSD to buy BCH with and then spend it.\n\nThis goes thousands of times quicker then having to send fiat to a cex and then buy the BCH and then withdraw the BCH again. \n\nFor me to buy BCH with my flexUSD takes a couple of clicks and to get the smartBCH swapped in to BCH using hop.cash takes a couple more clicks.\n\nOn average the process to go from flexUSD to BCH in my Bitcoin.com wallet takes about 2 to 3 minutes and then you can direcly spend it. \n\nOf course then the next question would be, well why can't those merchants accepts flexUSD instead. \n\nBut that's not what we want so they should not. We want to make BCH become stable by getting sats stuck in economic loops. \n\nBut we still need to protect ourselves against the manipulators that pump and dump bch while the BTC price keeps going down (Tether is behind this, they buy BCH and then dump for BTC at strategic times)\n\nflexusd is a good protection against that.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8tsvw9",
                                    "author": "Collaborationeur",
                                    "score": 2,
                                    "created_utc": 1652713667.0,
                                    "response": "Exactly, that's what he discussed in OP already. \n\nSo why do you troll an actual solution to his question?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8txxnh",
                                            "author": "lurker81",
                                            "score": -1,
                                            "created_utc": 1652715760.0,
                                            "response": "I'm not trolling, I'm expressing YOUR solution in a different way. YOU are saying to dump BCH ASAP after you get it.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8t17oh",
                    "author": "BewareOfShills",
                    "score": 3,
                    "created_utc": 1652699477.0,
                    "response": "Why do you think the price is dropping in the first place?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8tf7to",
                            "author": "i_shoot_guns_321s",
                            "score": 2,
                            "created_utc": 1652707578.0,
                            "response": "Lack of any real demand",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8tlp7f",
                                    "author": "BewareOfShills",
                                    "score": 6,
                                    "created_utc": 1652710603.0,
                                    "response": "I asked op since we wanted a solution. \n\nSo for low demand the solution would be create demand. You have two option, \n\n- Short term: create hype\n- Long term: built adoption\n\nBCH is doing the latter which takes some time.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8ux8br",
                            "author": "Blazedout419",
                            "score": 1,
                            "created_utc": 1652729931.0,
                            "response": "Terrible marketing when the coin forked IMO. Once BCH forked from Bitcoin and tried the old \"BCH is the REAL Bitcoin\" most people in the crypto space started to hate BCH. Not sure anything can fix the reputation at this point as it keeps sliding down the list of coins. I was pretty onboard when the split happened, but have since changed my mind on holding it. I like the idea of the larger blocks to see how it could work versus Bitcoin, but usage never picked up so I guess we will likely not know.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8vqujf",
                                    "author": "BewareOfShills",
                                    "score": 1,
                                    "created_utc": 1652742636.0,
                                    "response": ">Terrible marketing when the coin forked IMO\n\nThere was no marketing BCH is decentralized, there is no blockstream that feeds us talking points.\n\n>Once BCH forked from Bitcoin and tried the old \"BCH is the REAL Bitcoin\" most people in the crypto space started to hate BCH\n\nWell, it was the truth and it is even more obvious now than then. The hate came obviously from BTC since they got the ticker and BCH was a danger to their fork.\n\n\n>Not sure anything can fix the reputation at this point as it keeps sliding down the list of coins\n\nWho cares? The crypto market is a farce, we had 2 scam/massiv failure coins in the top 10 a few days ago. BCH will steamroll adoption and likely no one in the crypto space will see it coming. \n\n> I was pretty onboard when the split happened, but have since changed my mind on holding it. I like the idea of the larger blocks to see how it could work versus Bitcoin, but usage never picked up so I guess we will likely not know.\n\nYou know that big blockers were censored and people talking about it got brigaded until they stopped.? BCH basically started from -10.\n\n\n>, but usage never picked up so I guess we will likely not know.\n\nDon't bet on it. BCH has been shown to easily succeed BTCs tps. Adoption is really picking up and staying not like the botched custodial chivo disaster in El Salvador.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8uqbu3",
                    "author": "allinape2022",
                    "score": 2,
                    "created_utc": 1652727094.0,
                    "response": "actually i already little by little to sell my BTC to BCH,i still have 0.73 BTC,but i still covert it till 0.\n\nnow i had 100 BCH,and accept BCH in my online shop and promo it to other businesman in Taiwan.\n\nin other way to check BCH vs BTC, Marketcap BCH still lower than BTC,meaning more easy to increase the price.\n\nBCH 100% undervalued.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8t8c8h",
                    "author": "smartguy_m",
                    "score": 2,
                    "created_utc": 1652703967.0,
                    "response": ">Is there any way out of this?\n\nYes! There is an easy and simple way out of this. If you are unsure of the future price of BCH you can fix it at the current price while still being able to use BCH as usual with your non-custodial wallet. How? By shorting perpetual futures (BCHUSD.Perp or something like this) on an exchange. If you have 100% short position in perpetual futures, it basically means that for you the price of BCH is fixed to the price at which your sell order was executed on the exchange. If you have, for example, 50% short position, it means that only half of price fluctuations is covered by the short position. You need to keep only part of your BCH on the exchange as margin (10-20%), the rest is in your non-custodial wallet which you can spend as you see fit, but you must adjust your short position accordingly every time you spend BCH.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8t8p29",
                            "author": "johndoeisback",
                            "score": 2,
                            "created_utc": 1652704173.0,
                            "response": "Sorry, holding IOUs in an exchange is out of the question.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8tx0pd",
                                    "author": "i_have_chosen_a_name",
                                    "score": 3,
                                    "created_utc": 1652715388.0,
                                    "response": "What about something like flexUSD on smartBCH?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8u1thf",
                                            "author": "johndoeisback",
                                            "score": 1,
                                            "created_utc": 1652717338.0,
                                            "response": "You mean hold flexUSD and exchange for BCH for payments?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8u6v5y",
                                                    "author": "i_have_chosen_a_name",
                                                    "score": 3,
                                                    "created_utc": 1652719359.0,
                                                    "response": "Yeah you hold flexUSD which makes you 7 to 15% APY a year. So on a 100K what would be 19 to 40 flexUSD per day. \n\nThen when needed you use a smartBCH dex to use your flexUSD to buy BCH with. You then use a bridge like hop.cash to move the smartBCH in to BCH.\n\nThis entire process can be done within a couple of minutes and as soon as your BCH wallet sees the incoming tx you can spend the BCH. (unless you are using something like bitpay which requires your balance to have 1 confirmation first because you can spend it with them). \n\nThis puts your volatility risk at a minimum. Worse case for some merchants you would have to wait 1 conf before you can spend with their online systems and then 1 conf with them. \n\nBut for most BCH merchants, especially  in brick and mortar stores you can spend from unconfirmed and they directly accept it on 0 conf.\n\nAnd smartBCH is coming to the Bitcoin.com wallet.\n\nSo you could be in the store, and use your Bitcoin.com wallet to use your flexUSD to buy BCH with. Then use the hop.cash or the Bitcoin.com wallet's own bridge to get BCH for it and spend in the store.\n\nAll of this can be done in minutes. smartBCH blocks come every 6 seconds and the bridges only need a handfull of confirmations.\n\nThe hop.cash bridge on amounts under 5 BCH is almost instant. About 6 seconds after I have made the tx I see a BCH tx made. On average it's about 5 to 20 seconds.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8u7wff",
                                                            "author": "johndoeisback",
                                                            "score": 2,
                                                            "created_utc": 1652719764.0,
                                                            "response": "Not bad",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i8tavvs",
                                    "author": "smartguy_m",
                                    "score": 3,
                                    "created_utc": 1652705365.0,
                                    "response": "It is only 10 percent of all your BCH to maintain margin. Even if the exchange is suddenly insolvent (or hacked or whatever), the risk of which is relatively small in my opinion, your loss is limited to 10%. Of course it would be better if something like this existed in the form of some smart-contracts or DEX, but today DEXes (and blockchains on which they work) have neither transaction throughput nor liquidity to make it possible. Anyway, if you are so keen to never holding any IOUs, then it should be easy for you to completely detach yourself from the dollar and any dollar value of your assets. Then just use and hold BCH regardless of its price fluctuations.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8u17mh",
                                            "author": "yebyen",
                                            "score": 1,
                                            "created_utc": 1652717089.0,
                                            "response": "This is the right answer IMHO\n\nIf you are confident that BCH price will continue to go down, then short it and use that leverage to acquire more free BCH as the price goes down. If you think it won't, you should be confident holding your BCH and buying more that it will increase in value. The price can only dip so far. All Time Low is something like $74 last I checked.\n\nIf you want an asset that does not change much in value, I hear rocks are pretty stable, maybe buy gold. The price could go down to 74 and then up to 4000, or it could happen in the opposite order. There's really no telling what will happen. I thought my dollars were safe, but then inflation got me. Anyway, it could go all the way to zero as we've seen recently all things are possible, but if you believe BCH is sound algorithmically then it is hard to believe it won't eventually rebound when the markets overall rebound, in 3 to 5 years maybe.\n\nExpecting assets to remain a stable price or not dip during a global financial crisis sounds risky whether it is BCH, BTC, ETH, GM stock, or dollars. I gave up all my short positions about two weeks before the current crash and I am kicking myself. Now I'm sure if I buy them back, it will reverse. Nobody can predict, but taking 10% of your risky holding and buying a hedge in case the price starts moving in the wrong direction seems like a no-brainer, when you're threatened protect your kidneys.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i8u3q3i",
                                    "author": "imaginary_username",
                                    "score": 1,
                                    "created_utc": 1652718107.0,
                                    "response": "There's a noncustodial [thing](https://anyhedge.com/) coming up that might suit you better. Stay tuned.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8ta9ij",
                                    "author": "Meth-Heads",
                                    "score": -1,
                                    "created_utc": 1652705035.0,
                                    "response": "I agree your question and this guy's response are not good ideas. Dude above was simply offering the best solution to your stupid problem.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8u3m95",
                                            "author": "DerpyPun",
                                            "score": 1,
                                            "created_utc": 1652718064.0,
                                            "response": "How is losing money a stupid problem? It's the single most important problem for many people.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8tf24x",
                    "author": "i_shoot_guns_321s",
                    "score": -10,
                    "created_utc": 1652707501.0,
                    "response": "Exactly right.  BCH fans love to talk about fees, but you lose more value than the fees cost.  So are you really saving anything?\n\nBCH is down ~98% from ATH when priced in BTC.  It will realistically never recover, and is very likely to continue to make new lows regularly until it slowly drops out of the top 50, then top 100 projects.\n\nBCH has been on a slow path to complete irrelevancy for years now, and the supports just can't see the writing on the wall.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8tilh8",
                            "author": "Shibinator",
                            "score": 9,
                            "created_utc": 1652709192.0,
                            "response": "We've been on the slow path to irrelevance for years, but no matter how irrelevant we are there is ALWAYS someone coming to tell us we're irrelevant.\n\nOr, in other words, we are always still relevant.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8tjxo8",
                                    "author": "CurvyGorilla202",
                                    "score": 11,
                                    "created_utc": 1652709811.0,
                                    "response": "If telling a stranger, something is irrelevant, then it relevant enough to me to keep asking questions.\n\nIMO Bitcoin Cash is very relevant",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8uwqpt",
                                    "author": "FieserKiller",
                                    "score": 1,
                                    "created_utc": 1652729732.0,
                                    "response": ">Or, in other words, we are always still ~~relevant~~ entertaining.\n\nFTFY",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8ubxcj",
                                    "author": "i_shoot_guns_321s",
                                    "score": -2,
                                    "created_utc": 1652721360.0,
                                    "response": "I just casually peruse this ghost-town of a subreddit when I'm bored and need a laugh.\n\nDon't mistake this rare engagement as relevance.\n\nYou can't hand-waive away 98% loses. BCH will never recover that, ever.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8uc328",
                                            "author": "Shibinator",
                                            "score": 3,
                                            "created_utc": 1652721425.0,
                                            "response": "> I just casually peruse this ghost-town of a subreddit when I'm bored and need a laugh.\n\nThis is literally what every single troll says.  \"I'm just here to laugh.\"  It's like /r/Buttcoin circa 2013, and just as doomed.\n\nRemindMe! 10 years",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8uda4k",
                                                    "author": "i_shoot_guns_321s",
                                                    "score": 0,
                                                    "created_utc": 1652721900.0,
                                                    "response": "Why do you cultists always ignore the massive loses?  That's what I don't get.\n\nI imagine you likely weren't around during the initial BTC/BCH split, because if you were, you'd be completely insolvent right now.  Either that, or you don't practice what you preach, and you still hold BTC, keeping you solvent.\n\nDeep down, you knew where the real value was.  Which is why so many BCH apologists still hold their wealth in BTC, like Roger Ver.  Anyone who actually held their wealth in BCH over the years, has lost nearly every penny they ever had.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8uf6mq",
                                                            "author": "Shibinator",
                                                            "score": 2,
                                                            "created_utc": 1652722659.0,
                                                            "response": "It's not about ignoring.  I can tell the price is down.\n\n> I imagine you likely weren't around during the initial BTC/BCH split\n\nI was\n\n> because if you were, you'd be completely insolvent right now. \n\nNo, I just have income, and earn money, you know, a regular life?!  If you think about it logically, instead of in the narrative you want to construct, for the vast majority of the time since the split BCH has been in the range $100 - $400.  I have been earning and spending throughout.  Over that time, dollar cost averaging has done its job.\n\nCould I be up in fiat terms instead if I had hodl'd BTC?  Absolutely.  But I also would be either a crypto LARPer that doesn't actually use crypto, or would have paid a shitton of unnecessary fees.\n\nThe market will catch up eventually, it always does.\n\nThe real question is why you can't ignore BCH, nobody spends their own time \"just to laugh\" at something they claim is irrelevant unless they are a titanically big loser with no positive interests or communities of their own.  Do I go around posting in the subs of all the other thousands of other crappy cryptos?  No, of course I don't.  But you do. I'd be less worried about my financial situation, and more about your own life if I was you.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8uhxq5",
                                                                    "author": "i_shoot_guns_321s",
                                                                    "score": 2,
                                                                    "created_utc": 1652723739.0,
                                                                    "response": "> No, I just have income\n\nSure, fiat income.  Not surprising.  You wouldn't need to rely on fiat income if you chose the right horse in 2017.  That's my point.  BTC offered life changing wealth, while BCH lost ~98% of it's value vs BTC when it split.\n\n> The real question is why you can't ignore BCH\n\nI'll give you a truthful response.  To some, Bitcoin is just a means to an end.  A way to get rich.  To me, Bitcoin is a paradigm shift, a monetary revolution.  Bitcoin means everything to me.  When I first learned about it, my eyes were opened up to the deceitfulness of fiat money, and the evil of the Federal Reserve.  I learned what sound money was for the first time in my life. It was life changing.\n\nThe BCH split was the biggest and most well financed attack on Bitcoin to ever take place.  If the attack succeeded, Bitcoin would be dead. I put real life time and energy into defending Bitcoin from this attack.\n\nThe BCH was so confident it was going to replace Bitcoin, so to see BCH fail so spectaculary is a victory unlike anything I've ever experienced.  It's like when die-hard baseball fans tell the story of their underdog team winning the world series, and they had front row seats to the final game.  Expect this isn't a game.  It's a revolution.\n\nSo the BTC victory was a major part of my life, and BCH's comical death will always be part of my life too.  It was the first major battle Bitcoin won, and a stepping stone to big threats on the horizon.\n\nThe fact that there are BCH victims even left blows my mind.  So yes, maybe once ever few months I take a trip down memory lane, and enjoy the success of winning by coming here and getting a nice laugh.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i8ukqo4",
                                                                            "author": "Shibinator",
                                                                            "score": 1,
                                                                            "created_utc": 1652724844.0,
                                                                            "response": "> Sure, fiat income.\n\nI get paid in BCH.  It's denominated in fiat though.  No one denominates their income in crypto, it's not at that stage yet.\n\n> To some, Bitcoin is just a means to an end. A way to get rich.\n\nSounds like that's what it is to you, all you care about is the price, and who made or lost fiat dollars.\n\n> The BCH split was the biggest and most well financed attack on Bitcoin to ever take place. \n\n[You're correct](https://www.youtube.com/watch?v=eafzIW52Rgc), the banks literally funded huge money to try and kill Bitcoin.\n\n> If the attack succeeded, Bitcoin would be dead. I put real life time and energy into defending Bitcoin from this attack.\n\nCorrect again.  Luckily BCH survived.\n\n>  It's like when die-hard baseball fans tell the story of their underdog team winning the world series,\n\nImagine thinking BTC was the underdog team, when it had all the centralised government manipulation, banker funding and censorship on its side.\n\n> It's a revolution.\n\nBTC has not revolutionised shit.  In 6 years, adoption has only reversed - maybe excepting El Salvador, enforced by dictatorial government and [full of issues regardless](https://www.youtube.com/watch?v=XVAx57Ffxvg).  Congrats, you pumped up your fiat wealth with a bunch of fraud Tethers, a stolen brand name, and [marketing conferences where BTC is rarely used at all](https://www.youtube.com/watch?v=xP-_KKMSCDY).\n\n> The fact that there are BCH victims even left blows my mind.\n\nIt should.  This is true testament to how resilient the real Bitcoin community was, even in the face of sabotage and every attempt to wipe it out, which you gleefully participated in.\n\nWe're still here.  And whether you're a naive rube or a malicious attacker, it doesn't matter.  You can't do shit to shut off BCH, Bitcoin will not die, and I am glad we have purged the fake revolutionaries like you from the community.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        },
                                                                        {
                                                                            "id": "i8ux7sm",
                                                                            "author": "FieserKiller",
                                                                            "score": 1,
                                                                            "created_utc": 1652729926.0,
                                                                            "response": "well written   \n!lntip 500",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i8uxa32",
                                                                                    "author": "lntipbot",
                                                                                    "score": 1,
                                                                                    "created_utc": 1652729951.0,
                                                                                    "response": "Hi u/FieserKiller, thanks for tipping u/i_shoot_guns_321s **500** satoshis!\n***\n*[^(More info)](https://xnf5cwpq73.execute-api.us-west-2.amazonaws.com/prod/info) ^| [^(Balance)](https://www.reddit.com/message/compose/?to=lntipbot&subject=balance&message=!balance) ^| [^(Deposit)](https://www.reddit.com/message/compose/?to=lntipbot&subject=deposit&message=!deposit 10000) ^| [^(Withdraw)](https://www.reddit.com/message/compose/?to=lntipbot&subject=withdraw&message=!withdraw put_invoice_here) ^| ^(Something wrong?  Have a question?) [^(Send me a message)](https://www.reddit.com/message/compose/?to=drmoore718)*",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "id": "i8vwko0",
                                                                            "author": "Certain-Cold-1101",
                                                                            "score": 1,
                                                                            "created_utc": 1652745443.0,
                                                                            "response": "Seems like you care more about the price going up than anything else",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i8uc448",
                                                    "author": "sneakpeekbot",
                                                    "score": 1,
                                                    "created_utc": 1652721438.0,
                                                    "response": "Here's a sneak peek of /r/Buttcoin using the [top posts](https://np.reddit.com/r/Buttcoin/top/?sort=top&t=year) of the year!\n\n\\#1: [Butter Makes Cringe Video in an Attempt to Mock r/buttcoin](https://youtu.be/3tGtmiQTg4s) | [229 comments](https://np.reddit.com/r/Buttcoin/comments/rkhlfi/butter_makes_cringe_video_in_an_attempt_to_mock/)  \n\\#2: [Butterbot Spends $115k on Transaction Fees to Spam the mETH Buttchain with Advertisements for His Ponzi Scams....Peak Bubble?](/r/ethereum/comments/rtpd1h/why_is_this_address_sending_thousands_of_0_eth/) | [25 comments](https://np.reddit.com/r/Buttcoin/comments/ru6aye/butterbot_spends_115k_on_transaction_fees_to_spam/)  \n\\#3: [If we are \"just as bad\" as the butters...](https://np.reddit.com/r/Buttcoin/comments/ov6i6y/if_we_are_just_as_bad_as_the_butters/)\n\n----\n^^I'm ^^a ^^bot, ^^beep ^^boop ^^| ^^Downvote ^^to ^^remove ^^| ^^[Contact](https://www.reddit.com/message/compose/?to=sneakpeekbot) ^^| ^^[Info](https://np.reddit.com/r/sneakpeekbot/) ^^| ^^[Opt-out](https://np.reddit.com/r/sneakpeekbot/comments/o8wk1r/blacklist_ix/) ^^| ^^[GitHub](https://github.com/ghnr/sneakpeekbot)",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i8uc8fs",
                                                    "author": "RemindMeBot",
                                                    "score": 1,
                                                    "created_utc": 1652721486.0,
                                                    "response": "I will be messaging you in 10 years on [**2032-05-16 17:17:05 UTC**](http://www.wolframalpha.com/input/?i=2032-05-16%2017:17:05%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/btc/comments/uqt5am/price_does_affect_imho/i8uc328/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fbtc%2Fcomments%2Fuqt5am%2Fprice_does_affect_imho%2Fi8uc328%2F%5D%0A%0ARemindMe%21%202032-05-16%2017%3A17%3A05%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20uqt5am)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8u8dp6",
                    "author": "Luc1nity",
                    "score": 0,
                    "created_utc": 1652719953.0,
                    "response": "Algo\nXlm\n\nThere are plenty of coins that beat BCH for transactional purposes. The market is trying to show you you chose a shit coin, your seeing the signs, but you came to an extremely biased sub so you didn't have to confront your cognitive dissonance. You hopped into an echo chamber rather than confronting your own thoughts, decisions and logic. DCA ethereum during the dip and thank me later.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}