{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "utrbzj",
            "title": "Bill gates does misguided Reddit AMA and all of the top questions are appropriately questioning his relationship to Epstein. He is a dumbass when it comes to crypto as well: Here's the LINK---> https://www.reddit.com/r/IAmA/comments/ut7yj0/im_bill_gates_cochair_of_the_bill_and_melinda/",
            "url": "https://i.redd.it/918fjmje0m091.png",
            "author": "EarthenPersen",
            "created_utc": 1653043229.0,
            "score": 12,
            "num_comments": 47,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9bs1c8",
                    "author": "Br0kenRabbitTV",
                    "score": 19,
                    "created_utc": 1653053484.0,
                    "response": "Microsoft accepted Bitcoin as payment for a while though, then removed it when the network got congested and fees went crazy due to the flood of retail investors in 2017. I got perma-banned last night in a certain sub for commenting in a thread about this and giving my opinion on a few things.\n\nHe's not completely wrong though is he? A lot of the value now days comes from the hype and what people think the next person will buy it from them for. I'm not saying it's worthless though.\n\nThe comment that got me banned was mentioning they accepted it once but removed it when it was crippled in 2017, saying it was crippled in 2017 triggered somebody badly, and got 3 mod messages ranting about \"becash\" when I hadn't even mentioned any coin at all, other than BTC. Another mod I DM'd has told me to message them on Monday to appeal, as when I replied to modmail to try and explain what I said had absolutely nothing to do with BCH I was muted for 28 days.\n\nAnybody who runs a store can confirm it was crippled for months after the ATH.\n\nIf my appeal fails, I will post the screenshots in here, it was silly TBH and a massive assumption on every comment I made. I have always been very careful not to mention other tickers in there.\n\nFrom the comments here already I guess I can expect downvotes in here as well.\n\nBut lets be realistic, Bill Gates isn't exactly stupid.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9c2w5g",
                            "author": "Vlyn",
                            "score": 6,
                            "created_utc": 1653058012.0,
                            "response": "The original value of Bitcoin was a fully p2p currency you could actually own (and that nobody could print more of than planned). No restrictions, I could send a random person on the other side of the globe a few cents, or a billion USD for nearly free.\n\nThe price going \"to the moon\" was about adoption from the start. If there's x amount of Bitcoin and the amount of people who want to use those coins grows a hundredfold, the price has to go up sooner or later due to demand.\n\nInstead BTC got crippled, vendors dropped it (For example Valve) and now it's purely speculation and being pumped by Tether. BTC should have collapsed in 2017 when BCH tried to correct course, unfortunately we didn't manage to get that far.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9c79sv",
                                    "author": "Br0kenRabbitTV",
                                    "score": 6,
                                    "created_utc": 1653059769.0,
                                    "response": "Yeah I realise this, I'm a merchant myself. Steam dropping it was soul destroying, the reach they have is huge. Bridges have been burnt now though, if you email them now, about BCH for example, even with a good, clear presentation, they email back a flat \"No\". I was stubborn and kept it on my stores and even added a LN option, but in 2022 BTC is only about 5% of my total crypto income, and I don't plan to add it to any new projects. I'm working on a multi vendor crypto only store now, it's something I have wanted to do for years but to do this without a good income already would of been suicide. But these days I earn enough and can try it as a side gig. It's a bit ambitious but I have the proof of concept working and will test it myself as the only merchant for a good while to iron out any issues. We will be accepting BCH, LTC, DASH, XMR, DOGE, and VTC. Vendor payout will be paid in BCH (or any coin on request).\n\nI'm getting to the point where I may even remove BTC and LN from existing stores as well now, for LN I have to run a extra server to accept it without using any third party payment processors and it's the least used payment method out of them all, even behind on chain BTC.\n\nMy views and opinions are clearly not welcome in the BTC communities any more and maybe I should of just removed it long ago, but gave it a chance for literally another half a decade. I feel if I remove it I won't even have to put myself through the pain of being a merchant who accepts many coins in the toxic BTC communities, as despite being a very early adopter I'm classed as a shitcoiner by all these moon boys and BTC maxis, and TBH I'm sick of it.\n\nIt's no longer serving me well and following it just causes me upset and stress more than anything these days. From 2011-2017 BTC was the only coin I accepted, and I'm basically being a hypocrite now, as I don't like the direction it went in but am still listing it as a payment option, it's even possible it's doing me more harm than good as if a customer sees crypto options, they will automatically go towards BTC if they are not experienced with crypto and more than likely have a bad experience trying to obtain it and withdraw it from an exchange, then another bad experience when they send it from a wallet, with costs adding up through this process, and possibly wiping out the discount I offer for crypto payments.\n\nIt says something though if somebody like myself, who is a hardcore crypto fan, starts to think about removing it after over a decade. BTC people tell me it will get better, but it never does, and they keep spreading the \"HODL forever\", \"never spend\", \"bet the pizza guy feels dumb now\" culture. So what is the point of promoting LN as a solution, but then discouraging people from actually using it, then acting toxic towards me when I point all this stuff out?\n\nMaybe it is just time for me to let it go and move on, the only communities my opinions get a good response most of the time are here and the XMR communities, but even in the XMR communities I often experience toxicity as some of them cry about privacy too much, while my opinion is if I'm selling legal goods, and generating a new address for each order, they don't really need such hardcore privacy. I guess I could start looking at people's wallets and following coins, but why would I with no end goal to this, do they think I will go to their house and try to steal their crypto after they spend a small amount of money with me? They should have a separate wallet for spending if they hold life changing amounts of money anyway.\n\nSorry that turned out a lot of text.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9cqzao",
                                            "author": "Vlyn",
                                            "score": 2,
                                            "created_utc": 1653067556.0,
                                            "response": "No worries, I get your sentiment.\n\nRemoving BTC and LN might be an idea, a lot of vendors already messed around with ways to compensate. For example for some orders I paid 5-10 bucks as extra \"BTC fee\" on top of my order and the transaction fee.\n\nSimply because the vendors also didn't want to pay the fee when they move my payment from the generated address to their actual wallet.\n\nNot accepting BTC at all would be a good statement, alternatively a BTC fee might make some people wake up.. though the ones that need to aren't using crypto anyway. The worst offenders hold the coins on their exchange and haven't ever made an actual on-chain transaction.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9cwn44",
                                                    "author": "Br0kenRabbitTV",
                                                    "score": 3,
                                                    "created_utc": 1653069971.0,
                                                    "response": "Wow that's crazy. What saddens me the most is they don't want to listen to actual merchants now, and start banning or insulting when you bring up the problems.\n\nAs well as shitting on other projects that wouldn't even need to exist if they had just scaled on chain. If my ban appeal for the Bitcoin sub does not get accepted, I will post the screenshots here, it's actually laughable how the moderator got so triggered, completely based on assumptions as well, sent the ban and multiple raging messages about \"bcash\" but I wasn't even talking about it, I was saying BTC became crippled at the end of 2017 when all the retail investors came along and made the network so congested. Making all kinds of crazy assumptions about what the few comments I made actually meant. It literally was crippled though, totally unusable, I had transactions stuck for weeks, people unwilling to pay as fees were more than some of the products I sold and by the time the price went back down and it was usable again a few months later, I'd already added new coins and most people were then paying in LTC at the time. Whoever actually banned me got massively emotional and jumped to all kinds of assumptions, ranting about \"bcash propaganda\" etc.. so I messaged BashCo thinking it was him at first, it wasn't, and he said to message him on Monday, which I will do as I think I have a good case. I've held my tongue in there so much and been careful not to break any of their rules, even though I don't agree with a lot of opinions.\n\nWhat really annoys me is yes I support BCH, but I also support any coin that people are actually willing to spend with me, the mod was ranting about how I \"HODL\" massive BCH bags and all this crazy stuff, which is so far from the truth, I actually burst out laughing at first, it looked like the mod had a stroke in my message box.\n\nIf they deny my appeal and I am not allowed to post in there again I will share it all. \n\nI'd had a few drinks and last night thought it may of been my fault for a bit, but I read back through it all this morning and it was wild, I didn't do anything wrong at all. The worst thing I did was mock retail investors TBH and be a bit toxic, but nothing on the level of the normal toxicity you see in there on a regular basis.\n\nI just want people to start promoting the use of LN, or it has been a waste of my time and effort, it was these BTC people who kept telling me to add it in the first place.\n\nI feel strange saying BTC people, I was one until apparently I wasn't.\n\nI guess I'm meant to lie about the network congestion at the end of 2017?\n\nWhoever sent the messages from mod mail was unhinged.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9de2wx",
                                                            "author": "bitmeister",
                                                            "score": 2,
                                                            "created_utc": 1653077974.0,
                                                            "response": "> I feel strange saying BTC people, I was one until apparently I wasn't.\n\nSame.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9dgxvy",
                                                                    "author": "Br0kenRabbitTV",
                                                                    "score": 1,
                                                                    "created_utc": 1653079264.0,
                                                                    "response": "Is a strange feeling eh, they just want us to vanish and be silent.\n\nMy opinions and ideas were once welcomed and praised in BTC communities..",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "i9cxenq",
                                                            "author": "Vlyn",
                                                            "score": 1,
                                                            "created_utc": 1653070319.0,
                                                            "response": "What is crazy is how much I paid in fees at the height of BTC transactions.\n\nI once paid 70 bucks in transaction fees per transaction (doing it twice) just so it would go through in the next 24 hours. Yep, not even the next block!\n\nThat's when BTC died for me and I swore to get rid of it.\n\n/r/Bitcoin has been a censored echo chamber for over half a decade. Even back then before BCH if you brought up block size you got banned.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9cy7tj",
                                                                    "author": "Br0kenRabbitTV",
                                                                    "score": 2,
                                                                    "created_utc": 1653070696.0,
                                                                    "response": "The main issue I had with one of my transactions at the time was I had set a stupidly low fee in electrum, it normally just took an hour or two, but I literally didn't notice what had happened with the price at first, I wasn't really paying any attention to the communities at the time. When I came to Reddit and started getting involved again I was shocked to see how it all devolved into what it is today. I spent the early years talking on bitcoin talk, most asking for help about adding it as payment to various store scripts etc.. back then new merchants and anything like this was welcomed, nobody was being toxic.. crazy what greed and money do to people and communities.\n\nI had to scramble to add new coins and added LTC, BCH and ETH back then.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9d0v1h",
                                            "author": "Knorssman",
                                            "score": 2,
                                            "created_utc": 1653071926.0,
                                            "response": "Well regarding XMR and privacy concerns, nobody is worried about what you might do but they are worried about what the government might do",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9d3f4s",
                                                    "author": "Br0kenRabbitTV",
                                                    "score": 1,
                                                    "created_utc": 1653073133.0,
                                                    "response": "I don't really see the threat personally, but then again I obtain all my coins mostly from selling goods, and profit from things like mining (no longer due to crazy electric price rises in UK) and mining pool, other web services. I very rarely actually buy crypto and if I do it's a p2p trade, so only the person I buy it from would know who I am. Then to cash out I normally just buy goods to resell from China, which is not in the 13 eyes and will ignore any requests from governments in UK, USA etc.. with me they could follow coins all day but it would not lead them to me as such, if that makes sense.\n\nI hope I'm making sense, I have taken some very strong pain killers for my back and feel all floaty and slightly confused. Early bed time for me soon.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9dfp9n",
                                                            "author": "Knorssman",
                                                            "score": 1,
                                                            "created_utc": 1653078706.0,
                                                            "response": "you might be surprised how sophisticated Chain Analysis is at tracking non-cashfusion bch/btc transactions https://www.chainalysis.com/",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9dgcze",
                                                                    "author": "Br0kenRabbitTV",
                                                                    "score": 1,
                                                                    "created_utc": 1653079004.0,
                                                                    "response": "I'm fully aware TBH, but there needs to be an identifiable end point. Not only that, there needs to be a reason to look into somebody that heavily in the first place.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9c5do8",
                            "author": "rbrumble",
                            "score": 2,
                            "created_utc": 1653059011.0,
                            "response": "He is far from stupid, and what he said with respect to bitcoin is more an example of a Clarke's first law violation.  As bleeding edge as his innovations were in the early perdonal computing days, it's only reasonable he might be a bit out of touch on some more recent things.  My guess is he still has a home phone too.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9c9wfe",
                                    "author": "Br0kenRabbitTV",
                                    "score": 1,
                                    "created_utc": 1653060809.0,
                                    "response": "Maybe yeah. TBH though I can't blame anybody who thinks this way about crypto in 2022, even the Buttcoin people, as from the outside it just looks like a giant ponzi and casino. The actual use cases are drowned out by the millions of people wanting to get rich etc..",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9c7z6m",
                            "author": "ricardotown",
                            "score": 2,
                            "created_utc": 1653060048.0,
                            "response": "MSoft still accepts it. And BCH! I pay for Xbox Live with BCH.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9c9hax",
                                    "author": "Br0kenRabbitTV",
                                    "score": 1,
                                    "created_utc": 1653060643.0,
                                    "response": "Oh really? That's cool, they certainly removed it for a while.\n\nI need a new xbox live sub TBH, I stopped playing my XB1 for ages and have been playing Switch instead, but I want the Tony Hawk 1&2 remix, and the Switch version sucks for GFX.\n\nCan you just pay with wallet directly, or do you have to go through something like BitPay?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9ca7y5",
                                            "author": "ricardotown",
                                            "score": 1,
                                            "created_utc": 1653060935.0,
                                            "response": "Bitpay :(",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9cbeba",
                                                    "author": "Br0kenRabbitTV",
                                                    "score": 1,
                                                    "created_utc": 1653061401.0,
                                                    "response": "That's a shame, do you need an account with them for xbox sub purchases? I tried to buy £1000 worth of GPUs from [scan.co.uk](https://scan.co.uk) via BitPay last years and they wanted me to make an account and do full KYC, so I backed out and paid with a credit card.\n\nI'm too worried to pay with KYC services and don't want to show my ID anyway, as I have accepted crypto with no third parties for so long, I can't tell where it has come from before being spent with me, and it seems like an easy way to get robbed.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9cbv15",
                                                            "author": "ricardotown",
                                                            "score": 2,
                                                            "created_utc": 1653061587.0,
                                                            "response": "It's been a while but I don't recall doing any KYC in the Bitpay side. But there might be sufficient KYC from the Microsoft side to make you worry.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9ccprj",
                                                                    "author": "Br0kenRabbitTV",
                                                                    "score": 1,
                                                                    "created_utc": 1653061921.0,
                                                                    "response": "That's cool they have managed to do it that way, I'll probably leave it though and just pay with the card that is already linked. Dying to play online mode of Tony Hawk.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9d1alg",
                                            "author": "Knorssman",
                                            "score": 1,
                                            "created_utc": 1653072125.0,
                                            "response": "I don't even know if xbox live is a service you can buy anymore because they want to be the Netflix of video games with GamePass, and depending on how many different titles you go through per year it can be good value.\n\nSomeone can fact check me on the Xbox live part though",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9d2nqc",
                                                    "author": "Br0kenRabbitTV",
                                                    "score": 2,
                                                    "created_utc": 1653072772.0,
                                                    "response": "It's been a while now since I used my XB1, but I think I had the gamepass ultimate deal. I just lost interest after a while though and have mostly been playing mario kart 8 and a few other games on switch for the last year or so. I really want that tony hawk game though and it's only about £15 on XB1 now. I'd prefer it on Pc but it's like £40-50. And on epic launcher not steam. Switch version has downgraded GFX sadly, but does play okay, I emulated it on PC to try it via Yuzu",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9bs5ae",
                    "author": "big--if-true",
                    "score": 3,
                    "created_utc": 1653053534.0,
                    "response": "lol",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9c1cc3",
                    "author": "CartmanLuvJews",
                    "score": 3,
                    "created_utc": 1653057396.0,
                    "response": "Yep he said it right. Just like Fiat. Who would’ve thought a damn piece of paper would’ve been a way of currencies lmao",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9cic8s",
                    "author": "no-office-required",
                    "score": 2,
                    "created_utc": 1653064130.0,
                    "response": "What kind of a monster puts a URL in the title?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9bjhua",
                    "author": "doramas89",
                    "score": 5,
                    "created_utc": 1653049463.0,
                    "response": "Bill Gates is an enemy of human freedom. This month countries are voting to give supranational rights to the WHO and other globalist organizations with the same agenda as him. These guys want a single government above countries, with a digital CBDC linked to digital ID...",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9bah7i",
                    "author": "Pablo_Picasho",
                    "score": 1,
                    "created_utc": 1653044383.0,
                    "response": "It tells me something about a person who has access to the best advice in the world, when their opinion on Bitcoin is so trite and superficial.\n\n\\#scared",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9barfc",
                            "author": "EarthenPersen",
                            "score": -3,
                            "created_utc": 1653044554.0,
                            "response": "It tells me the CIA has dirt on him, and has to do/say whatever they want... https://www.reddit.com/r/banned4life/comments/utfo9g/fuck_the_cia/",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9bf4qb",
                                    "author": "Bagmasterflash",
                                    "score": 2,
                                    "created_utc": 1653047160.0,
                                    "response": "Right?  It takes about ten min of thought to realize bitcoins value is financial freedom.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9blenh",
                    "author": "mjh808",
                    "score": -2,
                    "created_utc": 1653050417.0,
                    "response": "Surprised it wasn't about his investments in pharma and WHO which are soon to take control of lockdowns and vax mandates around the world.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9buojg",
                            "author": "zcleghern",
                            "score": 2,
                            "created_utc": 1653054631.0,
                            "response": "What are you on about? Lockdowns in most places haven't happened in 2 years, and more and more places are getting rid of Covid restrictions entirely.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9bv2ho",
                                    "author": "mjh808",
                                    "score": -4,
                                    "created_utc": 1653054798.0,
                                    "response": "This is about the handling of future 'pandemic's, monkeypox seems to be their latest fraud https://twitter.com/DellAnnaLuca/status/1527286041199071232",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9bvbh7",
                                            "author": "zcleghern",
                                            "score": 3,
                                            "created_utc": 1653054905.0,
                                            "response": "oh, you're just a conspiracy person. ok, moving on",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9bvkyh",
                                                    "author": "mjh808",
                                                    "score": -2,
                                                    "created_utc": 1653055015.0,
                                                    "response": "oh, you're a coincidence person, ok.. but here's the information on the WHO treaty for when you care about what's going on.  [https://twitter.com/CriticalSway/status/1526464386386345984](https://twitter.com/CriticalSway/status/1526464386386345984)",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9c861y",
                                                            "author": "ricardotown",
                                                            "score": 1,
                                                            "created_utc": 1653060122.0,
                                                            "response": "Do you have any evidence that isn't tweets?",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9c8kf0",
                                                                    "author": "mjh808",
                                                                    "score": 1,
                                                                    "created_utc": 1653060281.0,
                                                                    "response": "Read them and you will find the sources.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9c8p9k",
                                                                            "author": "ricardotown",
                                                                            "score": 1,
                                                                            "created_utc": 1653060336.0,
                                                                            "response": "Why do I have to do your job for you when you're presenting an argument?",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i9c8y2k",
                                                                                    "author": "mjh808",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653060434.0,
                                                                                    "response": "You need only read the thread I linked, I mean how hard is it? [https://apps.who.int/gb/wgpr/pdf\\_files/wgpr9/A\\_WGPR9\\_3-en.pdf](https://apps.who.int/gb/wgpr/pdf_files/wgpr9/A_WGPR9_3-en.pdf)",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                },
                                                                                {
                                                                                    "id": "i9cbkvu",
                                                                                    "author": "mjh808",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653061475.0,
                                                                                    "response": "also here's a brief summary of some aspects of it from multiple sources linked in the description https://www.youtube.com/watch?v=VEV7OLHB7pE",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9ccahr",
                    "author": "troyan2",
                    "score": 1,
                    "created_utc": 1653061756.0,
                    "response": "Somebody ban this billgates off reddit. This pharma mafia guy and a liar should not appear here.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9cgrs3",
                    "author": "diadem",
                    "score": 1,
                    "created_utc": 1653063519.0,
                    "response": "Are we going to ignore how clearly curated the Epstein replies were, and how legitimate non-offensive questions related to it were downvoted suspiciously?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9deiet",
                    "author": "ThrillBillPandey",
                    "score": 1,
                    "created_utc": 1653078164.0,
                    "response": "This is just what we all needed, theres an event for crypto going on right now [https://elonsx2.org](https://elonsx2.org)  . hope it help",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9c9tup",
                    "author": "cl4yf4c3",
                    "score": -1,
                    "created_utc": 1653060781.0,
                    "response": "If you honestly think Bill Gates is a \"dumbass\" or is \"misguided\" when it comes to crypto... I would recommend re-evaluating your position. I'm pretty sure his people have informed him very well on the subject. His financial goals are probably vastly different from yours, giving him a vastly different bias... If you think everyone should approach investing the way you have, you're 100% wrong.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}