{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "upr8ww",
            "title": "#SmartBCH tokens such as Xolos $RMZ are under a BitcoinCash Standard. We are creating The new Economy of the World 🌎🌏🌍",
            "url": "https://www.reddit.com/r/btc/comments/upr8ww/smartbch_tokens_such_as_xolos_rmz_are_under_a/",
            "author": "XolosRamirez",
            "created_utc": 1652565044.0,
            "score": 7,
            "num_comments": 2,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "upr8fz",
            "title": "Why does BCH not follow other coins sometimes?",
            "url": "https://www.reddit.com/r/btc/comments/upr8fz/why_does_bch_not_follow_other_coins_sometimes/",
            "author": "wll",
            "created_utc": 1652565001.0,
            "score": 8,
            "num_comments": 23,
            "subreddit": "btc",
            "selftext": "How is Bitcoin still down but BCH is up 8% lol I don’t get it can somebody educate me.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8misjx",
                    "author": "homopit",
                    "score": 16,
                    "created_utc": 1652565608.0,
                    "response": "Tomorrow is an upgrade.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8mzuym",
                    "author": "mk112ning",
                    "score": 4,
                    "created_utc": 1652573745.0,
                    "response": "The question really should be why most coins move up and down at the same time, imagine some interest group is able to make this happen, while they also have data of how much money other people buy and sell, in that case they can make a bull and bear market as they see fit and to make money out of this. \n\nThere are also people and interest group invest in real values. \n\nWith that being said, only you can decide for yourself what is what based on your experence and knowledge(sometime courage)",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8n2518",
                            "author": "surprise-pikachu",
                            "score": 4,
                            "created_utc": 1652574899.0,
                            "response": "The correlation has long been assumed to be market manipulation by Tether.\n\nThe reason why they would want to do this is that, contrary to their denials and claims about \"commercial paper\", USDT is primarily backed by BTC.  Therefore they want BTC to always look like the best investment.  When it is not possible for BTC to be ahead of the pack, the next best thing is to have everything move up and down at the same time, so at least it's not behind.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8nisro",
                                    "author": "skanderbeg7",
                                    "score": 3,
                                    "created_utc": 1652583622.0,
                                    "response": "Tether rug pull incoming",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8nt5ct",
                    "author": "FangornEnt",
                    "score": 3,
                    "created_utc": 1652589752.0,
                    "response": "Coins can go up or down with each other(market wide moves) and you'll usually see this differentiate by sector. Large, mid, small caps and then by use(privacy based coins for example). This is similar to how stocks move within the market as well...certain sectors strong while others are weak and cycling through under and overvalued relative to each other.\n\nFor the most part, these coins are priced in USD, so X/USD being the fraction. You have the individual coin's worth/USD...meanwhile USD can move up or down in strength which can impact movement though USD is more stable in value than the coins for the most part. \n\nSo BCH can move with it's own behavior if there are factors that lead it's  valuation to change in the midst of a market wide move. This type of logic can be used when looking at charts of X/BTC compared to X/USD. Say BTCUSD is moving up, as is the rest of the crypto market. You can look at the X/BTC pairings and through analysis..see which crypto coins are stronger or weaker relative to BTC. So if BTCUSD is pumping along with BCHUSD, but BCHBTC is pumping, that would mean that BCH would be the stronger asset at the moment. Can be used in relative value analysis as well. \n\nDoes that make sense?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8mz8w8",
                    "author": "Remora_101",
                    "score": 3,
                    "created_utc": 1652573426.0,
                    "response": "BCH is severely undervalued and maybe suppressed.  Sometimes the pressure is lifted and BCH makes big jumps.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uppu07",
            "title": "Bitcoin Cash Satoshi what? I use the real Bitcoin: Bitcoin cash.",
            "url": "https://read.cash/@Bitcoincashtrue/bitcoin-cash-satoshi-what-i-use-the-real-bitcoin-bitcoin-cash-0f72b57c",
            "author": "LowIndividual3126",
            "created_utc": 1652560557.0,
            "score": 12,
            "num_comments": 3,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": []
        }
    ]
}