{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uyv0va",
            "title": "European Central Bank is issuing warnings again and again to avoid BTC and crypto. However, citizens are not at all ready to listen to it. What can be the reason behind the community ignoring ECB?",
            "url": "https://www.reddit.com/r/btc/comments/uyv0va/european_central_bank_is_issuing_warnings_again/",
            "author": "Trinitysjm",
            "created_utc": 1653646250.0,
            "score": 8,
            "num_comments": 1,
            "subreddit": "btc",
            "selftext": "Even after showing unparalleled potential, De-Fi and cryptocurrencies, including BTC, aren't sustainable as per ECB.     \nAs per Daily Coin, BTC and other digital assets have no economic value or future. The body is issuing warnings frequently to implement regulations and stop the growth of the market.  However, the demand for Cryptocurrency isn't stopping and growing exponentially.    \nThe reason behind it might be the promising future of crypto. Utility based projects like Ripple and TokLok are still expanding the community more. Ripple has taken the place of payment gateways due to its speed and transaction fees. While TokLok is a messaging app that provides over-the-par privacy by deleting all data for its servers and keeping it confidential to users only that has topped that sector surpassing signal too.   \nThere are numerous other contributing projects to the expansion of De-Fi. ECB might remain successful in convincing regulators of countries to implement restrictions.   \nBut, looking at the craze, it seems impossible to regulate any massive change or hinder the growth of cryptocurrencies.BTC and markets are near to their all-time-lows of the last three years. It seems the community is used to crashes now, and sentiments are the market will even grow to new heights after downfalls like it is doing again and again.That is my opinion what is yours?",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uyv32c",
            "title": "So this sub is rotten as well",
            "url": "https://www.reddit.com/r/btc/comments/uyv32c/so_this_sub_is_rotten_as_well/",
            "author": "LukyLukyLu",
            "created_utc": 1653646506.0,
            "score": 0,
            "num_comments": 3,
            "subreddit": "btc",
            "selftext": "So my yesterday post was removed from this sub although this sub describe itself as \"it was created due hard censorship of r/bitcoin and r/CryptoCurrency\".\n\nSo i clearly see now that crypto world is full of idiots and doesn't matter if it is bitcoin or solana community but it is like that.\n\nI invested my life savings in Solana, it is crashing to zero and they dont even allow me to put my opiniion about the asset or crypto in their subbreddit.\n\nThat's how do you behave to your shareholder.\n\nSo fuk you Solana, fuk you BTC community and fuk you all.\n\nYou are group of scammers, and behave like China or Russia leaders even. All is rotten.\n\nhttps://preview.redd.it/4k2of4lfuz191.png?width=1532&format=png&auto=webp&s=508da8f12d524b62bf918b925f51381e74dc5a04",
            "stickied": false,
            "comments": [
                {
                    "id": "ia6dg8w",
                    "author": "PackLongjumping4935",
                    "score": 1,
                    "created_utc": 1653646963.0,
                    "response": "Just because you decided to over invest in a project and it’s price is declining (along with almost every asset in the world😂) doesn’t mean it’s cool to hop online and start trashing it. I don’t invest in solana personally but I can see why it would be taken down.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia6dhl2",
                    "author": "CDSagain",
                    "score": 1,
                    "created_utc": 1653646993.0,
                    "response": "\"That's how do you behave to your shareholder.\"\n\n\"Shareholder\" ☹️☹️ \n\nIf you angry that you have lost your savings, be angry at the people who sucked you into thinking bitcoin/cryptocurrency was a get rich quick, digital gold investment scheme rather than a new useable peer to peer electronic cash as the people in this sub promote.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}