{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uqvipy",
            "title": "Loopring (ETH L2 token) users are même'ing their tokens home from Coinbase on a dAnK NEW template. They are transmitting a unit of cultural information by repeated action and imitation from one mind to another. Meme them home! #Memerun.",
            "url": "https://i.redd.it/yehhopjl5uz81.png",
            "author": "2q_x",
            "created_utc": 1652706307.0,
            "score": 0,
            "num_comments": 7,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8tl4iu",
                    "author": "mtrycz",
                    "score": 4,
                    "created_utc": 1652710346.0,
                    "response": "Coinbases fuckup with LRC was expecially egregious. To the best of my understanding they had only some 10k LRC at hand, and suspended withdrawals for longer-than-usual times. \n\nI don't dislike Coinbase in general, expecially wrt the CEX context, but still can't trust *any* CEX.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8tr63y",
                            "author": "Aggravating_Deal_572",
                            "score": 1,
                            "created_utc": 1652712954.0,
                            "response": "That is why i pull my coins out of the cex right after i purchase them! And gonna start to use Dexès from now on...",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8tusah",
                            "author": "2q_x",
                            "score": 1,
                            "created_utc": 1652714462.0,
                            "response": "Yea, I suspect the Coinbase rumors are FUD for manipulation of $COIN stock. I think we'd get a few hundred warning signals before CB ran out of coins.\n\nWhat's interesting to me here is that the LRC community is using this to move users onto private keys in an EXTREMELY powerful way. \n\nClearly people shouldn't screenshot their Electron-Cash balances or Monero wallet, but the zeroing out on CEXs and meming it has an element that *Bring Them Home* and Monerun did not. \n\nI think this could meme could see widespread adoption in many communities of over-shorted crypto assets.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8th3yq",
                    "author": "2q_x",
                    "score": 1,
                    "created_utc": 1652708495.0,
                    "response": "Users moving to private keys *en mass* is getting downvoted here?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8tl6b5",
                            "author": "MobTwo",
                            "score": 2,
                            "created_utc": 1652710368.0,
                            "response": "I have absolutely no idea what I'm looking at. I assume others might have the same problem. I read multiple times what you wrote and I am guessing you mean they are using memes to encourage people to hold their own coins.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8tovad",
                                    "author": "2q_x",
                                    "score": 2,
                                    "created_utc": 1652711980.0,
                                    "response": "https://np.reddit.com/r/loopringorg/\n\nUsers are zeroing out their Coinbase balances to move tokens to their own wallets and taking screenshots for Karma. They're showing that they own their tokens and transmitting that information to others for them to repeat. \n\nWhile the MSM uses *meme-this* and *mem-that* to describe certain assets in a derogatory way, it's also accurate in the literal sense here. So it's possible to subvert the media's presentation using the literal definition of what a meme is:\n\n> A unit of cultural information, such as a cultural practice or idea, that is transmitted verbally or by repeated action from one mind to another.\n\nThey are using this template to establish a cultural practice that prevents exchanges from loaning user funds to shorts.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8tpdo5",
                                            "author": "MobTwo",
                                            "score": 2,
                                            "created_utc": 1652712197.0,
                                            "response": "Thanks for the explanation.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}