{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ushzap",
            "title": "An Introduction to read.cash",
            "url": "https://www.reddit.com/r/btc/comments/ushzap/an_introduction_to_readcash/",
            "author": "Protokkol",
            "created_utc": 1652894495.0,
            "score": 1,
            "num_comments": 0,
            "subreddit": "btc",
            "selftext": " hi guys check out about read.cash fir Bitcoin cash\nhttps://read.cash/@Protokkol/how-i-got-into-readcash-my-introduction-post-fbeb5f94",
            "stickied": false,
            "comments": []
        },
        {
            "id": "ushxtx",
            "title": "China bans BTC – China’s mining share goes up by 20% and succeed as second largest BTC contributor regardless of enacted BTC mining prohibition.",
            "url": "https://www.reddit.com/r/btc/comments/ushxtx/china_bans_btc_chinas_mining_share_goes_up_by_20/",
            "author": "Raelynn765",
            "created_utc": 1652894387.0,
            "score": 1,
            "num_comments": 0,
            "subreddit": "btc",
            "selftext": "China’s BTC shares rose over 22% in September and fluctuated to 20% in January. It’s been said that mining activities may be undergoing regardless of the ban issued against cryptocurrency transactions and BTC mining. \n\nThe Chinese government pulled themselves out of the cryptocurrency game because they felt the mining and cryptocurrency effect on the environment wasn’t safe, and so attracts a lot of financial fraud and money laundering. \n\nHowever when it comes to BTC mining, there’s a large number of resources and electrical power consumption, so it’s no wonder how the sudden increase in china’s BTC shares didn’t go unnoticed by the CCAF’s Bitcoin electricity consumption index (CBECL). It seems the ban wasn’t accepted by a few Chinese  BTC miners, and they decided to run their mining operations covertly around it.\n\nBitcoin mining profit growth seems to have dwindled a little since March 2021, and due to this current collapse in BTC, it has reached an all-time high in difficulty. A lot of cryptocurrencies were affected by this sudden collapse including the second-largest cryptocurrency Ethereum and even a stable coin, terra luna. A few other competitive coins like XRP, solis, and Tezos seem to be doing well enough currently, after the news of the collapse in cryptocurrencies. \n\nBTC mining is still undergoing in various countries despite the dip, and china is now the second-largest significant contributor to BTC mining operations even with the ban in place. According to https://www.coindesk.com/podcasts/the-breakdown-with-nlw/new-data-shows-underground-bitcoin-mining-thriving-in-china/ china’s shares plummeted to 0% in July, and August, it was suggested that it could be due to foreign proxy services masking their location so they can undergo further mining operations.\n\nWill China succeed in being the number one BTC contributor, and through illegal means?",
            "stickied": false,
            "comments": []
        },
        {
            "id": "ushvif",
            "title": "Was China’s ban of Bitcoin Mining the reason behind BTC’s decline?",
            "url": "https://www.reddit.com/r/btc/comments/ushvif/was_chinas_ban_of_bitcoin_mining_the_reason/",
            "author": "ElizaAdalynn343",
            "created_utc": 1652894204.0,
            "score": 0,
            "num_comments": 0,
            "subreddit": "btc",
            "selftext": "Bitcoin is still in the red and I continue to blame China for this. China prohibited Bitcoin mining in its areas few months ago which arrived at an inopportune moment and it started the decline of BTC. \n\nThen Elon Musk said Bitcoin was terrible for the environment. He was no longer allowing Bitcoin as payment for his Teslas, only days after praising Bitcoin and Dogecoin as the next greatest thing just after dollars and other currencies. Bitcoin dropped. Alt-coins have plummeted. \n\nOn Tuesday, China's government announced a new step to eradicate crypto mining enterprises from the nation. Meng Wei, a spokeswoman for China's National Development and Reform Commission, a macroeconomic planning body, stated during a news conference on Tuesday that crypto mining is a \"very damaging\" business that jeopardizes the country's goal of carbon neutrality.\n\nThe local Chinese governments welcomed us because we could buy power from them. We have fantastic incentives to generate local jobs,\" says Abdullah Han, a Chinese bitcoin miner located in Dubai and the founder of Meer Energy, a mining gear company.\n\n Due to this, MetaLoop, MetaTokyo, Faith Tribe, and more platforms contemplate adopting alternative chains.\n\nBecause bitcoin mining consumes a lot of electricity to run all computer servers, crypto entrepreneurs like Han have built data centers in rural Chinese towns to take advantage of these underutilized renewable energy sources. \n\nThe Chinese Government has accused uncontrolled cryptocurrencies of increasing financial fraud and funding illegal activities like fraud and identity theft.",
            "stickied": false,
            "comments": []
        }
    ]
}