{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uuke4g",
            "title": "Okay here's a question - BTC fees are literally as low as they can go right now. It has been like this for like 95% of the time for the past year. There's only been twice when there was a substantial fee market on bitcoin - 2017 and Q1 2021. Was the BCH hard fork really necessary?",
            "url": "https://i.redd.it/myh8wdu13t091.png",
            "author": "EnterShikariZzz",
            "created_utc": 1653129024.0,
            "score": 0,
            "num_comments": 21,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9fwrvk",
                    "author": "JonathanSilverblood",
                    "score": 5,
                    "created_utc": 1653135130.0,
                    "response": "> Was the BCH hard fork really necessary?\n\nYes, there was a divergence in consensus about what to do, and to reconcile there had to be two chains. It doesn't matter if none, one or both of those chains succeds or fails at any metric - the fork was a matter of subjective opinion at the time.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9fprlo",
                    "author": "LovelyDayHere",
                    "score": 12,
                    "created_utc": 1653129869.0,
                    "response": "I hope you realize that low fees on BTC base layer means a security failure for the store-of-value-with-L2-as-payments coin.\n\nThe BCH hardfork was done to ensure that a bitcoin with a viable economic model survives.\n\nBecause when BTC finally collapses, a lot of folks are going to get severely burned.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9fqere",
                            "author": "EnterShikariZzz",
                            "score": 1,
                            "created_utc": 1653130409.0,
                            "response": "If BTC fails because it doesn't generate a sufficient security budget from fees post block reward than BCH certainly won't either. [BCH fees in the block reward are even lower](https://bitinfocharts.com/comparison/fee_to_reward-btc-bch.html#log&3y).\n\nAlso you know that if BTC collapses the whole cryptocurrency market will collapse alongside it? Including BCH",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9fv62d",
                                    "author": "chainxor",
                                    "score": 6,
                                    "created_utc": 1653134046.0,
                                    "response": "Wrong. BCH can grow and rather quickly change those dynamics. BTC can't, not even if the whole alt market decided to go back to BTC. BCH would handle that WAY better.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9fwhn1",
                                    "author": "JonathanSilverblood",
                                    "score": 7,
                                    "created_utc": 1653134942.0,
                                    "response": "past success is not an guarantee for future performance. or some such.\n\nWhat I'm saying is that neither BTC nor BCH (nor any other PoW blockchains) are paying their security budget form fees today.\n\nWe can't know today what the future holds, but what we can know is that the structure of a limited blocksize cannot pay for the security necessary in the future withour having a high fee.\n\nThat does not mean that BCH automatically succeeds just because it can support more transactions per block, for BCH to succeed it must produce value that is attractive to users.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9fxxdc",
                                    "author": "The_Jibbity",
                                    "score": 7,
                                    "created_utc": 1653135885.0,
                                    "response": "The goal is to achieve on the order of 10,000X more transactions. The fork doesn’t look necessary for current demand, however no one knows how much more adoption Bitcoin would have if it didn’t reach it capacity as easily as it does over the las 4-6 years… the goal of scalable P2P currency is maybe silly to some but most people in this sub think it will be feasible, to achieve this the fork was necessary regardless of how things seem right now.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9g2j2c",
                                    "author": "jessquit",
                                    "score": 4,
                                    "created_utc": 1653138645.0,
                                    "response": "You're entirely right that BCH has also been failing to meet its security goals.\n\nBut BCH security goals can be met through adoption since the security model is [low fees] x [high volume]\n\nBTC's model is [high fees] x [low volume] so its goal can only be met with ever higher fees\n\nIn the long run it's a question of finding 3M ppl willing to pay $0.01 for a txn vs 3000 ppl willing to pay $10.\n\nAs you point out, BTC's fees aren't going up any more than BCH's adoption.\n\n> you know that if BTC collapses the whole cryptocurrency market will collapse alongside it?\n\nThanks Blockstream.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9g0atv",
                                    "author": "LovelyDayHere",
                                    "score": 2,
                                    "created_utc": 1653137361.0,
                                    "response": "Both your points are speculation.\n\nWhereas the halving on BTC and its self-imposed economic constraints are fairly hard to change. Even though BTC supporters have been proposing to inflate it past the 21M limit. But I guess they know it would lose even more claim to being 'Bitcoin' then.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9g5i2r",
                                    "author": "mrtest001",
                                    "score": 1,
                                    "created_utc": 1653140283.0,
                                    "response": "As long as BTC is in the top 10 crypto, it means cryptocurrency is not being used by many people for its intended purpose. \n\nSo yes, its absolutely inevitable for BTC to not just drop - by die.  Unless of course, crypto never really solved a problem the world had.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9fxm59",
                    "author": "BewareOfShills",
                    "score": 4,
                    "created_utc": 1653135681.0,
                    "response": "Yes, because the spikes and the fee auction is a way to curb BTCs adoptions and will lead to its demise when the coinbase runs out.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ftok1",
                    "author": "doramas89",
                    "score": 3,
                    "created_utc": 1653132975.0,
                    "response": "You must be trolling because this level of no-knowledge of Bitcoin is hilarious. If the fees were low it means the 4tx/sec capacity limit was not demanded enough. People have stopped using BTC, they have learned it can't process enough transactions so the world has resorted to not transacting it. Buy & spectate. Go read the whitepaper before spewing more nonsense that takes other people's time.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9fvkeo",
                    "author": "PanneKopp",
                    "score": 3,
                    "created_utc": 1653134325.0,
                    "response": "BTC Maximalism has brought down on chain usage to its lowest, forcing people into custodial 3rd party solutions or dragged them away onto other centralized blocxkchains - do you still believe BTC is \"Bitcoin\" ?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9g1neb",
                    "author": "jessquit",
                    "score": 3,
                    "created_utc": 1653138145.0,
                    "response": "Don't you understand that your argument is exactly **why** the fork was necessary?\n\nBTC is completely failing to meet its security goals. With no more additional onchain transactions possible, the only way for BTC to maintain its current security is for fees to double at least every four years. But as you point out, despite the popularity of BTC, fees have not trended up as they predicted. People simply aren't going to spend $50 on a transaction on a regular basis. They'll exit instead.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ftvgq",
                    "author": "chainxor",
                    "score": 4,
                    "created_utc": 1653133119.0,
                    "response": "YES! It was neccessary for number of reasons. BTC can't grow - and as you point out on-chain txs have flattened out (and actually fallen) since 2017., hence the lower fees. This is a serious security concern on the long run, since miners subsidies get cut in half every 4 years and if the prize stops doubling every 4 years BTC is in serious trouble. Problem is that BTC fundamentals won't be able to carry price appreciation, since on-chain transactions are not rising - propably because people know now that BTC cannot scale and has moved to other chains instead for usage. Also, Lighting Network (aside from not really working at scale) does not improve the onchain security in the long run either - quite the contrary actually.\n\nBCH might still have lower adoption than BTC (though I suspect it actually has higher adoption when it comes to payments and brick and mortar shops), but it can grow 1000x more today without having ANY problems with scaling. Planned development will up that number an order of magnitude at least in the near term.\n\nSo BCH actually has a viable path when block subsidy goes down. Sure BCH prize is still low, but if it continues to grow in usage, it is only a question of time before prize and fees from onchain transactions will outpace BTC and hence BCH end up as the chain with the most security.\n\nAlso, BCH already has better features, besides higher blockspace, such as better smart contract script features, scaling tech, faster and generally more efficient mempool code in all of the node implementations, ditto with validation and far better node implementation decentralization already today. In addition, it has a kickass EVM smartcontract sidechain called SmartBCH that nukes the competion in scalability, speed, ease of use and cheap fees compared to the competition.\n\nBCH certainly has the fundementals in place, make no mistake about that.\n\nWhat is missing is still major whale adoption and/or critical mass adoption and hence network effect. When/if that happens BCHs price will melt faces far beyond what was seen in 2017.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9g42wt",
                    "author": "mrtest001",
                    "score": 2,
                    "created_utc": 1653139512.0,
                    "response": "I am not sick right now.  Are hospitals really necessary?\n\nIts not enough for \"Bitcoin\" to be low fee every other Tuesday on a full-moon.  For it to be used as cash it needs to be low-fee 24/365 and not just for a select few, but for billions of people.\n\nIf BTC is low-fees right now it means less than 300K transactions are happening per day.  It means BTC is not being used by few hundred thousand people.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9fp0oc",
                    "author": "Kay0r",
                    "score": 4,
                    "created_utc": 1653129219.0,
                    "response": "Low fees on artificially constrained database=little transaction count.  \nBlockstream: Mission accomplished.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9g38ih",
                    "author": "FieserKiller",
                    "score": 1,
                    "created_utc": 1653139046.0,
                    "response": "It was necessary and BCH fullfills 2 functions:\n\n1. A real life sudy case of what happens when you fork off without consensus\n2. The fork took many plain crazy people with it and bitcoin progresses with much less drama and controversy ever since",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9fqt27",
                    "author": "CryptoAnarchyst",
                    "score": 0,
                    "created_utc": 1653130745.0,
                    "response": "Man, you really are stirring shit up.\n\nBTC fees have always been low relative to the security and ability to transfer large amounts of money without realized losses. Try transferring $100 million on BCH chain.\n\nYou have two fundamental issues here, one is network security and stability, second is ease of making small payments... And they always compete. Bch took the focus of making small payments but the network security is severely compromised, BTC is the opposite.\n\nAnd \"purists\" will tell you that L2, like lightning, are not what Bitcoin is about... But then fail to actually provide the security and safety brought by the size of btc network in bch format.\n\nSo no, the fork wasn't necessary...\n\n\nGood luck",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9fyju1",
                            "author": "The_Jibbity",
                            "score": 2,
                            "created_utc": 1653136290.0,
                            "response": "How is the security inherently compromised? I see people say this all the time but never put any numbers or technical details behind it. I’m fairly certain had the fork gone better for bch, and hash and price were similar for the two chains their would be nearly no difference in the security.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9g5pjw",
                    "author": "mrtest001",
                    "score": 1,
                    "created_utc": 1653140391.0,
                    "response": "So do the math with me.\n\nif BTC can process 400K txns per day.\n\nAnd BTC miners are getting $1B / month in block reward and fees.\n\nWhat SHOULD the fees be for 400K txns a day to take over $1B / month?  Answer $80.\n\nSo if its \"basically free\" , is that a good thing or a bad thing?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9fqjj4",
                    "author": "swgo1",
                    "score": -5,
                    "created_utc": 1653130522.0,
                    "response": "Heresy!!!!!",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}