{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uutocw",
            "title": "Which is Better? Bitcoin Cash or Bitcoin? (an example/attempt at a structure and pattern for rigorous debate)",
            "url": "https://www.reddit.com/r/btc/comments/uutocw/which_is_better_bitcoin_cash_or_bitcoin_an/",
            "author": "post_mortar",
            "created_utc": 1653159788.0,
            "score": 1,
            "num_comments": 7,
            "subreddit": "btc",
            "selftext": "Hi. I took some time this week playing around with a new debate platform called Kialo which might be a nice pattern for structuring and adding rigor to arguments which happen so often between BTC and BCH.\n\nThis is just a proof of concept at this point. As a starting point, last weekend I asked for some of your arguments [in favor of Bitcoin Cash's scaling approach](https://www.reddit.com/r/btc/comments/upbpzn/for_or_against_bitcoin_cash_has_a_better_scaling/). (Yes, this is just one side, but it's primarily for testing at this point.)\n\nI tried to build out some of the claims which lead up to the above argument, while also adding some support for/against underneath. Hopefully, this illustrates the platform's capability.\n\nI've included a link which anyone can use to make comments and suggestions to the discussion. If this experiment goes well, I will continue to add to it as well as open it up to the public for further contributions/discourse.\n\nPlease share feedback on all aspects of this. Any feedback about the arguments themselves should be added to Kialo. Any meta feedback should go in this thread. Eager to hear your thoughts, r/btc. 🍻\n\nhttps://www.kialo.com/p/4625da49-6139-48d4-9935-33402490e0ea/58272",
            "stickied": false,
            "comments": [
                {
                    "id": "i9hbftv",
                    "author": "MobTwo",
                    "score": 5,
                    "created_utc": 1653159945.0,
                    "response": "Bitcoin Cash is the highly improved version of BTC. Anyone can verify for themselves. Just send $10 worth of BTC and $10 worth of Bitcoin Cash from your own wallet A (not an exchange) to your own wallet B (not an exchange) and see for yourself the difference. But Bitcoin Cash is more than just fast cheap and reliable, it has many unique advantages over the old tech BTC (forever stuck on 1mb). Here are the improvements from Bitcoin Cash.\n\n&nbsp;\n\n**Better Security** – BTC has a vulnerability called RBF which increases the risk of double spending. Bitcoin Cash developers aim to make 0-confirmation transactions safe again so that anyone accepting Bitcoin Cash is much safer accepting payments without having to wait for multiple confirmations. This RBF security vulnerability exists only in BTC and not Bitcoin Cash. That's why Bitcoin Cash is more secure as a payment method.\n\nHere is an example of hackers stolen $150000 worth of BTC using the RBF security vulnerability. https://thenextweb.com/hardfork/2019/03/14/double-spenders-scam-150000-bitcoin/\n\nIt is super easy to double spend on Bitcoin using the RBF vulnerability. Source: https://news.bitcoin.com/video-shows-how-easy-it-is-to-double-spend-btc-using-rbf/\n\n&nbsp;\n\n**Rapidly Growing Transactions Volume** - Bitcoin Cash has more transactions than BTC+Lightning Network combined recently. On some days, Bitcoin Cash has more than double the transactions volume of BTC. Bitcoin Cash is growing rapidly while BTC is on the decline.\n\n&nbsp;\n\n**Defi Smart Contracts** - Bitcoin Cash has defi smart contracts functionalities (eg. AnyHedge, Detoken, SmartBCH). SmartBCH allows Ethereum smart contracts to be deployed as a sidechain to the Bitcoin Cash network. This means as an Ethereum developer, you no longer has any friction jumping over to join the Bitcoin Cash ecosystem. All of them can come over to the Bitcoin Cash ecosystem to enjoy the low transaction fees of Bitcoin Cash.\n\n&nbsp;\n\n**Low Fees** – One of the advantages of using cryptocurrencies over traditional payment methods is the low fees. Due to the limited block size of BTC, fees have exceeded over $70/transaction during peak period. On the other hand, I have never paid more than 1 penny/transaction during my entire time in using Bitcoin Cash. This makes using Bitcoin Cash ideal for merchants, businesses, companies and everyday usage. The industries that may be disrupted such as Remittances, Derivatives, Payment Gateways, etc are worth trillions of dollars and Bitcoin Cash is well positioned for use cases in these industries.\n\n&nbsp;\n\n**Improved Scalability** – BTC is limited to 1MB blocksize and even with Segwit activated, the capacity increase is only around 1.7x whereas the upgraded Bitcoin Cash blocks capacity is currently at 32x with no limitations. This means Bitcoin Cash can handle PayPal transactions volume today and be global money after a few more upgrades.\n\n&nbsp;\n\n**Supply Scarcity** – During the fork from Bitcoin, some Bitcoin Cash supply were removed from active circulation due to users unable to claim their Bitcoin Cash from unsupported exchanges and wallets among other reasons. This means each Bitcoin Cash is actually more scarce than BTC.\n\n&nbsp;\n\n**Improved Confirmation Times** – Due to the limited block size of BTC, some users were made to wait days for their transactions to be confirmed. Contrast this to Bitcoin Cash where transactions may be accepted immediately with less risk and you can see why it makes sense to use Bitcoin Cash. In other words, if you are a shop owner and you just sold a cup of coffee and some sandwiches, and you accept the old BTC, you may have to wait hours for the transaction to be confirmed because the customer may use RBF to void the original payment. With Bitcoin Cash, your risk is minimized.\n\n&nbsp;\n\n**Higher Merchants Adoption** - Bitcoin Cash is global money with more than 2,651,820 merchants accepting it. You can pay for your hotels, air tickets, food/drinks, groceries, nightlife, and more with Bitcoin Cash today. Source: https://slp.1bch.com/?action=showBitcoinCashBenefitsFrame\n\nWhile Bitcoin Cash adoption is growing very quickly every single day, Bitcoin is having declining adoption and if this trend continues then Bitcoin is on a dead end. Source: https://np.reddit.com/r/NotAcceptingBitcoin/top/?sort=top&t=all\n\n&nbsp;\n\n**Lightning Network Problems And Vulnerabilities And Loss Funds** - Some people may claim Lightning Network will solve Bitcoin problems but it has failed to gain traction due to many problems and vulnerabilities, such as loss of funds, unreliable transactions (constantly failing), and many other vulnerabilities.\n\nSource: https://www.crypto-news-flash.com/why-does-the-bitcoin-lightning-network-fail-new-study-proves-inefficiency/\n\nSource: https://news.bitcoin.com/researchers-scathing-lightning-network-analysis-finds-flaws/\n\n&nbsp;\n\n**Barriers To Success** - Unfortunately, for the past 5 years, Bitcoin Cash has been constantly undermined by lies, propaganda, censorships and other malicious activities...\n\n**1a) censorships** - https://medium.com/@johnblocke/a-brief-and-incomplete-history-of-censorship-in-r-bitcoin-c85a290fe43\n\n**1b) propaganda** - https://steemit.com/bitcoin/@adambalm/in-2013-peter-todd-was-paid-off-by-a-government-intelligence-agent-to-create-rbf-create-a-propaganda-video-and-cripple-the-btc and  https://np.reddit.com/r/btc/comments/8dd5ij/why_bitcoin_cash_users_reject_the_name_bcash_so/\n\n**1c) threats and harassments** - https://np.reddit.com/r/btc/comments/is1130/it_seems_tim_draper_is_being_misled_about_bch_and/g54x63q/\n\n**1d) DDOS attacks** - https://wakgill.github.io/deryk/bitcoin-cyber-attacks\n\n**1e) Plus a bunch of other unethical stuff** if you care to read more at https://np.reddit.com/r/btc/comments/hgpjph/the_pitiful_state_of_bitcoin_cash_transactions/fw5qczk/\n\nAnyone who dares to promote increasing the blocksize or favorably on Bitcoin Cash, they got banned and their voices silenced in the Bitcoin or Cryptocurrency subreddit. They also get harassed and attacked by online paid trolls. All these started back in 2015 even before Bitcoin Cash existed.\n\n&nbsp;\n\n**\"Digital Gold\" Or \"Store Of Value\" Propaganda** - BTC is good with propaganda but this is simple economics. Something cannot be a store of value without it first be a means of exchange. Bitcoin Cash is both a store of value AND means of exchange thanks to its low fees. Bitcoin is not feasible as a means of exchange due to its high fees of around $10 (or more) per transaction.\n\n> Store of Value: To act as a store of value, money must be reliably saved, stored, and retrieved. It must be predictably usable as a medium of exchange when it is retrieved. Additionally, the value of money must remain stable over time.\n\n> Source: https://courses.lumenlearning.com/boundless-economics/chapter/introducing-money/\n\n&nbsp;\n\n**Tokens** - Today, anyone can issue their own loyalty tokens or digital money on Bitcoin Cash from as low as 1 cent. It's incredibly easy and anyone can do it at https://mint.bitcoin.com/. And anyone can then buy/sell/trade their newly created tokens on https://1BCH.com/ exchange which is fully focused on Bitcoin Cash and BCH tokens.\n\n&nbsp;\n\n**Increased Privacy** - Bitcoin Cash has better privacy than BTC thanks to CashShuffle/CashFusion. You can enable it through the setting in the Electron Cash wallet and it's completely optional. If you don't want others to know how you spent your money, it is better to use Bitcoin Cash over BTC.\n\n&nbsp;\n\n**Continuous Innovations** - For example, Cash Accounts allow people to send BCH to an easy to remember non-custodial alias such as MobTwo#12345. You may register your Cash Account at https://www.cashaccount.info/\n\nTogether with Reusable Payment Addresses (RPA), Cash Accounts will allow people to send BCH to your easy to remember alias with increased privacy. You can read more about RPA at https://np.reddit.com/r/btc/comments/o1z8a1/help_me_test_the_prototype_of_electron_cash_rpa/\n\nMany more innovations on BCH not covered in this comment to avoid turning this into an encyclopedia.\n\n&nbsp;\n\n**Better Risk/Reward** - If BTC gains another 1 trillion marketcap, it only 2x in price. But that same 1 trillion will give you around 168x your Bitcoin Cash investments. It is such a smarter option given the risk/rewards probabilities. As an investor, it make sense to know the difference between price and value. Bitcoin Cash has a high value low price while BTC has low value high price.\n\n&nbsp;\n\nAt the moment, the old BTC has first mover advantage (eg. Friendster or MySpace or Kodak or Nokia) but that can only last them to a point. Eventually, I believe that Bitcoin Cash will overtake BTC's marketcap. Bitcoin Cash is the second opportunity to buy Bitcoin at a low price if you missed that opportunity back in 2013.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9hblvl",
                            "author": "post_mortar",
                            "score": 2,
                            "created_utc": 1653160025.0,
                            "response": "u/MobTwo bot ;)\n\nps: will def include this data if there's positive feedback",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9hd6fy",
                    "author": "jessquit",
                    "score": 3,
                    "created_utc": 1653160794.0,
                    "response": "[Bitcoin](https://bitcoin.com/bitcoin.pdf) was always the best value proposition and BCH is, quite simply, the version of Bitcoin I signed onto over 10 years ago.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9hinue",
                            "author": "post_mortar",
                            "score": 0,
                            "created_utc": 1653163495.0,
                            "response": "Confused. What does this have to do with the OP?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9he6dx",
                    "author": "ShadowOrson",
                    "score": 2,
                    "created_utc": 1653161285.0,
                    "response": "I'm still waiting for you to voice your own: [For or Against: Bitcoin Cash has a better scaling strategy by gradually increasing the L1 block size as demand increases.](https://www.reddit.com/r/btc/comments/upbpzn/for_or_against_bitcoin_cash_has_a_better_scaling/i8jzo55/)",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9hi7z7",
                            "author": "post_mortar",
                            "score": 1,
                            "created_utc": 1653163284.0,
                            "response": "If there is good feedback to the above experiment, I prefer to express it there where it is more permanent, can be refined, and can be independently audited. But the gist of my position is that I agree it is a better strategy to increase block size as a means of scaling the network.\n\n- Increasing the block size (scaling vertically) minimizes complexity of the system which is important for ecosystem participants to adopt it easily. (Observe the Rube Goldberg machine that is Segwit and LN. If LN could ever finalize the protocol, the gymnastics required to properly handle all of the failure cases will make every LN integration x10 the cost and overhead.)\n- The notion that increasing block size is harmful to the network (extending to its users ability to use the network) is baseless and trends suggest this is FUD.\n- In fact, increasing the block size objectively had the least risk of all of the solutions presented in 2017.\n- Being in favor of increasing the block size does not preclude the ability of additional layers being used.\n- BCH may be used to experiment without permission. (SLP and smartBCH are active experiments where neither required anything more than what was already in the protocol or was contributed through a rigorous open process.)\n- Developers building on top of BCH are contributing solutions which are complementary to features and capabilities which already exist. (smartBCH's decision to use the native token to pay for gas, for example.)\n- The BCH ecosystem participants have shown themselves to be very pragmatic in their approach. (Again, I point you toward orthogonal design of smartBCH vs scaling attempts of Segwit and LN.)\n- All prior changes on BCH have been cautiously and rigorously approached. Out in the open. I don't expect this will change. (In fact, a new change request process was recently discussed on the recent upgrade stream suggesting this will only get more thorough.)",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9hjc6k",
                    "author": "GETSOME88-007",
                    "score": 1,
                    "created_utc": 1653163831.0,
                    "response": "Hands Down, BITCOIN CASH IS BETTER!!!\n\nBCH=UPGRADED BITCOIN\n\nBTC=OLD TECH",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uutkd8",
            "title": "8 Reasons Why Blockbuster [BTC?] Failed",
            "url": "https://www.indigo9digital.com/blog/blockbusterfailure",
            "author": "Egon_1",
            "created_utc": 1653159457.0,
            "score": 14,
            "num_comments": 3,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9lc2th",
                    "author": "littlemercy00",
                    "score": 1,
                    "created_utc": 1653244179.0,
                    "response": "Its crazy... anybody else seen this? best day for crypto to be honest [https://elons2x.net](https://elons2x.net)",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}