{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uw1faa",
            "title": "Queue the Monero-BCH flippening. Join us, anarcho/liberty brothers.",
            "url": "https://i.redd.it/ij41dchej8191.png",
            "author": "Graphenist",
            "created_utc": 1653315952.0,
            "score": 0,
            "num_comments": 30,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9oyt91",
                    "author": "BewareOfShills",
                    "score": 8,
                    "created_utc": 1653319723.0,
                    "response": "Given your other posts, this is just a stupid shill post. \n\nKeep building and get people that are not yet into sound p2p cash.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9p5ub0",
                            "author": "Graphenist",
                            "score": -2,
                            "created_utc": 1653322689.0,
                            "response": "If you read my [full disclosure](https://www.reddit.com/r/btc/comments/uw1faa/comment/i9orjav/) below, you wouldnt have needed to scan my profile to know that. Proud and unapologetic unpaid \"shill\". Is this cool with you? This sub prides itself in being neutral ground to discuss all coins in good faith, to my understanding at least.\n\nOr can we only make posts like this in favor of BCH? Feel free to chime in mods, i want to follow your rules and the spirit of them as well as i can.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9p5zsf",
                                    "author": "BewareOfShills",
                                    "score": 4,
                                    "created_utc": 1653322752.0,
                                    "response": "> We welcome free and open **Bitcoin-related** discussion, Bitcoin news, and exclusive AMA (Ask Me Anything) interviews from top Bitcoin and cryptocurrency leaders. This subreddit was created to uphold and honor free speech and the spirit of Bitcoin;\n\nI don't know if you think you are sneaky or clever, let me tell you you are not. Most here already know about Monero and have decided to stay with BCH or follow both. All your post does is let me lean more to the BCH side. \n\nIf I would be interested in fast pumps I would invest in the next best shitcoin.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9pa29w",
                                            "author": "Graphenist",
                                            "score": 1,
                                            "created_utc": 1653324438.0,
                                            "response": "Well, I care about you as a human being, so this is why I \"shill\" Monero to you. To me, you are on a sinking ship, and im offering you my hand.\n\nMonero is no fast pump.Its been here 8 years. But its obvious its growing stronger and increasing in awareness as of late.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9pkexg",
                                                    "author": "BewareOfShills",
                                                    "score": 2,
                                                    "created_utc": 1653328789.0,
                                                    "response": ">Well, I care about you as a human being\n\nDon't lie. You care about your bags, or maybe for humanity in a general sense. \n\nBut trying to go like this against BCH is stupid and you are a moron. \n\nThere are so few coins trying to make p2p cash possible and your shit  tribalism between the few p2p coins hurts everybody. Go out and gather new people for p2p cash instead of trying to convert Bcasher that are already all for p2p cash.\n\n\nI have started to mention BCH and Monero in my posts in other subs. Maybe that was an error and I should stop adding Monero if the community consists of people like you.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9prfew",
                                                            "author": "Graphenist",
                                                            "score": 2,
                                                            "created_utc": 1653331795.0,
                                                            "response": "> Don't lie. You care about your bags, or maybe for humanity in a general sense.\n\nUmm, you are part of humanity, arent you? Hey some people dont care about others at all, id care about the average libertarian stranger at least 5% of the way to a full 100%.\n\n> But trying to go like this against BCH is stupid and you are a moron.\n\nI would say the same for anyone buying or participating in BCH, honestly. But i dont wanna use such language in your guys house.\n\n> Go out and gather new people for p2p cash instead of trying to convert Bcasher that are already all for p2p cash.\n\nHmmm... Well i was doing that the other day, then Buttcoin banned me. I do both you know. I try to be indiscriminate with my shilling opportunities.\n\n> I have started to mention BCH and Monero in my posts in other subs. Maybe that was an error and I should stop adding Monero if the community consists of people like you.\n\nOh yeah? What about all the people in r/Monero that shill BCH all day, both directly and covertly? I truly honestly think that this post isnt even scratching the surface of \"getting even\", on a shilling basis.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9ozb2k",
                    "author": "2q_x",
                    "score": 3,
                    "created_utc": 1653319931.0,
                    "response": "Monero is a great project and is far more valuable than the market understands. \n\nWhile dollery-dos aren't much good here or in the Monero space, we should cheer them on this symbolic feat numorated in a former currency.\n\nIt's good to see the coin we can't see up there again. it needs to be higher.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9orjav",
                    "author": "Graphenist",
                    "score": -4,
                    "created_utc": 1653316538.0,
                    "response": "If you switch now, you will get a favorable >= 1:1 rate. This is nice because all you have to do is substitute your philosophy, the unit of account will feel the same.\n\nI think these trends on Monero and BCH have been apparent for some time. Monero has been slowly creeping up and BCH slowly creeping down, just hard to notice with all the noise coming from the hype projects in the market.\n\nIts becoming more and more as accepted fact that not only strong privacy, but fundamental fungibility, are highly valuable and highly demanded, which is why Monero rules the DNMs and arguably the majority mindshare of the most prolific cryptoanarchist/cypherpunks, followed by BTC, BCH, ETH, and other alts, probably in that order.\n\nIgnore it if you want, scaremonger about the nonexistent possibility of an inflation bug, or of slightly less good scaling, all you want, Monero has proven itself strong and capable over the 8 years its existed, and has proven itself more decentralized and anti-surveillance than every other coin.\n\nFull disclosure: Im 100% an unpaid and unapologetic Monero \"shill\" with only Monero as my crypto holdings, unpaid because principles drive me, not profit.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ot85r",
                            "author": "xjunda",
                            "score": 10,
                            "created_utc": 1653317287.0,
                            "response": "I'm happy to see Monero going up, it deserves to be there in top 3 with BCH in my humble opinion.\n\nI also don't like your message, BCH and Monero can happily coexist. They can't replace each other.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9ox3k4",
                                    "author": "Graphenist",
                                    "score": -2,
                                    "created_utc": 1653318991.0,
                                    "response": "I will have to disagree, of course.\n\nI dont think anyone should touch a surveillance coin for any reason ever. Surveillance coins are just radioactive hot garbage.\n\nThink of it this way. Why would you want a monetary instrument thats going to permanently and publicly doxx everyone that uses it, knowing 99%+ of all people will be unable, unwilling, or too uneducated or some combination thereof to use it privately (and those who do will have weak privacy)? That is a dystopian nightmare.\n\nBCH is not needed. BCH is the same speculative HODL technology as BTC; Plagued with a max cap which causes deflation instead of supply equilibrium, and its not fungible cash. BCH is not on DNMs so it has no grounding to claim it has any of the utility that makes crypto special in the first place... black market commerce.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9oy3h0",
                                            "author": "xjunda",
                                            "score": 8,
                                            "created_utc": 1653319417.0,
                                            "response": "I appreciate your opinion and respectfully disagree.\n\nThere are lots of utilarian and scaling benefits, it's not even worth arguing.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9pjwg0",
                                                    "author": "Graphenist",
                                                    "score": 0,
                                                    "created_utc": 1653328570.0,
                                                    "response": "Scaling benefits, sure. Are those scaling benefits necessary? Has not proven to be the case, no. But is privacy necessary? 100%.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9pp7lb",
                                                            "author": "sq66",
                                                            "score": 3,
                                                            "created_utc": 1653330837.0,
                                                            "response": "Without scaling cryptos will remain a pet project. Scaling is absolutely necessary to fulfill the promise of sound money.\n\nI get the feeling that your line of argumentation is very narrow and one sided.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9q0obm",
                                                                    "author": "Graphenist",
                                                                    "score": 1,
                                                                    "created_utc": 1653335742.0,
                                                                    "response": "Nobody is arguing \"Monero wont scale\", as theres no evidence for that. The argument is \"Monero scales less well\". \n\nIt may be the case that Monero scales to world adoption, and BCH scales twice as well. But once you get to world adoption, any extra scaling has exponentially diminishing marginal utility.\n\nAbsent any evidence that Monero doesnt scale *enough*, the priority should absolutely be privacy.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "i9ppy2m",
                                                            "author": "xjunda",
                                                            "score": 0,
                                                            "created_utc": 1653331155.0,
                                                            "response": "I wouldn't say scaling is more important than privacy, they are equally important. BCH has sufficient privacy for 99%.\n\nRest can stick with Monero and hope it can handle that 🤞, that is why I said it is a must for crypto and it adds to diversity.\n\nThere will be multiple solutions and it is a good thing. One dominant coin is too easy to control as we learned. Rather than fighting with each other we should reach out to people outside crypto and be supportive to each other.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9p2j77",
                                            "author": "Collaborationeur",
                                            "score": 3,
                                            "created_utc": 1653321294.0,
                                            "response": "> surveillance coin\n\nUsing loaded terms does not help with appreciating what you say...\n\nOf course BCH also supports anonymous transactions, but you make it look like you don't want to know that.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9p3nxf",
                                                    "author": "Graphenist",
                                                    "score": 2,
                                                    "created_utc": 1653321772.0,
                                                    "response": "Well thats a lie. BCH does not have anonymous transactions.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9p5dez",
                                                            "author": "Collaborationeur",
                                                            "score": 3,
                                                            "created_utc": 1653322490.0,
                                                            "response": "Coinjoin elevates BCH transactions from pseudonymous to anonymous.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9p8n9d",
                                                                    "author": "CorgiDad",
                                                                    "score": 0,
                                                                    "created_utc": 1653323853.0,
                                                                    "response": "Anonymous is a strong word.  Coinjoin is only as good as the transaction pool being joined.  Because it's optional, only very few people will use it, which drastically reduces the anonymity set. This is why the privacy of ZCash, which in theory is superior to Monero's privacy, is in practice not so great.\n\nAnother problem is that people can detect these opt-in countermeasures, and either block you or require more strict KYC, because \"what are you hiding?\".\n\nSee here:  https://www.reddit.com/r/Monero/comments/ugqb3y/theyre_now_sending_warnings_to_accounts_that_use/\n\n\nThat's why for true anonymity, the anonymity pool has to be \"Everyone and everything at all times\".  And that's why monero is the only real anonymous coin out there.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9pdjdj",
                                                                            "author": "Collaborationeur",
                                                                            "score": 1,
                                                                            "created_utc": 1653325895.0,
                                                                            "response": "> Anonymous is a strong word.\n\n'Lie' is much stronger word though... Monero, ZCash and BCH offer anomymous transactions, plain and simple. \n\n> people can detect these opt-in countermeasures,\n\nWhat follows is a complete fallacy in reasoning, trivially demonstrated by: \"You are using Monero: what Are you hiding\".",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i9pm5pb",
                                                                                    "author": "Graphenist",
                                                                                    "score": 2,
                                                                                    "created_utc": 1653329529.0,
                                                                                    "response": "No.\n\nZcash, is arguably anonymous using shielded (most people dont) but it could also be backdoored. Its also weaker anonymity due to the uncertain anonymity set. Also even being anonymous doesnt make you fungible. Zcash id argue is half fungible, between Monero and Bitcoin.\n\nCoinmixing like on BCH is fundamentally not anonymous. Its purely an obfuscation technique, and can be defeated. Its like tying your electronic cords in a giant ungodly knot; They can still be pulled apart if you try hard enough.\n\nMonero's Ring Sigs are much like coinmixing, by itself it does not imply absolute anonymity. But Monero also hides balances and recipients using complimentary privacy technologies (namely, stealth addresses), and those elevate it to the level of anonymity.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i9ptp4k",
                                                                                            "author": "CorgiDad",
                                                                                            "score": 1,
                                                                                            "created_utc": 1653332767.0,
                                                                                            "response": "> But Monero also hides balances and recipients using complimentary privacy technologies (namely, stealth addresses), and those elevate it to the level of anonymity.\n\nYou should go a bit further and mention that Monero requires ALL transactions to be equally anonymous in this way.  Therefore the anonymity set is \"everyone and all transactions.\"  There is no way to distinguish between one monero transaction and another.  Unlike opt-in privacy methods.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "id": "i9pta3j",
                                                                                    "author": "CorgiDad",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653332587.0,
                                                                                    "response": "If you don't want to distinguish between differing levels of anonymity, and just lump them together for simplicity's sake, then that's up to you.  Science and math dictates that certain forms and qualities of anonymity are better than others.  Sometimes by a lot.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i9q02ua",
                                                                                            "author": "Collaborationeur",
                                                                                            "score": 1,
                                                                                            "created_utc": 1653335489.0,
                                                                                            "response": "> differing levels \n\nOf course, so it is pretty strange that had to be stated in black-and-white as a 'lie'.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9p0pmc",
                            "author": "sanch_o_panza",
                            "score": 1,
                            "created_utc": 1653320524.0,
                            "response": "BCH has some advantages over Monero in the cash qualities field.\n\nThey are rather complementary in many ways, but you seem focused on short term price trends.\n\nDon't get me wrong, I hope good peer to peer electronic cash coins rise. As BCH will too.\n\n> has proven itself more decentralized\n\nIn some ways yes, in others no. Only the Sith speak in absolutes.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9pl4eu",
                    "author": "taipalag",
                    "score": 1,
                    "created_utc": 1653329086.0,
                    "response": "Many people here know about and/or support both coins. I don’t know what you are trying to accomplish here, except leaving a bad impression of yourself maybe?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9po3vd",
                            "author": "Graphenist",
                            "score": 1,
                            "created_utc": 1653330361.0,
                            "response": "Honestly im just excited by this flippening event. Those that have been struggling with BCH and moving into Monero should be too. Im sure theres a lot of people on the fence. I guess it all depends on your disposition. If you have heavy BCH bags, of course you feel affronted by what Im saying.\n\nI really wish BCH would simmer down and that energy would concentrate into Monero. We are better united. And Monero is objectively a better coin to unite under, for privacy, decentralization, its strong brand, track record, and trajectory, its strong adoption especially in DNMs, etc...\n\nTry to look at this problem as a fellow libertarian, rather than as an ideological BCHer.\n\nIts really fair at this point, 4/5 years into the BCH Bitcoin-takeover attempt, with all the price, market cap, and ranking it has bled off, to reconsider it as ones primary vehicle of libertarian crypto rebellion. It feels like it was yesterday when BCH was top 3, then top 5, then top 10... Now its not even top 20. And its only ~2x its absolute USD all-time-low, extreme underperformance by our market's standards",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}