{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uuj9ks",
            "title": "BCH is just money",
            "url": "https://www.youtube.com/watch?v=yM4gNVme5a0",
            "author": "MemoryDealers",
            "created_utc": 1653123623.0,
            "score": 51,
            "num_comments": 43,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9fk0qm",
                    "author": "PublicCurrency9039",
                    "score": 13,
                    "created_utc": 1653124602.0,
                    "response": "Love the video, humor, and BCH light!! Most important, is the down to earth message, that BCH is easy to use for everyday shopping! Everyone can understand and appreciate that message!! It has great utility!!! BCH, it’s a part of everyday living!!!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9iy1iq",
                            "author": "btc2okpay",
                            "score": 1,
                            "created_utc": 1653190925.0,
                            "response": "BCH isn't just an investment but a safe shelter to economic collapse far better than BTC. \n\nBecause it's a currency that is practical to spend (and not solely a SOV).",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9i4ths",
                    "author": "tompater",
                    "score": 3,
                    "created_utc": 1653174845.0,
                    "response": "Price suppression is just an opportunity to accumulate more.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9gbajr",
                    "author": "Fsmv",
                    "score": 7,
                    "created_utc": 1653143172.0,
                    "response": "This is amazing. We need to run this ad everywhere.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9iohzl",
                            "author": "ZachFultz",
                            "score": 5,
                            "created_utc": 1653185530.0,
                            "response": "A simple look at the Bitcoin Cash fundamentals will tell you .\n\n Bitcoin Cash is the closest mankind has come to inventing ideal money.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9gmllv",
                    "author": "AZEMK",
                    "score": 5,
                    "created_utc": 1653148416.0,
                    "response": "Core can hate on Bitcoin Cash all they want but the fact is.\n\n Bitcoin Cash overtaking BTC in every metric is simply inevitable.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9i74gx",
                    "author": "hegjon",
                    "score": 2,
                    "created_utc": 1653176084.0,
                    "response": "Classic! :)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9iijjr",
                    "author": "pacman78",
                    "score": 1,
                    "created_utc": 1653182309.0,
                    "response": "Great video! Who made it?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9loyds",
                    "author": "big--if-true",
                    "score": 1,
                    "created_utc": 1653250042.0,
                    "response": "Great video.............................BRO",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9orh13",
                    "author": "Warm-Top-4816",
                    "score": 1,
                    "created_utc": 1653316510.0,
                    "response": "Love this, part of what attracted me to this project. It seems like it's only the BCH community who are very comfortable spending their coins every day. \n\nI've gotten into the habit of spending BCH a lot, sometimes i convert my other holdings like shiryo when i just feel like holding.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9gp3zf",
                    "author": "Da0ptimist",
                    "score": -10,
                    "created_utc": 1653149562.0,
                    "response": "LOL. \"Money\" worth less and less evey day.  Down 75% from a year ago. \n\nMeanwhile BTC is only down 22%  dowjones almost 20% \n\nSo enjoy being part of a cult. Worked great for the Luna people.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ji96s",
                            "author": "i_have_chosen_a_name",
                            "score": 0,
                            "created_utc": 1653206608.0,
                            "response": "BCH is up 50% from 2 weeks ago, meanwhile Bitcoin is down 50% from 6 months ago.\n\nIf you put a 1000 dollars in to BCH 2 weeks ago you now have a 1500 dollars. If you put a 1000 dollars in to Bitcoin 6 months ago you now have 500 dollars.\n\nWho is laughing now?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9jr1v8",
                                    "author": "RemarkableFanatic",
                                    "score": 1,
                                    "created_utc": 1653214692.0,
                                    "response": "Aside from the math not actually being quite correct to begin with, this is obviously not a sound way to make any kind of reasonable comparison. Assume you were going for a funny/idiotic thing here. \n\nIf you believe this makes sense, then better buy Luna! Up 50% in just one day. If you put 1000 dollars into Luna yesterday, and 1000 dollars into BCH 1 year ago...Well, you know the outcome. Because, this is how a fair comparison works.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9kgvl5",
                                            "author": "i_have_chosen_a_name",
                                            "score": 2,
                                            "created_utc": 1653230708.0,
                                            "response": ">Aside from the math not actually being quite correct to begin with, this is obviously not a sound way to make any kind of reasonable comparison.\n\nJust as unreasonable as this guy just calling an arbitrary date to compare the two.\n\nAlso the maxi objective is numbers go up. The BCH objective is tx growth. The price of BCH really does not matter as long as there is enough security that the network remains operational which depends on total sha256 hash in the system as about 60% of the hash is from pools willing to defend bch if needed.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9kw2et",
                                                    "author": "RemarkableFanatic",
                                                    "score": 1,
                                                    "created_utc": 1653237343.0,
                                                    "response": "Oh no, the price most definitely matters.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9kwf8s",
                                                            "author": "i_have_chosen_a_name",
                                                            "score": 1,
                                                            "created_utc": 1653237490.0,
                                                            "response": "So now you decide for others what the objectives are? \n\nWhat does economic freedom have to do with numbers go up?",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9kxho2",
                                                                    "author": "RemarkableFanatic",
                                                                    "score": 1,
                                                                    "created_utc": 1653237913.0,
                                                                    "response": "Huh? No.\n\nWhat I'm saying is, besides the massive hash/security aspect, there are other issues.\n\nIf I take out $20 in cash, it's still $20 tomorrow. I expect the same here, not waking up to $15. That's useless. So, price  stability is one issue.\n\nAnother, if this coin is like number 8000 in the market cap standings, and just dropping, eventually no one's going to use it nor accept it. You need to maintain some kind of actual relevance.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9ky5m3",
                                                                            "author": "i_have_chosen_a_name",
                                                                            "score": 1,
                                                                            "created_utc": 1653238194.0,
                                                                            "response": "The security aspect is non existing as 60% of the hash on Bitcoin is under control of miners and mining pools started by Bitmain who will just put more hash on bch if needed. They have already done this multiple times in the past. As for price stability bch is less volatile then btc it came out at 400, with 350 the average price now down to 200. Also bch has stablecoins that run on it and cost less then 5 cent per tx to send. Btc does not have this.\n\nAlso 20 dollars worh of Bitcoin spread out over 3 utxo is only 10 to 15 when spend even if the price does not change.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i9l0fnm",
                                                                                    "author": "RemarkableFanatic",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653239123.0,
                                                                                    "response": "Well, my idea of security is not hoping someone will magically jump in and save you when you desperately need it. In my business (which, is incidentally, security), that would be laughed out of the room. But to each their own on that one.\n\nAs for stability, I'm not comparing to BTC. Why even bring such a random thing up? None of this has anything to do with BTC. I was comparing to actual cash - the use case you are after here.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i9l1rqm",
                                                                                            "author": "i_have_chosen_a_name",
                                                                                            "score": 1,
                                                                                            "created_utc": 1653239687.0,
                                                                                            "response": "> Well, my idea of security is not hoping someone will magically jump in and save you when you desperately need it\n\nThat's how Bitcoin works, the majority network has to work as one to protect their own interest. It's just game theory that Bitcoin miners would defend BCH as they all know that Bitcoin will eventually run out of money for security while BCH has a change to hit hunderds of millions of tx a day which can pay for security. \n\n> I was comparing to actual cash - the use case you are after here.\n\nBy far the main issue is the price instability.\n\nYou are a 100% correct that volatility in a currency makes it so that it can NOT be currency. \n\nSo what we are trying to accomplish is closed economic loops and also localized unit of account.\n\nLiquidity pool tokens with a percentage bch and a stablecoin will also help with this.\n\nStill right now it's very much a chicken and egg problem. \n\nMerchants will only want to accept it when there is demand from their customers while customers will only start using it when their merchants accept it.\n\nNobody has solved this problem yet. And 99 999 out of a 100 000 people in crypto have gotten distracted by the get rich quick scheme. Which ain't going to work. Less than 1 out of a 100 000 people is going to get rich from crypto and that money will come from the 99 999 losers.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i9karwt",
                                    "author": "Da0ptimist",
                                    "score": 0,
                                    "created_utc": 1653227788.0,
                                    "response": "There is literally no time ever that BCH is a better option than BTC. Just facts.\n\nLook at the history of BCH. It peaked in 2018.. 🤣 and steadily been dropping since. It's a dead shitcoin with a small cult.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9kb0cp",
                                            "author": "i_have_chosen_a_name",
                                            "score": 1,
                                            "created_utc": 1653227908.0,
                                            "response": "I just showed you how we all made more money the last year then btc holders. Also you guys all bought btc at 20k or more while we bought bch at under 20\n\nI litteraly became a millionaire with bch last year. I doubt you are.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9kb8bh",
                                                    "author": "Da0ptimist",
                                                    "score": 1,
                                                    "created_utc": 1653228022.0,
                                                    "response": "BCH had one of the worse returns in history of any coin in top #100.\n\nWhat you're saying would be comical if it wasn't ao rediculous",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9kcklf",
                                                            "author": "i_have_chosen_a_name",
                                                            "score": 1,
                                                            "created_utc": 1653228691.0,
                                                            "response": "You are not thinking out of the box my friend. I always long bch and short shitcoins so if bch goes down I’ll make more on the short side.\n\nAlso you dont get timing. If you buy bch at 144 and sell at 244 that’s much more profit then buying btc at 50k and selling at 30k",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9l3hwt",
                                                                    "author": "Da0ptimist",
                                                                    "score": 1,
                                                                    "created_utc": 1653240420.0,
                                                                    "response": "No one is talking about swing trading. That's a completely different point. \n\nMaking money off the fact that BCH is dying is fine. But the fact that BCH is dead remains.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9l3rl2",
                                                                            "author": "i_have_chosen_a_name",
                                                                            "score": 1,
                                                                            "created_utc": 1653240537.0,
                                                                            "response": ">But the fact that BCH is dead remains\n\nIf it's dead why are you talking about it?",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i9l7cmo",
                                                                                    "author": "Da0ptimist",
                                                                                    "score": 0,
                                                                                    "created_utc": 1653242093.0,
                                                                                    "response": "I'm talking about it just as I talk about ICP and Luna. What's your point?\n\nIt's always a good idea to warn new people to crypto about scams like BCH when these false articles are posted",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i9l8d51",
                                                                                            "author": "i_have_chosen_a_name",
                                                                                            "score": 1,
                                                                                            "created_utc": 1653242528.0,
                                                                                            "response": "False articles? It's a commercial made to stimulate usage as money. \n\nYou do realize BCH still works as money at 1 dollar, don't you?\n\nBitcoin was at 1 dollar once. And it worked.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}