{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uqkt9h",
            "title": "ATO releases its tax time hit list for 2022: Property investors and cryptocurrency traders are among key targets for the Australian Taxation Office",
            "url": "https://www.theaustralian.com.au/business/wealth/ato-releases-tax-time-hit-list-for-its-2022-priorities/news-story/17e295ed3a52318e33b5b1ef3a9f17e8",
            "author": "user4morethan2mins",
            "created_utc": 1652665573.0,
            "score": 8,
            "num_comments": 11,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8roq1t",
                    "author": "user4morethan2mins",
                    "score": 5,
                    "created_utc": 1652665640.0,
                    "response": ">“We know that many Aussies are buying, selling or exchanging digital coins and assets so it’s important people understand what this means for their tax obligations,” Mr Loh said.\n\n>Dr Raftery warned that switching cryptocurrencies within a trading account was still a taxable event, and he had seen the ATO flagging these transactions with taxpayers.\n\n>The price of the biggest crypto, Bitcoin, has halved since November, but Dr Raftery said many people still had huge gains.\n\n>“People may have bought bitcoin at $5000, then it got to $70,000, and they changed some to Ethereum, but because they effectively sold the bitcoin they have a taxable transaction,” he said.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8u4dk3",
                            "author": "simon-v",
                            "score": 1,
                            "created_utc": 1652718368.0,
                            "response": "Suppose. But, wouldn't the buying of a 1000$ of Ethereum balance the selling of the 1000$ of Bitcoin that they exchanged? It would appear that they still have 1000$ in cryptocurrencies, as before; Is there, indeed, any tax obligation?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8x5tp4",
                                    "author": "chainxor",
                                    "score": 1,
                                    "created_utc": 1652772843.0,
                                    "response": "Yes. This is the default tax stance for almost all western counties.   \n\n\nIf you want to avoid being flagged for swapping - use a DEX or a no-KYC CEX (if there are any left).",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8s54cv",
                    "author": "DuncanWhiteLDP",
                    "score": 3,
                    "created_utc": 1652674205.0,
                    "response": "Aussie crypto users should be looking into the LibDems political party. They want to classify crypto as currency to remove GCT: https://youtu.be/Cazi3C6tvhM",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}