{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "v0a95u",
            "title": "\"There were 62 killings in El Salvador on 26th March alone.\" Pinocchios thinking they can rewrite history with lies.",
            "url": "https://i.redd.it/tqnh35h6te291.jpg",
            "author": "user4morethan2mins",
            "created_utc": 1653827649.0,
            "score": 28,
            "num_comments": 15,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "iaf7i7i",
                    "author": "jessquit",
                    "score": 6,
                    "created_utc": 1653829101.0,
                    "response": "That's some seriously shameful shit right there. Appalling, but completely consistent with maxi revisionism.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaf5qzc",
                    "author": "user4morethan2mins",
                    "score": 5,
                    "created_utc": 1653828044.0,
                    "response": "Source: https://twitter.com/maxkeiser/status/1530527188251987970?s=20&t=muoHtU5COuRIgT91mC6yEw (29th May)\n\n[Why El Salvador's murder rate has surged - 30.03.2022](https://www.dw.com/en/why-el-salvadors-murder-rate-has-surged/a-61306161)\n\n[The more you lie, the easier it gets — and science can prove it](https://www.thetimes.co.uk/article/the-more-you-lie-science-fibbers-brain-psychology-jglqjqd2n)\n\n>Then there are those for whom lying appears a doddle, habitual; whose lives are spent bouncing between little fibs, misdirections, partial truths and outright whoppers. How is it that these people can sleep at night, wake up in the morning and start lying all over again?\n\n>But dishonesty is a slippery slope. The more lies participants told, the less the amygdala responded. The lies soon grew bigger and the emotional brain quieter. Eventually, participants were twisting the truth with ease, any feelings of guilt and stress having melted away.\n\n>Repetition is not the only thing that makes a liar more convincing (and less sweaty), says Sharot. Our cultural norms affect how likely we are to lie. The more severely lying is punished, the more anxiety we are going to feel about doing it. Some argue that living in an age of fake news and subjective truth, in a culture that is either indifferent to the merits of truth-telling or that rewards mendacity – sometimes even votes for it – means our worry will be lower.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaf5c9e",
                    "author": "hereforthestonks-",
                    "score": 4,
                    "created_utc": 1653827790.0,
                    "response": "Max pumping it hard! Guess he overbought on way up.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iahd8iu",
                    "author": "Spartan3123",
                    "score": 4,
                    "created_utc": 1653866223.0,
                    "response": "Max Keiser is insufferable. His basically the bitconnect guy for bitcoin but not even remotely meme worthy.\n\nAt least bitconnect contributed some decent meme's to the space",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iafqatz",
                    "author": "ytrottier",
                    "score": 0,
                    "created_utc": 1653838294.0,
                    "response": "Max's craziness is just another version of the \"Bitcoin stops war\" argument recently featured on the \"Who Killed Bitcoin?\" documentary currently at the top of this sub. It's useful to notice how people easily reject the lies associated with BTC support, but just as easily lap up lies associated with BCH support. There's something to learn about critical thinking there.\n\nAnd yes, that documentary does lie just as hard. It opens with a piece of anti-american propaganda insinuating that the US was responsible for half a million deaths in Iraq. As if Saddam Hussein would have done such a great job of caring for the children if only he had been able to bypass sanctions.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaj99vf",
                            "author": "jessquit",
                            "score": 2,
                            "created_utc": 1653911185.0,
                            "response": "Saddam Hussein was a very bad dictator and I for one am very glad he's dead. However I'm able to zoom out and realize the larger context in which he, as well as the House of Saud, the Iranian Revolutionary leadership, etc. are all byproducts of the last 100 years of Western hegemony and interference in the area.\n\nI for one, as an American, am ashamed that so much of my tax dollars go to financing war, weapons, and oppressive regimes. I'm not so naive to believe the world would be sunbeams and rainbows without Western interference, but it's clear that US meddling in the area has often gone horribly awry and that the USA, and by extension myself and the rest of the taxpayers, absolutely bears some significant responsibility for our part in the events as they turned out.\n\nI don't find any of the message to be anti-American. In fact I think that it is the actions of the USA in the region which are contrary to my vision of what it means to be American. \n\nTLDR we got the benefit of cheap oil for decades, we also bear responsibility for how we got it",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ialius7",
                                    "author": "ytrottier",
                                    "score": 1,
                                    "created_utc": 1653950868.0,
                                    "response": "Sure, US meddling has often gone horribly awry, but it's really hard to tell what would have happened in the counterfactual. It's important to realize that there are many groups that benefit from spreading anti-USA sentiment; just as you shouldn't automatically distrust criticism of your country, you shouldn't automatically trust it either. It can be confirmation bias either way.\n\nOne of the pieces of propaganda currently being promoted by anti-American groups in the middle-east is this old clip of Lesley Stahl asking a bad question based on false data, and Madeleine Albright bungling the answer and sounding callous. Not their best moment for either of them, but not representative of them either. But when taken out of context, it makes for great propaganda, especially when targeting anti-semitic audiences that would be prone to distrusting Albright to begin with. I'm not accusing you of that, but it would fit with the agenda of the groups that have been circulating that clip recently.\n\nThe question is, can you be just as skeptical towards claims that reaffirm your beliefs as to those that challenge them? Watching how easily the other side gets fooled can be a good reminder to ourselves.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iaihegs",
                    "author": "sos755",
                    "score": 1,
                    "created_utc": 1653887992.0,
                    "response": "Max has always been ridiculous. That is his shtick.\n\nBut as far as the numbers go, you are nearly 8 times more likely to be murdered in **St. Louis** than in EL Salvador (per capita).",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}