{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ut3f5a",
            "title": "What's gonna happen with our crypto after we pass away?",
            "url": "https://www.reddit.com/r/btc/comments/ut3f5a/whats_gonna_happen_with_our_crypto_after_we_pass/",
            "author": "Kindly-Finance348",
            "created_utc": 1652966835.0,
            "score": 2,
            "num_comments": 19,
            "subreddit": "btc",
            "selftext": "Even though I was asking this for some time, the comment of some guy here on Reddit really made me laugh, cause he wrote \"You take it with yourself like Egyptian did\" lol. But I think that's not the case, right?  \n\n\nI was wondering is it possible to leave it to your family as you did with other things through your will, is it necessary to go through some legal procedure?  \n\n\nImagine people who have I dunno like Bitcoin, numerous tokens, Unicoins which the invested in some companies or BAYC NFTs, there needs to be a solution to somehow leave as a legacy to your family or to whom you already want, right?  \n\n\nAnd I have another question for you, what do the people in countries where cryptocurrencies are forbidden, and how will their family members deal with legal procedures in that case?  \n\n\nI thought maybe in that case where we have countries that don't accept crypto, it would be necessary to use service exchanges such as Coinbase, cause I guess this service has a way to pass crypto assets to the third party in case of the owner's death.  \n\n\nHave you ever thought about it?",
            "stickied": false,
            "comments": [
                {
                    "id": "i979dvc",
                    "author": "fiendishcrypro",
                    "score": 10,
                    "created_utc": 1652967922.0,
                    "response": "You make sure that you're key is backed up for a loved one, otherwise lose it all.\n\nHopefully smart contracts will change this and allow for things such as a transfer to another address after a certain period of inactivity or something like that.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i97l5ko",
                            "author": "KeepBitcoinFree_org",
                            "score": 12,
                            "created_utc": 1652973005.0,
                            "response": "Deadman’s switch already exists with BCH smart contracts and Electron Cash wallet plugin. It hasn’t been updated for some time but it should still work. \n\nhttps://github.com/KarolTrzeszczkowski/Electron-Cash-Last-Will-Plugin",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i97lchb",
                                    "author": "fiendishcrypro",
                                    "score": 5,
                                    "created_utc": 1652973085.0,
                                    "response": "Hey that's great to know, thanks for the link!",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i999l0f",
                                            "author": "KeepBitcoinFree_org",
                                            "score": 1,
                                            "created_utc": 1652998853.0,
                                            "response": "No problem! I’ve been interested in using it. I’ll try to test it out soon with some smaller amounts to see how it works.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i979pyh",
                    "author": "GreenSmoke352",
                    "score": 8,
                    "created_utc": 1652968076.0,
                    "response": "If passing your coin to family after death is what u want to do put it in your will and make sure you leave your account info and your KEY CODE in the exact way its suppose to be typed out to the next in line to receive. My thoughts is leave all this in a closed sealed envelope that you can pass on without letting uncle Sam knowing about it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i97anpk",
                    "author": "LovelyDayHere",
                    "score": 3,
                    "created_utc": 1652968498.0,
                    "response": "> I was wondering is it possible to leave it to your family as you did with other things through your will\n\nOf course it's possible.\n\nAlso, take a look at this:\n\nhttps://news.bitcoin.com/last-will-platform-allows-your-loved-ones-to-inherit-your-bch/",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i97bgif",
                    "author": "Collaborationeur",
                    "score": 3,
                    "created_utc": 1652968858.0,
                    "response": "Part of what you are addressing here is the difference between ownership and possession.\n\nIf you have the keys you possess the crypto, ownership OTOH is the legal right of doing what you want with your crypto.\n\nFor instance a custodial wallet can posses your crypto while you own it. In most jurisdictions an owner has the right to claim posession, destroy, or alter or give away her crypto.\n\nTransferring ownership of crypto is a legal move, transferring possession can be done in- or outside the legal frameworks, with ramifications regarding taxes and potential challenges to ownership and such.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i98f9ai",
                    "author": "phro",
                    "score": 3,
                    "created_utc": 1652985182.0,
                    "response": "Shamir's secret sharing. You need 2 of 3 parts to get the secret. Then you give 1 part to siblings, parents, or estate lawyers.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i97s2k3",
                    "author": "Redhead_Empire",
                    "score": 0,
                    "created_utc": 1652975829.0,
                    "response": "These questions about what happens to your crypto after you die are so ignorant and stupid I’m sorry",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i98fdpv",
                            "author": "phro",
                            "score": 5,
                            "created_utc": 1652985233.0,
                            "response": "Are you a bot? There are a lot of people holding far more than the average inheritance in crypto.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i98fprg",
                                    "author": "Redhead_Empire",
                                    "score": 0,
                                    "created_utc": 1652985371.0,
                                    "response": "I am not a bot. It’s just stupid to ask what happens after you die. You give you assets to who you have written in your will just like everything else. If you don’t understand what happens to your bitcoins after you die you should not be invested in them to begin with. It’s not like the Bitcoin protocol magically knows your fucking dead",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i98i1sq",
                                            "author": "phro",
                                            "score": 5,
                                            "created_utc": 1652986323.0,
                                            "response": "I feel like you're overlooking the complexity of keeping your assets secured while you're alive and using them vs having a secure plan for inheritors to access them after you're not around to share keys with them directly.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i98jedk",
                                                    "author": "Redhead_Empire",
                                                    "score": 1,
                                                    "created_utc": 1652986870.0,
                                                    "response": "I understand it can be complex getting the keys to them in a safe way. But asking whether or not it’s even possible to pass crypto assets down to relative is just ignorant IMO",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i98khvv",
                                                            "author": "phro",
                                                            "score": 4,
                                                            "created_utc": 1652987320.0,
                                                            "response": "I'm really glad you took time out of your day to contribute that OPs questions are ignorant and stupid. Thank you.\n\nIn the future perhaps you can just click the next thread.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}