{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "v0ao73",
            "title": "Why can’t BTC maxis accept reality, this is dangerous",
            "url": "https://i.redd.it/drzs6a6bxe291.jpg",
            "author": "Egon_1",
            "created_utc": 1653829163.0,
            "score": 48,
            "num_comments": 55,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "iafu94w",
                    "author": "DeBigBamboo",
                    "score": 18,
                    "created_utc": 1653840070.0,
                    "response": "Im a bitcoiner, not really a maxi, but im here to say wtf is this guy smoking",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iai63c4",
                            "author": "54545455455555",
                            "score": 4,
                            "created_utc": 1653881174.0,
                            "response": "It's called, Hopium, hella of a drug, all the Maxis are hooked.\n\nIt makes them act completely delusional douchebags where they ignore reality.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iag5doo",
                    "author": "Frangiblepani",
                    "score": 6,
                    "created_utc": 1653845021.0,
                    "response": "Even if it were true about homicide dropping, it's a pretty big leap to say it was due to Bitcoin.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaghuep",
                            "author": "jessquit",
                            "score": 4,
                            "created_utc": 1653850804.0,
                            "response": "Now add in the fact that it's a complete fucking fabrication.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iaia3ys",
                    "author": "uneasyadventurer1769",
                    "score": 3,
                    "created_utc": 1653883359.0,
                    "response": "Why the weather is bad and the birds ain’t singing? It’s because nature has to adapt Bitcoin",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaigaf2",
                            "author": "mayosterd",
                            "score": 2,
                            "created_utc": 1653887234.0,
                            "response": "When will nature learn?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iagji21",
                    "author": "sos755",
                    "score": 6,
                    "created_utc": 1653851575.0,
                    "response": "Max is saying the same stupid stuff that he always says but let's give the numbers some perspective.\n\nWhile there have been 388 murders in El Salvador this year, there have been 135 murders in St. Louis and it is 1/20 the size of El Salvador. **You are nearly 8 times more likely to be murdered in St. Louis than in El Salvador.**",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iagliwa",
                            "author": "jessquit",
                            "score": 8,
                            "created_utc": 1653852520.0,
                            "response": "Obviously due to a lack of state-mandated Bitcoin adoption",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iahml4k",
                                    "author": "sandakersmann",
                                    "score": 1,
                                    "created_utc": 1653871181.0,
                                    "response": ":D",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iaf7rn4",
                    "author": "Egon_1",
                    "score": 3,
                    "created_utc": 1653829252.0,
                    "response": "It’s dangerous, because Max gets promoted on r/bitcoin and other channels",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iahpb2o",
                            "author": "Keith_Kong",
                            "score": 0,
                            "created_utc": 1653872606.0,
                            "response": "A lot of people there find him cringe and obnoxious too to be fair. Count me on that boat. A lot of delusional people in crypto all around for different reasons imo",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iai6e69",
                                    "author": "54545455455555",
                                    "score": 2,
                                    "created_utc": 1653881332.0,
                                    "response": "Most are complete idiots though you have to admit.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iai79do",
                                            "author": "Keith_Kong",
                                            "score": 0,
                                            "created_utc": 1653881788.0,
                                            "response": "I think Bitcoin Cash people are mostly idiots too. Most think that value growth isn’t important and that BCH is somehow working as intended because it stays relatively flat and has “fast transactions”. In reality it’s not nearly stable enough and can never stabilize without mass adoption far beyond even what Bitcoin has (where value growth would be the measure of progress in that direction).\n\nI don’t think most people in crypto have a good enough understanding of economics and think we can accomplish money in these short timespans. It’s going to take decades and requires volatile growth in between before it can really be money (and only then does fast transactions become the most important thing).",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iaik8sh",
                                                    "author": "jessquit",
                                                    "score": 1,
                                                    "created_utc": 1653890001.0,
                                                    "response": "Where we disagree is that you believe mass adoption can be achieved at 3tps.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iailaj9",
                                                            "author": "Keith_Kong",
                                                            "score": 1,
                                                            "created_utc": 1653890794.0,
                                                            "response": "Perfect example. You could have sparked a debate over Lightning as a scaling solution. You would critique the L2 for being less decentralized or less secure. The Bitcoiner would say that it’s fairly secure still and isn’t as important because you can store most of your Bitcoin on-chain with maximum security. You would make the point that BCH doesn’t have to compromise and makes cheap transactions less complicated. The Bitcoiner would reiterate that keeping the size of the blockchain small is good for long term decentralization.\n\nYou would both reach an impasse and neither would change their minds, but at least you didn’t make some stupid meme argument from 5 years ago that doesn’t represent anyone’s actual views.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "iainl8f",
                                                                    "author": "jessquit",
                                                                    "score": 1,
                                                                    "created_utc": 1653892605.0,
                                                                    "response": "My friend, I'm not trying to wind you up, but you just now quite literally rolled out two comments worth of strawman (ie. meme) arguments. You made it pretty obvious that you have a very superficial grasp of why we support BCH, you then laid out your strawman and then tore it down. You did exactly what you are complaining about.\n\nAgain my goal isn't to provoke anything but thought and reflection.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "iaioa6z",
                                                                            "author": "Keith_Kong",
                                                                            "score": 2,
                                                                            "created_utc": 1653893171.0,
                                                                            "response": "I was just laying out a hypothetical, I didn’t even declare a victor in that argument. Acting like you’re just trying to promote “thought and reflection” with “you believe mass adoption can be achieved at 3tps” is the joke here.\n\nAnyways, I am similarly not trying to wind you up–not even trying to make a specific point about Bitcoin or BCH. Just pointing out that 99% of debate is ignorant, meme-oriented, and tribal rather than thoughtful and technically/economically focused.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iafiw36",
                    "author": "ytrottier",
                    "score": 4,
                    "created_utc": 1653834928.0,
                    "response": "Not all that different from Roger's claims that BCH can end war.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iafsov3",
                            "author": "jessquit",
                            "score": 3,
                            "created_utc": 1653839363.0,
                            "response": "Pretty fucking different",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iafw8g5",
                                    "author": "ytrottier",
                                    "score": 4,
                                    "created_utc": 1653840922.0,
                                    "response": "Not a great argument.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iafz63n",
                                            "author": "jessquit",
                                            "score": 1,
                                            "created_utc": 1653842221.0,
                                            "response": "The fact that you cannot differentiate these two claims speaks volumes.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iagc5bf",
                                                    "author": "Ok_Aerie3546",
                                                    "score": 0,
                                                    "created_utc": 1653848138.0,
                                                    "response": "Its actually the exact same claim.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iaghj0v",
                                                            "author": "jessquit",
                                                            "score": 4,
                                                            "created_utc": 1653850655.0,
                                                            "response": "Are you trolling?!\n\nOne is a **prediction** that *individuals voluntarily choosing to use Bitcoin* will remove the power of the state to finance war.\n\nThe other is a **flat out lie** claiming that *the state forcing merchants to accept Bitcoin* has already eliminated murder in the country by some unexplained phenomenon.\n\nI can't believe this has to be explained but here we fucking are.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "iagm1e8",
                                                                    "author": "Ok_Aerie3546",
                                                                    "score": 1,
                                                                    "created_utc": 1653852763.0,
                                                                    "response": "It hasnt been forced on anyone. Watch any video of people going to el salvador. Most merchants arent accepting bitcoin. And no one is treated like a criminal because they did not.\n\nIts still a voluntary option.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "iah0sp4",
                                                                            "author": "jessquit",
                                                                            "score": 2,
                                                                            "created_utc": 1653859897.0,
                                                                            "response": "It's still a flat out lie.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "iah2rht",
                                                                                    "author": "Ok_Aerie3546",
                                                                                    "score": 2,
                                                                                    "created_utc": 1653860865.0,
                                                                                    "response": "Yeah the lie is based on the same claim that roger makes. The conclusion is a lie. The claim is still the same.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "iaim007",
                                                                                            "author": "jessquit",
                                                                                            "score": 1,
                                                                                            "created_utc": 1653891349.0,
                                                                                            "response": "I cannot believe I have to keep explaining this to you.\n\nSaying you *believe something will happen* is **never** a \"lie.\"\n\nIt might be grossly wrong, but it cannot be a lie because it is not a claim of fact. **Unlike Max's claim.**\n\nThe crazy hypocritical thing is that you believe Max committed something as scandalous as what you consider Roger's claim to be yet you're HERE bagging on Roger not bagging on **Max** like you would be if you actually believed what you're saying. Like, Max says something atrocious and YOUR response is to use it to dredge up a grudge against Roger. Astonishing lack of self awareness.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "id": "iah6wxu",
                                                                                    "author": "ytrottier",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653862946.0,
                                                                                    "response": "Max's tweet is just as deceitful a misinterpretation of statistics as Roger's claim that the USA killed half a million Iraqi children.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "iailla7",
                                                                                            "author": "jessquit",
                                                                                            "score": 1,
                                                                                            "created_utc": 1653891027.0,
                                                                                            "response": "It really isn't at all. Roger didn't make the claim up the way Max did. You'll find it comes from a UNICEF report. Now you may disagree with the UNICEF report and I'm not here to litigate the facts of the horrors of war but it's a number that exists broadly independent of Roger's claim.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "id": "iakxnya",
                                                                            "author": "raphaelmaggi",
                                                                            "score": 1,
                                                                            "created_utc": 1653940538.0,
                                                                            "response": "If I remember correctly it was legal tender and forced. Even if it is not enforced, doesn't matter much, if the state go against you \"but you didn't enforce it before\" doesn't help much. If they don't want to enforce this, why put it in law then.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "ialdcrz",
                                                                                    "author": "Ok_Aerie3546",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653948116.0,
                                                                                    "response": "I dont know. Why would a state go against all its people for not using a payment method. Seems like the most harmless thing to go against.",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "iah5bnr",
                                                    "author": "ytrottier",
                                                    "score": 1,
                                                    "created_utc": 1653862143.0,
                                                    "response": "You're being rude. Do you recognize my username? We've had pleasant discussions before and learned from each other because we agree on most things. But one point of disagreement speaks more volumes that our past conversations?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iaims66",
                                                            "author": "jessquit",
                                                            "score": 1,
                                                            "created_utc": 1653891957.0,
                                                            "response": ">You're being rude. \n\nMy apologies then. I didn't find my statement particularly rude, maybe pointy, but it wasn't my intent to offend. I agree that we've always been civil to each other and I hope that will continue going forward. The rest of my reply is in the other comment to you.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iagcy6b",
                    "author": "arielfavio",
                    "score": 2,
                    "created_utc": 1653848508.0,
                    "response": "I guess Max doesn't speak Spanish, so he doesn't understand the information.\n\n\"During March 24 and 25, 2022, two consecutive days of violence were recorded in El Salvador with balances of 14 and 62 homicides...\"\n\nhttps://es.statista.com/estadisticas/1299340/el-salvador-asesinatos-por-dia-de-los-grupos-barrio-18-y-ms-13/",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaghzuj",
                            "author": "jessquit",
                            "score": 6,
                            "created_utc": 1653850875.0,
                            "response": "Max doesn't need to speak Spanish to pull easily-refuted facts out of his ass for maxis to parrot like little automatons.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iaf7o6c",
                    "author": "Egon_1",
                    "score": 3,
                    "created_utc": 1653829198.0,
                    "response": "Source https://twitter.com/vielseitigu/status/1530806862723141632",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaikei6",
                    "author": "jyrexx",
                    "score": 1,
                    "created_utc": 1653890123.0,
                    "response": "dead",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iairolc",
                    "author": "notemonkey",
                    "score": 1,
                    "created_utc": 1653896016.0,
                    "response": "Dude, fairytales, and rainbows in bitcoin land. I think the whole world has gone mad. Everyone in it is wearing their spectrum of rose-colored glasses in some insanely asinine way.. fuck'n tard.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaj9gk4",
                    "author": "mrxsdcuqr7x284k6",
                    "score": 1,
                    "created_utc": 1653911317.0,
                    "response": "Max doesn’t speak for all bitcoiners, he only speaks for himself.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iag4fks",
                    "author": "justswallowhard",
                    "score": 0,
                    "created_utc": 1653844593.0,
                    "response": "Information war, nothing else\nAnd you even better if sound ridiculous",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "v0ak3n",
            "title": "Well, BTC is technically limited. Its toxic community is also a major problem 🤷‍♂️",
            "url": "https://i.redd.it/ewdbeuhrve291.jpg",
            "author": "Egon_1",
            "created_utc": 1653828739.0,
            "score": 25,
            "num_comments": 15,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "iaf725v",
                    "author": "Egon_1",
                    "score": 5,
                    "created_utc": 1653828834.0,
                    "response": "But the good thing is that Bitcoin Cash fixes this ✌️\n\n**https://smartbch.org/**\n-",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaf6y1k",
                    "author": "Egon_1",
                    "score": 3,
                    "created_utc": 1653828765.0,
                    "response": "Source https://twitter.com/coryklippsten/status/1530578338984513536",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iafawwr",
                    "author": "Spicytacos1997",
                    "score": 1,
                    "created_utc": 1653830924.0,
                    "response": "BTC is said to be inefficient compared to other blockchains.\n\nCorporate America rather pollute in secret because the public cares about the environment",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaffyy5",
                    "author": "No-Income-1419",
                    "score": 1,
                    "created_utc": 1653833462.0,
                    "response": "What do you expect of a community around money?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iajl4s5",
                    "author": "NilacTheGrim",
                    "score": 1,
                    "created_utc": 1653918268.0,
                    "response": "How are you supposed to integrate an immovable object that is a \"Store of Value\" that is expensive to move?",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}