{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uv2t3z",
            "title": "Bitcoin Pizza Day failure (for the first time in 5 years)",
            "url": "https://www.reddit.com/r/btc/comments/uv2t3z/bitcoin_pizza_day_failure_for_the_first_time_in_5/",
            "author": "QuantumLeapChicago",
            "created_utc": 1653190956.0,
            "score": 17,
            "num_comments": 15,
            "subreddit": "btc",
            "selftext": "Hello friends.\n\nEvery year on May 22 I use Menufy to order a big order for my friends and I to celebrate Bitcoin Pizza day. A few years ago I was able to use ETH, one time I used BTC, but of course my preference is BCH. Aside from 5/22, I occasionally order Chinese takeout from the place up the road. But usually I order pizza from the burbs.\n\nSo there are no good pizza places nearby and I didn't want to drive today, I coordinated with my 8 friends and we ordered from a Japanese fusion place we never tried.\n\nMenufy no problem, payment went through right away (gotta love 0-conf).\n\nDelivery time passes, no order. I call the place, say I have a delivery order I'm checking on. The manager mentioned Menufy and details of my order without me providing details (maybe he used caller ID to pull my info?)\n\nProceeds to say, oh these third party sites don't work well, he never got \"notified\" of my order, besides they are out of 3/4 the things we ordered.\n\nI bitched about having 8 hungry people and obviously he does have my order since he mentioned details. Apologized as I have ran a restaurant before and know how hard it is with Covid especially... But reminded him we checked their actual first party site and stayed away from the things they marked they were out of there. Asked for a refund, he said okay of course.\n\nOrdered pizza from the trusty shop down the road and put it on ye old credit card.\n\nMenufy sent a QA follow-up email. I wrote them back with all the details (including my BCH address) and got an email back within 20 mins saying they'll refund me in 2-3 business days for the USD amount. I trust them to take care of it...\n\nBut come on... What a frustrating situation. Friends still all think crypto is a joke. Wonder what the exchange rate will be in a few days (don't really care but again, they're calculating in USD so i might actually get a little more if it keeps sliding down). Mostly wonder if Menufy will actually process a crypto refund. The form letter was not super encouraging.\n\nDespite all this... I'm still gonna SPEDN. This one restaurant is the only time I've had an issue. Tomorrow gonna try again with our sushi place down the road. But a little more legwork... Call them before and make sure they are aware of Menufy.\n\nIf anyone knows any good places in Chicago that actually take crypto directly or via bitpay or similar... happy to support them!",
            "stickied": false,
            "comments": [
                {
                    "id": "i9j5v7x",
                    "author": "bitmeister",
                    "score": 10,
                    "created_utc": 1653196248.0,
                    "response": "Good on you for trying.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9j81vy",
                    "author": "AmbitiousPhilosopher",
                    "score": 7,
                    "created_utc": 1653197919.0,
                    "response": "This is the experience we will all deal with when we involve intermediaries. Good effort for trying anyway.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9jsl8s",
                    "author": "Remora_101",
                    "score": 3,
                    "created_utc": 1653216028.0,
                    "response": "Man that sucks. Have you talked to any of the restaurant to take BCH directly?\n\nSome places are still really bad for adoption :(",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9jm3bz",
                    "author": "doramas89",
                    "score": 2,
                    "created_utc": 1653210144.0,
                    "response": "Unfortunate experience. \"The market\" should settle these issues: you and everyone else will likely be spending directly at a place that accepts crypto than via menufy if their crypto-UX is subpar. Nothing to do here as a customer other than vote with your money :/",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9k8i22",
                    "author": "CBD4Coins",
                    "score": 2,
                    "created_utc": 1653226639.0,
                    "response": "Menufy uses bitpay, which isn't the worst, but we should strive towards P2P\n\nAnyone with a WordPress site should use MyCryptoCheckout (.com)\n\nNo processing fees, non-custodial",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9kbho8",
                    "author": "surprise-pikachu",
                    "score": 2,
                    "created_utc": 1653228147.0,
                    "response": "I have had similar experiences.  Many restaurants have asked me not to use menufy and just call them with my order.  It was not an issue with crypto, they didn't want credit cards either.  One place even offered free delivery, but CASH ONLY.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9nbmpi",
                    "author": "menufy",
                    "score": 2,
                    "created_utc": 1653280044.0,
                    "response": "We refunded you a few hours ago. There should be a confirmation email in your inbox. We're very sorry for the mishap.\n\nWe'll be in touch with the restaurant to figure out what's going on with their online order notifications. This is the first we've heard of their reported difficulties.\n\nAs you probably already know, the restaurant industry is struggling with understaffing and supply chain disruptions. These are not normal times. Thanks for your understanding, and we're glad you were still able to feed the group with pizza.\n\nAnd thanks for your 5-year support!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9nd2vj",
                            "author": "QuantumLeapChicago",
                            "score": 1,
                            "created_utc": 1653280988.0,
                            "response": "I was NOT expecting a reply here! That's great!\n\nYes, got the refund link and went through all that. Again, I love Menufy for aggregating restaurants who accept crypto. Never had any problem with your service... Just the one restaurant this one time. I hope that really comes through. Just thought I'd share my experience with those who might be interested!\n\nToday even used Menufy to buy sushi from our local place which we know and love, we've bought a few times from them and never had a problem.\n\nKeep up the great work!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}