{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uwic8n",
            "title": "I'm setting up wXMR, wETH and wBTC tokens on SmartBCH. Is this a good or great idea?",
            "url": "https://www.reddit.com/r/btc/comments/uwic8n/im_setting_up_wxmr_weth_and_wbtc_tokens_on/",
            "author": "ImRichBCH",
            "created_utc": 1653365396.0,
            "score": 13,
            "num_comments": 20,
            "subreddit": "btc",
            "selftext": "I figure I'll start small but I hold all these coins anyway so figure I can take a few $thousand of each, set up a designated address for each asset, then start \"wrapping\" them on SmartBCH. \n\nUntil there is an actual bridge for all these tokens (it could be years I believe) this would be a good stop gap. What do you guys think?",
            "stickied": false,
            "comments": [
                {
                    "id": "i9sbeud",
                    "author": "PanneKopp",
                    "score": 10,
                    "created_utc": 1653382515.0,
                    "response": "I do not trust any wrapped things (the ones wrapping it), except you can eat them .",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9tx2l4",
                            "author": "morange81",
                            "score": 1,
                            "created_utc": 1653413342.0,
                            "response": "I mean at that point I'd rather buy the real thing to be honest. That'll be better.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9tbbic",
                    "author": "hegjon",
                    "score": 7,
                    "created_utc": 1653404383.0,
                    "response": "The idea is broken by design, why would I or others trust a random person on the internet to keep our funds",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9rv7tk",
                    "author": "Fine-Flatworm3089",
                    "score": 4,
                    "created_utc": 1653368871.0,
                    "response": "Bad. “wBTC” is kind of product of another crypto company, and you are just confusing people.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9t4hpi",
                            "author": "tr9mum",
                            "score": 1,
                            "created_utc": 1653401422.0,
                            "response": "Yep, He's just confusing people with that, that's not a good thing to pull of here",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9upod8",
                    "author": "mpkomara",
                    "score": 2,
                    "created_utc": 1653425342.0,
                    "response": "You can already wrap a few different coins onto smartBCH using CoinFLEX.  They don't call them \"wrapped\" or \"wBTC\", they call them FlexAssets.  For example, you can send them 1 BTC, and get 1 FlexBTC and withdraw the FlexBTC on the smartBCH network.  Also, there's the benefit that holders of FlexBTC will sometimes earn on-chain interest from CoinFLEX.  But that's just a cherry on top, really.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9spv7a",
                    "author": "darkbluebrilliance",
                    "score": 1,
                    "created_utc": 1653393853.0,
                    "response": "I like the idea. But how will you get the people to trust you?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9tbgwc",
                            "author": "hegjon",
                            "score": 4,
                            "created_utc": 1653404445.0,
                            "response": "How can you like the idea? Give your funds to a stranger on the internet to keep them for you?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9whqtf",
                                    "author": "darkbluebrilliance",
                                    "score": 2,
                                    "created_utc": 1653456801.0,
                                    "response": ">How can you like the idea?\n\nBecause every other relevant blockchain does it as well and we need to compete to stay relevant ourself. Because I'd rather trade coins in defi.\n\n>Give your funds to a stranger on the internet to keep them for you?\n\nThat's why I asked him about trust.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9ueqq3",
                                    "author": "bitsconnected",
                                    "score": 1,
                                    "created_utc": 1653420736.0,
                                    "response": "OP will probably promise some interest for staking the wrapped tokens. As an incentive to trust them with this. \n\nEither way I wouldn’t touch it.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9wikci",
                                            "author": "darkbluebrilliance",
                                            "score": 2,
                                            "created_utc": 1653457351.0,
                                            "response": "That's not how this normaly is done. \n\nWBTC on Ethereum for example doesn't pay anything to the token holders. People hold and use wrapped tokens because they are useful to them.\n\nAnd those wrapping the coins live of the buy-sell price spread and/or lend out part of the real tokens to earn interest on them. So they risk to become partially unbacked if the lent coins aren't paid back to them.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9t6xsu",
                    "author": "mashtu1960",
                    "score": -6,
                    "created_utc": 1653402500.0,
                    "response": "I mean sounds good enough to me, this is a good strategy to have.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}