{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "urhw40",
            "title": "The May 15 upgrade is already a highlight of this year, as is all the adoption that is happening. Keep buildn, ignore the noise.",
            "url": "https://i.redd.it/qdm70pw7zzz81.jpg",
            "author": "Remora_101",
            "created_utc": 1652776489.0,
            "score": 29,
            "num_comments": 6,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8xbuli",
                    "author": "LovelyDayHere",
                    "score": 8,
                    "created_utc": 1652778381.0,
                    "response": "Indeed.\n\nNow Bitcoin Cash is even criticized for not having enough drama during upgrades. It is too funny!\n\nBut what I want to say is, that the every day crypto user will measure the progress only in terms of what they can see, not in terms of what they can't see.\n\nThat means, we need to make use of the enhancements in our applications and products wherever it makes sense to do so.\n\nThis is where we lag behind ourselves a bit!\n\nWe need more wallets that have an option to show double spend proof alerts. So that merchants can protect themselves better.\n\nWe're no longer limited to one OP_RETURN for additional data, opening the way for better OP_RETURN based protocols (such as auctions).\n\nWe have this totally exciting EVM sidechain called SmartBCH to which we can bridge and on which powerful dApps can be developed.\n\nIn future, Bitcoin Cash will get scaling (capacity) upgrades that won't be immediately \"visible\" to its users. Like blocksize increases, and increases to the number of script operations that can be performed in a transaction.\nThese are actually no less exciting, since they boil down to (a) more users being able to use the system and (b) more applications that can be constructed with the existing scripting system.\n\nExciting times ahead for Bitcoin Cash!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8xh78q",
                            "author": "bitcoincashautist",
                            "score": 4,
                            "created_utc": 1652783096.0,
                            "response": "> We're no longer limited to one OP_RETURN for additional data, opening the way for better OP_RETURN based protocols (such as auctions).\n\nNot only that, but now contracts can easily read the OP_RETURN data and make decisions based on it! There are [many ways](https://ledgerjournal.org/ojs/ledger/article/download/101/93/) to put data into the blockchain, OP_RETURN is just one way, but the contract can read all the data! :D\n\n> Like blocksize increases\n\nBlocksize **limit** increases, and it should be moved so that nobody ever notices it existing (enough overhead). Nothing preventing **actual** blocksize from growing now, only 1 thing drives that: utility, utility, utility i.e. give miners transactions to fill those blocks with! We have plenty of room till the current 8MB cap, we're using only like 300kB right now.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8x9u80",
                    "author": "Remora_101",
                    "score": 3,
                    "created_utc": 1652776537.0,
                    "response": "Found on twitter: https://twitter.com/NeonDaThal/status/1526327833202950145",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}