{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uw7uaj",
            "title": "CFTC Chairman Confirms Bitcoin, Ether Are Commodities. Are Regulations good for the Growth of the Crypto Ecosystem?",
            "url": "https://www.reddit.com/r/btc/comments/uw7uaj/cftc_chairman_confirms_bitcoin_ether_are/",
            "author": "Juliet_bv",
            "created_utc": 1653333124.0,
            "score": 1,
            "num_comments": 0,
            "subreddit": "btc",
            "selftext": "In an interview with CNBC last week, CFTC Chairman Rostin Behnam discussed the CFTC and SEC's supervision of cryptocurrencies.\nThe chairman was asked for his thoughts on a plan in Congress that would place the Securities and Exchange Commission in control of security tokens and the Commodities Futures Trading Commission in charge of commodity tokens.\n\n\"This is a long-standing dispute between the CFTC and the SEC. We had a fantastic history together... Commodities should be regulated by the Commodity Futures Trading Commission, and securities should be regulated by the Securities and Exchange Commission,\" Behnam explained.\n\nSome currencies in the crypto world will be securities, while others will be commodities, according to the CFTC chairman.\n\nWhen asked about SEC Chairman Gary Gensler's contention that most crypto tokens are securities, Behnam emphasized that the most popular cryptocurrencies are commodities. He stressed:\n\nI can say with certainty that bitcoin... is a commodity As well as Ether \n\n I think regulation of Bitcoin could potentially be good or bad for the mainstream adoption of Cryptocurrencies.\nRegulation could help prevent scams and protect the interest of users, regulations would create a framework for investors to work with to further expand the growth of the ecosystem. Regulation would help accelerate the mainstream adoption of Bitcoin. \n\nAlso one has to consider the blockchain ecosystem which continues to experience exponential growth by enabling the creation of innovative projects such as\nDecentraland  an online world that allows users to create their own avatars and purchase plots of virtual land, Planet Maya which is powered by champions games is  a decentralized and collaborative online casino which allows developers to build Games around betting, Luckyblock which  is a digital asset project that decentralizies the lottery process via blockchain technology and many more that could change how diverse industries operate from real estate, gaming, insurance, academia. The need for regulation increases as blockchain technology becomes more mainstream and becomes a part of different industries of human endeavour.\n\nI think it is quite ironic that a decentralized network should be subject to regulation by a central body but a much needed evil it Bitcoin is to become mainstream.\nRegulations could mean that Bitcoin is subject to the whims of these regulatory bodies making the decentralized network lose it's decentralized nature indirectly. It will be interesting to see how these regulatory bodies regulate Bitcoin. \n\n\nNews Source: \nhttps://news.bitcoin.com/cftc-chairman-confirms-bitcoin-ether-are-commodities/",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uw7t29",
            "title": "Tether revealed it owns $286 million on non-Us government bonds, which coincides with the amount of money an entity paid for La Geo’s stocks -an electric firm funded by the Salvadoran state- two weeks ago. La Geo was supposed to back the now delayed Bitcoin bonds.",
            "url": "https://twitter.com/ricardovalp/status/1528772559709163520",
            "author": "Remora_101",
            "created_utc": 1653333030.0,
            "score": 24,
            "num_comments": 13,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9qa8mi",
                    "author": "Egon_1",
                    "score": 8,
                    "created_utc": 1653339893.0,
                    "response": "Translation: Tether invested (or just on paper) in highly secure El Salvadorian bonds, better than Chinese commercial papers /s",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9pwhge",
                    "author": "Zyoman",
                    "score": 3,
                    "created_utc": 1653333957.0,
                    "response": "So 3 weeks ago it had 0?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9qahq0",
                    "author": "Ronoh",
                    "score": 5,
                    "created_utc": 1653340007.0,
                    "response": "Trust Tether! What can go wrong? /s",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9qkv4a",
                    "author": "gotamd",
                    "score": 3,
                    "created_utc": 1653344799.0,
                    "response": "That is awfully coincidental.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9qlr5j",
                    "author": "tophernator",
                    "score": -2,
                    "created_utc": 1653345228.0,
                    "response": "I love the insanely selective reading here. The image posted suggests tether holds:\n\n$39,200 million in US treasury bonds.  \n$20,100 million in commercial bonds.  \n$286 million in non-US government bonds.  \n\nSo of course the people obsessed with trying to pin BCH’s lack of success on tether focus entirely on the 0.48% that *might* be invested in El Salvador… which is a bad thing I guess?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9qmqng",
                            "author": "Remora_101",
                            "score": 4,
                            "created_utc": 1653345696.0,
                            "response": "Did I say anything about BCH?\n\n>So of course the people obsessed with trying to pin BCH’s lack of success on tether focus entirely on the 0.48% that might be invested in El Salvador… which is a bad thing I guess?\n\nAnd you think a company that does shit like that has everything else just mighty fine? Even completely ignoring the fact, that we have no proof for anything. They could hold cow manure for all we know. \n\nEvery day I discover that people can be even more gullible than I thought  the day before.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9qs4rg",
                                    "author": "doramas89",
                                    "score": 3,
                                    "created_utc": 1653348323.0,
                                    "response": "You're talking to state sponsored trolls defending the tether façade...dont lose energy mate",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9qx1pv",
                                    "author": "tophernator",
                                    "score": 0,
                                    "created_utc": 1653350754.0,
                                    "response": "> Did I say anything about BCH?\n\nNo, but we regularly get the answer to the question “why on Earth are BCH enthusiasts so obsessed with tether” in the form of rambling mental gymnastics conspiracy theories.\n\n> Even completely ignoring the fact, that we have no proof for anything. They could hold cow manure for all we know.\n\nIf you have no proof for the $39 billion US bonds then you certainly have no proof for the relatively tiny amount of possible El Salvador bonds. It’s all from the same screenshot. You can’t choose to believe only the bits that suit your existing narrative. Or rather you can do that, but you’ll look like an idiot to anyone paying attention.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9qv25c",
                            "author": "phro",
                            "score": 2,
                            "created_utc": 1653349775.0,
                            "response": "1:1 dollar backed. Nah. Drake meme.\n\nSome unknown quantity of shit commercial paper and a smidgen of bonds from a country whose currency is rated speculative grade caa3, credit is rated CCC, and all signs point to further downgrades.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9qx9zo",
                                    "author": "tophernator",
                                    "score": 0,
                                    "created_utc": 1653350870.0,
                                    "response": "> Some unknown quantity of shit commercial paper \n\nThe quantity is right there in the post. \n\n> and a smidgen of bonds from a country whose currency is rated speculative grade caa3\n\n… and $39.2 billion of bonds from the US.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9qxjm0",
                                            "author": "phro",
                                            "score": 1,
                                            "created_utc": 1653351006.0,
                                            "response": "Link me reputable 3rd party audit of Tether's backing.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9qyaup",
                                                    "author": "tophernator",
                                                    "score": 0,
                                                    "created_utc": 1653351394.0,
                                                    "response": "No. My comments here are solely about this post/tweet/image. I genuinely don’t give a crap about tether. But I hate watching people engage in this kind of irrational and manipulative bullshit.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "id": "uw7wwb",
            "title": "BCH/XMR trading pair all-time high today, approaching PARITY",
            "url": "https://www.reddit.com/r/btc/comments/uw7wwb/bchxmr_trading_pair_alltime_high_today/",
            "author": "wtfCraigwtf",
            "created_utc": 1653333317.0,
            "score": 10,
            "num_comments": 32,
            "subreddit": "btc",
            "selftext": "XMR went to 0.977 BCH today, I suspect we'll see some strong resistance at 1.0/parity. I am bullish both coins, so I have no fears of trading them for each other. I did get a Monero BCH hater this week,  maybe they are trying to run down BCH? Guy was delusional about XMR having better UX and more merchants than BCH. \n\nWhen I asked \"Is Tether used to pump Monero price\" in rMonero, it was deleted, TWICE. Something tells me that subject is off limits in the sub.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9q509c",
                    "author": "ArticMine",
                    "score": 11,
                    "created_utc": 1653337610.0,
                    "response": "> When I asked \"Is Tether used to pump Monero price\" in rMonero, it was deleted, TWICE. Something tells me that subject is off limits in the sub.\n\nPrice discussions are not allowed in r/Monero. Use r/xmrtrader instead.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9qot43",
                    "author": "KallistiOW",
                    "score": 2,
                    "created_utc": 1653346697.0,
                    "response": ">  I did get a Monero BCH hater this week, maybe they are trying to run down BCH? Guy was delusional about XMR having better UX and more merchants than BCH.\n\nMy first thought was Graphenist (who I suspect to be yet another nullc alt)\n\nThen I checked your history, and it was Graphenist.\n\nGraphenist is definitely a troll posing as someone who's not a bad actor, imo. :)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9q9087",
                    "author": "imperator285",
                    "score": 2,
                    "created_utc": 1653339353.0,
                    "response": "I see great things possible if we work together. If BCH becomes more widely adopted, i could see it being the less private, but easier to use, version of Monero.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9q9p6v",
                            "author": "LovelyDayHere",
                            "score": 9,
                            "created_utc": 1653339656.0,
                            "response": "BCH is already much more widely adopted than Monero.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9q9vuy",
                                    "author": "imperator285",
                                    "score": 3,
                                    "created_utc": 1653339737.0,
                                    "response": "Not in DNMs, the place where people actually have to use crypto",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9qnkep",
                                            "author": "indirecteffect",
                                            "score": 1,
                                            "created_utc": 1653346096.0,
                                            "response": "Dnm?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9qnpgm",
                                                    "author": "imperator285",
                                                    "score": 1,
                                                    "created_utc": 1653346164.0,
                                                    "response": "DarkNet Markets\n\nWhere people get drugs and stuff online. Ya can't use a credit card lol",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9qzqle",
                                                            "author": "knowbodynows",
                                                            "score": 2,
                                                            "created_utc": 1653352116.0,
                                                            "response": "Correct. But outside dnms BCH is far more accepted perhaps partially because merchants don't want to associate with the dnm coin.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9qzvkg",
                                                                    "author": "imperator285",
                                                                    "score": 1,
                                                                    "created_utc": 1653352184.0,
                                                                    "response": "Ofc. Thats why i just said i think the two go well together.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                },
                                                                {
                                                                    "id": "i9rcw7k",
                                                                    "author": "ArticMine",
                                                                    "score": 1,
                                                                    "created_utc": 1653358436.0,
                                                                    "response": "Monero has a lower support on centralized exchanges largely because the blockchain surveillance (BS) companies have lobbied regulators and exchanges hard against listing Monero. If Monero were to become dominant these BS companies could go out of business. One must keep in mind that these BS companies also censor cash fusion transactions or any other attempt to add any kind of privacy to Bitcoin, Bitcoin Cash or similar coins.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9q59ty",
                    "author": "Bag_Holding_Infidel",
                    "score": 1,
                    "created_utc": 1653337727.0,
                    "response": "> Is Tether used to pump Monero price\n\nTether truthers are mostly a BCH thing. Its (mostly) not entertained in other subs.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9q693g",
                            "author": "jessquit",
                            "score": 6,
                            "created_utc": 1653338154.0,
                            "response": "go figure",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9q6qp1",
                                    "author": "Bag_Holding_Infidel",
                                    "score": 2,
                                    "created_utc": 1653338369.0,
                                    "response": "Well, apart from r/buttcoin of course.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9q786l",
                                            "author": "jessquit",
                                            "score": 9,
                                            "created_utc": 1653338580.0,
                                            "response": "ah yes, the mark of a True Crypto Believer is when you defend not just fiat, but *counterfeit* fiat -- because it pumps your bags\n\nsmh at this market\n\nyou: [this is fine](https://i.imgflip.com/6g12ka.jpg)",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9qoziw",
                                                    "author": "KallistiOW",
                                                    "score": 1,
                                                    "created_utc": 1653346786.0,
                                                    "response": "Buttcoin is anti-Tether, idk what you mean by them defending it",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i9q85hx",
                                                    "author": "Bag_Holding_Infidel",
                                                    "score": -5,
                                                    "created_utc": 1653338982.0,
                                                    "response": "The mark of a true BCH believer is the cognitive dissonanace required to support conspiracy theories to justify weak fundamantals.\n\n> you: https://i.imgflip.com/6g12ka.jpg\n\nPeer to peer cash is not limited to (or even possible long term with) BCH.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9qdnkf",
                                                            "author": "jessquit",
                                                            "score": 6,
                                                            "created_utc": 1653341436.0,
                                                            "response": "\"conspiracy theory\" you say.\n\nBlockstream opposition to p2p cash: not theory\n\nBlockstream in bed with Bitfinex: not theory\n\nBitfinex attacker of p2p cash: not theory\n\nBitfinex creator of tether: not theory\n\nTether only partially backed: not theory\n\nTether backed by BTC: not theory\n\nWhere exactly is the \"theory\" in the picture? I can't find it. I just see the conspiracy.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9qhbs3",
                                                                    "author": "Bag_Holding_Infidel",
                                                                    "score": 0,
                                                                    "created_utc": 1653343131.0,
                                                                    "response": "There is considerable context to most of those points that would take days to point out the conspiracies correctly. And you will dismiss it anyway. There is a reason noone bothers doing it here anymore. You seem like the only technically minded person left here and you are doing yourself a disservice (unless you are paid) associating yourself with Egon's constant conspiracy peddling.\n\nThe world values decentralisation and needs a fee market to ensure this.\n\nNo one cares about p2p cash (not yet anyway). Alt-L1's cost nearly nothing to use, so they make nearly zero in fees. BCH doesn't have a security budget to survive.\n\nBCH's 10 min blocktime isn't necessary either and it would work much better as an L2 or L3 on Ethereum.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9qso2b",
                    "author": "doramas89",
                    "score": 1,
                    "created_utc": 1653348588.0,
                    "response": "XMR/BCH*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9qai3d",
                    "author": "Zealousideal_Year551",
                    "score": -3,
                    "created_utc": 1653340012.0,
                    "response": "Monero is a coin for selling child abuse pictures. Im not interested",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9qjctn",
                            "author": "Dehydration9986552",
                            "score": 4,
                            "created_utc": 1653344087.0,
                            "response": "And internet is used to exchange that. Why do you use it?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9qla54",
                                    "author": "Zealousideal_Year551",
                                    "score": -2,
                                    "created_utc": 1653345000.0,
                                    "response": "Learn to read",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9qsb9s",
                                            "author": "Hakametal",
                                            "score": 1,
                                            "created_utc": 1653348411.0,
                                            "response": "If criminals use money, does that make money bad?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9r00ad",
                                                    "author": "knowbodynows",
                                                    "score": 1,
                                                    "created_utc": 1653352250.0,
                                                    "response": "By his measure, children are bad 😞.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i9r0d0j",
                                                    "author": "Zealousideal_Year551",
                                                    "score": 1,
                                                    "created_utc": 1653352426.0,
                                                    "response": "Amazing. You cant read either",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9pxvbh",
                    "author": "onemoneroisonemonero",
                    "score": -2,
                    "created_utc": 1653334547.0,
                    "response": "I dumped all my BCH for XMR at 0.2 BCH. No regrets.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9pyrk3",
                            "author": "wtfCraigwtf",
                            "score": 4,
                            "created_utc": 1653334929.0,
                            "response": "I guess you're not interested in making a 5x gain buying BCH today? Or simply buying back all of your BCH for 1/5th of ur XMR?\n\nokthxbye",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9q5kwg",
                                    "author": "ArticMine",
                                    "score": 1,
                                    "created_utc": 1653337863.0,
                                    "response": "I sold my BTC over 99% in 2014 - 2015 with the balance in 2017 before the BCH fork for XMR over blocksize scaling. I am not interested in selling my XMR for BTC, BCH, BSV etc. at a profit.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9qeymr",
                                    "author": "Blazedout419",
                                    "score": 1,
                                    "created_utc": 1653342035.0,
                                    "response": "Why when it just keeps going down?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}