{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uzpowr",
            "title": "NOT IF YOU’RE USING THE CENTRALIZED LIGHTNING NETWORK!",
            "url": "https://i.redd.it/jue868ovj8291.jpg",
            "author": "GETSOME88-007",
            "created_utc": 1653751892.0,
            "score": 55,
            "num_comments": 120,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "iabmpvk",
                    "author": "Remora_101",
                    "score": 21,
                    "created_utc": 1653752166.0,
                    "response": "Are they changing the narrative again now that the \"hedge against inflation\" seem to fail?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iacybb9",
                            "author": "Acceptable-Risks",
                            "score": 5,
                            "created_utc": 1653774724.0,
                            "response": "I never followed that narrative. For me Bitcoin has always been about the long game. It's an alternative to the fiat system.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iagn85c",
                                    "author": "radekjanowski",
                                    "score": 1,
                                    "created_utc": 1653853312.0,
                                    "response": "So excited for all of the cool Lightning Network stuff coming down the road... Just kidding .",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "iagkrcc",
                            "author": "tichepidor",
                            "score": 1,
                            "created_utc": 1653852159.0,
                            "response": "A Problem With Bitcoin's Lightning Network Liquidity And Ideas To Address It.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iacopdl",
                            "author": "Bag_Holding_Infidel",
                            "score": -6,
                            "created_utc": 1653770208.0,
                            "response": "In most cases, the narrative follows fundamentals, not the other way around.\n\nIf you think someone is changing the narrative, you are behind the curve, which will cost you.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iacztob",
                                    "author": "Remora_101",
                                    "score": 3,
                                    "created_utc": 1653775435.0,
                                    "response": "facepalm",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iaev4ij",
                                            "author": "poliglasses",
                                            "score": 2,
                                            "created_utc": 1653820086.0,
                                            "response": "Lightning network doesn't scale enough for real everyday use.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "iaf41pt",
                                    "author": "DSuhinin",
                                    "score": 1,
                                    "created_utc": 1653826972.0,
                                    "response": "\"Why should I care about Lightning Network when my credit card works just fine?\"",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iafc9nb",
                                            "author": "Bag_Holding_Infidel",
                                            "score": 1,
                                            "created_utc": 1653831632.0,
                                            "response": "Agreed, thats most peoples opinion and its the reason low fee L1's failed to gain adoption, but you can't spend BTC with most credit cards.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "iaepepj",
                                    "author": "DigitaleDukaten",
                                    "score": -1,
                                    "created_utc": 1653814931.0,
                                    "response": "I don't like you",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iaf36b6",
                                            "author": "Bag_Holding_Infidel",
                                            "score": 1,
                                            "created_utc": 1653826386.0,
                                            "response": "Good Bot",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iabplcz",
                    "author": "LovelyDayHere",
                    "score": 16,
                    "created_utc": 1653753508.0,
                    "response": "I recently saw an argument by someone that if LN centralized around KYC hubs that censored some transactions, that the next day there would be a fork of the LN.\n\nThat's crazy talk, because of the exact thing that made it difficult to fork Bitcoin -- the network effect.\n\nSo it really boils down to deciding early on what it is that you want: peer to peer electronic cash which is decentralized, or ... banking redefined.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iacn4j8",
                            "author": "mcgravier",
                            "score": 3,
                            "created_utc": 1653769501.0,
                            "response": "> that the next day there would be a fork of the LN.\n\nThis isn't just crazy talk, this is a massive BS.\n KYC is enforced on legal entities hosting the LN nodes. This has nothing to do with the LN code itself, if it happens, itt would mean it's an inherent flaw in LN architecture in general.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iagepfh",
                            "author": "posnercom",
                            "score": 3,
                            "created_utc": 1653849334.0,
                            "response": "It’s literally a copy of other people’s transactions. XD .",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iabz005",
                            "author": "jonald_fyookball",
                            "score": 12,
                            "created_utc": 1653757897.0,
                            "response": "> LN centralized around KYC hubs that censored some transactions, that the next day there would be a fork of the LN.\n\nThis is as delusional as saying \"If our banks try to KYC us, we'll just open our own bank!\"  Well you can't do that unless you have tons of money, just like you can't be a liquidity hub for LN unless you have tons of money, and in any case centralization ALWAYS leads to regulatory pressure.  These people fail to understand the basic game thoery/security model of Bitcoin in which ANY MINER can put your transaction in a block.\n\nHonestly at this point, LN is a complete embarrassment for BTC.  It's time to stop humping that dream.  BTC doesn't need LN, and doesn't need to scale.  BTC should focus on what BTC does great, which is being digital gold and being very hard to change.  \n\nLN is an attempt to try to make BTC into the all-in-one coin, but since it doesn't work, it reflects badly.  Have some freakin integrity, stop lying, stop pushing LN garbage, and get back to being your own bank.  Unbelievable that the maxi-caused cognitive dissonance has prevented so many people from recognizing what a sham it is.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iaeq14e",
                                    "author": "firstlast0024",
                                    "score": 3,
                                    "created_utc": 1653815494.0,
                                    "response": "This is what I used to tell people who said \"just use credit card\" instead of Bitcoin during the scaling stuff.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "iacgw9y",
                                    "author": "YeOldDoc",
                                    "score": 0,
                                    "created_utc": 1653766444.0,
                                    "response": "> These people fail to understand the basic game thoery/security model of Bitcoin in which ANY MINER can put your transaction in a block.\n\n1. If one miner censors your transaction another miner will route the tx and earn the fees. If one LN node censors your transaction (which is indistinguishable from them being simply offline) another LN node will route the tx and earn the fees.\n2. 51% of hashrate can censor any transaction, 51% of liquidity can't.\n3. Assuming that LN hubs will be subject to KYC regulation but miners won't be is disingenuous.\n4. It is cheaper and easier to setup, maintain and hide a LN hub than to maintain a mining operation.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iacjr2n",
                                            "author": "LovelyDayHere",
                                            "score": 3,
                                            "created_utc": 1653767847.0,
                                            "response": "> If one LN node censors your transaction (which is indistinguishable from them being simply offline) another LN node will route the tx and earn the fees.\n\nHow does this work? How do other LN nodes learn about your censored transaction and beat a path to your door to open a channel with you?\n\n> 51% of hashrate can censor any transaction, 51% of liquidity can't.\n\n51% of LN liquidity will suck mining fees out of BTC in an ever increasing amount until the LN liquidity owners take over (buy up) the hashrate majority.\nBOOM. Mission accomplished.\n\n> It is cheaper and easier to setup, maintain and hide a LN hub than to maintain a mining operation.\n\nTrue. So why should the LN operators earn the fees. Nevermind, it's a rhetorical question. LN doesn't scale except with big hubs. Which will be run by banks or the equivalent. Of course they consider they should earn the fees and not the miners who secure the foundation.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iadg0zv",
                                                    "author": "tl121",
                                                    "score": 6,
                                                    "created_utc": 1653783761.0,
                                                    "response": "I don’t think LN scales even with huge hubs,  because of the need to allocate financial capital to individual user channels.  This problem is unique to LN and does not exist with custodial accounts or traditional banks.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iaeefyu",
                                                            "author": "LovelyDayHere",
                                                            "score": 2,
                                                            "created_utc": 1653805325.0,
                                                            "response": "Fair point.\n\nRight now it doesn't scale, it would at least need big blocks otherwise opening and closing channels is prohibitive because of L1 limitations.\n\nSo it will turn to custodial models instead, because that L1 capacity isn't coming.",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "iaer81q",
                                                            "author": "jessquit",
                                                            "score": 2,
                                                            "created_utc": 1653816573.0,
                                                            "response": ">This problem is unique to LN and does not exist with custodial accounts or traditional banks.\n\nOh it certainly does too! And there exists a single time-proven solution to the problem -- one which literally every financial institution / bank on earth utilizes to overcome the inherent liquidity-binding problem. Want to guess what the solution is?\n\nThis has been my issue with LN from the go. It sets up a situation and railroads users into an intractible problem with only one possible solution -- *the very thing(s) people believe Bitcoin helps us avoid.*",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "iafj1jp",
                                                                    "author": "tl121",
                                                                    "score": 2,
                                                                    "created_utc": 1653835003.0,
                                                                    "response": "I was thinking of the intra bank liquidity problem.  If customer A is cashing a check at teller X, but teller X has insufficient cash in her drawer, teller X can get it from teller Y, etc.  Cash on hand is fungible throughout the bank, all tellers can use it.  Reserve funds (whether 100% or fractional) are not dedicated to individual user accounts or tellers).  However, there are more complicated banking situations, starting with branch banks and reserve banking, where some of the liquidity problems do indeed resemble LN rebalancing issues.  Decades ago I recall a conversation with my Uncle who was CFO of a large Philadelphia bank where he talked about sending checks by helicopter each night to the Fed in New York.   \n\nBitcoin prevents hidden inflation by blockchain transparency.  Traditional banking’s lack of transparency allows banks\n to inflate by fractional reserve banking.  But this is as much a social, legal and political issue as technological.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "iacu859",
                                                    "author": "YeOldDoc",
                                                    "score": 0,
                                                    "created_utc": 1653772854.0,
                                                    "response": "> How does this work? How do other LN nodes learn about your censored transaction and beat a path to your door to open a channel with you?\n\nYou have multiple channels with multiple nodes. If a node is offline by accident or censors you (you can't distinguish the two), it won't be included in the payment route (a single payment is routed via multiple channels at once). If a node is offline for longer periods of time, your wallet will close channels with that node and move the funds to your other channels or open new ones to more reliable nodes (who will earn fees instead).\n\n> 51% of LN liquidity will suck mining fees out of BTC in an ever increasing amount until the LN liquidity owners take over (buy up) the hashrate majority. BOOM. Mission accomplished. So why should the LN operators earn the fees. Nevermind, it's a rhetorical question. LN doesn't scale except with big hubs. Which will be run by banks or the equivalent. Of course they consider they should earn the fees and not the miners who secure the foundation.\n\nYou lost me here. You want miners running massive mining operations to earn fees, but you don't want miners who are also LN node operators to earn fees too?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iaerkjc",
                                                            "author": "jessquit",
                                                            "score": 2,
                                                            "created_utc": 1653816891.0,
                                                            "response": ">> How does this work? How do other LN nodes learn about your censored transaction and beat a path to your door to open a channel with you?\n>\n>You have multiple channels with multiple nodes. \n\nThe arguments against this are so obvious.\n\n1. If I have multiple accounts at multiple banks then banking is already exactly as censorship resistant as this model. There are way more banks than LN nodes so it's already more decentralized. **Nobody** would seriously make this argument.\n\n2. If I have X funding and have to spread across Y channels in order to have a probability that one will not censor me, then my censorship-resistant purchasing power is only X/Y. That is, if we assume a user needs 10 channels, then they need $1000 total just to be able to move $100. Hashtag things that you don't have to worry about onchain.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "iaexmc1",
                                                                    "author": "YeOldDoc",
                                                                    "score": 1,
                                                                    "created_utc": 1653822242.0,
                                                                    "response": "> If I have multiple accounts at multiple banks then banking is already exactly as censorship resistant as this model.\n\n1. Banks are custodians of your funds.\n2. Banks require KYC.\n3. Banks don't support atomic splits of your payment across different banks.\n\nIf you find a single bank for which none of the items above apply, let me know.\n\n***\n\n>> You have multiple channels with multiple nodes. If a node is offline by accident or censors you (you can't distinguish the two), it won't be included in the payment route (**a single payment is routed via multiple channels at once**).\n\n> If I have X funding and have to spread across Y channels in order to have a probability that one will not censor me, then my censorship-resistant purchasing power is only X/Y. \n\nNo, it's **X/Y * (Y-1)**.\nWhat you calculated was the funds required if **all channels but one** were expected to be offline - instead of only **any one** channel being offline. Big difference.\n\n\n> That is, if we assume a user needs 10 channels, then they need $1000 total just to be able to move $100.\n\nNot correct, to reliably move $100 while expecting one out of ten channels to be offline, they need ~$111 total and not $1000. ~$111 spread across 10 channels means ~$11 per channel. One channel temporarily offline means $111 - $11 = $100 liquidity in other channels that can be spent in a single payment.\n\n> The arguments against this are so obvious.\n\nYour counterargument is off by one whole magnitude. If roles were reversed, you would now take your flawed calculation and make a dedicated post under your mod account on the frontpage of this sub and try to gather ridicule and downvotes - as you have done multiple times (e.g. [here](https://np.reddit.com/r/btc/comments/ulhka1/ln_works_great_until_you_use_it/i7z5r7x/) and [here](https://np.reddit.com/r/btc/comments/s51qzg/the_new_gaslighting_ln_is_more_censorship/hsw3y2j/)). This is the state of LN discussion in this sub: FUD and ridicule. Priding itself for supporting free and open discussion and at the same time having mods who abuse their powers to organize shitstorms against LN supporters.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "iaeyiff",
                                                                            "author": "jessquit",
                                                                            "score": 1,
                                                                            "created_utc": 1653822969.0,
                                                                            "response": ">> If I have multiple accounts at multiple banks then banking is already exactly as censorship resistant as this model.\n>\n>1. Banks are custodians of your funds.\n>2. Banks require KYC.\n>3. Banks don't support atomic splits of your payment across different banks.\n>\n>If you find a single bank for which none of the items above apply, let me know.\n\nWe've been here before.\n\n1. Censorship without confiscation is still censorship\n\n2. Nothing prevents an LN from enforcing KYC prior to channel creation\n\n3. PayPal supports splits\n\n\n>> That is, if we assume a user needs 10 channels, then they need $1000 total just to be able to move $100.\n>\n>Not correct, to reliably move $100 while expecting one out of ten channels to be offline, \n\nOnline. Not offline.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "iaezss9",
                                                                                    "author": "YeOldDoc",
                                                                                    "score": 0,
                                                                                    "created_utc": 1653823974.0,
                                                                                    "response": ">> If you find a **single bank for which none** of the items above apply, let me know.\n\n> PayPal supports splits\n\nPayPal is custodian of your funds and requires KYC.\n\n***\n\n> **Me:** If **one** LN node censors your transaction (which is indistinguishable from them being simply offline) another LN node will route the tx and earn the fees.\n\n> **You:** ~[to reliably move $100 while expecting **nine out of ten** channels to be offline]\n\nWould you like to move the goalposts to all nodes but one being offline?",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "iaf21ul",
                                                                                            "author": "jessquit",
                                                                                            "score": 1,
                                                                                            "created_utc": 1653825611.0,
                                                                                            "response": "When LN nodes federate you have to protect against most nodes becoming hostile. Hoping for the best case scenario is planning on failure.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "iacmjc4",
                                            "author": "jonald_fyookball",
                                            "score": 6,
                                            "created_utc": 1653769226.0,
                                            "response": "> If one miner censors your transaction another miner will route the tx and earn the fees. If one LN node censors your transaction (which is indistinguishable from them being simply offline) another LN node will route the tx and earn the fees\n\n100% Wrong.  You have to have a channel set up with an LN node.  You cannot simply switch.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iactcmp",
                                                    "author": "YeOldDoc",
                                                    "score": -5,
                                                    "created_utc": 1653772441.0,
                                                    "response": "You have multiple channels with multiple nodes. A single payment is routed across multiple channels at once.\nA censoring node is indistinguishable from a node who happens to be offline by accident. Your wallet will remove channels with unreliable/offline/\"censoring\" nodes and instead maintain (and pay fees to) nodes which are reliable.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iadfmqg",
                                                            "author": "tl121",
                                                            "score": 5,
                                                            "created_utc": 1653783548.0,
                                                            "response": "This scheme might work **if** BTC fees were low and quick inclusion of transactions in blocks was guaranteed and transactions were small enough that users and hub operators could easily afford capitalization of funding. \n\nHowever,  being reputation based it prohibit anonymous hubs and KYC would be inevitable.\n\nHowever, were the base layer cost/performance assumptions met there would be no need or benefit from the second layer.\n\nMost people make transactions in amounts large enough that they would not be willing or able to tie up funds in multiple redundant channels, leaving only small transactions suitable for second layer offloading.\n\nLN hubs must dedicate funds to individual channels, lest they encounter layer 1 fees for rebalancing.  This makes it likely that they will need to establish customer relationships with related costs and liklihood of KYC.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "iaepkql",
                                                                    "author": "YeOldDoc",
                                                                    "score": -2,
                                                                    "created_utc": 1653815081.0,
                                                                    "response": "- Miners who also operate LN hubs can provide channel maintenance for free and earn fees via LN.\n- Non-mining LN hubs can upfront channel maintenance costs and recover fees via LN.\n- LN nodes are already reputation based and we don't see KYC (but the wording in the New York Bitlicense was suspected to affect miners since they issue coins).\n- LN nodes don't know sender, recipient and total amount which makes KYC difficult.\n- Miner do know these things (and have a physical location difficult to hide) which makes them more susceptible to KYC or law enforcement.\n- If a LN wallet is connected to multiple hubs, those hubs are in unique positions for rebalancing because of their high liquidity/routing volumes.\n- Similarly, if a LN wallet is connected to multiple hubs, it can rebalance itself via LN payments to itself\n- Single on-chain payment can be used to top up LN channels (e.g. via submarine swaps).",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "iacfxl9",
                            "author": "YeOldDoc",
                            "score": 1,
                            "created_utc": 1653766003.0,
                            "response": "If you were an attacker out to censor transactions, would you rather have control over 51% of hashrate or 51% of LN liquidity?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iacjydu",
                                    "author": "LovelyDayHere",
                                    "score": 3,
                                    "created_utc": 1653767943.0,
                                    "response": "Irrelevant hypothetical.\n\nSee my point here about big ~~liquidity~~ banks who will suck the fees out of Bitcoin via LN until they can buy up the mining hashrate.\n\nProbably, Foundry is the beginning of this trend.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "iaet2hi",
                                    "author": "jessquit",
                                    "score": 2,
                                    "created_utc": 1653818256.0,
                                    "response": "LN liquidity, that's easy. You can't effectively censor anything with 51% hashrate. Or even 80%. As soon as you start orphaning uncensored blocks, **the entire network** will be aware of your attack invalidate your blocks and fork you right the fuck off. It's a pointless way to lose money.\n\nMeanwhile on LN its literally impossible to even prove to anyone that you've been censored. It's not a consensus network. Nothing breaks if they do it and the only person who knows or cares about it is the victim.\n\nNext question?\n\n/u/LovelyDayHere",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iaezktl",
                                            "author": "YeOldDoc",
                                            "score": 1,
                                            "created_utc": 1653823806.0,
                                            "response": "> Meanwhile on LN its literally impossible to even prove to anyone that you've been censored. It's not a consensus network. Nothing breaks [...].\n\nCorrect. On LN a \"censoring\" node is indistinguishable from one being offline. Your wallet will ignore offline/unreliable nodes while routing payments and remove them over time, moving funds to your other channels. The \"victim\" does not know or care.\n\n> You can't effectively censor anything with 51% hashrate. Or even 80%. As soon as you start orphaning uncensored blocks, the entire network will be aware of your attack invalidate your blocks and fork you right the fuck off. It's a pointless way to lose money.\n\nAnd the minority chain you created after the chain split is still susceptible to further hashrate attacks by the attacker with 80% hashrate. Your only remedy is to change the mining algo. No big deal.\n\nSo your hashrate attack scenario affects every user, involves massive coordination, manual invalidation of individual blocks and a change of the mining algo. The LN liquidity attack on the other hand is not noticeable by most, hurts the attackers (they lose out on fees), incentivizes circumvention (those who provide online channels will earn the fees instead) and the process is already automated by some wallets.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iaf1wbw",
                                                    "author": "jessquit",
                                                    "score": 1,
                                                    "created_utc": 1653825502.0,
                                                    "response": "\n>And the minority chain you created after the chain split is still susceptible to further hashrate attacks by the attacker with 80% hashrate. Your only remedy is to change the mining algo. No big deal.\n\nNah the first time the attacker burns millions of dollars in energy for an \"attack\" just to have their attack effortlessly reversed they'll stop. They'll definitely stop before they render billions of dollars worth of SHA256 hardware into doorstops.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iaf3hn8",
                                                            "author": "YeOldDoc",
                                                            "score": 0,
                                                            "created_utc": 1653826600.0,
                                                            "response": "\"Effortlessly reversing\" an attack by splitting off into a minority chain with a different mining algo. Much better than LN wallets automatically opening new channels. Sure.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "iaf45k5",
                                                                    "author": "jessquit",
                                                                    "score": 1,
                                                                    "created_utc": 1653827042.0,
                                                                    "response": ">\"Effortlessly reversing\" an attack by splitting off into a minority chain with a **different mining algo.**\n\nNo. You're doing it again. Muted.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "iagpm7k",
                                                                            "author": "YeOldDoc",
                                                                            "score": 1,
                                                                            "created_utc": 1653854442.0,
                                                                            "response": "As you like to say: \"I am sure if you had a point you would have gone ahead and make it\".",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "iaepvyd",
                            "author": "johndoeisback",
                            "score": 1,
                            "created_utc": 1653815367.0,
                            "response": "It seems like people forget/don't know that LN uses onion-routing, meaning nodes don't know what they are routing unless they are the final destination, and even then when you receive a payment you don't know who sent it, you just know the last node that handed it to you. So it's a bit hard to rationally censor payments (unless you do it randomly, etc).\n\nOne could argue that the first hop will require KYC in these Phoenix-like wallets and this is a valid point, but given that it is fairly simple to create a public LN Tor node, I think these KYC wallets and their powerful hub nodes will face serious competition from anonymous providers.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iaerzip",
                                    "author": "jessquit",
                                    "score": 2,
                                    "created_utc": 1653817271.0,
                                    "response": "The onion routing thing is a total smokescreen.\n\nAnonymous providers at best will have 0.01% of the total liquidity and no major businesses will use them. It's trivial to create LN federations. All the major businesses will belong to a federation and they won't accept connections from non federation nodes.\n\nBy analogy you and me can create our own banks outside the banking federation and do business amongst ourselves. It's easy, mobsters do it all the time. The problem comes when you want to move the money that's locked inside the non federated banks to inside the federated system.\n\n> One could argue that the first hop will require KYC\n\nNo the LAST hop will require KYC. Get it?\n\nAmazon, etc only connects to federated bank hubs (ie Chase, BoA, etc). These only accept connections from KYC customers.  You want to use LN to buy anything from any business you've ever heard of? You'll have to use the federated LN.\n\nIf you create a bridge node between the federated and unfederated networks, it's trivial to see that your node isn't compliant. The unfederated users that you're routing are the only ones protected by onion routing. **You're** ass-to-the-wind.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iaetion",
                                            "author": "johndoeisback",
                                            "score": 1,
                                            "created_utc": 1653818658.0,
                                            "response": ">If you create a bridge node between the federated and unfederated networks, it's trivial to see that your node isn't compliant.\n\nIt's not trivial precisely due to onion routing. A node doesn't know what it's routing even if it has KYC'ed all his peers. So if you have a bridging node that is routing some unfederated users then nobody can know this except the bridging node itself. Let's say Amazon is part of the federated network and it receives a payment. There is no way Amazon knows if the payment originated from within the federated network or from outside due to some \"misbehaving node\" (aka the bridging node) somewhere in the network.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iaeu780",
                                                    "author": "jessquit",
                                                    "score": 2,
                                                    "created_utc": 1653819261.0,
                                                    "response": ">>If you create a bridge node between the federated and unfederated networks, it's trivial to see that your node isn't compliant.\n>\n>It's not trivial precisely due to onion routing. \n\nI see, so you think they're going to believe it's you personally creating thousands of payments a day?\n\nYou've been KYCed. It's YOU who are on the hook for whatever traffic you allow into the federation.\n\nIt's also trivial to disable / refuse the onion routing inside the federation....\n\nEdit: the world literally runs on federated payment networks. They're really, really good at this stuff.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iaeupmn",
                                                            "author": "johndoeisback",
                                                            "score": 1,
                                                            "created_utc": 1653819710.0,
                                                            "response": ">I see, so you think they're going to believe it's you personally creating thousands of payments a day?  \n>  \n>You've been KYCed. It's YOU who are on the hook for whatever traffic you allow into the federation.\n\nThat's the magic of onion routing: they don't know if the payments are mine or from other federated participants. They don't even know where the payments are going. Nobody knows anything except the recipient, which in turn only knows he received a payment, nothing else.\n\n>It's also trivial to disable / refuse the onion routing inside the federation....\n\nNot really, as it's part of the protocol. If they did then it would be something else, not LN, it would be some kind of LN fork. Obviously they can take this approach but why bother? It's way simpler to stick to Visa.\n\nEdit: intermediary nodes do know the amount being routed. Removed that part.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "iaexpfv",
                                                                    "author": "jessquit",
                                                                    "score": 2,
                                                                    "created_utc": 1653822311.0,
                                                                    "response": ">>I see, so you think they're going to believe it's you personally creating thousands of payments a day?  \n>>  \n>>You've been KYCed. It's YOU who are on the hook for whatever traffic you allow into the federation.\n>\n>That's the magic of onion routing: they don't know if the payments are mine or from other federated participants. They don't even know where the payments are going. \n\nThey know the source node where the payment entered the federation and they know everything that happens inside the federation. If the payment leaves the federation they know the exit node. It's literally exactly what the current banking system knows. \n\nAgain: there already exist unfederated banks and payment routers. The mafia, terrorists, etc all use them. The federated banks don't know what happens outside the federation. Those transactions cannot be monitored. They simply identify the entry and exit points where money is laundered in and out of the legal banking system and put those people in jail. It's a very effective strategy and can be employed exactly as well on LN as in regular banks.\n\n>>It's also trivial to disable / refuse the onion routing inside the federation....\n\n> Not really, as it's part of the protocol.\n\nLightning isn't a consensus network.\n\n> If they did then it would be something else, not LN, it would be some kind of LN fork.\n\nYes, it would be the LN that had all the liquidity and all the major businesses.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "iaf074d",
                                                                            "author": "johndoeisback",
                                                                            "score": 1,
                                                                            "created_utc": 1653824271.0,
                                                                            "response": ">They know the source node where the payment entered the federation and they know everything that happens inside the federation. If the payment leaves the federation they know the exit node. It's literally exactly what the current banking system knows.\n\nIt's different with LN due to onion routing. Payment details are hidden, so federated participants don't know what's going on, they only see payments flying around. When a federated node sees a payment it doesn't know who sent it, where it's going, what route it took, what route it will take, whether it originated from another federated participant or not, whether it's going to another federated participant or not.\n\n>Lightning isn't a consensus network.\n\nIt's a payment protocol, if you create your own rules then it's a different protocol and you won't be able to communicate with those that use the original protocol.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "iaf276d",
                                                                                    "author": "jessquit",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653825711.0,
                                                                                    "response": "\n>It's different with LN due to onion routing. \n\nIt's no different than an ISP being aware you're running a TOR exit node.\n\nThey can't tell who's using it. That's not the point. They can tell that you're running it. Then they remove you from the federated network because you're not enforcing KYC.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "iaf63rq",
                                                                                            "author": "YeOldDoc",
                                                                                            "score": 1,
                                                                                            "created_utc": 1653828261.0,
                                                                                            "response": "So let the federation use their own coin. If they have the power to force the economy to use a certain coin, they would do just the same with miners. The idea that a federation is strong enough to force a certain level 2 protocol but not a certain level 1 protocol is ridiculous.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        },
                                                                                        {
                                                                                            "id": "iaf5lhm",
                                                                                            "author": "johndoeisback",
                                                                                            "score": 1,
                                                                                            "created_utc": 1653827952.0,
                                                                                            "response": ">It's no different than an ISP being aware you're running a TOR exit node.\n\nActually the whole LN is like Tor so it would be like trying to identify from which node a given request has originated. You will have a hard time because the network was designed to prevent it.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "id": "iaf2ia8",
                                                                                    "author": "jessquit",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653825924.0,
                                                                                    "response": "\n>>Lightning isn't a consensus network.\n>\n>It's a payment protocol, if you create your own rules then it's a different protocol and you won't be able to communicate with those that use the original protocol.\n\nSure, but where will the liquidity and business be? On the KYC federated version.",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "id": "iaf1eht",
                                                                    "author": "YeOldDoc",
                                                                    "score": 2,
                                                                    "created_utc": 1653825142.0,
                                                                    "response": "> Edit: intermediary nodes do know the amount being routed. Removed that part.\n\nWith multipath payments, a payment is split across multiple routes at once, so intermediaries actually only know a partial amount, but not the total amount, so you were correct if multipath payments become default (which is likely as it increases reliability).",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "iaf755h",
                                                                            "author": "johndoeisback",
                                                                            "score": 1,
                                                                            "created_utc": 1653828884.0,
                                                                            "response": "Yes. But my comment originally pointed out that intermediary nodes don't know the amount being routed, when they obviously do, that's why I amended it. But of course they don't know if that amount is part of a larger amount.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "iaghy2c",
                                                                                    "author": "YeOldDoc",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653850851.0,
                                                                                    "response": "I see, got it!",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iac5tlb",
                    "author": "PublicCurrency9039",
                    "score": 3,
                    "created_utc": 1653761141.0,
                    "response": "For me, things are pretty clear:\n\nCentralized ➡️ no control of my money!\nDecentralized ➡️ control of my money!!\n\nLightning network? How efficient is it?\nBitcoin Cash: Efficient, fast, cheap, reliable!!\nP2P electronic cash for the world!!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iac2f6j",
                    "author": "Kay0r",
                    "score": 3,
                    "created_utc": 1653759516.0,
                    "response": "In a couple of years is going to be 'hedge against the entire world but us'",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iabmbkh",
                    "author": "Kazakkbdk",
                    "score": 7,
                    "created_utc": 1653751979.0,
                    "response": "\\>hedge against central banking\n\n\\>maxi ideology fully focused around obtaining more dollars and using it as a currency",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iac9bsn",
                    "author": "WhatMixedFeelings",
                    "score": 2,
                    "created_utc": 1653762846.0,
                    "response": ">hedge against central banking as a whole\n\nI’d argue that’s Monero. 😎",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iack402",
                            "author": "LovelyDayHere",
                            "score": 2,
                            "created_utc": 1653768018.0,
                            "response": "Monero ain't bad.\n\nBCH and Monero are both trying to be p2p cash, but have different strengths at this point.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iadxu79",
                                    "author": "WhatMixedFeelings",
                                    "score": 3,
                                    "created_utc": 1653793830.0,
                                    "response": "Besides initial wallet sync time, what does BCH have that XMR doesn’t?  (It’s worth noting Monero will have a hard fork in July to improve sync time.)\n\nEdit: good replies. I can see BCH and XMR coexisting. However, I wish BCH was still ‘Bitcoin’ for the sake of notoriety",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iae3hxs",
                                            "author": "tl121",
                                            "score": 2,
                                            "created_utc": 1653797409.0,
                                            "response": "I believe XMR has at least a 10x factor greater transaction size than BCH.  This translates into BCH transactions costing 10x less to process than XMR transactions, measured by life cycle hardware and network costs.\n\nMy initial impression is that the BCH user experience is better than XMR and the BCH software is more mature.  However, I have much more experience with BCH, hence this could be an unfair “apples to oranges” comparison.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "iae1ujd",
                                            "author": "Choice-Business44",
                                            "score": 1,
                                            "created_utc": 1653796331.0,
                                            "response": "Scaling is the biggest one(need this to replace banking), also network effect",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iae31on",
                                                    "author": "WhatMixedFeelings",
                                                    "score": 1,
                                                    "created_utc": 1653797108.0,
                                                    "response": "Monero has a dynamic blocksize which is arguably superior to BCH",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iaeqmie",
                                                            "author": "LovelyDayHere",
                                                            "score": 1,
                                                            "created_utc": 1653816025.0,
                                                            "response": "Very likely BCH will get [something like a dynamic block size](https://bitcoincashresearch.org/t/asymmetric-moving-maxblocksize-based-on-median/197) too, but right now, yes, Monero has the advantage there by having it implemented long ago.\n\nHowever: I've not seen any actual scaling tests on Monero network to demonstrate capacity.\n\nMaking the blocksize dynamic does not solve all scaling issues. There are lots of technical areas in a software client that need improvement to unlock the additional capacity. From storage, to network protocols etc.\n\nOn BCH we have active research on those scaling areas and are actually testing larger block sizes (256MB, 1GB) to find bottlenecks etc. I'd love you to point me at discussion of similar tests on XMR.\n\nOn BCH we also know that scaling isn't simply a matter of the protocol, it's the network around it too:\n\nhttps://bitcoincashresearch.org/t/assessing-the-scaling-performance-of-several-categories-of-bch-network-software/754",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "iaf03cp",
                                                                    "author": "GETSOME88-007",
                                                                    "score": 2,
                                                                    "created_utc": 1653824193.0,
                                                                    "response": "Monero has unlimited supply, BCH is limited to 21 million",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "iaedvea",
                                            "author": "LovelyDayHere",
                                            "score": 1,
                                            "created_utc": 1653804860.0,
                                            "response": "Apart from what others have mentioned:\n\n- smart contracts via Script (\"programmable money\")\n- ability to chain transactions with instant respends without having to wait for confirmations\n- ability to give someone a sweepable privkey (not sure if XMR has this) enabling sender-offline transactions\n- easy to create transactions to pay multiple recipients at once (not sure if XMR has this)\n- relatively easy multisig\n- message notarization / tx annotation capability.via data carrier field\n- strong Schelling point of fixed supply, resisting temptation of inflating a tail emission\n- Block explorers to let people understand how it works and that it works (I'm listing this as an advantage of transparency)\n\nu/tl121 you might know if some of my points are moot (e.g. sweepable keys, paying to multiple outputs etc)",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "iacale3",
                            "author": "j_aurelius123",
                            "score": -1,
                            "created_utc": 1653763459.0,
                            "response": "What is BCH a hedge against? Lol... nothing it's literally pure garbage and most of you in here are delusional to think otherwise.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iacedwh",
                                    "author": "OsrsNeedsF2P",
                                    "score": 4,
                                    "created_utc": 1653765278.0,
                                    "response": "It's not a hedge, it's a P2P transaction system.\n\nLegit paid 2 people in the last hour with it. Can't do that with BTC",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "iadvs6s",
                                    "author": "Casino_Insider",
                                    "score": 1,
                                    "created_utc": 1653792619.0,
                                    "response": "Why does Bitcoin needs to be an hedge against something? Is it because it's otherwise flawed and not as good at achieving its original goal as thought it would be?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "iaeqkbz",
                            "author": "johndoeisback",
                            "score": 1,
                            "created_utc": 1653815972.0,
                            "response": "It seems like this sub is slowly turning from bch-centric to monero-centric 🤔",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iaf4lk3",
                    "author": "jbgirgis",
                    "score": 2,
                    "created_utc": 1653827331.0,
                    "response": "putting the lightning network on a plastic card is like putting a combustion engine on a horse.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iabzjed",
                    "author": "ChaosElephant",
                    "score": 2,
                    "created_utc": 1653758149.0,
                    "response": "Or ~~using~~ \"investing in\" central banking controlled BTC for that matter.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iacven8",
                    "author": "Ima_Wreckyou",
                    "score": -1,
                    "created_utc": 1653773432.0,
                    "response": "The Lightning network is pretty decentralized. It's also a second layer so there are entirely different centralization concerns and it doesn't compromise the main layer by increasing the hardware demand that would make it impossible for most users to be part of the decentralizing force that secures consensus rules.\n\nFeel free to down vote because this is true but hurts your feelings.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iadipih",
                            "author": "jbrev01",
                            "score": 2,
                            "created_utc": 1653785242.0,
                            "response": "In theory LN is decentralized. In practice, it is 100% centralized and requires trust.\n\n[What is the Lightning Network](https://youtu.be/k14EDcB-DcE)\n\n[Rick Reacts to Lightning (Again)](https://youtu.be/Ug8NH67_EfE)\n\nYou cannot use LN now without using a custodial service (third party requiring trust). If you try, your transactions will fail and you risk losing bitcoin.\n\nBCH works now and has always worked, without requiring any trust or third parties. It is pure peer-to-peer electronic cash without middle men where you can be your own bank.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iaedgxu",
                                    "author": "Ima_Wreckyou",
                                    "score": 1,
                                    "created_utc": 1653804535.0,
                                    "response": "I constantly use LN right now from my own node, without any third party trust and it works absolutely fine.\n\nI bet you don't even run your own node and use a wallet where you have to trust the information of someone else's node to actually interact with bcash.\n\nThe reality denial in this sub is really something",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iaerrqu",
                                            "author": "dave_aj",
                                            "score": 1,
                                            "created_utc": 1653817076.0,
                                            "response": "Any resources you’d recommend for learning how to set up a lightning node ?\n\nI’m interested.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iaf1pmj",
                                                    "author": "Ima_Wreckyou",
                                                    "score": 2,
                                                    "created_utc": 1653825368.0,
                                                    "response": "https://raspibolt.org/  \nhttps://github.com/rootzoll/raspiblitz",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iaf281m",
                                                            "author": "dave_aj",
                                                            "score": 1,
                                                            "created_utc": 1653825728.0,
                                                            "response": "Thanks",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "iafl0yk",
                                            "author": "AkinyeliZ",
                                            "score": 1,
                                            "created_utc": 1653835907.0,
                                            "response": "From quite some time no Buy buy shouting is happening..panic among paper traders .",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "iaeqnh2",
                                    "author": "johndoeisback",
                                    "score": 1,
                                    "created_utc": 1653816048.0,
                                    "response": ">You cannot use LN now without using a custodial service (third party requiring trust). If you try, your transactions will fail and you risk losing bitcoin.\n\nCare to explain this further?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "iafn9o3",
                            "author": "codochi",
                            "score": 1,
                            "created_utc": 1653836918.0,
                            "response": "Exactly.  People just do what's easy, they aren't worried about the hook hidden in the worm.  \n\nAs the lightning network continues to grow, it's ease will become more and more comparable to existing fintech, and switching will become more and more common.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iacajjc",
                    "author": "j_aurelius123",
                    "score": -4,
                    "created_utc": 1653763434.0,
                    "response": "What is BCH a hedge against? Lol... nothing it's literally pure garbage and most of you in here are delusional to think otherwise.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaceh6w",
                            "author": "OsrsNeedsF2P",
                            "score": 6,
                            "created_utc": 1653765323.0,
                            "response": "Since you copy pasted your post, I'll copy paste my answer: \n\nIt's not a hedge, it's a P2P transaction system.\n\nLegit paid 2 people in the last hour with it. Can't do that with BTC",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iace1qg",
                    "author": "OsrsNeedsF2P",
                    "score": -2,
                    "created_utc": 1653765119.0,
                    "response": "If an LN node goes down, you'll route through another one. This is a shortest path problem, not a centralization one.\n\nIt's also been a while so if someone wants to call me a shill, run cryptochecker first",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iafljpi",
                            "author": "kurtkrut",
                            "score": 1,
                            "created_utc": 1653836144.0,
                            "response": "Lightning Network is a OFFCHAIN network.\n\nWhere is blockchain and bitcoin???",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iaeuax4",
                    "author": "410984195",
                    "score": 0,
                    "created_utc": 1653819349.0,
                    "response": "There's enough legit reasons to use lightning that you shouldn't just invent stuff that's not happening.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}