{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uu5bhw",
            "title": "MicroStrategy Has No Intention To Sell Bitcoin (BTC), Says Company CFO: Report.",
            "url": "https://www.reddit.com/r/btc/comments/uu5bhw/microstrategy_has_no_intention_to_sell_bitcoin/",
            "author": "Gwen765",
            "created_utc": 1653073769.0,
            "score": 12,
            "num_comments": 0,
            "subreddit": "btc",
            "selftext": "Despite Bitcoin's dismal price behavior over the last six months, MicroStrategy has no intentions to liquidate its holdings, according to the company's chief financial officer.\n\nMicroStrategy CFO Andrew Kang told the Wall Street Journal that the company's shareholders are \"aligned\" with its plan and haven't pressed the company to sell its BTC holdings.\n\nWe have no intention of selling at this time. I'm not aware of any scenarios in which we would sell.\"\n\nAccording to Michael Saylor, the company's CEO, MicroStrategy has purchased a total of 129,218 Bitcoin for $3.97 billion, equating to an average price of about $30,700 per BTC.\nKang said the company has no plans to shift direction because of the recent crypto price drop, which has seen Bitcoin and the rest of the crypto markets plummet from all-time highs.\n\"Some of the recent volatility was undoubtedly related to actions outside of Bitcoin.\" We keep an eye on it from a market standpoint, but there's nothing fundamental about bitcoin that we believe poses a threat to our strategy.\"\n\n\nI think we have all witnessed the intensive sellout in the crypto sphere occurring in the past weeks as the price of Bitcoin and other cryptocurrencies continues to move in a downward  trend. However there has been an increase in adoption of Bitcoin use by government and commercial establishments which is quite exciting. This without a doubt indicates the impending full on mainstream adoption of Bitcoin.Which makes it a more obvious reason to store Bitcoin \n\nAlso i think when on considers the blockchain ecosystem which is rapidly developing with innovative project catering to diverse needs in the ecosystem and proffering different solutions to how business, gaming, entertainment, finance and potentially society itself operates with project such as  Luckyblock which  is a digital asset project that decentralizies the lottery process via blockchain technology,Tea an open-source software platform revolutionizing open‐source by leveraging blockchain and web3. Tea is developing a first-of-its-kind decentralized system for fairly remunerating open-source developers based on their contributions to the entire ecosystem, Decentraland  an online world that allows users to create their own avatars and purchase plots of virtual land,  Silks a blockchain-based metaverse that enables users to own, trade, and profit from thoroughbred racing horses. This indicates how important blockchain  technology adoption will be to our global civilization in  coming years and without a doubt would increase the value of crypto assets. \n\nI don't think that anyone that is really enthusiastic about Bitcoin or that understands how the cryptocurrency could potentially revolutionize the global financial system would sell their holdings because the market is bullish. \nI personally would buy as much as i can before Bitcoin's price corrects itself in an upward movement. \n\nNews source:  https://dailyhodl.com/2022/05/20/microstrategy-has-no-intention-to-sell-bitcoin-btc-says-company-cfo-report/",
            "stickied": false,
            "comments": []
        }
    ]
}