{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uzxd9g",
            "title": "After Adopting Bitcoin, Central African Republic Set to Build a Crypto Hub. Could we see more Countries adopt Bitcoin Use ?",
            "url": "https://www.reddit.com/r/btc/comments/uzxd9g/after_adopting_bitcoin_central_african_republic/",
            "author": "Beltondkj",
            "created_utc": 1653775864.0,
            "score": 3,
            "num_comments": 2,
            "subreddit": "btc",
            "selftext": "President Faustin-Archange Touadéra of the Central African Republic tweeted that the new effort, which aims to turn the country into a crypto hub, has the potential to revolutionize the country's financial system. \n\nThe president gave no indication of when the hub will be open to investors or how its Bitcoin goal would be implemented. He has, however, apparently stated a need to start such a project:\n\n\"The formal economy is no longer a viable alternative.\" We are trapped in systems that do not allow us to compete because of an impenetrable bureaucracy.\"\n\nAccording to the government's presentation, the Sango project entails the creation of a Digital Nation Bank and the development of a crypto wallet that is compatible with layer-two implementations like the Lightning Network and may be used by businesses to receive such payments.\n\nThe \"Bitcoin Law\" in CAR stipulates that all crypto exchanges operating in the country are tax-free. Government institutions now recognize digital identity and ownership thanks to the country's legislative structure. The government hopes to attract crypto investors from all over the world in this way.\n\nThe idea suggested that the government would promote crypto enterprises' access to natural resources like as gold, diamonds, and uranium, as well as develop a \"citizenship by investment\" scheme with tax advantages for businesses. Furthermore, the government will make \"land buys in Bitcoin for global investors\" easier.\n\n\nIn my opinion it is quite interesting to see Bitcoin being used as a currency. I think that if Bitcoin use is successful in El Salvador and CAR such that it proves to be a viable investment for then that other countries would also adopt their use. Bitcoin it's technology Blockchain is innovative and could potentially disrupt the global sector and overtime even become the standard for monetary transactions. \n\nBlockchain technology is rapidly advancing with innovative projects such as Decentraland  an online world that allows users to create their own avatars and purchase plots of virtual land, Shiryo is a P2E Card trading game in the metaverse that allows users to hold their cards as NFTs also based on the Ethereum network, Brave web browser that it gives its users the option to view ads or not , if users choose to view them, they will be rewarded with Basic Attention Tokens (BAT), PancakeSwap a decentralized  exchange allows users to buy and sell digital tokens without going through a third party. That could possibly change how the industries they are in operate. I think that as Blockchain technology becomes more mainstream and the value of Bitcoin and it's alternatives increases that more countries would adopt Bitcoin use.\n\nNews Source: \nhttps://cryptopotato.com/after-adopting-bitcoin-central-african-republic-set-to-build-a-crypto-hub/",
            "stickied": false,
            "comments": [
                {
                    "id": "iadvxx9",
                    "author": "hero462",
                    "score": 3,
                    "created_utc": 1653792710.0,
                    "response": "It's tragic that these countries have the right idea and can really benefit from crypto adoption but they've fallen into the dead end BTC/ Lightning trap.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iadzdc3",
                            "author": "Big_Bubbler",
                            "score": 2,
                            "created_utc": 1653794760.0,
                            "response": "So true\\^",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}