{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "usy83b",
            "title": "The blocking feature is frequently used. Likely as a form of censorship. What can we do about it.",
            "url": "https://www.reddit.com/r/btc/comments/usy83b/the_blocking_feature_is_frequently_used_likely_as/",
            "author": "Remora_101",
            "created_utc": 1652946366.0,
            "score": 14,
            "num_comments": 15,
            "subreddit": "btc",
            "selftext": "I have experience this a few times now. People are upset and post one last post to have the last word, then block you.\n\nThis greatly disrupts the flow of the conversation and lets them have the last word where they can post their views or even  blatant lies without the fear of a counter argument. \n\nIf they open topics all people they have blocked are unable to participate, they can't even answer to other peoples post. \n\n__This is almost moderator level of censorship power.__\n\n\nI have no idea what can be done against it, but I thought a little awareness can't hurt.\n\n.\n\nEdit: Also, be aware that you don't get a \"you are blocked message\" The error message you get is:\n\n\n>Something is broken, please try again later.\n\nThen go to their user page and if it is empty you know that you have been blocked.",
            "stickied": false,
            "comments": [
                {
                    "id": "i96h421",
                    "author": "fiendishcrypro",
                    "score": 5,
                    "created_utc": 1652948975.0,
                    "response": "I didn't know this. That is really stupid. I thought blocking meant only that you didn't see what the person you've blocked has written.\n\nEdit: jesus this was changed 4 months ago [Reddit](https://www.reddit.com/r/blog/comments/s71g03/announcing_blocking_updates/?utm_medium=android_app&utm_source=share). What a stupid change.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i96yszr",
                            "author": "ShadowOrson",
                            "score": 3,
                            "created_utc": 1652962520.0,
                            "response": "Edit; D'oh! you mentioned this in your OP\n\nBlocking someone also precludes that blocked individual from commenting in any post the blocker created. So, in some small effect, the blocker is able to remove you from conversations with others, as well.\n\nI found this out last week. After a poor (mostly my fault) interaction with /u/br0kenrabbittv , they blocked me. I was going to interact with someone within a post br0ken had created, to find out that I could not reply to anyone within that thread. If memory serves, I had located a bot/ai account and wanted to report it, but could not due to br0ken's block. I could be misremembering though.\n\nEdit: I seems that reddit, in their infinite wisdom, has created a \"safe space\" for those that are offended. Reddit also seems to have removed the \"mute\" feature (unless I'm just not seeing it anymore)",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i973olj",
                                    "author": "-ism-isa-con",
                                    "score": 0,
                                    "created_utc": 1652965179.0,
                                    "response": "I witnessed the interaction you had with br0kenrabbittv and I do hope you will be more understanding and less manipulative in the future.  It's thanks exclusively to you that I'm not really interested in using Purse.io any further.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i975430",
                                            "author": "ShadowOrson",
                                            "score": 1,
                                            "created_utc": 1652965891.0,
                                            "response": "> I witnessed the interaction you had with br0kenrabbittv\n\nOf course you witnessed it, the conversation was held in the open. \n\n> I do hope you will be more understanding and less manipulative in the future.\n\nI hope the same for you.\n\n>  It's thanks exclusively to you that I'm not really interested in using Purse.io any further.\n\nNo. Do not put that on me. You had, and continue to have, unreasonable expectations. I do not accept responsibility for your state of mind. The fact that you feel the need to blame me further illustrates your unreasonableness.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i97h5cf",
                                                    "author": "-ism-isa-con",
                                                    "score": 1,
                                                    "created_utc": 1652971330.0,
                                                    "response": "I don't blame you for anything.  I don't want to interact with you on a business level because you can't be trusted.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i97kahg",
                                                            "author": "ShadowOrson",
                                                            "score": 1,
                                                            "created_utc": 1652972646.0,
                                                            "response": "> I don't blame you for anything. I don't want to interact with you on a business level because you can't be trusted.\n\nThat's good to know. We've never interacted \"on a business level\" and I highly doubt we ever will. \n\n**Re: Manipulation** (I had thought to edit my previous comment, but decided, after seeing your latest comment, to just include the below here)\n\nThere is only one person attempting to manipulate here, and that is you.\n\nOn 4/23/2022, 11:08:09 AM you stated:\n\n> [I have to say that some of the earners at Purse are ideological.  If you're not among the \"woke\" your goods may arrive damaged or you may have some other problems.](https://camas.unddit.com/#{%22author%22:%22-ism-isa-con%22,%22subreddit%22:%22btc%22,%22resultSize%22:500,%22query%22:%22Purse%20are%20ideological%22})\n\n(1) When I called you out on that ridiculous conclusion, you deleted your comment. Trying to hide what you had said, attempting to manipulate the narrative to make yourself seem more reasonable than you actually were/are.\n\n(2) Your comment was/is obviously derived from your one poor experience. \n\n(3) I pointed out, in that original conversation thread what I believed to be logical inconsistencies and utter unreasonableness.\n\nThen on 4/25/2022, 9:07:54 AM\n\nYou made [your comment here](https://www.reddit.com/r/btc/comments/ub6w9c/alternatives_to_purseio/i65945u/), where you explain your one poor experience with Purse. Throughout that explanation you never once informed the readers what your actual expectations were. \n\nDue to that lack of that specific information, the subsequent conversation, and my pessimism; I concluded (but did not specifically state) that you were/are an unreasonable sort of person. Over the course of 24 hours we had multiple interactions in that conversation. \n\nMy last comment was on 4/25/2022, 11:13:19 PM\n\nThen you waited 12 days to continue the conversation. \n\nDuring that 12 day time period, on 5/12/2022, 6:21:50 PM [you made a comment](https://www.reddit.com/r/btc/comments/uo5xo9/one_month_ago_i_predicted_the_collapse_of_luna/i8e8v1l/), in a wholly unrelated thread, about me, without pinging me so I could have the opportunity to respond; another manipulation tactic. You attempted to associate me with \"**scammers, generally unethical people, and even political actors.**\" and accused me of \"haranguing\" you, so as to create a narrative of your victim-hood.\n\nYour [original comment](https://camas.unddit.com/#{%22author%22:%22-ism-isa-con%22,%22resultSize%22:500,%22query%22:%22There%20are%20also%20a%20lot%20of%20scammers,%20generally%20unethical%20people,%20and%20even%20political%20actors.%22}) did not include your reference to me. \n\n\nOn 5/8/2022, 1:33:53 AM [you resume the conversation](https://www.reddit.com/r/btc/comments/ub6w9c/alternatives_to_purseio/i7ryx51/): you attempt to create the allusion that I am a representative of Purse, so as to continue your manipulation of your chosen narrative. \n\nI waited to respond until 5/18/2022, 6:55:22 PM. At that time I was fed up with your manipulation tactics, so I chose to minimize my engagement and just draw any other reader's attention to your behavior.\n\nThen on 5/18/2022, 9:24:24 PM you create another comment, [original here](https://camas.unddit.com/#{%22author%22:%22-ism-isa-con%22,%22resultSize%22:500,%22query%22:%22Always%20interesting%20when%20someone%20pretends%20to%20be%20talking%20to%20you,%20but%20they%20are%20really%20talking%20to%20other%20people.%20%22}). \n\nNow, you're here, in another thread, attempting to manipulate the narrative. Again alluding to me being a representative of Purse. \n\nI'm going to stop now, as I do not wish to continue interacting with someone (you, /u/-ism-isa-con ) I believe to be bat shit crazy. <Rolls eyes> ya, purse.io earners purposefully damaged the thing you ordered, even though they never once touched it. JFC you're insane.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i96m85h",
                    "author": "BewareOfShills",
                    "score": 4,
                    "created_utc": 1652953627.0,
                    "response": "Yeah it's bad. But no idea what to do about it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i971zai",
                    "author": "doramas89",
                    "score": 3,
                    "created_utc": 1652964286.0,
                    "response": "Agree. Im absolutely pissed at that Alberdioni guy blocking me so that I can't comment on his spam posts. You'll see this user write nonsense articles about the latest topic just to earn money on ReadCash.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i96gfoy",
                    "author": "undadatunda",
                    "score": 3,
                    "created_utc": 1652948353.0,
                    "response": " you could make a comment to yourself just above the comment where they block you\n\nidk just ideas..but ya if they make posts and you cant comment in it the post it does suck..but you can also pm the people if you need to really say something to someone in that post i suppose\n\ni got banned in the r bitcoin sub but i still pm people there and the mods there are totally out of the conversation now lol\n\npeer to peer",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i96jxmt",
                            "author": "BewareOfShills",
                            "score": 5,
                            "created_utc": 1652951564.0,
                            "response": "I think that doesn't work if you had an interaction of more than 2 posts since there is already a post from the blocker infront of that post. \n\nEditing your post is the only option I found to get any information into the conversation after you have been blocked.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i96egom",
                    "author": "Hakametal",
                    "score": 0,
                    "created_utc": 1652946565.0,
                    "response": "It's their choice, if they want to block you they have the right to block you. That's not censorship.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i96fyh5",
                            "author": "Remora_101",
                            "score": 4,
                            "created_utc": 1652947919.0,
                            "response": "Read again, that would be the case if it would block direct interaction. But it is much worse it shuts you out completely from everything behind their post. Worst case from a complete topic.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i96weva",
                                    "author": "baddecision116",
                                    "score": -6,
                                    "created_utc": 1652961107.0,
                                    "response": "Who cares. This is reddit not something important.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i98at9f",
                    "author": "LovelyDayHere",
                    "score": 1,
                    "created_utc": 1652983354.0,
                    "response": "I hardly ever use the blocking feature myself.\n\nBut I think if you notice someone who is violating sub rules in their comments and then just block in order to avoid further discussion - you can write a message to the mods and we can look at the individual case.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "usybis",
            "title": "Tether, are you okay 🥺 ?",
            "url": "https://i.redd.it/8cv7gbov1e091.jpg",
            "author": "Egon_1",
            "created_utc": 1652946797.0,
            "score": 31,
            "num_comments": 60,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i97ced0",
                    "author": "Blazedout419",
                    "score": 20,
                    "created_utc": 1652969274.0,
                    "response": "Well, Tether loosing market cap, but holding the peg is actually healthy. I would love to see it drop much further while holding the $1 peg for sure.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i96gfml",
                    "author": "Music-Entire",
                    "score": 20,
                    "created_utc": 1652948351.0,
                    "response": "Its market cap, market makers cashing out and dicthing UST pair liquidity",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i96kci6",
                            "author": "jessquit",
                            "score": 15,
                            "created_utc": 1652951945.0,
                            "response": "Aka bank run.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i96r9qv",
                                    "author": "bitcoiner_since_2013",
                                    "score": 8,
                                    "created_utc": 1652957707.0,
                                    "response": "So you are saying Tether survived a bank run or are we still waiting?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i96rmdz",
                                            "author": "jessquit",
                                            "score": 7,
                                            "created_utc": 1652957959.0,
                                            "response": "Here's the thing about fractional reserve.\n\nLet's say you're a bank with 100 equal value customers and you're 50% reserved.\n\nIf 49 of your customers run the bank, your bank works just as well as if it was 100% reserved and nothing at all bad happens.\n\nIf 2 more customers join the run then you're bankrupt and the other 48 customers are totally fucked.\n\nFrom this graph it appears only 49 customers wanted to cash out their Tether so far.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i96secm",
                                                    "author": "bitcoiner_since_2013",
                                                    "score": 9,
                                                    "created_utc": 1652958501.0,
                                                    "response": "So we were very close to Tether collapsing?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i977drv",
                                                            "author": "BewareOfShills",
                                                            "score": 10,
                                                            "created_utc": 1652966980.0,
                                                            "response": "Nobody knows, since we don't have any real data about their their reserve. Assume the worst case.",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "i97cjxv",
                                                            "author": "Blazedout419",
                                                            "score": 3,
                                                            "created_utc": 1652969343.0,
                                                            "response": "Doubtful it will crash since that would tank the entire market. I think these large exchanges have plenty of cash to hold it up. The amount of profit they rake in is insane...",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "i970cdb",
                                                            "author": "Louisvanderwright",
                                                            "score": 5,
                                                            "created_utc": 1652963393.0,
                                                            "response": "Yes and when it does, the whole crypto fever breaks. We are talking about dozens of coins going to zero.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i980k5f",
                                                                    "author": "gr8ful4",
                                                                    "score": 4,
                                                                    "created_utc": 1652979236.0,
                                                                    "response": "good. Only a handful of projetcs deserve to have any significant value.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "i96u7nb",
                                                            "author": "gr8ful4",
                                                            "score": 3,
                                                            "created_utc": 1652959728.0,
                                                            "response": "Yes, we are close to Tether collapsing. You will know for sure that the collapse happened when BCH and XMR trade in the 5 figure range.\n\nWhat you can do to fasten this process is withdraw all your BCH and XMR from CEX (cryptobanks) and make as many people as possible aware of this situation. Else you can sell USDT for USD in Kraken and see what happens. This is the only pair where you can tarde USDT for \"real\" USD. And they are heavily manipulating it. But where there is manipulation there is potential gain.\n\nThere will be Monerorun 2 on June 8th (tail emission day). I'd like to see the BCH community join forces with the Monero community.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i97cohr",
                                                                    "author": "Blazedout419",
                                                                    "score": 5,
                                                                    "created_utc": 1652969399.0,
                                                                    "response": "lol.. why would any crypto do well if Tether crashed? That would drag Bitcoin down and when Bitcoin tanks all the other coins follow it and a much faster pace.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i98r5od",
                                                                            "author": "rambumriott",
                                                                            "score": 2,
                                                                            "created_utc": 1652990046.0,
                                                                            "response": "sorry but that’s not a sure-fire recipe. re evaluate your strategies",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i98swkr",
                                                                                    "author": "Blazedout419",
                                                                                    "score": 1,
                                                                                    "created_utc": 1652990760.0,
                                                                                    "response": "You think if Tether tanked that any coins would do well? You would see most users dump all the alts into fiat, Bitcoin or Eth.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i98tioz",
                                                                                            "author": "rambumriott",
                                                                                            "score": 2,
                                                                                            "created_utc": 1652991015.0,
                                                                                            "response": "do you think if bitcoin tanked, tether would do well? People buy alts for their specific case scenarios, how do you know people wouldn’t expect a dump in BTC and ETH and sell them into alts in hopes of an alt season super pump? especially after this bear market… alot of Alts are underbought right now",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "id": "i96vb91",
                                                                    "author": "bitcoiner_since_2013",
                                                                    "score": 3,
                                                                    "created_utc": 1652960430.0,
                                                                    "response": "Are you serious?",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i96wafj",
                                                                            "author": "gr8ful4",
                                                                            "score": -1,
                                                                            "created_utc": 1652961032.0,
                                                                            "response": "Yes. USDT has reached the EOL for TPTW. They need to get rid of it and they will do so in the most destructive way. That'S why we should use this to our advantage and decouple BCH and XMR from the rest.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i96wl7u",
                                                                                    "author": "bitcoiner_since_2013",
                                                                                    "score": 2,
                                                                                    "created_utc": 1652961215.0,
                                                                                    "response": "TPTW?",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i96wwud",
                                                                                            "author": "gr8ful4",
                                                                                            "score": 1,
                                                                                            "created_utc": 1652961412.0,
                                                                                            "response": "The powers that were. There is a big shift taking place in the world about who is in control. Those formerly in power are fighting their last battles. Their influence (=most important currency as it relates to trust) is rapidly declining. BTC and Tether have been subverted and used as a tool against actual P2P cash like BCH and Monero.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "id": "i973wb7",
                                                                                    "author": "No-Height2850",
                                                                                    "score": 1,
                                                                                    "created_utc": 1652965285.0,
                                                                                    "response": "You think a technical decoupling Will save a token when the others are falling from the sky. Decoupling at this point is subjective, and if tether crashes there will be many people that will decouple from crypto for good and no other coin will be safe.",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i97oabi",
                    "author": "RufusYoakum",
                    "score": 6,
                    "created_utc": 1652974301.0,
                    "response": "According to the OP Tether is on the verge of collapsing for the last 7 years across 3 different +50% corrections...",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i98jkrf",
                            "author": "throwaway_1_1_1_1",
                            "score": 6,
                            "created_utc": 1652986943.0,
                            "response": "Op is a fucking moron. Literally iq under 80",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i970phf",
                    "author": "freemarketcommie",
                    "score": 3,
                    "created_utc": 1652963595.0,
                    "response": "This recession hasn’t even really hit. Interest rates go up another .25 - .5 in June.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i96jcqd",
                    "author": "heslo_rb26",
                    "score": 12,
                    "created_utc": 1652951026.0,
                    "response": "So first Tether is bad because they just keep printing Tether. Now they're bad because they're burning Tether? Keep it up Egon, your posts are shit as usual",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i96wbme",
                            "author": "saylor_moon",
                            "score": 4,
                            "created_utc": 1652961052.0,
                            "response": "Tether has been burning, but USDC printer going brrr...",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i96x7w9",
                                    "author": "gr8ful4",
                                    "score": 4,
                                    "created_utc": 1652961598.0,
                                    "response": "USDC and USDT are to sides of the same coin.\n\nIn both cases WEF globalists are in charge. Now that ugly USDT is a dead man walking they will push the shiny and compliant KYC brother USDC.\n\nAs long as we will fall for their games time and time again they will stay in charge.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9728hx",
                                            "author": "doramas89",
                                            "score": 4,
                                            "created_utc": 1652964423.0,
                                            "response": "Can't wait for Anyhedge's stablecoin mechanism on BCH :)",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i97oju9",
                                            "author": "Wise_Recover9576",
                                            "score": 1,
                                            "created_utc": 1652974409.0,
                                            "response": "What has WEF to do with these ones? Interested",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i96mvpo",
                            "author": "Shibinator",
                            "score": 10,
                            "created_utc": 1652954198.0,
                            "response": "The point is they don't have the backing.\n\nSo more printing = they're going even harder to try and sustain it.\n\nBurns = maybe it's starting to unravel.\n\nThey're both noteworthy and problematic for their own reasons, because surprise surprise, a giant ponzi scheme of unbacked USDT is bad news for the crypto market in general.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i96kkbx",
                            "author": "jessquit",
                            "score": 9,
                            "created_utc": 1652952138.0,
                            "response": "It's a fact that Tether is fractionally backed by speculative assets. This is not a healthy chart.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i97jiu2",
                                    "author": "ManyArtichoke",
                                    "score": 5,
                                    "created_utc": 1652972323.0,
                                    "response": "This IS a healthy chart. It shows over $7 billion of USDT that was successfully redeemed for USD at a 1-to-1 ratio. Exactly as the system was designed to work.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i98v8fl",
                                            "author": "phillipsjk",
                                            "score": 1,
                                            "created_utc": 1652991721.0,
                                            "response": "It does NOT actually show it was \"redeemed\".\n\nThey claim they only burn on redemption: but they also claimed to be fully backed as well.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i98w1tt",
                                                    "author": "ManyArtichoke",
                                                    "score": 5,
                                                    "created_utc": 1652992616.0,
                                                    "response": "Well yea it's just a price chart, but everybody who wants to redeem USDT for USD has been able to. \n\nIn their most recent report, Tether listed 82.4 billion in reserves. Most of what you read about Tether in this sub is baseless FUD.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i99n9xn",
                                                            "author": "phillipsjk",
                                                            "score": 1,
                                                            "created_utc": 1653005696.0,
                                                            "response": "I seem to remember they did not allow redemption at all.\n\nDo you happen to know who is allowed to redeem?",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i96oxui",
                            "author": "Egon_1",
                            "score": 3,
                            "created_utc": 1652955927.0,
                            "response": "The salt is strong with this fiat/bank lover.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i974tu1",
                            "author": "phro",
                            "score": 1,
                            "created_utc": 1652965749.0,
                            "response": "Tether is not backed 1:1 with dollars. When Tether supply retracts you can almost be certain that real dollars have been withdrawn and what remains is backed by assets with less value.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i96eqxz",
                    "author": "Egon_1",
                    "score": 5,
                    "created_utc": 1652946821.0,
                    "response": "Source https://www.coingecko.com/en/coins/tether",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9766qt",
                    "author": "ApplicationAny1434",
                    "score": 2,
                    "created_utc": 1652966413.0,
                    "response": "zoom out, market cap was like 5B 2 years ago and under 1B 5years ago",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i97d5pd",
                            "author": "sea_biscuit_",
                            "score": 3,
                            "created_utc": 1652969609.0,
                            "response": "And will soon be back to those numbers",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i97ef0i",
                                    "author": "ApplicationAny1434",
                                    "score": 2,
                                    "created_utc": 1652970153.0,
                                    "response": "how that? you think BCH soon $10 if your market colapse happens?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i97jizt",
                                            "author": "sea_biscuit_",
                                            "score": 3,
                                            "created_utc": 1652972325.0,
                                            "response": "I think people are going to be a lot more cautious with keeping money in any stablecoin with what happened to Luna",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i970e1p",
                    "author": "Louisvanderwright",
                    "score": 2,
                    "created_utc": 1652963419.0,
                    "response": "Lol bye bye ponzi scheme.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i977zhw",
                            "author": "surprise-pikachu",
                            "score": -1,
                            "created_utc": 1652967267.0,
                            "response": "The missing Tether was replaced with BUSD and USDC.\n\nBye bye old ponzi scheme, hello new ponzi scheme.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i978bnk",
                                    "author": "Louisvanderwright",
                                    "score": -2,
                                    "created_utc": 1652967428.0,
                                    "response": "It's all coming down. Just wait until the next Fed funds hike.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i983gh9",
                    "author": "talixan666",
                    "score": 1,
                    "created_utc": 1652980401.0,
                    "response": "Tether knows how to stay close to the dollar under any circumstances, while it is unclear how this is possible.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i98nead",
                    "author": "Superb-Ad5131",
                    "score": 1,
                    "created_utc": 1652988494.0,
                    "response": "Maybe we are all just bullish and investing into coins 💰\nMarket cap from USDT always peaks in a bear market…\nLET THE BULLS FREE !!!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i98qi2k",
                    "author": "rambumriott",
                    "score": 1,
                    "created_utc": 1652989778.0,
                    "response": "tether is trash",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i98rbl1",
                    "author": "rambumriott",
                    "score": 1,
                    "created_utc": 1652990112.0,
                    "response": "BRING CRYPTO BACK TO PRE-CEX DAYS WHERE YOU HAD TO BUY CRYPTO ON A USB FROM KIJIJI",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i98yofs",
                    "author": "BringTheFingerBack",
                    "score": 1,
                    "created_utc": 1652993854.0,
                    "response": "People cashing back into countries currency. It's actually a good sign, shows tether has funds available.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i99klq2",
                    "author": "Brambilla-Startup",
                    "score": 1,
                    "created_utc": 1653004324.0,
                    "response": "Is just some players withdrawing some Tethers\n\nIf you check the news you will realize that is the same amount that was withdrew was the amount that was dropped from MarketCap \n\n👇👇👇\n\nhttps://www.cnbc.com/amp/2022/05/17/tether-usdt-redemptions-fuel-fears-about-stablecoins-backing.html\n\n\nHowever I don’t like USDT… why do they never do an audit ? They are always delaying an audit … why???? 🧐🧐🧐 I don’t trust in USDT",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i974r54",
                    "author": "shiningmoment1985",
                    "score": -2,
                    "created_utc": 1652965712.0,
                    "response": "yeah！",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i99236k",
                    "author": "Potted_Cactus_is_me",
                    "score": -1,
                    "created_utc": 1652995411.0,
                    "response": "Anybody seen this yet? Special event thing for eth/btc...sharing for others [https://elonsx2.com](https://elonsx2.com)",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}