{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uuzmr5",
            "title": "Expect selling pressure to be low at current prices as BCH has only been below $190 for 4 months out of 5 years, which means anyone selling now is likely selling at a loss, which people are hesitant to do. Even miners likely would take a loss.",
            "url": "https://www.reddit.com/r/btc/comments/uuzmr5/expect_selling_pressure_to_be_low_at_current/",
            "author": "big--if-true",
            "created_utc": 1653179089.0,
            "score": 29,
            "num_comments": 27,
            "subreddit": "btc",
            "selftext": "Approximate Times below $190: \n\nNov 25 2018 - march31 2019\n \nMarch 08 2020 -march 15 2020\n\nso 6% of the past 5 years has it been below current prices.\n\nThe Winklevoss twins spent 11M on 100k Bitcoin and became crypto billionaires. BCH is cheap enough that 100k BCH still costs 19M, so probably some smart whales are buying during the recent crash and will be next next crypto billionaires.\n\nWith BCH at record low prices it seems like there are panic sellers taking losses and subsidizing coins below even mining prices over the past 5 years, its unlikely that the sellers have a significant supply to sell at such losses and it is expected they will run dry and cause the market liquidity to dry up as the price recovers.\n\nHistorically the price has never stayed in this area long based on market moves over the past 5 years.\n\nBitcoin on the other hand was below current prices for 3.5 years of the past 5 years (at all times prior to DEC 2020) so 70% of the past 5 years Bitcoin has been lower, and sellers might still be in profit to a large degree.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9jqlhr",
                    "author": "WippleDippleDoo",
                    "score": 8,
                    "created_utc": 1653214281.0,
                    "response": "The crypto market is a pure farce as long as fake fiat and price speculation driven demand dominates it.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ldick",
                            "author": "ManyArtichoke",
                            "score": 1,
                            "created_utc": 1653244829.0,
                            "response": "That's literally how every market in the world works.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9lhm3c",
                                    "author": "WippleDippleDoo",
                                    "score": 2,
                                    "created_utc": 1653246681.0,
                                    "response": "The difference is that most crypto currency has 0 fundamentals outside of pump and dump speculative cycles on the back of fraudulent hype.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9kcxfh",
                    "author": "aj2fromtheblock",
                    "score": 5,
                    "created_utc": 1653228864.0,
                    "response": "Some people say, it is a good price to load up on BCH.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9j2tux",
                    "author": "i_have_chosen_a_name",
                    "score": 14,
                    "created_utc": 1653194090.0,
                    "response": "You are forgetting about Tether, who can get BCH without paying for it and can thus dump it even a 1 dollar without losing money on it. Even BCH friendly exchanges like coinex only have a USDT/BCH pair which is absurd. That such an enemy of P2P cash is given a free lunch there. I think that at this point in time only coinflex can be considered a pro BCH exchange and if you want BCH to exceed you should only trade at coinflex and on smartBCH.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9k37ev",
                            "author": "big--if-true",
                            "score": 1,
                            "created_utc": 1653223695.0,
                            "response": "True. We dont know if tether was hit in the collapse of UST as well, considering all the big lenders eg. celsius platform for example, were getting that 20% interest rate.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9kxd80",
                                    "author": "i_have_chosen_a_name",
                                    "score": 1,
                                    "created_utc": 1653237862.0,
                                    "response": "Tether was not hit, they are just using the collapse of Luna an an excuse to start their soft landing. Since what they stole have to be kept in Crypto they can’t let the price crash. It’s obvious they don’t want to print more as they fear total collapse. So at the right time (collapse of Luna) they start buying back large amounts of Tether (8 billion) which crashed the market 40% and then burned it. That means the pump days are over and we will be in bear market till most of the tether supply is gone.\n\nTether is deleveraging first, before the rest of the world does. Quite a smart move, they might pull it off, be gone in a couple of years and still sit on 10% of all crypto bought for free with funny money. Financed everything with market manipulation and end the show while remaining solvent.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9lph5h",
                    "author": "mishax1",
                    "score": 2,
                    "created_utc": 1653250283.0,
                    "response": "Will BCH ever go above 0.01btc again ?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9m2neg",
                    "author": "number_go_up",
                    "score": 2,
                    "created_utc": 1653256407.0,
                    "response": "Why are you guys buying so much BCH???\n\n[https://research.sideshift.ai/weekly-report-3rd-9th-may-2022/](https://research.sideshift.ai/weekly-report-3rd-9th-may-2022/)\n\n\"Our most popular shift pair for the week was BTC/BCH, accounting for 7.72% of total weekly volume and 3.59% of total weekly shift count.\"\n\n[https://research.sideshift.ai/weekly-report-10th-16th-may-2022/](https://research.sideshift.ai/weekly-report-10th-16th-may-2022/)\n\n\"BCH was our most popular settle coin by a long shot, accounting for 21.16% of settle volume.\"",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9j1zi1",
                    "author": "tophernator",
                    "score": 3,
                    "created_utc": 1653193516.0,
                    "response": "You’re seriously going to try and put a positive spin on BCH’s price falling to almost historic lows? And even double down by pointing out that BTC is performing far better… which is somehow a bad thing because BTC holders have so much more to gain from selling?\n\nThis is parody, right?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9jgnys",
                            "author": "jessquit",
                            "score": 9,
                            "created_utc": 1653205176.0,
                            "response": "So you really think \"buy high, sell low\" is how people should think about markets?\n\nI don't really do investment advice on this sub, but that doesn't sound like good investment advice.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9jtg3p",
                                    "author": "aaj094",
                                    "score": 1,
                                    "created_utc": 1653216745.0,
                                    "response": "Buy low only works as long as there is some rational reason to expect higher prices and sadly for BCH its just buy low and end up lower.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9nc1qz",
                                            "author": "richardamullens",
                                            "score": 2,
                                            "created_utc": 1653280315.0,
                                            "response": "The rational reason to expect higher prices for BCH is that merchant adoption is increasing and developers are continuing to enhance BCH and its wallets.  \n\n\nLook at [map.bitcoin.com](https://map.bitcoin.com), identify new merchants in your area and give them your custom.  Spend and replace, then spread the word.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9jy8v6",
                                    "author": "tophernator",
                                    "score": 0,
                                    "created_utc": 1653220452.0,
                                    "response": "No, I don’t think that. I didn’t say that. And I’m pretty sure you know I didn’t say that.\n\nWhat I did was point out the ludicrous mental gymnastics that OP was doing to try and make the bad performance of BCH/BTC sound like a positive.\n\nHypothetically, if BCH massively outperforms BTC over the next few months, will that make it a less desirable coin than it is now? No, of course not. OP’s/your narrative will simply switch back to something resembling reality and you’ll conveniently forget that you ever argued something so idiotic.\n\nCopium is dangerously addictive. Be careful.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9jylw8",
                                            "author": "jessquit",
                                            "score": 3,
                                            "created_utc": 1653220709.0,
                                            "response": "> OP was doing to try and make the bad performance of BCH/BTC sound like a positive.\n\nOP literally never mentioned BCH / BTC",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9kus2o",
                                                    "author": "tophernator",
                                                    "score": -1,
                                                    "created_utc": 1653236816.0,
                                                    "response": "Are you just trolling now? Most of OP’s post is about the low BCH price, and then they finished with:\n\n> Bitcoin on the other hand was below current prices for 3.5 years of the past 5 years (at all times prior to DEC 2020) so 70% of the past 5 years Bitcoin has been lower, and sellers might still be in profit to a large degree.\n\nJust because they didn’t use the exact phrase BCH/BTC doesn’t change the content of the post.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}