{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uxkyq8",
            "title": "Typical laser eye doesn’t understand capitalism or Bitcoin.",
            "url": "https://i.redd.it/sthb9u0pdn191.jpg",
            "author": "Ancapworld",
            "created_utc": 1653495570.0,
            "score": 68,
            "num_comments": 95,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9zvsln",
                    "author": "Ok_Aerie3546",
                    "score": 11,
                    "created_utc": 1653519150.0,
                    "response": "Hasanabi's laser eyes arent the bitcoin maxi laser eyes.\n\nThey are just the laser eyes that triggered people are shown with. The original laser eyes if I may.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ysg8s",
                    "author": "MadsMikkelsenisGryFx",
                    "score": 59,
                    "created_utc": 1653502759.0,
                    "response": "What does this have to do with bitcoin cash again.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia00l1a",
                            "author": "FreshSnowSteps",
                            "score": 29,
                            "created_utc": 1653521397.0,
                            "response": "I have the exact same question. Seems like Op is projecting their own politcal views into the situation and bringing it here",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia0hvjs",
                                    "author": "thundergodsnake",
                                    "score": 11,
                                    "created_utc": 1653529470.0,
                                    "response": "Agreed",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9yyqkm",
                            "author": "BWWFC",
                            "score": 3,
                            "created_utc": 1653505228.0,
                            "response": "lol, had to double check, thought i was browsing the front page",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9z4b96",
                            "author": "54545455455555",
                            "score": -13,
                            "created_utc": 1653507482.0,
                            "response": "This is a sub for Bitcoin discussion. Please read the FAQ section, or just shut up, whatever.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9yeo75",
                    "author": "CryptoAnarchyst",
                    "score": 25,
                    "created_utc": 1653497381.0,
                    "response": "You're really not saying what you think you're saying bud... you really don't understand things as well as you do.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9zigd9",
                            "author": "TheWorldofGood",
                            "score": 3,
                            "created_utc": 1653513262.0,
                            "response": "So he doesn’t know what he’s talking about and he doesn’t know what he wants to talk about either.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9zikhe",
                                    "author": "CryptoAnarchyst",
                                    "score": 4,
                                    "created_utc": 1653513311.0,
                                    "response": "Essentially...",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9yf44d",
                    "author": "-ism-isa-con",
                    "score": 18,
                    "created_utc": 1653497551.0,
                    "response": "I guess I'm not special enough to have laser eyes.  But, even I know that when market control is centralized, and not by consumer choice, that is something else, not capitalism.  Our markets are clearly controlled.  We can all see this when guidelines are announced by bureaucrats -- guidelines which disrupt merchant-customer relationships -- and all the players in a given industry fall in line.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9zllkp",
                            "author": "freddy_rumsen",
                            "score": 6,
                            "created_utc": 1653514613.0,
                            "response": "Consolidation of firms to increase profits is a central tenet of capitalism what the fuck are you even saying",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia015wd",
                                    "author": "-ism-isa-con",
                                    "score": 9,
                                    "created_utc": 1653521674.0,
                                    "response": "Incorrect.  Competition is the central tenet of capitalism.  Only competition can keep firms honest.  With big government, firms can partner with government to prevent competition.  That is not capitalism.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia08b3k",
                                            "author": "Collaborationeur",
                                            "score": 6,
                                            "created_utc": 1653525052.0,
                                            "response": "Call me jaded, but from where I sit it sure seems regulatory capture is the central tenet of capitalism.\n\nThe word competition is much bandied about by starry-eyed utopians but doesn't reflect what's going on under our nose.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia09w5x",
                                                    "author": "VideoGameDana",
                                                    "score": 3,
                                                    "created_utc": 1653525800.0,
                                                    "response": "This.\n\nThere's what Capitalism is supposed to be, and what it has become in reality. The same can be said about Communism. On paper it looks amazing. In practice it's not so great.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "ia0icut",
                                                            "author": "Azraelalpha",
                                                            "score": 2,
                                                            "created_utc": 1653529700.0,
                                                            "response": "Then it's not capitalism; it's Cronyism.",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "ia0pvua",
                                                            "author": "tbjfi",
                                                            "score": -5,
                                                            "created_utc": 1653533240.0,
                                                            "response": "Capitalism (and socialism) can exist in an environment where there isn't a powerful government. The powerful government is the problem, not the economic system.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "ia1di4g",
                                                    "author": "-ism-isa-con",
                                                    "score": 2,
                                                    "created_utc": 1653548660.0,
                                                    "response": "I would not call you jaded nor myself a starry-eyed utopian.  Consider whether regulatory capture is a central tenet in the following scenarios:\n\n- When you are trading mechanical services for your neighbor's eggs.\n- When a transport or communications service facilitates your commerce with persons farther away than your neighbor.\n- After a territorial monopoly forms and uses the threat of undesirable consequences to impose its will.\n\nIn which of these scenarios can regulatory capture become an ongoing feature?  I say in the third scenario, after the territorial monopoly's picked winners in currency, communications, utilities, postal services, insurance, banking, etc, use business models which depend upon the undesirable consequences.  So in my view governments covering vast territories make regulatory capture possible.  Also, we are using the term capitalism, but I think it is a misleading term.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "ia11wl7",
                                            "author": "freddy_rumsen",
                                            "score": 1,
                                            "created_utc": 1653540008.0,
                                            "response": "Completely untrue. As firms grow and try to continue Lt increase profits they will consolidate with other firms to increase their productive capacity, acquire newer technologies, and make themselves more efficient. That is an objective reality of capitalism that you can observe.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia1e6l3",
                                                    "author": "-ism-isa-con",
                                                    "score": 2,
                                                    "created_utc": 1653549224.0,
                                                    "response": "I don't know that consolidation or efficiency are necessarily bad.  I think negative consequences are what discourage new competitors with better ideas.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "ia1ejuv",
                                                            "author": "freddy_rumsen",
                                                            "score": 1,
                                                            "created_utc": 1653549539.0,
                                                            "response": "Lol look at the goal posts moving into the distance",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "ia1o7f4",
                                                                    "author": "-ism-isa-con",
                                                                    "score": 1,
                                                                    "created_utc": 1653558141.0,
                                                                    "response": "Admittedly when consolidation means higher prices or declining service, that's bad for me.  I'm just not sure it always does.  And, even worse is when regulators prevent a more innovative or more efficient solution.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "ia1p6af",
                                                                            "author": "freddy_rumsen",
                                                                            "score": 2,
                                                                            "created_utc": 1653558994.0,
                                                                            "response": "Ok but it doesn't matter if you think it's good or bad. Consolidation is part of capitalism, when you said it wasn't.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "ia345vt",
                                                                                    "author": "-ism-isa-con",
                                                                                    "score": 0,
                                                                                    "created_utc": 1653584219.0,
                                                                                    "response": "Consolidation is a fact of life, and it isn't necessarily a bad thing.  We all consolidate.  It isn't the gotcha you think it is.  The problem is not consolidation imo, it's over regulation and protectionism.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "ia44d7p",
                                                                                            "author": "freddy_rumsen",
                                                                                            "score": 1,
                                                                                            "created_utc": 1653599106.0,
                                                                                            "response": "It wasn't supposed to be a gotcha. You said one thing then immediately went back on it, because you were wrong. Which was my initial point.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "id": "ia45luq",
                                                                            "author": "jessquit",
                                                                            "score": 1,
                                                                            "created_utc": 1653599648.0,
                                                                            "response": ">  And, even worse is when regulators prevent a more innovative or more efficient solution.\n\nAnd even better is when regulators encourage a more level playing field that encourages new entrants and discourages predatory practices and monopolization.\n\nThe opposite of bad government isn't no government.\n\nIMO",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "ia4453d",
                                            "author": "jessquit",
                                            "score": 1,
                                            "created_utc": 1653599010.0,
                                            "response": "> Competition is the central tenet of capitalism.  \n\nThe central tenet of capitalism is that the means of production are owned privately and for profit. Nothing more nothing less. \"Competition\" is a buzzword. Capitalists don't want competitors and smart business strategy seeks to destabilize, undermine, or acquire competition. Monopoly is profitable.\n\nSome industries do not benefit greatly from mass economies of scale, or are not impacted by network effects. These usually remain decentralized without regulation. Other industries benefit from centralizing effects like mass economies of scale or network effects. These centralize strongly without regulation.\n\nThe idea that unfettered competition always leads to a more decentralized and equatible business environment is a misunderstanding.  For example when radio deregulated in the 1990s the number of players in the market dropped from thousands to a dozen or so. In some markets one or two companies own every station on the dial.\n\nAdam Smith warned about the problems of market failures, and economics (past the 1st year survey classes) teaches us about the many problems of imperfect markets, but some people refuse to accept that markets aren't always perfect, and that leads to deep misunderstandings and bad policy.\n\nCapitalism can be a tool to serve society, or society can be a tool to serve capitalism.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9z4t12",
                            "author": "54545455455555",
                            "score": -3,
                            "created_utc": 1653507678.0,
                            "response": "Exactly. Under capitalism over time production will concentrate in the hands of the most well-off and they will use that power to further consolidate by making more rules for outsiders.\n\nFunny, it's kind of exactly what Bitcoin Core has been doing when they limit the block size and hinder development.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia0q2y5",
                                    "author": "tbjfi",
                                    "score": 1,
                                    "created_utc": 1653533338.0,
                                    "response": "Capitalists cannot make rules without a strong authoritarian government. Get rid of the government and you allow competition to bloom",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia0vx44",
                                            "author": "jeffroddit",
                                            "score": -1,
                                            "created_utc": 1653536362.0,
                                            "response": "Capitalists who control enough capital and/or enough force can make all the rules or do anything else they want without a strong authoritarian government.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia0xe4e",
                                                    "author": "tbjfi",
                                                    "score": 1,
                                                    "created_utc": 1653537210.0,
                                                    "response": "disagree. but i guess you are saying a totalitarian government-esque entity will rise up to fill any void where there isnt already a totalitarian government? still doubtful as long as there is competition. how could an entity remain competitive while spending resources waging a war against all other people?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "ia129uj",
                                                            "author": "jeffroddit",
                                                            "score": 2,
                                                            "created_utc": 1653540246.0,
                                                            "response": "They don't need to wage war against all other people.  Just the ones with potentially competitive capital or revolutionaries.  If capital is concentrated enough you needn't even wage war on competitive capital if you can coordinate multiple monopolies.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "ia0oisn",
                            "author": "futz_",
                            "score": 1,
                            "created_utc": 1653532602.0,
                            "response": "There's good and bad to capitalism just like every system. Humans are corrupt plain and simple.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia0f7hq",
                    "author": "yeaforbes",
                    "score": 14,
                    "created_utc": 1653528248.0,
                    "response": "Damn Hasan seems like he hit the nail on the head here, not sure what OP is on about.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9yry7z",
                    "author": "Apart_Number_2792",
                    "score": 5,
                    "created_utc": 1653502562.0,
                    "response": "Sounds more like a problem with monopolies. Free market capitalism was not meant to have three companies dominate an entire industry. There must be legislation promoting more competition.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9zb9uf",
                            "author": "frozengrandmatetris",
                            "score": 7,
                            "created_utc": 1653510280.0,
                            "response": "they dominate the industry because of legislation. what stops me from importing Mexican insulin or German baby formula? gee, I don't know.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9zc0gc",
                            "author": "Accomplished-Video71",
                            "score": 7,
                            "created_utc": 1653510579.0,
                            "response": "Or just LESS legislation stifling competition.\n\nCorporations are able to run amok BECAUSE they control policy. Who do you think wrote the legislation saying EU formula is illegal? US formula manufacturers.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia465ti",
                                    "author": "jessquit",
                                    "score": 1,
                                    "created_utc": 1653599894.0,
                                    "response": "You may not realize it but I think you two agree.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9ysfmw",
                    "author": "Sugarbird676",
                    "score": 7,
                    "created_utc": 1653502753.0,
                    "response": "There’s an unhealthy tendency to blame market failures on capitalism instead of corruption.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9yv90c",
                            "author": "mc_kingjames",
                            "score": 5,
                            "created_utc": 1653503849.0,
                            "response": "same thing",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9zwedt",
                    "author": "3pinephrine",
                    "score": 4,
                    "created_utc": 1653519433.0,
                    "response": "Import bans are sooo free market. Dumb ass",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9zin4b",
                    "author": "freddy_rumsen",
                    "score": 2,
                    "created_utc": 1653513343.0,
                    "response": "OP is so fucking dumb he cannot meaningfully articulate why this is a misunderstanding",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9zfxh2",
                    "author": "freddy_rumsen",
                    "score": 2,
                    "created_utc": 1653512202.0,
                    "response": "This is a very accurate definition of capitalism. You look dumb for saying this",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9z1mwb",
                    "author": "BringTheFingerBack",
                    "score": -1,
                    "created_utc": 1653506394.0,
                    "response": "With all this BTC bashing on this sub lately we are starting to look like a bunch of incels that didn't get invited to prom.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ysd22",
                    "author": "SmashTR",
                    "score": -2,
                    "created_utc": 1653502725.0,
                    "response": "Leftist bitcoin maxis? what's next?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ybvyi",
                    "author": "DizzleMcblizzle",
                    "score": -7,
                    "created_utc": 1653496301.0,
                    "response": "He is posting this from a phone or computer that was made by capitalism.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ywagl",
                            "author": "November_One",
                            "score": 2,
                            "created_utc": 1653504259.0,
                            "response": "Yes dont complain/critisize anything you are even slightly involved in /s",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9yek75",
                            "author": "CryptoAnarchyst",
                            "score": -2,
                            "created_utc": 1653497338.0,
                            "response": "Actually, WRONG... the phone was made in China... a vastly socialist country... sooooooooo... Yeah.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9yktgk",
                                    "author": "weepingswords",
                                    "score": 7,
                                    "created_utc": 1653499762.0,
                                    "response": "When China was socialist, its population was starving to death. It makes phones thanks to turning capitalist since the 80s.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia24e01",
                                            "author": "LaGardie",
                                            "score": 1,
                                            "created_utc": 1653569106.0,
                                            "response": "There are only five small special economic zones in China that follow free market economy and rest uses planned economy.  Saying China has turned capitalist is not really correct way to describe China's economic policies as a whole.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia3pxtj",
                                                    "author": "weepingswords",
                                                    "score": 1,
                                                    "created_utc": 1653593036.0,
                                                    "response": "Pls keep lying, commie shill. https://twitter.com/RodZeidan/status/1259941623951220738?s=20",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i9zycnr",
                                    "author": "AveaLove",
                                    "score": 3,
                                    "created_utc": 1653520349.0,
                                    "response": "What are you talking about? China is state capitalist, not socialist. The Wikipedia page for state capitalism calls out modern China and Singapore by name as an example of it. It's literally in contrast to socialism.\n\nhttps://en.m.wikipedia.org/wiki/State_capitalism",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9zyqx7",
                                            "author": "CryptoAnarchyst",
                                            "score": 1,
                                            "created_utc": 1653520534.0,
                                            "response": "Right, that's why they all have to belong to the Chinese National Communist Party... Because they are capitalist. \n\nYou do know that Communism and Capitalism are on the opposite sides of the spectrum... Right? \n\nUse your brain man, don't believe everything you read on Wikipedia.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9zyxu9",
                                                    "author": "AveaLove",
                                                    "score": 2,
                                                    "created_utc": 1653520626.0,
                                                    "response": ".........\n\nDo you really believe China is Communist? Please tell me what workers own the means of production in China?\n\nNazi literally uses the word socialist in it's name, YET THEY ARE FACISTS, NOT SOCIALISTS. What a government wants to call itself doesn't mean jack shit about what it is.\n\nNorth Korea calls itself a \"democratic republic\" lmfao. Yeah, okay.\n\nJust because the CCP uses the word communist in their name, doesn't make them communist.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "ia02c99",
                                                            "author": "CryptoAnarchyst",
                                                            "score": 0,
                                                            "created_utc": 1653522232.0,
                                                            "response": "Every time I think that this country couldn't get any more idiotic, someone proves me wrong... good job for showing me how ignorant and uneducated this country is.\n\nFirst, do you understand the difference between communism and socialism? Socialism talks about the equality of all people and the worker owning the product, and the facility, in which they work... Communism takes that and changes from the \"worker\" to the \"government\"... Chinese infrastructure is ALL owned by the government. Chinese economy is FULLY controlled by the government. The people are TOLD by the government what education they will have and what jobs they will work in. In China EVERYONE serves at the pleasure of the Communist Party. Just ask Jack Ma from Alibaba and how ANT fared after he opened his mouth a bit too much.\n\nI lived nearly half my life in a Communist country, but please you lecture me on what Communism is... Please... please show me how I don't know anything.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "ia02xcw",
                                                                    "author": "AveaLove",
                                                                    "score": 2,
                                                                    "created_utc": 1653522514.0,
                                                                    "response": "\"Chinese infrastructure is ALL owned by the government. Chinese economy is FULLY controlled by the government.\"\n\nThat's called state capitalism. The GOVERNMENT (also known as the State) controls it, NOT THE WORKERS.\n\nNothing about modern China is Communist even though it was born out of Communism.\n\nAlso, notice the difference in how you attempt to attack my intelligence and education (of which you know nothing about), but I don't do that to you? Stop doing that, it's not helpful to having a conversation/discussion.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "ia05i40",
                                                                            "author": "CryptoAnarchyst",
                                                                            "score": 1,
                                                                            "created_utc": 1653523732.0,
                                                                            "response": "The fact you don't understand the difference between socialism and communism is all I need to judge your knowledge and education on this subject.\n\nI've spent 16 years of my life in a COMMUNIST country... Living, working there... But again, please educate me from your arm chair and Wikipedia pages.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "ia05phz",
                                                                                    "author": "AveaLove",
                                                                                    "score": 3,
                                                                                    "created_utc": 1653523829.0,
                                                                                    "response": "You've shown that you're incapable of holding a conversation like a normal human being. You seem to believe that when you don't understand something, or when you disagree with someone, it means that that other person is unintelligent or uneducated, and then you feel an overwhelming desire to attempt to attack them over the opinions you've incorrectly and unjustly formed, and you believe that that behavior is acceptable and okay, which is just wrong. Try some introspection. Have a good day.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "ia070hl",
                                                                                            "author": "CryptoAnarchyst",
                                                                                            "score": 0,
                                                                                            "created_utc": 1653524444.0,
                                                                                            "response": "Right, I don't think that ignorance really deserves much... All you've done is sent a Wikipedia link and tried to make an uneducated assumption about what communism is... Without really knowing it... And you've tried to argue with someone who actually lived it.\n\nBy your absurd definition, the Soviet Union was a capitalistic democracy... And that's really not how it works",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "id": "ia1608g",
                                                                                    "author": "jessquit",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653542827.0,
                                                                                    "response": ">The fact you don't understand the difference between socialism and communism \n\nThis you bro?\n\nhttps://www.reddit.com/r/btc/comments/uxkyq8/typical_laser_eye_doesnt_understand_capitalism_or/i9yek75\n\n> the phone was made in China... a vastly socialist country...\n\n/u/IAmVerySmart",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "id": "ia15xhf",
                                                                            "author": "jessquit",
                                                                            "score": 1,
                                                                            "created_utc": 1653542772.0,
                                                                            "response": "He's GASLIGHTING. Read up the thread. He started by calling China socialist now he's saying the exact opposite.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        },
                                                                        {
                                                                            "id": "ia25irw",
                                                                            "author": "LaGardie",
                                                                            "score": 1,
                                                                            "created_utc": 1653569695.0,
                                                                            "response": "If the profits generated by the state companies are used to fund social programs, doesn't that make it non-profit organization rather than a capitalist one?",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "ia15v88",
                                                    "author": "jessquit",
                                                    "score": 1,
                                                    "created_utc": 1653542728.0,
                                                    "response": ">Right, that's why they all have to belong to the Chinese National Communist Party... \n\nYou said they were socialist not communist.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "ia15th7",
                                            "author": "jessquit",
                                            "score": 1,
                                            "created_utc": 1653542693.0,
                                            "response": "You're arguing with a gaslighter. Same person is arguing with me on another thread about logarithms and can't manage anything more than obvious gaslighting and insults. You're wasting your time with that one.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9yet7h",
                                    "author": "DizzleMcblizzle",
                                    "score": -5,
                                    "created_utc": 1653497434.0,
                                    "response": "You bring up a valid point, not made by capitalism but invented by capitalism. He was probably driving a Starbucks soy latte also, capitalism.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9yfb81",
                                            "author": "nightswimsofficial",
                                            "score": 3,
                                            "created_utc": 1653497628.0,
                                            "response": "How do you drive a latte?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9yg8jl",
                                                    "author": "voluntary_joe",
                                                    "score": 1,
                                                    "created_utc": 1653497984.0,
                                                    "response": "If you think driving a latte is tough, you should try an espresso",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9ynptr",
                                                            "author": "LovelyDayHere",
                                                            "score": 2,
                                                            "created_utc": 1653500896.0,
                                                            "response": "I just avoid the Americano drivers",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i9yqlr7",
                                                    "author": "Late_To_Parties",
                                                    "score": 1,
                                                    "created_utc": 1653502027.0,
                                                    "response": "Its easy to drive a latte if you have enough money for gas",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i9yre25",
                                                    "author": "NarfMann",
                                                    "score": 1,
                                                    "created_utc": 1653502338.0,
                                                    "response": "In communism, latte drives you.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i9yftoq",
                                                    "author": "CryptoAnarchyst",
                                                    "score": -2,
                                                    "created_utc": 1653497826.0,
                                                    "response": "It's just capitalism bruh... Don't question him",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9zi4aa",
                    "author": "Indianajones1989",
                    "score": -3,
                    "created_utc": 1653513117.0,
                    "response": "Socialism would mean 1 company making it lol. Hope he doesn't find out about that.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia197hs",
                    "author": "b000bytrap",
                    "score": 0,
                    "created_utc": 1653545221.0,
                    "response": "The tweet has nothing to do with Bitcoin or Bitcoin cash. Typical ancap tantrum doesn’t understand his audience or his subject matter",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9zaf16",
                    "author": "g0mdr0ps",
                    "score": -4,
                    "created_utc": 1653509938.0,
                    "response": "R-real capitalism has never been tried!! Cope.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9zc4ku",
                    "author": "StephenJooba",
                    "score": -5,
                    "created_utc": 1653510625.0,
                    "response": "Hasan is a cuck",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia2roxd",
                    "author": "ReverseMoses",
                    "score": 1,
                    "created_utc": 1653579310.0,
                    "response": "It seems OP doesn’t get the point.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia0hpuz",
                    "author": "thundergodsnake",
                    "score": -3,
                    "created_utc": 1653529399.0,
                    "response": "This guy is a total moron.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia04jc7",
                    "author": "TheDondo96",
                    "score": -3,
                    "created_utc": 1653523281.0,
                    "response": "Women only have one important job they’re literally born with the tools but still fail🤦🏻‍♂️",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia0oj6v",
                    "author": "Puzzled_Raccoon8169",
                    "score": -4,
                    "created_utc": 1653532607.0,
                    "response": "What happened to all the uproar about women breastfeeding in public?? Why we need all this manufactured formula when we done got schooled that it’s fine and dandy to whip ur boobs out in public and nobody is allowed to look at you funny? (Or was that all a bunch of bullshit for attention and they bottlefed all along too?) And all those special rooms and extra breaks to express breast milk supposedly?",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uxkt5c",
            "title": "First telecommunications merchant that accepts #BitcoinCash in #Venezuela and is located in Guanare - Portuguesa!",
            "url": "https://www.reddit.com/r/btc/comments/uxkt5c/first_telecommunications_merchant_that_accepts/",
            "author": "Joseignacioarajo",
            "created_utc": 1653495138.0,
            "score": 24,
            "num_comments": 15,
            "subreddit": "btc",
            "selftext": "&#x200B;\n\nhttps://preview.redd.it/4wg8iwsfcn191.jpg?width=1280&format=pjpg&auto=webp&s=6859c1f646fa767ca03a974ff99283cb4154d9f3\n\nhttps://preview.redd.it/gk43xqcfcn191.jpg?width=1280&format=pjpg&auto=webp&s=6f055e0d1165d45fa02260e12175be4d882d4c98\n\nhttps://preview.redd.it/xz35k09gcn191.jpg?width=1280&format=pjpg&auto=webp&s=ee9c1a60b22f2d72706bea54c382e26344b76cc1",
            "stickied": false,
            "comments": [
                {
                    "id": "i9ylv6k",
                    "author": "jessquit",
                    "score": 2,
                    "created_utc": 1653500174.0,
                    "response": "Do they use a payment processor or are they accepting BCH directly?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia0xprv",
                            "author": "Joseignacioarajo",
                            "score": 2,
                            "created_utc": 1653537404.0,
                            "response": "They accept BCH directly, greetings from Venezuela.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "uxkpqx",
            "title": "Paytaca campaign has been funded!",
            "url": "https://www.reddit.com/r/btc/comments/uxkpqx/paytaca_campaign_has_been_funded/",
            "author": "zennlV",
            "created_utc": 1653494867.0,
            "score": 29,
            "num_comments": 19,
            "subreddit": "btc",
            "selftext": "Several contributions from the Bitcoin Cash community, including the main DEX of SmartBCH Mistswap and their dev.\n\nThis community it's a very special one from the other L2's IMO, all of them are working hard to see different projects evolving and expanding the ecosystem, we still have a lot of passion and faith in what BCH can do to change the crypto path.\n\nSource: [https://twitter.com/\\_paytaca\\_/status/1528977626727346176](https://twitter.com/_paytaca_/status/1528977626727346176)",
            "stickied": false,
            "comments": [
                {
                    "id": "i9y9rzo",
                    "author": "sheev2001",
                    "score": 5,
                    "created_utc": 1653495487.0,
                    "response": "It's great to see Mist supporting other projects. Paytaca looks promising tho.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9yxgfa",
                            "author": "French_Francis",
                            "score": 2,
                            "created_utc": 1653504717.0,
                            "response": "Ikr? mistswap's leadership in smartbch is unquestionable imo",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9z62t9",
                    "author": "Ok_Possession2646",
                    "score": 2,
                    "created_utc": 1653508184.0,
                    "response": "Kudos to those working hard behind the scenes on smartBCH to improve it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9yi058",
                    "author": "genevalles",
                    "score": 1,
                    "created_utc": 1653498674.0,
                    "response": "Mistswap's spirit and intuition for spotting good projects will take the SmartBCH ecosystem so far",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9z4z0u",
                    "author": "54545455455555",
                    "score": 1,
                    "created_utc": 1653507745.0,
                    "response": "Great! Thaks and good luck!!!",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}