{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uu82ff",
            "title": "George Donnelly posted recently asking to come back to Dash, and blocked me so I couldn't reply like a coward, when I listed his history of abusive behavior. This is my response to his last post explaning why he should remain kicked out of the community",
            "url": "/r/DashUncensored/comments/uu80oj/george_donnelly_posted_recently_and_blocked_me_so/",
            "author": "thethrowaccount21",
            "created_utc": 1653081725.0,
            "score": 8,
            "num_comments": 30,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9dv7qd",
                    "author": "MobTwo",
                    "score": 10,
                    "created_utc": 1653085932.0,
                    "response": "George is an extremely argumentative guy. I once supported him and that turns out to be a mistake. Any criticism he takes it so personally. I'm just glad he moved on to other stuff.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9dwmn6",
                            "author": "thethrowaccount21",
                            "score": 6,
                            "created_utc": 1653086622.0,
                            "response": "Very correct. Unfortunately he's back to try and grift from the Dash community again. [Even though I posted reams of evidence from both the Dash and BCH community calling him out for toxic behavior, lies and other bad-acting.](https://www.reddit.com/r/DashUncensored/comments/u796yq/now_that_dash_mnos_have_finally_smartly_canceled/)",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9e0hsk",
                                    "author": "MobTwo",
                                    "score": 6,
                                    "created_utc": 1653088543.0,
                                    "response": "By the way, this is gold. https://twitter.com/GeorgeDonnelly/status/1524047144361111553",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9dwqlk",
                                    "author": "MobTwo",
                                    "score": 2,
                                    "created_utc": 1653086677.0,
                                    "response": "> Unfortunately he's back to try and grift from the Dash community again\n\nlol, good luck to Dash! =D",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9eyhtt",
                                            "author": "coingun",
                                            "score": 1,
                                            "created_utc": 1653106976.0,
                                            "response": "👀👀👀",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9en0le",
                    "author": "hero462",
                    "score": 3,
                    "created_utc": 1653100411.0,
                    "response": "It does make me scratch my head that he left BCH because of disagreements with a few.  Either you believe in BCH or you don't.  I do feel like you went overboard with him.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9eqxth",
                            "author": "thethrowaccount21",
                            "score": 0,
                            "created_utc": 1653102529.0,
                            "response": "Yes, indeed that is curious behavior if he really believes what he says. Doubly so for his first go-round with Dash. Why burn bridges and attack the community if you really were sincere? \n\nI've been banned from the main Dash subreddit for nearly 4 years for calling a known liar attempting to infiltrate our community a liar. Still I believe in Dash because I know it works. Your comment is spot on.\n\nWhere do you think I went overboard?\n\nThank you for your input.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9dnh3i",
                    "author": "fiendishcrypro",
                    "score": 8,
                    "created_utc": 1653082274.0,
                    "response": "Best thing to do with toxic egotistical people? \n\nIgnore them. Walk away. \n\nDon't let them stay rent free in your mind.✌️",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9doq5z",
                            "author": "thethrowaccount21",
                            "score": 6,
                            "created_utc": 1653082854.0,
                            "response": "No, I don't think so. That actually emboldens them. They already know that they're lying so if you remain silent they basically win as you concede the battlefield to them that way. Its much better to expose them for the charlatans that they are so they have to slink back into the sewers whence they came from.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9dwkk7",
                                    "author": "FreeFactoid",
                                    "score": 0,
                                    "created_utc": 1653086594.0,
                                    "response": "Proverbs 10:10 ERV\nIf you fail to speak the truth, trouble will follow. If you speak openly, peace will come.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9dyx3b",
                    "author": "Br0kenRabbitTV",
                    "score": 2,
                    "created_utc": 1653087755.0,
                    "response": "Off topic but what is the official DASH subreddit?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9dzyu3",
                            "author": "thethrowaccount21",
                            "score": 1,
                            "created_utc": 1653088276.0,
                            "response": "That would be r/dashpay. I can't post there having been banned by similar behavior from the mods there as Donnelly.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9e0u4u",
                                    "author": "Br0kenRabbitTV",
                                    "score": 2,
                                    "created_utc": 1653088722.0,
                                    "response": "Thanks, just wanted to look into it a bit more, I blindly added it as a payment option somewhere as it was one of a selection of coins in a plugin I'm using for a new project.\n\nIs there any reason I should avoid it?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9e1djw",
                                            "author": "thethrowaccount21",
                                            "score": 0,
                                            "created_utc": 1653088993.0,
                                            "response": "Dash? No, you should definitely keep it as a payment option. Dash is the only proof of work cryptocurrency that has instant transactions (by default at that), optional coinjoin at the protocol level, the oldest and most successful DAO in the world (running since 2015), the largest adoption among cryptocurrencies being accepted in more than 155,000 retailers worldwide (BTC, in comparison is only accepted at roughly 25,000 retailers), as well as having a large community in Venezuela, Latin America, Asia, the Carribbean and other crypto hotspots the world over. You can't go wrong with Dash Digital Cash, imo.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9e1o7n",
                                                    "author": "Br0kenRabbitTV",
                                                    "score": 4,
                                                    "created_utc": 1653089142.0,
                                                    "response": "Cool, thanks.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9dweln",
                    "author": "richardamullens",
                    "score": 1,
                    "created_utc": 1653086513.0,
                    "response": "Leave George alone.  His heart was in the right place - but he made an error of judgement, which anyone can do - and those who hounded him drove a useful person out of our community and in so doing damaged BCH.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9dyo2m",
                            "author": "thethrowaccount21",
                            "score": 2,
                            "created_utc": 1653087634.0,
                            "response": "No, I won't. If you read the thread, you can see his heart was DEFINITELY NOT in the right place. He stands accused by nearly a dozen people in both the Dash and BCH community of various deceptive practices which clearly shows malice for cryptocurrencies like Dash and BCH. He promised you guys 1 million new BCH users by Dec 2021 with his flipstarter. How can you just let him off the hook for that? Unlike Dash's treasury, BCH flipstarters are paid out of the pockets of community members, so he basically stole from all of you. That's the real damage to the community. How can you overlook that??",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9e21kn",
                                    "author": "richardamullens",
                                    "score": 1,
                                    "created_utc": 1653089330.0,
                                    "response": "I have read your posts and you come across as argumentative and extremely toxic.  My opinion from what I have read is that you will put off people in whatever community you  inhabit.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9e2jxs",
                                            "author": "thethrowaccount21",
                                            "score": 7,
                                            "created_utc": 1653089596.0,
                                            "response": "Well, that's only half true. Btw, why didn't you answer my questions? That's not very nice and honestly pretty dishonest. \n\nI am definitely \"argumentative\" as argumentation is the only way to find out the truth verbally. If your arguments are better than mine you will win and I will concede, the opposite goes for me if mine are better. But I'm definitely not toxic. If anything, I'm patient to a fault. I waited for 8 months while watching George gaslight and lie to and about the Dash community, this was back in 2019. \n\nI even commended George for his \"field report\" before his toxic behavior came to light. What's more, I am actually quite popular in many communities with many of my posts being highly upvoted. I've posted original research over the years that has been lauded in many communities and by several members of those communities, so you'd be wrong on that account. You're welcome to point out to any episodes of \"toxicity\" of mine that your review has come across and we can discuss the merits of your claims. \n\nThanks",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9e477p",
                                                    "author": "richardamullens",
                                                    "score": 1,
                                                    "created_utc": 1653090442.0,
                                                    "response": "I am not obliged to answer any of your questions.  You asked \"How can you overlook that?\"  I already said that I believe that George made an honest mistake - and yet you accuse him of stealing from the community.\n\nYou have posted your bile to\n\nDashUncensored  \nCrypto\\_Currency\\_News  \ncrypt0snews  \nBitcoincash  \nand btc.  \n\n\nYou're not a nice person - what you are doing is character assassination.  In my eyes that makes you toxic.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9e7qrn",
                                                            "author": "thethrowaccount21",
                                                            "score": 7,
                                                            "created_utc": 1653092305.0,
                                                            "response": "> \n> \n> You're not a nice person - what you are doing is character assassination. In my eyes that makes you toxic.\n\nAlso, this is you replying to u/memoryDealers 27 days ago:\n\n>[–]richardamullens 1 point 27 days ago \n\n>That's another of your lies.\nOn the day of the fork the price of BCH varied between about €100 - €1000.\n\n>On the next few days between 200 & 800. It wasn't until January 13'th 2018 that it spiked briefly at €4000. The information comes from the Kraken exchange of the price range of BCH once it started trading on August 1'st 2017 - the day of the fork.\n\n>Very little of what you say stands up to any scrutiny. You're either a liar or parroting false information that you have been told. I have very little respect for you.\n\nAlso,\n\n>[–]richardamullens 1 point 1 month ago \n\n>I'm beginning to find you boring.\n\n>I suggest that you stop posting on rbtc lest someone accuses you of harassment.\n\n>I'm not going to waste any more of my time educating you.\n\nAnd,\n\n>[–]richardamullens 1 point 1 month ago \n\n>In my opinion, you are talking out of your arse.\n\nAs well as,\n\n>[–]richardamullens 1 point 1 month ago \n\n>Only to an uninformed idiot.\n\n>rBTC was created as a venue for uncensored discussion of Bitcoin BEFORE the fork on August 1'st 2017.\n\n>If you don't like it then it is just too bad.\n\nSome of the things you say have truth to them (like George would always pepper some truth with his lies), but you appear to be quite short-tempered and aggressive. And every second post of yours for at least the last couple months is like this. So you're projecting and being a hypocrite, you are toxic and short just like George is. I ask again, are you george donnelly using a sockpuppet, or otherwise in his employ?",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9e9qjm",
                                                                    "author": "richardamullens",
                                                                    "score": 0,
                                                                    "created_utc": 1653093372.0,
                                                                    "response": "That is what I wrote but it was not a reply to Roger.\n\nI was replying to an idiot who came repeatedly to rbtc to troll.  \n\n\nI already answered your question when I said \"Don't be stupid\".  \n\n\nSending the same offensive post out to 5 different newsgroups is character assassination - it won't make you any friends.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9eak1h",
                                                                            "author": "thethrowaccount21",
                                                                            "score": 2,
                                                                            "created_utc": 1653093806.0,
                                                                            "response": ">That is what I wrote but it was not a reply to Roger.\n\nWell it doesn't matter who it is in reply to, what matters is it shows a pattern of you being abusive and disrespectful to people off the bat, which makes your claims of me being \"toxic\" hypocritical. Even though you jumped down my throat out of the gate, I was calm and patient with you which means you're more toxic than I am, which makes you a liar and a hypocrite.\n\n>I already answered your question when I said \"Don't be stupid\". \n\nThat's not an answer that's a dodge. You don't want to be forced into lying so you give a non-answer. The fact that you refuse to answer with a simple yes or no, along with the aggressive manner in which you defend george leads me to conclude that you are in fact george himself. \n\nGeorge, if you're going to block me then DON'T REPLY TO ME ANYMORE, sock puppets or not. If you're not man enough to address me with your own account then just SHUT UP!\n\n>Sending the same offensive post out to 5 different newsgroups is character assassination - it won't make you any friends.\n\nIt is NOT character assassination, it would only be character assassination if it were false or misleading. If george/you were normally a stand up guy and \"just made a mistake\" and I did that then it would be character assassination. But I didn't cross post without cause, George/you engaged in CENSORSHIP by replying to me and preventing me from responding back by blocking me right after. \n\nBasically he/you tried to win an argument DISHONESTLY, and that was my response. You have NO RIGHT to criticize me for that while ignoring the action that caused it. Again making you a hypocrite. Like I said in my original post, STOP IT!",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "i9e59x9",
                                                            "author": "thethrowaccount21",
                                                            "score": 3,
                                                            "created_utc": 1653091001.0,
                                                            "response": ">I am not obliged to answer any of your questions.\n\nYou actually are. Its dishonest to enter a discussion without giving parley to the other side. This is not a lecture, nor is this your living room. If you're going to take it upon yourself to castigate me for my exposal of George then you are obligated to receive feedback and respond honestly when I counter. Otherwise you're being dishonest and disingenuous, so knock it off.\n\n>I already said that I believe that George made an honest mistake - and yet you accuse him of stealing from the community. \n\nHow can you claim that his failure to deliver \"1 million users by Dec 2021\" in exchange for $60,000 USD of BCH community money was \"an honest mistake\"? A mistake is something you do by accident or unknowingly, he didn't fulfill his goals and never gave the money back so that can't be considered as 'a mistake'. Besides, it makes more sense for that comment to be referring to the SmartBCH scam that George was involved in, not his failure to provide the promised results of his flipstarter. Which means you still didn't answer the question. Stop playing word games and answer honestly or shut up!\n\n>Moreover you have posted your bile about George to:\nDashUncensored,\n\nYou have no right to call my well-sourced and legitimate criticisms of him \"bile\", and there is nothing wrong with crossposting relevant information to relevant subreddits. You're the only one spewing 'bile' here (by pretending a normal action like crossposting is somehow an offense). Are you George Donnelly using a sockpuppet, or otherwise in his employ?",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9e7uq8",
                                                                    "author": "richardamullens",
                                                                    "score": 2,
                                                                    "created_utc": 1653092363.0,
                                                                    "response": ">Are you George Donnelly using a sockpuppet, or otherwise in his employ?\n\nDon't be stupid.  \n\n\nAs I said, by posting your bile to 5 different groups, you come across as an unpleasant person involved in character assassination.  You should take that onboard and learn that being obnoxious will only make you enemies.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9e8xe8",
                                                                            "author": "thethrowaccount21",
                                                                            "score": 2,
                                                                            "created_utc": 1653092939.0,
                                                                            "response": ">Don't be stupid. \n\nIt's not stupid. George Donnelly was accused with evidence of using an alt account to defend himself in a now-deleted thread shortly before he left this community. Answer the question and stop dodging, are you George Donnelly or in his employ, yes or no?\n\n>As I said, by posting your bile to 5 different groups, you come across as an unpleasant person involved in character assassination. \n\nGaslighting. George posted a reply to me and blocked me so I couldn't reply back, you're blaming the victim which is dishonest debating. If you really cared about 'unpleasant people' and 'character assassinations' why don't you criticize George for attacking me and preventing me from replying? You're being a hypocrite again.\n\n>You should take that onboard and learn that being obnoxious will only make you enemies\n\nYou talk just like George does. \"Onboard\". I don't mind you being my enemy, you're an asshole and a gaslighter. The kind of people I eat for breakfast.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i9ebd3f",
                                                                                    "author": "richardamullens",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653094241.0,
                                                                                    "response": "I am not George Donnelly or in his employ.  It is delusional for you to even suggest it.  \n\n\nNow, as it is gone midnight in the UK, and as I don't find you pleasant I will stop responding to you.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i9eefao",
                                                                                            "author": "thethrowaccount21",
                                                                                            "score": 2,
                                                                                            "created_utc": 1653095894.0,
                                                                                            "response": ">I am not George Donnelly or in his employ. It is delusional for you to even suggest it. \n\nSo why are you defending him so hard? It is unusual for an adult male to defend another adult male this much, especially when they are in the wrong. George engaged in an act of censorship which you completely ignored, which indicates you have personal or professional motivations in your stalwart defense.\n\nAnd it is NOT delusion, george was proven to defend himself using a sockpuppet account already just a couple months ago. Its delusional for you to think your whole-hearted defense of someone else is normal.\n\n>and as I don't find you pleasant I will stop responding to you.\n\nYou should've kept your mouth shut in the first place, George. Your refusal to answer even the simplest questions above lends credence to the claim that you're professionally tied to George in some way, if not him masquerading as someone else himself.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9erwn3",
                    "author": "-ism-isa-con",
                    "score": 1,
                    "created_utc": 1653103070.0,
                    "response": "> There is nothing wrong with working together to remove bad actors from the community\n\nOkay.  Which community?  The r-btc community?  The p2p electronic cash community?  The community of persons whom you will fund?  People whose ideas you will grant some consideration?   I ask because I don't always see the utility of cancel culture unless building a cancel cult.   And, let's say excluding someone from circle A may be justifiable; well, I might still want that person welcomed in circle B.  Further, I think there are always many variables and unknowns and possibilities and because of that my goal is to limit my judgments to a person's actions at a particular point in time.  And I tend to be suspicious of two minute hates where we form a circle and point at an individual and repeat the same thing.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}