{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uksjur",
            "title": "How is BCH worth less than 1% of Bitcoin value? Arent big blockers at least a few percent of the Bitcoin community?",
            "url": "https://www.reddit.com/r/btc/comments/uksjur/how_is_bch_worth_less_than_1_of_bitcoin_value/",
            "author": "big--if-true",
            "created_utc": 1651978267.0,
            "score": 33,
            "num_comments": 81,
            "subreddit": "btc",
            "selftext": "Currently 75k Bitcoin can buy up all ~10 million BCH that are in circulation (This excludes lost BCH). So less than 1% of all Bitcoin holders, can buy up the entire BCH network. Which kind of makes no sense, since arent the big blockers from Bitcoin more than 1% of the community?\n\neg. Ethereum is 50% of Bitcoin?",
            "stickied": false,
            "comments": [
                {
                    "id": "i7r5qzk",
                    "author": "Remora_101",
                    "score": 35,
                    "created_utc": 1651978868.0,
                    "response": "Slander, censorship and price manipulation. Don't forget, Tether and blockstream are cooperating and Bitfinex has been known to be anti-BCH. \n\nTethers first big print and coincidentally BTCs big pump was right after the fork.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7sz0pq",
                            "author": "silviapierpaolo",
                            "score": 3,
                            "created_utc": 1652022528.0,
                            "response": "Tether is shit and they're the ones who inflate the fucking price dude.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7rhyq5",
                    "author": "thesis_st8mint",
                    "score": 25,
                    "created_utc": 1651985727.0,
                    "response": "It makes no sense to me. Just keep on accumulating BCH. That is all. Also, keep promoting merchant adoption! Marc and Ryan have done an incredible job of that down in South Florida 🏖",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7s0200",
                            "author": "WippleDippleDoo",
                            "score": 10,
                            "created_utc": 1651999823.0,
                            "response": "Promote user adoption too it’s even more important than business adoption.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i7srnkt",
                            "author": "Ryan-Giffin",
                            "score": 4,
                            "created_utc": 1652019099.0,
                            "response": "Thank you!!",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i7rmz9m",
                            "author": "Mafalzon",
                            "score": 13,
                            "created_utc": 1651989081.0,
                            "response": "Thanks! Just wait until you guys see what I'm working on and will be releasing next month...",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7rowhc",
                                    "author": "moleccc",
                                    "score": 11,
                                    "created_utc": 1651990544.0,
                                    "response": "If you were Kim dotcom I'd brush this off. But your track record doesn't say anything about bragging and not delivering, so I'm holdng my breath.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i7r7b6r",
                    "author": "Late_To_Parties",
                    "score": 21,
                    "created_utc": 1651979726.0,
                    "response": "Same reason .jpg NFTs got big. Because people don't understand the point of crypto.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7t0aj1",
                    "author": "cryptodevo2021",
                    "score": 5,
                    "created_utc": 1652023099.0,
                    "response": "All markets are down right now. Hang in there",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7re819",
                    "author": "tl121",
                    "score": 13,
                    "created_utc": 1651983564.0,
                    "response": "Marketcap math does not reflect reality for trades in significant volume.  For example, none of my BCH is for sale at any price.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7s1gfy",
                            "author": "ykarakaslar",
                            "score": 4,
                            "created_utc": 1652001063.0,
                            "response": "That says a lot about the BCH. You can't go wrong with it.\n\nBch is amazing and here we've got the small but happy community of the Bitcoin cashers all of them which believes in the bch. And we're here to support the adoption dude.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7ros5f",
                    "author": "moleccc",
                    "score": 7,
                    "created_utc": 1651990450.0,
                    "response": "Many Bigblockers already swapped their btc to bch at much higher prices.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7s07wh",
                            "author": "WippleDippleDoo",
                            "score": 3,
                            "created_utc": 1651999967.0,
                            "response": "Many sold their btc to fiat too after the fork, then price shenanigans began (USDT boosting BTC artificially)",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7rf3f0",
                    "author": "ApplicationAny1434",
                    "score": 12,
                    "created_utc": 1651984060.0,
                    "response": "it is impressive that after the big selloff, censorship and everyone ignoring BCH it still in top30.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7s3qre",
                            "author": "i_have_chosen_a_name",
                            "score": 5,
                            "created_utc": 1652003148.0,
                            "response": "Halfway way through the bullmarket BCH will be back in the top 15 and as we come out of it back top 5.\n\nEvery full cycle (bull + bear) we see lows that are 80% lower then ATH's and we see 80% of coins die.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i7rnju1",
                            "author": "Mafalzon",
                            "score": 4,
                            "created_utc": 1651989502.0,
                            "response": "Truth.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7sinmp",
                    "author": "doramas89",
                    "score": 6,
                    "created_utc": 1652014372.0,
                    "response": "BCH price is manipulated by naked shorts (selling numbers on the screen in exchanges like Bitfinex and Binance, but nothing behind  them - buyers can't withdraw because those \"coins\" put for sale don't exist). See Binance's BCH withdrawals closed every now and then.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7rndr0",
                    "author": "Mafalzon",
                    "score": 5,
                    "created_utc": 1651989375.0,
                    "response": "Maybe the problem isn't Bitcoin Cash is undervalued, necessarily.\n\nMaybe the problem is the crypto market, in general, is overvalued.\n\nCryptocurrency is incredibly new - very few people actually use it. If all the hype and speculation was gone, and the price of Crypto was based solely on merchant adoption / # of people using it as currency -- would the price be more than $260 per coin right now? I doubt it.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7rtcqc",
                            "author": "moleccc",
                            "score": 4,
                            "created_utc": 1651994098.0,
                            "response": "> would the price be more than $260 per coin right now?\n\nMuch less. Given enough data this can actually be calculated.\n\nDid this once in 2011 for btc based on silk road data. Came out at 5 usd/btc when market was at 5 times that.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "ul6f5v",
            "title": "Merchant discovers the fees in Bitcoin versus Bitcoin Cash (Ouch!)",
            "url": "https://v.redd.it/ig11nscccay81",
            "author": "Mafalzon",
            "created_utc": 1652030217.0,
            "score": 92,
            "num_comments": 35,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i7u9wpp",
                    "author": "big--if-true",
                    "score": 22,
                    "created_utc": 1652043091.0,
                    "response": "BCH was the original plan all along. Its how Bitcoin used to be. Real utility.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7tgwpp",
                    "author": "Mafalzon",
                    "score": 18,
                    "created_utc": 1652030347.0,
                    "response": "In [my new YouTube video, I went to Orlando Florida to onboard Merchants to accept Bitcoin Cash](https://www.youtube.com/watch?v=EuLVKn00ntw). One of my stops is an incredible pasta/pizza place called Playa Pizza right behind the magic kingdom, *where they make their own pasta and dough from scratch*.\n\nDuring the onboarding, Dustin shows the merchant the fees on the Bitcoin network versus Bitcoin Cash. The reaction is pretty similar to my reaction when I first learned about Bitcoin just two years ago.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7ua8gd",
                    "author": "fiendishcrypro",
                    "score": 4,
                    "created_utc": 1652043242.0,
                    "response": "Great video, cheers Marc.\n\nOne question I got: You say Bitcoin Cash is just a great medium of exchange, and that they can swap BCH for any other coin they want in their wallet.\n\nIf you swap BCH for BTC or ETH you have to pay on chain fee to do so. How then does that beat just accepting BTC or ETH?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7ublvj",
                            "author": "Mafalzon",
                            "score": 8,
                            "created_utc": 1652043862.0,
                            "response": "> do\n\nI personally rather hold BCH, but I want the Merchants to understand they have the option to swap if they'd like.\n\nAs a side note, I don't see BTC/LN much different then BCH into BTC. With LN you need to take your BTC, pay an onchain fee to turn it into LN, pay the LN fee, then pay the on-chain fee to turn it back into BTC (on the Muun wallet, for example.) The fee to swap between BCH/BTC on Coinbase Pro is lower then that (I believe!)",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7udflp",
                                    "author": "fiendishcrypro",
                                    "score": 3,
                                    "created_utc": 1652044655.0,
                                    "response": "Ah OK, so changing at exchanges. Fair enough, might be good to also make clear \"not your keys, not your coins' to protect against censorship etc.\n\nThanks for the answer, loving the updates and excited by what you guys are working on. Best of luck!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i7vdp1i",
                    "author": "Imaharak",
                    "score": 3,
                    "created_utc": 1652062104.0,
                    "response": "I use Lightning, $0.0004.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "ukyvvm",
            "title": "just had a interesting conversation with a bitcoin mod that resulted in a 7 day ban",
            "url": "https://www.reddit.com/r/btc/comments/ukyvvm/just_had_a_interesting_conversation_with_a/",
            "author": "undadatunda",
            "created_utc": 1652005740.0,
            "score": 17,
            "num_comments": 16,
            "subreddit": "btc",
            "selftext": "it started from these 2 comments i think:\n\nhttps://old.reddit.com/r/Bitcoin/comments/ukiasz/when_bitcoin_dips_10/i7qief1/?context=3\n\nhttps://old.reddit.com/r/Bitcoin/comments/uklsod/the_sec_is_preparing_for_an_increasingly_risky/i7qmv71/?context=3\n\n\nthen got this reply in personnel inbox not out in the open for everyone to see:\n\n\"Your comments aren't getting \"ghosted away.\" In fact, we've tolerated you constantly spreading your conspiracies and misinformation on this sub. Even after we've educated you about forks and shitcoins, you still continue attempting to trick users by commenting that altcoins are different from shitcoins and that shitcoin that fork off from bitcoin are good. Perhaps we should start removing all of your garbage comments since you're already accusing us of it?\"\n\nso i made this reply to the unknown mod:\n\n\"ok i appreciate it if you guys dont ghost my comments away anymore\n\nbut you know if 2 things are different then they cannot have the same name so thats why altcoins are not shitcoins and as you can see from the cdc gov link crypto makes you go to the bathroom lots lol so thats why crypto means shitcoins..ok perfect but the difference between a shitcoin and a altcoin is that the shitcoin was premined and a altoin there is no premine because when you fork from bitcoin you take a copy from the ledger and then go from there so theres no premining of coins..but even if you did alter the ledger it would still be a altcoin because alt stands for alternative version of bitcoin the first ledger ever and the fairest start ever\n\ntrue none of this stuff is written in stone yet so maybe you think this is a battle of opinions..but if you ghost away my comments about this then thats simply not cool\n\nalso i wouldnt care about this actually cept its important when u understand that forks from bitcoin are important for bitcoin to survive..cuz forks from bitcoin are like feelers for what bitcoin can do and like a true test in the real world\n\nsome here seem to want bitcoin to 'ossify' but i dont ..i think bitcoin can do everything and that why we need bitcoin to be able to use its forking abilities for many things that most here are not aware of yet it seems\n\nyes its complicated..but so are many things in life..such as how can bitcoin escape the paper i.o.u's(back to trust) and bitcoin is meant to be trustless..so the 2 clash..and if trust wins then bitcoin loses..we dont want that right?\n\nso if we encourage a bitcoin eco_system where people fork from bitcoin for the ideas rather than what they are doing now which is to premine for the ideas then that means bitcoin can escape the paper i.o.u's of trust because custodians will have to do proof of reserves and keep everyones bitcoin seperate in order to be able to hand out whatever fork that customer wants if say they want to trade it or spend it etc\n\nso if we call forks from bitcoin shitcoins then it steers everyone actually towards the real shitcoins and not towards building a bitcoin eco-system that does the job of all of the shitcoins but better for everyone that holds real bitcoin(no premines remember)..and thats how bitcoin gets to a mil. and more is cuz then bitcoin does \"everything\"\n\nbcash for example was just an idea that turns out the people dont want..but bcash was trying to be a better bitcoin so thats a bold move but the people decided and the only ones that lost out were the ones that wantd the bcash idea and then put their money into that..but really average joe dont have to be concerned cuz they will have both..but bitcoin is so huge now that to try to be a better bitcoin is very small chance to do that so most forking will be just for ideas...and if any of those ideas becomes popular then bitcoin can consider to adopt it into itslef if it was wanted but that would be judging by how popular the fork was and if it was becoming a threat to the real bitcoin...thats true democracy by the masses\n\nforking from bitcoin is an ability of bitcoin itself..a true way to upgrade chosen by the masses\n\nhope this explains it more\"\n\nthen got this reply:\n\n\"Nobody is \"ghosting\" your comments. There is no such thing as ghosting. We removed one single comment of yours because it was false.\n\nStop spreading misinformation and trying to confuse newbies.\n\n    also i wouldnt care about this actually cept its important when u understand that forks from bitcoin are important for bitcoin to survive..cuz forks from bitcoin are like feelers for what bitcoin can do and like a true test in the real world\n\nFalse. Utter bullshit.\n\nForks are not \"like Bitcoin's feelers\"\n\nShitcoins that fork off from Bitcoin are not a good thing and we shouldn't encourage or support them.\n\nYou thing BCH, BSV, BTG, and BCD are a good thing?\n\n    but bcash was trying to be a better bitcoin\n\nFalse. They wanted to take over Bitcoin and it was an attack on Bitcoin. Bcash was created because a group of Bitcoin miners in China that controlled a large amount of Bitcoin's hashrate were using a secret mining enhancement called AsicBoost that gave them a 20% hashrate advantage. Bitcoin was going to implement SegWit and SegWit is not compatible with AsicBoost. The majority of miners did not support SegWit because they were using AsicBoost and they wanted to keep using AsicBoost.\n\nBitcoin Improvement Proposals are how Bitcoin is upgraded. If someone has an idea of how to improve Bitcoin, then they can submit a BIP. And there is already an altcoin that acts as Bitcoin's live in the field testnet. It's called Litecoin. New technology can be tried out on Litecoin before being considered for Bitcoin. That's what was done with the Lightning Network. And now Litecoin is going to integrate mimblewimble which could possibly be implemented on Bitcoin in the future.\"\n\nso i replyed back:\n\n\"so you just called litecoin an altcoin...so tell me why you didnt call it a shitcoin? after all it is a fork from bitcoin that made someone really rich and that now rich person used to work at coinbase hmmmm...\n\nits called the blocksize war not the asic boost war..they even have a book about it\n\nyou say things like false and utter bullshit but really its just your opinion\n\nif you think 'they' wanted to take over bitcoin do you now think the 'theys' are now gone forever and bitcoin is like forever safe or something?\n\nif bitcoin stays on a singlular path and cant fork then it 'is' taken over because price discovery is in the den of the old fiat monsters and its done through i.o.u's same way all things on the markets are controlled so thats why people use real estate for saving..but real estate is taxed on the clock so ya its ok i guess lol...but can you tax gold or bitcoin on the clock?\n\nim not sure who im talking to right now but it seems you havnt thought all of this out too well cuz your solution of bitcoin ossifying or staying on a singular path has lots of holes in it\n\ncant you see i want us all to work together and all im really talking about here is that bitcoin can do much much more than it is right now and at the same time be even more stable and under less threats from 'all' angles\n\nhow else can we solve the paper bitcoin i.o.u's problem too? well this bitcoin 'eco-system' solves all of the problems and actually you havnt even mentioned one reason why this is 'bad' for bitcoin\"\n\nthen got this reply back:\n\n\n\n   \" so you just called litecoin an altcoin...so tell me why you didnt call it a shitcoin?\n\nI don't call Litecoin a shitcoin because it's basically Bitcoin's live in the field test net. New tech can be tested on a real cryptocurrency before being considered for Bitcoin. Because if something happens critical to Litecoin, it's no big deal. But if something critical happened to Bitcoin, it would be a big deal. But I don't consider 100% of altcoins to be shitcoins. And being a shitcoin has nothing to do with if they forked off from Bitcoin or not. I can think of one particular altcoin that isn't a shitcoin and it didn't fork off from Bitcoin. But I do agree with you about premined coins. All premined coins are shitcoins. But well over 99% of all altcoins are shitcoins.\n\nThe only thing that I like about Litecoin is that new Bitcoin technology can get tested on it before being considered for Bitcoin. And the Litecoin developers have been supportive of this. But the fact is, Litecoin practically had a premine because the first 10,000 blocks were mined in a bit over 23 hours. Only 576 blocks should've been mined in the first day according to the officially communicated blocktime of 2.5 minutes. This emission is almost 18 times faster than scheduled and it didn't change despite 4 difficulty adjustments. That was basically a premine for Charlie Lee. Then Charlie Lee sold all of his LTC for over $200 each.\n\nI didn't day that Bitcoin should ossify. Bitcoin is upgraded through BIPs. If someone has an idea to upgrade Bitcoin, then they can submit a BIP. Shitcoins forking off from Bitcoin is not a good thing. Shitcoin forks don't solve the paper bitcoin IOU problem. Don't buy paper bitcoin and you wont have a problem.\n\nI'm finished having this conversation with you. You don't understand Bitcoin and forks as well as you think you do. Stop spreading misinformation or maybe we will start \"ghosting your misinformation comments\" AKA removing them. You already accused us of it.\"\n\nYou have been temporarily muted from r/Bitcoin. You will not be able to message the moderators of r/Bitcoin for 7 days.\n\nend of story: just thought id let you guys know cuz many of you probably already been through it too and idk where else can a person go for justice when the mods are being gatekeepers on bitcoin and preventing ideas also they deleted many more than just 1 of my comments its just its hard to dig them up\n\nidk maybe some here can see the bigger picture of how to get everyone working together instead of against each other..but idk maybe bitcoin has already ossified and the only way now is for some smaller coin to do the bitcoin eco-system thing through the forking power and put the pressure onto the ossified bitcoin..thats sort of how it would work in the eco-system anyways",
            "stickied": false,
            "comments": [
                {
                    "id": "i7sas53",
                    "author": "Remora_101",
                    "score": 16,
                    "created_utc": 1652009108.0,
                    "response": "They don't like opposing opinions in that cult. You are either in the cult or you are an enemy that can be banned and silenced. Small Blocks were established trough censorship they won't stop now.\n\nThat is why this sub and BitcoinCash exists.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7sgmfb",
                            "author": "VideoGameDana",
                            "score": 6,
                            "created_utc": 1652013133.0,
                            "response": "> Also TLDR",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7tr9zm",
                    "author": "CDSagain",
                    "score": 8,
                    "created_utc": 1652034874.0,
                    "response": "It's a cult. The act like a cult, they look like a cult ( middle aged men with cartoon laser eyes has got to be the saddest, most cringe worthy thing ever ). Logic and the truth is heresy to the maxi believer.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7s6pnn",
                    "author": "revddit",
                    "score": 3,
                    "created_utc": 1652005760.0,
                    "response": "Another option for reviewing removed content is your ***Rev***eddit [user page](https://www.reveddit.com/y/u!n!d!a!d!a!t!u!n!d!a?all=true). The [real-time extension](https://www.reveddit.com/add-ons/direct/) alerts you when a moderator removes your content, and the [linker extension](https://www.reveddit.com/add-ons/linker) provides [buttons](https://i.imgur.com/0BAImPq.png) for viewing removed content. There's also a [shortcut for iOS](https://www.icloud.com/shortcuts/62bc7570613c42cb8b851fad264136df).\n\nThe parent commenter can reply with 'delete' to remove this comment. This bot only operates in authorized subreddits. To support this tool, [post it on your profile](https://old.reddit.com/user/me/submit?title=See+which+comments+of+yours+have+been+removed&url=https%3A%2F%2Fwww.reveddit.com%2Fabout%2F) and select ['pin to profile'](https://i.imgur.com/uq9AGMV.png).\n\n&nbsp;\n\n[^F.A.Q.](https://www.reveddit.com/about/f.a.q./) ^| [^v/reveddit](https://www.reveddit.com/v/reveddit/-redirect) ^| [^support ^me](https://www.reveddit.com/about/donate) ^| [^share](https://old.reddit.com/user/me/submit?title=See+which+comments+of+yours+have+been+removed&url=https%3A%2F%2Fwww.reveddit.com%2Fabout%2F) ^& [^'pin ^to ^profile'](https://i.imgur.com/uq9AGMV.png)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7t1hup",
                    "author": "Zealousideal_Year551",
                    "score": 7,
                    "created_utc": 1652023633.0,
                    "response": "BCH has been oppressed since the dawn of time.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "ul3t9c",
            "title": "Watch the countdown to the BCH network upgrade at cash.coin.dance !",
            "url": "https://i.redd.it/zqecwjpbq9y81.png",
            "author": "Mr-Zwets",
            "created_utc": 1652022777.0,
            "score": 56,
            "num_comments": 9,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i7ty8s8",
                    "author": "big--if-true",
                    "score": 7,
                    "created_utc": 1652037933.0,
                    "response": "5 Years and going strong! BCH FTW!",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "ul3w7u",
            "title": "Flipstarter Origin Story (a personal account)",
            "url": "https://twitter.com/EmergentReasons/status/1523320498091823105",
            "author": "emergent_reasons",
            "created_utc": 1652023008.0,
            "score": 21,
            "num_comments": 6,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "ul1eyx",
            "title": "Introducing Borracho.cash - a small smartBCH (future BCH) help/info site",
            "url": "https://www.reddit.com/r/btc/comments/ul1eyx/introducing_borrachocash_a_small_smartbch_future/",
            "author": "Borracho_mejor",
            "created_utc": 1652015503.0,
            "score": 15,
            "num_comments": 7,
            "subreddit": "btc",
            "selftext": "Hey guys, I wanted to share something I've been working on in my limited free time lately.\n\nToday, I'm officially announcing the release of [https://borracho.cash](https://borracho.cash)  \nYou will probably be most interested in specifically [https://borracho.cash/smartBCH](https://borracho.cash/smartBCH)\n\nThe announcement thread can be found here: [https://twitter.com/borrachomejor/status/1523127334785761281](https://twitter.com/borrachomejor/status/1523127334785761281)\n\nThis was designed to be a quick help/information site for smartBCH, with plans for much more. I'm an SE student, close to finishing my degree, and decided to build this from the ground up as a way to help the BCH and smartBCH community while serving as a learning experience.\n\nThis is my first 'real' project, so it probably has a few bugs, sorry mobile users 😬. Please report anything you see wrong, any issues you see, any requests, or any projects you think should be added to the Support/Listing Telegram at [https://t.me/borrachocash](https://t.me/borrachocash).\n\nYou can also join the Announcements channel at [https://t.me/borrachocashannouncements](https://t.me/borrachocashannouncements), where I'll post any important updates.\n\nAnyways, this is very much a work in progress and a 'roadmap' for the site and my future plans will be released soon...or at some point. \n\n[Screenshot of Borracho.cash\\/smartBCH](https://preview.redd.it/k11hphp149y81.png?width=2554&format=png&auto=webp&s=3ca296143f6f51005f5b4fa8ddc8fe9a337bba6a)",
            "stickied": false,
            "comments": [
                {
                    "id": "i7tu47k",
                    "author": "Anekdotin",
                    "score": 5,
                    "created_utc": 1652036133.0,
                    "response": "Nice job bro",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7tu8tm",
                            "author": "Borracho_mejor",
                            "score": 3,
                            "created_utc": 1652036189.0,
                            "response": "Thank you! I hope there's much more to show in the future.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "ukxsdc",
            "title": "Bitcoin Cash: The Universal Currency",
            "url": "https://read.cash/@Pantera/bitcoin-cash-the-universal-currency-8f489694",
            "author": "coinflip1211",
            "created_utc": 1652000641.0,
            "score": 21,
            "num_comments": 9,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i7tw3qi",
                    "author": "Acceptable_Bus_354",
                    "score": 3,
                    "created_utc": 1652037002.0,
                    "response": "Bitcoin Cash is designed to become P2P Electronic Cash for the world. The time we thought we had to complete the Bitcoin Cash roadmap has been greatly reduced, due to the exponential increase in money creation by the Federal Reserve.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "ukuwei",
            "title": "Good article on the lightning scheme.",
            "url": "https://medium.com/block-digest-mempool/lightning-network-yield-and-incentives-b2b624375094",
            "author": "WippleDippleDoo",
            "created_utc": 1651987549.0,
            "score": 16,
            "num_comments": 13,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i7rz467",
                    "author": "jessquit",
                    "score": 15,
                    "created_utc": 1651999006.0,
                    "response": "Outstanding article.  What resonated with me is that it's mostly a recap of things we've warned about since 2017.  The centralizing force of a liquidity bound network.  The ability to dox routes.  The ability to launch liquidity attacks.  The inherent incentive to form federations.  etc etc etc\n\n> Bcash debacle\n\nhepl i'm drowning in irony\n\nYeah it is definitely a \"debacle\" that the people who pointed out almost every flaw that the author is claiming were censored and banned and turned into literal pariahs for saying most of **the exact same things the author is saying**\n\nwhat a \"debacle\" those losers all were eh???\n\nsmh smh smh smh smh smh smh smh",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7ss2bg",
                            "author": "gotamd",
                            "score": 6,
                            "created_utc": 1652019303.0,
                            "response": "It’s hard for me to imagine someone like this author who truly now gets why LN is a farce, yet doesn’t yet understand that BCH was not a “debacle.” It was the people who already foresaw the issues with LN and what would come of artificially limited on-chain scaling and simply said no to Blockstream and their cronies. Hopefully the author has come around, or does so soon.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7sufth",
                                    "author": "jessquit",
                                    "score": 12,
                                    "created_utc": 1652020430.0,
                                    "response": "It's like when they tell you that you need to run a full node not SPV so you can make sure the rules aren't being changed without your consensus.\n\nThen in the same breath they tell you that a minority fork can't be Bitcoin, when basically the only reason to run a full node is because you distrust the majority and want to stay with the minority in the event of a fork. SPV stays with the majority regardless.\n\nThen now that you're running a full node and can make sure the rules don't change, they tell you that changes to the protocol have to be soft forked so that full nodes can't detect / reject the change.\n\n🧐\n\nEdit: I found [a helpful visual](https://lettereatheo.files.wordpress.com/2012/07/relativity.jpeg) that helps to explain this particular form of logic",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i7rzq8l",
                            "author": "WippleDippleDoo",
                            "score": 5,
                            "created_utc": 1651999540.0,
                            "response": "Exactly!",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7s0x10",
                                    "author": "jessquit",
                                    "score": 9,
                                    "created_utc": 1652000573.0,
                                    "response": "... using the provided space to point out for the zillionth time -- I'm not a Luddite, I'm not against the existence of \"Lightning Networks\" in the abstract --  I was (and am) against the notion that we should limit the blockchain to becoming a settlement layer for a bunch of banks.  The blockchain exists for casual p2p payments.  That's the point.  You want to run a Lightning Network on top of the p2p cash system?  Fine.  Just don't break the p2p cash system in order to gin up demand for your Lightning Network.\n\nThe point of Bitcoin wasn't to reinvent the middleman, but to eliminate it.  For all of the reasons given in the original article in OP - and more.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i7s2k3t",
                                            "author": "WippleDippleDoo",
                                            "score": 8,
                                            "created_utc": 1652002058.0,
                                            "response": "Same here. Optional L2 on a scaled main-net is interesting. Crippled mainnet + LN is a farce.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i7rkzpi",
                    "author": "WippleDippleDoo",
                    "score": 10,
                    "created_utc": 1651987664.0,
                    "response": "Funny it’s from late 2021 and nothing changed since then. \n\nMost important parts:\n\n> Sorry to burst your bubble, Lightning is a friends only nothing can ever go wrong toy network right now. The adversarial screws haven’t even been installed yet, let alone tightened. It’s time to wake up out of the hype dream.\n\nAnd \n\n> Lightning as it stands right now is nothing but a children’s toy. Period. It is not some polished system, it is not a magical UX or UI, it is not even robust or solid in the face of adversarial attacks. It’s a fucking toy put together by a group of friends and maintained solely because it is composed predominantly of just that. Friends. Businesses who know each other.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7sf99l",
                    "author": "Remora_101",
                    "score": 8,
                    "created_utc": 1652012260.0,
                    "response": "What a mess.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uks0kl",
            "title": "Follow Bitcoin Cash supporters on Twitter!",
            "url": "https://twitter.com/_minisatoshi/status/1523083429738332160",
            "author": "DrankTooMuchTequila",
            "created_utc": 1651976283.0,
            "score": 17,
            "num_comments": 6,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i7r0ybu",
                    "author": "twitterStatus_Bot",
                    "score": 4,
                    "created_utc": 1651976294.0,
                    "response": "\\#BitcoinCash is Bitcoin. Bitcoin Core is Bitcoin Core. Spread the word :)\n\n---\n\nposted by [@_minisatoshi](https://twitter.com/_minisatoshi/)\n\n---\n\n^(If media is missing, please DM me with a link to submission url and tweet. I will do my best to solve the issue)",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "ukt18e",
            "title": "History repeats",
            "url": "https://v.redd.it/q5bo718c76y81",
            "author": "user4morethan2mins",
            "created_utc": 1651980069.0,
            "score": 348,
            "num_comments": 29,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i7rzybz",
                    "author": "WippleDippleDoo",
                    "score": 15,
                    "created_utc": 1651999733.0,
                    "response": "MSM hyping btc/eth and these getting into investment products like pensioner funds are the mother of all redflags.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7tkmc9",
                            "author": "patrikpekar",
                            "score": 3,
                            "created_utc": 1652031941.0,
                            "response": "I feel the same. But I am being told I \"don't understand\" it. \nMaybe. But I am still not touching it.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7uk1zf",
                    "author": "Crpto_fanatic",
                    "score": 5,
                    "created_utc": 1652047539.0,
                    "response": "Yo Fidelity and JPMorgan. Really need to see this. As a prior comercial banker. I can honestly say. That was pretty accurate, when they pushed me to sent clients to the investment side of the house.\nWatching and hearing the lunacy coming out of these financial advisors mouth made me quit. They bamboozled and lied to clients right in front of my face. And these are licensed professionals, with series 6 and 7 licenses, straight up telling people straight bullshit. Just to get them into the inverse trade or pushing them into money markets that barely yield above 2 percent. Disgusting people I say!!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7w5a9s",
                            "author": "misanthy",
                            "score": 2,
                            "created_utc": 1652079770.0,
                            "response": "How is not considered as a false advertisement?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7xwsj1",
                                    "author": "Keiji505",
                                    "score": 1,
                                    "created_utc": 1652116152.0,
                                    "response": "I khow right, pretty much surprising to me as well in starting.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i7voeq0",
                            "author": "yellowboxhoney",
                            "score": 1,
                            "created_utc": 1652067855.0,
                            "response": "Should I liquidate everything now?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7wjv2v",
                                    "author": "Crpto_fanatic",
                                    "score": 2,
                                    "created_utc": 1652092766.0,
                                    "response": "Idk I am not an advisor, and i probably don’t know any better than you do.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i99w4fx",
                                            "author": "moreno187",
                                            "score": 1,
                                            "created_utc": 1653010109.0,
                                            "response": "Indeed you can do a lot of better things than that as well",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i99vlwh",
                                    "author": "tompater",
                                    "score": 1,
                                    "created_utc": 1653009859.0,
                                    "response": "Yeah you can do that but you have to see something more of it l.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i7wz4nd",
                            "author": "tomeczekj",
                            "score": 1,
                            "created_utc": 1652102090.0,
                            "response": "Haha you are right since people don't know how to handle it.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7r89wv",
                    "author": "user4morethan2mins",
                    "score": 10,
                    "created_utc": 1651980242.0,
                    "response": "Courtesy of [WallStreetSilver](https://twitter.com/WallStreetSilv/status/1522798778725675009?s=20&t=j75Unk0mxbcGqkEjm_ZzUw)",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7xalmz",
                            "author": "catherinefwhitin",
                            "score": 1,
                            "created_utc": 1652107229.0,
                            "response": "He knew that they are already at rock bottom what more you expect.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7sq1ec",
                    "author": "fileznotfound",
                    "score": 7,
                    "created_utc": 1652018299.0,
                    "response": "Every now and then SNL actually does something funny.  Before the internet, I never found out.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i99vkaz",
                            "author": "irrving",
                            "score": 1,
                            "created_utc": 1653009838.0,
                            "response": "I wonder if any of us even know why this was never found out lol.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i80m0th",
                    "author": "rbtc-tipper",
                    "score": 2,
                    "created_utc": 1652160071.0,
                    "response": "Congratulations! You've been tipped for your post. u/chaintip - See who else has been tipped [here](https://www.reddit.com/user/rbtc-tipper/submitted/)",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i80m2bd",
                            "author": "chaintip",
                            "score": 2,
                            "created_utc": 1652160099.0,
                            "response": "***\nu/user4morethan2mins, you've [been sent](https://www.blockchain.com/bch/address/bitcoincash:qrelay24vssaqalhtau956a5xkznzkr4uvd8ampg6s) `0.00118804 BCH` | `~0.28 USD` by u/rbtc-tipper\nvia [chaintip](http://www.chaintip.org).\n***",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7xvejm",
                    "author": "giteeng",
                    "score": 1,
                    "created_utc": 1652115597.0,
                    "response": "u/savevideo",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7xwbjc",
                            "author": "SaveVideo",
                            "score": 1,
                            "created_utc": 1652115961.0,
                            "response": "###[View link](https://redditsave.com/r/btc/comments/ukt18e/history_repeats/)\n\n\n --- \n [**Info**](https://np.reddit.com/user/SaveVideo/comments/jv323v/info/)&#32;|&#32; [**Feedback**](https://np.reddit.com/message/compose/?to=Kryptonh&subject=Feedback for savevideo)&#32;|&#32;[**Donate**](https://ko-fi.com/getvideo) &#32;|&#32; [**DMCA**](https://np.reddit.com/message/compose/?to=Kryptonh&subject=Content removal request for savevideo&message=https://np.reddit.com//r/btc/comments/ukt18e/history_repeats/) &#32;|&#32; \n [^(reddit video downloader)](https://redditsave.com) &#32;|&#32; [^(download video tiktok)](https://taksave.com)",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "ukud0d",
            "title": "Definitely getting banned but so worth it. ✊🏼✊🏼",
            "url": "https://i.redd.it/x1spficxm6y81.jpg",
            "author": "FouadAbboud",
            "created_utc": 1651985299.0,
            "score": 46,
            "num_comments": 47,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i7t7u8t",
                    "author": "Remora_101",
                    "score": 8,
                    "created_utc": 1652026424.0,
                    "response": "⚠️⚠️⚠️ Reminder, that u/nullc aka 1MegGreg  Greg Maxwell has entered the thread and has blocked me and likely many others. That means we are not able to directly confront and expose his lies, because that  blocks every interaction in the tree behind his comments for the blocked one.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i99vowv",
                            "author": "exetherasta",
                            "score": 1,
                            "created_utc": 1653009898.0,
                            "response": "Lmao who does even listen to that guy either or something.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7tagdz",
                    "author": "PoppaYerk",
                    "score": 2,
                    "created_utc": 1652027564.0,
                    "response": "u/bashco has always given off this virgin vibe on r/bitcoin",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7xj3h8",
                            "author": "jhonjmmi",
                            "score": 1,
                            "created_utc": 1652110697.0,
                            "response": "Haha you will find a lot of same kind of people there as well on that source\n\nMoreover you will find a lot of them even when they are actually same there.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7rpfwi",
                    "author": "totakaro",
                    "score": 6,
                    "created_utc": 1651990968.0,
                    "response": "I hold both BTC and BCH and while I agree the technology improves, it is not all about storage. I run three nodes, BTC umbrel, Bitcoin verde for BCH and Litecoin Core for LTC. My main issue is not storage but bandwith and uptime to be sync with the network, and when more users try to use the network it will use even more bandwith. Btw, I tried running an ethereum node but the requirements just for a node (not mining) are pretty high right now.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7s371u",
                            "author": "Aggravated-Bread489",
                            "score": 10,
                            "created_utc": 1652002650.0,
                            "response": "Most people will be able to run an SPV node which will allow them to fully validate and confirm their transactions while only downloading the block headers. This allows anyone to verify transactions no matter the block size with trivial infrastructure. This is how Satoshi described scaling in the white paper.\n\nI understand everyone wants to run a full node, but not everyone needs to. Running an SPV node gives everyone the benefits of a full node without the cost and technology constraints.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7sik5y",
                                    "author": "doramas89",
                                    "score": 13,
                                    "created_utc": 1652014314.0,
                                    "response": "I disagree everyone wants to run a full node. Nobody I know runs a full node. Only medium-big businesses would do that. That point is BTC propaganda (from folks who don't run nodes yet argue that African agricultors, who can't afford BTC fees, should be able to afford running a node).",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i7skqk3",
                                            "author": "Aggravated-Bread489",
                                            "score": 3,
                                            "created_utc": 1652015548.0,
                                            "response": "Yes, I was a little hyperbolic with that statement. I have no interest in running a full node. I think we agree on our points. \n\nMy point is that African agricultors *could* run an SPV node if they wanted to.\n\nThat is one of the most hypocritical things of the blockwars. BTC wants small blocks so everyone can run a node, but fees so high that only the wealthy can use the base layer.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i7sl9gb",
                                                    "author": "doramas89",
                                                    "score": 5,
                                                    "created_utc": 1652015836.0,
                                                    "response": "Got it :). Yes, that hypocrisy is actually an intention to stop decentralized money from overtaking fiat. The BTC project is controlled by state/banking actors, those pull Blockstream's strings.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i99vvjl",
                                                            "author": "student1488",
                                                            "score": 1,
                                                            "created_utc": 1653009987.0,
                                                            "response": "Indeed the strings just should just understand it as well",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i99vxd6",
                                                    "author": "nefyrekafus",
                                                    "score": 1,
                                                    "created_utc": 1653010013.0,
                                                    "response": "Yeah it should be used as a statement only to understand things.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i99vxl0",
                                            "author": "btcetiger",
                                            "score": 1,
                                            "created_utc": 1653010016.0,
                                            "response": "Yeah but they won't able to do that as well now lol.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i7rqtzc",
                            "author": "FouadAbboud",
                            "score": 11,
                            "created_utc": 1651992057.0,
                            "response": "I definitely agree that internet speed has to do with it too, but it’s still getting so much faster! I’m getting 500 mbps and everyone should. \n\nIt’s just the government corruption that keep countries behind and after they have taken their cut into their pockets.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7s1f2p",
                                    "author": "bch_pls",
                                    "score": 7,
                                    "created_utc": 1652001029.0,
                                    "response": "I like where you are going with this, agree with you the real bitcoin can scale and you should know which one scale.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i7sackn",
                                            "author": "FouadAbboud",
                                            "score": 12,
                                            "created_utc": 1652008776.0,
                                            "response": "Update: Banned for misinformation 😅🤣🤣🤣",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i7t4qzx",
                                                    "author": "hero462",
                                                    "score": 3,
                                                    "created_utc": 1652025067.0,
                                                    "response": "Welcome to the club",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i7xuhr5",
                                                            "author": "alanthinker",
                                                            "score": 1,
                                                            "created_utc": 1652115235.0,
                                                            "response": "Lmao most of us are in the same schema accordingly as well.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i99vuti",
                                                    "author": "hippoloma",
                                                    "score": 1,
                                                    "created_utc": 1653009977.0,
                                                    "response": "It is a  very huge misinformation and people know about it.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i7sihf3",
                                                    "author": "MorrisSchaefer",
                                                    "score": -11,
                                                    "created_utc": 1652014267.0,
                                                    "response": "Because you are an imbecile who thinks Bitcoin has 1MB limit",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i7tgknh",
                                                            "author": "jessquit",
                                                            "score": 6,
                                                            "created_utc": 1652030203.0,
                                                            "response": "If BTC didn't have a 1MB limit, then pre-Segwit nodes could not sync the chain. That limit remains, and cannot be exceeded.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i7y1gmf",
                                                                    "author": "lanimaso",
                                                                    "score": -1,
                                                                    "created_utc": 1652118014.0,
                                                                    "response": "I think that block size must be instigated as well for that.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "i7tdusm",
                                                            "author": "fredbloggsthrowaway",
                                                            "score": 5,
                                                            "created_utc": 1652029039.0,
                                                            "response": "> Because you are an imbecile who thinks Bitcoin has 1MB limit\n\n\nBitcoin absolutely has a 1MB limit, it is the limit that non signature data CANNOT exceed per block.\n\n\nSpot the [imbecile](https://archive.ph/kQDEM) Morris",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i99w147",
                                                                    "author": "rusik72",
                                                                    "score": 1,
                                                                    "created_utc": 1653010063.0,
                                                                    "response": "I think this will be taking a lot of blocks for that instance.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "i7xkxd2",
                                                            "author": "Junkpile4ever",
                                                            "score": 1,
                                                            "created_utc": 1652111423.0,
                                                            "response": "A lot of people thought that it is much lower than that.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i7yc6q1",
                                            "author": "greyfoxJew",
                                            "score": 1,
                                            "created_utc": 1652122390.0,
                                            "response": "Yeah you are right i don't know the value yet lol as well.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i7xazaw",
                                    "author": "michniakd",
                                    "score": 1,
                                    "created_utc": 1652107389.0,
                                    "response": "I am sure you must be getting a lot of speed there as well.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i7y0tqp",
                            "author": "kapral29",
                            "score": 1,
                            "created_utc": 1652117757.0,
                            "response": "They are pretty much at a higher level then we are expecting now.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7t8uo5",
                    "author": "No_Dogeitty",
                    "score": 1,
                    "created_utc": 1652026861.0,
                    "response": "Agreed. Funny to see Dogecoin turning into what bit coin was meant to be",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i99wh7r",
                            "author": "Tigrrra123",
                            "score": 1,
                            "created_utc": 1653010285.0,
                            "response": "I know right this was very surprising to see as well when I came to know about it initially \n\nThen again I think that all these kind of coins will just change and go when we need.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7sp97s",
                    "author": "nullc",
                    "score": -13,
                    "created_utc": 1652017903.0,
                    "response": "> Stays at 1MB.\n\nThe most recent block was 1.264MB. Sounds like you've been rbtc bamboozled.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7sqv8a",
                            "author": "FouadAbboud",
                            "score": 14,
                            "created_utc": 1652018704.0,
                            "response": "Same thing, when I say 1 MB you know what I mean… segwit messed up the way it is calculated whatever. My point is still valid.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i99wiug",
                                    "author": "thijshoutenbos",
                                    "score": 1,
                                    "created_utc": 1653010307.0,
                                    "response": "Yeah your point is valid and we had seen that option that it should be calculated \n\nBut it should be taken in more practical instance so that it can make some sense for us.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i7swsdb",
                                    "author": "One_Gas8634",
                                    "score": -10,
                                    "created_utc": 1652021518.0,
                                    "response": "/you, the block size stays at 1mb\n\n/nullc, the most recent block was bigger than that\n\n/you, my point is still valid ...",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i99whrr",
                                            "author": "volkov_ks",
                                            "score": 1,
                                            "created_utc": 1653010293.0,
                                            "response": "Yeah they are more like blocks are going to be a major problem in the future \n\nAs right now I don't see any kind of major problem in that as well to be honest.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i7u0yhh",
                            "author": "post_mortar",
                            "score": 4,
                            "created_utc": 1652039134.0,
                            "response": "Your resort to semantics expresses so much of what's wrong with your sub.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i99wdn7",
                                    "author": "xukuo000",
                                    "score": 1,
                                    "created_utc": 1653010235.0,
                                    "response": "Indeed at first we thought that this will be wrong but now we can see that it was needed\n\nAnd moreover we had to see what more we can do more clearly as well to be honest.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i7u8j76",
                                    "author": "nullc",
                                    "score": 0,
                                    "created_utc": 1652042485.0,
                                    "response": "Your sub?  you mean /r/bsvscam?  -- surely you can't mean /r/bitcoin, as I don't have anything to do with it and have only posted there very infrequently for a long time.\n\nAs far as the comment goes-- I think you have that backwards. Bitcoin's block size has increased over time, a direct contradiction of the poster's claims.  If you go through and sub in \"isn't as large as I think it should be\" in place of 1MB his argument makes no sense.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i7u8kde",
                                            "author": "sneakpeekbot",
                                            "score": 1,
                                            "created_utc": 1652042500.0,
                                            "response": "Here's a sneak peek of /r/bsvscam using the [top posts](https://np.reddit.com/r/bsvscam/top/?sort=top&t=all) of all time!\n\n\\#1: [Craig Wright cannot code C/C++ and did not write the Bitcoin code](https://twitter.com/gardling/status/1430624463704494087) | [3 comments](https://np.reddit.com/r/bsvscam/comments/poj4m9/craig_wright_cannot_code_cc_and_did_not_write_the/)  \n\\#2: [Craig Wright Plagiarized Significant Portions of His \"PhD\" Thesis and Tried to Hide It](https://medium.com/@paintedfrog/craig-wright-plagiarized-significant-portions-of-his-phd-thesis-and-tried-to-hide-it-80cd8f01459) | [1 comment](https://np.reddit.com/r/bsvscam/comments/poj0yc/craig_wright_plagiarized_significant_portions_of/)  \n\\#3: [Craig Wright’s LLM Dissertation is Full of Plagiarism](https://medium.com/@paintedfrog/craig-wrights-llm-dissertation-is-full-of-plagiarism-f21439ea8a47) | [2 comments](https://np.reddit.com/r/bsvscam/comments/poj1fs/craig_wrights_llm_dissertation_is_full_of/)\n\n----\n^^I'm ^^a ^^bot, ^^beep ^^boop ^^| ^^Downvote ^^to ^^remove ^^| ^^[Contact](https://www.reddit.com/message/compose/?to=sneakpeekbot) ^^| ^^[Info](https://np.reddit.com/r/sneakpeekbot/) ^^| ^^[Opt-out](https://np.reddit.com/r/sneakpeekbot/comments/o8wk1r/blacklist_ix/) ^^| ^^[GitHub](https://github.com/ghnr/sneakpeekbot)",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i7y26bx",
                            "author": "marzenad",
                            "score": 1,
                            "created_utc": 1652118302.0,
                            "response": "Yeah you are right about it most of them were just blown away when it started \n\nBut it is like they have been trying to work really hard to get something out of it.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i7ykfo5",
                            "author": "phro",
                            "score": 1,
                            "created_utc": 1652125748.0,
                            "response": "Oh you removed the 1MB limit with the required hardfork? How can you be backwards compatible with legacy nodes at over 1MB?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}