{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uxfu9b",
            "title": "As a Bitcoin Cash supporter, here is how I view the rise of Monero.",
            "url": "https://www.reddit.com/r/btc/comments/uxfu9b/as_a_bitcoin_cash_supporter_here_is_how_i_view/",
            "author": "LovelyDayHere",
            "created_utc": 1653480235.0,
            "score": 91,
            "num_comments": 116,
            "subreddit": "btc",
            "selftext": "I got into [Bitcoin](https://bitcoin.com/bitcoin.pdf) a number of years ago, before the block size wars, before Bitcoin Cash existed. Back when BTC could still pass as the \"peer to peer electronic cash\".\n\nI believe financial privacy is important - when someone tells you privacy is dead, they are usually ignorant about the possibilities of strong cryptography and how it protects against exploitation (by criminals, by foreign governments, even by one's own government) or they are knowingly or unknowingly assisting psychological operations intended to reduce peoples' awareness of privacy as a right and frankly, something worth having and achievable if we engage ourselves for it.\n\nSo, I do like Monero's emphasis on privacy by default, while at the same time I like Bitcoin (now Bitcoin Cash) for its default transparency and making privacy available to those who want it (through e.g. CashFusion). I know some Monero people strongly disagree and believe that privacy is not achievable through opt-in. But I think this is not a settled matter. Combinatorics and pseudonymity at large scale (millions / billions of people using Bitcoin) can make compromise of financial privacy very costly.\n\nHowever, that's not my main point here.\n\nI want to make the point that the rise of Monero is good for all of p2p electronic cash.\n\nFirstly, it proves that there is some market interest in privacy. This is encouraging. Privacy does not come for free! Work has to be done to make it happen, and that work costs money. (This is also why I'm fine with people who have privacy use cases, paying extra for those, even on BCH through layered protocols such as CashFusion, or in the future perhaps, sidechains where all transactions are private similar to Monero).\n\nSecondly, it shows that even if a p2p cash coin has dropped by a lot in the past (I read that Monero had dropped down to even 50th spot?) there is potential for the coin to rise substantially.\n\nThe higher p2p cash coins rise compared to others, the better it will be for economic freedom and human rights (incl. privacy) in the world.\n\nSo I say to the Monero community: Well done, thanks for sticking to your guns, there is a long way ahead but the Bitcoin Cash community is fighting along side you for decentralized p2p cash, with complementary features.\n\nI don't think it's a zero sum game at all.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9xe7zh",
                    "author": "jessquit",
                    "score": 75,
                    "created_utc": 1653481769.0,
                    "response": "**Nothing would make the enemies of p2p cash happier than for the Monero and BCH communities to fight each other.**",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9xgvx3",
                            "author": "LovelyDayHere",
                            "score": 24,
                            "created_utc": 1653483171.0,
                            "response": "Exactly.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia0pxke",
                                    "author": "vccsell",
                                    "score": 1,
                                    "created_utc": 1653533264.0,
                                    "response": "I dont think that it is true for monero .\n\nA lot of people don't care about privacy but care about speed and ease of use.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia0qvcr",
                                            "author": "jmtashiro",
                                            "score": 3,
                                            "created_utc": 1653533713.0,
                                            "response": "I have found monero to be fast and easy to transact, compared to BCH and BTC, with low costs compared to ETH ...",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9ygxeh",
                            "author": "junjun888",
                            "score": 1,
                            "created_utc": 1653498251.0,
                            "response": "\"We simply cannot expect any crypto to replace fiat if the privacy will end up being worse than using fiat.\"\n\nEdit: This quote is referred in article. The credits goes to the writer.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9yirda",
                                    "author": "jessquit",
                                    "score": 5,
                                    "created_utc": 1653498971.0,
                                    "response": "Using fiat online requires a KYC intermediary. Since BCH can be used P2P as cash with no intermediary it is categorically more private than any online fiat transaction.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9zbzdg",
                            "author": "spirobel",
                            "score": 1,
                            "created_utc": 1653510567.0,
                            "response": "we should unite!",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia02z18",
                                    "author": "emage_",
                                    "score": 1,
                                    "created_utc": 1653522536.0,
                                    "response": "Now that'd be a force to be reckoned with! It's a bit of a shame that we fight the same fight but not as a joined force.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia1runz",
                                            "author": "spirobel",
                                            "score": 2,
                                            "created_utc": 1653561170.0,
                                            "response": "yes. I am from the Monero community and I think bitcoin cash is great too. No need to be nasty to each other. 👍😀👍",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "ia3pk29",
                                    "author": "-TrustyDwarf-",
                                    "score": 1,
                                    "created_utc": 1653592878.0,
                                    "response": "There should be unstoppable atomic swaps between all coins (or DEXs with trustless bridges).",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9zb1ht",
                            "author": "AlbertChomskystein",
                            "score": -3,
                            "created_utc": 1653510186.0,
                            "response": "irl the dnms are already xmr-btc based tho. There's no other project with anything to offer, the game was over in 2016.\n\nLike the opinion of BCH people literally has no bearing on anything, neither does the opinion of \"the enemies of p2p cash\" lol, which I assume means law enforcement but if they could defeat xmr math it still wouldn't matter what anyone thought about it because it's a math puzzle.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia01j15",
                                    "author": "Big_Bubbler",
                                    "score": 2,
                                    "created_utc": 1653521849.0,
                                    "response": "Law enforcement likes following cryto trails. They may not like Monero unless they have a secret way to follow it? The enemies of p2p cash are mosly bigger fish than law enforcement.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia1nna2",
                                            "author": "AlbertChomskystein",
                                            "score": 1,
                                            "created_utc": 1653557658.0,
                                            "response": "How are these /r/conspiracy greater enemies planning on stopping me running bittorrent on my pc? Sorry I mean stop me running crypto on my pc.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9y7vzc",
                    "author": "anon-cypher",
                    "score": 31,
                    "created_utc": 1653494742.0,
                    "response": "I am mostly a monero guy, but always have a deep respect about bch community.\n\nI must say, I am impressed reading this thread. Fighting for p2p crash is the goal.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9z5e08",
                            "author": "54545455455555",
                            "score": 7,
                            "created_utc": 1653507909.0,
                            "response": "I'm with you. I was mainly in XMR but now slightly more BCH.\n\nI really don't care which \"wins\" just hope they keep working like they are working. Also, the two best communities aside from ETH guys.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9xpwam",
                    "author": "imperator285",
                    "score": 8,
                    "created_utc": 1653487415.0,
                    "response": "Many of us are rooting for bch to succeed, at least against everyone but Monero lol",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia15nha",
                            "author": "CynogRhys",
                            "score": -1,
                            "created_utc": 1653542575.0,
                            "response": "Not understanding a thing doesnt mean that thing isnt useful .",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9yq9tg",
                    "author": "WippleDippleDoo",
                    "score": 9,
                    "created_utc": 1653501898.0,
                    "response": "Monero and BitcoinCash are complementary.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9xy6qj",
                    "author": "wildlight",
                    "score": 6,
                    "created_utc": 1653490879.0,
                    "response": "while I would say Ive always been primarily a Bitcoin/BCH supporter. Monero is closely aligned with the objectives of BCH. ultimately the market decides and the major point of both BCH and monero communities is to promote education about using crypto currencies. if the ones being used and adopted by people have soild fundimentals that can be the foundation of a decentalized cryptocurrency then we are winning.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9y0ncr",
                    "author": "Cheesebaron",
                    "score": 19,
                    "created_utc": 1653491883.0,
                    "response": "BCH and XMR honestly both belong in the top 10, maybe even top 5. They are true crypto currencies that tackle real world use.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9y9chu",
                            "author": "knowbodynows",
                            "score": 16,
                            "created_utc": 1653495316.0,
                            "response": "They are in the top 5, just not in the \"market cap\" metric.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9z2af0",
                                    "author": "alvvayson",
                                    "score": 4,
                                    "created_utc": 1653506657.0,
                                    "response": "Which is exactly why flipping BCH is such an important metric for us Monero enthousiasts.\n\nIt's like winning in a friendly competition against an opponent you actually respect.\n\nA lot of the top market cap coins are more like pumped up penny stocks.\n\nThe competition of XMR with BTC, ETH, LTC, BCH is the big boy league of serious crypto coins that I respect and actually own.\n\nYeah, I want XMR to flip BTC some day and I believe it could eventually happen (though not terribly likely).",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia26sez",
                                            "author": "onemoneroisonemonero",
                                            "score": 3,
                                            "created_utc": 1653570331.0,
                                            "response": "Wait why would you own LTC?",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "ia13ks9",
                            "author": "QuickBASIC",
                            "score": 1,
                            "created_utc": 1653541127.0,
                            "response": "They are #5 and #6 if you only look at \"real\" crypto (PoW).\n\nhttps://messari.io/screener/proof-of-work-coins-24011179",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9y2omp",
                    "author": "ShadowOrson",
                    "score": 5,
                    "created_utc": 1653492699.0,
                    "response": "This comment in not meant specifically for you, but for those that are familiar with Monero.\n\nI try to stay away from the Monero conversation because I just do not know enough about it to say anything intelligent.\n\nI do have questions though:\n\n(1) Does Monero have SPV like wallets?\n\n(2) Can I convert BCH to Monero without having to use a centralized service?\n\n(3) Can I convert my Monero to BCH without having to use a centralized service?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9y6a0e",
                            "author": "CorgiDad",
                            "score": 4,
                            "created_utc": 1653494113.0,
                            "response": "> (1) Does Monero have SPV like wallets?\n> \n\nThere are light wallets and remote node connecting wallets that allow this same functionality.  \n> (2) Can I convert BCH to Monero without having to use a centralized service?\n> \n\nAtomic swaps for BCH are in the works!  The eth-xmr atomic swap protocol just went to stagenet, and the btc-xmr atomic swap protocol is live!\n> (3) Can I convert my Monero to BCH without having to use a centralized service?\n\nSee above!  It goes both ways.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9ymgj2",
                                    "author": "jessquit",
                                    "score": 5,
                                    "created_utc": 1653500406.0,
                                    "response": "\n>There are light wallets and remote node connecting wallets that allow this same functionality.  \n\nThe light wallets are pruned full nodes. The remote node connecting wallets are basically the same thing as the Bitcoin.com wallet. Monero does not have true SPV functionality. It's not the same functionality.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9yplqb",
                                            "author": "CorgiDad",
                                            "score": 3,
                                            "created_utc": 1653501635.0,
                                            "response": "The goal is lightweight mobile phone compatible wallets that can confirm transactions near instantly, right?  \n\nWell, we have some.  But yeah, it's not \"the same\".  SPV solutions have compromises for certain aspects of privacy/security, and you know how little Monero likes to compromise on those fronts.  \n\nMymonero is closest, but you have to hand over your viewkey to the server so it can scan the chain for you. Your own wallet then uses your spend key to check if they have been spent or not.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i9yq8xw",
                                            "author": "WowDough",
                                            "score": 0,
                                            "created_utc": 1653501888.0,
                                            "response": "Monero light wallets still have to download the whole blockchain (from when the wallet was made) to scan for its transactions, but it's definitely not its own full node. A pruned full node still stores parts of every transaction",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9z48t2",
                                                    "author": "psiconautasmart",
                                                    "score": 3,
                                                    "created_utc": 1653507455.0,
                                                    "response": "No, nodes download the blockchain and check for txs related to the wallet demanding the info. The blockchain is NOT downloaded to you cellphone.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9zkyc8",
                                                            "author": "WowDough",
                                                            "score": 1,
                                                            "created_utc": 1653514336.0,
                                                            "response": "Unless you're talking about something like MyMonero that gives up the view keys of the wallet to the node, your wallet does have to download all transactions since last sync to scan for the ones it's involved with. It discards the ones it's not.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "ia2n3ny",
                                                                    "author": "psiconautasmart",
                                                                    "score": 1,
                                                                    "created_utc": 1653577446.0,
                                                                    "response": "The node does.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "ia3ujci",
                                                                            "author": "WowDough",
                                                                            "score": 0,
                                                                            "created_utc": 1653594943.0,
                                                                            "response": "The node doesn't know anything about your wallet (other than potentially the last time it was online, going off the blocks you're requesting)",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i9yrb6e",
                                    "author": "knowbodynows",
                                    "score": 3,
                                    "created_utc": 1653502306.0,
                                    "response": "Where does one try the new live btc-xmr protocol? Xmr.to is closed. Does this replace the need for it?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9zbtq6",
                                            "author": "Jpotter145",
                                            "score": 2,
                                            "created_utc": 1653510503.0,
                                            "response": "Here is a good place to start:\n\n[https://sethforprivacy.com/guides/bitcoin-monero-atomic-swaps/](https://sethforprivacy.com/guides/bitcoin-monero-atomic-swaps/)",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9yqm21",
                                    "author": "WippleDippleDoo",
                                    "score": 4,
                                    "created_utc": 1653502031.0,
                                    "response": "I like and use both networks, but BCH UX is a lot better than monero.\n\nMonero will never do reliable 0conf and not sure if its wallets will be ever as good as Bch wallets.\n\nThe biggest issue with bch is that its community sucks at expanding its network effect.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9y83ep",
                                    "author": "ShadowOrson",
                                    "score": 1,
                                    "created_utc": 1653494822.0,
                                    "response": "\n\n>> (2) Can I convert BCH to Monero without having to use a centralized service?\n\n> Atomic swaps for BCH are in the works! The eth-xmr atomic swap protocol just went to stagenet, and the btc-xmr atomic swap protocol is live!\n\n<SMH>\n\nThanks for letting me that the answer to my question is \"**No.**\"",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9y8x4p",
                                            "author": "CorgiDad",
                                            "score": 4,
                                            "created_utc": 1653495147.0,
                                            "response": "There are other decentralized services to swap.  I just haven't used them.  Cakewallet is one.  So the answer is \"Yes, but something even better and more decentralized is coming soon\"",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9yd2qg",
                                                    "author": "LovelyDayHere",
                                                    "score": 1,
                                                    "created_utc": 1653496765.0,
                                                    "response": "Not sure, but maybe you know - I thought AtomicDEX can also swap between XMR and other coins (incl. BCH)",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i9yp17n",
                                                    "author": "ShadowOrson",
                                                    "score": 1,
                                                    "created_utc": 1653501412.0,
                                                    "response": "> Cakewallet is one.\n\nI appreciate you providing this information. Unfortunately I would deem Cake Wallet as a \"centralized service\". \n\nI hope someone with more knowledge will be able to answer the question I asked.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9ytn68",
                                                            "author": "tl121",
                                                            "score": 2,
                                                            "created_utc": 1653503220.0,
                                                            "response": "Cakewallet requires a Monero node.  It is possible to configure Cakewallet on your mobile device to use a Monero node that you run on a server node at home.  This should give you the full extent of Monero privacy and security.\n\nI don’t yet fully understand the XMR protocol and cryptography, so I can’t comment on trust and privacy issues when running with untrusted servers.  It does appear that there will be no way to implement 0-conf on XMR.  It also appears that processing an XMR transaction uses more than 10 times the network, processing and storage resources as a similar BCH transaction.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9yv2b7",
                                                                    "author": "ShadowOrson",
                                                                    "score": 1,
                                                                    "created_utc": 1653503777.0,
                                                                    "response": "ok... ... ...\n\nI would still consider the \"exchange\" feature a \"centralized service\".\n\nEdit: GRRR!!! you edited while I was trying to respond in a \"don't bite his head off\" manner.\n\nThe intent of my original question was to determine if there was the ability to convert BCH to XMR (directly) without using a centralized service. I already knew that converting BCH to XMR using a centralized service was possible. Cake Wallet seems to be a centralized services, and a fairly opaque one, but I have not spent more than a few minutes investigating it either; so I could be wrong.\n\nI know very little about Monero. I have nothing against it, and if it is as private as it claims to be, I would actually like to learn more. I'm just really lazy right now since I want to go to sleep.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9yj352",
                    "author": "mred_btce",
                    "score": 5,
                    "created_utc": 1653499098.0,
                    "response": "Why did the government put a bounty in cracking monero?\n\nBecause with all the resources in the world they couldn't do it themselves.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9zevp1",
                    "author": "knowbodynows",
                    "score": 5,
                    "created_utc": 1653511760.0,
                    "response": "I've noticed xmr on a slow steady climb (the best kind) since invasion of Ukraine. Easy to see. In this time period this slow linear growth (in USD) is significantly more detached from the broader crypto market cap than the few coins I care to follow. I get a feeling like it could become a sudden \"newest secret\" to take investment away from btc, just as eth suddenly became a darling alternative for white collar traders who don't understand the tech but do understand trading and like to sound ahead of the pack during lunch hour.\n\nI had a successful professional painter (oil) tell me to buy eth two years ago. It was just a rumor in the city. And we see what happened. Eth became the choice btc diversification coin for those too afraid to go deeper but still wanting an edge. Smells like maybe same could be happening to Monero. The tantalizing absence on many exchanges, the silent marketing, the dnm-level privacy... Perhaps Monero will be the gateway drug to appreciating even more powerful p2p sound money such a BCH.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9xw1nn",
                    "author": "xjunda",
                    "score": 14,
                    "created_utc": 1653490009.0,
                    "response": "Yes, happy to see Monero doing well.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9xe6q2",
                    "author": "UcharsiU",
                    "score": 12,
                    "created_utc": 1653481749.0,
                    "response": "If you look at it from the point of view of competition between crypto, you might not be happy with monero rise as a bitcoin cash supporter.\n\nBut, if you don't like that crypto in general is being perceived and used as a speculation, holding or investment, you should be very happy with rise of monero.\n\nIt looks like there is a struggle. Is the crypto something to use or something to hold and wait for a better price?\n\nThat's the beginning of something bigger that I don't feel knowledgeable enough to talk in great depth, but bitcoin cash and monero are part of \"use it\" movement which might have a future.\n\nHolding mentality brings scams and a ponzi scheme vibe in general.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9xpxei",
                            "author": "TheSupremist",
                            "score": 7,
                            "created_utc": 1653487428.0,
                            "response": "> It looks like there is a struggle. Is the crypto something to use or something to hold and wait for a better price?\n\nThe funny part is this struggle never existed. It's just part of the gov-bank-Blockstream coalition's snake oil marketing and divide and conquer tactics since the hard fork happened. \"Treat it as anything but what it was invented to be\". People are just slowly waking up to that farce they've bought for a decade or so now. I see this \"artificial animosity\" between BCH and XMR as a desperate attempt to stop the card castle from falling, but it's too late to do anything now.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9y9930",
                                    "author": "caron75",
                                    "score": 7,
                                    "created_utc": 1653495279.0,
                                    "response": "Good that our community is more idealistic driven than cash driven like other projects.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9ygc17",
                                            "author": "TheSupremist",
                                            "score": 6,
                                            "created_utc": 1653498021.0,
                                            "response": "Being use-case-centric goes a long way.\n\nI used to be kinda indifferent to Monero in the past - mostly because crypto was still a fairly new thing when I found out about it. But once it clicked in my head cryptos are just like Linux distros (each one has its intended use case and everyone can sort of co-exist anyway), and once I decided to actually have a read on what Monero does differently, I gradually warmed up to it.\n\nStill sucks a bit that (AFAIK) you have to use a full node if you want to use Monero \"as intended\", given I prefer using lightweight wallets like Electrum and Electron Cash (probably that vision may still be lack of information from my part, not too long ago I learned block pruning was a thing...). But looking nowadays I really only see 3 cryptos that stick to this use-case-centric approach and are \"working as intended\" - Bitcoin Cash, Monero, and Avalanche (I don't trust it fully like I do BCH due to it being proof-of-stake, *but* the few transactions I did with it a while ago were actually really fast and cheaper than ETH, so I guess it is indeed delivering on some of its promises for now, just needs some more battle testing).",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9y5tcq",
                            "author": "CorgiDad",
                            "score": 7,
                            "created_utc": 1653493931.0,
                            "response": "> It looks like there is a struggle. Is the crypto something to use or something to hold and wait for a better price?\n\nThe bitcoin whitepaper spells this out.  The goal is functional currency.  Usage as currency begets value.  \n\nOf what use is a store of value that cannot be exchanged?  None.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9ya2sm",
                            "author": "coyotemachines",
                            "score": 2,
                            "created_utc": 1653495603.0,
                            "response": "PoS is removing the most important thing from cryptocurreny - permisionless system.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9yqewd",
                                    "author": "UcharsiU",
                                    "score": 0,
                                    "created_utc": 1653501952.0,
                                    "response": "That is not true.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9z7uix",
                                            "author": "LovelyDayHere",
                                            "score": 1,
                                            "created_utc": 1653508893.0,
                                            "response": "How isn't it?\n\nIf the ones owning the coins don't want to sell them to you, you got NO STAKE in a pos system.\n\nIn a pow system, you at least have the alternative of earning coins by \"mining\" (better call it: transaction processing) without needing to own the coins to get started.\n\nThat is raw permissionlessness which will keep pushing decentralization and also diffusing the wealth.\n\nCoin holders have an additional veto against centralization here because they can change the POW to topple a misbehaving mining class.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia4yieo",
                                                    "author": "LIGHTLY_SEARED_ANUS",
                                                    "score": 1,
                                                    "created_utc": 1653613205.0,
                                                    "response": "Dude, what??\n\nA) Coin holders don't have any veto against anything. If they did, that would be a stake-based consensus method, i.e. proof of stake. Miners are the only ones with 'veto' power, since they're the only ones validating the chain.\n\nB) If coin holders have veto power to \"topple a misbehaving mining class\", then your whole argument of \"it's permissionless cuz you can mine it\" is null and void; you'd need the coin holders' permission to mine, lest they topple you for misbehaving.\n\nC) Even in a pure PoW system, your ability to get access to coins is limited by your access to cash to buy mining hardware with, which centralises tokens around the wealthy, which is literally the exact problem you have with proof of stake.\n\nD) I know I'm not going to convince you of anything, but literally NONE of what you just said adds up. At all.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9ycpuu",
                    "author": "gotamd",
                    "score": 13,
                    "created_utc": 1653496622.0,
                    "response": "I think Monero is great and complementary to BCH. BCH is better for quick and easy transacting while Monero is better for privacy. Most people have needs for both at different times. I'd love to see decentralized cross-chain swaps between BCH and Monero.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9y7zbv",
                    "author": "KallistiOW",
                    "score": 12,
                    "created_utc": 1653494778.0,
                    "response": "BCH 🤝 XMR\n\nBCH: Light Mode\n\nXMR: Dark Mode",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9yeftk",
                    "author": "rshap1",
                    "score": 8,
                    "created_utc": 1653497291.0,
                    "response": "I couldn't agree more.\nBoth coins have different use cases and I think they're both necessary. Everyone in crypto should ensure that Monero succeeds but that also doesn't mean it's my primary first choice for everyday peer to peer cash",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9yg22o",
                            "author": "-ism-isa-con",
                            "score": 9,
                            "created_utc": 1653497915.0,
                            "response": "I've noticed a lot of Monero users are also Bitcoin Cash users, and vice versa.  Seems like the projects are complementary.  I'm going to spend some more time looking into Monero.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9z0ppp",
                    "author": "abiola2us",
                    "score": 3,
                    "created_utc": 1653506023.0,
                    "response": "XMR is a meh hold right now if you're someone who wants short term gains. \n\nI think it's going to be one of the best 5+ year holds there is.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9zyocj",
                    "author": "beaubeautastic",
                    "score": 3,
                    "created_utc": 1653520501.0,
                    "response": "bch has always been my goto when something doesnt take monero. gotta love them low fees",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia1x55k",
                    "author": "ojdidntdoit4",
                    "score": 3,
                    "created_utc": 1653564899.0,
                    "response": "i’m pretty much a bitcoin maximalist and i support monero too. the unlimited supply cap means it wont be a threat or enemy to bitcoin. for that reason i wouldn’t hold any as a speculative ngu investment but it still has more utility than any altcoin ive seen before. completely private transactions are more important than defi nft’s and staking combined. if you’re planning on spending your bitcoin regardless, there’s nothing wrong with swapping it to xmr before your purchase to gain or keep your privacy. it’s what i do when i need to buy… stuff that i probably shouldn’t… because coin joins are too impractical for me and i also just don’t trust the liquid networks anonymity promise.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9xc5us",
                    "author": "Bagatell_",
                    "score": 6,
                    "created_utc": 1653480617.0,
                    "response": "> I don't think it's a zero sum game at all.\n\nI doubt the central banksters think that.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9xccpb",
                            "author": "LovelyDayHere",
                            "score": 9,
                            "created_utc": 1653480726.0,
                            "response": "I'm talking about competition among cryptocurrencies that have some overlap but also unique selling points.\n\nLike BCH and XMR.\n\n> I doubt the central banksters think that.\n\nTo the extent that they'd like to force us all into centralized systems under their control, I agree...\n\nThey will want to crush all cryptocurrencies.\n\nIn that sense, I am wary of what can be pumps to capitalize on FOMO, then hard dumps to destroy confidence.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9zukv0",
                                    "author": "Elliotben",
                                    "score": 1,
                                    "created_utc": 1653518591.0,
                                    "response": "Thank you for justifying my investment.\n\nThis whole post is just the confirmation bias I needed .",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9zv0gh",
                            "author": "vela0alev",
                            "score": 2,
                            "created_utc": 1653518791.0,
                            "response": "It's in everyone's best interest that privacy coins survive and thrive.\n\nbecause they are a freedom statement.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9xidfo",
                    "author": "BewareOfShills",
                    "score": 8,
                    "created_utc": 1653483911.0,
                    "response": "I don't care about Monero rising, there are ~20 other coins that have little more to offer than hype in front of BCH.\n\n>Firstly, it proves that there is some market interest in privacy.\n\nDoubt, this rise it not caused by adoption. The whole market is still just speculation",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9y20r3",
                            "author": "Twoehy",
                            "score": 8,
                            "created_utc": 1653492432.0,
                            "response": "But now they’re speculating that privacy actually matters",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9y8ac9",
                                    "author": "BewareOfShills",
                                    "score": 3,
                                    "created_utc": 1653494897.0,
                                    "response": "And forget that BCH has privacy too.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9y5mvd",
                            "author": "CorgiDad",
                            "score": 3,
                            "created_utc": 1653493861.0,
                            "response": "> Doubt, this rise it not caused by adoption.\n\norly?  https://bitinfocharts.com/comparison/monero-transactions.html#alltime",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9y86hx",
                                    "author": "BewareOfShills",
                                    "score": 5,
                                    "created_utc": 1653494855.0,
                                    "response": "https://bitinfocharts.com/comparison/transactions-xmr-bch.html#alltime",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9y8sa0",
                                            "author": "CorgiDad",
                                            "score": 1,
                                            "created_utc": 1653495094.0,
                                            "response": "I was gonna post that, but the spikes make it pretty r/dataisuglyasfuck.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9yx5u1",
                                                    "author": "BewareOfShills",
                                                    "score": 1,
                                                    "created_utc": 1653504599.0,
                                                    "response": "Missing the point, that BCH has more transactions and moneros transaction haven't increased compared to other coins. Therefore making my point, that this price rise is not caused by adoption.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9zg2v1",
                                                            "author": "CorgiDad",
                                                            "score": 2,
                                                            "created_utc": 1653512262.0,
                                                            "response": "But...transactions are increasing over time.  The trend is clear. Which means adoption and usage...what on earth are you on about.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9zhrph",
                                                                    "author": "BewareOfShills",
                                                                    "score": 1,
                                                                    "created_utc": 1653512967.0,
                                                                    "response": "It doesn't correlate and isn't anything extra compared to other coins.\n\nThere are much bigger jumps on BCH and they also don't correlate with price action.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9zi3ow",
                                                                            "author": "CorgiDad",
                                                                            "score": 2,
                                                                            "created_utc": 1653513110.0,
                                                                            "response": "Alright man, you think what you will. The adoption of monero is on a clear uptrend by any metric. \n\nPerhaps the conclusion you should draw is that price action isn't a 1:1 correlation with usage.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "ia59oa1",
                                                            "author": "ozkraut",
                                                            "score": 0,
                                                            "created_utc": 1653618646.0,
                                                            "response": ">Cash\n\nhttps://bitinfocharts.com/comparison/monero-transactions.html#alltime",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9zpckh",
                            "author": "marshall_mmx",
                            "score": 3,
                            "created_utc": 1653516239.0,
                            "response": "Everyone should hold at least a bit of XMR in their portfolio in order to support the project and general concept behind it.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9xx35t",
                    "author": "PanneKopp",
                    "score": 2,
                    "created_utc": 1653490432.0,
                    "response": "So you are an ole darknet user dealing P2P ?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia0123a",
                    "author": "Big_Bubbler",
                    "score": 2,
                    "created_utc": 1653521624.0,
                    "response": "Well Said!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia1q6c2",
                    "author": "Nervous_Key_4158",
                    "score": 2,
                    "created_utc": 1653559819.0,
                    "response": "I'm a fan of both, admittedly i think Monero has done a better job when it comes to what Satoshi dreamed BTC will be. To me these two projects are like step brothers. I'd always hold both along with shiryo.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia0getm",
                    "author": "thethrowaccount21",
                    "score": 1,
                    "created_utc": 1653528800.0,
                    "response": "Monero is a scam. It doesn't actually work. The monero community is also manipulating the price of cryptocurrencies so that Monero looks larger and bigger than its competition. Cryptocurrency prices are easy to manipulate, especially monero since its only on a few exchanges. Exchanges are centralized websites that don't actually provide the true market price that the holders of coins are trading at.\n\nInstead, the provide the last \"spot price\". Market cap rankings are also manipulated to make certain coins look larger than others. This is likely accomplished by Tether and BTC pairings. Look, Monero has infinite inflation, its privacy doesn't work [Monero Privacy Protections Aren't as Strong as They Seem | WIRED](https://www.wired.com/story/monero-privacy/), and the community is heavily astroturfed.\n\nMonero doesn't have any real adoption or acceptance anywhere, not even darknet markets. Btc, Bitcoin Cash and Eth all have higher adoption on DNMs than monero does. The problem is that someone is interested in manipulating cryptocurrency markets to prevent truly effective cryptocurrencies from rising to the front, and they're spending a lot of money to manipulate the ranks and cheat for monero and BTC, and to a lesser degree Litecoin, so that you can be marshalled back into their clutches. Cryptocurrency prices have not reflected the true market since roughly 2018-2019. The Monero community also manipulates fair value to make it look larger than it really is.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia2c18d",
                            "author": "onemoneroisonemonero",
                            "score": 3,
                            "created_utc": 1653572786.0,
                            "response": "This is so wrong and delusional I'm not even sure where to begin. Touch some grass friend.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia2ckte",
                                    "author": "thethrowaccount21",
                                    "score": -2,
                                    "created_utc": 1653573023.0,
                                    "response": "No, stop lying to people to try and sell them bullshit. We're not friends, I don't have any scammers as friends. Everything I wrote is true and sourced, you're the one who's wrong and delusional.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "ia59wzc",
                            "author": "ozkraut",
                            "score": 1,
                            "created_utc": 1653618769.0,
                            "response": "Lol. Trying to buy lower eh?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9z1yuo",
                    "author": "TinosNitso",
                    "score": -2,
                    "created_utc": 1653506526.0,
                    "response": "What I'd like to see is actually like an \"attack\" on XMR where we have a tracer website dedicated to tracing its transactions. Basically, [blockchain.info](https://blockchain.info) combined with [xmrchain.net](https://xmrchain.net). For example, we should be able to **search for stealth addresses** in the blockchain. Also, the explorer could send us email notifications when an output is spent. If only devs had an infinite amount of time!\n\nThe thing I like about XMR, from an academic standpoint, are the hidden amounts (Pedersen commitments). **Combined** with coin-join, hiding amounts is powerful, since a $million is indistinguishable from $1. It theoretically enables mixing a wider range of amounts, compared to CashFusion.\n\nBoth BCH & XMR have the same txn volume over like the last few days: **0.3 TPS**.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9zp4uo",
                            "author": "SomeAncap2020",
                            "score": 5,
                            "created_utc": 1653516143.0,
                            "response": ">What I'd like to see is actually like an \"attack\" on XMR where we have a tracer website dedicated to tracing its transactions. Basically, blockchain.info combined with xmrchain.net. For example, we should be able to search for stealth addresses in the blockchain. Also, the explorer could send us email notifications when an output is spent.\n\nGood luck with that. Genuine question, do you not know how Monero works?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia0h483",
                                    "author": "thethrowaccount21",
                                    "score": 1,
                                    "created_utc": 1653529124.0,
                                    "response": "Monero's privacy has been broken for years.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia0w8d4",
                                            "author": "SomeAncap2020",
                                            "score": 3,
                                            "created_utc": 1653536537.0,
                                            "response": "Right, sure it has. Now, before you spout your bullshit:\n\n>Ciphertrace Announces Enhanced Monero Tracing Capabilities for Governments\n\nYes, Ciphertrace has indeed claimed to be capable of tracing Monero. A different few times, actually, in the last few years. All of which have been fruitless, and have had literally 0 proof supporting any of them besides them claiming to be able to do so. \n\nThe company also stated that their supposedly-functional tracing method is probabilistic. They watch for any new transactions which select a \"marked\" ring member, and then watch for any transactions which select those ones, and so on. This can be used to construct a \"tree\" of theoretical destinations. The issue is, this doesn't work at all, because the probabilities dissolve to sub 0.1% levels within a few hours of transactions (and continue to fall forever) and there's no way to know if or when a marked output has been spent. This is not a novel idea, and has been known since day 1. The MRL has actually done a good amount of work on researching and discussing this, and not only intuitively but even more so as demonstrated by them, this method is completely incapable of tracing anything.\n\n>Most Monero transactions made prior to February 2017 are traceable.\n\nI find it odd that you aren't linking to the actual report here, because there was an actual paper written on this, not just some random site online. But anyway, yes, Monero used to have quite broken privacy. Allowing low/0-mixin inputs revealed the true spend on many many outputs, which led to an unintentional chain reaction attack. The introduction of RingCT and mandatory mixins prevented people from using low/0-mixins, and also fixed other issues related to that which I'm not going to get into here. Hence the issue was resolved.\n\nWhy weren't mandatory mixins in place since day 1? I don't know, but they clearly should have been. Optional privacy, especially when the protocol relies on the set of all outputs, was a garbage system that shouldn't have been used in the first place.\n\n>Monero's main selling point is privacy. That promise doesn't work, 'cause there are several ways to track it. Did you use Monero yesterday? If so, check the list below, you might be on it.\n\nLol, this one isn't helping your case at all. If you're going to spread bullshit lies, then at least do it properly. The guy who made this is a well-known fraud (not only due to this but just in general) and the site is hilariously bad. IPs were pulled from whichever node the hostile node received the tx from as it was being propagated through the network (which iirc hilariously also included some Tor exit nodes), which is completely worthless. Then he made up some random \"porn preference\", and posted it. It's a self-parody of Monero FUD.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia2cgrw",
                                                    "author": "thethrowaccount21",
                                                    "score": 1,
                                                    "created_utc": 1653572975.0,
                                                    "response": ">Right, sure it has. Now, before you spout your bullshit:\n\nIt has. Several sources have proven this. You call it bullshit because you are ideologically and emotionally attached to your bags, which is a no-no in crypto.\n\n>Yes, Ciphertrace has indeed claimed to be capable of tracing Monero.\n\nSo why are you calling it bullshit? You are not mentally stable. You admit something is true that you claim is \"bullshit\" a sentence before, which means nobody should take you seriously.\n\n>All of which have been fruitless, and have had literally 0 proof supporting any of them besides them claiming to be able to do so. \n\nWhere is your evidence? You're just claiming this because you're emotionally attached to monero. But we're not here to support your bags and you have no right to counter my evidence with your speculation. Knock it off!\n\n>The company also stated that their supposedly-functional tracing method is probabilistic. \n\nThis is a monero red-herring. Everything in the world barring a few things is probabilistic. When you work in code there's always a probability that something can go wrong. If you're working on crucial software that probability needs to be taken into account. Saying something is \"probabilistic\" doesn't mean \"not true\" or \"not determinable\".\n\n> The issue is, this doesn't work at all, because the probabilities dissolve to sub 0.1% levels \n\nThis is wrong. For example, from 2014 to at 2017 the probabilty of tracing Monero transactions was 90% for ring sizes > 0. For ring sizes = 0 it was 100%! The VAST majority of Monero's transactions in its first three years were TRACEABLE. After they \"fixed\" the issues, which fluffypony is quoted to have said really couldn't be fixed, the probability went to 45%, then 23% and further based on the number of other decoys. Right now that number is 10 and there is a significant non-zero percent\nchance that your transaction can be identified. There were at least three sidechannel attacks that nearly guaranteed Monero could be traced. \n\n>This is not a novel idea, and has been known since day 1.\n\nBeing \"known\" is not the same thing as being mitigated and its completely dishonest for you to write that. \n\n>The MRL has actually done a good amount of work on researching and discussing this, and not only intuitively but even more so as demonstrated by them, this method is completely incapable of tracing anything.\n\nDiscussing something and researching on it is not the same thing as stopping it from happening. And you're wrong, these transactions are easily traceable. This is why ciphertrace claims they can trace monero transactions, because THEY CAN.\n\n>I find it odd that you aren't linking to the actual report here\n\nWhy? Everyone knows about it, you can just google it. \n\n>But anyway, yes, Monero used to have quite broken privacy.\n\nOkay so why do you think you can get away with calling my post \"bullshit\" above you scammer? You just admitted that everything I said is true. This is why I can't stand your community, you're all a bunch of slimy word-playing liars! This one sentence is ALL YOU NEED to stay away from Monero. Privacy is important and NO OTHER COIN has been broken as much privacy-wise as Monero. Although ZCash has had some breaks, at least their attempts to fix their privacy actually did the job. Their anon-set is over 4 billion. Monero's is only 10 which makes all these traces WAY MORE VIABLE.\n\n>Allowing low/0-mixin inputs revealed the true spend on many many outputs, which led to an unintentional chain reaction attack.\n\nMISLEADING. 0-mixin outputs were EXCLUDED from the report because they were completely easy to trace.  EVEN with 10 mixins the probability of determining a the source of the transaction was 60%!!! That is STUPENDOUSLY HIGH for a privacy coin and much higher than ANY OTHER privacy option! You shame yourself for so aggressively defending a scam.\n\n>Hence the issue was resolved.\n\nThe issue was NOT resolved, it was only fixed A LITTLE. The probability went from 90% traceable to around 45% using timing attacks. Fluffypony is ON RECORD ADMITTING that \"this isn't a problem you can solve by just pecking away at it\". And most recently the OSPEAD attack proves once again that monero's privacy is completely broken. The details of this attack were released earlier this year and have of course functioned since Monero began. But they also make tracing monero transactions possible, SO YOU SHOULD STOP LYING!\n\n>Why weren't mandatory mixins in place since day 1? \n\nMandatory mixins is not the issue, Monero's privacy was broken even up to 10 mixins with a greater than 50% chance of guessing the correct spend!\n\n>Lol, this one isn't helping your case at all. \n\nYou're just saying that, but you're the one spewing bullshit here. You call my post \"bullshit lies\" then admit to EVERYTHING I SAID. That makes you a LIAR and A SCAMMER! Nothing I've written is false, you are the one spewing bullshit here.\n\n>The guy who made this is a well-known fraud \n\nNo, your community calls him a fraud but you're just a community of LIARS! He correctly proved that monero is still traceable and there are quite a few ways in fact. So you bribing communities to pal-around with to make it seem like you have organic support across the board WON'T HELP YOU!\n\n>which is completely worthless\n\nAny attack that links personal information, like IP addresses is NOT worthless. And this isn't the only attack that works on monero. If you combine any two attacks like this and say the OSPEAD attack you have IDENTIFYING INFORMATION!\n\nThere was a bug in Monero that wasn't fixed until sept 2020 IIRC. That bug allowed you to CORRECTLY IDENTIFY ANYONE WHO RECEIVED MONERO!!! You are a LIAR, A BULLSHIT ARTIST AND A SCAMMING ASSHOLE!",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "ia482zk",
                                                            "author": "SomeAncap2020",
                                                            "score": 2,
                                                            "created_utc": 1653600738.0,
                                                            "response": ">So why are you calling it bullshit? You are not mentally stable. You admit something is true that you claim is \"bullshit\" a sentence before, which means nobody should take you seriously. Where is your evidence? You're just claiming this because you're emotionally attached to monero. But we're not here to support your bags and you have no right to counter my evidence with your speculation. Knock it off!\n\nSo when someone claims something you just automatically believe that they're telling the truth? Alright, I'm Satoshi, and I need you to donate 10 BTC to me please.\n\nAnd why is it on me to prove that they're lying, when they're the one making the claim? Look up Russell's Teapot.\n\nAnother thing, it's funny to me that *you're* accusing *me* of being emotionally invested in Monero, when you're the one who's losing your shit by SCREAMING IN ALL CAPS, and regurgitating tired old FUD parrot points in a desperate reach to discredit Monero.\n\n>This is wrong. For example, from 2014 to at 2017 the probabilty of tracing Monero transactions was 90% for ring sizes > 0. For ring sizes = 0 it was 100%! The VAST majority of Monero's transactions in its first three years were TRACEABLE\n\nYes, and I directly said, personally, that Monero used to be mostly shit during this time period. So why are you going back to it when we're talking about right now? Also ringsizes of 0 don't exist but ok lol. I think you mean 0-mixins, ringsize 1?\n\n>Okay so why do you think you can get away with calling my post \"bullshit\" above you scammer? You just admitted that everything I said is true.\n\nNo, I said that Monero was broken in the past. It is not anymore. Stop twisting my words. I can't tell if you're doing this on purpose or if you're just an idiot. This is not a hard concept.\n\n>Although ZCash has had some breaks, at least their attempts to fix their privacy actually did the job. Their anon-set is over 4 billion. Monero's is only 10 which makes all these traces WAY MORE VIABLE.\n\nThat's not how anon sets work. First of all, Zcash is way below 4 billion, it is equal to the number of all shielded outputs (until if/when there are 4 billion of those, which will not be for an extremely long time, if at all). Second, ringsize is not the anon set in Monero. Monero's anon set is not a static number, but it is far far larger than 11. The anon set functions similarly to Whirlpool Coinjoin (but with differences and improvements), and that is a good starting resource if you're interested in actually understanding how it works.\n\n>MISLEADING. 0-mixin outputs were EXCLUDED from the report because they were completely easy to trace. EVEN with 10 mixins the probability of determining a the source of the transaction was 60%!!! That is STUPENDOUSLY HIGH for a privacy coin and much higher than ANY OTHER privacy option! You shame yourself for so aggressively defending a scam.\n\nThat's not what I'm talking about. So imagine you have 2 transactions, one with a single ring member, TXO1, and another with 2, TXO1 & TXO2. Since TXO1 was known to be spent in the first tx, it can be eliminated from the second. Therefore, TXO2 has been spent. This is a small scale example, but rinse and repeat over the course of thousands of transactions. And I'm not making this up, if you don't believe me then read the paper yourself.\n\n>Any attack that links personal information, like IP addresses is NOT worthless. And this isn't the only attack that works on monero. If you combine any two attacks like this and say the OSPEAD attack you have IDENTIFYING INFORMATION!\n\nI don't think you're understanding what I'm saying. He did not extract the tx's origin IP. Not even the node which the user was connected to. He monitored for transactions being transmitted from (not *sent from*, or *originated from*) *the peers of his node* while the transaction was being broadcasted through the network.\n\nAlso, I'd love to know how exactly you'd imagine that this \"vulnerability\" could be solved. Can't use Tor, because by your measure, knowing the exit node is TMI. Similar issue with I2P. Quantum teleportation, maybe?\n\n>There was a bug in Monero that wasn't fixed until sept 2020 IIRC. That bug allowed you to CORRECTLY IDENTIFY ANYONE WHO RECEIVED MONERO!!! You are a LIAR, A BULLSHIT ARTIST AND A SCAMMING ASSHOLE!\n\nFirst of all it would be the other way (senders). Like I said, if you're going to spread bullshit, at least do it correctly. But it still didn't work. It was random BS claims attached to publicly available information. Oh no, the horror.\n\nMan, I love it when you doofi get so angry and project your issues onto others.",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "ia5aglk",
                                                            "author": "ozkraut",
                                                            "score": 1,
                                                            "created_utc": 1653619041.0,
                                                            "response": "FireIceUK?",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "ia004ec",
                            "author": "XMR2020",
                            "score": 2,
                            "created_utc": 1653521176.0,
                            "response": ">we should be able to search for stealth addresses in the blockchain\n\nImpossible because stealth addresses don't exist on the block chain.\n\nIf you'd like to learn more, there is an excellent technical explanation here:\n\nhttps://monero.stackexchange.com/questions/1500/what-is-a-stealth-address",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia2ksu7",
                                    "author": "TinosNitso",
                                    "score": 0,
                                    "created_utc": 1653576502.0,
                                    "response": "Not exactly impossible. The stealth address (public key), labelled as such by [xmrchain.net](https://xmrchain.net), does exist in the blockchain, but only uniquely in the one txn which created it (so it's like the TXID, with index). So when users search for a stealth address the explorer could show the txn it's in, along with all the txns whose rings contain that TXID.\n\nApparently it's impossible to know when a UTX is spent, so the email notifications mightn't be possible. However we could get email notifications whenever the TXID appears in a ring sig, but that'd be too many emails.\n\nSearching for a TXID could also show a full list of all newer TXIDs containing it in their ring signatures. i.e. how many times does the TXID I search for appear in the blockchain.\n\nIf devs ever get to publicly and freely tracing XMR txns, the DNMs can just flip it for something else (I just don't necessarily trust XMR, without a coin-join). A bunch of leaders would sell their XMR in advance, since that's why the \"attack\" occurs in the first place. **Mimblewimble** comes to mind. That's just a conspiracy theory, though.\n\nI don't understand how key images work. It seems that if a key image implies a TXO can't be double-spent, then we could get an email notification when a TXO (stealth address) has been spent (can't be double-spent). I do believe (without proof) that the hidden amounts are valid, though (no inflation).",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "ia0h2nr",
                            "author": "thethrowaccount21",
                            "score": 1,
                            "created_utc": 1653529103.0,
                            "response": "The government already has tools like this:\n\n[Ciphertrace Announces Enhanced Monero Tracing Capabilities for Governments](https://news.bitcoin.com/ciphertrace-enhanced-monero-tracing-capabilities-governments/)\n\nAnd there were two websites like this in the past [Most Monero transactions made prior to February 2017 are traceable.](https://web.archive.org/web/20190208194521/http://monerolink.com/)\n\nAs well as [Monero's main selling point is privacy. That promise doesn't work, 'cause there are several ways to track it.\nDid you use Monero yesterday? If so, check the list below, you might be on it.](https://web.archive.org/web/20220407073554/https://monero-badcaca.net/)",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9yh4u8",
                    "author": "FieserKiller",
                    "score": -11,
                    "created_utc": 1653498331.0,
                    "response": "What rise of Monero? \n\nXMR is falling vs Bitcoin for 4 years now. Only thing is BCH is falling faster...",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9yqttb",
                            "author": "onemoneroisonemonero",
                            "score": 10,
                            "created_utc": 1653502115.0,
                            "response": "Monero broke out of a 4 year down trend vs BTC and has bottomed on long term support.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9yzuxr",
                                    "author": "FieserKiller",
                                    "score": -4,
                                    "created_utc": 1653505677.0,
                                    "response": "All i see is steady decline\n\nhttps://imgur.com/a/JJd2G4h",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}