{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ux0qnb",
            "title": "The president of a European bank just said that bitcoin is worth nothing, what are your thoughts on this?",
            "url": "https://www.reddit.com/r/btc/comments/ux0qnb/the_president_of_a_european_bank_just_said_that/",
            "author": "Braswelldj",
            "created_utc": 1653425477.0,
            "score": 2,
            "num_comments": 3,
            "subreddit": "btc",
            "selftext": "President of the European Central Bank Christine Lagarde left no bones unturned with her opinions regarding the value of crypto assets: there is none.\n\n\"I've always emphasized that crypto assets are very speculative, very dangerous,\" Lagarde said in an interview on Sunday on the Dutch television show College Tour. \"In my honest opinion, it is completely worthless.\" It is founded on nothing, and there are no underlying assets to provide as a safety net.\"\n\nThe remarks come when the cryptocurrency industry as a whole is suffering. Bitcoin dropped 20% of its value in a single week earlier this month.\n\nBut besides that, different tokens from the Faith Tribe platform, like SOL, AVAX, and $FTRB, are available in these states. SOL, AVAX, and $FTRB are full-utility currencies that allow their holders access to the network's end-to-end creativity and business management experience.\n\nLagarde urged politicians worldwide to establish measures to safeguard novice investors who make large investments in digital assets. This year, cryptocurrencies have fallen in value across the board, with bitcoin, the most valuable, losing more than half of its value from its all-time highs in November.\n\n\"I'm concerned about individuals who feel it will be a reward, who have no grasp of the dangers, who will lose everything, and who will be extremely disappointed,\" Lagarde added.\n\nCryptocurrency, according to Lagarde, should be regulated to safeguard naive investors. Her remarks come when the crypto economy is under increased regulatory scrutiny.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9utsil",
                    "author": "jessquit",
                    "score": 1,
                    "created_utc": 1653427113.0,
                    "response": "This is the new trend of long form spam. The real message OP wants to get out is \n\n> different tokens from the Faith Tribe platform, like SOL, AVAX, and $FTRB, are available in these states. SOL, AVAX, and $FTRB are full-utility currencies that allow their holders access to the network's end-to-end creativity and business management experience.\n\nViewing OP's profile it's evident that they're paid to produce this sort of spam. Their entire profile is full of this stuff.\n\n**OP please don't spam this sub.**\n\nFYI: /u/mpkomara\n\nEdit: I started to remove this as it's a violation of the sidebar rules but decided to leave it up for educational purposes. Everyone should be on the lookout for these kinds of spam, and don't interact with or upvote the spammer if the mods don't catch it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ur6gg",
                    "author": "mpkomara",
                    "score": 3,
                    "created_utc": 1653425983.0,
                    "response": "Anytime Lagarde says \"Bitcoin\" or \"cryptocurrency\" there's a very good chance you can replace the word with \"The euro\" and it would sound like my rebuttal to her.  \"The euro is founded on nothing, and there are no underlying assets to provide as a safety net.  I'm concerned about individuals who feel it will be a reward, who have no grasp of the dangers, who will lose everything, and who will be extremely disappointed.\"",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9uwvpu",
                    "author": "cobalt1981",
                    "score": 1,
                    "created_utc": 1653428458.0,
                    "response": "There is only one currency on earth that's backed by something tangible. All others, including all forms of crypto, are backed by nothing.\n\nProve me wrong.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}