{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uw5p55",
            "title": "Theory on why u/thethrowaccount21 pursued George Donnelly with name calling and vitriol and flipstarter funders did not afaik; a difference between Dash and Bitcoin Cash",
            "url": "https://www.reddit.com/r/btc/comments/uw5p55/theory_on_why_uthethrowaccount21_pursued_george/",
            "author": "-ism-isa-con",
            "created_utc": 1653327407.0,
            "score": 0,
            "num_comments": 3,
            "subreddit": "btc",
            "selftext": "Thethrowaccount21 has levied accusations against George Donnelly regarding funding received by the latter.  This has to do with two projects: Dash and Bitcoin Cash.\n\nIn thethrowaccount21's [post](https://np.reddit.com/r/DashUncensored/comments/uu80oj/george_donnelly_posted_recently_and_blocked_me_so/) there was a lot of name calling.  That's what caught my attention.  Only a slow BCH aficionado myself, I didn't understand the vitriol.  It took a bit of back and forth, but u/thethrowaccount21 eventually explained to me that they were not involved in the flipstarter, but they come from Dash project, where funds are handled very differently than they are in Bitcoin Cash.\n\nIn Bitcoin Cash world, a person who funds a flipstarter campaign **takes upon himself or herself a significant degree of personal risk**, since nobody else makes the decision to contribute.  A BCH-flipstarter-funder thus only has himself or herself to blame for that decision, which causes them to assume a degree of responsibility.\n\nDash funding of projects, meanwhile, is handled differently.  Maybe I'm wrong about this, and if I am someone please correct me, but afaik none of the contributors to George Donnelly in the Dash project incurred any personal risk.  Those funds were already gone from their own wallets.  Someone else made the decision, using funds in another wallet.\n\nWhat I'm [trying to say](https://www.reddit.com/r/btc/comments/uu82ff/george_donnelly_posted_recently_asking_to_come/i9o2n4i/) is, when funding is handled such as it is in Bitcoin Cash BCH -- voluntarily -- that may actually help us all treat each other with a just little bit more humanity, by encouraging everyone to assume responsibility for their own actions.\n\n(This post made with respect to the Dash project, which I appreciate.  It's okay to talk about differences between projects.)",
            "stickied": false,
            "comments": [
                {
                    "id": "i9poo3t",
                    "author": "Pablo_Picasho",
                    "score": 2,
                    "created_utc": 1653330604.0,
                    "response": "> but afaik none of the contributors to George Donnelly in the Dash project incurred any personal risk. Those funds were already gone from their own wallets. Someone else made the decision, using funds in another wallet.\n\nI'd say it's a wrong conclusion.\n\nEvery holder of a coin carries the fallout of decisions on how to invest moneys collected for its \"development\" (in the broadest sense).\n\nWhether such collection happens via flipstarters, or centralized development funds - in the end it only matters if the money was well spent and moved the coin forward.\n\nIf it doesn't, people are going to assume responsibility either way, because the market weighs these things.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ppku6",
                            "author": "-ism-isa-con",
                            "score": 2,
                            "created_utc": 1653330994.0,
                            "response": "Thanks for your thoughtful reply.  I think who is taking the risk influences their behavior.\n\n> in the end it only matters if the money was well spent and moved the coin forward\n\nGood point.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}