{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uyn7lb",
            "title": "I sold all my BCH",
            "url": "https://www.reddit.com/r/btc/comments/uyn7lb/i_sold_all_my_bch/",
            "author": "JarmoViikki",
            "created_utc": 1653616206.0,
            "score": 47,
            "num_comments": 214,
            "subreddit": "btc",
            "selftext": "Hello,\n\n&#x200B;\n\nI sold all my bch.\n\nI guess I more or less broke even with this. \n\nLikely, this will get all the downvotes, but I just came to say all of you a good bye. \n\nBCH did not make it. It is very hard to climb from the current market share all the way to top 10 not to mention to become the biggest crypto. \n\n&#x200B;\n\nThank you for these years. It was a nice to get to know some of you.\n\nI wish you good luck for the future.\n\nGob bless.",
            "stickied": false,
            "comments": [
                {
                    "id": "ia5yvpt",
                    "author": "BewareOfShills",
                    "score": 18,
                    "created_utc": 1653634144.0,
                    "response": "Again?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia7x3kz",
                            "author": "student1488",
                            "score": -6,
                            "created_utc": 1653673884.0,
                            "response": "Jesus is Lord , Fear God and BCH.\n\nNew age nonsense package!\n\nOne false belief after the other!\n\nWhat is wrong with you?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia5by10",
                    "author": "MaxMoney2021",
                    "score": 46,
                    "created_utc": 1653619787.0,
                    "response": "The bottom must be near! Thank you!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia74iip",
                            "author": "wachtwoord1988",
                            "score": 2,
                            "created_utc": 1653662083.0,
                            "response": "Many people have done the same, myself included.\n\nStill have a handful of other coins but honestly don't see a future in them, in comparison the BCH .",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "ia5iswx",
                            "author": "JarmoViikki",
                            "score": 4,
                            "created_utc": 1653623361.0,
                            "response": "It is possible.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia8i2mj",
                                    "author": "michniakd",
                                    "score": 2,
                                    "created_utc": 1653683198.0,
                                    "response": "I Dumped ripple Ethereum dash Litecoin BTC and BSV for BCH .",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia9624f",
                                            "author": "Sugarbird676",
                                            "score": 1,
                                            "created_utc": 1653694858.0,
                                            "response": "I agree with all of your choices.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "ia6e1bk",
                            "author": "aaj094",
                            "score": 5,
                            "created_utc": 1653647438.0,
                            "response": "There is no bottom for BCH. Nearly five years hasn't shown you that? Same speak even when ratio first slid below 0.1.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia6k7sp",
                                    "author": "Bag_Holding_Infidel",
                                    "score": 1,
                                    "created_utc": 1653651812.0,
                                    "response": "Yeah, its still in the top 100, so it has a long way to go yet.\n\nAfter BCH, the next fork BTG is at #122 and BCD is #499.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia7gw7j",
                                            "author": "Jellyhojo",
                                            "score": 3,
                                            "created_utc": 1653667205.0,
                                            "response": "BSV and ecash are in top 100",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia5fba6",
                    "author": "rshap1",
                    "score": 16,
                    "created_utc": 1653621506.0,
                    "response": "Good luck!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia5x36u",
                            "author": "JarmoViikki",
                            "score": 13,
                            "created_utc": 1653632742.0,
                            "response": "Thank you! I sincerely hope BCH can make it and that you can make it.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia871cr",
                                    "author": "Vikash009",
                                    "score": 7,
                                    "created_utc": 1653678226.0,
                                    "response": "Also ,Today is the day I sold all my BTC/DASH and converted everything to BCH  .",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "ia6aye5",
                            "author": "al77862",
                            "score": 1,
                            "created_utc": 1653644846.0,
                            "response": "Now , he will probably get some sleep in the coming months .",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia6cjtr",
                    "author": "Shibinator",
                    "score": 5,
                    "created_utc": 1653646212.0,
                    "response": "https://bitcoincashpodcast.com/faqs/Other/is-bitcoin-cash-dead",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia96opl",
                            "author": "Sugarbird676",
                            "score": 2,
                            "created_utc": 1653695181.0,
                            "response": "“ To begin with, this obsessive focus on the price (denominated in fiat currency) indicates that these complainers (of both camps) are more interested in considering BCH as a speculative investment (which it is not), instead of as a usable day-to-day currency separated from the fiat economy. ”\n\nI really don’t know how I feel about this. I agree that a singleminded focus on price is myopic, but to an extent, price reflects how much people value something. But my biggest disappointment with BCH is that not a single DNM or vendor came out to openly support P2P cash. That’s pretty bleak. (Or it indicates that TPTB are behind those markets, which is a possibility.)",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia5kih2",
                    "author": "KeepBitcoinFree_org",
                    "score": 24,
                    "created_utc": 1653624330.0,
                    "response": "BCH works and “made it” further than 99% of other coins in adoption, scaling, & decentralization of development. Marketcap and price doesn’t really mean shit when there is no utility and no real value in these “top 10” coins. It will mean less when people sell it all the way down because they are propped up by fake stablecoins and ignorant investors. BTC, ETH, and the like, have little to no utility outside of speculative gambling.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia6r3lv",
                            "author": "janooms",
                            "score": 5,
                            "created_utc": 1653655806.0,
                            "response": "It is a logical thing decision. BCH's intrinsic value comes from its usefulness as an ultimate form of cash.\n\nwhile BTC's value comes from its speculative \"store value\".",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "ia5z9un",
                            "author": "trakums",
                            "score": -5,
                            "created_utc": 1653634464.0,
                            "response": "OP is right. With Bitcoin it does not work like that. Even if behind BCH are the smartest mathematicians in the world with the best ideas in all human history, you don't create a new coin but convince the majority of regular people and get at least 51% hash-power for your fork and fork the Bitcoin like Satoshi intended where weakest fork dies and longest chain wins. \n\nBut I don't think they can call themselves smart mathematicians if they can't even prove that LN will not work. Well actually they did \"prove\" it several times, but current state of LN proved them wrong just by existing.  \n\nI don't think we will have LN in the future. I think we will have multiple interoperable decentralized side-chains. Nothing can prevent a birth of a decentralized side-chain. We are not ready yet. Even SmartBCH is not decentralized yet.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia6ht5m",
                                    "author": "chainxor",
                                    "score": 8,
                                    "created_utc": 1653650202.0,
                                    "response": "Please get it through your head - BTC is crippled and will NEVER be able to cater for transaction needs of the entire world (not even a small country - no El Salvador adoption is Potemkin village much BSVs on-chain transaction numbers). Onboarding each potential user to Lightning by opening a LN channel for each user will take several YEARS with block size limit on BTC.\n\nAND...Lightning does not work as scaling and it definitely does not scale symmetrically - the bigger, the more centralized it becomes.\n\nSo, it is really quite simple - either crypto fails (I consider centralized/custodian adoption to be failure as well) or it becomes a new parallel decentralized \\_REAL\\_ closed-loop economy, in which BCH is one of the few that actually has what it takes to make it work!",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia6j8f6",
                                            "author": "trakums",
                                            "score": 0,
                                            "created_utc": 1653651176.0,
                                            "response": "If you are right, maybe one day everybody will realize that nothing else works and BCH has the best ideas. \n\nThat would put us in a situation where we must make those changes to Bitcoin. And you will laugh and say - I told you so!\n\nBut BCH will be 1/1000th of BTC in a year or two if the trend continues.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "ia6pgy8",
                                            "author": "YeOldDoc",
                                            "score": 0,
                                            "created_utc": 1653654926.0,
                                            "response": "You are confusing centralization of liquidity on LN with centralization of nodes on the main layer. While both should be avoided, miner/node centralization is much worse.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia7drus",
                                                    "author": "KallistiOW",
                                                    "score": 5,
                                                    "created_utc": 1653665926.0,
                                                    "response": "This is absolutely a myth. Is it more important for \"decentralization\" that everybody is actually able to use the network, or that everybody can run a node (while users are priced out of making transactions)?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "ia8ul88",
                                                            "author": "YeOldDoc",
                                                            "score": 1,
                                                            "created_utc": 1653689131.0,
                                                            "response": "> This is absolutely a myth. \n\n- 51% of miners can censor other people transactions.\n- 51% of LN nodes will just fork off into their own sub LN network.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "ia6392g",
                                    "author": "LovelyDayHere",
                                    "score": 5,
                                    "created_utc": 1653637904.0,
                                    "response": "> current state of LN\n\nMaybe you should look closer at that state.\n\nIt matches what we \"big blockers\" said it will turn into. A network around big hubs. Centralized. It's ok for those who like to be banked. Even if it's not efficient. That's why LN users will be returned to more efficient centralized solutions, even if it's under the hood. Like in El Salvador. \"Lightning Network\" on the sticker, then turns out it's a private network and parts are running Algorand. That's the state of BTC+LN today.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia6hzvj",
                                            "author": "trakums",
                                            "score": -2,
                                            "created_utc": 1653650333.0,
                                            "response": "What's wrong with big hubs? They still obey all Bitcoin rules and can not prevent, change or undo any of my transactions. And transactions are more anonymous then they are on base layer because of the onion routing. If you think they will start KYC one day then on the next day there will be 2 lightning networks one with KYC and one without it. And Onion routing works well with dark-net so it is basically unstoppable and uncontrollable.\n\nAbout El Salvador... I don't know if their official wallet even has a direct connection to LN. I would not store my funds on that. Do they (El Salvador merchants) accept payments from real LN wallets?\n\nBut maybe one day everybody will realize that nothing else works and BCH has the best ideas and they will make those changes to Bitcoin.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia6okha",
                                                    "author": "don2468",
                                                    "score": 5,
                                                    "created_utc": 1653654420.0,
                                                    "response": "> What's wrong with big hubs? They still obey all Bitcoin rules and can not prevent, change or undo any of my transactions. \n\n\nThey absolutely can prevent you from making a transaction, they **choose** to route your payment or not and perhaps if you don't tell them who you are paying then it will be in their terms of service that they don't have to route it.\n\n\n> If you think they will start KYC one day then on the next day there will be 2 lightning networks one with KYC and one without it.\n\n\nNot when it costs [$62](https://archive.ph/opz5T#selection-2803.49-2803.54) to open a new LN channel. and it will likely be considerably more given real Bitcoin adoption.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "ia6rskw",
                                                            "author": "trakums",
                                                            "score": 0,
                                                            "created_utc": 1653656169.0,
                                                            "response": "$62 changes nothing. If I need to open a new LN channel I chose a node without KYC. And 62$ are [far away](https://bitcoinvisuals.com/bitcoind-minfee). And I believe my node will be able to migrate to dark-net without closing my open channels when something as dumb as KYC nodes happen. The possibility of nodes going dark will prevent even a slightest chance of implementing KYC because that would make situation even worse for those who wanted it in the first place. Asking nodes to implement KYC is as impossible as asking miners to only accept KYC transactions.\n\nAlso there are protocols that would allow multiple Lightning channels to be opened or modified with a single on-chain transaction (can be implemented via a soft fork). \n\nSo yes they absolutely can prevent me from making a transaction but that can only be an accident because they don't know who I am or who I am paying.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "ia7zj3b",
                                                                    "author": "don2468",
                                                                    "score": 3,
                                                                    "created_utc": 1653674933.0,
                                                                    "response": "\nYou're forgetting where this conversation started, when u/LovelyDayHere replied \n\n\n>> **trakums:** but current state of LN proved them wrong just by existing\n>>\n>>> **LovelyDayHere:** It matches what we \"big blockers\" said it will turn into. **A network around big hubs. Centralized.**\n>>\n>> **trakums:** WHAT'S WRONG WITH BIG HUBS? They still obey all Bitcoin rules and can not prevent....\n\n\nA reason for large hubs is they make the routing problem far more tractable, and seem to arise naturally.\n\n\nBut most of your later replies involve a more decentralized evenly distributed p2p mesh which is a far less tractable problem and importantly as pointed out by LovelyDayHere **not what we see in the real World** and hence why that first statement of yours is on shaky ground - LN routing with everybody connected to a single super hub obviously works regardless of network size, at the other end of the scale where we have just a p2p mesh of users with say 5 connections each - at some network size routing becomes a real problem. as noted (2017) by Rusty Russel (Blockstreams Lightning Guy)\n\n\n>> **Rusty Russel:** All channel updates are broadcast to everyone. How badly that will suck depends on how fast updates happen, **but it's likely to get painful somewhere between 10,000 and 1,000,000 channels.** [link](https://archive.ph/UnTnX#selection-1937.0-1937.187)\n\n\nI will attempt to address your points regardless\n\n\n> $62 changes nothing. If I need to open a new LN channel I chose a node without KYC[.](https://archive.ph/nvCNp) \n\n\nObviously you are rich and can throw $62 around without thinking, unfortunately for most of the World that is not the case. \n\n\nNever mind that in a highly adopted Bitcoin as Gold2.0 World, fees would be considerably higher. \n\n\n>> **Tuur Demeester:** At full maturity, using the Bitcoin blockchain will be as rare and specialized as chartering an oil tanker. [link](https://twitter.com/TuurDemeester/status/1133735055115866112?ref_src=twsrc%5Etfw)\n\n\nAnd he's on your side!\n\n\n> And 62$ are far away. \n\n\nYou do know that the most Maxi of Bitcoin Maxi's (rBitcoin Führer) only six years ago thought that a $1 fee was [unthinkable](https://archive.is/2LEcO#selection-2075.0-2075.291) enough to comment that '**a hard fork to 2MB would be a no brainer**'\n\n\n\n> And I believe my node will be able to migrate to dark-net without closing my open channels when something as dumb as KYC nodes happen. \n\n\nIf you are connected to a KYC node how do you close (migrate) that channel and open up another one with a different channel partner say, Mr Random behind tor without an on chain fee involved?\n\n\n> **The possibility of nodes going dark** will prevent even a slightest chance of implementing KYC because that would make situation even worse for those who wanted it in the first place. \n\n\nYou have to explain how nodes going dark can happen without incurring the prohibitive on chain fee (by design) before this becomes a real threat add in the fact that finding a route through an inherently dark network will be even harder than the already large hub forming LN that we observe today.\n\n\n> Asking nodes to implement KYC is as impossible as asking miners to only accept KYC transactions.\n\n\nNot really, Large hubs (remember that's where we came in) are likely to be connected to Banks, Amazon.... \n\n\n\n> Also there are protocols that would allow multiple Lightning channels to be opened or modified with a single on-chain transaction (can be implemented via a soft fork).\n\n\nyep batching many channel openings in 1 transaction, but each of those channels still has an onchain footprint of at least 43 bytes (taproot) perhaps a 10 fold increase in density which is excellent so only $6 to open a channel, still out of reach for those who live on $2 a day even the cheap scaling solution to using Bitcoin excludes 700,000 of the poorest people in the World. Go Figure!\n\n\nBut lest we forget you cannot apply the same batching trick to *trustlessy* close many channels at once. the transactions have already been created and swapped just not broadcast so $62 to close your channel. **better choose your channel partner well**\n\n\nThe best you could do to close your channel if both parties are willing and responsive is to **somehow** find other like minded channels that want to close also and aggregate all your signatures but for N channels you would still have 1 signature and N inputs + 2N outputs maybe a ~50% saving (generous) so only $31. \n\n\nAlso pooled UTXO's (channel factories) the cost of opening a channel goes down with the number of participants but the likely hood of a force close incurring an on chain fee **for everybody** goes up with the number of participants, also a good reason to **choose your pooled UTXO partners carefully**.\n\n\n> So yes they absolutely can prevent me from making a transaction but that can only be an accident because they don't know who I am or who I am paying.\n\n \nYou seem to be missing the point and incidentally where we came in. \n\n\nIn your idealised LN world everybody is an equal peer and there is no need to go through centralised hubs - this is not what we see is happening.\n\n\nIf your payment **has** at some point to go through a large **well connected** centralised hub then that hub **can choose** not to route the payment until it has the complete knowledge of from where and to whom the payment goes, how does you hiding behind tor force them to route your payment if they require KYC?\n\n\nPerhaps large non KYC hubs can work, but if everybody is dark how do you find a route?\n\n\nAt the end of the day it's the large on chain fee (by design) that puts a stake through the heart of L2 solutions as far as I can see.\n\n\nGood Luck!",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "ia833iy",
                                                                            "author": "trakums",
                                                                            "score": 1,
                                                                            "created_utc": 1653676491.0,
                                                                            "response": "I will read it later... English is not my native language.\n\nCurrently I stopped at \"A reason for large hubs is they make the routing problem far more tractable\". what does that mean?",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "ia8chf5",
                                                                                    "author": "don2468",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653680664.0,
                                                                                    "response": "> I will read it later... \n\n\nNo problem, thanks in advance for taking the time\n\n\n> English is not my native language.\n\n\nYour English is very good I am not sure I would have been able to tell you weren't native, certainly better than my Latvian\n\n\n> Currently I stopped at \"A reason for large hubs is they make the routing problem far more tractable\". what does that mean?\n\n\ntractable in this case is how easy it is to find a valid route.  \n\n\nif large well connected hubs are common (and have good links between each other), nodes will tend to be near some large well connected hub, I can say to you I am near Hub X and can probably furnish a route to Hub X through my local knowledge, you then only need to find a route to large well connected Hub Y (near you) your route is then fairly simple: \n\n\n* You -> your local knowledge route -> Hub Y -> Hub X -> my local knowledge route -> Me\n\n\n\nnow in a world without large hubs (City's & Motorways) it is much more difficult to find a route though we **may** have a rough global map, how would you find your way from one small town in Latvia to another on the other side of the country only using back roads and if you are only allowed to see say within 10 miles radius of your current position, remember in LN space there is no North South East West, you have to start guessing routes and have some metric that tells you whether it brings you closer to your destination or not. you might get to a road and find it is only one way (not in your favour) and you don't know until you get there. I am led to believe routing to be a hard problem at scale (when you don't have an accurate global map) through an evenly spaced network (all peers having similar connectivity) especially when roads can be only one way and you don't know until you get to them. It's quite amazing what the LN guys have done so far (I keep meaning to look into the exact heuristics they use). needless to say the difficulty without large nodes (signposts) goes up exponentially with scale, twice the channels is not just twice the difficulty but much more and World scale is probably a 1000x more scaling than today with the added exponential difficulty. (apologies for the dense somewhat rambling text)\n\n\nI believe hubs will be necessary for World scale, but as you know my thing against this scaling is the high on chain fee (by design) that the man in the street won't be able to afford. I cannot see any way round that, hence BCH.",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "id": "ia7jd2v",
                                                                    "author": "hans7070",
                                                                    "score": 1,
                                                                    "created_utc": 1653668208.0,
                                                                    "response": "Btw., you can batch channel openings right now (LNDg has a friendly UI for that). The modifying of channels (splicing) is coming soon hopefully (no soft fork needed either).",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "ia6pvel",
                                                            "author": "YeOldDoc",
                                                            "score": -2,
                                                            "created_utc": 1653655150.0,
                                                            "response": "> They absolutely can prevent you from making a transaction, they choose to route your payment or not and perhaps if you don't tell them who you are paying then it will be in their terms of service that they don't have to route it.\n\nand as the user you responded to pointed out, if that happens:\n\n> transactions are more anonymous then they are on base layer because of the onion routing. If you think they will start KYC one day then on the next day there will be 2 lightning networks one with KYC and one without it. And Onion routing works well with dark-net so it is basically unstoppable and uncontrollable.\n\nIf you think KYC is an issue for LN it will be much worse of an issue for BCH miners. (Another miner will jump in and earn fees routing the transaction for you? Well so will another LN node.)",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "ia7glg0",
                                                                    "author": "don2468",
                                                                    "score": 5,
                                                                    "created_utc": 1653667083.0,
                                                                    "response": ">>> **Me:** They absolutely can prevent you from making a transaction, \n>\n> **You:** and as the user you responded to pointed out, if that happens[:](https://archive.ph/FregS)\n>\n>\n>> **trakums:** If you think they will start KYC one day then on the next day there will be 2 lightning networks one with KYC and one without it.\n\n\nDid you miss the bit in my reply where I pointed out that there would be an on chain fee associated with such a situation and in a high fee World (by design) that would be prohibitive for the common man.\n\n\nHow many people are going to be able to sink another [$62](https://archive.ph/opz5T#selection-2803.49-2803.54) (trakums own **low ball** estimate) into **just** opening a new channel with some random hiding behind tor? who may or may not do the same or be unresponsive.\n\n\nIn a high fee World (by design) the common man will have to choose his channel partners **very** carefully.\n\n\nBut of course that just won't happen they will just keep their funds on Coinbase and transact for free there.\n\n\n> If you think KYC is an issue for LN it will be much worse of an issue for BCH miners. (Another miner will jump in and earn fees routing the transaction for you? Well so will another LN node.)\n\n\nIn LN channel you have a **single** channel partner, and you have a very definite **personal** sunk cost (the opening of the channel) in that relationship. \n\n\nIn a high fee World (by design) at some level **that sunk cost ties you to your channel partner** it would be prohibitive for you to **just** close the channel and open a new one, effectively **doubling your sunk cost**, the average American doesn't have $500 for emergencies and you & trakums think they will just pay another 10%+ for the privilege.\n\n\nIn mining any miner can mine your transaction and **all the 'considerably more' sunk cost is on their side** it is in their interests to mine as many transactions as possible and make the network as useful as possible.\n\n\nImportantly the miners don't need to be in any particular jurisdiction to mine transactions from all over the World.\n\n\nEquating the two situations seems to be reaching at best.\n\n\nBut if you think American miners are going to be able to orphan Russian or Chinese miners because of KYC then it's not just Bitcoin Cash you don't believe in but also Bitcoin Core.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "ia8vdjh",
                                                                            "author": "YeOldDoc",
                                                                            "score": 1,
                                                                            "created_utc": 1653689516.0,
                                                                            "response": "From your citation:\n\n> so I think there will be decentralized services that allow to open LN payment channels for many users with a single base chain payment.\n\nIn summary:\n\n- you'll have multiple channels to different nodes and a single payment is routed across multiple nodes/channel at once\n- miners will operate LN nodes and accept channel openings with their own nodes at lower fees\n- end-users do not necessarily need to pay the opening fees and the fees do not necessarily need to be paid in full up front (there are several trustless models in which fees can be recovered via LN fees)\n- several channels can be maintained with a single on-chain tx\n- LN hubs can maintain and manage channels much cheaper while still remaining trustless, in contrast to centralization of mining/nodes, a centralization of liquidity on LN does not allow censoring transactions.\n\n> In mining any miner can mine your transaction and all the 'considerably more' sunk cost is on their side it is in their interests to mine as many transactions as possible and make the network as useful as possible.\n\nIn LN, 51% attack of nodes will just fork off in their own sub network.\nIn mining, 51% attack of miners will censor everybody else's transactions.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "ia9krr5",
                                                                                    "author": "don2468",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653702613.0,
                                                                                    "response": "\n>> From your citation:\n> \n> so I think there will be **decentralized services** that allow to open LN payment channels for many users with a single base chain payment[.](https://archive.ph/e8hay)\n\n\nI cited trakums **$62** per transaction **very specifically, note what text archive.ph hi-lights**, the rest of the quote just happened to have the above sentence that he pulled out his ass **and you bend yourself into a pretzel trying to attribute it to me** then draw your *in summary* conclusions as if they were from me. heh heh.\n\n\nBut ok\n\n\nYes a Coinbase or large enough ***trusted*** entity could open many channels in 1 batched transaction with 1 input and many outputs\n\n\nThe trusted part would come in as we would have to supply them with funds from some other source (not on chain as this would defeat the point of batching) and **trust** them to use those funds to open a channel for us. with **many** 43 byte outputs and one input.\n\n\n> In summary:\n\n\nHere's the pretzel bit that you lift from trakums and attribute to me????\n\n\n \n> you'll have **multiple channels** to different nodes and a single payment is routed across multiple nodes/channel at once\n\n\nThe common man won't have **multiple channels** at $62 a pop **the bit I cited - hint it's hi-lighted** never mind at the cost of hiring a [SuperTanker](https://twitter.com/TuurDemeester/status/1133735055115866112?ref_src=twsrc%5Etfw)\n\n\n> miners will operate LN nodes and accept channel openings with their own nodes **at lower fees**\n\n\nwhere do you get this from? are you just making it up?\n\n\n> end-users do not necessarily need to pay the opening fees and the fees do not necessarily need to be paid in full up front (there are several trustless models in which fees can be recovered via LN fees)\n\n\nNot at $62 a pop they won't. they will have to pass it on to the customer, and remember it will likely be much higher in a high fee World (by design)\n\n\n> several channels can be maintained with a single on-chain tx\n\n\nEach of those channels will have to have at least one input and at least one output, one input for **every** channel closed and one output for **every** channel opened that's 43 bytes for **every** closed channel and another 43 bytes for **every** open channel. that will add up.\n\n\nThis is not free and in a high fee World (by design) just the 43 bytes will likely be prohibitive for most **and that's the absolute best case scenario**\n\n\n> LN hubs can maintain and manage channels much cheaper\n\n\nOnly so much cheaper as outlined above in the batching part. and they would still have an 86 byte footprint **best case** for every open close.\n\n\nAnd to give you the broken record bit, in a high fee World (by design) those 86 bytes will still be prohibitive for most.\n\n\n> while still remaining trustless, \n\n\nYou have to trust they will route your payment and not try to enforce KYC because, in a high fee World (by design) you won't be able to afford the on chain fee to break away from them. \n\n\nBecause your choices would be\n\n\n1. To publish **a full transaction** taking sole control of your funds with your *previously* unpublished LN transactions and taking the full fee hit then **another** full fee hit to open another channel with some other channel partner.\n\n\n2. Ask your KYC node partner to help craft an output from your 2of2 multisig LN channel output to a large batched transaction of one of it's competitors. which will stil be 86 bytes, that's still gonna sting in a high fee World (by design). assuming the KYC node can actually do business with a non KYC node.\n\n\n\nIn a high fee World (by design) future the above doesn't seem realistic when people could just keep their funds on Coinbase and transact for free. Remember when them cypherpunks came up with encrypted email - PGP in the 90's but it was too complicated to use for the common man and so they just used plain text .....\n\n\n\n> in contrast to centralization of mining/nodes, a centralization of liquidity on LN does not allow censoring transactions.\n\n\nIf your channel partner **is** the node then yes it absolutely can censor your transactions. and in a highe fee World (by design) you will just have to take it as it is unlikely that you will be able to afford the on chain fee....\n\n\n>> In mining any miner can mine your transaction and all the 'considerably more' sunk cost is on their side it is in their interests to mine as many transactions as possible and make the network as useful as possible.\n> \n> In LN, 51% attack of nodes will just fork off in their own sub network. **In mining, 51% attack of miners will censor everybody else's transactions.**\n\n\nyep confirmed you don't believe in Bitcoin...",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "ia6pnv4",
                                    "author": "don2468",
                                    "score": 2,
                                    "created_utc": 1653655032.0,
                                    "response": "> But I don't think they can call themselves smart mathematicians if they can't even prove that LN will not work[.](https://archive.ph/YWG71) \n\n\n([edit:](https://archive.ph/Gp2xl) Not that they did) See if you can prove or disprove something quite *simple* 'every even number greater than 2 is the sum of 2 primes' that should be easy\n\n\n\n> Well actually they did \"prove\" it several times, but current state of LN proved them wrong just by existing.\n\n\nComments like this underline your World view & critical thinking skills and make me question making the effort to press these plastic things down in front of me in a specific order then finally hitting the big button on the right.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "ia6jhm9",
                                    "author": "MountainousFog",
                                    "score": 1,
                                    "created_utc": 1653651342.0,
                                    "response": "> **With Bitcoin it does not work like that.** Even if behind BCH are the smartest mathematicians in the world with the best ideas in all human history, you don't create a new coin but convince the majority of regular people and get at least 51% hash-power for your fork and fork the Bitcoin like Satoshi intended where weakest fork dies and longest chain wins.\n\nWhy not?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia6m7h0",
                                            "author": "trakums",
                                            "score": 1,
                                            "created_utc": 1653653045.0,
                                            "response": "The democratic principles. Same as there is only one America and Trump should not make another country after lost elections and call it the real America no matter how many supporters follow him. Rules are rules. If he does it will split the community and make everything worse.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "ia810t8",
                                    "author": "pawelbtce",
                                    "score": 1,
                                    "created_utc": 1653675590.0,
                                    "response": "Joining the pumpkin farmers from across the globe .",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "ia7ntf4",
                            "author": "shillstro",
                            "score": 0,
                            "created_utc": 1653670024.0,
                            "response": "Nah, BCH failed. It's been too long and most people never heard of it. Maybe it will be successful in the future, but I sincerely don't see it happening.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "ia5ktdl",
                            "author": "JarmoViikki",
                            "score": -13,
                            "created_utc": 1653624506.0,
                            "response": "Have you studied Ripple and its fundamentals?\n\nWhat is the aim of XRP?\n\nHow close it is to its goal?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia5sjhn",
                                    "author": "_risho_",
                                    "score": 11,
                                    "created_utc": 1653629438.0,
                                    "response": ">Have you studied Ripple and its fundamentals?\n\nyes ripple is a centralized shitcoin that is being sued by the sec. if your shitcoin has a person to sue then it isn't interesting.\n\n>What is the aim of XRP?\n\nto make brad garlinghouse rich off the backs of retail investors.\n\n>How close it is to its goal?\n\nit's already reached it's goal. all he needs to do now is not wind up in prison.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia6ta8i",
                                            "author": "fanruoxue",
                                            "score": -1,
                                            "created_utc": 1653656921.0,
                                            "response": "Dear Jesus you are going to get rekt.Hope you're trolling.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia6zp31",
                                                    "author": "_risho_",
                                                    "score": 4,
                                                    "created_utc": 1653659968.0,
                                                    "response": "Please do tell how exactly I'm going to get rekt",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "ia7fnv4",
                                    "author": "Mari0305",
                                    "score": 2,
                                    "created_utc": 1653666701.0,
                                    "response": "I’ve a feeling you’ll regret this... massively but hope for best .",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia7fz6g",
                                            "author": "JarmoViikki",
                                            "score": 1,
                                            "created_utc": 1653666829.0,
                                            "response": "That is certainly possible. I made some good friends from BCH community. I think they are my haters from now on.\n\nBut, remember, bch should not be dependent on me. If I am wrong, it can grow and become something great even without me participating it.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia5wgrv",
                    "author": "mtrycz",
                    "score": 4,
                    "created_utc": 1653632275.0,
                    "response": "W: Why did you buy at the time?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia64vbj",
                            "author": "chetvera",
                            "score": 1,
                            "created_utc": 1653639342.0,
                            "response": "All in on the patented surveillance coin, woohoo! Cheers .",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia5pj52",
                    "author": "wildlight",
                    "score": 13,
                    "created_utc": 1653627388.0,
                    "response": "man, seeing monero shopt up as it has is the kind of bullish signal for cash cryptos that makes me want to buy more. BCH has risen from 28th to 24th in market during the bear market so far. not to forget to mention how well the smart BCH eco system is doing great. eitherway I happy to keep buying more BCH and hope you come back eventually. I totally understand not having the stomach to invest in crypto.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia5rod3",
                            "author": "JarmoViikki",
                            "score": 3,
                            "created_utc": 1653628833.0,
                            "response": "I think a lot has to change in order me to buy back.\n\nIt is unlikely it will changes. BTC I will not touch. \n\nTo me this is all about increasing my purchasing power so there is no particular ideology behind my investment decisions.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia63dlu",
                                    "author": "ThomasZander",
                                    "score": 11,
                                    "created_utc": 1653638019.0,
                                    "response": "> \n> \n> To me this is all about increasing my purchasing power so there is no particular ideology behind my investment decisions.\n\nThe coin was never a get-rich-quick one. If someone sold it to you like that, you can blame them. They lied.\n\nWe are in this to avoid the oppression of the governments and elites of this world.\n\nVery different reason.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "ia5t91u",
                                    "author": "wildlight",
                                    "score": 7,
                                    "created_utc": 1653629931.0,
                                    "response": "the ideology is what will drive increase in purchasing power. Sure crypto speculators come and go tent to pump the prices of crypto currencies at seemingly random, but mostly those people are jist gambling with crypto. long run fundimentals are what will drive value in crypto. That why so many BCH supporters try not to focus on the price much. We want to focus on solving problems amd believe being the best option for people to use as money is what will drive the value of BCH. the longer the orice stays low the more BCH will beheld by those with similar ideological views which will reenforce its ability to succeed in the long run.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia790m0",
                                            "author": "mattbrow",
                                            "score": 2,
                                            "created_utc": 1653663971.0,
                                            "response": "If I was looking at current utility, I honestly would stay in BCH.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "ia5zdp4",
                                            "author": "JarmoViikki",
                                            "score": 2,
                                            "created_utc": 1653634552.0,
                                            "response": "Interesting. \n\nWhat do you think are considered as \"fundamentals\" when it comes to crypto?\n\nI might have slightly different approach on how to define fundamentals in crypto.\n\nFor me, the most important is the use case, the supporters, the management, the development team, projects etc.\n\nThose are value drivers for any project or company.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia63g4s",
                                                    "author": "ThomasZander",
                                                    "score": 12,
                                                    "created_utc": 1653638081.0,
                                                    "response": "> What do you think are considered as \"fundamentals\" when it comes to crypto?\n\nIt can be used as money for the world.\n\nOr, as I'm most fond of saying; we can move to a Bitcoin Cash economy.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "ia69oye",
                                                            "author": "JarmoViikki",
                                                            "score": -1,
                                                            "created_utc": 1653643708.0,
                                                            "response": "The question is that can for instance Ripple have similar fundamentals?\n\nBrad Garlinghouse had a presentation in Davos World Economic Forum. Based on some digging you can clearly see he was also in a meeting on Antarctica with Christine Lagarde, Claus Schwab etc in December 2021.\n\nI see writing on the wall.\n\n&#x200B;\n\nThat being said, BCH is the best version of BTC. But unfortunately, even BTC seems not to make it as the largest crypto.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "ia80603",
                                                                    "author": "ThomasZander",
                                                                    "score": 3,
                                                                    "created_utc": 1653675214.0,
                                                                    "response": "> The question is that can for instance Ripple have similar fundamentals?\n\nSo, if it can become money for the world.\n\nThis is a \"do your own homework\" style question. \n\nAsk yourself if it qualifies as money.  Hint;  good money has a limited supply. \n\nAsk yourself if it can be censored, blocked or confiscated by some entities like a government.\n\nCheers!",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "ia6dfym",
                                                    "author": "Shibinator",
                                                    "score": 8,
                                                    "created_utc": 1653646957.0,
                                                    "response": ">  use case, the supporters, the management, the development team, projects etc.\n\nBitcoin Cash is CRUSHING it on all of those metrics.  It has the original crypto**currency** use case.  It has the most [hardcore and passionate supporters](https://bitcoincashpodcast.com/faqs/BCH/will-bitcoin-cash-rebrand) of any coin by a titanic stretch (they fought through THREE chain splits).  Unlike other coins it actually [has decentralised management](https://bitcoincashpodcast.com/faqs/BCH/how-does-BCH-governance-work), it has SIX full node dev teams instead of just 1 and they recently did some very strong upgrades (plus the SmartBCH teams), it has a huge array of projects.\n\nIt sounds like the price decline is depressing you and that's fine, it is actually best you sell and leave so I support that.  But you should at least be honest with yourself that that is your reasoning, because if you actually believed in the metrics you said then you should absolutely love BCH and I have no idea where you would find a better coin.\n\nIf your use case is trying to speculate in fiat to get rich, which you also say it is, then there is a lot of better options and you will be happier with them definitely.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "ia8islw",
                                                    "author": "tiengt102",
                                                    "score": 1,
                                                    "created_utc": 1653683529.0,
                                                    "response": "I am looking at potential utility, and on that front nothing comes close to BCH.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "ia8jhli",
                                            "author": "dominipater",
                                            "score": 1,
                                            "created_utc": 1653683847.0,
                                            "response": "So by constantly losing or having stagnant value, under the hood it attracts people that don’t care about value, but in the end it becomes valuable and increases its purchasing power?\n\nSome next-level delusion right there",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "ia6lyrj",
                                    "author": "Gaujo",
                                    "score": 0,
                                    "created_utc": 1653652899.0,
                                    "response": "Try XMR",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "ia6yh1g",
                            "author": "EMw8SYJ4Qv",
                            "score": -2,
                            "created_utc": 1653659402.0,
                            "response": "Yeah, I hesitated on dash to be honest, but I’m sleeping well with my decision.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia55bo6",
                    "author": "KallistiOW",
                    "score": 22,
                    "created_utc": 1653616522.0,
                    "response": "Thanks for the discounted sale! (I'm on the buy side \\^_\\^)",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia568v3",
                            "author": "JarmoViikki",
                            "score": 3,
                            "created_utc": 1653616972.0,
                            "response": "Good luck. Perhaps I am wrong, but then again I have also other investments that I can make.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "ia55xbd",
                            "author": "Blazedout419",
                            "score": 0,
                            "created_utc": 1653616818.0,
                            "response": "Haha, it’s always on sale. 1% away from breaking its all time low in 2018.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia56xjd",
                                    "author": "KallistiOW",
                                    "score": 4,
                                    "created_utc": 1653617305.0,
                                    "response": "Hella oversold lol.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia7wm19",
                                            "author": "sojourner55",
                                            "score": 1,
                                            "created_utc": 1653673675.0,
                                            "response": "Hahahaha I’m here because of REKT plebs.\n\nAnd this is, by far, one of the rektest plebs I’ve ever read.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "ia565yv",
                                    "author": "JarmoViikki",
                                    "score": 5,
                                    "created_utc": 1653616932.0,
                                    "response": "I think the all time low was sub 100 usd.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia56dy2",
                                            "author": "Blazedout419",
                                            "score": -2,
                                            "created_utc": 1653617041.0,
                                            "response": "I am using BTC/BCH ratio via CoinGecko.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia56w6a",
                                                    "author": "JarmoViikki",
                                                    "score": -6,
                                                    "created_utc": 1653617286.0,
                                                    "response": "Oooh, I do not care even about btc. From the large cap I think Ripple has the best odds to become the world reserve currency. I know this is controversial but the proof is that Ripple CEO is sitting in the same tables with world economic forum folks, Christine Lagarde etc. I guess the law suit will be dropped also when they announce the implementation of XRP as replacement of SWIFT.\n\nThey will not implement btc for sure because it is broken.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "ia5htt2",
                                                            "author": "heslo_rb26",
                                                            "score": 16,
                                                            "created_utc": 1653622821.0,
                                                            "response": "Ripple, lol",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "ia5q8lb",
                                                            "author": "chainxor",
                                                            "score": 11,
                                                            "created_utc": 1653627852.0,
                                                            "response": "LOL. \n\nAlso, sitting at the same table as all the cronies in the world is not a positive. It just reenforces that shitcoin-ness of the token. By the way only centralized shitcoins have to care about a CEO. \n\nBCH does not have a CEO or even a \"core team\". That is why it will one of the few left standing when is curbed even by said cronies.\n\nHowever, for speculative trades you could right. I also trade shitcoins, but I will never sell my BCH.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "ia5r97m",
                                                                    "author": "JarmoViikki",
                                                                    "score": 2,
                                                                    "created_utc": 1653628548.0,
                                                                    "response": "The elite will not just give up their power. \n\nIronically speaking, the \"centralised\" crypto of Ripple has good chances to become the next world reserve currency.\n\nBecause it is controllable.\n\nAnd it means the owners of the world reserve currency will get as rich as the owners of oil today.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "ia5rnt9",
                                                                            "author": "jessquit",
                                                                            "score": 11,
                                                                            "created_utc": 1653628823.0,
                                                                            "response": "People are laughing at you but I think it's fine to invest cynically. So far the cynics in the crypto space are getting far richer in fiat terms than any of the purists. Just be honest with yourself that you're betting on the scenario that crypto is ultimately a washout and isn't going to disrupt anything.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "ia5xh11",
                                                                                    "author": "JarmoViikki",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653633033.0,
                                                                                    "response": "I like certain cryptos. XRP is something the elite wants, thus it has chances to pump.\n\nMore pure crypto that I still support is ADA. I like also APE thanks to their team (they are building their own blockchain if I understood correctly).",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "id": "ia5z4th",
                                                                            "author": "BewareOfShills",
                                                                            "score": 4,
                                                                            "created_utc": 1653634349.0,
                                                                            "response": ">The elite will not just give up their power.\n\nTrue, that is why Bitcoin is a revolution and not a get rich quick scheme. The elite never gave up anything. \n\nFreedoms are taken, not given.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "ia5zie2",
                                                                                    "author": "JarmoViikki",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653634658.0,
                                                                                    "response": "I think there are multiple assets on which you can take back your freedoms and each of them have their pros and cons.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "ia5zpic",
                                                                                            "author": "BewareOfShills",
                                                                                            "score": 2,
                                                                                            "created_utc": 1653634822.0,
                                                                                            "response": "Fair point. Personally I haven't found too many. To be precise, I think there are two. \n\nAnd even then, you will not avert the fight. So why not fight on BCH?",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "ia5bn49",
                                                            "author": "anon_chase",
                                                            "score": 3,
                                                            "created_utc": 1653619636.0,
                                                            "response": "Not a bad take, I own some ripple for this reason only. It might take off big time",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "ia5crwr",
                                                                    "author": "JarmoViikki",
                                                                    "score": 1,
                                                                    "created_utc": 1653620207.0,
                                                                    "response": "Yes. I think there will be a liquidation event looming, like covid crash in 2020 for XRP and from that it will shoot up.\n\nIt really is one of those coins that one would like to hedge against btc failure. Having 7 transactions/second cannot cater the transactional needs of 8+ billion people.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "ia5guzq",
                                    "author": "richardamullens",
                                    "score": 4,
                                    "created_utc": 1653622305.0,
                                    "response": "The all time low on Kraken was about €65",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia5rmka",
                                            "author": "ApplicationAny1434",
                                            "score": 5,
                                            "created_utc": 1653628801.0,
                                            "response": "We who here since original Bitcoin spit look to BCH/BTC pair. Price at all time low, he just sold maybe at bottom.\n\nIf I do right with mining calculator, 1 BCH cost $174 electricity in USA.\n\nIm no TA expert but I see on the weekly end of a downtrend that lasted 1267 days(3.4years). \n\nThats how I see the [chart](https://freeimage.host/i/X1wiXI)",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia7xy0o",
                                                    "author": "richardamullens",
                                                    "score": 1,
                                                    "created_utc": 1653674247.0,
                                                    "response": "If you bought BCH using fiat, then I would say that the appropriate measure of BCH's performance is its price in fiat.  If you bought BCH with the proceeds of a sale of BTC then yes perhaps now is the all time low.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "ia67778",
                                    "author": "mikedalton194",
                                    "score": 1,
                                    "created_utc": 1653641437.0,
                                    "response": "You people can't be real, I refuse to believe there are people this stupid.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "ia5fba7",
                            "author": "number_go_up",
                            "score": 1,
                            "created_utc": 1653621506.0,
                            "response": "It was you? I was wondering who was buying all that BCH. \\^\\_\\^\n\n[https://research.sideshift.ai/weekly-report-3rd-9th-may-2022/](https://research.sideshift.ai/weekly-report-3rd-9th-may-2022/)\n\n[https://research.sideshift.ai/weekly-report-10th-16th-may-2022/](https://research.sideshift.ai/weekly-report-10th-16th-may-2022/)\n\n[https://research.sideshift.ai/weekly-report-17th-23rd-may-2022/](https://research.sideshift.ai/weekly-report-17th-23rd-may-2022/)",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia8it3w",
                                    "author": "tmw2442",
                                    "score": 1,
                                    "created_utc": 1653683535.0,
                                    "response": "Imagine losing your childrens inheritance on a scam (btc).",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "ia5ge8m",
                            "author": "xjunda",
                            "score": 1,
                            "created_utc": 1653622060.0,
                            "response": "Me too 😂",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia7vszf",
                                    "author": "Bors1",
                                    "score": 0,
                                    "created_utc": 1653673335.0,
                                    "response": "You people sure like to lose money lol..\n\n Bitcoin will go down so will your money .",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "ia85sbn",
                            "author": "autoahven",
                            "score": 1,
                            "created_utc": 1653677666.0,
                            "response": "Too much fraud bots or stupid humans, that's the question....",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia6m9zq",
                    "author": "nlfanmherrb",
                    "score": 6,
                    "created_utc": 1653653086.0,
                    "response": "I sold all my shitcoins for the bitcoin cash . I hope I made the right choice .",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia6n1c7",
                            "author": "dave_aj",
                            "score": 1,
                            "created_utc": 1653653538.0,
                            "response": "Hopium … The king of all strategies.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "ia71q8f",
                            "author": "ApplicationAny1434",
                            "score": 0,
                            "created_utc": 1653660878.0,
                            "response": "I buy some smallcaps like $krom, I think thats easiest way to 2x my BCH until it take off.\n\nThats what I do since bear 2018 trade alts to have more BTC and BCH.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia5wvt1",
                    "author": "WippleDippleDoo",
                    "score": 11,
                    "created_utc": 1653632586.0,
                    "response": "> BCH did not make it. \n\n1.) buy high into crypto for wrong reasons\n\n2.) sell low\n\n3.) blame crypto in butthurt reddit post",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia84epi",
                            "author": "sarotphan",
                            "score": 1,
                            "created_utc": 1653677065.0,
                            "response": "People are slowly realising the true capabilities of the real BitCoin enjoy the journey .",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia5gjdn",
                    "author": "jbrev01",
                    "score": 2,
                    "created_utc": 1653622135.0,
                    "response": "You should have waited for the price to go back up.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia8hr6d",
                            "author": "pet_2g",
                            "score": 1,
                            "created_utc": 1653683052.0,
                            "response": "Yep I’m 100% BCH  too. Storage options are not ideal .",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia6pid0",
                    "author": "roisnatsif",
                    "score": 2,
                    "created_utc": 1653654947.0,
                    "response": "I didn’t know anybody actually bought BCH. Sorry for your loss",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia8h3gq",
                            "author": "boedi070885",
                            "score": 1,
                            "created_utc": 1653682754.0,
                            "response": "The reality is that this in the market now because we can't really expect that we will get the profit only from this market\n\nWe have to be ready for it is a bridge because this is the market and this is what we already have seen that being in the market.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia75tjb",
                    "author": "tripj33",
                    "score": 2,
                    "created_utc": 1653662636.0,
                    "response": "Not everyone will reach the end. Good luck to you too",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia7gd8f",
                            "author": "JarmoViikki",
                            "score": 1,
                            "created_utc": 1653666989.0,
                            "response": "Thank you. You too.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia8p11p",
                    "author": "mred_btce",
                    "score": 2,
                    "created_utc": 1653686459.0,
                    "response": "You will live long enough to regret this decision. But good luck .",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia5mwe7",
                    "author": "FutureNotBleak",
                    "score": 7,
                    "created_utc": 1653625739.0,
                    "response": "I just dumped a couple grand to buy more.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia5pc0t",
                            "author": "JarmoViikki",
                            "score": 7,
                            "created_utc": 1653627257.0,
                            "response": "I hope from the bottom of my heart that you succeed in this.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia5pim6",
                                    "author": "FutureNotBleak",
                                    "score": 5,
                                    "created_utc": 1653627378.0,
                                    "response": "I’m okay with holding it for a couple years or more. The way I see it, only BTC and BCH had immaculate conception and are both POW.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia5qzfk",
                                            "author": "JarmoViikki",
                                            "score": 1,
                                            "created_utc": 1653628356.0,
                                            "response": "But do not you think the cabal will destroy btc or bch?\n\nThey can do it easily by putting regulations in the manner that the exchanges are forced to delist them.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia5sex3",
                                                    "author": "FutureNotBleak",
                                                    "score": 9,
                                                    "created_utc": 1653629348.0,
                                                    "response": "Let the currency wars begin. The ruling overlords will not go down without a fight. Hubris is their folly and pride goeth before the fall. \n\nMany poorer countries will grab on to the only pricing mechanism on the planet that makes sense i.e. Bitcoin. This will happen while the ruling overlords cling on to their failing bonds and wonder why while feeling contempt against putting their wealth in a barbarous relic like gold. \n\nSo we shall see. This is a hill that we should all be willing to die on because the alternative will be lifelong servitude on our knees.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "ia5z809",
                                                    "author": "BewareOfShills",
                                                    "score": 3,
                                                    "created_utc": 1653634423.0,
                                                    "response": ">But do not you think the cabal will destroy btc or bch?\n\nIf you don't fight, you already lost.\n\n>They can do it easily by putting regulations in the manner that the exchanges are forced to delist them.\n\nIf it were that easy I would say it deserves to die.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "ia6dltl",
                                                            "author": "JarmoViikki",
                                                            "score": 1,
                                                            "created_utc": 1653647088.0,
                                                            "response": "The thing is that the elite is about to pick the next dollar (ie world reserve currency which is digital and it is unlikely it is bch - I guess Claus Schwab et al do not even know about bch). \n\nThis does not mean bch would necessarily die - it can continue the same path as it is going today. Being the currency of the extremely depressed and oppressed people. However, from the point of view of an investment, it is not very lucrative market to invest in.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "ia6ed91",
                                                                    "author": "BewareOfShills",
                                                                    "score": 2,
                                                                    "created_utc": 1653647697.0,
                                                                    "response": "You said nothing new.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                },
                                                                {
                                                                    "id": "ia8ace7",
                                                                    "author": "radekjanowski",
                                                                    "score": 1,
                                                                    "created_utc": 1653679697.0,
                                                                    "response": "Totally depends on what kind of currency we are using for that.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "ia9fism",
                                                            "author": "Alex_Kudr",
                                                            "score": 1,
                                                            "created_utc": 1653699843.0,
                                                            "response": "Regulations are going to be there then we have to wait for dead the better options.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "ia67two",
                            "author": "m0r3p0w3r",
                            "score": 1,
                            "created_utc": 1653642016.0,
                            "response": "Needs to be diversified if you own mostly all shitcoins.\n\nAt least you didn’t sell all your real bitcoin cash .",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia67ymg",
                                    "author": "FutureNotBleak",
                                    "score": 3,
                                    "created_utc": 1653642130.0,
                                    "response": "There is only BTC and BCH for me. Primarily BTC. Everything else is open season at the casino if you’re a gambler/trader.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia6ejik",
                    "author": "_potato-potato_",
                    "score": 4,
                    "created_utc": 1653647831.0,
                    "response": "Wise choice my friend.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia9tj7b",
                            "author": "ajaylonger",
                            "score": 1,
                            "created_utc": 1653707257.0,
                            "response": "If they are watching that then e arre going to see it even now lol.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia5kmy3",
                    "author": "BTC_Throwaway_1",
                    "score": 4,
                    "created_utc": 1653624403.0,
                    "response": "Thank you for your service. See you on the flip side.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia87wos",
                            "author": "ctamseo",
                            "score": 1,
                            "created_utc": 1653678613.0,
                            "response": "Indeed this is the flip side this is what we had needed as well.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia5e7dg",
                    "author": "saylor_moon",
                    "score": 5,
                    "created_utc": 1653620943.0,
                    "response": "LOL, short sellers getting desperate.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia5quv0",
                    "author": "CelebrateStyle",
                    "score": 3,
                    "created_utc": 1653628270.0,
                    "response": "Serious question, is this a btc sub or a bch sub? Shouldn't there be two different subs?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia5zguk",
                            "author": "BewareOfShills",
                            "score": 13,
                            "created_utc": 1653634623.0,
                            "response": "r/bitcoin was and is heavily censored. No discussion allowed there. Many big block bitcoiners moved here. And they are still here and big block bitcoin is now BCH.\n\nBut you can discuss anything related to bitcoin.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia7km50",
                                    "author": "boubilami",
                                    "score": 4,
                                    "created_utc": 1653668716.0,
                                    "response": "Hell yea! Still shorting some but might bring that money to work instead, or more BCH .\n\nWe appreciate your sacrif...  Er...  SOUND FINANCIAL DECISION.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia7kvbk",
                                            "author": "BewareOfShills",
                                            "score": 1,
                                            "created_utc": 1653668818.0,
                                            "response": "🤷‍♂️",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "ia6cfx8",
                            "author": "Shibinator",
                            "score": 3,
                            "created_utc": 1653646118.0,
                            "response": "https://bitcoincashpodcast.com/faqs/Other/what-happened-with-rbtc",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "ia6kdcu",
                            "author": "8fht9",
                            "score": 2,
                            "created_utc": 1653651911.0,
                            "response": "All your friends and fam will be very confused when bitcoin cash moons and you are still poor.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia8d2o1",
                                    "author": "CelebrateStyle",
                                    "score": 1,
                                    "created_utc": 1653680930.0,
                                    "response": "Pipe dreams of a delusional bedroom lazy cahnt, go out and make something happen you pathetic parrot",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "ia9lxm2",
                                    "author": "Kongfuagam",
                                    "score": 1,
                                    "created_utc": 1653703236.0,
                                    "response": "Totally depends on how much they have invested in the past as well.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "ia5rpbu",
                            "author": "JarmoViikki",
                            "score": 0,
                            "created_utc": 1653628850.0,
                            "response": "BCH.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia8kx31",
                                    "author": "turbomajner",
                                    "score": 1,
                                    "created_utc": 1653684511.0,
                                    "response": "Me too! Especially after the devestating news today.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "ia5t078",
                            "author": "GrapefruitGlum",
                            "score": -6,
                            "created_utc": 1653629760.0,
                            "response": "There is bitcoin sub and bch sub. And this sub which pretends to be neutral but is a hardcore bch sub",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia76tjq",
                                    "author": "unknown8482btce",
                                    "score": 1,
                                    "created_utc": 1653663055.0,
                                    "response": "Could you provide a link? Am curious to know how you know this thx .",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia8m0vr",
                                            "author": "12swat14",
                                            "score": 3,
                                            "created_utc": 1653685032.0,
                                            "response": "They are definitely going to pretend about it there is nothing more than that.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "ia77qkc",
                                            "author": "GrapefruitGlum",
                                            "score": 1,
                                            "created_utc": 1653663436.0,
                                            "response": "Hahahahahaha",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia99jlm",
                                                    "author": "btctestaccount",
                                                    "score": 2,
                                                    "created_utc": 1653696668.0,
                                                    "response": "There is nothing more than that we can do something about it just laugh.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "ia5t371",
                                    "author": "CelebrateStyle",
                                    "score": -6,
                                    "created_utc": 1653629818.0,
                                    "response": "I'm in the wrong sub then, I don't give a fook about bch",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia5v4th",
                                            "author": "Neonightmares",
                                            "score": 1,
                                            "created_utc": 1653631286.0,
                                            "response": "*Fork",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia8fn3b",
                                                    "author": "onybus",
                                                    "score": 1,
                                                    "created_utc": 1653682089.0,
                                                    "response": "Such a tough question… We’ll never really know the answer .",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "ia8pnnx",
                                            "author": "Bittarder",
                                            "score": 1,
                                            "created_utc": 1653686760.0,
                                            "response": "An opinion is not a position the same as a position is not an opinion.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia69wvf",
                    "author": "bitcoinjason",
                    "score": 2,
                    "created_utc": 1653643911.0,
                    "response": "You supposed to buy not sell, your giving up on a blue chip",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia62dka",
                    "author": "EmergentCoding",
                    "score": 1,
                    "created_utc": 1653637123.0,
                    "response": "Bye.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia6cvh5",
                    "author": "Alex_graff",
                    "score": 1,
                    "created_utc": 1653646486.0,
                    "response": "Wait, why??? That’s insane , if you ask me . You really need to be patient.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia6dazp",
                            "author": "JarmoViikki",
                            "score": 3,
                            "created_utc": 1653646844.0,
                            "response": "The thing is that there is not that much time left. The great reset happens likely this year.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia6llsz",
                                    "author": "danger89",
                                    "score": 2,
                                    "created_utc": 1653652683.0,
                                    "response": "Great reset of what?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia85pht",
                                            "author": "yiying125",
                                            "score": 0,
                                            "created_utc": 1653677631.0,
                                            "response": "I don't really know about it because this is something new to me.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "ia6nc67",
                                    "author": "dave_aj",
                                    "score": 1,
                                    "created_utc": 1653653717.0,
                                    "response": "What are you doing to prepare for the reset?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia8vevb",
                                            "author": "minghaizai",
                                            "score": 1,
                                            "created_utc": 1653689535.0,
                                            "response": "We'll be have to certainly be ready for it because this is going to happen.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia8vt6g",
                                                    "author": "dave_aj",
                                                    "score": 1,
                                                    "created_utc": 1653689727.0,
                                                    "response": "Properly forming meaningful sentences should be high on the list.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "ia9mvov",
                            "author": "rogaarties",
                            "score": 1,
                            "created_utc": 1653703740.0,
                            "response": "Which attorney have to do that only because you won't be having any other option.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia5eecc",
                    "author": "Gattaca256",
                    "score": -4,
                    "created_utc": 1653621046.0,
                    "response": "You made a good choice, there is nothing unique about BCH anymore than other chains don't do better.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia5ubqx",
                            "author": "darkbluebrilliance",
                            "score": 5,
                            "created_utc": 1653630697.0,
                            "response": "You made a bad choice, there is nothing unique about other chains anymore than BCH doesn't do better.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia9nrix",
                                    "author": "tomek1904",
                                    "score": 1,
                                    "created_utc": 1653704215.0,
                                    "response": "Doubt about the fact that we have to aim for something better only.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "ia5gcym",
                            "author": "xjunda",
                            "score": 9,
                            "created_utc": 1653622041.0,
                            "response": ">there is nothing unique about BCH.\n\nWonder why you are wasting your time here?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia5ms44",
                                    "author": "TenshiS",
                                    "score": -3,
                                    "created_utc": 1653625666.0,
                                    "response": "Probably to save lost souls",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia93hln",
                                            "author": "as364136341h424",
                                            "score": 1,
                                            "created_utc": 1653693549.0,
                                            "response": "And it no doubt about the fact that we can't really do anything about it.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "ia8665v",
                                    "author": "zerhborg",
                                    "score": -1,
                                    "created_utc": 1653677840.0,
                                    "response": "Visit any got a lot of time left because we have been there in the past.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "ia5rwxz",
                            "author": "knowbodynows",
                            "score": 3,
                            "created_utc": 1653628996.0,
                            "response": "Most ubiquitous payment option where crypto is accepted for legal goods & services.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia6lv19",
                    "author": "Gaujo",
                    "score": 1,
                    "created_utc": 1653652839.0,
                    "response": "XMR seems to be leading the digital cash front after surpassing us in MC.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia62zv0",
                    "author": "Egon_1",
                    "score": 0,
                    "created_utc": 1653637677.0,
                    "response": "If anyone is interested, I tagged /u/JarmoViikki as Tether boy and supporter of Celsius \n\nhttps://www.reddit.com/r/btc/comments/r8c42a/so_if_you_have_deposited_funds_with_celsius_you/hn756oz/?context=3\n\nhttps://archive.ph/mUsIU",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia96jbd",
                            "author": "poquoh",
                            "score": 3,
                            "created_utc": 1653695103.0,
                            "response": "Thank you for providing the source it is definitely going to help me.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia57g73",
                    "author": "PapaChonson",
                    "score": -7,
                    "created_utc": 1653617558.0,
                    "response": "I sold all my BCH for VET recently… only time will tell",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia57zud",
                            "author": "Zyoman",
                            "score": 8,
                            "created_utc": 1653617828.0,
                            "response": "You think VET has better fundamental and chance to be widely used than BCH?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia594bu",
                                    "author": "PapaChonson",
                                    "score": 0,
                                    "created_utc": 1653618371.0,
                                    "response": "I believe VET being partners with DNV and Wal-Mart, amongst others, with a niche in logistical tracking has an opportunity for amazing growth. I hope BCH has a future as well because it works, but I needed to cut one of my investments to make another I saw opportunity in and BCH was my choice. I may very well have made a terrible decision but only time will tell 🤷🏻‍♂️",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "ia9bdni",
                            "author": "jaunitasq0w",
                            "score": 1,
                            "created_utc": 1653697638.0,
                            "response": "Only the time is going to tell that which changes is going to be there according to it.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia5ohnx",
                    "author": "Lucky_Letter_2730",
                    "score": -7,
                    "created_utc": 1653626720.0,
                    "response": "What did u expect from BCH while the king BTC is massivly down suffering ?  Same as Ethereum\n\n&#x200B;\n\nBCH is just another shitcoin sorry to say that :)",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia6d3r0",
                            "author": "nomer3k",
                            "score": 3,
                            "created_utc": 1653646682.0,
                            "response": "Same here, 100% BCH. I would now be embarrassed to have BTC and no interest in the other 2000 useless coins and tokens.\n\nThere is only one!",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia9s2z8",
                                    "author": "410984195",
                                    "score": 1,
                                    "created_utc": 1653706469.0,
                                    "response": "What about the fact that new projects are definitely going to work.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "ia5rccq",
                            "author": "JarmoViikki",
                            "score": 2,
                            "created_utc": 1653628609.0,
                            "response": "BTC is not a king. It is an old fat fart.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia8fxgo",
                                    "author": "mahenzis",
                                    "score": 1,
                                    "created_utc": 1653682219.0,
                                    "response": "Sure, take only risks accordingly to what you can afford.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia61t8n",
                    "author": "tralxz",
                    "score": 1,
                    "created_utc": 1653636620.0,
                    "response": "Thanks for coins :D",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia69bq9",
                    "author": "johndoeisback",
                    "score": 1,
                    "created_utc": 1653643366.0,
                    "response": "Capitulation?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia9u8h3",
                            "author": "kalmanpool",
                            "score": 1,
                            "created_utc": 1653707643.0,
                            "response": "I don't really know what it because it came to me recently.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia6binj",
                    "author": "Rollovann1996",
                    "score": 1,
                    "created_utc": 1653645337.0,
                    "response": "Really hoping you're not talking lots of money invested.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia6dp13",
                    "author": "scullymaywood",
                    "score": 1,
                    "created_utc": 1653647159.0,
                    "response": "Dumped coins going down for a coin that’s pumping.\n\nI agree it’s better off in hex but ultimately not a great strategy lol.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia6e43u",
                            "author": "JarmoViikki",
                            "score": 0,
                            "created_utc": 1653647501.0,
                            "response": "If XRP reaches its goal, it will be worth hundreds of dollars each. With current coin supply. That is how big of deal this is.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia6lqxv",
                                    "author": "danger89",
                                    "score": 5,
                                    "created_utc": 1653652771.0,
                                    "response": "Xrp is really a scam. Just saying.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "ia6f4kf",
                                    "author": "heslo_rb26",
                                    "score": 3,
                                    "created_utc": 1653648277.0,
                                    "response": "Current coin supply in circulation for Ripple is 48,343,101,197\n\nThere's simply no way it will be worth hundreds of dollars per coin; especially with Ripple corp holding a massive supply of the coin itself",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia7x3f1",
                                            "author": "JarmoViikki",
                                            "score": 0,
                                            "created_utc": 1653673882.0,
                                            "response": "The demand for the world reserve currency is unprecedented. Literally everybody in our world of 8 billion people will have even a minor stake in this. Some directly, some indirectly. \n\nThat is a big deal. Bigger than many can deal.   \nI am surprised this was never the vision of BCH. All it is a method of payment for a cup of coffee in some shithole.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "ia7w2l6",
                                    "author": "This_gone_nanners",
                                    "score": 2,
                                    "created_utc": 1653673447.0,
                                    "response": "You poor soul.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia9ua68",
                                            "author": "jyuktresdvcx",
                                            "score": 1,
                                            "created_utc": 1653707668.0,
                                            "response": "No doubt what the fact that a lot of people are actually facing problems.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "ia9ckll",
                                    "author": "Mineallcoins",
                                    "score": 1,
                                    "created_utc": 1653698272.0,
                                    "response": "We know about the deal of something out of my mind ol.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia6l59h",
                    "author": "danger89",
                    "score": 1,
                    "created_utc": 1653652398.0,
                    "response": "Move to where the smart money is going. I get it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia6napr",
                    "author": "junebeats16",
                    "score": 1,
                    "created_utc": 1653653693.0,
                    "response": "that's a hilarious decision mate but good luck for your future .",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia6pf49",
                    "author": "big--if-true",
                    "score": 1,
                    "created_utc": 1653654897.0,
                    "response": "Capitulation. It seems to be happening. People sell for many reasons and if there isnt enough cash on the sidelines the price recedes. When the reverse happens and there isnt enough crypto for sale, it goes up.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia6x7op",
                    "author": "SmoothOperator9000",
                    "score": 1,
                    "created_utc": 1653658816.0,
                    "response": "I guess not all of us are gonna make it. BCH for the win!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia98hm3",
                            "author": "plateane",
                            "score": 1,
                            "created_utc": 1653696118.0,
                            "response": "Forget me that I have to wait for some more time to see that what changes that is going to bring in the current system\n\nTo bring some other changes then it is definitely going to be the better option for now if you ask me.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia6zbw7",
                    "author": "gurnec",
                    "score": 1,
                    "created_utc": 1653659799.0,
                    "response": ">[**I feel sorry...**](https://www.reddit.com/r/btc/comments/skf31d/i_feel_sorry/)\n>\n>...For those people who are cashing out their cryptos at this market.\n>\n>They make potentially very big financial mistake that they will regret in the coming years.\n\nOf course, you're welcome to do as you please, but this post of yours talks about a timescale of years, and you made it less than 4 months ago....",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia98f28",
                            "author": "thijshoutenbos",
                            "score": 1,
                            "created_utc": 1653696082.0,
                            "response": "Few months back we already had seen that this market was currently working on the basic tool it actually needed and it was money\n\nIf the money supply in the market and everyone is going to bring the place and everything is 12 ghost mode on.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia7itwu",
                    "author": "garysimms",
                    "score": 1,
                    "created_utc": 1653667990.0,
                    "response": "To sell your Bitcoin cash for sh!tcoin is pretty bold  to say the least.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia87atw",
                    "author": "forknomore",
                    "score": 1,
                    "created_utc": 1653678342.0,
                    "response": "It is frustrating to see lower prices everyday. Especially if you believed Bitcoin Cash since beginning.\n\nI have the same feeling. I probably lost a life changing money and it does not feel good. I believed utility and capacity. But it appears BRAND is more important for masses.\n\nI hoped visionary people would see more than BRAND, Bitcoin Cash's potential. But speculating market with Doge is a lot easier and profitable apparently.\n\nAnyway here we are. I do not blame you. Last 5 years is not easy to handle. Good luck.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia87h4z",
                    "author": "Warm-Top-4816",
                    "score": 1,
                    "created_utc": 1653678418.0,
                    "response": "Sad to see you go. Was almost tempted to do so too with the loss i took on Luna, at times you really have no choice. Got into p2e like shiryo and axie infinity, more or less that's what has been keeping me afloat",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia8xbax",
                    "author": "iguanarchist",
                    "score": 1,
                    "created_utc": 1653690463.0,
                    "response": "I don't have a dog in this fight, but I don't believe BCH is done. On the contrary, I think that BCH's moment will come in the aftermath of ETH flipping BTC.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia9oze8",
                    "author": "Lekje",
                    "score": 1,
                    "created_utc": 1653704851.0,
                    "response": "I'm glad I didn't only buy bch 2 years ago. After buying bch, I decided layer on also to buy som btc.\n\nI saved my ass with btc",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia60trq",
                    "author": "minitoxin",
                    "score": -2,
                    "created_utc": 1653635763.0,
                    "response": "DEJA VU ?  This  reminds me of some  fella  who traded 10,000 BTC for a pizza a few years ago. Blinded by short term gain  he didn't fully  comprehend the value of the token that he held\n\n Me .. I ain't selling , ill give it to my grand kids if I ever have any and they can continue to HODL.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia64ayz",
                            "author": "PumpkinSpice2Nice",
                            "score": 2,
                            "created_utc": 1653638828.0,
                            "response": "He still has loads of Bitcoin so he didn’t exactly suffer.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "ia9j801",
                            "author": "ly27856963",
                            "score": 2,
                            "created_utc": 1653701803.0,
                            "response": "Personal then I will say that this is only a good option we are having right now other than that everything is not going to work\n\nWe have to make a lot of changes and a lot of sacrifices as well just in case you want something new.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia6rsgl",
                    "author": "TinosNitso",
                    "score": -1,
                    "created_utc": 1653656167.0,
                    "response": "One issue, like at [whybitcoincash.com](https://whybitcoincash.com), is that BCH is being compared to fiat cash, when it could be compared to [CashGold](https://www.ebay.com/itm/164961330561) (100mg, or 10mg, bars of gold embedded inside polymer). It's the internet equivalent of a decentralized gold standard, while BTC is a less decentralized version (due to congestion, it's closer to heavy bullion).\n\nAnother issue is the lack of wide support for **USDT (SLP)**. So lots of us are using TRON or BSC instead (I only use Tron).\n\nIt looks like instead of truly supporting Bitcoin & its forks, most ppl chose to maximize potential profits by supporting something else instead. Hence we're left with over-valued bullion!",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}