{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "urrhio",
            "title": "Could lightning network be the fix for Bitcoin' scaling problems?",
            "url": "https://www.reddit.com/r/btc/comments/urrhio/could_lightning_network_be_the_fix_for_bitcoin/",
            "author": "Gwen765",
            "created_utc": 1652808208.0,
            "score": 152,
            "num_comments": 167,
            "subreddit": "btc",
            "selftext": "The Bitcoin blockchain network has continued to receive a huge barrage of criticism owing to the architecture of the layer 1 network and its proof-of-work consensus model which makes it inefficient in terms of Transaction speed and cost.\n\nBitcoin mining, which is the popular lingo for describing how transaction validation is carried out, has even been banned in some nations due to its enormous energy consumption and carbon emission… all of which poses a threat to main scale adoption of the network for transaction processing.\n\nIn solving this scalability challenge, the Lightning Network which is a “second-layer solution” was built separately on top of the Bitcoin network, but still interacts with it… and by skirting the main Bitcoin blockchain, it helps to speed up transaction process while reducing cost\n\nThe Lightning Network works in a manner which is similar to other layer 1 blockchain networks such as MATIC, fantom, zetrix and several others which utilize the Proof-of-stake consensus mechanism to process transactions… resulting in very high speed and low cost.\n\nNow, with the Innovative Lightning network fully available and functional, could this be the much needed fix to bitcoin' scalability challenge?",
            "stickied": false,
            "comments": [
                {
                    "id": "i8z4pld",
                    "author": "jessquit",
                    "score": 20,
                    "created_utc": 1652811385.0,
                    "response": "> The Lightning Network works in a manner which is similar to ... several others which utilize the Proof-of-stake consensus mechanism\n\nWell there it is folks.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i947ipq",
                            "author": "pet_2g",
                            "score": 1,
                            "created_utc": 1652904929.0,
                            "response": "Something which btc people are really are against lol.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8z5j1x",
                            "author": "Contrarian__",
                            "score": -21,
                            "created_utc": 1652811721.0,
                            "response": "There what is? A nonsense claim? Gottem.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8z6e8k",
                                    "author": "Shibinator",
                                    "score": 22,
                                    "created_utc": 1652812074.0,
                                    "response": "Greg still trolling /r/btc \n\nNearly five years, still salty, still coming back for more.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i95c4t4",
                                            "author": "Monolitr",
                                            "score": 3,
                                            "created_utc": 1652923089.0,
                                            "response": "Well it seems like some people will always remain salty.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i8z6qws",
                                            "author": "Contrarian__",
                                            "score": -21,
                                            "created_utc": 1652812217.0,
                                            "response": "Salty about what, exactly? Constantly being proven right?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8z7twa",
                                                    "author": "Shibinator",
                                                    "score": 20,
                                                    "created_utc": 1652812659.0,
                                                    "response": "Literally everything it seems.\n\nOtherwise you'd have moved on with your life.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i935m9g",
                                                            "author": "ltcdaigro",
                                                            "score": 1,
                                                            "created_utc": 1652889581.0,
                                                            "response": "What's so hard about just accepting some things? Jusr accept them.",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "i8z8oml",
                                                            "author": "Contrarian__",
                                                            "score": -17,
                                                            "created_utc": 1652813008.0,
                                                            "response": "It's still fulfilling to warn users off scams and correct misinformation. One doesn't really need to \"move on\" from that.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8z94x5",
                                                                    "author": "Shibinator",
                                                                    "score": 22,
                                                                    "created_utc": 1652813191.0,
                                                                    "response": "The whole Internet and crypto industry of scams and misinformation.\n\nBut this sub is the bit you're obsessed with.\n\nLol says it all.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i95a2qd",
                                                                            "author": "APXOH",
                                                                            "score": 1,
                                                                            "created_utc": 1652922118.0,
                                                                            "response": "Well some people just want to make their point no matter what that is man.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        },
                                                                        {
                                                                            "id": "i8z9vw3",
                                                                            "author": "Contrarian__",
                                                                            "score": -3,
                                                                            "created_utc": 1652813497.0,
                                                                            "response": "Hits with the ol' whataboutism attack. It's not effective!\n\nMaybe you can help /u/jessquit with his reasoning and actually discuss the topic instead of crying about me?",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i94wn7q",
                                                                                    "author": "vicovolk",
                                                                                    "score": 2,
                                                                                    "created_utc": 1652915783.0,
                                                                                    "response": "Neither your argument lol, you really need to work on that dude. Trust me.",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "id": "i95d99h",
                                                                    "author": "marruck33",
                                                                    "score": 1,
                                                                    "created_utc": 1652923610.0,
                                                                    "response": "Well You're the one spreading misinformation here so There's that.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i96yran",
                                                                            "author": "Contrarian__",
                                                                            "score": 1,
                                                                            "created_utc": 1652962493.0,
                                                                            "response": "Misinformation like...?",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i955blo",
                                                    "author": "bosscui",
                                                    "score": 2,
                                                    "created_utc": 1652919885.0,
                                                    "response": "Proven right by whom? That's my next question now. By whom dude?\n\nIt seems to me that You've been living in echo chamber and you need to get out of that.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i96ypt0",
                                                            "author": "Contrarian__",
                                                            "score": 1,
                                                            "created_utc": 1652962470.0,
                                                            "response": "> Proven right by whom? That's my next question now. By whom dude?\n\nAsk Jessquit when he eventually apologized to me.\n\n> To Contrarian__ and a lesser extent Zectro -- you've been a real pain in my ass for the last year. Turns out, you were right all along. Please forgive my willingness to go along and see how things turn out. Some things do need to be dragged into the sunshine to die. Thanks to both of you for your work compiling and exposing the myriad lies, plagiarisms, and frauds committed by the Attacker in Chief.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i8zeyhx",
                                    "author": "jessquit",
                                    "score": 12,
                                    "created_utc": 1652815568.0,
                                    "response": "Transactions routed over stake-based network, no work proofs needed except where LN touches the blockchain. If channels are created with factories, users never even see the blockchain.\n\nIt's a clumsy but fair comparison.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8zfx1w",
                                            "author": "Contrarian__",
                                            "score": -3,
                                            "created_utc": 1652815965.0,
                                            "response": "The LN isn't a *consensus* network at all. It's not a globally shared state. It's not a blockchain. There's not even \"proof\" of stake. It doesn't suffer from the problems PoS coins do. Even if you controlled 100% of the LN, you can't steal from users.\n\nIt's a bunch of bilateral Bitcoin contracts.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8zl4u8",
                                                    "author": "jessquit",
                                                    "score": 12,
                                                    "created_utc": 1652818115.0,
                                                    "response": ">The LN isn't a *consensus* network at all.\n\nAgreed.\n\n>  It's not a globally shared state. \n\nAgreed.\n\n> It's not a blockchain.\n\nAgreed.\n\n(I think these are all weaknesses, but we agree)\n\n> There's not even \"proof\" of stake.\n\nSure there is. Your stake is proven to your counterparties when you form contracts with them. If you don't have stake, you can't participate in routing. The more stake you have, the more you can route.\n\n>It's a bunch of bilateral Bitcoin contracts.\n\nIt may not be implemented like other systems which run on stake. But it's definitely a system that moves money based on stake - and nothing else.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8zn2og",
                                                            "author": "Contrarian__",
                                                            "score": 0,
                                                            "created_utc": 1652818920.0,
                                                            "response": "> Your stake is proven to your counterparties when you form contracts with them.\n\nBut this has nothing to do with any kind of *consensus*, which is the entire point of PoS or PoW. You're not voting on anything using your \"stake\". You can't force anyone to do anything with your \"stake\". You're just committing funds, period. You don't even \"prove\" it to parties other than your *direct* counterparties.\n\n> But it's definitely a system that moves money based on stake - and nothing else.\n\nNo. Not \"nothing else\". LN must run on top of an existing consensus network. If it were based on \"nothing\" but \"stake\", then big LN nodes could cooperate to steal funds, but they can't. Why can't they? Does it have something to do with \"stake\"?\n\nThis is even more misleading than calling PoW a form of PoS (of electricity and ASICs). At least that's somewhat comprehensible, even if it's boneheaded. This is boneheaded *and* incomprehensible.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8zpqv0",
                                                                    "author": "jessquit",
                                                                    "score": 9,
                                                                    "created_utc": 1652820038.0,
                                                                    "response": "\n>No. Not \"nothing else\". LN must run on top of an existing consensus network.\n\nThat network isn't used to make transactions though. It's just used to prove the stake.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9226xa",
                                                                            "author": "throwawayo12345",
                                                                            "score": 2,
                                                                            "created_utc": 1652869410.0,
                                                                            "response": "LN is just IOU's with shitty fucking routing. You have the base layer to settle onto and it is used to determine the actual IOU amount when there is a disagreement.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i92ni27",
                                                                                    "author": "Contrarian__",
                                                                                    "score": 2,
                                                                                    "created_utc": 1652881912.0,
                                                                                    "response": "> LN is just IOU's\n\nStill not right. An “IOU” is an unsecured and informal promise to pay at some indefinite time in the future. LN transactions are none of those three things. They’re secured, enforceable by either party with precise terms, and have a fixed time horizon. They’re not even promissory notes, which are more formal, since those don’t need to be secured (and even if they were, you could still sell the underlying security, which you can’t do with LN).",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i948huu",
                                                                                            "author": "throwawayo12345",
                                                                                            "score": 1,
                                                                                            "created_utc": 1652905328.0,
                                                                                            "response": "An IOU is not by definition unsecured.\n\nYou 'sell' the underlying security by closing the channel.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "id": "i8zwcee",
                                                                            "author": "Contrarian__",
                                                                            "score": 2,
                                                                            "created_utc": 1652822805.0,
                                                                            "response": "> It's just used to prove the stake.\n\nThat’s just a straight up lie. If that were true, the underlying layer would never change. \n\nMaybe it’ll help you to think of it as “trustless batch processing”. \n\nNo matter how you spin it, it’s nothing like proof of stake.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i91l0hk",
                                                                                    "author": "jessquit",
                                                                                    "score": 4,
                                                                                    "created_utc": 1652854199.0,
                                                                                    "response": "Lightning is a system that routes transactions over the funds staked in a set of non mining nodes that are collecting rents on the stake being used to facilitate transfers.\n\nConsider the model. A miner has no stake and his relative utility is based on the work it can perform. A Lightning node performs no work and his relative utility is based on the stake it can prove.\n\nConsider the failure modes.  Actual Bitcoin centralizes if an attacker can exert too much work. Lightning centralizes if an attacker can exert too much stake.\n\n> trustless batch processing\n\nNo matter how you spin it, it's more like proof of stake than proof of work. Stake is needed. Work is not.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i922ffl",
                                                                                            "author": "throwawayo12345",
                                                                                            "score": 2,
                                                                                            "created_utc": 1652869605.0,
                                                                                            "response": "But stake is secondary and ties into proof of work.\n\nThere is plenty to be critical of LN but this isn't it.\n\nThere is nothing inherently wrong with PoS, and people need to realize this. What is needed, is using PoW initially to get a wide distribution of tokens.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        },
                                                                                        {
                                                                                            "id": "i9275ge",
                                                                                            "author": "Contrarian__",
                                                                                            "score": 2,
                                                                                            "created_utc": 1652873082.0,
                                                                                            "response": "This is fundamentally ridiculous and you know it. This has **zero** to do with consensus or voting, which is the **entire point** of PoW and PoS. You’re just playing with the word “stake”. \n\nIs a savings account a “proof of stake” system? A mortgage? A lemonade stand? Eating at Morton’s?\n\nIf we loosen the term to have almost no meaning and squint hard, and give ourselves a lobotomy, then yes! All these and lightning (and Bitcoin) are “proof of stake” systems. \n\nBut if we are in reality and actually use the terms the way they’re meant to be used, then no. Obviously not. \n\nBe better. I’m disappointed.\n\nEdit:\n\n> No matter how you spin it, it's more like proof of stake than proof of work. Stake is needed. Work is not.\n\nLol at “more like”. It’s obviously neither since it’s like asking whether an apple is more like proof of stake or proof of work. It’s simply inapplicable because an apple is not a consensus mechanism. It’s a *category error*.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "id": "i94avbw",
                                                                                    "author": "johuckabie",
                                                                                    "score": 1,
                                                                                    "created_utc": 1652906292.0,
                                                                                    "response": "I don't even understand why you guys even arguing over it lol.",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "id": "i93dywo",
                                                                    "author": "duan269",
                                                                    "score": 1,
                                                                    "created_utc": 1652892949.0,
                                                                    "response": "LN doesn't have any consensus that just proves that it's centralised to me.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "i92sity",
                                                            "author": "kapral29",
                                                            "score": 0,
                                                            "created_utc": 1652884158.0,
                                                            "response": "Yeah a fair argument for sure, a lot better than some people make here.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i943zmm",
                                                    "author": "evilorfien",
                                                    "score": 1,
                                                    "created_utc": 1652903483.0,
                                                    "response": "Okay but it is centralised, which I don't think bitcoiners like.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i92ydqe",
                                            "author": "garysimms",
                                            "score": 1,
                                            "created_utc": 1652886619.0,
                                            "response": "Yep, this could have been done better, but it's fine too I guess.\n\nIt's important to make a point and this is doing that here so I guess this is a fair argument.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i925rca",
                                    "author": "jaunitasq0w",
                                    "score": 2,
                                    "created_utc": 1652872121.0,
                                    "response": "Dude you need to chill out and figure out the reality. It's not that hard.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8zi9lk",
                    "author": "Remora_101",
                    "score": 20,
                    "created_utc": 1652816930.0,
                    "response": ">Now, with the Innovative Lightning network fully available and functional,\n\nLol?\n\nhttps://twitter.com/sethforprivacy/status/1522919244253614081\n\nhttps://twitter.com/DavidShares/status/1101524232033439744\n\nhttps://twitter.com/davidshares/status/1095469511283785733?s=21\n\nhttps://twitter.com/abrkn/status/1177857657337724928?s=21\n\nhttps://twitter.com/DoctorOrrery/status/1503317804577325056\n\n\nTo be blunt. LN sucks ass",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8yyq56",
                    "author": "MobTwo",
                    "score": 43,
                    "created_utc": 1652808978.0,
                    "response": "Lightning Network is not only a joke (eg. https://np.reddit.com/r/btc/comments/qx4vnq/see_lightning_works_narrator_no_doesnt_breeze_ceo/ ) but there are other more serious problems than the lack of onboarding capacity on the Lightning Network. People had lost their money on the lightning network due to security flaws. Thanks to BitcoinXio for making this compilation.\n\nResearchers Uncover Bitcoin ‘Attack’ That Could Slow or Stop Lightning Payments https://www.coindesk.com/researchers-uncover-bitcoin-attack-that-could-slow-or-stop-lightning-payments\n\nAndreas Brekken: \"I've been asked quite a bit why I took down the largest Lightning Network node, LN.shitcoin.com. Constant anxiety was the deciding factor. > When a channel is created, the receiver of the channel was not required to verify the amount of the funding transaction\" https://old.reddit.com/r/btc/comments/dae1g0/andreas_brekken_ive_been_asked_quite_a_bit_why_i/\n\nLightning Network Security Vulnerability Full Disclosure: CVE-2019-12998 / CVE-2019-12999 / CVE-2019-13000 https://lists.linuxfoundation.org/pipermail/lightning-dev/2019-September/002174.html\n\nLightning Network dev: \"We've confirmed instances of the CVE being exploited in the wild. If you’re not on the following versions of either of these implementations then you need to upgrade now to avoid risk of funds loss\" https://lists.linuxfoundation.org/pipermail/lightning-dev/2019-September/002148.html\n\nLightning Network security alert: Security issues have been found in various lightning projects which could cause loss of funds! https://lists.linuxfoundation.org/pipermail/lightning-dev/2019-August/002130.html\n\n\"PSA: The Lightning Network is being heavily data mined right now. Opening channels allows anyone to cluster your wallet and associate your keys with your IP address.\" https://old.reddit.com/r/btc/comments/budmfh/on_twitter_psa_the_lightning_network_is_being/\n\nForget 18 months: it’s now 30-50 years until Lightning Network is ready https://old.reddit.com/r/btc/comments/bh1gzw/forget_18_months_its_now_3050_years_until/\n\nAnalysis Shows Lightning Network Suffers From Trust Issues Exacerbated by Rising Fees https://news.bitcoin.com/analysis-shows-lightning-network-suffers-form-trust-issues-exacerbated-by-rising-fees/\n\nLightning users must be online to make a payment, funds must be locked to use, is a honey pot, completion rate deminishes with high value payments, and more https://medium.com/starkware/when-lightning-starks-a90819be37ba\n\nTIL that Lightning Network conceptual design and focus to layer 2 scaling for BTC was introduced in February 2013, over 6 years ago (LN whitepaper released February 2015, 4 years ago) https://old.reddit.com/r/btc/comments/b201kd/til_that_lightning_network_conceptual_design_and/\n\n\"Out of the 1,500 orders submitted on the first day [using Lightning Network], only around 10 percent were successful\" https://breakermag.com/i-ordered-lightning-pizza-and-lived-to-tell-the-tale/\n\nLightning Network has become a complete train wreck. Oh by the way, it's no longer 18 months but YEARS until it's ready for mass-consumption. https://old.reddit.com/r/btc/comments/aw71q8/lightning_network_has_become_a_complete_train/\n\nDecentralized path routing is still an unsolved problem for Lightning Network (currently \"source routing\" works at this scale) https://old.reddit.com/r/btc/comments/avt6ow/do_people_agree_with_andreas_antonopoulos_that/\n\nLightning Network bank-wallet is \"kind of centralized but it has to be this way if you want mass-adoption\" https://old.reddit.com/r/btc/comments/aup68s/lightning_network_bankwallet_is_kind_of/\n\n5 Things I Learned Getting Rekt on Lightning Network https://old.reddit.com/r/btc/comments/atx8jq/psa_important_video_to_watch_if_you_use_lightning/\n\nListen to this great talk on the problems and complexities of using HTLC's on the Lightning Network ⚡️, and possible alternatives. https://old.reddit.com/r/btc/comments/atmlnp/listen_to_this_great_talk_on_the_problems_and/\n\nThe current state of Bitcoin companies & dealing with Lightning Network ⚡Highlights: Hard to implement, takes a ton of man hours, with no return on investment. LN adds zero utility. The only reason some companies support it is for marketing reasons. https://old.reddit.com/r/lightningnetwork/comments/asuoyy/the_current_state_of_bitcoin_companies_dealing/\n\nCurrent requirements to run BTC/LN: 2 hard drives + zfs mirrors, need to run a BTC full node, LN full node + satellite, Watchtower and use a VPN service. And BTC fees are expensive, slow, unreliable. https://old.reddit.com/r/btc/comments/aspkj2/current_requirements_to_run_btcln_2_hard_drives/\n\n18 Months Away? Latest Lightning Network Study Calls System a 'Small Central Clique' https://news.bitcoin.com/18-months-away-latest-lightning-network-study-calls-system-a-small-central-clique/\n\nLightning Network DDoS Sends 20% of Nodes Down https://www.trustnodes.com/2018/03/21/lightning-network-ddos-sends-20-nodes\n\nWatchtowers (third party services) are introduced as a way to monitor your funds when you can't be online 24/7 so they aren't stolen https://medium.com/@akumaigorodski/watchtower-support-is-coming-to-bitcoin-lightning-wallet-8f969ac206b2\n\nStudy finds that the probability of routing $200 on LN between any two nodes is 1% https://diar.co/volume-2-issue-25/\n\nIf you spend time checking, there are always new security vulnerabilities on Lightning Network.\n\n(Recently) Source: https://protos.com/bitcoin-lightning-tipping-telegram-bot-hacked-cryptocurrency/\n\n(Recently) Source: https://bitcoinmagazine.com/technical/solving-jamming-attacks-lightning-network\n\nMore lightning Network problems at  https://github.com/davidshares/Lightning-Network/\n\nLightning Network has so much security problems that I no longer spend time to keep track. =)",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8z6w5j",
                            "author": "Graphenist",
                            "score": -28,
                            "created_utc": 1652812276.0,
                            "response": "A lot of fearmongering in this post. Id go through these one by one but it would take too much time. Its better to refine your list to a palatable few bulletpoints. But scanning through these, it looks like you are reporting \"bugs\" in most of these bulletpoints. All software has had bugs at one point or another. Bugs get fixed. Really, I would like to see a list of Lightning issues that are currently unsolved, not an exhaustive history of every time something went wrong that they had to patch.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i91d3c4",
                                    "author": "jaimewarlock",
                                    "score": 7,
                                    "created_utc": 1652848560.0,
                                    "response": "There is a difference between bugs and design flaws. You can fix bugs, but you can't fix design flaws. Many of those are design flaws.\n\nFor a recent example look at the Luna network. The code worked just fine, but it had a design flaw that caused people to lose over 99% of their money in a matter of hours.\n\nThere were engineers that warned them about this design flaw, but they chose to ignore it.\n\nThey could have designed Terra/Luna to temporarily lose it's peg during any serious attack or death spiral, but in their arrogance, they choose not to do that. \n\nThe lightning network is basically a hyper-complicated Rube Goldberg machine designed to fool non-engineers.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8z9epu",
                                    "author": "MobTwo",
                                    "score": 17,
                                    "created_utc": 1652813301.0,
                                    "response": "> it looks like you are reporting \"bugs\". All software has had bugs at one point or another. Bugs get fixed.\n\nWhat I am hearing from you. \"Lightning network has so much bugs and errors and exploits, but which software doesn't have them, therefore it must be acceptable that people lost their money on lightning network. I know using lightning network sucks but hey there are other software that sucks too, therefore it must be acceptable.\"\n\nNo, I don't accept that. That's why I use Bitcoin Cash. It's instant and I never had to pay more than a single cent on transaction fees in my years of using Bitcoin Cash. =D",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i94a93p",
                                            "author": "zaerocosmic",
                                            "score": 1,
                                            "created_utc": 1652906045.0,
                                            "response": "Yeah you're right, it's just a software ad they have bugs.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i8zh71d",
                                            "author": "Graphenist",
                                            "score": -15,
                                            "created_utc": 1652816485.0,
                                            "response": "You need to be more fair. In the early days of LN, of course there was a lot of bugs. Are there these same major bugs now? I believe many of these are fixable and already fixed.\n\nObviously while Lightning was in its experimental stage nobody should have put more Bitcoin on there than what they could afford to lose. Now though, I think its becoming mainstreamed so now id give it that level of responsibility.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8zmuxz",
                                                    "author": "ShortSqueeze20k",
                                                    "score": 14,
                                                    "created_utc": 1652818831.0,
                                                    "response": "Is it still true that in the lightning whitepaper they said the lightning network needs 133mb on BTC to work?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8zugva",
                                                            "author": "tenuousemphasis",
                                                            "score": -4,
                                                            "created_utc": 1652822017.0,
                                                            "response": "Yes, to handle all transactions worldwide. We're a long way from there and a lot of improvements (Schnorr, channel factories) may make that unnecessary.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8zvl0i",
                                                                    "author": "ShortSqueeze20k",
                                                                    "score": 12,
                                                                    "created_utc": 1652822484.0,
                                                                    "response": "So basically a bunch of ways other than the way Satoshi said to scale?\n\n\"It can be phased in, like: if (blocknumber > 115000) maxblocksize = largerlimit\"",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i900f6s",
                                                                            "author": "tenuousemphasis",
                                                                            "score": -8,
                                                                            "created_utc": 1652824587.0,
                                                                            "response": "Satoshi was a fallible human, not a god. There are betters ways to scale than \"put every cup of coffee on the blockchain, forever\". You have a brain, presumably. Why not use it?",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i900w5a",
                                                                                    "author": "ShortSqueeze20k",
                                                                                    "score": 10,
                                                                                    "created_utc": 1652824797.0,
                                                                                    "response": "So you know better than the person who created it, I understand.\n\n“Long before the network gets anywhere near as large as that, it would be safe for users to use Simplified Payment Verification (section 8) to check for double spending, which only requires having the chain of block headers, or about 12KB per day. Only people trying to create new coins would need to run network nodes. At first, most users would run network nodes, but as the network grows beyond a certain point, it would be left more and more to specialists with server farms of specialized hardware. A server farm would only need to have one node on the network and the rest of the LAN connects with that one node.\n\nThe bandwidth might not be as prohibitive as you think. A typical transaction would be about 400 bytes (ECC is nicely compact). Each transaction has to be broadcast twice, so lets say 1KB per transaction. Visa processed 37 billion transactions in FY2008, or an average of 100 million transactions per day. That many transactions would take 100GB of bandwidth, or the size of 12 DVD or 2 HD quality movies, or about $18 worth of bandwidth at current prices.\n\nIf the network were to get that big, it would take several years, and by then, sending 2 HD movies over the Internet would probably not seem like a big deal. \"\n\nSatoshi Nakamoto Sun, 02 Nov 2008",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i9043iy",
                                                                                            "author": "tenuousemphasis",
                                                                                            "score": -10,
                                                                                            "created_utc": 1652826243.0,
                                                                                            "response": "> it would be safe for users to use Simplified Payment Verification (section 8) to check for double spending\n\nYou can't use SPV to ensure that the consensus rules are followed. So relying on everyone but large data centers running SPV is an immediately failure of minimizing trust.\n\nWhoops.\n\nYes, I'm saying I know more about how bitcoin works than Satoshi did in 2008, because 1) bitcoin has changed significantly since then and 2) we've learned a lot about how it actually works *in practice* that Satoshi couldn't have possibly known.\n\nRemember, Satoshi thought that mining and validating would always be the same thing. They haven't for nearly a decade.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "id": "i922nh4",
                                                                    "author": "throwawayo12345",
                                                                    "score": 2,
                                                                    "created_utc": 1652869789.0,
                                                                    "response": "You're fucking it all up for absolutely no reason. BCH nodes have shown they can handle gigabyte blocks on Raspberry Pi's. This bullshit argument of keeping it at 1.3 mb is hilariously dead but people keep on trying to resurrect it.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i93ktgw",
                                                                            "author": "tenuousemphasis",
                                                                            "score": 1,
                                                                            "created_utc": 1652895710.0,
                                                                            "response": "It's not for no reason. I have no interest in a cryptocurrency with gigabyte blocks, the barrier for entry of running a node is far too high.\n\nThe only feasible way to scale a cryptocurrency to global use is to make use of trustless off-chain payments. Lightning is the best implementation of that yet.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i946htd",
                                                                                    "author": "throwawayo12345",
                                                                                    "score": 1,
                                                                                    "created_utc": 1652904506.0,
                                                                                    "response": "You have to explain how it is too high.\n\nINB4 Node startup - checkpointing secured by PoW is being tested; Storage is nothing because that is easily pruned.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i94n5wt",
                                                                                            "author": "tenuousemphasis",
                                                                                            "score": 1,
                                                                                            "created_utc": 1652911480.0,
                                                                                            "response": "1 GB blocks means you receive 240 GB per day and transmit 2 TB per day (assuming the minimum of 8 peers). That is far outside the capabilities of most home internet connections.\n\nI'm also very skeptical of the claim that a Raspberry Pi can validate 1 GB of transactions every 10 minutes.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i90kqv1",
                                                    "author": "knowbodynows",
                                                    "score": 7,
                                                    "created_utc": 1652834144.0,
                                                    "response": "[\"I am strictly a Monero person, at this time.“](http://np.reddit.com/r/btc/comments/uru1sj/why_was_bch_created_when_the_big_block_community/)\n\nHey.. oddly interesting! The Monero person is also a LN defender. Not exactly a purist.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i90pp9z",
                                                            "author": "Graphenist",
                                                            "score": -5,
                                                            "created_utc": 1652836482.0,
                                                            "response": "Lightning Network is not a coin. Its a system. I wish LN existed on Monero. I havent contradicted myself.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i91qlu3",
                                                                    "author": "LovelyDayHere",
                                                                    "score": 2,
                                                                    "created_utc": 1652858853.0,
                                                                    "response": "Any written analyses from the Monero research community about the Lightning network?\n\nGenerally, over here we've discussed the LN for a long time, and witnessed countless security and UX issues with it. Some of those security issues were raised in academic papers, so I guess the MRL should have some opinions on those... or there would at least be Lightning documents showing how these issues were resolved by fixes to the LN.\n\nGuess what I'm asking is based on what research do you wish for this to be added to Monero?",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i8zbgk5",
                                    "author": "JapGOEShigH",
                                    "score": 9,
                                    "created_utc": 1652814144.0,
                                    "response": "u/chaintip\n\nSend me some back pls. Would love to try lightning!",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8zbkzo",
                                            "author": "chaintip",
                                            "score": 6,
                                            "created_utc": 1652814195.0,
                                            "response": "***\nu/Graphenist, you've [been sent](https://www.blockchain.com/bch/address/bitcoincash:qrelay2fvenav0j72646d7v67f8fs6e785vn309vz2) `0.00483259 BCH` | `~0.98 USD` by u/JapGOEShigH\nvia [chaintip](http://www.chaintip.org). Please [claim it!](https://www.chaintip.org/reddit#claim)\n***",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i8zexcw",
                                            "author": "Graphenist",
                                            "score": -9,
                                            "created_utc": 1652815555.0,
                                            "response": "Im afraid im going to have to give you your BCH back, because im a Monero person, and i wouldnt touch BTC with a 12 foot long stick. I only like/appreciate Lightning in theory and wish a private implementation of it existed, especially om XMR.\n\nu/chaintip 0.00483259",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8zhg40",
                                                    "author": "JapGOEShigH",
                                                    "score": 7,
                                                    "created_utc": 1652816590.0,
                                                    "response": "I'd love monero even more tbh!\n\nSend me some pls :D\n\nu/chaintip",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8zi3r0",
                                                            "author": "emergent_reasons",
                                                            "score": 10,
                                                            "created_utc": 1652816864.0,
                                                            "response": "*Fatality*",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8zixmz",
                                                                    "author": "JapGOEShigH",
                                                                    "score": 9,
                                                                    "created_utc": 1652817206.0,
                                                                    "response": "It's just so sad.\n\nAll this noise in the crypto space, which was born out of the first successful p2p-e-cash protocol. \n\nTo actually stumble across a p2p TX, is nonexistent mostly.\n\nThat is of course, outside of the BCH cosmos.\n\nWith BCH I send 2-5 TX per day, or more :D\n\nu/chaintip",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i8zj8er",
                                                                            "author": "emergent_reasons",
                                                                            "score": 7,
                                                                            "created_utc": 1652817327.0,
                                                                            "response": "It is. We keep moving.\n\nAnd thanks!",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        },
                                                                        {
                                                                            "id": "i8zj1h3",
                                                                            "author": "chaintip",
                                                                            "score": 6,
                                                                            "created_utc": 1652817249.0,
                                                                            "response": "***\nu/emergent_reasons, you've [been sent](https://www.blockchain.com/bch/address/bitcoincash:qrelay2wujkz6ulln4a4envra2m8g5vl75jjzqhqt8) `0.00238034 BCH` | `~0.50 USD` by u/JapGOEShigH\nvia [chaintip](http://www.chaintip.org).\n***",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "i8zhj8j",
                                                            "author": "chaintip",
                                                            "score": 6,
                                                            "created_utc": 1652816626.0,
                                                            "response": "***\nu/Graphenist, you've [been sent](https://www.blockchain.com/bch/address/bitcoincash:qrelay2kdcp2j7x73a2c7hmjs8rg9cpjaq5zjgv3p9) `0.0238929 BCH` | `~5.01 USD` by u/JapGOEShigH\nvia [chaintip](http://www.chaintip.org). Please [claim it!](https://www.chaintip.org/reddit#claim)\n***",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i94tj4b",
                                    "author": "as364136341h424",
                                    "score": 1,
                                    "created_utc": 1652914331.0,
                                    "response": "He put so much time into it, and you don't even wanna check?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i94uyvh",
                                            "author": "Graphenist",
                                            "score": 1,
                                            "created_utc": 1652914999.0,
                                            "response": "This is a copypaste list of every complaint hes heard of the LN ever. He didnt put that much time into this. But it would take me hours to dissect it.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i92ucx7",
                            "author": "YeOldDoc",
                            "score": -5,
                            "created_utc": 1652884941.0,
                            "response": "This copypasta list is mostly bullshit, e.g. FUD or obsolete for many years. One of the cited \"serious\" problems is a misrepresentation of capacity statistics published by me 4 years ago. \n\nSo use with caution, exemplary FUD tactics common in this sub:\n\n- **\"Bitcoin was hacked\"** when actually **\"One Bitcoin exchange was hacked\"**\n- **\"LN has a security flaw\"** when actually **\"A programmer of a LN tipping bot misinterpreted the API of one LN implementation\"**\n- **\"Researcher discovers fatal LN flaw\"** when actually **\"A Lightning Network developer discovered and fixed a possible exploit\"**\n\n> Lightning Network has so much security problems that I no longer spend time to keep track. =)\n\nI would suggest reading the LN dev mailing list. LN developers are actually quite eager in publishing and discussing issues within LN. In comparison, I have never seen a comparable self criticism by BCH devs who propose a pyramid of SPV nodes with increased trust and hardware requirements (please post a link to such if you found some).",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i93dw7s",
                                    "author": "ChaosElephant",
                                    "score": 1,
                                    "created_utc": 1652892919.0,
                                    "response": "[Bitcoin was hacked](https://etherbalance.io/#history)",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8zu42n",
                    "author": "Egon_1",
                    "score": 13,
                    "created_utc": 1652821863.0,
                    "response": "**Since 2015 still a no**\n\nBitcoin Cash is the scaling solution for bitcoin",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9043m5",
                            "author": "LovelyDayHere",
                            "score": 6,
                            "created_utc": 1652826244.0,
                            "response": "u/chaintip onchain transactions ftw!",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i904px8",
                                    "author": "chaintip",
                                    "score": 5,
                                    "created_utc": 1652826532.0,
                                    "response": "***\nu/Egon_1, you've [been sent](https://www.blockchain.com/bch/address/bitcoincash:qrelay253qp0k5rdkjyvzv3ul0f3s6f7pgkt4haaew) `0.001 BCH` | `~0.21 USD` by u/LovelyDayHere\nvia [chaintip](http://www.chaintip.org).\n***",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i92bjfr",
                                    "author": "Egon_1",
                                    "score": 3,
                                    "created_utc": 1652875821.0,
                                    "response": "Thanks, buddy!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8z67sm",
                    "author": "coleyrockinagain",
                    "score": 12,
                    "created_utc": 1652812000.0,
                    "response": "Used a lightning platform for shits and giggles, wasn't able to access money for over a week while transaction settled. Honestly think I lost that money but worth the price of experimentation, and in BTC defense I should have done more research",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8zlf7c",
                    "author": "Neutral_User_Name",
                    "score": 13,
                    "created_utc": 1652818236.0,
                    "response": "Have you been living under a rock?\n\nLOL",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8zt4ce",
                    "author": "hero462",
                    "score": 12,
                    "created_utc": 1652821439.0,
                    "response": "OP sounds like he's having some epiphany.lol  Where's he been? 🤣 BTC was neutered on purpose.  LN  is a poor solution for scaling.  They should've gotten it right first  but instead it just became an excuse to chase adoption away from Bitcoin.   Good thing there's BCH as Bitcoin: A P2P electronic cash system.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8zec78",
                    "author": "kingofthejaffacakes",
                    "score": 9,
                    "created_utc": 1652815314.0,
                    "response": "Hahahaha.\n\nGive it a try for a week.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8zawdv",
                    "author": "Leithm",
                    "score": 8,
                    "created_utc": 1652813915.0,
                    "response": "Hmmm let me think, ...... no.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8z7r68",
                    "author": "Br0kenRabbitTV",
                    "score": 22,
                    "created_utc": 1652812627.0,
                    "response": "Even if it did (it doesn't) it is now impossible to fix the attitude of \"never spend Bitcoin blah blah blah\" when the community is 95% full of people who have no interest in peer to peer cash at all.\n\nThese newcomers who only came around all time highs in 2017, and even more in 2021 now have the loudest voice and this attitude of never using it as peer to peer cash is spreading faster.\n\nI have an LN payment option, but barely anybody uses it and I'm getting to the point where I'm thinking about removing BTC/LN completely, just like Steam, Microsoft, Stripe and others..\n\n..as well as putting effort into spamming this bullshit, at least make an effort to get people spending BTC again, or it is all for nothing anyway, even if LN somehow becomes more suitable for payments.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9055t6",
                            "author": "JustMyTwoSatoshis",
                            "score": -5,
                            "created_utc": 1652826733.0,
                            "response": "“Effort to get people to spend bitcoin”\n\nI love how this sub just acts like the world is full of nothing but dumb people and dumb business owners.\n\nWhen spending any crypto saves people or businesses time and/or money compared to just using their credit card, they will do it.\n\nIt won’t have to be sold. People like saving time and money.\n\nIn all the years this sub has been around, not once has anyone demonstrated it saving time or money for anyone. Sure, you show an on-chain purchase where a merchant receives the payment using a third party custodial app. \"Wow! So easy! So Fast! So cheap!\".... What you guys refuse to show or even acknowledge is every other part of the process, like buying the crypto in the first place, or buying it for “spend and replace”, or the part where the merchant exchanges the crypto for the fiat that their business depends on, and what that process is like in terms of cost and time. Oh and then of course there are the tax implications.\n\nThe reality is that the world is full of plenty of smart people, and people involved in crypto are IMO, on average, smarter than most people. Plenty of them have tried the process of spending crypto on retail goods and services and realized how fucking retarded it is for so many reasons, non of which have to do with on chain fees.\n\nLastly, spending money is not a problem 99% of the world has. And the solutions that have achieved that can be easily replicated with crypto. There is no reason we won't be bale to simply select BTC over dollars in the checkout lane when we swipe our credit or debit cards, or use apple pay, venmo, paypal or anything else we currently use. There is zero practical reason it needs to be a dramatically different process for crypto.\n\nI predict LN will never grow in adoption significantly because it is overengineered and overcomplicated for the very few use cases it makes sense for. There are simpler nad more elegant solutions.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i90bdmb",
                                    "author": "Br0kenRabbitTV",
                                    "score": 9,
                                    "created_utc": 1652829645.0,
                                    "response": "I didn't say anybody was dumb..\n\n..I'm mostly just having a dig at people who push LN as a solution TBH.\n\nYou surely don't think the average \"HODLer\" crypto bro is smart though.\n\nMost of them just jumped on the ATH train in 2017 and again in 2021.\n\nI agree there are a lot of hurdles, but that's what I mean about people needing to make an effort if they actually want to see BTC or crypto in general used for day to day payments. The best way I've found to get people to actually pay in crypto is simply by having in demand products and offering decent 15% discount for crypto purchases, you be surprised how many people will go to the effort for a lower price. I've been accepting crypto on webstores since 2011 now, don't use any third party payment processors for any coin, the checkout process now days is simple, fluid and just as fast as paying with CC if a user has a mobile wallet with a QR reader, or is on PC with a desktop wallet so they can copy and paste the address.\n\nWith BTC/LN my issue is the attitude in the communities to never spend it etc.. the people in charge of the larger BTC communities could easily push the peer to peer cash use case a lot more but they don't at all. Until 2017 I only accepted BTC, so it was 100% of my crypto income, now days it's around 5% at most, even with a LN option. The most used coins in 2022 are BCH and LTC by far, followed by XMR, and a few others, even DOGE is spent more than BTC with me now. I only keep BTC as an option because I'm stubborn.\n\nWhat's the point of promoting LN to users but not promoting the actual use of it..\n\nLook how many people there are in the crypto space though, millions and millions, if they stopped thinking about how much the next person will pay in fiat for their crypto and started accepting it on their webstores, at their businesses, and people who don't have business started supporting those who do by going to the effort of using it with them and seeking out those who do accept it, it will become a more popular payment method much faster, people will eventually start asking other stores \"why don't you accept crypto?\", other business owners will see it widely accepted and start thinking about adding it as a payment option. The effort needs to come first from people who are actually into crypto already.\n\nBut yes I agree, LN is not going to do well at all, in all honesty I only added it to play devils advocate, I knew people would rarely use it, but can at least say I accept it, because otherwise when I tell people that hardly anybody pays with BTC any more, they will not be able to do the old \"BuT HaVE YoU HeArD Of LiGhTnInG!111??\" bullshit. BTC has gone backwards and been set back by many years for the peer to peer cash use case, at one point we had people like Steam, Microsoft, and Stripe onboard, massive companies that actually have a lot of customers. BTC devs and the new wave of \"investors\" set retail adoption back years..\n\nI told you already how it saves my customers some money, for me it allows me to save fees on third party payment processors, and a lot of money that is lost each year with chargebacks and similar from scammy type customers. Currently I pass those savings on to customers to incentivise them to spend the crypto in the first place, as I am making an effort to spread adoption and use of crypto, but if it ever did just become a widely used payment system, I could keep those savings for myself.\n\nPS: AFAIK the [bitcoin.com](https://bitcoin.com) register app and the mobile wallet are not custodial at all, those are the two apps you keep seeing being used in videos in this sub, correct me if I'm wrong.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i90docs",
                                            "author": "JustMyTwoSatoshis",
                                            "score": -6,
                                            "created_utc": 1652830755.0,
                                            "response": "> offering decent 15% discount for crypto purchases, you be surprised how many people will go to the effort for a lower price.\n\nNo I wouldn't. Like I said, people love saving time and/or money.\n\n>the checkout process now days is simple, fluid and just as fast as paying with CC if a user has a mobile wallet with a QR reader, or is on PC with a desktop wallet so they can copy and paste the address.\n\nYes, it really is. Not being sarcastic, I agree. It's the rest of the process and the hurdles I detailed in my last comment that are the problem. 15% discounts will still motivate them past that. Of course, expecting merchants to take 15% less is gonna be a high expectation.\n\n>With BTC/LN my issue is the attitude in the communities to never spend it etc.. the people in charge of the larger BTC communities could easily push the peer to peer cash use case a lot more but they don't at all.\n\nPeople don't need to push anything. It's not my job or your job or anyone elses to push anything. If a solution is the most practical solution for any application, then it will be used as a solution for that application, period.\n\nI like paying less taxes. So I almost always hold any crypto I buy for a year or longer to lessen the tax hit if I do sell it. I also have no problem spending money and would rather spend my inflationary fiat than my deflationary crypto. Does that make me have an agenda? Am I supposed to actively convince people to do something I personally find to be extremely impractical and would never do myself.\n\n>Look how many people there are in the crypto space though, millions and millions, if they stopped thinking about how much the next person will pay in fiat for their crypto and started accepting it on their webstores, at their businesses, and people who don't have business started supporting those who do by going to the effort of using it with them and seeking out those who do accept it, it will become a more popular payment method much faster, people will eventually start asking other stores \"why don't you accept crypto?\", other business owners will see it widely accepted and start thinking about adding it as a payment option. The effort needs to come first from people who are actually into crypto already.\n\nI disagree with all of this. Again, it the solution offers a competitive edge, it won't need agenda pushers.\n\nI don't need to force a square peg into a round hole. I don't need to be convincing others to do that either.\n\n>I told you already how it saves my customers some money\n\nBecause you offer a 15% discount.... This is a rarity and you are making a personal sacrifice. You are not however demonstrating crypto practicality as a payment solution.\n\n>AFAIK the bitcoin.com register app and the mobile wallet are not custodial at all, those are the two apps you keep seeing being used in videos in this sub, correct me if I'm wrong.\n\nThat's good. I'm glad bitcoin.com is promoting a non-custodial payment solution. Unfortunately that doesn't address most of the other hurdles.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i90emyv",
                                                    "author": "Br0kenRabbitTV",
                                                    "score": 9,
                                                    "created_utc": 1652831216.0,
                                                    "response": "I feel like you keep saying conflicting things TBH.\n\nI don't want to have to wait until I'm almost dead for this to happen, I'd like to see it move faster. If people in other communities were promoting it and making it as easy for merchants to use as they are in here, it would happen a lot faster.\n\nI don't get this \"just hold, have faith it will happen\" attitude from so many people.\n\nThose of us with the ability to push it certainly should IMO.\n\nEspecially those who have the power to sway the opinion of millions of people.\n\nDo you even want to see crypto widely used as payment method?\n\nEDIT: the main people who need to be pushed IMO, is not even business owners, its the masses of people in the crypto space that are actively against spending crypto or using it for it's intended purpose of peer to peer cash. It's these people who came along and treated it like an asset so much, it got classed by governments as one in the first place. Maybe I wasn't clear about who needs pushing TBH. It's all these \"HODL\" type people.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i90fksc",
                                                            "author": "JustMyTwoSatoshis",
                                                            "score": -6,
                                                            "created_utc": 1652831676.0,
                                                            "response": ">I'd like to see it move faster\n\nThen help to address all the hurdles I listed, as well as the price volatility hurdle. Ignoring those hurdles and expecting people to promote crypto as a practical payment tool is foolish.\n\n>I don't get this \"just hold, have faith it will happen\" attitude from so many people.\n\nThis isn't my attitude. My attitude is to do with things what I find practical and beneficial to do with them. And I have no idea why I would expect other people to do more than that either. How dare I expect people to push non-practical solutions to non-existent problems just because I think it's the ultimate goal of crypto or some shit.\n\n>Those of us with the ability to push it certainly should IMO.\n\nGo for it. As long as you are pushing an impractical solution for a neraly non-existent problem, good luck.\n\n>Do you even want to see crypto widely used as payment method?\n\nI want it to be used for what it is useful for. I'm not out here trying to pretend there is a big payments problem in the world and that crypto solves it. I've made enough retail crypto transactions to realize the absurdly inefficiency of it in both time and cost. Sure, I'd love to be able to spend it instead of exchanging it for fiat at times, and I'd love others to be able to do the same. This won't happen until my government recognizes it as currency and not a commodity. It won't happen until that crypto is stable enough in value that I don't have to worry about timing when I spend it. \n\nForcing crypto as a retail payment solution right now is like trying to force people to put square tires on their car. Go for it if you want. Don't shame me cause I won't push that bullshit and don't expect others to either.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i90iios",
                                                                    "author": "Br0kenRabbitTV",
                                                                    "score": 4,
                                                                    "created_utc": 1652833109.0,
                                                                    "response": "We will never get anywhere when the main Bitcoin community doesn't even advocate for it's use as peer to peer cash, they have the biggest reach, and have already influenced all these people that are a massive hindrance to the cause and made it go backwards, while pushing LN which is the least practical solution of them all.\n\nThis whole crypto-asset and store of value nonsense is what has created most of the current hurdles in the first place. None of these people have issues actually buying crypto, and the volatility issue will never be fixed until there are more retail transaction and less speculative ones.. TBH it's fucked, it's pointless to even try and and push it to these people and communities, which is why we are here with the BCH fork, trying to do it right this time and carry on where it went wrong in 2017.\n\nMy initial comment here was just a dig at the BTC community and the people who push LN but don't push the actual use of it and spending of BTC via LN.\n\nThere isn't even an easy solution for merchant to add it without using third party payment processors, they need to spin up a linux server. I'm quite a technical person, but most merchants are not, they will be using a simple store like Woocommerce or similar on shared hosting, which is the type of thing BCH (and other coins that work well on chain) is easy to add to with a simple plugin and no need for third party payment processors.\n\nFor me, my best bet is probably to let go of any hopes anything will change with the BTC community or attitude and just put my time and effort into projects like BCH/XMR now days, but it was hard to let go after over half a decade of pushing for BTC to be used as peer to peer cash and having it screwed over and basically hijacked in the end.\n\nPeople like Steam adding it as an option was a big step, yet refusing to scale on chain made people like that drop it completely and burned a big bridge with many.\n\nIt's sad that people stopped promoting it all as magic internet money, and started promoting it as a get rich scheme, that's where it all went wrong IMHO.\n\nThe people pishing LN as a solution, are the ones that created the problem.\n\nYou are basically saying, even though most people did advocate for BTC as peer to peer cash, when it was actually more practical, now we shouldn't bother because it has been made impractical. This is more a BTC problem TBH, not a BCH, XMR, LTC, DASH etc.. problem. The narrative was completely changed and impractical is the result.\n\nYou're not interested in advocating for it's intended use, got it.\n\nHave a nice night dude.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i90kgwx",
                                                                            "author": "JustMyTwoSatoshis",
                                                                            "score": 2,
                                                                            "created_utc": 1652834012.0,
                                                                            "response": "> We will never get anywhere when the main Bitcoin community doesn't even advocate for it's use as peer to peer cash\n\nAgain, disagree. We will get wherever crypto is useful for. People like useful things. If it ever becomes useful for retail spending, it will be used for that.\n\nThat is the entire disagreement we have here since we are obviously just repeating ourselves over and over on this point.\n\n>You are basically saying, even though most people did advocate for BTC as peer to peer cash, when it was actually more practical, now we shouldn't bother because it has been made impractical.\n\nNo. It was never practical. It was impractical for all the retail transactions I did in 2013-2015 as well. On-chain fees are the easiest problem in the world to overcome: second layers and centralized solutions.\n\nI don't get hung up on the past and why the current time is different. Not on this subject, or any, crypto or otherwise. Why the hell would I be trying to change the past? It already happened.\n\nI've said it on this sub a million times before and I'll say it again: When BCH or any other crypto saves people time or money as a retail solution, consumers and merchants alike will flock to it as a solution. Unfortunately, most BCHers are so hung up on the past like you and so tunnel-visioned about on-chain fees and what people are or aren't pushing that they refuse to address and of the actual hurdles I have listed.\n\nHave a nice night my dude. Enjoyed the discussion.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i90r2bw",
                                                                                    "author": "Br0kenRabbitTV",
                                                                                    "score": 3,
                                                                                    "created_utc": 1652837122.0,
                                                                                    "response": "Just to add one more thing, you are probably right it isn't practical in some countries and for the majority, at least not now, but I just stumbled on a video where the MP from St Maarten was talking, and there it is useful for them due to the crappy existing banking system, and people are flocking it it. He was saying people are just getting it from BCH ATMs when they need it so it is easy for them to get, and they are just getting the amount they need for spending so the volatility is not a major issue.\n\nMaybe I initially found it more useful than others here in the UK as I've often sold high risk products early on where they either were not allowed by some payment processors or CC merchant account providers who would allow certain products, classed them as high risk and demanded not only high fees, but also a reserve to be held. Which in turn was useful (though still complicated) for my customers at times. TBH nothing I sell now really needs crypto as such, as payment processors are now okay with things like CBD products for example, where they weren't initially.. I can even sell them on eBay now days, but when the industry was new, I needed crypto to sell them initially. I guess I just want to carry on the peer to peer cash cause regardless of if I need it to sell high risk products now days, but mostly now due to the issues I am caused with chargebacks and similar with other payment methods, I lose a lot of money due to this type of thing each year from fiat customers.\n\nI just get annoyed that now all most people care about with crypto is the price going up and the fact all they are doing is buying it, promoting it as a get rich scheme, so more people come, pump the price, allowing them to cash out for a profit and leave the promoting to the next wave of investors so they can make a profit. I feel this makes the whole crypto space look bad to normal people and like a ponzi scheme, and that bad look effects our efforts with coins like BCH and XMR as well.\n\nI also don't think 2nd layers and centralised solution are a good option.\n\nExcluding the volatility issue, I feel most hurdles now have been created by the people treating it like an asset, and in turn governments seeing this and obviously classing it as an asset as that is how they see the majority of people using it.\n\nNow that has caused tax hurdles, and more issues for people trying to buy it.\n\nHonestly I wish the price never went up so much it never attracted so many people not interested in it's intended use case, and started getting sold to people as an asset instead. I feel it has and will slow down adoption in places were it is not needed as much, just as we started getting somewhere, with Steam and Microsoft being the best examples.\n\nRight I really need to stop typing now, it's gone 2am here. I won't lie I did get frustrated at points in this discussion, but overall it was a good chat.\n\nIf you reply again I will reply in about 8-10 hours.\n\nGood night.",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8zr5uy",
                    "author": "Twoehy",
                    "score": 7,
                    "created_utc": 1652820623.0,
                    "response": "All incentives dictate that Lightning will be a hub and spoke system, with all of the problems that our existing banking system faces, plus so new fun ones too.\n\nLightning cannot function properly as a TRUE P2P NETWORK and never will without a ground up redesign (at which point it's no longer lightning).\n\nThe thing about Decentralized, permissionless Digital Cash for the whole world is all of those words are necessary. You can't just drop out \"decentralized\" or \"permissionless\" and say mission accomplished.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8zvnx4",
                    "author": "chainxor",
                    "score": 7,
                    "created_utc": 1652822518.0,
                    "response": "No",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8zu6jy",
                    "author": "wayne0811",
                    "score": 5,
                    "created_utc": 1652821893.0,
                    "response": "> The Bitcoin blockchain network has continued to receive a huge barrage of criticism owing to the architecture of the layer 1 network and its proof-of-work consensus model which makes it inefficient in terms of Transaction speed and cost.\n\nThe inefficiency is mainly due to an artificial 1MB block size limit, not necessarily the whole layer 1 architecture.\n\n> Bitcoin mining, which is the popular lingo for describing how transaction validation is carried out, has even been banned in some nations due to its enormous energy consumption and carbon emission… all of which poses a threat to main scale adoption of the network for transaction processing.\n\nBlock [difficulty](https://en.bitcoin.it/wiki/Difficulty) changes every 2016 blocks to maintain the average block time of 10 mins. Fewer miners does not mean slower transaction processing in the long run.\n\n> In solving this scalability challenge, the Lightning Network which is a “second-layer solution” was built separately on top of the Bitcoin network, but still interacts with it… and by skirting the main Bitcoin blockchain, it helps to speed up transaction process while reducing cost\n\nSure... if one assumes the layer 1 blockchain is the bottleneck, and cares little for its peer-to-peer topology, then a centralizing 3rd party service would seem appealing.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8zzqzv",
                    "author": "3pinephrine",
                    "score": 6,
                    "created_utc": 1652824287.0,
                    "response": "If I wanted to use a custodial, off-chain solution simply for speed and convenience, I’d use CashApp/Zelle/ACH.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i90hj4p",
                            "author": "neonzzzzz",
                            "score": -5,
                            "created_utc": 1652832628.0,
                            "response": "Lightning Network protocol isn't custodial. Channel updates are just signed Bitcoin transactions that aren't broadcast to the network immediately (but can be at any point, if any party wants to).",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i94e2uz",
                                    "author": "Remora_101",
                                    "score": 2,
                                    "created_utc": 1652907615.0,
                                    "response": "Generally true, but the devil is in the details. There are multiple forcesd and design problems that make LN centralize over time and channel funds custodial. \n\nYou can see this already in the fact that many wallets are semi of even fully custodial to work around these problems.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i902b1m",
                    "author": "OrigamiMax",
                    "score": 5,
                    "created_utc": 1652825427.0,
                    "response": "Hahaha no",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i908dj7",
                    "author": "Collaborationeur",
                    "score": 5,
                    "created_utc": 1652828225.0,
                    "response": "You've got to understand first that Bitcoin doesn't have a scaling problem. \n\nThe scaling problem was deliberately(!)  introduced into BTC during the 2017 BCH/BTC fork.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i909tmn",
                    "author": "Ancapworld",
                    "score": 3,
                    "created_utc": 1652828911.0,
                    "response": "In 18 months it will solve the problems.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i90do53",
                    "author": "btcxio",
                    "score": 3,
                    "created_utc": 1652830752.0,
                    "response": "No.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i90u3ro",
                    "author": "KeepBitcoinFree_org",
                    "score": 4,
                    "created_utc": 1652838540.0,
                    "response": "No, it creates more problems.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8z6j0e",
                    "author": "tl121",
                    "score": 12,
                    "created_utc": 1652812128.0,
                    "response": "Lightning Network can most definitely fix Bitcoin’s scaling problems, but it will take another ~~18 months~~   18 million years.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8zmb4o",
                    "author": "Neutral_User_Name",
                    "score": 6,
                    "created_utc": 1652818603.0,
                    "response": "> The Lightning Network works in a manner which is similar to other layer 1 blockchain networks such as MATIC, fantom, zetrix and several others which utilize the Proof-of-stake consensus mechanism\n\nWhat the %&*$ are you talking about, that's not how lightning works, at all. Where do you get your information from? A box of Cracker Jacks?\n\n> fully available and functional\n\nLOL",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i92nknv",
                            "author": "post_mortar",
                            "score": 2,
                            "created_utc": 1652881944.0,
                            "response": "No need for attacks to honest questions. Teach instead of scold. 🍻",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8zlz31",
                    "author": "Divniy",
                    "score": 4,
                    "created_utc": 1652818463.0,
                    "response": "Depends on what do you mean by \"fix\". Fix as in solve trillema? No, because LN introduces trust, centralization.\n\nYou may argue that \"but LN is literally coded into BTC!\". This is true. I can set up my own LN node and control my Bitcoin->LN and back transformation. But thing is, most users will not set up their own node!\n\nWhat happened to \"not your keys - not your crypto\"? LN is your money under control of someone else's node. Whoever is trying to push equality sign between Bitcoin onchain and Bitcoin controlled by third-party is a fraudster.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i91wh4b",
                    "author": "johndoeisback",
                    "score": 2,
                    "created_utc": 1652864305.0,
                    "response": ">Could lightning network be the fix for Bitcoin' scaling problems?\n\nDepends on in which sub you ask it. In this one, no.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i92nen8",
                            "author": "post_mortar",
                            "score": 1,
                            "created_utc": 1652881869.0,
                            "response": "Why do you think that is?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i900ii4",
                    "author": "Adrian-X",
                    "score": 1,
                    "created_utc": 1652824627.0,
                    "response": ">**Could lightning network be the fix for Bitcoin' scaling problems?**\n\nNOP! - if the Lightning Network does work, then you wont be paying transaction fees to the miners to secure the BTC blockchain.\n\nSo in time, like paper notes backed by gold transitioned to just being paper notes, so to will BTC digital gold backing LN tokens be replaced by... well the FED or whatever new acronym steps in to save it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8zmd1o",
                    "author": "gym7rjm",
                    "score": 1,
                    "created_utc": 1652818625.0,
                    "response": "I'd much rather see something like ThorChain synths as a decentralized option for L2 scaling",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i91rz3l",
                    "author": "NoPie8947",
                    "score": 1,
                    "created_utc": 1652860082.0,
                    "response": "The lightening network could be a solution too for Bitcoin why not ? But some projects like kadena has great scalability, we are going to see more competitors entering the space but many not gonna succeed anyway.\n\nIf we want Bitcoin to evolve we need more projects being build around etc.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i957n9s",
                    "author": "sunfeihan88",
                    "score": 1,
                    "created_utc": 1652920980.0,
                    "response": "I mean that's what Bitcoiners want to pitch us. They think it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9926ku",
                    "author": "DifficultScience2303",
                    "score": 1,
                    "created_utc": 1652995454.0,
                    "response": "The Lightning Network works in a manner which is similar to ... several others which utilize the Proof-of-stake consensus mechanism",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i993dhe",
                    "author": "DifficultScience2303",
                    "score": 1,
                    "created_utc": 1652996001.0,
                    "response": "The Lightning Network works in a manner which is similar to ... several others which utilize the Proof-of-stake consensus mechanism",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i994i8a",
                    "author": "DifficultScience2303",
                    "score": 1,
                    "created_utc": 1652996519.0,
                    "response": "koli",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9az8oj",
                    "author": "Electronic_War1959",
                    "score": 1,
                    "created_utc": 1653035509.0,
                    "response": "ohhh",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8z2a4a",
                    "author": "Graphenist",
                    "score": -9,
                    "created_utc": 1652810393.0,
                    "response": "Yes, kind of. The challenge of overcoming the huge hurdles of creating a functioning L2 network without any bugs or incentive issues is only Step 1, Step 2 is making it easy to use for the masses. A lot of work has been done for this on Bitcoin, and although its not perfect, its a beautiful solution in theory and is arguably like 90% to where it needs to be in reality.\n\nThe end goal of Lightning on Bitcoin should be getting people to use it without having to make any onchain payments. This means Lightning cold storage, which i believe isnt fully fleshed out yet.\n\nLightning is a beautiful solution to a L2 network because its a noncustodial L2 backed by the full security of onchain Bitcoin, and its security comes from the fact that if anyone tries to steal or interfere with your funds, you can just close your channel and get your money back. Most people arent malicious attackers, and malicious attackers dont get anything from attacking, so thats why it works.\n\nOne of the bigger hurdles to adoption of Lightning is how difficult it is to manage your own channels and liquidity. This is why semi-trusted solutions exist (dont worry, your funds are still noncustodial). This will accelerate Lightning adoption.\n\nLightning is the perfect solution for Bitcoin in its current state. It does have some major problems though, like lack of privacy, but so does Bitcoin itself.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8zlpr5",
                            "author": "Neutral_User_Name",
                            "score": 4,
                            "created_utc": 1652818357.0,
                            "response": "> beautiful solution in theory\n\nShow me the theory.\n\n(be careful what you submit, I already know the theory)",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8z2vss",
                    "author": "swgo1",
                    "score": -14,
                    "created_utc": 1652810634.0,
                    "response": "Yes",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8zk2pe",
                    "author": "ManyArtichoke",
                    "score": -15,
                    "created_utc": 1652817675.0,
                    "response": "This sub is like ground zero for misinformation about the LN.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8zu0nr",
                            "author": "hero462",
                            "score": 8,
                            "created_utc": 1652821822.0,
                            "response": "Thanks for setting us all straight. Lol  Conveniently you ignore all the well referenced LN critiques posted here.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i932vrn",
                                    "author": "abyssal88",
                                    "score": -2,
                                    "created_utc": 1652888465.0,
                                    "response": "Yeah It has been there for quite a long time for the same being.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i93bef6",
                                            "author": "hero462",
                                            "score": 1,
                                            "created_utc": 1652891932.0,
                                            "response": "Bot",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i92nsfu",
                            "author": "post_mortar",
                            "score": 1,
                            "created_utc": 1652882041.0,
                            "response": "Which parts were misinformation?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9317et",
                                    "author": "Svanidze80",
                                    "score": 1,
                                    "created_utc": 1652887775.0,
                                    "response": "I don't know to be honest, this is pretty much new to me if you ask.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i95da38",
                                            "author": "post_mortar",
                                            "score": 2,
                                            "created_utc": 1652923620.0,
                                            "response": "u/MobTwo bot",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8zslm5",
                            "author": "Bag_Holding_Infidel",
                            "score": -7,
                            "created_utc": 1652821222.0,
                            "response": "I have learned more about the LN from the lies told here than anywhere else.\n\nIt has given me the confidence to use it whenever I can.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i92npom",
                                    "author": "post_mortar",
                                    "score": 3,
                                    "created_utc": 1652882007.0,
                                    "response": "Which lies are you referring to?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i95jgc9",
                                            "author": "anthonyativo",
                                            "score": 1,
                                            "created_utc": 1652926482.0,
                                            "response": "I don't think what they are trying to do but let us see what they are referring to as well\n\nI am pretty much not sure about it since how far you can refer to the same thing as well.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i95jz7s",
                                                    "author": "post_mortar",
                                                    "score": 2,
                                                    "created_utc": 1652926735.0,
                                                    "response": "u/MobTwo bot",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i95k295",
                                                            "author": "MobTwo",
                                                            "score": 1,
                                                            "created_utc": 1652926776.0,
                                                            "response": "Thanks, bot removed.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i93cgni",
                                            "author": "Bag_Holding_Infidel",
                                            "score": -1,
                                            "created_utc": 1652892351.0,
                                            "response": "I don't keep records of the lies presented here but this thread is a great example of the misinformation I am referring to.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i94eeap",
                                                    "author": "Remora_101",
                                                    "score": 2,
                                                    "created_utc": 1652907745.0,
                                                    "response": "Yeah nah, without evidence this is just your opinion.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i94rmvx",
                                                            "author": "Bag_Holding_Infidel",
                                                            "score": 0,
                                                            "created_utc": 1652913472.0,
                                                            "response": "Well I was specifically referring to your list of development milestones that you posted.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i95202m",
                                                                    "author": "Remora_101",
                                                                    "score": 1,
                                                                    "created_utc": 1652918313.0,
                                                                    "response": "I believe that you will find that you confused me with someone else. \n\nBut it is irrelevant you still have not produced evidence about the missinformation.\n\n\n>I have learned more about the LN from the lies told here than anywhere else.\n\nYou cannot learn anything from lies. You just confirmed your bias, for which you don't even need to know if it is true or a lie.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i953hcg",
                                                                            "author": "Bag_Holding_Infidel",
                                                                            "score": 1,
                                                                            "created_utc": 1652919013.0,
                                                                            "response": "Apologies, I did confuse you with MobTwo.\n\n> You cannot learn anything from lies.\n\nOf course you can. I don't see LN discussed much elsewhere. I see something negative posted here - I investigate it further, sometimes its a lie, sometimes its something that is still yet to be resolved.\n\nThe negative bias is understandable, since LN is one of the reasons low fee L1's like BCH can't succeed.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i954py6",
                                                                                    "author": "Remora_101",
                                                                                    "score": 1,
                                                                                    "created_utc": 1652919600.0,
                                                                                    "response": "> - I investigate it further,\n\nSo you didn't learn anything from the lies but from the information you gathered. \n\n>sometimes its a lie, sometimes its something that is still yet to be resolved.\n\nLol bias much? XD You can't solve the liquidity problem, since it is a design flaw. \n\n\n>The negative bias is understandable, since LN is one of the reasons low fee L1's like BCH can't succeed.\n\nNot really. LN is a clusterfuck of over engineered madness. It is laughed at even outside of the BCH community. \n\n\nIf I had the choice between a working LN and a working L1 coin I would always choose the L1 coin. So you better pray BCH (or any other coin for that matter) doesn't succeed, because it is the other way round.",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i95csan",
                                                    "author": "post_mortar",
                                                    "score": 1,
                                                    "created_utc": 1652923388.0,
                                                    "response": "If the lies are so handily abundant in this thread, do you want to point to any? one? See, this is why no one takes your side seriously. You bring absolutely no substance to the conversation and talk vaguely about nothing.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i954462",
                                    "author": "wfwoo",
                                    "score": 1,
                                    "created_utc": 1652919317.0,
                                    "response": "We can do that but we actually needs more confidence like that lol.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}