{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uy6yst",
            "title": "Bitcoin Cash Clarification and Bitcoin SV",
            "url": "https://www.reddit.com/r/btc/comments/uy6yst/bitcoin_cash_clarification_and_bitcoin_sv/",
            "author": "NeTinhabitant",
            "created_utc": 1653569626.0,
            "score": 4,
            "num_comments": 2,
            "subreddit": "btc",
            "selftext": "Fairly new to Bitcoin Cash and I am getting sold on it. I'm not sure why things went the way they did through the hard fork. Now from what I hear, the downside increasing block sizes comes with a drawback in security. How serious is this drawback and has there ever been any issues? \n\nNow learning about Bitcoin SV.. Further expanding the block limit and perhaps rendering the chain unsustainable by decreasing the incentive to sell hash power to the network. Plus the multiple 51% attacks the network encountered. Did BCH find the optimal blocksize for current times?",
            "stickied": false,
            "comments": [
                {
                    "id": "ia2bo5q",
                    "author": "mtrycz",
                    "score": 6,
                    "created_utc": 1653572622.0,
                    "response": "Increasing blocks isn't a threat to security as long as it's made in an safe manner. Currently 32MB blocks are perfectly safe. The cap will be increased as needed. \n\nSV split because Mr Wrigth wouldn't have his way in BCH. He is a proven liar, albeit a charismatic one. Like all con artists. \n\nCurrently, a simple Raspberry Pi 4 could easily handle the traffic of 32MB blocks. My own testings say that it can handle up to 128MB blocks, and up to 256MB block with some difficulty. \n\nThere have been performance issues, because we inherited the code from small-blockers, but more and more work is being made to improve the performance. \n\nYou will hear people say that non-mining nodes \"secure the network\". They actually do nothing. \n\nCurrently there is not a big demand for BCH's blocks, and we're ok for the immediate future. Work is being done to remove further bottlenecks and increase the blocksize further, if need arises.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia2du8l",
                    "author": "LovelyDayHere",
                    "score": 1,
                    "created_utc": 1653573573.0,
                    "response": "> Did BCH find the optimal blocksize for current times?\n\nThe miners put whatever transactions there are, into the blocks.\n\nThe block size reflects the demand, and the thing to ensure is that if demand grows, blocks can get bigger without becoming full and leading to network congestion.\n\nBCH is far away from being congested, and scaling research is happening to ensure that in future, blocks can get much bigger.\n\nBSV changed their strategy to being a general data storage blockchain. It has not worked out well for them.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}