{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "u44kak",
            "title": "Store Paper Wallet in a Smarter Way",
            "url": "https://www.reddit.com/r/btc/comments/u44kak/store_paper_wallet_in_a_smarter_way/",
            "author": "tommy737",
            "created_utc": 1650016498.0,
            "score": 3,
            "num_comments": 17,
            "subreddit": "btc",
            "selftext": "So, if you will ever store your mnemonic key in a physical paper. I suggest to use this technique. Download an offline QR code generator (I use one from softpedia). Convert each word into a png file which you will then import into a word file table as follows. So what's the idea behind this? Why not just write each word instead? So, each day you check for your paper wallet, if it's in place then you're safe but what if it's stolen? Then you will need to have more time to transfer the funds from your wallet to another one. Storing the words in QR codes guarantees that it's not human readable, the thief must qr code scan each word to be able to unlock the wallet. This should give you some time ahead to transfer the funds (in case you are still alive). Of course I am assuming that the paper is not the only way you store your keys and you have a backup in an ecnrypted password cloud storage service.\n\nhttps://preview.redd.it/go0cyf7i0ot81.png?width=744&format=png&auto=webp&s=73f9fd338d5cf2ef0c65a99a32452e61ca0d3092",
            "stickied": false,
            "comments": [
                {
                    "id": "i4tjabb",
                    "author": "Remora_101",
                    "score": 12,
                    "created_utc": 1650022579.0,
                    "response": "This does not help for various reasons:\n\n1. Scanning QR code takes seconds\n2. He can just take a photo and decode later.\n3. You can't spot when the code has been taken.\n\nMuch better to encapsulate your seed so that the attacker needs to break in to get it. Glue your piece of paper. Put it in an case and glue it. Doesn't matter as soon as the attack has to destroy something you can spot that the seed was taken 100%",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4tm1ev",
                    "author": "moleccc",
                    "score": 7,
                    "created_utc": 1650024321.0,
                    "response": "Here's a better idea against theft risk: use encrypted paper wallet. \n\nOnly downside: you need to remember the encryption password.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uhuuso",
            "title": "Request for feedback on my critique of \"The Bitcoin Standard\" by Saifedean Ammous",
            "url": "https://www.reddit.com/r/btc/comments/uhuuso/request_for_feedback_on_my_critique_of_the/",
            "author": "fatalglory",
            "created_utc": 1651626244.0,
            "score": 15,
            "num_comments": 23,
            "subreddit": "btc",
            "selftext": "I have written a fairly pointed critique of Ammous' book \"The Bitcoin Standard\". In my critique, I basically argue that the 1MB block size cap in BTC makes it a terrible reserve asset for free banking, because the block size cap makes it virtually impossible for consumers to execute a \"bank run\" on a Bitcoin bank.\n\nI haven't seen this point argued anywhere else. Before I start pushing it more broadly, I wanted to post it here and ask for feedback. Is my logic sound? Or am I missing something?\n\nAnyone interested in Austrian economics will hopefully find the article interesting, whether or not you agree. Thanks in advance for any thoughts.\n\n[https://www.cryptoforconservatives.com/blog/20220228-the-bitcoin-standard-destined-to-fail/](https://www.cryptoforconservatives.com/blog/20220228-the-bitcoin-standard-destined-to-fail/)",
            "stickied": false,
            "comments": [
                {
                    "id": "i78wtwn",
                    "author": "Knorssman",
                    "score": 10,
                    "created_utc": 1651634054.0,
                    "response": "A sudden spike in demand for transactions such as a bank run really does look like the worse case scenario for BTC that I hadn't considered before. And I'm sure the banks would appreciate such a bottleneck on transaction capacity",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i79eh1m",
                    "author": "AmbitiousPhilosopher",
                    "score": 7,
                    "created_utc": 1651644394.0,
                    "response": "Good write up. One problem with LN is that if there is a mass channel shut down at the same time, many poor channels will be wiped by the spike in onchain fees. Ultimately, any Bank can only work in a market based way if there is the possibility of a bank run, and the only way you can make it possible is if it is easy to withdraw the money.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7ao2fi",
                    "author": "jessquit",
                    "score": 4,
                    "created_utc": 1651674516.0,
                    "response": "This is one of the best things I've read in a long, long time.  In fact I doubt I can find it but I remember reading a Gmax argument a long time ago in which he very clearly pointed out that the block size limit reduces the ability to conduct a bank run (in the context of that being a good thing).  It didn't feel right when I read it but it didn't occur to me until now why that's a bad thing.  After many years I now understand the counterargument.  It will take a while to assimilate it into my thinking, because it is indeed critical. \n\nAlso your handy treatment of LN is extremely salient.  If in fact Bitcoin BTC becomes the world standard settlement system then it becomes prohibitive for almost anyone to run an LN wallet trustlessly.  And even if you could run a trustless wallet, who would you be connecting to and routing through?  *The banking system.*\n\nThanks so much for this.\n\n/u/chaintip",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7asl4h",
                    "author": "LovelyDayHere",
                    "score": 3,
                    "created_utc": 1651676344.0,
                    "response": "> Since Bitcoin cannot scale (on the main chain) to accommodate peer-to-peer payments for billions of people\n\nand\n\n> Bitcoin can't scale for peer to peer transactions without a banking layer\n\nI think you mean BTC when you write Bitcoin. I understand why you would not want to write \"Bitcoin (BTC)\" in every place where you make this statement in this article, but it would be more correct because the general statement is unproven and Bitcoin (Cash) or some other Bitcoin derived coin might well prove it wrong in future.\n\n__The article is good, but swallowing the small blockers' main premise without labeling it as a hypothesis (or axiom in their case) makes the argument presented against the Bitcoin Standard here seem incomplete to me.__ It could even be just a footnote indicating that this claim against on chain scalability of the protocol is still in dispute.\n\nI'm not even going to cite Satoshi's view on the scalability of the base protocol, they're well known to everyone ;-)\n\nBut let's look at the minimum of 1B people doing 1 cash transactions each per day at ~220b/tx, that requires ~1.5Gb blocks. It's not out of the realm of the possible, quite the contrary. People have run [1GB Bitcoin Cash blocks](https://read.cash/@mtrycz/how-my-rpi4-handles-mining-1gb-blocks-e5d09d83) on a Raspberry Pi on the scaling testnet, not even commodity desktop PC much less server level hardware. Another Bitcoin-derived blockchain has run multi-GB blocks albeit I would not lend my full credence to their methodology as being representative of cash transactions on an open Bitcoin network.\n\nMy point is : blocks of a couple GB are not out of reach by any means. That would accomodate billions of people doing a single tx per day, and strictly speaking, would cover what your article currently claims is not achievable.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uhvywp",
            "title": "Lobster BCH!!! (Bitcoin Cash is by far the easiest crypto to use and accept for retail merchants)",
            "url": "https://v.redd.it/37cahpam9dx81",
            "author": "MemoryDealers",
            "created_utc": 1651629762.0,
            "score": 80,
            "num_comments": 36,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i78nq1m",
                    "author": "MemoryDealers",
                    "score": 21,
                    "created_utc": 1651629846.0,
                    "response": "Any business can start accepting BCH in less than 2 minutes, with NO SIGNUP required thanks to the [Bitcoin Cash Register App](https://www.bitcoin.com/bitcoin-cash-register/), or [POS.CASH](https://POS.CASH)   \n\n\nPeople should also try sharing this video and links across other crypto sub reddits.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i78sg91",
                    "author": "big--if-true",
                    "score": 13,
                    "created_utc": 1651631971.0,
                    "response": "Would be awesome to have community style economies where people do lots of trades, which is what money is for. No need for inflation tax or government control.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i79lwkx",
                            "author": "krisdries",
                            "score": 7,
                            "created_utc": 1651650312.0,
                            "response": "The fact that we see more and more merchants being thus so adaptive to Bitcoin Cash.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i78tla0",
                    "author": "Br0kenRabbitTV",
                    "score": 8,
                    "created_utc": 1651632497.0,
                    "response": "Is it just me or is Reddit terrible at displaying videos? Recently, I've been constantly getting videos breakup and not display properly after a few seconds, well specced PC, Firefox.\n\nLike they are running at 2FPS.\n\nNice to see some more adoption, anyway.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i79i2wv",
                    "author": "installgen4",
                    "score": 5,
                    "created_utc": 1651647137.0,
                    "response": "That is indeed pretty fast indeed long way to go and much more adoption is on it's way.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i799472",
                    "author": "fiendishcrypro",
                    "score": 5,
                    "created_utc": 1651640748.0,
                    "response": "Go Rolando Brison! How awesome is that, and MP enjoying a meal out all paid for by p2p decentralised payments Bitcoin Cash.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i79b0e6",
                    "author": "PublicCurrency9039",
                    "score": 3,
                    "created_utc": 1651641986.0,
                    "response": "If a picture, (video), is worth a thousand words, then this beautiful meal, says it all!! Time, and time again, BCH demonstrates it’s ease of use in commerce!!! It’s fast, cheap, reliable, and is the future!!!",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uhot9t",
            "title": "Joe Rogan is hyping the ruined BTC shitcoin again - drop by in the comment section to educate the unsuspecting pleb",
            "url": "https://www.youtube.com/watch?v=qZwaDUBAPcE",
            "author": "WippleDippleDoo",
            "created_utc": 1651608748.0,
            "score": 8,
            "num_comments": 20,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i77nkei",
                    "author": "Pablo_Picasho",
                    "score": 8,
                    "created_utc": 1651613590.0,
                    "response": "Can we not stoop to the toxic maxi level of discourse that labels things \"shitcoins\"?\n\nTo the average crypto user this isn't eye-opening, it's off-putting and we won't win them over to the real peer to peer electronic cash experience like that.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uhxpip",
            "title": "When you know, you know",
            "url": "https://v.redd.it/ird6gra9bax81",
            "author": "Turnip_Salesman6285",
            "created_utc": 1651635525.0,
            "score": 186,
            "num_comments": 141,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i790ahc",
                    "author": "DuncanWhiteLDP",
                    "score": 48,
                    "created_utc": 1651635788.0,
                    "response": "Wow! This lady understand more than most in crypto.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i799u9r",
                            "author": "YummaySmoohie",
                            "score": 14,
                            "created_utc": 1651641218.0,
                            "response": "This lady invented crypto",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7a2a99",
                                    "author": "Bohgos",
                                    "score": 7,
                                    "created_utc": 1651663715.0,
                                    "response": "She's serious dude. She ain't playing around. She knows her shit.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i7dj8qb",
                                            "author": "jwzheng",
                                            "score": 2,
                                            "created_utc": 1651716884.0,
                                            "response": "Yeah and these type of womens should encouraged and empowered",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i7g5cb0",
                                                    "author": "kersmi",
                                                    "score": 1,
                                                    "created_utc": 1651770829.0,
                                                    "response": "Completely comes under the quality assurance of that product.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i7c1kb8",
                            "author": "teamlee8380",
                            "score": -1,
                            "created_utc": 1651694122.0,
                            "response": "Yep, and she's got a point too, it's just that you can't blame network for that.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7hnb6j",
                                    "author": "hranur",
                                    "score": 1,
                                    "created_utc": 1651793300.0,
                                    "response": "Yes technically blame the network because it is only thing there is reliance.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i79tlh9",
                    "author": "KiruNarch",
                    "score": 14,
                    "created_utc": 1651657121.0,
                    "response": "Not wrong, but at the same time, the more bitcoin will be known the more it will be easy to be able to use it without centralized exchange platforms.  \n\n\nAt first it was utterly difficult to exchange bitcoins against fiat currencies or consumer goods because it was not adopted. The more it is adopted, the more people will use bitcoin wallets and not exchange platforms.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7balkm",
                            "author": "AmericanScream",
                            "score": 2,
                            "created_utc": 1651683618.0,
                            "response": "> the more bitcoin will be known the more it will be easy to be able to use it without centralized exchange platforms. \n\nsounds good in theory, but in practice, the more popular bitcoin becomes, the more scammers and hackers it seems to attract",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7bds03",
                                    "author": "KiruNarch",
                                    "score": 1,
                                    "created_utc": 1651684851.0,
                                    "response": "Yes, unfortunately there are tons of scammers.\n\nImho, the biggest issue is that cryptos are not regulated and medias are not informing people which is leading to many neophytes that have zero knowledge about cryptos, and are therefore subject to the scams. \n\nWe all know that the best way to have more scams is when a scam is working. If it ain't working, there would be less scammers because it would be harder to create smarter scams (which is not within everyone's reach).",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i7bfetn",
                                            "author": "AmericanScream",
                                            "score": 2,
                                            "created_utc": 1651685487.0,
                                            "response": "> Yes, unfortunately there are tons of scammers.\n\nHere's the problem.  It's arguably impossible to differentiate a sincere investor from a scammer.   They're both promoting deceptive impressions of the risk/reward model for crypto.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i7gcqdn",
                                                    "author": "tommi518",
                                                    "score": 1,
                                                    "created_utc": 1651773751.0,
                                                    "response": "This model is a very important model which everyone need to follow.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i7gue24",
                                            "author": "pet_2g",
                                            "score": 1,
                                            "created_utc": 1651780853.0,
                                            "response": "This kind of stems are very normal and it is not to inform people.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i7grtwi",
                                    "author": "gbmarion8",
                                    "score": 1,
                                    "created_utc": 1651779833.0,
                                    "response": "Already attracting a lot of people and it is not the first time.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i7ahnsj",
                            "author": "tr14l",
                            "score": 2,
                            "created_utc": 1651671764.0,
                            "response": ">the more bitcoin will be known the more it will be easy to be able to use it without centralized exchange platforms\n\nMan, this is incredibly naive. The more bitcoin is known the more tampering, gamification and manipulation there will be. It doesn't get easier when it's more well known. It gets harder.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7aicbo",
                                    "author": "KiruNarch",
                                    "score": 3,
                                    "created_utc": 1651672067.0,
                                    "response": "I totally disagree.\n\nIt is way easier to manipulate the market when it's a small market with few investors than with a widely adopted crypto.\n\nSome small cryptos are the perfect example with like 1 single physical person owning half the tokens. In this case, YES, the risk of manipulation of market is high and that is why people are saying to avoid some markets.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i7bas1b",
                                            "author": "AmericanScream",
                                            "score": 2,
                                            "created_utc": 1651683685.0,
                                            "response": "> It is way easier to manipulate the market when it's a small market with few investors than with a widely adopted crypto.\n\nIndividual investors are not manipulating the market.  CEX's are.\n\nWake me up when an individual investor can print $1B out of thin air like Tether, and pretend it's real money and trade with it.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i7bd3hf",
                                                    "author": "KiruNarch",
                                                    "score": 1,
                                                    "created_utc": 1651684589.0,
                                                    "response": "It's already the case with the quantitative easing and the fiat currencies.\n\nDifference is that Tether is subject of ongoing controversy while quantitative is not so much given the amount of $ (or euros, yens, etc.) printed these last 2 years.\n\nMoreover Tether has failed audits for proving that the printed money is backed by $, which goes to a better regulation of the coins of the CEXs which is good.\n\nI'm not saying everything is fine, just that rejecting crypto for keeping only the fiat moneys that are subject to far more issues regarding the creation of money might not be the best solution.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i7bfrkg",
                                                            "author": "AmericanScream",
                                                            "score": 0,
                                                            "created_utc": 1651685626.0,
                                                            "response": "> It's already the case with the quantitative easing and the fiat currencies.\n\npuh-leeeze.. stop with the phony narrative that fed-money-printing and quantitative easing is the cause for inflation.  It's not even on the radar.  The real reasons are much more obvious: global pandemic, supply chain problems, trade wars, trade deficits, the US's movement from a manufacturing economy to a consumer economy, corporate globalization, the increased treatment of workers not as people who deserve a living wage, but as disposable commodities, etc...\n\n\nway way WAY down on the list is the amount of money in circulation having an effect...",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i7bgfir",
                                                                    "author": "KiruNarch",
                                                                    "score": 1,
                                                                    "created_utc": 1651685885.0,
                                                                    "response": ">stop with the phony narrative that fed-money-printing and quantitative easing is the cause for inflation.\n\nOh, I did say that ? Where ?",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                },
                                                                {
                                                                    "id": "i7hl1o1",
                                                                    "author": "Kongfuagam",
                                                                    "score": 1,
                                                                    "created_utc": 1651792246.0,
                                                                    "response": "The same kind of effect will be seen on a lot of currencies.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i7hfnyr",
                                                    "author": "jhonjmmi",
                                                    "score": 1,
                                                    "created_utc": 1651789789.0,
                                                    "response": "They trading with the real money but as of now investors have the money.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i7aimdz",
                                            "author": "tr14l",
                                            "score": 1,
                                            "created_utc": 1651672190.0,
                                            "response": "6% of investors beat the stock market over the last two decades. Six. Seis. That's what's going to happen to crypto with more parties involved. The vast majority of everyone will lose money.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i7ao1ua",
                                                    "author": "KiruNarch",
                                                    "score": 5,
                                                    "created_utc": 1651674509.0,
                                                    "response": "I think you're confusing manipulation and correlation.  \n\n\nThe crypto market is more and more correlated to the global market because it is widely adopted, therefore a financial crisis is impacting cryptos while it was not the case in the early time of bitcoin.  \n\n\nBut it doesn't mean that the market is more and more manipulated. As you said, the market is becoming more complex, meaning that e.g. a power outage in Kazakhstan is resulting to a sharp drop of the crypto prices which is incredibly difficult to forecast. \n\nUsually, the more a market is complex, the harder it is to manipulate it because there are too many factors involved in the price evaluation.\n\n\"Market manipulation can be difficult not only for authorities but also   \nfor the manipulator. These difficulties are exacerbated by the increase   \nin the size of the market and the number of participants in it.\"\n\nSource: https://corporatefinanceinstitute.com/resources/knowledge/trading-investing/market-manipulation/\n\nAlso, don't forget that my main idea was just that a massive adoption will likely help small investors to purchase bitcoin without the use of the exchange platforms as it is easier to find a 2nd party for an exchange, and thus avoid a centralized 3rd party. That's it.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i7hi4mh",
                                                            "author": "hyppjxb",
                                                            "score": 1,
                                                            "created_utc": 1651790903.0,
                                                            "response": "Most of the investors think of as a property but it is not.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i7f21uv",
                                                    "author": "gedger1",
                                                    "score": 1,
                                                    "created_utc": 1651753968.0,
                                                    "response": "They have to particular think of something else if they want to handle it.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i7h9pfs",
                                            "author": "AZEMK",
                                            "score": 1,
                                            "created_utc": 1651787164.0,
                                            "response": "I don't really think that it make any sense to avoid the market.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i7fof1t",
                                    "author": "dingus5355",
                                    "score": 1,
                                    "created_utc": 1651763850.0,
                                    "response": "The complete manipulation game in the market is only reason as of now.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i7g8h90",
                            "author": "mashtu1960",
                            "score": 1,
                            "created_utc": 1651772069.0,
                            "response": "Will the platform exchange is not a big problem is we can see now.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7a2j5b",
                    "author": "ramirezdoeverything",
                    "score": 15,
                    "created_utc": 1651663871.0,
                    "response": "Exchanges are centralised yes. Don't keep your decentralised crypto currency in a centralised exchange and this ladies argument falls apart",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7ba8lg",
                            "author": "AmericanScream",
                            "score": 2,
                            "created_utc": 1651683480.0,
                            "response": "Not at all.  Because whether you keep crypto in a CEX or not, you're still measuring the value of your crypto in fiat, based on a number that is published by the exchanges.   And this number is largely an illusion, created by the pumping and wash trading of more than $160B in unsecured stablecoins.\n\nSo no matter where your coins are, their \"value\" is set by the CEXs.  And with the exception of a few online illegal drug stores and some coffee shops in some third world island nation, you have to convert your crypto to fiat to realize any value, and once again, that requires a CEX.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7cbqct",
                                    "author": "dnick",
                                    "score": 5,
                                    "created_utc": 1651698072.0,
                                    "response": "That is a growing pain, and something that is all but inevitable for a new technology.  There's no way for a new thing to replace an old thing without a transition period, and something as complex and difficult to understand as crypto will have a longer transition period than color tv vs black and white.  The fact that comparisons fluctuate widely right now is a function of human nature, not on the underlying usefulness of the technology and there will be an exchange rate (dictated by people more than exchanges) for the forseeable future, but that will be the case until fiat is measured against crypto instead of the other way around until/unless fiat goes away completely.  Fiat is too universally familiar to expect it's replacement to be like a light switch.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i7dvlog",
                                            "author": "AmericanScream",
                                            "score": 1,
                                            "created_utc": 1651723036.0,
                                            "response": "> That is a growing pain, and something that is all but inevitable for a new technology. There's no way for a new thing to replace an old thing without a transition period, and something as complex and difficult to understand as crypto \n\nStop pretending crypto is some new and complex technology.  It's not.  It's a goofy inefficient database tech that's been around since the 60s and was not very useful (Merkle Trees).  There are better ways to do everything crypto does without using blockchain.  There's nothing here to learn or understand.  The tech is dogshit. Ask any capable computer programmer, cryptologist or database DBA - they'll tell you.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i7ensrd",
                                                    "author": "KiruNarch",
                                                    "score": 2,
                                                    "created_utc": 1651744459.0,
                                                    "response": "Oh common, you had a bad day or what ?\n\nWe are in an ere where we have more and more data, we're in the era of the \"big data\".The issue is that all these data are centralized, and you can clearly see the potential issue with some companies owning tons of data about any citizen. That is a matter that is more and more concerning people.\n\nThe blockchain is a system that allows to decentralize services, such as the governance of the data of the individuals, meaning a system that can both secure these data (e.g. bitcoin blockchain that has not been hacked once for now 14 years) and also allows to decentralize the services (transactions, medical data, storage data, elections, and so on).\n\nThat is why it IS something revolutionary no matter how much YOU HATE cryptos.\n\nThere are issues with the blockchain technology, but this is an open source software that is gaining maturity with time.\n\n&#x200B;\n\nAsk any capable computer programmer, cryptologist or database DBA - they'll tell you.\"\n\nCommon... Are you really indirectly saying that all the guys that are supporting cryptos are not capable people ? And you're trying to convince us that such a simplification of reality is correct ?\n\nI remember many guys like Jamie Dimon, CEO of JP Morgan saying bitcoin is bullshit and changed sides, like many others. But well, given the hate in your speech, I don't really see any interest to further discuss with you...",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i7f1xfo",
                                                            "author": "BTCflowroll",
                                                            "score": 1,
                                                            "created_utc": 1651753903.0,
                                                            "response": "No doubt about it they are going to tell you but it will take some time.",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "i7fr3du",
                                                            "author": "AmericanScream",
                                                            "score": 1,
                                                            "created_utc": 1651764906.0,
                                                            "response": "> We are in an ere where we have more and more data, we're in the era of the \"big data\".The issue is that all these data are centralized, and you can clearly see the potential issue with some companies owning tons of data about any citizen. That is a matter that is more and more concerning people.\n\nThis is more of these annoying pro-crypto marketing cliches.   You speak of \"de-centralization\" as if it's some kind of solution... to what?   It's just a characteristic. Whether that characteristic has value has yet to be realized.  I've already gone into great detail [all the claims made by blockchain that are false](https://reddit.com/r/CryptoReality/comments/lq6xpq/the_defacto_list_of_cryptocurrencyblockchain/).  We are 13 years into \"de-centralized money\" and there's not a single advantage it offers... except you think if it's less \"centralized\" that's a thing.  Nobody really has any idea what that even means. It's just a buzzword.  Crypto is and always will be a combination of centralization and de-centralization, just like the Internet itself; just like the US government, just like a lot of things.  \n\nIt's really infuriating to hear people use the word \"de-centralized\" like it has specific meaning and purpose.  It does not.  It's just a distraction.  \"Hey bro, this thing is de-centralized!   That means it's awesome.  Don't ask me specifics though...\"\n\n>There are issues with the blockchain technology, but this is an open source software that is gaining maturity with time.\n\nYea, I remember when microwave ovens came out.  People said, \"Right now this doesn't cook food any faster, but we're only 13 years into this tech... buy a microwave and wait 18 months and it will get better.\"\n\n/cringe",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i7fz5md",
                                                                    "author": "dnick",
                                                                    "score": 2,
                                                                    "created_utc": 1651768063.0,
                                                                    "response": "You seem to think that your critiques of parts of the technology, when taken as a whole, invalidate the entire thing.  The part that you trip up on is where you hand-wave the 'de-centralized' piece as unimportant when it's really the only important piece, as long as you combine it with 'trustless'.  \n\n&#x200B;\n\nEvery other part of crypto can be done better some other way, but the entire point is that the system allows me and some guy across the street or across the world to share something of value (made up or not) without having to go through any one entity for permission.  That's practically it. Twitter, ISP, bank, government, your parents, it doesn't matter who has to give permission, if it requires permissions it can be withheld.  If you can name a single other way to do that, you can probably replace crypto.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i7geyn4",
                                                                            "author": "AmericanScream",
                                                                            "score": 1,
                                                                            "created_utc": 1651774668.0,
                                                                            "response": "> You seem to think that your critiques of parts of the technology, when taken as a whole, invalidate the entire thing. \n\nYou can take this technology in whole or in part, and it still [has nothing innovative to offer](https://reddit.com/r/CryptoReality/comments/lq6xpq/the_defacto_list_of_cryptocurrencyblockchain/).  Those are the facts.  13 years in, and not a single clear \"innovation.\"\n\nWhich is now where crypto bros move the goalpost and instead of argue whether blockchain is innovative or better, they've reduced their standards to, \"has use.\"   So now as long as they can point to somebody \"using blockchain\" that somehow validates its legitimacy.  \n\nI can \"use\" a pair of scissors to mow my lawn.  That doesn't mean it makes sense.  That's basically where blockchain fits into finance.  It doesn't do anything better, and it more expensive, slower and more resource intensive.  \n\n>The part that you trip up on is where you hand-wave the 'de-centralized' piece as unimportant when it's really the only important piece, as long as you combine it with 'trustless'. \n\nYou sling a lot of word salad, but you make nothing with any calories or nutrition.\n\nYou can say \"trustless\" and \"de-centralized\" all day long, and try to get away with pretending to make a point -- it all centers on making sure you avoid making any specific claim that can be tested.  This is where your \"trustless, de-centralized\" argument collapses.\n\nEvery time you get specific, [your claims fail](https://reddit.com/r/CryptoReality/comments/lq6xpq/the_defacto_list_of_cryptocurrencyblockchain/).\n\nSo yea, just keep on saying \"trustless\" and \"de-centralized\" while being careful to not cite any examples and you'll have that circle jerk rotating nicely.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i7ikqub",
                                                                                    "author": "dnick",
                                                                                    "score": 2,
                                                                                    "created_utc": 1651810555.0,
                                                                                    "response": "What the hell do you mean 'examples'? You can buy things with bitcoin online today.  The fact that every tech company and their dog is trying to jump on the 'blockchain' bandwagon and act like it can do things it's useless at has nothing to do with how useful it in in the specific case of crypto.  You not understanding that doesn't make it any more true just because you repeat it and use terms like 'word salad'.\n\n&#x200B;\n\nI can send an amount of money to an address you specify, and without trusting a bank, or a guy on the street, or coinbase or my ISP or having to get permission from anyone in the world, no matter what they think of my reasons or the amount.  You can accept it and without trusting me or anyone else you can verify that you received it with no worry that I'll change my mind and take it back.  That is a use case.  There are plenty of others, but I failed to grasp that you weren't aware of the basic use case of crypto.  You may not care, or more likely you're just being intentionally obtuse, but it's still there.\n\n&#x200B;\n\nLike I've said repeatedly, you seem to want to complain that the individual pieces that make up bitcoin or other crypto's aren't ideal for other uses and thus shouldn't be useful in this case?  It really comes off as trolling.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i7kqqmd",
                                                                                            "author": "AmericanScream",
                                                                                            "score": 1,
                                                                                            "created_utc": 1651856442.0,
                                                                                            "response": "> What the hell do you mean 'examples'? You can buy things with bitcoin online today. The fact that every tech company and their dog is trying to jump on the 'blockchain' bandwagon and act like it can do things it's useless at has nothing to do with how useful it in in the specific case of crypto. You not understanding that doesn't make it any more true just because you repeat it and use terms like 'word salad'.\n\nlol \"every tech company and their dog\"... that's amusing\n\nI get that you think this industry is exploding, but I submit you are living in a little bubble.  The exception doesn't prove the rule.  I know of nobody natively taking bitcoin... nobody.  Any entity that might accept bitcoin is actually dealing with an intermediate exchange like Bitpay.  Apples and oranges.\n\nAs I said before, some dude selling coffee in a kiosk on St. Kitts is hardly \"widespread adoption.\"\n\n>I can send an amount of money to an address you specify, and without trusting a bank, or a guy on the street\n\nThere you go again, pretending bitcoin is money.  It's not money.  It's a digital token you still have to convert to fiat if you want to send actual \"money.\"\n\nAgain, I get that *you* think it's money, but 99.9% of the rest of the world disagrees.\n\n>Like I've said repeatedly, you seem to want to complain that the individual pieces that make up bitcoin or other crypto's aren't ideal for other uses and thus shouldn't be useful in this case? It really comes off as trolling.\n\nYou keep making statements that are anecdotal and not evidential.  You're the one trolling.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "id": "i7jb1eq",
                                                                    "author": "KiruNarch",
                                                                    "score": 1,
                                                                    "created_utc": 1651831182.0,
                                                                    "response": ">  You speak of \"de-centralization\" as if it's some kind of solution... to what?   \n\n1) As said dnick (I'm kind of repeating the same thing, you can skip to point 2 if you want) it can be resumed by \"trustless\".\n\nTrust is the main idea behin the creation of Bitcoin, which has been created after the financial crisis of 2008 and following an increasing demand for a solution to avoid the financial intermediary and the diminishing trust regarding financial institutions.\n\nBlockchain is a technology allowing to store and distribute data following a decentralized model.\n\nIn addition to be used for financial services, it can be used in many other fields.\n\nI will not develop why trust is something necessary in any form of action linked to digital data as it is obvious.\n\n  \n2) The control of bitcoin could indeed seems like an issue as only a few people are commited to have access to Bitcoin Core.\n\nBut honestly, do you think that it would be better if anyone could modify the project without any control ? That would mean the instant destruction of this open source software. It is imperative that the accesses for changing the Bitcoin Core is limited in order to avoid security breaches.\n\nAs said in the bitcointalk source that yourself provided in your message, the people that were granted access are frequent contributors that achieved to propose contributions to enhance the project.\n\nWe can discuss wether these contributions are linked to the enhancement of the blockchain functionality or pure speculation, it is important to remember that all these changes are not made by someone without any discussion, it is made following discussion with the bitcoin community.\n\nIf one of these person makes a change without the consentment of the community, you can be sure that this person won't be trusted anymore and would like lose his access. These people are more like representative executers of the modifications that are adopted by the bitcoin community.\n\nThe granted access to some of these people were revoked (e.g. Gavin Andresen and Jeff Garzik), which is an argument showing that no, saying that only 6 people are able to change Bitcoin Core is an extrem simplification of the reality.\n\n&#x200B;\n\n3) About the efficiency of the blockchain technology, of course bitcoin is an unefficient blockchain that leads to wasted energy, that's an issue that was already emphasized years ago. \n\nBut there are plenty of other blockchains that are meant to be way more efficient that the biggest financial system in the world (Western Union, Visa, MasterCard, etc.). Hence the fact that these giants but also companies of the Big Four are making partnership with some crypto projects.\n\nYour example about your scissor would have been a good example in 2014. Now it's totally obsolete.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i7knwce",
                                                                            "author": "AmericanScream",
                                                                            "score": 1,
                                                                            "created_utc": 1651855288.0,
                                                                            "response": "> Trust is the main idea behin the creation of Bitcoin, which has been created after the financial crisis of 2008 and following an increasing demand for a solution to avoid the financial intermediary and the diminishing trust regarding financial institutions.\n\nYou haven't demonstrated how bitcoin is \"trustless.\"\n\nThis whole argument is predicated on an unsupported premise that you can get more \"trust\" through de-centralization than you can through centralization.\n\nI would submit that's patently false.\n\nWith centralization you have **accountability** which is a major motivating factor for being trustworthy.\n\nWith de-centralization, if something goes wrong, there's not usually anybody to blame.  \n\nIn this scenario, the term \"trustless\" is inaccurate.  It should be instead labeled \"un-trustworthy.\"\n\nDe-centralized systems are not \"trustless.\"  They are \"un-trustworthy.\"  Because nobody is held accountable.  Proponents believe \"code is law\" and if code is errant, oh well... it's your fault for not auditing the code.  And you call that 'trustless?'  It makes no sense.\n\n>But honestly, do you think that it would be better if anyone could modify the project without any control ? \n\nThat's a false dichotomy.  And a strawman.  That's not the point I'm making.\n\nThe points I'm making are:\n\n1.  In each of these systems there is a level of implied \"trust\" - whether you choose to trust in a central (accountable) authority of blindly trust \"code\", it's still trust.\n\n2.  You're making my case -- that central authorities, like the 3 people who are in charge of the main bitcoin repository, are more trustworthy than, as you say \"allowing anybody to modify the project code.\"\n\nThank you for proving my argument.\n\n>But there are plenty of other blockchains that are meant to be way more efficient that the biggest financial system in the world (Western Union, Visa, MasterCard, etc.)\n\nAgain, you make vague claims that are incapable of being tested true or false.  It's impossible to debate someone making such dishonest, misleading claims.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i7l51v8",
                                                                                    "author": "KiruNarch",
                                                                                    "score": 1,
                                                                                    "created_utc": 1651862616.0,
                                                                                    "response": ">You haven't demonstrated how bitcoin is \"trustless.\n\nBecause it is safer to have a system where you have tons of people validating a transaction with a reward for honestly validating the transaction following an algorithm -that by the way didn't show any issue since 14 years AFAIK (except transaction fees that are too low in period of high peak use)-, compared to a system where a single moral entity controls and validate the transactions and governance with a more abstrused aspect.\n\nDon't forget the reason bitcoin has been created: due to the financial crisis that pointed out the responsability of financial entities, were citizens were part of the victims and helped to recover from the financial crisis. Aaaand... the solution was to revise Basel II which failed.\n\nWho is responsible of that failure ?\n\nThis is the key item that pushed cyberpunks to definitely find a solution to create a financial system that doesn't need a 3rd party.\n\n&#x200B;\n\n>\"With de-centralization, if something goes wrong, there's not usually anybody to blame.\n\nIf something goes wrong in a centralized system, you're not sure that the centralized party will take the responsability of the issue.\n\nA good example is the insurance system where in fact you usually need to prove that the issue is not coming from the vendor/buyer but from the third part as the third party has no financial interest to cover something wrong if they can prove it's not their responsability.\n\nAlso, as I mentioned earlier, bitcoin system did not show any failure since 2008.\n\n&#x200B;\n\n>In this scenario, the term \"trustless\" is inaccurate.  It should be instead labeled \"un-trustworthy.\"\n\nAny person working in statistics will tell you that 100% certainty doesn't exists. Should we avoid a technology because we can't prove it'll be working with an accuracy of 100% ?\n\n&#x200B;\n\n>De-centralized systems are not \"trustless.\"  They are \"un-trustworthy.\"Because nobody is held accountable.  Proponents believe \"code is law\"and if code is errant, oh well... it's your fault for not auditing thecode.  And you call that 'trustless?'  It makes no sense.\n\nTons of example of \"un-trustworhty' possibilities exist in our world like disaster events. What if a disaster happens ? Is this the fault of a 3rd party if your house got smashed by a fortuitous event ? Who's held accountable ?\n\nThat's the same with our current financial system. If a disaster destroys the database center and all the backups and that we lose all the money. Who's responsible ? Who will refund you ?\n\n&#x200B;\n\n>In each of these systems there is a level of implied \"trust\" - whetheryou choose to trust in a central (accountable) authority of blindlytrust \"code\", it's still trust.\n\nIt's different because in this case it is an open source code that any individual can choose to audit and make their own choice.\n\nFeel free to avoid it if following your audit you cannot trust this code.\n\nOtherwise, fine, use it.\n\n&#x200B;\n\n>You're making my case -- that central authorities, like the 3 people whoare in charge of the main bitcoin repository, are more trustworthythan, as you say \"allowing anybody to modify the project code.\"\n\nNot at all.\n\nIn your case there is a central authority (moral entity) that is following his own goals and making its own rules that could differ from the users. If they are making mistakes, who will run an audit about this mistake ? Who will be held responsible ?\n\nThe financial crisis of 2008 is again a good example (sorry to repeat it, but it's the core reason of the creation of blockchain).\n\nIn the case of the blockchain and in this example the case of bitcoin, the goal of the users is to make the best blockchain system possible as usually they are investors in bitcoins (yes I recognize there's an obvious financial link).\n\nBut the transparency is way more present than in the centralized systems since it's an open source software where any individual can contribute freely. Moreover, you get an open source history of ALL the transactions of the currency without any possibility to hide anything, allowing any individual to make his own audit freely.\n\nSo in my sense, yes, the decentralized system of bitcoin is way more trustless than the centralized one.\n\n&#x200B;\n\n>Again, you make vague claims that are incapable of being tested true orfalse.  It's impossible to debate someone making such dishonest,misleading claims.\n\nThis is still purely theoretical due to the scability aspect, but it's like the Schrödinger cat:\n\nIt's working and not working because we need to test it to really prove if it's more efficient or not. From a theorical aspect, it is, from a practical aspect, we need to run tests on a bigger sample which is needing a world adoption.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i7lpd2q",
                                                                                            "author": "AmericanScream",
                                                                                            "score": 1,
                                                                                            "created_utc": 1651872004.0,
                                                                                            "response": "> Because it is safer to have a system where you have tons of people validating a transaction with a reward for honestly validating the transaction following an algorithm -that by the way didn't show any issue since 14 years AFAIK\n\nThat's HILARIOUS.. here's a news story that just broke this week:\n\nhttps://www.coindesk.com/tech/2022/05/05/typo-moves-36m-in-seized-juno-tokens-to-wrong-wallet/\n\n$36M in crypto was accidentally sent to an invalid wallet address, and they had 120 (one hundred and twenty) people in charge of validating the transaction that didn't notice the error.  That happened yesterday.\n\nYour claims that multiple checkers are better than centralized authority doesn't seem to be backed up by real life, real world stuff that happens.\n\nAND, because this happened on the \"immutable blockchain\" the remaining bagholders are now begging to have the blockchain fork and un-do the botched transaction.  Also proving that blockchain is not immutable.\n\nThis whole industry is like a giant clown car.  It's like as soon as you say something is stable, it explodes in your face.\n\n>The financial crisis of 2008 is again a good example (sorry to repeat it, but it's the core reason of the creation of blockchain).\n\nThe financial crisis of 2008 is a good example all right.  It was [directly caused by de-regulation of the banking industry](http://bsalert.com/news/2416/What_Caused_The_Second_Depression_In-A-Nutshell.html) - specifically the rollback of Glass-Steagall which prohibited banks from engaging in risky securities ventures.  The crypto industry is almost a carbon copy of the same kind of Ponzi-like scheme the banks deployed which directly led to the 2008 collapse of the housing market.\n\nLuckily unlike the 2008 crisis, very few traditional institutions are that exposed in crypto.  When crypto crashes a bunch of neckbeards will cry like babies, but our economy won't flinch, because still... most people don't care about crypto and are not exposed to it's incredibly risky schemes.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i7fxwws",
                                                    "author": "dnick",
                                                    "score": 1,
                                                    "created_utc": 1651767575.0,
                                                    "response": "i think you're confusing crypto with blockchain...a blockchain is old tech, and extremely inefficient if all you're trying to do is store data.  You seem to have missed the point that Satoshi managed to use the blockchain as one leg to build a trustless, globally useable currency.  That term, trustless, balances the inefficiency and basically invalidates your apparent claim that anything done on a blockchain could be done in a database.  Having a ledger that is visible to all but only editable through an algorithmically controlled process is central to the entire concept and whether it is implemented flawlessly or incompetently, it is still one of those 'technologies' that maybe looks obvious in hindsight, it can be safely said that no one else has came up with it in a workable form.\n\n&#x200B;\n\nAnd by 'complex', I don't mean no one can understand blockchain, and the algorithm that was settled on isn't on the level of quantum mechanics, but for the average person the concept of even interacting with the tech is so overwhelming that it's taking baby steps even for technically savvy people to get a handle on how to use it without accidentally losing their life savings.  The mechanisms are there to do it with (relatively) perfect safety, but without the handrails provided by people building things on top of the system, it arguably wouldn't be as used as it is today.  To get it to the point where the average person uses it daily will likely rely on additional services built on top of it, and those services will look centralized, but the fact that the underlying tech allows you to use or not use those services will hopefully allow enough portability that we'll be relying on them for convenience rather than trusting them with the entire product.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i7ggsa9",
                                                            "author": "AmericanScream",
                                                            "score": 1,
                                                            "created_utc": 1651775406.0,
                                                            "response": "> You seem to have missed the point that Satoshi managed to use the blockchain as one leg to build a trustless, globally useable currency.\n\nSatoshi didn't build anything of the sort.  He created a small scale prototype, that has since been proven incapable of scaling to meet anything more than a hobbyist level of use.\n\nHis fundamental design is flaws in multiple ways and was nothing more than an interesting experiment.\n\nWhat bitcoin has subsequently become is nothing like his vision.  He never wanted bitcoin to be an investment.  \n\n> Having a ledger that is visible to all but only editable through an algorithmically controlled process is central to the entire concept and whether it is implemented flawlessly or incompetently, it is still one of those 'technologies' that maybe looks obvious in hindsight, it can be safely said that no one else has came up with it in a workable form.\n\nThis is another myth.  That people want their financial transactions public record.\n\nLet me ask you.... what would happen if everybody at your job knew exactly how much everybody else was getting paid?   Would that make things better?\n\nDo you want your neighbor, or the guy down the street knowing what you're spending your money on?\n\nThis public ledger idea is absurd.  It's one of the many absurdities that crypto presents un-ironically as a \"feature\" that basically nobody in their right mind really wants.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i7iju4p",
                                                                    "author": "dnick",
                                                                    "score": 1,
                                                                    "created_utc": 1651810017.0,
                                                                    "response": "You are so hung up on issues that you think are fatal that you completely the miss the point.  Nobody said the public ledger was a feature, it is an integral part of making the system trustless.  If the same level of verification could be done without everyone knowing every transaction I'm sure that would be popular too...not every branch of the problem has to be ideal for the overall process to work.\n\n&#x200B;\n\nAnd it doesn't matter what Satoshi's 'vision' was, his concept and white paper were the innovations, he's not some perfect visionary, he simply solved a huge part of an up-to-that-point unsolved problem.  Crypto in general isn't anything new, blockchains aren't new, algorithms aren't new...what is new is using them in a specific way to make the trustless functionality able to be distributed globally. \n\n&#x200B;\n\nAs far as him not intending it to be an investment, who the f' cares.  Just because people are using it for childish or foolish things now doesn't have anything to do with it's potential or it's utility.  People use the internet and smart phones to send dick pics, but they also use it to connect the world.  If everyone stopped using it as an investment vehicle tomorrow, or 99.9% of people doubled down on that use, it wouldn't mean a thing about the technology itself, it can still be used to trustlessly send something I value to someone else who values it halfway around the world and we could do it regardless of who our ISP is, if we use a phone or a piece of paper, if I wanted to use an exchange and he wanted to scratch the his public key into a patch of sand and have his friend sketch a picture of it and mail it to me, the fact that the system provides incentive and ability for us both to connect to the network eventually and they all agree that I had the right to send it to him, and they all agree that it now belongs to him (oversimplifying here, obviously) is ridiculously impressive and you whining about how you think because each individual piece of the process isn't ideal for every other use case is just that, whining.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i7kr17s",
                                                                            "author": "AmericanScream",
                                                                            "score": 1,
                                                                            "created_utc": 1651856563.0,
                                                                            "response": "> You are so hung up on issues that you think are fatal that you completely the miss the point. Nobody said the public ledger was a feature, it is an integral part of making the system trustless.\n\nThe system is not \"trustless.\"  In actuality the system is \"un-trustworthy\".   When nobody can be held accountable, there is no trust.   That \"trustless\" nature is not desirable to most people.\n\nI like having my money held by an entity that is trustWORTHY not trustLESS.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i7lsw7n",
                                                                                    "author": "dnick",
                                                                                    "score": 1,
                                                                                    "created_utc": 1651873642.0,
                                                                                    "response": "Ha, you're to the point of twisting words now, does that mean you feel like you're backed into a corner?\n\n&#x200B;\n\nUnless you're being disingenuous (or ignorant) there's no way you've been in the crypto-sphere long enough to have a worthwhile opinion on the topic without understanding that trustLESS isn't on the spectrum of trustWORTHYness.  TrustLESS refers to not requiring trust, not how much you can trust it.  That's the whole point is that you shouldn't have to decide how much you trust someone to pass along your money, you should be able to tell them to do it, and there isn't any option for them to do it, whether you trust them or not.\n\n&#x200B;\n\nMoney-wise, the guy you trust may not be the guy I trust, and the guy you trusted yesterday might not be the guy you trust today.  TrustLESS means you can click a button and even someone with a hidden agenda or long running grudge against you can't pull one over on you...or even more importantly someone can't build up a trustWORTHY looking service for a year and wait until enough people trust him and then run off with the money, or start working with the government.  \n\n&#x200B;\n\nHonestly your comment means you're either deceptively trying to sway people with mixing up similar looking words, or you don't understand that concept enough to have a good argument to continue.  If, on the other hand, you literally didn't understand the difference between those concepts, but were curious about it and would like to have a real conversation about it, I would love to continue and at least debate crypto with you on an honest basis.  You do have good points on some of the peripheral concepts, people are trying to use the term 'blockchain' as some magic, ridiculous marketing attempt, coins are being built strictly as scams with no real utility, bitcoin is certainly being compromised and being presented as solutions to problems no one has, but trustless and decentralized are not \\*always\\* buzzwords, there's an actual use... maybe it won't be bitcoin that ultimately takes over the world, but the first thing that does successfully mavrry those two things will be.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i7m2koh",
                                                                                            "author": "AmericanScream",
                                                                                            "score": 1,
                                                                                            "created_utc": 1651878187.0,
                                                                                            "response": ">TrustLESS refers to not requiring trust, not how much you can trust it. \n\nI grow bored and weary of these semantical distractions.\n\nThe bottom line is any time you send something you consider valuable across an online network, you are \"trusting\" that the network will operate the way you anticipate.\n\nYou can attach whatever alternative catch-phrase you want to that process, but it still involves some degree of what the rest of us in the real world, call \"trust.\"",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i7g2zgw",
                                                    "author": "Bloches",
                                                    "score": 1,
                                                    "created_utc": 1651769887.0,
                                                    "response": "They are not going to tell you anything and we have to take care of it as well.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i7hix6k",
                                            "author": "acmichaels",
                                            "score": 1,
                                            "created_utc": 1651791267.0,
                                            "response": "Recently very hard to switch off the field because it is very complex process.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i7gc0td",
                                    "author": "codie72",
                                    "score": 2,
                                    "created_utc": 1651773467.0,
                                    "response": "This argument doesn't make any sense to me because it is not logical.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i7cb3ut",
                            "author": "dnick",
                            "score": 1,
                            "created_utc": 1651697832.0,
                            "response": "Exactly...lots of people choosing the less secure but convenient route of exchanges doesn't make the base technology a scam.  It's like calling gold a scam because lots of people chose to keep it in their uncles basement and uncles have a tendency to run off with it.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7gr8lb",
                                    "author": "windliu122",
                                    "score": 1,
                                    "created_utc": 1651779598.0,
                                    "response": "They have certainly done that in the past and also they are sure.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i7cjgk0",
                            "author": "ggeissner",
                            "score": 1,
                            "created_utc": 1651701109.0,
                            "response": "Well, we want our decentralised currency to be on decentralised wallet only",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7h1273",
                                    "author": "8fht9",
                                    "score": 1,
                                    "created_utc": 1651783546.0,
                                    "response": "I think that you have to find something better than.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i79g528",
                    "author": "yes5262021",
                    "score": 18,
                    "created_utc": 1651645632.0,
                    "response": "She ain’t wrong",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7if6ib",
                            "author": "Napalm_rus",
                            "score": 1,
                            "created_utc": 1651807379.0,
                            "response": "No doubt about it she is having the great logical points.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7a7zke",
                    "author": "jaredx3",
                    "score": 9,
                    "created_utc": 1651667049.0,
                    "response": "She thinks she knows but she doesn't. Keep your coins off exchanges. They can manipulate all they want at end of the day supply will continue to dwindle and those that hodl will be empowered",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7bs470",
                            "author": "Turnip_Salesman6285",
                            "score": 2,
                            "created_utc": 1651690435.0,
                            "response": ">Keep your coins off exchanges\n\nSo we should rather keep them in our encrypted wallets?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7cau66",
                                    "author": "dnick",
                                    "score": 2,
                                    "created_utc": 1651697726.0,
                                    "response": "Yes, or spend and replace, or keep some on exchanges, the rest anywhere else...",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i7gvpew",
                                            "author": "markalex25",
                                            "score": 1,
                                            "created_utc": 1651781383.0,
                                            "response": "It will be completely over powered by everything else.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i7hyazg",
                                    "author": "Junkpile4ever",
                                    "score": 1,
                                    "created_utc": 1651798909.0,
                                    "response": "No I don't really think that it is a good idea to think of it.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i7cv78n",
                            "author": "guo7725365",
                            "score": 2,
                            "created_utc": 1651706098.0,
                            "response": "Yeah they are manipulating real time prices as well, Don't fall for them",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7hwbbg",
                                    "author": "elliotthill",
                                    "score": 1,
                                    "created_utc": 1651797790.0,
                                    "response": "Yes you are right what it I will definitely consider it.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i79w80p",
                    "author": "LovelyDayHere",
                    "score": 13,
                    "created_utc": 1651659359.0,
                    "response": "That doesn't make _Bitcoin_ a scam, although it is very easy to see how most people will reach that base conclusion.\n\nIf anything, it makes whatever is sold as Bitcoin (i.e. tokens on centralized exchanges which very likely do fractional reserve) a scam. Just like fiat money is a \"scam\" in that sense (centralized, inflatable at will, censorable, favoring those who control the issuance etc)\n\nIt comes down to people not _really_ using Bitcoin, but accepting substitutes. And of course in some cases, thinking the purpose of Bitcoin is number go up in fiat money terms.\n\nThe effective psyop is making people believe that _that_ is using Bitcoin. \"Muh store of value\", \"muh digital gold\", \"muh exchange tokens\".\n\n---\n\nI must point out that in all of the above, the usage of the word 'scam' is far too loose, it's basically pop culture in the cryptosphere, but these are not scams in a stricter sense and a lot of people actually disapprove of applying the term 'scam' too loosely. Caveat emptor.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7brpkk",
                            "author": "Turnip_Salesman6285",
                            "score": 2,
                            "created_utc": 1651690276.0,
                            "response": "So what is Bitcoin's intended original use? As a digital gold for those to invest in? Or a replacement for centralized currency?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7cuaym",
                                    "author": "LovelyDayHere",
                                    "score": 2,
                                    "created_utc": 1651705692.0,
                                    "response": "it's intended to be both a store of value and a means of exchange akin to cash.\n\n> peer to peer electronic cash\n\nhttps://bitcoin.com/bitcoin.pdf\n\nSatoshi called it (in other forum posts) a _cryptocurrency_.\n\nClearly, a decentralized currency with benefits that traditional, trust-based fiat currencies do not match.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i7hjgj6",
                                            "author": "Monsterminer2",
                                            "score": 1,
                                            "created_utc": 1651791516.0,
                                            "response": "It is not actually match but we have to think of it as a match only/.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i7hpwfw",
                                    "author": "roliviera",
                                    "score": 1,
                                    "created_utc": 1651794522.0,
                                    "response": "Most of these types of currencies are like that only as we had seen.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i7aeu2z",
                            "author": "dropcodex",
                            "score": 1,
                            "created_utc": 1651670464.0,
                            "response": "Why would anyone use anything that’s a scam",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7g2p2v",
                                    "author": "jaunitasq0w",
                                    "score": 1,
                                    "created_utc": 1651769770.0,
                                    "response": "It is completely a scam and people have to be aware of it.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i7i62my",
                            "author": "catherinefwhitin",
                            "score": 1,
                            "created_utc": 1651802717.0,
                            "response": "It is completely asset and it is equivalent to Gold only.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i79k0u9",
                    "author": "bitmeister",
                    "score": 4,
                    "created_utc": 1651648713.0,
                    "response": "We know too, but face it, most of us can't pull off a one-piece.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7c5ly0",
                            "author": "a532933202",
                            "score": 0,
                            "created_utc": 1651695698.0,
                            "response": "It's not like that it's hidden stuff, it's all pretty common knowledge at this point.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7ftxf6",
                                    "author": "kalmanpool",
                                    "score": 1,
                                    "created_utc": 1651766021.0,
                                    "response": "Having the complete information is very much required.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i7awd8w",
                    "author": "janooms",
                    "score": 2,
                    "created_utc": 1651677846.0,
                    "response": "To be honest you can't blame btc for that. It's people's fault dude.\n\nPeople should know the importance if taking the coins off exchange and should know what it really does for the system.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7bnskq",
                            "author": "toinzter",
                            "score": 2,
                            "created_utc": 1651688743.0,
                            "response": "People should know that centralised exchange can block them anytime",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7h7tai",
                                    "author": "thankfulsoul22",
                                    "score": 1,
                                    "created_utc": 1651786350.0,
                                    "response": "Well I don't really think that the system is going to work according to them since it is not the problem\n\nAnd on the other side it is the complete fault of that kind of situation only in which they were.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i7bsu9x",
                            "author": "Turnip_Salesman6285",
                            "score": 2,
                            "created_utc": 1651690719.0,
                            "response": ">People should know the importance if taking the coins off exchange\n\nThose at the top and those who created these exchanges do not give a fuck about BTC's original goal. They just see it as a cash cow and try to milk it as much as possible. \n\nBecause its de-centralized, there is no one to stop these exchanges.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7ca91z",
                                    "author": "dnick",
                                    "score": 1,
                                    "created_utc": 1651697495.0,
                                    "response": "Yeah, but because it's decentralized, the fact that these exchanges exist is just one piece of the puzzle and except for common usage it doesn't really detract from the technology in any manner.  Just because bitcoin is being used by scammy people, or in scammy ways, as long as Coinbase or others as a bank isn't a requirement they are really little more than conveniences.  Yes they are a bad direction, but they have very little to do with the technology themselves.  Just like if i offered to hold your paper wallets for you in a pile in my backyard, just because that's a stupid way to keep track of your bitcoin, it doesn't make bitcoin itself any less secure or 'non-scammy'.\n\n&#x200B;\n\nPeople like this, that actually have a reasonable grasp of the technology, generalizing things like this can cause more issues than any actual challenge the technology has in front of it.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i7hyucl",
                                            "author": "plateane",
                                            "score": 1,
                                            "created_utc": 1651799177.0,
                                            "response": "If you ask me personally then I think the technology is the only way they can actually get through this\n\nData going to be multiple issues but I think that they have to go through all of them to pass that,.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i7i36iu",
                                    "author": "Securitly07",
                                    "score": 1,
                                    "created_utc": 1651801316.0,
                                    "response": "I'm not really sure about the fact that how they are going to work over it but it is not possible as of now\n\nMoreover I think a lot of exchanges are going to work on their own way and on their on Regulation and terms.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i7ba08e",
                    "author": "AmericanScream",
                    "score": 2,
                    "created_utc": 1651683390.0,
                    "response": "She's totally right.  The existence of CEXs has turned bitcoin into a [ponzi scheme](https://www.reddit.com/r/CryptoReality/comments/o7v5xs/is_bitcoin_a_ponzi_scheme_a_detailed_analysis/).  It was never created as an \"investment.\"\n\nBut more importantly, the whole act of measuring the value of bitcoin in *fiat* undermines the whole purpose of bitcoin.  And these exchanges engage in so much market manipulation, there's no way to tell what the real price is.  There's $160 Billion worth of USDT and USDC floating around pumping everything up.  And crypto people are happy to stick their heads in the sand as long as they think they can profit.  What they don't realize is, they lost the moment they bought and HODL'd.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7c8uaw",
                            "author": "dnick",
                            "score": 2,
                            "created_utc": 1651696963.0,
                            "response": "Growing pains doesn't constitute a scam though...just because some people are using it in a specific way doesn't mean the whole is a scam.  Any crypto-currency, almost by definition, will have to measure itself against it's dollar equivalent until it hits a stead state and can start replacing the currency, it wouldn't make sense to most people in the beginning without that.\n\n&#x200B;\n\nI think the word scam is used WAY too liberally when discussing the bigger coins.  Sure some of the smaller coins are created strictly for pump and dump, and the bigger coins can be the \\*target\\* of scams and scammers, but BTC/BCH/ETH, etc are quite obviously not scams in and of themselves.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i7fsc8p",
                            "author": "cybje",
                            "score": 1,
                            "created_utc": 1651765398.0,
                            "response": "It is a very well known fact that a lot of people are going to get scammed.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7bu0h5",
                    "author": "Mangalz",
                    "score": 2,
                    "created_utc": 1651691186.0,
                    "response": "Not great logic.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7fh6oa",
                            "author": "tomek1904",
                            "score": 1,
                            "created_utc": 1651760926.0,
                            "response": "I know right this is the reason why I like logical people as well.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i79l4sc",
                    "author": "Dependent_Ad_6545",
                    "score": 1,
                    "created_utc": 1651649650.0,
                    "response": "It is",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7i5ym6",
                            "author": "punkweasles",
                            "score": 1,
                            "created_utc": 1651802663.0,
                            "response": "Weekend research more on that so we can be particularly so about it.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7ah50f",
                    "author": "DjVutra",
                    "score": 1,
                    "created_utc": 1651671528.0,
                    "response": "This is the kind of woman you get married to.🤩",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7d382p",
                            "author": "culeyman",
                            "score": 2,
                            "created_utc": 1651709722.0,
                            "response": "Yeah they have the knowledge about crypto and they are understanding it's value",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7h1sox",
                                    "author": "viphuong1994",
                                    "score": 1,
                                    "created_utc": 1651783841.0,
                                    "response": "No doubt about it she is having a complete logic out of a situation which is making that sense.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i7ab6th",
                    "author": "NeverLace",
                    "score": 1,
                    "created_utc": 1651668705.0,
                    "response": "True but not the whole trouth. I think she would enjoy defi alot more. Yes people who buy at the market top gets rekt, but people who buy at stocks tops also gets recked, because they're inexperienced and dont hold, not because some whales forces them to lose money.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7caoun",
                            "author": "dnick",
                            "score": 2,
                            "created_utc": 1651697667.0,
                            "response": "right, people engaging with the technology in non-ideal ways, and other people taking advantage of that doesn't make the technology, or even the implementation as 'scam'.\n\n&#x200B;\n\nBitcoin and the others with significant market share are more or less objectively not a scam...they're just getting popular enough to be worth building scams on top of them, not unlike fiat or any other platform.  Twitter isn't a scam just because people use it to push their scammy crap.  Email isn't a scam just because it gives scammers a convenient delivery machanism.  Fiat isn't scam just because there are side hustlers.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7cg40a",
                                    "author": "NeverLace",
                                    "score": 1,
                                    "created_utc": 1651699801.0,
                                    "response": "Nicely put.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i7f6wnt",
                                    "author": "radr0b",
                                    "score": 1,
                                    "created_utc": 1651756400.0,
                                    "response": "This kind of mechanism is going to work for them but I don't really think that it is a good Long Term plan\n\nThey have a very good potential out of it so I think that they should think of something more sustainable.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i7i024f",
                            "author": "dokarci",
                            "score": 1,
                            "created_utc": 1651799784.0,
                            "response": "No doubt about it is only the situation when a lot of people are going to put you off that weird clip where you don't want to be\n\nAnd that is the reason why lot of people fall into this kind of crap wear with actually don't want to get in.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7awqli",
                    "author": "FrankoIsFreedom",
                    "score": 1,
                    "created_utc": 1651677990.0,
                    "response": "She is right tho.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7c9b83",
                            "author": "dnick",
                            "score": 2,
                            "created_utc": 1651697148.0,
                            "response": "She isn't tho.  Shady/questionable/scammy things being done \\*with\\* bitcoin doesn't make it a scam itself.  It still has the value it's had from the beginning, and it may take some time for all the fluff to be dropped, but the technology, and even the implementation of the bigger coins is still sound.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7g72kp",
                                    "author": "antoshko",
                                    "score": 1,
                                    "created_utc": 1651771511.0,
                                    "response": "Will no doubt about it it is not going to be a scam or something like that but it is definitely going to take some time out of this\n\nWe have to make some legal and big changes so that everyone think that this is a writing and they can work accordingly.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i7cfbim",
                                    "author": "FrankoIsFreedom",
                                    "score": 0,
                                    "created_utc": 1651699483.0,
                                    "response": "She is tho.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i7cmo4x",
                                            "author": "dnick",
                                            "score": 5,
                                            "created_utc": 1651702400.0,
                                            "response": "So you think that because people can use a good technology in a bad way, that makes it a scam? Do you think email is a scam? Do you think telephone's are a scam?  Is the internet a scam?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9gnd1z",
                                                    "author": "FrankoIsFreedom",
                                                    "score": 1,
                                                    "created_utc": 1653148760.0,
                                                    "response": "No, but I do think the original proponents lied to all of us and really just wanted to become rich.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i7g4tk4",
                                            "author": "KartoffelCommand",
                                            "score": 1,
                                            "created_utc": 1651770619.0,
                                            "response": "No doubt about it I think that she was particularly right on that fact and we have to research Some more on that.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i7bw9ze",
                    "author": "Far-Pressure-5742",
                    "score": 1,
                    "created_utc": 1651692072.0,
                    "response": "Scam , scam dont buy into that.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7cnqb3",
                    "author": "Ok_Concept_859",
                    "score": 1,
                    "created_utc": 1651702834.0,
                    "response": "Never would have guess she was Warren Buffet’s niece.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7ggyg8",
                            "author": "vicovolk",
                            "score": 1,
                            "created_utc": 1651775477.0,
                            "response": "Third sex you know that what they are going to say and how they are going to say so they have a clear understanding of how things are actually working\n\nThat is the only reason why I was thinking that they were complete understanding of that.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7efs3b",
                    "author": "bullett007",
                    "score": 1,
                    "created_utc": 1651737319.0,
                    "response": "Ok so in an alternate universe, where BCH is the BTC. \n\nWouldn’t this answer be exactly the same thing?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7ieany",
                            "author": "mccullrs",
                            "score": 1,
                            "created_utc": 1651806901.0,
                            "response": "Actually going to say the exact same kind of thing as you are saying because everyone have different mindset\n\nEveryone is going to say the things which they want to hear and which they don't want to hear as well.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7j01tp",
                                    "author": "bullett007",
                                    "score": 1,
                                    "created_utc": 1651821489.0,
                                    "response": "You get what I’m saying though right?\n\nLet’s say there was never a split to BCH and BTC had increased its blocksize.\n\nWhat would have prevented a coinbase and a crypto.com from showing up as pseudo banks in the space anyway, imo nothing.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i7z5pm4",
                    "author": "paraspiral",
                    "score": 1,
                    "created_utc": 1652134727.0,
                    "response": "But this is the case with all markets.... not just crypto.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i81pis6",
                    "author": "TinosNitso",
                    "score": 1,
                    "created_utc": 1652188608.0,
                    "response": "It looks like what she's saying applies much more to BCH than BTC. BCH is more true, imo. I've lost way over $100k holding BCH. I can't help but think I was dumped on by insiders who knew **smartBCH** would make us all look like scammers. At this point even a 30% block-size increase would move me back to BTC.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "ui0mzp",
            "title": "May the 4th be with you",
            "url": "https://i.redd.it/8azhgr4mpex81.jpg",
            "author": "user4morethan2mins",
            "created_utc": 1651647211.0,
            "score": 36,
            "num_comments": 28,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i79more",
                    "author": "cheaplightning",
                    "score": 8,
                    "created_utc": 1651650981.0,
                    "response": "That is a big spike.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7agi65",
                            "author": "minghaizai",
                            "score": 3,
                            "created_utc": 1651671237.0,
                            "response": "I mean yeah, that's a pretty big spike, is it recent?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i79opcb",
                    "author": "NilacTheGrim",
                    "score": 7,
                    "created_utc": 1651652742.0,
                    "response": "What is the explanation? Today's price movements?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i79p9bn",
                            "author": "cheaplightning",
                            "score": 7,
                            "created_utc": 1651653227.0,
                            "response": "Too localized. I assume testing something.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7b6nw5",
                                    "author": "gedger1",
                                    "score": 2,
                                    "created_utc": 1651682084.0,
                                    "response": "That's what it feels like, it feels like a testing. Not the actual chart.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i7a01ks",
                            "author": "Indean8",
                            "score": 3,
                            "created_utc": 1651662235.0,
                            "response": "I don't see a spike in today's chart tho, what chart that is?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7a0i40",
                                    "author": "user4morethan2mins",
                                    "score": 2,
                                    "created_utc": 1651662550.0,
                                    "response": "[fork.lol](https://fork.lol/tx/txs)",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i7b0i6r",
                    "author": "ErdoganTalk",
                    "score": 3,
                    "created_utc": 1651679544.0,
                    "response": "Powerful force behind that title",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7a0vi8",
                    "author": "ItsCollinT",
                    "score": 2,
                    "created_utc": 1651662801.0,
                    "response": "What's that spike? I think it's something that has happened in the past, it's not about now.\n\nI don't think that has happened in the bch in a long time. I think it's From the past. And it's kinda fitting a narrative.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "ui1fv6",
            "title": "Knuth Node (KTH) is a Python library Flipstarter, less then 1 day left!",
            "url": "https://www.reddit.com/r/btc/comments/ui1fv6/knuth_node_kth_is_a_python_library_flipstarter/",
            "author": "chainxor",
            "created_utc": 1651650766.0,
            "score": 25,
            "num_comments": 21,
            "subreddit": "btc",
            "selftext": "[https://fund.kth.cash/?id=13](https://fund.kth.cash/?id=13)   \n\n\n70.85 */* 120.00 BCH, less than 1 day left!   \n\n\nJust like Verde, The Knuth team has made a number of important contributions to BCH, herein important optimizations and of course the high performant Knuth node.   \nHaving Knuth node as Python library sounds like a good way to get BCH development into more hands, since Python is much easier to code in for a lot of people.",
            "stickied": false,
            "comments": [
                {
                    "id": "i7ab9jb",
                    "author": "Bagatell_",
                    "score": 8,
                    "created_utc": 1651668743.0,
                    "response": "The campaign has been funded.\n\nWell done Knuth Node!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7axniw",
                            "author": "chainxor",
                            "score": 4,
                            "created_utc": 1651678352.0,
                            "response": "That was fast 😂",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i7ffq65",
                            "author": "moleccc",
                            "score": 2,
                            "created_utc": 1651760325.0,
                            "response": "Looking at the list of major contributors I have to say I like what I see: an unknown-to-me name is top contributory. Either a newcomer (to flipstarter) or a regular undercover. And 2 projects/companies: satoshidice has contributed to infrastructure before and is continuing. Tangoswap chimes in (i think they did before, but not sure)\n\nAdd in the fact that the Verde fs had a lot of contributors (enabled by the minimum amount problem having been solved).\n\nRemember when they said \"voluntary funding is not sustainable\"? How long have we been doing this now? 2 years plus? \n\nWe said whales and big fish would fund projects to protect their investments and add value. It happened.\n\nWe said companies would jump in to support their market and increase reputation. It's happening!\n\nI'm really happy. Thanks to everyone contributing to this flipstarter and all the others.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i7fdpc3",
                            "author": "moleccc",
                            "score": 1,
                            "created_utc": 1651759466.0,
                            "response": "Woohoooo!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "uhw6yn",
            "title": "Why use Bitcoin cash? my 5 important points. (My opinion) ENGLISH/ESPAÑOL",
            "url": "https://read.cash/@Bitcoincashtrue/why-use-bitcoin-cash-my-5-important-points-my-opinion-enes-917fd188",
            "author": "LowIndividual3126",
            "created_utc": 1651630469.0,
            "score": 14,
            "num_comments": 15,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i79tmqi",
                    "author": "EmergentCoding",
                    "score": 2,
                    "created_utc": 1651657154.0,
                    "response": "Great article. Makes me proud to be a casher.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}