{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uqqb9w",
            "title": "Do you feel weird that this upgrade was without drama? We BCH community used to be full of drama.",
            "url": "https://www.reddit.com/r/btc/comments/uqqb9w/do_you_feel_weird_that_this_upgrade_was_without/",
            "author": "No-Bookkeeper4061",
            "created_utc": 1652686255.0,
            "score": 0,
            "num_comments": 6,
            "subreddit": "btc",
            "selftext": "\n\n[View Poll](https://www.reddit.com/poll/uqqb9w)",
            "stickied": false,
            "comments": [
                {
                    "id": "i8sn5f7",
                    "author": "BewareOfShills",
                    "score": 11,
                    "created_utc": 1652687366.0,
                    "response": "Smells like concern trolling. If there is no drama, lets at least talk about past drama.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8snlsz",
                            "author": "user4morethan2mins",
                            "score": 8,
                            "created_utc": 1652687773.0,
                            "response": "Not the first time OP has tried this. [fake drama](https://www.reddit.com/r/btc/comments/uiee37/lots_of_btc_supportors_are_having_war_with_elon/i7cgbyk?utm_medium=android_app&utm_source=share&context=3)\n\n>You already created one drama-stirring post about Elon & BCH today. Why not engage in your original post? LovelyDayHere",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8trlhp",
                    "author": "Shibinator",
                    "score": 6,
                    "created_utc": 1652713134.0,
                    "response": "We've moved past that, and implemented better systems.\n\nFocus on the better future, not the past issues.  They're past, that's the point. Now we have time and energy for more important battles.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8sxy8j",
                    "author": "Br0kenRabbitTV",
                    "score": 3,
                    "created_utc": 1652697020.0,
                    "response": "What type of dumb poll is this, where is the simple \"Yes\" option?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8y2259",
                    "author": "capistor",
                    "score": 1,
                    "created_utc": 1652795394.0,
                    "response": "Only coin to have overthrown the lead dev. \n\nSame thing happened in Africa. There was an attempted genocide in one country, but the victims slaughtered all of the attackers. It is now the only spot in Africa you can leave a bike on the street unlocked and it will not be stolen.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i90onhv",
                    "author": "tl121",
                    "score": 1,
                    "created_utc": 1652835981.0,
                    "response": "There was no drama on May 15 because honest competent members of an upright community coopersted to design, develop, test and deploy good work.  **We should thank these people!**\n\nWe are fortunate that others who were not honest or competent in the past have gone elsewhere. Unfortunately, their deleterious actions still hurt everyone in the crypto space indirectly through loss of reputation.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uqqg2t",
            "title": "My biggest concern about BCH is that darknet drug dealers don’t accept it.",
            "url": "https://www.reddit.com/r/btc/comments/uqqg2t/my_biggest_concern_about_bch_is_that_darknet_drug/",
            "author": "Sugarbird676",
            "created_utc": 1652686839.0,
            "score": 16,
            "num_comments": 50,
            "subreddit": "btc",
            "selftext": "I first started paying attention to bitcoin in the Silk Road days, and very early on, when people would say that bitcoin is backed by nothing, I thought it was backed by drugs. I don’t value heroin any more than I value gold. I am not a jeweler or addict, but I know someone always values these things and will trade money for them, and if someone can use bitcoin to buy them, then via the transitive property, bitcoin is worth money. As long as it can be used to obtain something of value, and especially if it is the only or best way to obtain that thing, then it has value.\n\nWe say we want to build parallel economies, but those economies tend to be outlawed. So something that can continue to exist and be used in the face of being outlawed is truly resilient. We focus on means of exchange over store of value, but people need to value your thing in order to trade with you.\n\nSo, why do you think there are no BCH darknet markets? Would widespread awareness of Cash Fusion change this?",
            "stickied": false,
            "comments": [
                {
                    "id": "i8stdc4",
                    "author": "Redhead_Empire",
                    "score": 16,
                    "created_utc": 1652693021.0,
                    "response": "Most darkened markets are monero only. One of if not the most bullish use case for the coin",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8trhzu",
                            "author": "Far_Grapefruit_2552",
                            "score": -5,
                            "created_utc": 1652713094.0,
                            "response": "I thnk you might not know, but there are privacy coins out there more anonymous than monero. One such privacy coin is Pandora Cash that is completely untraceable being 25 times more anonymous than monero. Making it impossible to trace. If xmr uses 10 decoys for each transaction, Pandora Cash uses 256 decoys. I wish them good luck to track my pandora cash. haha",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8tv0s6",
                                    "author": "Redhead_Empire",
                                    "score": 7,
                                    "created_utc": 1652714559.0,
                                    "response": "Community support is one of the most important aspects of cryptocurrency IMO. Monero does what it was intended to do and it has a ton of support behind it. It can always have network upgrades as needed. Once whatever privacy coin you’d like to shill is being used to do billions of dollars of illicit activity online then we have a conversation",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8tvjbj",
                                            "author": "Far_Grapefruit_2552",
                                            "score": -5,
                                            "created_utc": 1652714776.0,
                                            "response": "Isn't it right that you just want to buy it high when the market is over saturated?  The project I was talking about was launched less than one month ago. It is a micro cap project that has a high chance to do 50x when we get market adoption. Ofc i didn't go all in. It is a bet, but a very good one because the tech is really great! High risk high reward. Isn't it ?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8tvy3f",
                                                    "author": "Redhead_Empire",
                                                    "score": 4,
                                                    "created_utc": 1652714946.0,
                                                    "response": "Oh so your a shill got it. Sorry no more buying shit coins for me. I’m not here to try and make 50x on a no name coin that came out a month ago. I invest in and use a very small amount of crypto currencies and do not plan to add a single one to my portfolio.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8tywbi",
                                                            "author": "i_have_chosen_a_name",
                                                            "score": 2,
                                                            "created_utc": 1652716154.0,
                                                            "response": "You are talking to a bot by the way.",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "i8w11b6",
                                                            "author": "QuantumLeapChicago",
                                                            "score": 1,
                                                            "created_utc": 1652747684.0,
                                                            "response": "I'm so stoked that there's someone out there who thinks like me. People think I'm nuts when I tell them this exact thing. \n\nNo, I don't care about \"wen moon\" gains, or the latest algorithmic stable scheme. I just want the most useful, private, easiest, cheapest, p2p cash. For buying pizza, BCH works great. For dApps, eth. For private transactions, Monero. For everything else there's Mastercard lol",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "i8twzx8",
                                                            "author": "Far_Grapefruit_2552",
                                                            "score": -2,
                                                            "created_utc": 1652715380.0,
                                                            "response": "I am not shilling it. I am just doing my \"job\" as a community member to make the market adopt a more anonymous coin that has great tech. I am an early adopter and I am comfortable with it. As I said, high risk and high reward. It can go down as it is a micro cap project. It has only upside potential. Again, if it gets market adoption. The product is finished.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8szlzs",
                    "author": "Br0kenRabbitTV",
                    "score": 7,
                    "created_utc": 1652698324.0,
                    "response": "It doesn't make sense to use anything but XMR on those markets in 2022.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8t8yo2",
                            "author": "BlueBloodStrawberry",
                            "score": 6,
                            "created_utc": 1652704323.0,
                            "response": "In 2025 it won't make sense anything beside privacy coins in any kind of market",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8tafjx",
                                    "author": "Br0kenRabbitTV",
                                    "score": 7,
                                    "created_utc": 1652705126.0,
                                    "response": "It's not really an issue for me as a merchant accepting coins with a public ledger TBH, generating a new address for each customer. It's not like a normal person can easily follow a coin and extract info from wherever I spend it, swap it, it cash it out.. and no need to look for my identity as I'm fully doxxed on these stores anyway. I do accept XMR but it;s a bit more clunky than coins like BCH and harder for customers to obtain.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8tkspm",
                                            "author": "BlueBloodStrawberry",
                                            "score": 0,
                                            "created_utc": 1652710200.0,
                                            "response": "I'm not a merchant and I don't care how merchants conduct their business.\n\nAs a customer, I would rather keep my spendings private.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8tnnrz",
                                                    "author": "Br0kenRabbitTV",
                                                    "score": 4,
                                                    "created_utc": 1652711459.0,
                                                    "response": "I mean that's your choice, but there is no way a normal person could work out what a customer buys on my stores, or even that is was indeed a store it was spent on.\n\nHow would these people even get your wallet address and why would they even been looking or following you? It would be basically impossible for a normal person to link this activity to your identity or the identity of the store it was spent on.\n\nYou do you, removing all coins and only accepting XMR would lose me money, as well as customers because it's much harder to obtain than other coins.\n\nI don't care what you do either, and nor does anybody else for that matter.\n\nBy your logic, fiat will also be useless for normal stores in 2025...",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8u2fj8",
                                                            "author": "0x445442",
                                                            "score": 3,
                                                            "created_utc": 1652717586.0,
                                                            "response": "I don't think he's worried about normal people tracking what he buys.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8u49wa",
                                                                    "author": "Br0kenRabbitTV",
                                                                    "score": 3,
                                                                    "created_utc": 1652718327.0,
                                                                    "response": "Agreed, but unless buying illegal goods.. it doesn't really matter. The government can get much more info from existing fiat payment systems. While I agree XMR is the only real option for illegal activities, such privacy isn't needed for day to day goods at all.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i8unxkp",
                                                                            "author": "0x445442",
                                                                            "score": 2,
                                                                            "created_utc": 1652726122.0,
                                                                            "response": "I can buy and sell gold and silver anonymously and pay for goods and services anonymously with cash. This to me is the biggest drawback to cryptos. Just try buying BCH anonymously and if you manage that, try converting it to USD anonymously. It's no mystery why it's difficult to buy and sell Monero for USD. The Gubment has already effectively removed a key characteristic of cryptos.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i8uqegq",
                                                                                    "author": "Br0kenRabbitTV",
                                                                                    "score": 1,
                                                                                    "created_utc": 1652727124.0,
                                                                                    "response": "It's no harder to buy BCH anonymously than it is XMR.. converting to fiat anonymously is harder but still possible. All the issues you are talking about are due to you wanting to use third parties. I've been using crypto for well over a decade and never once shown ID anywhere, and have no issues \"cashing out\" without using exchanges either.\n\nYou are swapping your privacy for convenience, that's all it is.\n\nAll of this was basically normalised by people getting into crypto wanting to get rich, many of us laughed at all of this at first (and still do), and have remained private the whole time. I will never use any method or service that requires me to show ID.\n\nIt completely defeats the point IMO, and one of the reasons I got into crypto.\n\nIf it was so traceable, every single vendor from every single DNM that ever accepted BTC would have been caught, as an example.. but that isn't the case at all.\n\nPeople could always try using it as intended, sell goods for it, mine, do p2p trades..",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i8v8ncy",
                                                                                            "author": "0x445442",
                                                                                            "score": 1,
                                                                                            "created_utc": 1652734586.0,
                                                                                            "response": "> I've been using crypto for well over a decade and never once shown ID anywhere\n\nYay for you. I'm just telling you the current state of things in the US; it's not easy. Also, I never said it's harder to buy BCH anonymously. I said it's harder to buy and sell Monero for USD than BCH and this is by design of the Gubment.\n\n&#x200B;\n\n> You are swapping your privacy for convenience, that's all it is.\n\nI don't have to make that swap with Gold and Silver. Perhaps there's business opportunities for Coin dealers to buy and sell cryptos for small premiums.\n\n&#x200B;\n\n>People could always try using it as intended, sell goods for it, mine, do p2p trades..\n\nAgreed but that's not ubiquitous now and removing the friction of and preserving the anonymity of going back and forth between USD and BCH will provide a positive feedback loop to its intended usage.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "id": "i8ui4mh",
                                                                            "author": "BlueBloodStrawberry",
                                                                            "score": -1,
                                                                            "created_utc": 1652723813.0,
                                                                            "response": "What a narrow mindset...\n\nSo unless I buy illegal stuff, I should let everybody see how I spend my money?\n\nSoon, insurence companies will see what you spend your money on. If you buy cigaretes, alchol, too much sweets, etc... they could use it against you and offer you a worse rate.\n\nSoon, we will become carbon footprint slaves. Everything you buy will be calculated and added to your carbon footprint tax. Even throwing garbage will be a luxury.\n\nThis is why woke people prefer to use cash instead of cards.\n\nBtw, Monero is not the only privacy coin.\n\nThe era of privacy coins is yet to come. MW just started. And soon privacy coins will prevail because transparent ledgers make no sense.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i8ukbkh",
                                                                                    "author": "Br0kenRabbitTV",
                                                                                    "score": 1,
                                                                                    "created_utc": 1652724675.0,
                                                                                    "response": "\"everybody\" can't see how or where you spend your money though.\n\nIMO you're the narrow minded one here.\n\nI'd say I'm pretty open minded personally, have accept crypto as payment for over a decade, and even have payment options for paranoid people like yourself.\n\nXMR is cool but the user (and merchant) experience is well behind coins like BCH.\n\nAnd to say stupid things like only privacy coins will work for any merchant in 2025 is just silly. I've got some tin foil hats for sale and will accept XMR if you're interested?\n\nI can't take anybody seriously that uses the term \"woke\", sorry.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i8x29r2",
                                                                                            "author": "BlueBloodStrawberry",
                                                                                            "score": 0,
                                                                                            "created_utc": 1652769766.0,
                                                                                            "response": "Wow! I'm talking to an 2011 crypto investor.\n\n&#x200B;\n\n>And to say stupid things like only privacy coins will work for any merchant in 2025 is just silly.\n\nI was talking about the customers convenience. As I said before: I dont care how merchants conduct their business.\n\nI just dont want to show the history of all my wallet interactions just because I want to buy something.\n\nHow can you not see what wrong with this kind of aproach?",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8srned",
                    "author": "MobTwo",
                    "score": 20,
                    "created_utc": 1652691453.0,
                    "response": "lol, if you're a drug addict, this is your chance to shine. Ask your friendly neighborhood drug dealer to accept Bitcoin Cash!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ss76w",
                    "author": "Phptower",
                    "score": 8,
                    "created_utc": 1652691945.0,
                    "response": "Piratebay is also a BTC maxi (core). What a shame! I use them a lot but it's just irrational.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8szylg",
                            "author": "ATHSE",
                            "score": 10,
                            "created_utc": 1652698588.0,
                            "response": "Who's gonna pay $63 to donate $5?",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8t8s0i",
                            "author": "BlueBloodStrawberry",
                            "score": 2,
                            "created_utc": 1652704219.0,
                            "response": "Not true.\n\nThey accept BTC, LTC, ETH and XMR.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8wvnum",
                                    "author": "wtfCraigwtf",
                                    "score": 1,
                                    "created_utc": 1652764694.0,
                                    "response": "LTC lol, nobody uses that shitcoin unless the BTC fees are sky-high and they can't be caught by Maxies using BCH",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8xrglg",
                                            "author": "BlueBloodStrawberry",
                                            "score": 1,
                                            "created_utc": 1652790012.0,
                                            "response": "just... wow",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8sztln",
                    "author": "ATHSE",
                    "score": 3,
                    "created_utc": 1652698486.0,
                    "response": "I kinda agree with you, moral implications aside. It's not exactly like big pharma are on the up and up (opioids, cancer causing sunblock, mrna therapies, etc)...\n\nUsage is usage, usage drives demand, demand drives value. Just like porn made VHS win the tape war with Sony, and CDs won the war also against Sony's Minidisc, we can never underestimate the power of the common man, using the thing that's easiest and cheapest, even if we don't necessarily agree with the use case.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8t48fw",
                            "author": "Collaborationeur",
                            "score": 5,
                            "created_utc": 1652701479.0,
                            "response": "In the context of adoption porn would seem much more interesting to leverage than darknet markets. There is a larger number of users implied and less law enforcement pushback to expect...\n\nPersonally I think that leaving digital traces for your 'dark' transactions is simply stupid, smart people go analog for such business...",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8unhpu",
                                    "author": "Sugarbird676",
                                    "score": 1,
                                    "created_utc": 1652725947.0,
                                    "response": "In terms of marketing, I agree with you, but in terms of resilience against the state, if people are openly using your currency for something which is blatantly illegal, this shows the world that you can’t be stopped. (Or that the state tacitly approves, eg, Tether still operating despite being obvious counterfeiting.)",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8uobx8",
                                            "author": "Collaborationeur",
                                            "score": 1,
                                            "created_utc": 1652726284.0,
                                            "response": "> if people are openly using your currency for something which is blatantly illegal, this shows the world that you can’t be stopped.\n\nThis works both ways: the state has to show that it can't be stopped even more so. It will set examples :-(\n\nChoose your battles wisely (or don't listen to me but to Sun Tzu: “Victorious warriors win first and then go to war, while defeated warriors go to war first and then seek to win”)",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8u2yqq",
                    "author": "bitsconnected",
                    "score": 3,
                    "created_utc": 1652717803.0,
                    "response": "There aren’t any more BTC dn markets anymore either. Transparent blockchains aren’t ideal for private transactions >!no matter how much you mix!<",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8sw85m",
                    "author": "LovelyDayHere",
                    "score": 9,
                    "created_utc": 1652695582.0,
                    "response": "Once all the non-drug-dealer establishments accept Bitcoin Cash, where are the drug dealers going to buy regular goods?\n\nThat's why I don't see a problem with not focusing on the dark markets. At all.\n\nFor those who like stronger privacy than plain old Bitcoin offers, there is [CashFusion](https://cashfusion.org) on Bitcoin Cash, through wallets like [Electron Cash](https://electroncash.org).",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8t04oz",
                            "author": "ATHSE",
                            "score": 4,
                            "created_utc": 1652698717.0,
                            "response": "The City of London banks launder at least $300bn/yr for the drug cartels, and that's not including the highly obscured shell-company game exposed in the Panama papers.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8tktaz",
                            "author": "mtrycz",
                            "score": 3,
                            "created_utc": 1652710207.0,
                            "response": "The more the merrier, tho!",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8wawmd",
                            "author": "Sugarbird676",
                            "score": 1,
                            "created_utc": 1652752630.0,
                            "response": "I love this perspective!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8tksca",
                    "author": "dogbunny",
                    "score": 2,
                    "created_utc": 1652710195.0,
                    "response": "Need to make BCH the favorite means of converting private gains into a public space.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}