{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "utrbzj",
            "title": "Bill gates does misguided Reddit AMA and all of the top questions are appropriately questioning his relationship to Epstein. He is a dumbass when it comes to crypto as well: Here's the LINK---> https://www.reddit.com/r/IAmA/comments/ut7yj0/im_bill_gates_cochair_of_the_bill_and_melinda/",
            "url": "https://i.redd.it/918fjmje0m091.png",
            "author": "EarthenPersen",
            "created_utc": 1653043229.0,
            "score": 11,
            "num_comments": 15,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9bs1c8",
                    "author": "Br0kenRabbitTV",
                    "score": 11,
                    "created_utc": 1653053484.0,
                    "response": "Microsoft accepted Bitcoin as payment for a while though, then removed it when the network got congested and fees went crazy due to the flood of retail investors in 2017. I got perma-banned last night in a certain sub for commenting in a thread about this and giving my opinion on a few things.\n\nHe's not completely wrong though is he? A lot of the value now days comes from the hype and what people think the next person will buy it from them for. I'm not saying it's worthless though.\n\nThe comment that got me banned was mentioning they accepted it once but removed it when it was crippled in 2017, saying it was crippled in 2017 triggered somebody badly, and got 3 mod messages ranting about \"becash\" when I hadn't even mentioned any coin at all, other than BTC. Another mod I DM'd has told me to message them on Monday to appeal, as when I replied to modmail to try and explain what I said had absolutely nothing to do with BCH I was muted for 28 days.\n\nAnybody who runs a store can confirm it was crippled for months after the ATH.\n\nIf my appeal fails, I will post the screenshots in here, it was silly TBH and a massive assumption on every comment I made. I have always been very careful not to mention other tickers in there.\n\nFrom the comments here already I guess I can expect downvotes in here as well.\n\nBut lets be realistic, Bill Gates isn't exactly stupid.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9c2w5g",
                            "author": "Vlyn",
                            "score": 1,
                            "created_utc": 1653058012.0,
                            "response": "The original value of Bitcoin was a fully p2p currency you could actually own (and that nobody could print more of than planned). No restrictions, I could send a random person on the other side of the globe a few cents, or a billion USD for nearly free.\n\nThe price going \"to the moon\" was about adoption from the start. If there's x amount of Bitcoin and the amount of people who want to use those coins grows a hundredfold, the price has to go up sooner or later due to demand.\n\nInstead BTC got crippled, vendors dropped it (For example Valve) and now it's purely speculation and being pumped by Tether. BTC should have collapsed in 2017 when BCH tried to correct course, unfortunately we didn't manage to get that far.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9c5do8",
                            "author": "rbrumble",
                            "score": 1,
                            "created_utc": 1653059011.0,
                            "response": "He is far from stupid, and what he said with respect to bitcoin is more an example of a Clarke's first law violation.  As bleeding edge as his innovations were in the early perdonal computing days, it's only reasonable he might be a bit out of touch on some more recent things.  My guess is he still has a home phone too.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9bs5ae",
                    "author": "big--if-true",
                    "score": 3,
                    "created_utc": 1653053534.0,
                    "response": "lol",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9c1cc3",
                    "author": "CartmanLuvJews",
                    "score": 2,
                    "created_utc": 1653057396.0,
                    "response": "Yep he said it right. Just like Fiat. Who would’ve thought a damn piece of paper would’ve been a way of currencies lmao",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9bjhua",
                    "author": "doramas89",
                    "score": 3,
                    "created_utc": 1653049463.0,
                    "response": "Bill Gates is an enemy of human freedom. This month countries are voting to give supranational rights to the WHO and other globalist organizations with the same agenda as him. These guys want a single government above countries, with a digital CBDC linked to digital ID...",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9bah7i",
                    "author": "Pablo_Picasho",
                    "score": 0,
                    "created_utc": 1653044383.0,
                    "response": "It tells me something about a person who has access to the best advice in the world, when their opinion on Bitcoin is so trite and superficial.\n\n\\#scared",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9barfc",
                            "author": "EarthenPersen",
                            "score": -2,
                            "created_utc": 1653044554.0,
                            "response": "It tells me the CIA has dirt on him, and has to do/say whatever they want... https://www.reddit.com/r/banned4life/comments/utfo9g/fuck_the_cia/",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9bf4qb",
                                    "author": "Bagmasterflash",
                                    "score": 1,
                                    "created_utc": 1653047160.0,
                                    "response": "Right?  It takes about ten min of thought to realize bitcoins value is financial freedom.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9blenh",
                    "author": "mjh808",
                    "score": 1,
                    "created_utc": 1653050417.0,
                    "response": "Surprised it wasn't about his investments in pharma and WHO which are soon to take control of lockdowns and vax mandates around the world.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9buojg",
                            "author": "zcleghern",
                            "score": 3,
                            "created_utc": 1653054631.0,
                            "response": "What are you on about? Lockdowns in most places haven't happened in 2 years, and more and more places are getting rid of Covid restrictions entirely.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9bv2ho",
                                    "author": "mjh808",
                                    "score": -3,
                                    "created_utc": 1653054798.0,
                                    "response": "This is about the handling of future 'pandemic's, monkeypox seems to be their latest fraud https://twitter.com/DellAnnaLuca/status/1527286041199071232",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9bvbh7",
                                            "author": "zcleghern",
                                            "score": 3,
                                            "created_utc": 1653054905.0,
                                            "response": "oh, you're just a conspiracy person. ok, moving on",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9bvkyh",
                                                    "author": "mjh808",
                                                    "score": -1,
                                                    "created_utc": 1653055015.0,
                                                    "response": "oh, you're a coincidence person, ok.. but here's the information on the WHO treaty for when you care about what's going on.  [https://twitter.com/CriticalSway/status/1526464386386345984](https://twitter.com/CriticalSway/status/1526464386386345984)",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}