{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "urnz6v",
            "title": "After the Terra/Luna crash the market needs more crypto utility, less speculation",
            "url": "https://www.reddit.com/r/btc/comments/urnz6v/after_the_terraluna_crash_the_market_needs_more/",
            "author": "VevayBice52",
            "created_utc": 1652798504.0,
            "score": 34,
            "num_comments": 8,
            "subreddit": "btc",
            "selftext": " May 2022 will go down in the history books as a turning point in the roll-out of blockchain technology. It began with the dramatic implosion of TerraUSD, a leading “stablecoin”, whose value has depreciated from near $100 to practically zero in a matter of days. Holders of one of the market’s most popular cryptocurrencies are now, to borrow a term from traditional finance, left holding worthless paper. The volatility in the stablecoin landscape even unpegged Tether, the flagship stablecoin pegged to the USD, as it temporarily sank to $0.96 on May 12th before correcting. All the while, BTC itself has dropped to lows not seen since 2020, bringing into serious question the trajectory of the broader crypto/blockchain space moving forward.\n\nExperts are now scratching their heads to answer this very question: what next? Despite the beating crypto markets have taken in recent days, a consensus is emerging that despite the volatility, crypto is simply too big to fail or just “go away” at this point in the game. According to Morningstar’s “2022 Crypto Landscape” report, market capitalization for the top 100 coins topped $1.7 trillion in January 2022 as both casual awareness in the public and capital inflows have steadily increased in-step. Rather than relegating crypto to the dustbin of history, the current instability in the market is likely to spur a shift in the types of goods and services blockchain/web3 companies provide.\n\nMore specifically, I believe that the current burst of bearish volatility in crypto markets will make investors and wallet holders begin valuing more functional uses for crypto and blockchain tech, as opposed to the recent fixation on highly-speculative forex-style trading. Though the potential for massive upside remains, the stablecoins’ dramatic crash has severely undermined public confidence in crypto’s function as a secure way to store wealth. Moving forward, I think that financial service providers for crypto holders will come out on top. Companies with tangible products and services, blockchain fintech if you will, stand to gain from the implosion of the overheated crypto trading space we’ve seen in recent weeks. \n\nOne particular niche in which I identify massive growth potential is in the area of crypto payment services. I remember the days when social payment apps like Venmo hit the market--it revolutionized how people spend money on the go. I imagine we will observe a similar trend take place over coming years, yet for seamless, fast, and cost-effective social payment services for crypto. Another area of anticipated change is the debate of centralized vs. decentralized exchanges. As the unpegging of Terra shows, fully decentralized algo-driven liquidity mechanisms can and do fail. We need a more stable, less risky alternative to prevent an entire generation’s accrued wealth from being wiped out in a matter of hours.\n\nIn an article that was actually published before the Terra/Luna crash, an opinion piece authored by Tyler Spalding agrees with this assertion and argues that the future of crypto payments will be both more tangible and more centralized; in his own words, “Beyond the idealism and technology, people inevitably use products that make their lives easier. People are predominantly going to use custodial wallets for retail payments. These products are safer, cheaper and more straightforward for an average person. People don’t care how payments work; they just want them to work.” \n\nRelatedly, Spalding also makes an argument for centralized network mechanisms to counterbalance some of the shortcomings of full decentralization that, practically speaking, negatively impact overall consumer welfare with little upside beyond the theoretical embrace of decentralization as a value in and of itself. According to him, “The hard reality is that we’ve never had truly full-stack decentralized payments in the first place. In the future, the significant majority of crypto payments will involve custodial products and multiple centralized components.”\n\nThe bottom line is that the future of crypto will likely see an emphasis placed on greater day-to-day utility as blockchain merges with or adopts goods and services provided by traditional financial institutions. Emerging regulatory frameworks for cryptocurrencies and digital assets are expected to streamline this process and accelerate the traditional FSIB industry’s embrace of blockchain financial technology. We are already beginning to see major financial institutions in the US like Fidelity’s idea of a BTC 401k plan, and this is just the beginning. The crypto winners of the future will not be sketchy exchanges with no accountability, identifiable team, or actual product, but credible providers of blockchain fintech that work to bridge the gap between crypto and traditional finance.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8yaj41",
                    "author": "CurvyGorilla202",
                    "score": 7,
                    "created_utc": 1652799074.0,
                    "response": "Well said!\n\nWhat are your thoughts on how Bitcoin Cash (BCH) fits in this landscape? \n\nThe tech exists to send payments thru non custodial means. Do you see this decreasing in the coming years and if so, why? Sounds to me like user education is the hurdle, not the tech. Make more user friendly tech/apps and the population will migrate to a non-custodial method.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8ybw20",
                            "author": "VevayBice52",
                            "score": 1,
                            "created_utc": 1652799641.0,
                            "response": "tbh I'm less interested in specific coins, moreso in the technology around crypto/blockchain and how its gradually replacing goods and services provided by traditional financial services. And payment apps, imo, are a central part of this trend",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8yalzy",
                    "author": "Remora_101",
                    "score": 6,
                    "created_utc": 1652799106.0,
                    "response": "What a wall of text. \n\nIf you are looking for utility, look at BitcoinCash. The no bullshit Bitcoin.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ywfbm",
                    "author": "aj2fromtheblock",
                    "score": 1,
                    "created_utc": 1652808055.0,
                    "response": "BCH has the most utility & long term strength to act as P2P money, overtrumping BTC as SOV.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ys62g",
                    "author": "swgo1",
                    "score": 1,
                    "created_utc": 1652806342.0,
                    "response": "Need fewer shitcoins.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8zup0a",
                    "author": "hero462",
                    "score": 1,
                    "created_utc": 1652822110.0,
                    "response": "We've needed more utility and less speculation since well before this.  The big one, BTC was turned into an unpractical, tether propped up ponzi scheme.  Most of the top ten is speculative garbage.  There will be more bubbles bursting.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8zjkm4",
                    "author": "Divniy",
                    "score": 0,
                    "created_utc": 1652817471.0,
                    "response": "Dramatic crash is caused by centralization. All stablecoins are centralized: the single entity is backing coins and create this 1:1 peg.\n\nCan more centralization be an answer? If that means more laws to regulate stablecoins then YES.\n\nWeb3 cannot happen without decentralized exchanges.\n\nWe are in bear market because technology is not yet there. Crypto is still beta testing.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "urnpwg",
            "title": "Luna: This didn’t age well",
            "url": "https://i.redd.it/dyvlrv8oq1091.jpg",
            "author": "Egon_1",
            "created_utc": 1652797764.0,
            "score": 141,
            "num_comments": 36,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8y7pzg",
                    "author": "Late_To_Parties",
                    "score": 43,
                    "created_utc": 1652797890.0,
                    "response": "Lol, its perfect. He doesn't have to change anything. \nHe's still a lunatic.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8y7ltl",
                    "author": "Egon_1",
                    "score": 11,
                    "created_utc": 1652797840.0,
                    "response": "Source https://twitter.com/novogratz/status/1478535972560195585",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i90s10u",
                            "author": "PotatoCooks",
                            "score": 3,
                            "created_utc": 1652837570.0,
                            "response": "I'm too lazy to check, did he ever make a recent post regarding his tattoo",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i910rf4",
                                    "author": "BTC_Throwaway_1",
                                    "score": 3,
                                    "created_utc": 1652841724.0,
                                    "response": "Some unrelated stuff a week later but nothing the past week and a half 🫣",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8zevim",
                    "author": "HansBlixJr",
                    "score": 8,
                    "created_utc": 1652815533.0,
                    "response": "easy change to TUNA",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8yxiyh",
                    "author": "btcxio",
                    "score": 8,
                    "created_utc": 1652808492.0,
                    "response": "🤦🏻‍♂️🤦🏻‍♂️🤦🏻‍♂️",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8yashx",
                    "author": "Remora_101",
                    "score": 23,
                    "created_utc": 1652799181.0,
                    "response": "I never understood Tattoos. But  I especially don't understand Tattoos about a subject I have zero control over.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8z2xj6",
                            "author": "pattybak3s",
                            "score": 14,
                            "created_utc": 1652810653.0,
                            "response": "sometimes people have a body and sometimes they like art and sometimes they want art on their body",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8ywzrt",
                            "author": "Unlucky-Bound",
                            "score": 4,
                            "created_utc": 1652808282.0,
                            "response": "Ugly tattoo at that",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i907ks7",
                                    "author": "nspectre",
                                    "score": 3,
                                    "created_utc": 1652827845.0,
                                    "response": "Looks like something picked off a [tattoo parlor wall.](https://images.saymedia-content.com/.image/t_share/MTczODA2ODYzOTI5NDUyMTcx/newbie-to-tattooing.jpg)\n\n&nbsp;\n\nLPT: Never get a tattoo of something picked off a tattoo parlor wall. It's like picking something from a Clip Art book and having it permanently attached to your body. \n\nAlso, don't pick something *topical*, that could become ***un***-topical. Like a [band](https://livinglovingmaid.files.wordpress.com/2014/10/justin-beiber-2.jpg) or a [celebrity.](https://www.inkedmag.com/.image/t_share/MTYxMzIyMTk5ODQyNTY0MDYw/bill-.jpg) [^[*]](https://deadstate.org/ted-nugent-to-trump-supporters-after-buffalo-shooting-go-berserk-on-the-skulls-of-democrats/)",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i91ims2",
                                            "author": "bitmeister",
                                            "score": 2,
                                            "created_utc": 1652852389.0,
                                            "response": "> It's like picking something from a Clip Art book\n\nOooo! *Clippy* would make a great tatt!",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i90lfui",
                                            "author": "FargoBTC",
                                            "score": 0,
                                            "created_utc": 1652834473.0,
                                            "response": "Nah, off the wall tattoos are some of the best. Especially if it's traditional, and you are interested in the history of tattoo. You must be over 50?",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i91l6dh",
                                            "author": "Fun_Ad3442",
                                            "score": 1,
                                            "created_utc": 1652854328.0,
                                            "response": "Speak for yourself! People have been getting american traditional tattoos off walls for generations! It may not be for everyone but it is collecting art that has rich historical meaning not clip art…also music and bands have done amazing things for peoples lives! So stop judging and open your ears maybe ask some people what their tattoos mean to them or why they got them. You’ll be surprised at the depth of some art. And others just get something because it makes them happy. So please work on yourself and stop judgeing the decisions others make with thier art and bodies. The tattoos you posted may be incredibly meaningful to those that got them.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8yrgr4",
                            "author": "elguapo4twenty",
                            "score": -5,
                            "created_utc": 1652806060.0,
                            "response": "I feel like the only time tattoos make complete sense is in prison or in really rough neighborhoods.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i91l5mw",
                            "author": "I_SUCK__AMA",
                            "score": 1,
                            "created_utc": 1652854312.0,
                            "response": "In 2012 a wrestler got a Romney face tattoo",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8ywsmx",
                    "author": "coastal_neon",
                    "score": 5,
                    "created_utc": 1652808202.0,
                    "response": "He went from Lunatic to lunatic real quick",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i91eihg",
                            "author": "JuiceColdman",
                            "score": 0,
                            "created_utc": 1652849485.0,
                            "response": "iunatic?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8zh0at",
                    "author": "Intrepid_Fox-237",
                    "score": 5,
                    "created_utc": 1652816409.0,
                    "response": "He could always change it to say \"Lunar Landing 1969\"... And make up some story about how Neil Armstrong was his mentor",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8z1l8p",
                    "author": "MIDNIGHTZOMBIE",
                    "score": 3,
                    "created_utc": 1652810114.0,
                    "response": "This could be changed to ‘EDNA’ pretty easily. No big deal.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i91ekyo",
                            "author": "JuiceColdman",
                            "score": 1,
                            "created_utc": 1652849532.0,
                            "response": "Or ‘BORT’\n\nBORT is also a name",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8yyzkk",
                    "author": "shadowmage666",
                    "score": 7,
                    "created_utc": 1652809084.0,
                    "response": "Luna means moon. It can just be a wolf and moon tattoo now",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i917cnq",
                            "author": "Late_To_Parties",
                            "score": 2,
                            "created_utc": 1652845152.0,
                            "response": "We'll still know.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8ymf4j",
                    "author": "nikola-crypto",
                    "score": 3,
                    "created_utc": 1652804025.0,
                    "response": "Never trust a tech based project run by a bunch of business men",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8yp1nj",
                            "author": "ellykunz1",
                            "score": 3,
                            "created_utc": 1652805091.0,
                            "response": "Truee",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8z15zc",
                    "author": "5dollaryo",
                    "score": 3,
                    "created_utc": 1652809940.0,
                    "response": "At least it’s American traditions style.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8zr0xh",
                    "author": "ApplicationAny1434",
                    "score": 3,
                    "created_utc": 1652820566.0,
                    "response": "2018 one guy went to mexico for a coin tatto, 3 days latter he came back, coin rug pulled....history just repeats it self",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i91enej",
                            "author": "JuiceColdman",
                            "score": 1,
                            "created_utc": 1652849578.0,
                            "response": "Wait who did it in 2018",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9067nq",
                    "author": "jbrev01",
                    "score": 2,
                    "created_utc": 1652827213.0,
                    "response": "That guy tweeted everyday up until the day of luna's crash. I bet he lost most of his net worth. Hope he's not considering suicide.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i91ltq8",
                            "author": "Fun_Ad3442",
                            "score": 1,
                            "created_utc": 1652854835.0,
                            "response": "Idk he is also an investor in space x and has a successful podcast I doubt luna was his only bet",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i90iphr",
                    "author": "blazeronin",
                    "score": 2,
                    "created_utc": 1652833197.0,
                    "response": "No regerts!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8zbeb6",
                    "author": "Leithm",
                    "score": 1,
                    "created_utc": 1652814118.0,
                    "response": "At least it isn't permanent or anything,........... Doh!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i902v0j",
                    "author": "FreeFactoid",
                    "score": 1,
                    "created_utc": 1652825677.0,
                    "response": "Psalm 18:26-27 ERV\nYou never do wrong to those who have done no wrong. But you outsmart the wicked, no matter how clever they are. [27] You help those who are humble, but you humiliate the proud.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i90xxfk",
                    "author": "chrisco_33",
                    "score": 1,
                    "created_utc": 1652840356.0,
                    "response": "Easily adjusted tat",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i91l3cq",
                    "author": "I_SUCK__AMA",
                    "score": 1,
                    "created_utc": 1652854261.0,
                    "response": "5/1/22\n\nOuch",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8zcwq0",
                    "author": "AmericanScream",
                    "score": -3,
                    "created_utc": 1652814735.0,
                    "response": "Show us your BTC tattoos... they'll age equally well.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}