{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uxhtkj",
            "title": "Bitcoin Cash Live Discussions: Twitter Spaces",
            "url": "https://read.cash/@Pantera/bitcoin-cash-live-discussions-twitter-spaces-df47c662",
            "author": "coinflip1211",
            "created_utc": 1653486603.0,
            "score": 10,
            "num_comments": 15,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9y8k2g",
                    "author": "thumatloi",
                    "score": 1,
                    "created_utc": 1653495004.0,
                    "response": "In the era of big data in the future, the BCH must have a very high status.\n\nIt can even be said that the future era is the era of bch digitization!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9zwdhr",
                    "author": "hyiphall",
                    "score": 1,
                    "created_utc": 1653519422.0,
                    "response": "Only you can control your wallet, no one else has any right to do these things.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uxhyo4",
            "title": "Bitcoin breaks the record for the longest drop in quotes. The largest cryptocurrency in terms of capitalization has been falling in price for the eighth week in a row, setting an all-time record.",
            "url": "https://i.redd.it/wmoyo4cbom191.png",
            "author": "KravoxWeb",
            "created_utc": 1653487035.0,
            "score": 254,
            "num_comments": 144,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9xsho5",
                    "author": "mrtest001",
                    "score": 33,
                    "created_utc": 1653488528.0,
                    "response": "If I believed in BTC, this would be a tremendous opportunity to buy.  Unfortunately, I won't support a coin that doesn't allow me to cheaply move it 24/365.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9xw2t5",
                            "author": "jessquit",
                            "score": 34,
                            "created_utc": 1653490022.0,
                            "response": "BTC doesn't even have a current white paper that describes the current vision for the project.  They abandoned the original project outline in 2016-2017 and have been running without a published vision since then.  They continue to [squat](http://bitcoin.org) on the Bitcoin white paper as if it is their intellectual property and continue to advertise BTC as if it still worked like Bitcoin worked before the change in direction -- for example they continue to call it a \"payment system\" not a store of value and declare that it has fast, cheap transactions even though BTC transactions are the slowest, most expensive crypto transactions in the world. \n\nIf any other crypto project did this it would be smeared top to bottom as a scam.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9zemea",
                                    "author": "Casino_Insider",
                                    "score": 6,
                                    "created_utc": 1653511652.0,
                                    "response": "It's not a store of value either because it's too volatile.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia1w6lo",
                                            "author": "Mckoenzie",
                                            "score": 1,
                                            "created_utc": 1653564274.0,
                                            "response": "I’m sorry - what happened to “100k on the low side” by Dec 2021? How does 14k sound?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia2alcn",
                                                    "author": "Casino_Insider",
                                                    "score": 2,
                                                    "created_utc": 1653572137.0,
                                                    "response": "Everything I've got that's not locked has been converted to stablecoins and is in a liquidity pool at the moment, the way the markets are fucked I don't expect crypto to go up in a while but it will sure go down!",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i9ycl0y",
                                    "author": "mrtest001",
                                    "score": 12,
                                    "created_utc": 1653496570.0,
                                    "response": "Unfortunately, its no one's fault but the user.  Bitcoin at this stage does require some level of technical understanding - and this level seems to be far beyond what the average user is willing to put in the work.\nIts up to the users who do understand that Bitcoin was meant to be a p2p cash system to build the ecosystem that attracts others.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia1mfgc",
                                            "author": "haicomarcus",
                                            "score": 0,
                                            "created_utc": 1653556578.0,
                                            "response": "why does the price fall and rebound: cos it’s a zero sum game, some ppl exit and more ppl buy their exit .",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "ia1qhdk",
                                    "author": "lodron_the_great",
                                    "score": 1,
                                    "created_utc": 1653560077.0,
                                    "response": "My understanding of Bitcoin \n\nWhere does it get its value from : from its limited supply and the continuous demand driven by global marketing",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "ia2r1zs",
                            "author": "morange81",
                            "score": 2,
                            "created_utc": 1653579051.0,
                            "response": "Haha bitcoin sub is boiling at the moment .\n\nThey all need some kind of therapy sooner or later ...",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "ia20wds",
                            "author": "pink_raya",
                            "score": 1,
                            "created_utc": 1653567200.0,
                            "response": "next block fee is <$0.5 for years and LN is few sats.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia2p62j",
                                    "author": "mrtest001",
                                    "score": 3,
                                    "created_utc": 1653578293.0,
                                    "response": "first $0.50 is too much.\n\nsecond are you claiming that BTC fees have *never* been more than $0.50 for next block ever?\n\nif you are not claiming that, then we are in agreement.\n\nthird for BTC to enjoy current level of miner incentives (eg $1B a month to process 400K txns per day), fees need to be $80 otherwise expect a 99% drop in hashrate or what percentage $0.50 is of $80.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia2u49z",
                                            "author": "pink_raya",
                                            "score": 1,
                                            "created_utc": 1653580279.0,
                                            "response": "I don't think I paid more than $0.5 unless I was ovepraying on purpose (after 2017). There has been a recent spike in avg fees around ATHs, but even during that temporary spike when avg fee was >$10, you could still get into next block with a $0.5.\n\nMiners profitability depends as much on their electricity price as on block reward, this is hard to predict, but at some point the single sig tx will cost a lot in usd, even if only the price changes and not demand for block space.\n\nI reacted because when btc fees are brought up, it most of the time seems like someone remembers ~$100 tx fees in december '17, and never made a tx since.\n\nI expect LN to solve this in a couple roundabout ways, to some extent.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia31pwg",
                                                    "author": "mrtest001",
                                                    "score": 2,
                                                    "created_utc": 1653583268.0,
                                                    "response": "All of this discussion with fees disappears with the low-fee version of Bitcoin called BitcoinCash.\n\nAll of this headache and playing 4D chess simply goes away.\n\nThe idea of BitcoinCash (and the original vision for Bitcoin) was nearly free transactions 24/365.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "ia33zoo",
                                                            "author": "pink_raya",
                                                            "score": 1,
                                                            "created_utc": 1653584151.0,
                                                            "response": "lol, ok.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "ia3avl1",
                                                                    "author": "mrtest001",
                                                                    "score": 2,
                                                                    "created_utc": 1653586884.0,
                                                                    "response": "ok.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "ia3x6zu",
                                    "author": "jessquit",
                                    "score": 1,
                                    "created_utc": 1653596060.0,
                                    "response": ">next block fee is <$0.5 for years \n\nBut the entire reason we limited the block size to tiny blocks smaller than a 30 year old floppy disk was to generate fees that would secure the blockchain forever.\n\n$0.50 x 3000txns/block (roughly the max number of transactions possible) is only $1500. That's not enough for long term security, and that's *despite* Bitcoin being the world's most in-demand cryptocurrency.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia3yui8",
                                            "author": "pink_raya",
                                            "score": 1,
                                            "created_utc": 1653596759.0,
                                            "response": "hey I remember talking to you! I guess I'll keep the obligatory sw was a blocksize increase to myself this time. Maybe there will be another when needed.\n\nyou are talking about the time when there's no more block rewards. We don't know how mining will work by then.\n\nmaybe there will be no need for new blocks on L1 after 2140, as one of the original purposes was fair distribution, not just doublespend. And you can't doublespend if you can't spend.\n\nIt's a dumb idea I had because even today, if the blocks stopped coming in, LN will continue to transact (probably not for long, but it's a weird concept).",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia3zgil",
                                                    "author": "jessquit",
                                                    "score": 1,
                                                    "created_utc": 1653597020.0,
                                                    "response": "All the L2 scaling in the world is useless if it means you have to sacrifice the very thing which gives Bitcoin its unique value. Only an onchain L1 transaction can put hard money Bitcoin into a wallet whose keys you uniquely control and which move when you want them to without any permission needed from a counterparty.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "ia47laj",
                                                            "author": "pink_raya",
                                                            "score": 1,
                                                            "created_utc": 1653600516.0,
                                                            "response": "keys are not the very thing, if anything the scarcity is and you aren't compromising it on L2 (at least if we talk about hard money part).\n\nagreed on the full control of course, LN is not a suitable replacement, just a wild thought for now making a point we don't know and maybe we don't need to know yet.\n\nGood thing about it is we have time to scrap it tomorrow and build a different L2, and then slap LN on it as L3 without impacting L1.\n\nwe can fuck L1 only once, and increasing the blocksize ahead of time just because has that potential.\n\nAlso L2 was Satoshi's idea not mine, iirc we talked about this before.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9xvl6v",
                    "author": "PanneKopp",
                    "score": 21,
                    "created_utc": 1653489824.0,
                    "response": "I am sorry for all those that had been lied to: there is NO Store of Value SoV without any real world Usage .",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia08ljx",
                            "author": "RockyMountain_Jeeper",
                            "score": 3,
                            "created_utc": 1653525189.0,
                            "response": "I don't know how many times I've had to argue that point.   It always ends with a maxi resorting to their standard 'because I said so!'\n\nIf it can't be used, it's worthless.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia3nn9e",
                                    "author": "Sunweed_inc",
                                    "score": 0,
                                    "created_utc": 1653592087.0,
                                    "response": "It’s over. Give it up. Over a year of pretty color charts .",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia3oqys",
                                            "author": "RockyMountain_Jeeper",
                                            "score": 2,
                                            "created_utc": 1653592545.0,
                                            "response": "... because you said so?  Lol",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "ia18dzz",
                            "author": "zxcjkltzxc",
                            "score": 1,
                            "created_utc": 1653544590.0,
                            "response": "given high fees on tx, why are there so many txs on that network then?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia20z3p",
                                    "author": "pink_raya",
                                    "score": 1,
                                    "created_utc": 1653567244.0,
                                    "response": "because the fees are low for 4 years now.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia4epua",
                                            "author": "zxcjkltzxc",
                                            "score": 1,
                                            "created_utc": 1653603684.0,
                                            "response": "so it's real world usage or not?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia4ikbf",
                                                    "author": "pink_raya",
                                                    "score": 1,
                                                    "created_utc": 1653605476.0,
                                                    "response": "wdym?\n\nmempool.space",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "ia3delk",
                            "author": "shalandoqxn",
                            "score": 1,
                            "created_utc": 1653587899.0,
                            "response": "I'm no expert but I believe Bitcoin will drop to 20,000.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia1gpi6",
                    "author": "NeoDemocrito",
                    "score": 6,
                    "created_utc": 1653551430.0,
                    "response": "There is an opportunity to buy and stake more at the moment like BCH.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9y387u",
                    "author": "xjunda",
                    "score": 17,
                    "created_utc": 1653492914.0,
                    "response": "Look at the transactions before 2017, then blockstream happened.\n\nWhat a shame, glad we have BCH.\n\nBTC got up to this point because it was usable, not anymore unfortunately.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9yvywi",
                            "author": "trakums",
                            "score": 3,
                            "created_utc": 1653504132.0,
                            "response": "BCH's idea is to have a multy gigabyte blocks on 1st level.\n\nI think the future is behind side-chains. Like SmartBCH but decentralized. Imagine hundreds of them. Fast, interoperable, anonymous. There is nothing that can prevent a birth of a decentralized side-chain.\n\nOr.... If this sub is right - there is an entity that controls almost all Bitcoin mining power and now steers it to abyss (Why though?). And no bankster ever will touch BCH.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9zofec",
                                    "author": "don2468",
                                    "score": 5,
                                    "created_utc": 1653515834.0,
                                    "response": "> There is nothing that can prevent a birth of a decentralized side-chain[.](https://archive.ph/yDKHG)\n\n\nAgreed, the bit your'e missing is the severe restriction of oxygen (onboarding / offboarding) that a ~5tps 'Mother Chain' could supply and what effect that will have on the newborn.\n\n\nNow imagine the same newborn with all the oxygen it needs - **WOW** - BCH PLS\n\n\nYou BTC Maxis like to talk about how the Internet is built up in layers, try limiting Internet backbone routers to 3 IP packets per second with a $1 toll per packet and see where that will get you.\n\n\n\n\n> Or.... If this sub is right - there is **AN** entity that controls **almost all Bitcoin mining power** and now steers it to abyss (Why though?).\n\n\nGigabyte blocks require ~1.7MB/s, a Raspberry Pi 4 can keep up with 256MB blocks using USB storage!\n\n\n**What size blocks could a modern gaming PC handle?** \n\n* With it's 20 to 40 times the horsepower (10 times single core throughput (ipc + clock), 2 to 4 times the core count (hyperthreading)) \n\n* Not even including AVX512 or GPU acceleration of sha256 or Signature checking, \n\n* Add in multiple 3 to 7 GB/s NVMe drives with native pci express, crushing the throughput and IOPs  that the USB3.0 Pi setup had.\n\nWhat would BCH be worth with full Gigabyte blocks? and you think committed  BCH hobbyists could not afford the above (not including all the rich ones)? Never mind all the Million dollar mining pools. So no probably not the centralisation that you seem to think.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia15iki",
                                            "author": "trakums",
                                            "score": -1,
                                            "created_utc": 1653542481.0,
                                            "response": "Decentralized side-chains would work like banks with gold reserves. You don't need to touch your gold reserves every second. WOW - BSV PLS (I don't know what this means this is BTC sub).  \n\nIf everybody knows that some BTC forks are better than BTC why majority of users and miners support the original chain?    \nIf BTC will not work with 1MB blocks, majority of users and miners will vote to increase the limit (Like Satoshi intended). BCH is like Trump who lost the elections and still acts like a winner. You are not gonna believe me but he still has a lot of supporters who think that the elections were stolen. \n\nThen organize another elections! God damn it!",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia1hl56",
                                                    "author": "Romadm",
                                                    "score": 2,
                                                    "created_utc": 1653552209.0,
                                                    "response": "That's a clear difference.\n\nI can't wait to see how far we could go next year .",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "ia1jfyl",
                                                            "author": "trakums",
                                                            "score": 1,
                                                            "created_utc": 1653553883.0,
                                                            "response": "Yes, the difference between BTC and BCH is very clear. One will use gigabyte blocks and the other will be layered.\n\nI also can not wait to see that. How far do you think they could go next year? A year ago it was 0.02 today it is 0.006. Can BCH go under 1/1000th of BTC?",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "ia2cijw",
                                                    "author": "don2468",
                                                    "score": 1,
                                                    "created_utc": 1653572997.0,
                                                    "response": "> Decentralized side-chains would work like banks with gold reserves. You don't need to touch your gold reserves every second. WOW - BSV PLS (I don't know what this means this is BTC sub)[.](https://www.archive.is/hzVl7)\n\n\nBut you do need to touch them at least once (if you want to self custody) and at your extremely lowball **future** figure of [$62](https://old.reddit.com/r/btc/comments/uxhyo4/bitcoin_breaks_the_record_for_the_longest_drop_in/ia1byz7/) per transaction (given mass adoption), what percentage of the human race could afford that?\n\n\n> If everybody knows that some BTC forks are **BETTER** than BTC \n\n\nBetter in what way?\n\n\n* Able to attract large amounts of centralised capital where custodial solutions are a feature not a bug and probably **needed** for their compliance?\n\n\n* Have enough base layer capacity to allow [*Permissionless P2P Money For The World*](https://www.youtube.com/watch?v=9mBc0Zk1YWs&t=148s).\n\n\n* Any others?\n\n\nYour participation here, **actively thinking** about how BTC, BCH, Layer 1, Layer 2 etc interact, puts you in a category above all the passive 'Number Go Up' crowd at least in terms of thinking about the fundamentals of your coin of choice.\n\n\n**And the fact that given this, YOU (the apparent cream of the crop) are unable to articulate a more PRECISE and WORTHWHILE statement than 'if everybody knows X is BETTER than Y' without qualifying what you mean by BETTER. Speaks volumes and should be kept in mind when contemplating your next question** \n\n\n> why majority of users and miners support the original chain?\n\n\n* If you want to to increase / preserve your **OWN** wealth buy BTC (at least for now)\n\n\n* If your aim is to **free the masses** from rent seekers (assuming this is possible) then BCH PLS\n\n\nThe majority of users and miners **follow the money** it's as simple as that.\n\n\nWhat drives this? \n\n\n* The Elon Musks, Michael Saylors and Cathie Woods etc of the World putting their money in and advocating for other billionaires to get 5%+ exposure. (hint they don't care about self custody)\n\n\n* Your 'users' see this and quite naturally want to increase their own wealth, of which the vast majority don't care about self custody either.\n\n\nThat should be easy enough to understand even for those that think you can scale in layers when the base layer capacity (that higher layers depend upon) is highly constrained, **how useful would the Internet be if backbone routers were limited to 3 packets per second and a $1 toll.**\n\n\n\n> If BTC will not work with 1MB blocks, majority of users and miners will vote to increase the limit (Like Satoshi intended). \n\n\nBig Money in the space doesn't care about high fees, they can afford them.\n\n\n**Whether you can afford to transact on the main chain will not be about how much 'BTC' you have but more about how much the people above you have.** BTC was put in quotes because of course the people on the bottom will only have IOU's. and the joke is - *that might be you*. heh heh!\n\n\nNow what do these Big Money interests need and want? \n\n\n**Extremely hard money - The harder it is to change the better**, as pointed out earlier fees and hence blocksize will not affect them as, either they can afford the fees, or a custodial solution is required for their compliance.\n\n\nBut you think principled 'users' and 'miners' are going to rebel and turn down the 'numbers go up' offered by the Big Money 1MB (non witness) chain, don't make me laugh, the principled people who were capable of understanding what a 1MB (non witness) cap would do to Bitcoin have already left or at the very least diversified.\n\n\nHere's the thoughts of one of BTC's main drivers (in terms of capital inflow) \n\n\n>> **Michael Saylor:** why you know if you if you read the block size wars a lot of manoeuvring back and forth but at the end of the day the immediate a priori observation is they shouldn't have tried to change anything **it was a mistake to try to change the block size**...  [link](https://www.youtube.com/watch?v=WvUE_Yvktwk&t=1505s)\n>>\n>> \n>> **You don't get to play God except once**... [link](https://www.youtube.com/watch?v=WvUE_Yvktwk&t=1546)\n>>\n>>\n>> The block size and the frequency of the network are akin to the space-time constants of the universe... [link](https://www.youtube.com/watch?v=WvUE_Yvktwk&t=1533)\n>>\n>>\n>> if Satoshi had designed the network with you know 1.2 megabyte blocks and eight minute frequency it might have worked and there are some parameters that wouldn't have worked **but once he started it and it started to spin then you don't change it**... [link](https://www.youtube.com/watch?v=WvUE_Yvktwk&t=1553)\n\n\nMore specifically on who will be holding the reigns in a Bitcoin dominated World.\n\n\n>> **Caitlin Long:** and how many of your developers will stay working for them if they get acquired by big banks\n>>\n>>\n>>> **Michael Saylor:** like we got to grow up at some point **there's a lot of Bitcoin Maxi's that don't like the idea that publicly traded companies own bitcoin but that doesn't stop me from buying three billion dollars of it** and there's a little friction between the past and the future **AND WHO'S GOING TO IMPACT THIS DECENTRALIZED CRYPTO ECONOMY** [source](https://www.youtube.com/watch?v=ko_MD_rnDdI&t=664s)\n                                                   \n\n\nRemember it's a lot easier to defend *no change* than to introduce change, we found that out in 2017.\n\n\nGood Luck with a block size increase.\n\n\n> BCH is like Trump who lost the elections and still acts like a winner. You are not gonna believe me but he still has a lot of supporters who think that the elections were stolen.\n\n\nThe only Trump like behaviour that I can see, is those who hold 2 mutually exclusive outcomes to be True at the same time,\n\n\n1. Blocks need to be small enough so nearly everyone can audit the complete financial history of the World\n\n\n2. Fees will be low enough so nearly everyone in the World will be able to self custody (if they want to).\n\n\n \n> Then organize another elections! God damn it!\n\n\nThe 'decentralised' grass roots elections are on going my friend, all over the World.\n\n\n* The Caribbean\n\n* BCH Latam\n\n* North Queensland\n\n\nTo name but three. How do you think Bitcoin got started in the first place?\n\n\nIt's as if you come to The Free Bitcoin Sub with your fingers in your ears and your eyes shut!!!",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "ia2qiqp",
                                            "author": "Bviktor2635",
                                            "score": 1,
                                            "created_utc": 1653578834.0,
                                            "response": "I think we can all agree that currently the best place to keep your cryptos is mistswap.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9z2ynn",
                                    "author": "jessquit",
                                    "score": 10,
                                    "created_utc": 1653506932.0,
                                    "response": ">BCH's idea is to have a multy gigabyte blocks on 1st level.\n\nBTC's idea is to recreate SWIFT using blocks smaller than a late-80s floppy disk.\n\n🤷\n\nBut before BCH hits 1GB blocks it will already have completely curb-stomped the entire crypto market and will be well on its way to replacing Visa as the defacto payment method worldwide.\n\nAt 1.5GB blocks BCH will be the #1 payment method in the world.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia165xa",
                                            "author": "trakums",
                                            "score": 0,
                                            "created_utc": 1653542941.0,
                                            "response": ">BTC's idea is to recreate SWIFT using blocks smaller than a late-80s floppy disk\n\nWhere did you get this idea? \n\nDecentralized side-chains would work like banks with gold reserves. You don't need to touch your gold reserves every second. You can track all bank's gold transactions on a late-80s floppy disk size media for many years. \n\nCurrently BCH has no chance in luring investors/believers away from BTC. And never will. If BTC will not work with 1MB blocks, majority of users and miners will vote to increase the limit. Like Satoshi intended. He is a genius.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia175fb",
                                                    "author": "jessquit",
                                                    "score": 1,
                                                    "created_utc": 1653543653.0,
                                                    "response": ">>BTC's idea is to recreate SWIFT using blocks smaller than a late-80s floppy disk\n>\n>Where did you get this idea? \n\nUuhhhhhh you're literally repeating it back to me:\n\n>Decentralized side-chains would work like banks with gold reserves. You don't need to touch your gold reserves every second. You can track all bank's gold transactions on a late-80s floppy disk size media for many years. \n\nWhat the hell? Gaslight harder.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "ia192hb",
                                                            "author": "trakums",
                                                            "score": 2,
                                                            "created_utc": 1653545112.0,
                                                            "response": ">Gaslight harder.\n\nI am not trying to question your reality, memory or perceptions (gaslighting definition). BCH will be fine (even if it falls below 1/1000th of BTC). BTC will be fine too. But if you think that talking with me puts you in a risk of questioning the reality, I suggest leaving.\n\nSo do you see any problem with multiple decentralized side-chain scenario?",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "ia19nzh",
                                                                    "author": "jessquit",
                                                                    "score": 1,
                                                                    "created_utc": 1653545581.0,
                                                                    "response": "Yes, it's been pointed out a million times. With 3000 transactions per block, base chain fees will have to reach into the hundreds or thousands of dollars. What intermediary will give me access to the blockchain then? I'm not one of the world's banking institutions, and neither are you.\n\nBut mostly I was pointing out your classic gaslighting strategy telling me I'm dead wrong then repeating exactly what I said as gospel truth. I'm about done with the low effort gaslighters that work this sub.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "ia2lx6m",
                                                                            "author": "seventy_8",
                                                                            "score": 1,
                                                                            "created_utc": 1653576964.0,
                                                                            "response": "I'm glad to witness this organic growth and how smartBCH helps BCH ecosystem.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        },
                                                                        {
                                                                            "id": "ia1byz7",
                                                                            "author": "trakums",
                                                                            "score": 0,
                                                                            "created_utc": 1653547407.0,
                                                                            "response": ">hundreds or thousands of dollars\n\nCan I see your calculations? To me it looks like 62$ is enough to replace current block reward (In a future where there will be no block rewards it will matter). Anyway a successful side-chain can afford base chain fees. Also I think there will be decentralized services that allow to open LN payment channels for many users with a single base chain payment. \n\nActually you are a gaslighter promoting BCH in a BTC sub. Telling me that Blockstream is controlling all the BTC mining power and there will never be a fair voting for a good hard fork. And they are steering Bitcoin to abyss and BTC is 100% going to fail. I missed the reason why Blockstream does that.\n\nI would never promote BTC in BCH sub. That would be gaslighting.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "ia1fypg",
                                                                                    "author": "jessquit",
                                                                                    "score": 3,
                                                                                    "created_utc": 1653550770.0,
                                                                                    "response": "> To me it looks like 62$ is enough to replace current block reward (In a future where there will be no block rewards it will matter)\n\nSure if you think that 2022 security for a network that moves 1/1000th the volume of SWIFT (look it up) is sufficient to overtake SWIFT.  I do not.  I think if you expect to move 1000X or more volume, you're gonna need 1000X more fees.  Why not?\n\n> Actually you are a gaslighter promoting BCH in a BTC sub.\n\nThis is the uncensored Bitcoin sub.  This sub exists to allow discussion of all topics related to Bitcoin.  This is not a \"BCH\" sub.  You're allowed to hang out here all you like (as long as you're not aggressive or harrassing) and share your views until the end of time. \n\nThe fact that this sub is populated mostly by big-block Bitcoiners should make you ask, where are all the small-blockers and why don't they come here?  If BTC really is 100X more popular like you guys claim, it would be trivial to overwhelm the uncensored sub with BTC posts.\n\n> Telling me that Blockstream is controlling all the BTC mining power\n\nYou completely made that up.  I never said anything of the sort.\n\n> and there will never be a fair voting for a good hard fork.\n\nThat's my opinion, you're allowed to believe otherwise.   I'd love to see it tried though!!\n\n>  And they are steering Bitcoin to abyss and BTC is 100% going to fail.\n\nAgain, that's my opinion, not gaslighting.  \n\nYou might be right.  BTC already did a complete 180 on its mission once, maybe it can do another one.  Either way I could never recommend in good faith a project whose mission has become \"own the cashies\".",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "ia1l7lj",
                                                                                            "author": "trakums",
                                                                                            "score": 1,
                                                                                            "created_utc": 1653555484.0,
                                                                                            "response": "If the whole world economy runs on it then one transaction (moving funds from one mega side-chain to another) can be worth 1000s of dollars to settle.  \n\nAbout Blockstream - this sub made that up not me. Or do you agree with me that if needed (for example high fees because of the failed LN) BTC can fork to bigger blocks and Blockstream can not prevent that?\n\nThe mission is not to \"own the cashies\" but to become the world reserve currency and build some layers on top of that for our daily needs (speed, low fees and anonymity).",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "id": "ia2dsrh",
                                                                    "author": "NicoMarkerink",
                                                                    "score": 1,
                                                                    "created_utc": 1653573556.0,
                                                                    "response": "It feels good to be early and catch all these great developments and project evolutions within the platform.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "ia1ugl6",
                                                            "author": "Kongfuagam",
                                                            "score": 1,
                                                            "created_utc": 1653563099.0,
                                                            "response": "This month brings the best vibes running on smartBCH .",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "ia2dx6q",
                                                    "author": "ALEX110392",
                                                    "score": 1,
                                                    "created_utc": 1653573610.0,
                                                    "response": "Good for anyone around and that's the best thing . Cheers .",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "ia31ich",
                                            "author": "sunfeihan88",
                                            "score": 1,
                                            "created_utc": 1653583187.0,
                                            "response": "One of the reasons I like MistSwap is that even though the entire market is in red,.\n\nMist is standing strong and continuing to innovate.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "ia2m1mp",
                                    "author": "jnsannella",
                                    "score": 1,
                                    "created_utc": 1653577015.0,
                                    "response": "I think it will go 15k , for sure below last high of 20k .",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia0h2w0",
                    "author": "number_go_up",
                    "score": 4,
                    "created_utc": 1653529107.0,
                    "response": "Here's something odd.  BCH has seen record levels of wealth concentration during the bear market as people buy up the cheap coins.\n\nPercent of BCH in richest addresses versus one year ago:\n\n* Top 10: 12.86% -> 13.52%\n* Top 100: 32.62% -> 32.89%\n* Top 1000: 53.39% -> 54.93%\n* Top 10000: 71.31% -> 72.02%\n\nBTC shows this effect to a lesser extent, and only in the top 1000:\n\n* Top 10: 6.03% -> 6.16%\n* Top 100: 14.94% -> 15.78%\n* Top 1000: 34.48% -> 34.67%\n* Top 10000: 59.36% -> 59.00%\n\nSource: [https://web.archive.org/web/20210525083913/https://bitinfocharts.com/](https://web.archive.org/web/20210525083913/https://bitinfocharts.com/)",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia1o2t3",
                            "author": "slogus",
                            "score": 1,
                            "created_utc": 1653558032.0,
                            "response": "I think JPMorgan wants the price to increase that much, it creates expectation.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9y55ft",
                    "author": "coinflip1211",
                    "score": 7,
                    "created_utc": 1653493672.0,
                    "response": "BTC has no potential for 10-100x anymore if this is what you are looking for.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9y6rm3",
                            "author": "Sleeping-wheel",
                            "score": 2,
                            "created_utc": 1653494306.0,
                            "response": "Million dollar question: what does have 10-100x potential? Yes i’m asking a stranger on the interwebs.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9y77bh",
                                    "author": "LovelyDayHere",
                                    "score": 9,
                                    "created_utc": 1653494477.0,
                                    "response": "Real peer to peer electronic cash.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9yg71e",
                                            "author": "bonafidebob",
                                            "score": 6,
                                            "created_utc": 1653497968.0,
                                            "response": "That is *very* counter-intuitive.\n\nFor \"electronic cash\" to work well, it has to have consistent values with low volatility and only small fluctuations.   If people holding \"cash\" think that it'll be worth 100x or even 10x what it is now in terms of spending power, why would they spend it?\n\ne.g. if the guy who paid 10000 BTC for a pizza had any clue that it'd be worth upwards of $30K/coin, there's no freaking way he would have bought that pizza.\n\n\"Real peer to peer electronic cash\" will be ***BORING***.  Speculators will ignore it.  Day traders will use it to buy other things.  HODLers will be looked at with the same sad sense of pity that we give to the old folks who keep their life savings in paper money stuffed in their mattress.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9ypqi2",
                                                    "author": "KallistiOW",
                                                    "score": 9,
                                                    "created_utc": 1653501686.0,
                                                    "response": "Paradox: BTC would have never gone to $30k if Pizza Guy never bought the pizzas (or some similar event).",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "ia22tht",
                                                            "author": "popkowiersma",
                                                            "score": 3,
                                                            "created_utc": 1653568270.0,
                                                            "response": "I agree, I think this can give the platform a big boost.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i9yvtsh",
                                                    "author": "Fromage_Damage",
                                                    "score": 6,
                                                    "created_utc": 1653504075.0,
                                                    "response": "I spent 3.2BTC on a chocolate bar 🍫.   I don't regret it, because without use, crypto would never have caught on.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "ia4aaa0",
                                                            "author": "AVanNestro",
                                                            "score": 1,
                                                            "created_utc": 1653601708.0,
                                                            "response": "Who holds the bch that has been bridged to the smart chain?",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i9yl5r3",
                                                    "author": "LovelyDayHere",
                                                    "score": 6,
                                                    "created_utc": 1653499897.0,
                                                    "response": ">  If people holding \"cash\" think that it'll be worth 100x or even 10x what it is now in terms of spending power, why would they spend it?\n\nThe first 4 years of Bitcoin disprove this \"hodl\" theory.\n\nPeople DO spend Bitcoin when it goes up in price.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9ylnde",
                                                            "author": "bonafidebob",
                                                            "score": 0,
                                                            "created_utc": 1653500090.0,
                                                            "response": "The price didn’t go up that much in the first four years.\n\nLook at the amount of BTC being actively traded today compared to the amount that’s sat untouched for a year or more…\n\nNote I say “actively traded”, you can’t really call it “spent” because you can’t really buy things with it, instead you sell it and then use the money you get to buy things with.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "ia28wky",
                                                                    "author": "Michelletim25",
                                                                    "score": 2,
                                                                    "created_utc": 1653571349.0,
                                                                    "response": "Fiat money gives central banks an enormous amount of control over the economy.\n\n It is scary",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "ia33eb5",
                                                                            "author": "bonafidebob",
                                                                            "score": 1,
                                                                            "created_utc": 1653583919.0,
                                                                            "response": "True, though it's not so much the \"fiat\" part that does that, it's their ability to decide who can (and can not) borrow directly from them.\n\nIt's easy to imagine a fiat currency where the central bank had different rules in place to control lending, e.g. a cap on the amount that could be loaned, or a more egalitarian approach to vetting direct loans.\n\nI mean, BTC (and BCH) are \"fiat\" currencies too, in that they were created out of thin air by a governing body, and the algorithm and the consensus model for changing it acts as the central bank.\n\nI mention this because as cryptocurrency starts to compete effectively with mainstream currencies like the EUR or USD, it's entirely possible for those central banks to adjust their rules of governance to take on some of the desirable aspects of BTC or BCH and thereby maintain a competitive advantage.  Crypto doesn't just need to beat the current central banks to win, it also needs to beat what central banks can evolve into.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "ia2qeuj",
                                                            "author": "Elliotben",
                                                            "score": 1,
                                                            "created_utc": 1653578790.0,
                                                            "response": "bitcoin is... energy and raw materials needed to keep the bitcoin system moving are backed by violence, think about it for a while!",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i9z35v1",
                                                    "author": "jessquit",
                                                    "score": 2,
                                                    "created_utc": 1653507014.0,
                                                    "response": ">\"Real peer to peer electronic cash\" will be BORING. Speculators will ignore it. Day traders will use it to buy other things. HODLers will be looked at with the same sad sense of pity that we give to the old folks who keep their life savings in paper money stuffed in their mattress. \n\n#GOOD\n\n#BRING IT",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "ia3d563",
                                                    "author": "Artem37011",
                                                    "score": 2,
                                                    "created_utc": 1653587793.0,
                                                    "response": "It's only a matter of time before BCH gets the recognition it deserves",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i9yhhxa",
                                                    "author": "hero462",
                                                    "score": 2,
                                                    "created_utc": 1653498475.0,
                                                    "response": "Real simple.  Spend and replace.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9yi0xz",
                                                            "author": "bonafidebob",
                                                            "score": 0,
                                                            "created_utc": 1653498683.0,
                                                            "response": "> Real simple. Spend and replace.\n\nNot sure what your point is here...  \"spend and replace\" sounds like a checking account or credit card, you keep a relatively small balance (positive or negative) and move \"wealth\" into it (or out of it) so you can buy and sell stuff.   That's ***BORING***.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9ynl6l",
                                                                    "author": "hero462",
                                                                    "score": 3,
                                                                    "created_utc": 1653500845.0,
                                                                    "response": "You mentioned potential upward price movement as a reason why people wouldn't spend their electronic cash. Replacing amounts that are spent negates that risk.\nBORING is forever holding a coin and never doing anything with it.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9ypxv7",
                                                                            "author": "bonafidebob",
                                                                            "score": 1,
                                                                            "created_utc": 1653501766.0,
                                                                            "response": "There are lots of flavors of boring.   In general a currency *should* be boring!\n\n> Replacing amounts that are spent negates that risk.\n\nI guess it depends on your timeframe.  If it's going to go up *soon* then people will wait and buy things a bit later.  If it's going to go up *eventually* then maybe it's not as much of an issue.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i9yr9u8",
                                                                                    "author": "hero462",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653502291.0,
                                                                                    "response": "Bitcoin is deflationary by nature. It's going to go up in value with adoption.  This does not deter me from using it whenever I get the opportunity.  Stick w fiat if you want boring and predictable.  Bitcoin is a different animal.",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                },
                                                                                {
                                                                                    "id": "ia311jt",
                                                                                    "author": "johnwee75",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653583004.0,
                                                                                    "response": "Its supply is a geometric series with halving BTC . Cheers .",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "ia320en",
                                                                                            "author": "bonafidebob",
                                                                                            "score": 1,
                                                                                            "created_utc": 1653583380.0,
                                                                                            "response": "I think you're talking about creating new BTC which is paid to miners.  While true, that has nothing to do with what we're talking about here, which is the difference between treating BTC as \"money\" and \"spending\" it vs treating it like an \"asset\" where you're looking to profit from the appreciation.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "id": "ia1kdk8",
                                                                            "author": "linjieowen",
                                                                            "score": 1,
                                                                            "created_utc": 1653554726.0,
                                                                            "response": "It takes decades to understand this simple logic of BCH . \n\nSo far no centralized power in the world can use Bitcoin cash to hurt others or use it to impact their lives in a negative way.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "id": "ia357ro",
                                                                    "author": "Bors1",
                                                                    "score": 1,
                                                                    "created_utc": 1653584627.0,
                                                                    "response": "People with complex brain won't understand this simple, peaceful, transparent, fair, borderless digital currency(BCH) .",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "ia3egu7",
                                                                            "author": "bonafidebob",
                                                                            "score": 1,
                                                                            "created_utc": 1653588331.0,
                                                                            "response": "> People with complex brain won't understand this simple, peaceful, transparent, fair, borderless digital currency(BCH) .\n\nI'm not sure what you point is.  And I'm not sure it makes any sense.  Or maybe I'm not getting the sarcasm/irony here?\n\nWhy, exactly, won't people with complex brains understand a simple concept?",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "ia45fdu",
                                                            "author": "AZEMK",
                                                            "score": 0,
                                                            "created_utc": 1653599569.0,
                                                            "response": "The crypto market is a battlefield without smoke and mirrors .",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "ia48o2x",
                                                                    "author": "hero462",
                                                                    "score": 1,
                                                                    "created_utc": 1653600998.0,
                                                                    "response": "Bot",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "ia2qjud",
                                            "author": "rndltc",
                                            "score": 1,
                                            "created_utc": 1653578847.0,
                                            "response": "It really is,BCH has been growing by leaps and bounds .",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9yerps",
                                    "author": "StephenJooba",
                                    "score": 1,
                                    "created_utc": 1653497418.0,
                                    "response": "Monero.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia2o8by",
                                            "author": "horizontween",
                                            "score": 1,
                                            "created_utc": 1653577914.0,
                                            "response": "This is great. That's why I think it is the best time to invest in monero .",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9yip48",
                                    "author": "hero462",
                                    "score": 1,
                                    "created_utc": 1653498947.0,
                                    "response": "BCH",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia1lb5u",
                                            "author": "Dtt33270801",
                                            "score": 0,
                                            "created_utc": 1653555576.0,
                                            "response": "When i says something, expect the opposite. Setting a trap probably.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia26xqt",
                                                    "author": "hero462",
                                                    "score": 1,
                                                    "created_utc": 1653570402.0,
                                                    "response": "Bot",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "ia29zj3",
                                    "author": "installgen4",
                                    "score": 1,
                                    "created_utc": 1653571858.0,
                                    "response": "That's one small step for man, one giant leap for the smartBCH community!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "ia0vjz5",
                            "author": "Ughnotagaingal",
                            "score": 2,
                            "created_utc": 1653536154.0,
                            "response": "I remember reading this exact argument in 2018. Reality is, Hal saw the potential higher than that even a decade ago. \n\nWill it make it? I have no idea, but the potential exists.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia1hjfo",
                                    "author": "coinflip1211",
                                    "score": 1,
                                    "created_utc": 1653552166.0,
                                    "response": "It should have been 200k to make a 50x (from 4k).\n\nIn 2016-2017 it made a 100x. ($200 to 20k)  \n2020-2021 only a 20x ($4k to $80k)\n\n20x is cool profit I don't deny this, but it gets thinner and thinner.The next one will be probably a 3-4x in the next halving with this model.Perhaps 30k to 90k or up to 100k, where anyone buying will be the exit liquidity for whales.\n\nI doubt there will be even $100k price for BTC.\n\nThe market has to decouple from btc to sustain the projects that work. The exchanges should change their behaviour and remove btc trades, reduce shorting and exposure to USDT, and sustain better terms for innovation to flourish.\n\n[https://read.cash/@Pantera/the-final-bitcoin-btc-bull-run-2020-2022-cf76fa59](https://read.cash/@Pantera/the-final-bitcoin-btc-bull-run-2020-2022-cf76fa59)",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "ia224bo",
                                    "author": "jsqcool",
                                    "score": 1,
                                    "created_utc": 1653567885.0,
                                    "response": "Well let's keep watching and see what btc would do next .Crash !",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "ia41vh7",
                            "author": "oscarxlike2",
                            "score": 1,
                            "created_utc": 1653598041.0,
                            "response": "Unlocking more stuff for the DeFi market of smartBCH, lets go!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia1lo9f",
                    "author": "Nervous_Key_4158",
                    "score": 2,
                    "created_utc": 1653555897.0,
                    "response": "Still in red but i'm still buying. I just set out a particular amount I intend to lose, would DCA until the money is exhausted. Might just convert my shiryo and algo to get some more",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9yocdz",
                    "author": "AD1AD",
                    "score": 1,
                    "created_utc": 1653501140.0,
                    "response": "booo price post",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia2ap8q",
                            "author": "jyuktresdvcx",
                            "score": 1,
                            "created_utc": 1653572187.0,
                            "response": "It's only for a while it's likely to get bullish soon . XD .",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9yu4vm",
                    "author": "KingZeus5",
                    "score": 1,
                    "created_utc": 1653503416.0,
                    "response": "I bought at 44k. Fcked.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9yv09w",
                            "author": "localether",
                            "score": 4,
                            "created_utc": 1653503755.0,
                            "response": "When has Bitcoin not revisited the ATH? You’re ok... just be patient. BTFD.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia3b8se",
                                    "author": "Vikash009",
                                    "score": 3,
                                    "created_utc": 1653587030.0,
                                    "response": "First step? Join SmartBCH, we are building on it! Cheers .",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "ia01yxy",
                                    "author": "xjunda",
                                    "score": 2,
                                    "created_utc": 1653522061.0,
                                    "response": "It can't happen forever, especially when its economic model has been broken intentionally.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia0dzet",
                                            "author": "localether",
                                            "score": 1,
                                            "created_utc": 1653527694.0,
                                            "response": "BCH and other altcoins can fill any gaps that Bitcoin does not provide and can serve as a reserve currency for the entire crypto sector, which collectively is disrupting the legacy financial system.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia1go29",
                                                    "author": "AkinyeliZ",
                                                    "score": 3,
                                                    "created_utc": 1653551396.0,
                                                    "response": "With continuous growth of SmartBCH in 2022 Bitcoin Cash is now literally Smart Money!",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "ia29xzg",
                                            "author": "DrKamikadze",
                                            "score": 1,
                                            "created_utc": 1653571837.0,
                                            "response": "Every P2E guild will benefit from owning & renting BCHReborn assets to players.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9z750b",
                                    "author": "jessquit",
                                    "score": 2,
                                    "created_utc": 1653508610.0,
                                    "response": "Past performance guarantees future returns confirmed.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9zc4qr",
                                            "author": "localether",
                                            "score": 2,
                                            "created_utc": 1653510627.0,
                                            "response": "Probability is a better term.\n\nIn this case, very high probability.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia3qmhz",
                                                    "author": "dfortuner47",
                                                    "score": 2,
                                                    "created_utc": 1653593321.0,
                                                    "response": "You will NOT be someone's exit liquidity. Your investments will not be depreciated to 0.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "ia3d3cg",
                            "author": "CynogRhys",
                            "score": 1,
                            "created_utc": 1653587772.0,
                            "response": "Well if that guy announces that , then we better sell it asap !",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9yuie4",
                    "author": "localether",
                    "score": 1,
                    "created_utc": 1653503564.0,
                    "response": "Has been ranging sideways for a while.\n\nHas to breakout soon. Eventually should dip to $23k bottom, then start back on a rise.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia429e8",
                            "author": "Javibtc",
                            "score": 1,
                            "created_utc": 1653598203.0,
                            "response": "We can't predict anything in this volatile market but good luck to your prediction .",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9zjzrt",
                    "author": "Peracinobw",
                    "score": 1,
                    "created_utc": 1653513920.0,
                    "response": "Hahahab reality always hits hard and crypto is know for its volatility so we have already witnessed the bear so yeah for the noobs I would say to dyor and start buying the dip if possible",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia1hbmv",
                            "author": "rasomaha",
                            "score": 1,
                            "created_utc": 1653551980.0,
                            "response": "I bought the dip but it's keep dipping and I don't have any funds now .",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia20igw",
                                    "author": "Peracinobw",
                                    "score": 1,
                                    "created_utc": 1653566972.0,
                                    "response": "It's always like that mate we just gotta be patient till the bull starts running. I also bought the dip with QANX, Metis, QRDO it's all dipping we just have to wait you know.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia1m8zp",
                    "author": "Flimsy_Agent7898",
                    "score": 1,
                    "created_utc": 1653556416.0,
                    "response": "Who bought in the winter of 2017 at 19k with me!?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia28106",
                    "author": "-metabud-",
                    "score": 1,
                    "created_utc": 1653570932.0,
                    "response": "The bought at 69,000 holders are not properly represented here",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia34xvb",
                    "author": "poquoh",
                    "score": 1,
                    "created_utc": 1653584519.0,
                    "response": "bitcoin is currently being used to realize financial inclusion.\n\nsounds not bad but financial inclusion is part of inclusive capitalism.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia3hbeh",
                    "author": "ampatel7",
                    "score": 1,
                    "created_utc": 1653589491.0,
                    "response": "I think BTC is the most rubbish coin, bar none.\n\n Much worse than ETH and XRP.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia3jkyr",
                    "author": "schweertob",
                    "score": 1,
                    "created_utc": 1653590421.0,
                    "response": "More people wants BTC go up and sell and leave crypto for some days .",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia3p9st",
                    "author": "bes5117",
                    "score": 1,
                    "created_utc": 1653592762.0,
                    "response": "If the individual holders keep selling bitcoins bitcoin will be no more decentralized.\n\nYour financial freedom is certain in this space of you holding some solid and potential gems.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia3xiws",
                    "author": "LatvianMen",
                    "score": 1,
                    "created_utc": 1653596203.0,
                    "response": "I can only buy a little bit of this every week, which contains \"1-10 bitcoins\"",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iahgcne",
                    "author": "rbtc-tipper",
                    "score": 1,
                    "created_utc": 1653867863.0,
                    "response": "Congratulations! You've been tipped for your post. u/chaintip - See who else has been tipped [here](https://www.reddit.com/user/rbtc-tipper/submitted/)",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iahgd3u",
                            "author": "chaintip",
                            "score": 1,
                            "created_utc": 1653867870.0,
                            "response": "***\nu/KravoxWeb, you've [been sent](https://www.blockchain.com/bch/address/bitcoincash:qrelay2kpddwap9qxf2glrzqku984ady7q5ke84dz8) `0.0006474 BCH` | `~0.12 USD` by u/rbtc-tipper\nvia [chaintip](http://www.chaintip.org). Please [claim it!](https://www.chaintip.org/reddit#claim)\n***",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia0ph96",
                    "author": "big--if-true",
                    "score": 0,
                    "created_utc": 1653533049.0,
                    "response": "vote manipulation",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia332ga",
                            "author": "h5sh4b1t",
                            "score": 2,
                            "created_utc": 1653583793.0,
                            "response": "Good pairs back again in smartBCH. \n\nalso whales adding more liquidity seems like the future looks bright in this area.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}