{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uuka2w",
            "title": "What happens to our crypto when we die",
            "url": "https://www.reddit.com/r/btc/comments/uuka2w/what_happens_to_our_crypto_when_we_die/",
            "author": "alaurence",
            "created_utc": 1653128477.0,
            "score": 2,
            "num_comments": 14,
            "subreddit": "btc",
            "selftext": "Was wondering how to securely pass on my crypto info after I die (wallets, seed phrases, instructions etc) and it got me thinking - how do I safely and securely pass this info on to family when I die?\n\nDoes anyone here currently have a solution for passing on this kind of info after death that they trust?\n\nI'm just putting a feeler out to find out what people in the community are doing to ensure their assets don't get lost forever.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9ghzid",
                    "author": "hegjon",
                    "score": 4,
                    "created_utc": 1653146280.0,
                    "response": "If you don't do anything, your coins will rest in peace forever. Many view this as money lost, but it is more like a (tiny) donation to all the other holders.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9g0f4g",
                    "author": "FieserKiller",
                    "score": 2,
                    "created_utc": 1653137432.0,
                    "response": "I've a dead man switch in place which will send out instructions to beneficiaries once I cease to exist",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9g0jcx",
                    "author": "LovelyDayHere",
                    "score": 2,
                    "created_utc": 1653137501.0,
                    "response": "Your question has been asked \n\n__1 day ago__\n\nin this thread\n\nhttps://www.reddit.com/r/btc/comments/ut3f5a/whats_gonna_happen_with_our_crypto_after_we_pass/",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9fxmil",
                    "author": "Junior-Confection320",
                    "score": 2,
                    "created_utc": 1653135687.0,
                    "response": "What do u care \n\nYou dead",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9hiu8y",
                            "author": "Adrian-X",
                            "score": 0,
                            "created_utc": 1653163582.0,
                            "response": "I guess that explains why the concept of heaven and hell exists. The people who didn't care would obviously end up in hell.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9fx81e",
                    "author": "smartguy_m",
                    "score": 1,
                    "created_utc": 1653135426.0,
                    "response": "We need some script running on some VPS that would send an encrypted file with wallets and instructions after, say, 3 months of inactivity. And you give the password to this file in advance.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9hk58k",
                            "author": "SoulMechanic",
                            "score": 2,
                            "created_utc": 1653164232.0,
                            "response": "Deadman’s switch already exists with BCH smart contracts and Electron Cash wallet plugin. It hasn’t been updated for some time but it should still work. \n\nhttps://github.com/KarolTrzeszczkowski/Electron-Cash-Last-Will-Plugin",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9hyb91",
                                    "author": "smartguy_m",
                                    "score": 1,
                                    "created_utc": 1653171440.0,
                                    "response": "Yes, it is a great thing, but it has some limitations. For example, it requires holding all coins in a single address. This is bad for privacy. And it is only for Bitcoin Cash. I prefer to use my own implementation of deadman's switch running on a VPS. I already use VPS anyway. It is not for everyone, however.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9i2vho",
                                            "author": "SoulMechanic",
                                            "score": 2,
                                            "created_utc": 1653173810.0,
                                            "response": "I just copied the above reply from the other thread on this topic don't below linked to, I think there's other options there as well.\n\nYeah it's not ideal.\n\nI think a dead man switch for password managers like Bitwarden would be better for those of us with lots of wallets.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9hinym",
                    "author": "Adrian-X",
                    "score": 1,
                    "created_utc": 1653163496.0,
                    "response": "That's a very good question to ask? and then find and deploy a solution. \n\nOne solution is to have your wallets encrypted on an online computer, a watch-only wallet on your public computer and a live hot wallet on your phone. \n\nthe 12 seed words to your wallets are divided up into 3 columns,  and then split  - see  https://coinstorage.guru/\n\nYou then give one set to a relative, one with your will and one with a lawyer or another relative. 2 of the 3 parties need to cooperate to unlock the funds using the instructions in your will, in cooperation with the heir.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}