{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uy8oy4",
            "title": "Dissatisfied with the Solana price",
            "url": "https://www.reddit.com/r/btc/comments/uy8oy4/dissatisfied_with_the_solana_price/",
            "author": "LukyLukyLu",
            "created_utc": 1653574782.0,
            "score": 1,
            "num_comments": 5,
            "subreddit": "btc",
            "selftext": "I [posted the following post](https://www.reddit.com/r/solana/comments/uy86z7/dissatisfied_with_the_price/) on r/Solana and got deleted, so I will post it here:\n\n===\n\nI am quite deeply dissatisfied what does the Solana or Avax price. It looks it is going to crash -90% maybe even -95%.\n\nMy common sense says that if something is able lost 95% of its value, then we were buying nothing than air before.\n\nI can tolerate 30% crash, I can tolerate 50% crash, but 90% crash is something quite not acceptable.\n\nI understand this is the dark side of the 10x growth, but anyways, you can't deny that this \"investing\" is just pure casino.\n\nI hope it will recover above $100 soon, to hopefully recover at least some my losses, but next time i will be more careful with assets like these.\n\n====\n\nBtw as someone who has basically 100% of his money in Solana and being deleted from the subreddit for his opinion this behaving really turns on the red alert to me. Ok, so next time fuk off Solana.",
            "stickied": false,
            "comments": [
                {
                    "id": "ia2i5nd",
                    "author": "Remora_101",
                    "score": 2,
                    "created_utc": 1653575404.0,
                    "response": "This is a bitcoin sub. Try r/cryptocurrency.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia2ja41",
                            "author": "LukyLukyLu",
                            "score": 1,
                            "created_utc": 1653575875.0,
                            "response": "i am here in safe azyl heaven if you understood it.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia2ihy7",
                    "author": "Zyoman",
                    "score": 1,
                    "created_utc": 1653575548.0,
                    "response": "Well the real question is what is the fundamental of the coin? What are the limits? The usability? The price is not a fundamental metrics at all.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia2j5rv",
                            "author": "LukyLukyLu",
                            "score": 1,
                            "created_utc": 1653575824.0,
                            "response": "imagine you bought a house, do you think it is possible it would lost 95% of its value in next 6 month? if this can happen to any crypto coin like SOL or AVAX then you should really start think about it i think.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia2k3s7",
                    "author": "2q_x",
                    "score": 1,
                    "created_utc": 1653576214.0,
                    "response": "The problem with getting into a chain that is developed by a single company, is that the company might go bankrupt. \n\nLets say, someone needed a piece of paper to back something for legal reasons, it didn't have to be worth face value, because it would never be redeemed. \n\nSo they find the cheapest paper available, maybe commercial paper from Chinese real estate developers with ties to their military. Then they trade it for something they can use at face value, like a popular stable coin. And they get tens of billions in financing and liquidity this way. \n\nThey now have so much money, they create their own centralized ETH or AVAX competitor, fund development and pump the price into the top 10 on CMC.\n\nWell, what happens if those junk swaps they started with become banned, perhaps by executive order. \n\nNow the parent company has nothing to back the stable coins they borrowed. Their liquidity and tens of billions have been effectively wiped out. But no one knows it yet.\n\nWould that seem like that project will do well long term?",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}