{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ux1lw2",
            "title": "The Guardian on Tether: “The pace of withdrawals means [Tether] is effectively dealing with a slow-motion bank run, as depositors seek to move their cash to more heavily regulated stablecoins.“",
            "url": "https://www.theguardian.com/technology/2022/may/22/tether-pays-out-10bn-in-withdrawal-since-crypto-crash",
            "author": "Egon_1",
            "created_utc": 1653427829.0,
            "score": 31,
            "num_comments": 66,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9uvlcq",
                    "author": "exu1981",
                    "score": 8,
                    "created_utc": 1653427896.0,
                    "response": "And it begins.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9z30di",
                            "author": "ramisss",
                            "score": 1,
                            "created_utc": 1653506951.0,
                            "response": "Fact remains that Tether's own attestation report says it is fractionally reserved and has almost zero capital.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9vpbr3",
                    "author": "big--if-true",
                    "score": 6,
                    "created_utc": 1653441684.0,
                    "response": "10B USDT withdrawn  , at the same time USDC increased by 5B USD.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9wojtn",
                            "author": "Egon_1",
                            "score": 2,
                            "created_utc": 1653461895.0,
                            "response": "👆👆👆",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia07cbh",
                                    "author": "junjun888",
                                    "score": 1,
                                    "created_utc": 1653524599.0,
                                    "response": "Wow, 10 billion. That's almost 1/7th of the tethers they have issued.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9zfuq6",
                            "author": "absoluteq",
                            "score": 1,
                            "created_utc": 1653512169.0,
                            "response": "Actually, it does seem as though Tether is backed, otherwise there’d be nothing there to redeem.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9zh6fc",
                                    "author": "big--if-true",
                                    "score": 1,
                                    "created_utc": 1653512718.0,
                                    "response": "The entire crypto market dumped. likely they sold 10b of bitcoin at a loss to cover the 10B withdrawal and crashed the market.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9vesji",
                    "author": "Bagmasterflash",
                    "score": 5,
                    "created_utc": 1653436656.0,
                    "response": "Gradually then suddenly?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9y5joq",
                            "author": "marzenad",
                            "score": 1,
                            "created_utc": 1653493827.0,
                            "response": "Yet it has a printer like the US government... \n\nThat is where the issue sits ... a promise to pay against thin air .",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9yqpmq",
                    "author": "tr9mum",
                    "score": 3,
                    "created_utc": 1653502069.0,
                    "response": "Given the way Tether seems to underpin a significant portion of the cryptosystem.\n\nI have to assume that if it was forced off the peg there are a thousand ways money could be made from the impact on every other part.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia12wh8",
                            "author": "Sugarbird676",
                            "score": 1,
                            "created_utc": 1653540665.0,
                            "response": "I agree- not all money will leave the space. A lot will flow to trusted projects.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9vu4l9",
                    "author": "cassydd",
                    "score": 13,
                    "created_utc": 1653443949.0,
                    "response": "Have they verified that a (very large) depositor has redeemed their Tether or are they just looking at the market cap and making assumptions? They haven't ruled out the possibility that Tether is \"redeeming\" and burning its own supply in order to constrict total  supply to maintain the peg and/or make the supply more closely reflect their underlying assets. This seems to be bad reportage either way - the \"bank run\" narrative is only one possibility, and its not even the most damning one.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9wocyh",
                            "author": "Egon_1",
                            "score": 2,
                            "created_utc": 1653461740.0,
                            "response": "Lengthy post about this and that. The bottom line is this: People (tether itself or holders) are cashing out from a stablecoin because\n\n- they need fiat or \n- they don’t trust Tether anymore\n\nAlternatively, Tether’s reserves declined in value. A proper independent audit would explain everything. The odd thing is that they don’t want an audit for many years.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9zceuy",
                                    "author": "imaadhbtc",
                                    "score": 3,
                                    "created_utc": 1653510742.0,
                                    "response": "No. Why would I?\n\n It's pegged and there were no problem with recent redemptions.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9wf7q8",
                            "author": "bonafidebob",
                            "score": 2,
                            "created_utc": 1653455106.0,
                            "response": "> They haven't ruled out the possibility that Tether is \"redeeming\" and burning its own supply …\n\nWait, what??\n\nWhen you redeem Tether the coins are “destroyed” and the assets removed from Tether’s balance sheet.   How would they “redeem” their own supply, exactly?\n\nDo you think Tether owns a bunch of their own coins and is “destroying” them and taking the real assets off the balance sheet?   i.e. doing what any other coin holder would do?\n\nOr is Tether actively using their reserve assets to buy back their own coins?  Which would be exactly what happens if an investor wants to “redeem” the coins anyway…\n\nEither way it seems like they’d be getting rid of real assets in order to “destroy” some coins, which … makes no sense here.\n\nSo … what??",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9wikhf",
                                    "author": "cassydd",
                                    "score": 5,
                                    "created_utc": 1653457353.0,
                                    "response": "> According to public blockchain records, $1bn of tether was redeemed – with the cryptocurrency handed back to the company and destroyed as part of the withdrawal process – just after midnight on Saturday.\n\n> $1.5bn had already been redeemed the same way three days earlier. The total withdrawn is now, allowing for minor fluctuations in the stablecoin’s peg, about one-eighth of the entire reserves of the company.\n\nThis is what the article is based on - that Tether is being burned. No other evidence is mentioned, including comparison of reported backing reserves over time. Even if they had, they only have line-items on a balance sheet and little stopping them from \"adjusting\" the value of “other investments” or any other line item without any asset sale to back it up. \n\nAnd yes I'm assuming that Tether might control a large un-dispersed supply of their own token that they can burn or sell depending on market conditions - that doesn't seem like an unreasonable assumption.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9wj1ru",
                                            "author": "bonafidebob",
                                            "score": 2,
                                            "created_utc": 1653457691.0,
                                            "response": "> And yes I'm assuming that Tether might control a large un-dispersed supply of their own token…\n\nAgain … what??\n\nHolding their own token would require them to also maintain assets on their balance sheet to cover it.  What possible motive would they have to require themselves to carry extra assets that don’t back circulating tokens??\n\nAre you suggesting you think Tether somehow has *surplus* assets, and so faked up some new coins to “hide” the surplus, just so they could “redeem” the coins later to make up for a perceived lack of sufficient assets to cover circulating tokens??\n\nThis theory makes no sense at all.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9wkr18",
                                                    "author": "xfobx",
                                                    "score": 6,
                                                    "created_utc": 1653458936.0,
                                                    "response": "They created extra out of thin air to be used for stop loss hunting, wash trade volumes, etc. Now, that Luna happened and authorities are looking this way, they are trying to tidy up a bit. They never had any asset backing what they just burned.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "ia0c017",
                                                            "author": "promise8787",
                                                            "score": 1,
                                                            "created_utc": 1653526789.0,
                                                            "response": "Maybe but either way it’s not going to do much long term or even medium term for the price of bitcoin.\n\nI know it’s gonna cause a major storm in the markets, but we should get rid of it.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i9wwmlg",
                                                    "author": "cassydd",
                                                    "score": 3,
                                                    "created_utc": 1653469017.0,
                                                    "response": "... if you really find it unfathomable that a) Tether might have unsold reserves of its own token, b) *might* be inflating its stated backing assets, and c) may have burned some of those unsold reserves in order to bring the stated value of those assets down closer to the actual value of those assets in advance of an investigation then... okay?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "ia0h3km",
                                                            "author": "pet_2g",
                                                            "score": 3,
                                                            "created_utc": 1653529115.0,
                                                            "response": "Yes I believe there day of reckoning will come in the next year or two.",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "i9xjvma",
                                                            "author": "bonafidebob",
                                                            "score": 1,
                                                            "created_utc": 1653484649.0,
                                                            "response": "I think *claiming* that you just returned $2.5B in assets and then not being able to show the movement of those assets will not only set regulators off, but also entirely destroy any confidence in Tether as a backed crypto.\n\nPretending to return that much with no audit trail would be incredibly stupid.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "ia0l1v5",
                                                                    "author": "crynncitizen",
                                                                    "score": 2,
                                                                    "created_utc": 1653530960.0,
                                                                    "response": "It is backed I agree. But 7 Billion of capital just left the market.\n\nThe liquidity is leaving and we may be entering a long term bear market.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "ia13uc4",
                                                    "author": "dgleung",
                                                    "score": 1,
                                                    "created_utc": 1653541307.0,
                                                    "response": "Everyone in mainstream finance but other than them not so much .",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "ia15fr6",
                                            "author": "Javibtc",
                                            "score": 1,
                                            "created_utc": 1653542428.0,
                                            "response": "Yes, it’s domino’s have started falling.\n\nIt has some time though.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9zm53y",
                                    "author": "xuxi222",
                                    "score": 2,
                                    "created_utc": 1653514850.0,
                                    "response": "Seems like it’s been fucked for a while but somehow just continues being a thing.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9zo0c7",
                                            "author": "bonafidebob",
                                            "score": 1,
                                            "created_utc": 1653515655.0,
                                            "response": "Well, yeah.  I think what happened is Tether \"invested\" some of the money they were given to create new tokens.  That is, they do what all banks do and take a fraction of their reserves and make loans or buy investments or whatever.   And as long as the market is rising, this returns a profit that the bank can skim off and keep for themselves.  There's no better business model than earning profit off other people's money!\n\nBut when the market turns and your investments start to lose money ... well, now you've lost other people's money, and they're going to be pissed if they find out.  So now you have two choices: 1) come clean, declare bankruptcy, close the business, return what you can to investors, and maybe go to prison; or 2) start dancing and singing and trying to distract people from the truth and hope either the market turns or you can get your fake identities established and move enough assets to numbered accounts somewhere to spend the rest of your life hiding on a tropical beach.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9yq9t5",
                            "author": "nefyrekafus",
                            "score": 1,
                            "created_utc": 1653501898.0,
                            "response": "When people say BTC is f**ked they mean BTC is f**ked.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9uvj71",
                    "author": "Egon_1",
                    "score": 5,
                    "created_utc": 1653427869.0,
                    "response": "I approve the wording 🙃🍿\n\nFinally, average Joes will also get the news as well.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9zog2u",
                            "author": "Keiji505",
                            "score": 1,
                            "created_utc": 1653515843.0,
                            "response": "We don't need stable coin , just hold BCH and chill .",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9uw6w5",
                    "author": "2q_x",
                    "score": 5,
                    "created_utc": 1653428155.0,
                    "response": "If DRW gets out, they're done.\n\nNo one can make a market like DRW.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9vhreo",
                            "author": "Fienx",
                            "score": 5,
                            "created_utc": 1653438087.0,
                            "response": "DRW?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9xgw1a",
                                    "author": "2q_x",
                                    "score": 3,
                                    "created_utc": 1653483172.0,
                                    "response": "https://protos.com/tether-minted-usdt-stablecoin-crypto-two-alameda-cumberland/\n\nLook at the stability of USDT before and after Jan 2019. You can't easily see it now, but there was historically a spread between USDT exchanges and USD exchanges on most assets. Something big happened.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9yiqx6",
                                            "author": "410984195",
                                            "score": 1,
                                            "created_utc": 1653498966.0,
                                            "response": "Fantastic, now do the audit that has been promised for couple of years & this whole \"FUD\" will be gone.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "ia0xf68",
                                    "author": "CynogRhys",
                                    "score": 1,
                                    "created_utc": 1653537227.0,
                                    "response": "Enough time has passed to conclude that Tether will not repeat the fate of other stable coins.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9ymb77",
                            "author": "RobMeijer",
                            "score": 1,
                            "created_utc": 1653500348.0,
                            "response": "when this ponzi implodes it will wipe the entire crypto market.\n\nare you prepared for this case? no audit=no trust .",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9yq2vp",
                                    "author": "2q_x",
                                    "score": 1,
                                    "created_utc": 1653501822.0,
                                    "response": "No.\n\nIf DRW backs out of tether and lets it implode, it will be because they or their counter-parties need to buy a great deal of coins quickly.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9xya7e",
                    "author": "KlutzMat",
                    "score": 2,
                    "created_utc": 1653490917.0,
                    "response": "So what now? Other than USDC, any non-shady stablecoins put there?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9w68yx",
                    "author": "kingofthejaffacakes",
                    "score": 2,
                    "created_utc": 1653449852.0,
                    "response": "Jesus Christ, we're quoting The Guardian and Peter Schiff these days?\n\nMaybe we should go and find out what the fed chair, head of ECB, and governor of the bank of England think too?  I'm sure we'll get a rational, cool-headed assessment from them as well.\n\nPeople successfully redeeming tether shows it's got reserves enough to support that.  It doesn't prove they have all their usdt reserved, but it certainly isn't proof that they don't.\n\nBank runs are a disaster for those engaging in fractional reserve, if your deposits are fully backed, then it's just a busy day at the office.  Note: I'm not saying tether is 100% backed, but again: this is not evidence either way.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9wgcrr",
                            "author": "Skrappyross",
                            "score": 4,
                            "created_utc": 1653455863.0,
                            "response": "We all know it's not fully backed. Not even close. And the problem with a bank run is that all the transactions work just fine until it's one dollar over reserves, then all hell breaks loose.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia0g4py",
                                    "author": "lanimaso",
                                    "score": 2,
                                    "created_utc": 1653528671.0,
                                    "response": "Most of the crypto space is fucked, from bitcoin to cumrocket.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9wmuaq",
                                    "author": "kingofthejaffacakes",
                                    "score": 2,
                                    "created_utc": 1653460536.0,
                                    "response": "> And the problem with a bank run is that all the transactions work just fine until it's one dollar over reserves, then all hell breaks loose.\n\nIsn't that what I said?\n\n> Bank runs are a disaster for those engaging in fractional reserve\n\nOh yes. It was.\n\nBut my actual point was that this isn't evidence of any of that.\n\n\"We all know\" isn't true either. We certainly suspect because of their dreadfully suspicious behaviour. But this graph is actually evidence that they had enough reserves to allow these cash outs.  So It's not evidence of their lack of reserves, quite the reverse.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9zfre1",
                                            "author": "litecoins_trade",
                                            "score": 1,
                                            "created_utc": 1653512130.0,
                                            "response": "The problem is there is no way to induce a bank run on $USDT unlike $UST, so fractional reserve still works for them.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia12d9v",
                                                    "author": "kingofthejaffacakes",
                                                    "score": 1,
                                                    "created_utc": 1653540309.0,
                                                    "response": "I guess there's no way to force the issue because they have to give your permission to convert back to USD.\n\nBut it's only the same as a real back run in that sense.  The bamk can run out of dollars to give to the withdrawer. They effectively just say \"no withdrawal for you\" just as tether would.\n\n At that point people start selling their balances for cents on the dollar.  The tether equivalent would be that the peg would break when they start refusing to let people cash out.  Seems similar enough to me.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i9wom6q",
                                    "author": "Egon_1",
                                    "score": 1,
                                    "created_utc": 1653461950.0,
                                    "response": "👆👆👆",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9zlary",
                                            "author": "cocoaluya33",
                                            "score": 3,
                                            "created_utc": 1653514484.0,
                                            "response": "Tether shows proof of what is backing their stablecoin or the entire ruse implodes.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "ia0m1tp",
                            "author": "HANKSBTC",
                            "score": 1,
                            "created_utc": 1653531434.0,
                            "response": "Why is this crash different than pre-tether crashes that btc survived?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia124g4",
                                    "author": "kingofthejaffacakes",
                                    "score": 1,
                                    "created_utc": 1653540146.0,
                                    "response": "You're right.  It's not. We've lived through worse even if tether does collapse.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9zfl8c",
                    "author": "tua79344",
                    "score": 1,
                    "created_utc": 1653512057.0,
                    "response": "So Tether has roped in a bunch of compliant exchanges and traders to \"prove\" it can redeem $10bn in a few days.\n\nThat will fool absolutely everyone, won't it?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia0plhw",
                    "author": "brentjenkins1",
                    "score": 1,
                    "created_utc": 1653533103.0,
                    "response": "Tether can prove it by publishing an audit with details by a reputable US accounting firm.\n\nOtherwise it's all smoke and mirrors.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9wfzh3",
                    "author": "localether",
                    "score": 0,
                    "created_utc": 1653455614.0,
                    "response": "Your money is safu... so far (unless Luna/UST).",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9x3p3b",
                    "author": "ImMrtoxic",
                    "score": 0,
                    "created_utc": 1653475076.0,
                    "response": "How wrong are those who withdraw their Tether",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9xfzr0",
                            "author": "Egon_1",
                            "score": 3,
                            "created_utc": 1653482715.0,
                            "response": "maybe they are listening to their mind for a change?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia0r0kf",
                                    "author": "serik1256",
                                    "score": 1,
                                    "created_utc": 1653533785.0,
                                    "response": "Probably not.\n\nA lot of fiat currencies are pegged to the USD, and rarely do they implode.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "ia0sg4t",
                            "author": "252898484",
                            "score": 1,
                            "created_utc": 1653534502.0,
                            "response": "Ironically, $USDT is the most corrupt and likely the last to fall. Few.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}