{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uuje9g",
            "title": "This is the way",
            "url": "https://www.reddit.com/r/btc/comments/uuje9g/this_is_the_way/",
            "author": "meatloaf-toaster",
            "created_utc": 1653124233.0,
            "score": 6,
            "num_comments": 11,
            "subreddit": "btc",
            "selftext": "what bch is doing with smartbch is removing the power centralized exchanges have over it, do not stop \n\nregardless of it's supposed \"traction\" this is the only way forward in a rigged system. DEX's are the \n\nfuture and coins that cannot interact with DEX's are simply \"boomer coins\".\n\n&#x200B;\n\nDEX's development even beyond what currently exists is going to be the next crypto cycle, where you \n\nhave the advantage so apply slp concepts and rewrite them to work on the smartbch chain (even better write you're own chain).\n\n&#x200B;\n\nIf we want to be what is what we seek do not expect playing fair will get you there as they have not been \n\nplaying fair from the get go while seeking to destroy you. Defeating these individuals is more far more important to \n\nthe human race then you know.\n\n&#x200B;\n\nIs Musk good or bad, I admit I'm not sure now since he picked an odd hill to die on. \n\nWatch him, maybe the blockstream crew is blowing smoke up his butt and he doesn't get it.\n\n&#x200B;\n\nPrimarily do not depend on leaders as they have the tendency to fail since they are human after all, however leaders should \n\nbe focused on spawning nodes of individual groups that can continue the unified work regardless of their own existence which is \n\nthe mark of a true \"leader\" so use them when they are around but do not worship them.\n\n&#x200B;\n\nThe rest is up to us as it comes down to people using the software. Like those using torrents as they are deciding factor, so don't stop.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9fkja5",
                    "author": "MobTwo",
                    "score": 6,
                    "created_utc": 1653125082.0,
                    "response": "I have a headache from reading this.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9fnfb1",
                            "author": "fiendishcrypro",
                            "score": 2,
                            "created_utc": 1653127776.0,
                            "response": "Me too, but it seems to be pro smartBCH...I think, so full heartedly agree with OP 😉...well I hope I do, google translate seems to have had a stroke 🤣",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9rt77e",
                            "author": "meatloaf-toaster",
                            "score": 1,
                            "created_utc": 1653367495.0,
                            "response": "Sorry for that,\n\nThe warning of leaders applies to those foisted upon us by media, although they maybe are ok it's also ok to be skeptical, for example Ver has done a lot of work helping this community in a immeasurable way yet has recieved little to no media coverage regarless. Knowing this those that recieve greater media spotlight than him leave me asking why.\n\nDecentralized exchanges are needed to help true market conditions to become apparent. Which is the need/desire of the general populace of the world since a true dex is essentially a world market of crypto. This should be able to pierce through any games played by centralized exchanges working with tether.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}