{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ut59wa",
            "title": "Lost all my money in trading lol. Need to start onlyfans, feel free to support i guess 😅",
            "url": "https://www.reddit.com/r/btc/comments/ut59wa/lost_all_my_money_in_trading_lol_need_to_start/",
            "author": "Repulsive_Shop_132",
            "created_utc": 1652972251.0,
            "score": 0,
            "num_comments": 5,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i97k0bw",
                    "author": "CurvyGorilla202",
                    "score": 1,
                    "created_utc": 1652972526.0,
                    "response": "Drop a wallet address and I’ll send you some sats.\n\nNormally I’d chaintip you but I don’t see you active in the community",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i97k62p",
                            "author": "Repulsive_Shop_132",
                            "score": 0,
                            "created_utc": 1652972594.0,
                            "response": "Im sillent reader:/",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i97ldh2",
                                    "author": "SashTheLurker",
                                    "score": 0,
                                    "created_utc": 1652973095.0,
                                    "response": "Lurker.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i97m0bp",
                                            "author": "Repulsive_Shop_132",
                                            "score": 1,
                                            "created_utc": 1652973364.0,
                                            "response": "How can i proof you?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i97m5wf",
                                                    "author": "SashTheLurker",
                                                    "score": 1,
                                                    "created_utc": 1652973429.0,
                                                    "response": "I lurk too. \nI probably wouldn't be shown as active in this sub either. How would I prove I lurk this sub like... every other day? I don't know, my friend.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "id": "ut51sv",
            "title": "There are millions of BCH shorted on margin exchanges, eg. 10,000 BTC are allowed to short 1.54 million BCH. If the trade goes against them it isnt even possible to buy that many BCH back. Margin exchanges volume is millions of BCH, spot is just thousands of BCH.",
            "url": "https://www.reddit.com/r/btc/comments/ut51sv/there_are_millions_of_bch_shorted_on_margin/",
            "author": "big--if-true",
            "created_utc": 1652971609.0,
            "score": 95,
            "num_comments": 103,
            "subreddit": "btc",
            "selftext": "Paper BCH on leverage are the majority of volume, while spot volume is extremely low.\n\nIf spot is pushed up the insurance funds cant cover the margin positions and the exchanges go bankrupt/customers lose all their assets and exchanges lose their business permanently. Incentivizing exchanges to try keep the market the way it is so they can stay in business.\n\nBasically leveraged exchanges are most likely manipulated since the volumes dont match actual market activity. \n\nThere are allegations that the exchanges themselves trade against their own customers since they know margin call thresholds and have unlimited money on an exchange they control.\n\nAdditionally traders are incentivized to sell/short their actual BCH on spot and buy a futures contract (paper BCH) for a profit/free loan.",
            "stickied": false,
            "comments": [
                {
                    "id": "i97jgyf",
                    "author": "fiendishcrypro",
                    "score": 45,
                    "created_utc": 1652972301.0,
                    "response": "It is time for the community to break these exchanges by target buying BCH and withdrawing.\n\nIf there is manipulation here it should be exploted and these exchanges should get wrecked.\n\nProblem is it needs to be highly organised or there needs to be a whale on board who has the financial clout to pull it off.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i97k1ha",
                            "author": "big--if-true",
                            "score": 18,
                            "created_utc": 1652972540.0,
                            "response": "That would be a good idea, but I dont know if people have the capital to pull this off against institutions who have hundreds of thousands of Bitcoins, which due to their inflated prices are worth billions, due to such huge asset values these types of traders can just hold their shorts open forever and roll their positions onto new futures products indefinitely (as long as Bitcoin keeps its value).\n\nIf futures are at spot prices or even below, BCH holders are incentivized to sell their actual BCH and buy a futures contract for arbitrage, which keeps this activity going on.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i987s7u",
                                    "author": "Shibinator",
                                    "score": 22,
                                    "created_utc": 1652982134.0,
                                    "response": "> I dont know if people have the capital to pull this off against institutions\n\nIf Wall Street Bets can do it, so can we.  And there's no RobinHood to shut it off in crypto.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9do3jx",
                                            "author": "as364136341h424",
                                            "score": 1,
                                            "created_utc": 1653082563.0,
                                            "response": "Unless BCH make themselves VERY useful to charities, tough!",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i99h3ua",
                                            "author": "BTC_Throwaway_1",
                                            "score": -2,
                                            "created_utc": 1653002546.0,
                                            "response": "Robinhood is a crypto exchange too…",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9b4tf0",
                                                    "author": "Shibinator",
                                                    "score": 2,
                                                    "created_utc": 1653040064.0,
                                                    "response": "Yes it is.  But there's a lot of different crypto exchanges, plus people can trade cryptos p2p if they have to, and the Wall Street Bets phenomenon was all about everyone trading specifically on RobinHood and RobinHood alone so they were able to shut off the market once the institutions were getting rekt.\n\nThat couldn't happen with BCH.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9bdbca",
                                                            "author": "BTC_Throwaway_1",
                                                            "score": 1,
                                                            "created_utc": 1653046122.0,
                                                            "response": "Wasn’t trying to argue against your point, but failed conveying the joke that I’m sure Robinhood will shut it off for their exchange if they need to.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9ew6b4",
                                                                    "author": "autoahven",
                                                                    "score": 1,
                                                                    "created_utc": 1653105522.0,
                                                                    "response": "It's a dangerous game. The less liquid it becomes, the more susceptible to manipulation. \n\nThe last pop up hurt a lot. 1.5X max I'd say.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "i9ezstt",
                                                            "author": "zerhborg",
                                                            "score": 0,
                                                            "created_utc": 1653107839.0,
                                                            "response": "Imagine owning an exchange AND giving trade advice. Unbelievable .\n\nBitmain is probably going bankrupt by 2020... I wish they'd go public so I could short them!",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i9d00cd",
                                                    "author": "imaadhbtc",
                                                    "score": 1,
                                                    "created_utc": 1653071529.0,
                                                    "response": "i need to figure out how i can short BCH... the most obvious short this year",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i9a7gxz",
                                    "author": "wildlight",
                                    "score": 7,
                                    "created_utc": 1653015736.0,
                                    "response": "just keep biying more BCH when the price is down, spend and replace the rest of the time. keep it off exchanges and in your own wallet, buy from exchanges like binance and remove it from their exchange, if you have to sell, sell elsewhere, preferably coinflex. eventually the BCH community will control most of the supply even if it takes years.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9ezuqe",
                                            "author": "gola8234",
                                            "score": 1,
                                            "created_utc": 1653107876.0,
                                            "response": "Hey if your shorting don't you have to have the asset? You sell it now and buy it back later?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9f1dhl",
                                                    "author": "wildlight",
                                                    "score": 1,
                                                    "created_utc": 1653108925.0,
                                                    "response": "short selling is when you borrow an asset and sell then buy it back at a lower price to repay the loan letting you keep the difference.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i9fas1a",
                                                    "author": "darkbluebrilliance",
                                                    "score": 1,
                                                    "created_utc": 1653116235.0,
                                                    "response": "google: naked short selling",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i98d0jg",
                                    "author": "makskirsanov",
                                    "score": 1,
                                    "created_utc": 1652984262.0,
                                    "response": "We're not leveraging children. We're just being called 'kids' in this particular post.\n\nDon't leverage, kids.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9exfsj",
                                            "author": "CynogRhys",
                                            "score": 1,
                                            "created_utc": 1653106302.0,
                                            "response": "I would be more concerned with the illiquidity and low volumes in btc right now, the barts in the charts .\n\nand the possible scenario of breaking below the 200 ema for the first time ever, major pain ahead .",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i98k8hk",
                            "author": "maotsetunginmyass",
                            "score": 17,
                            "created_utc": 1652987214.0,
                            "response": "I removed my BCH from exchanges recently. All of them.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9eahxu",
                                    "author": "nhutnv94",
                                    "score": 0,
                                    "created_utc": 1653093775.0,
                                    "response": "Thanks for the asymmetric info after the facts. Cheers !",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i97s2n0",
                            "author": "ImRichBCH",
                            "score": 27,
                            "created_utc": 1652975830.0,
                            "response": "\\]There are AMAZING overlaps between the BCH and r/Superstonk communities. Both are rallying around assets that have stong fundamental value but have been attacked with short selling but big industries and hedge funds.\n\nIt is UNCANNY how similar the two situations are and of course both communities have happened upon the same solution to their problems, buy up as much of the asset as they can and take it off exchanges!\n\nu/jsmar18",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i98hm4u",
                                    "author": "knowbodynows",
                                    "score": 9,
                                    "created_utc": 1652986148.0,
                                    "response": "Also r/wallStreetsilver.\n\nThe present spot price of $30/oz is due to decades of tamping down by tptb. These redditors are buying up *and taking possession* of *physical* silver to finally crack the price into true discovery (x10? I'm no expert).",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9a3xaa",
                                            "author": "TomatilloRadiant6186",
                                            "score": 1,
                                            "created_utc": 1653013939.0,
                                            "response": "“The United States Geological Survey estimates there is still a total of 530,000 million tonnes of silver below ground ready to be mined. “",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9ewm52",
                                                    "author": "Vad80",
                                                    "score": 2,
                                                    "created_utc": 1653105782.0,
                                                    "response": "It shows your bias.  Remember, money does not make you a quality character.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i9a904s",
                                                    "author": "knowbodynows",
                                                    "score": 1,
                                                    "created_utc": 1653016557.0,
                                                    "response": "And?\n\nYoure saying USGS reports are secret and not priced in?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9ctjre",
                                                            "author": "TomatilloRadiant6186",
                                                            "score": 1,
                                                            "created_utc": 1653068604.0,
                                                            "response": "No I’m saying what are you gonna do with all that silver. That’s just the US. All of the known gold in the world fits into a single Olympic size swimming pool that’s been mined if I remember right",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i98brkh",
                                    "author": "CryptoMemesLOL",
                                    "score": 7,
                                    "created_utc": 1652983747.0,
                                    "response": "There is a HUGE difference between naked short selling with GME and margin shorting in Crypto.  \n\n\nWith GME they literally created fake shares to short, on top of that, they were naked, meaning they don't even have the collateral to cover and buy back all those shorts if it price goes up.  \n\n\nWith BCH and or other cryptos, you need the other side to loan you shares to short, since you can't create them. Thus the holders profit from you shorting, this again is unlike GME where the brokers profit from loaning the shares, not the holders. Even a paper contract has to be matched for it to be open. You can't just dump paper shares without paper buyers.   \n\n\nA viable project will never fall below a certain price threshold because someone will always buy it below x$. The price can be maintained low with selling pressure, but the reality is that you won't see a squeeze like with GME if buying pressure increases because shorts can all close.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9fcvd6",
                                            "author": "darkbluebrilliance",
                                            "score": 2,
                                            "created_utc": 1653118032.0,
                                            "response": "Crypto exchanges can create fake BCH (or any other coins as well) and sell them or lend them to shortsellers. Only if people withdraw enough BCH the scam comes to light, because they sold more than they truly own and can't fullfil the withdraw.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i9amoly",
                                            "author": "ImRichBCH",
                                            "score": 1,
                                            "created_utc": 1653025112.0,
                                            "response": "Thank you for the reply.\n\nWhy do you say \"they\" can't fake volume on the exchange. Soooo many exchanges have been discovered doing sketchy shit, I promise you not all the exchanges are even fully backed, let alone making sure their big clients follow all the rules.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9cadfe",
                                                    "author": "CryptoMemesLOL",
                                                    "score": 1,
                                                    "created_utc": 1653060996.0,
                                                    "response": "I did not say they can't fake volume, they can and they do. They can buy and sell to themselves and create fake volume, but that does nothing to the price itself, it just shows more activity than there actually is, which might make their exchange more attractive and look less like a ghost town.\n\nWhat they can't do, is create coins, which is what Hedge Funds have been doing on Wall Street. This is the big difference with blockchain since they can't add 300% new token and then crash the market with them.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9d0u33",
                                                            "author": "ImRichBCH",
                                                            "score": 1,
                                                            "created_utc": 1653071913.0,
                                                            "response": "Thank you for the reply but I can't see any reason why a greedy exchange (all of them) could not inflate the number of coins they own.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9d5rfe",
                                                                    "author": "CryptoMemesLOL",
                                                                    "score": 1,
                                                                    "created_utc": 1653074242.0,
                                                                    "response": "You can't edit the blockchain, don't you understand how crypto works?",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i9aujr6",
                                    "author": "zyhxxazwx",
                                    "score": 1,
                                    "created_utc": 1653031297.0,
                                    "response": "How much did you lose learning not to take out sized risk?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9e7e29",
                                            "author": "sevenxtars",
                                            "score": 1,
                                            "created_utc": 1653092114.0,
                                            "response": "The usdt & btc death spiral is going to reset the entire crypto market. Only coins with a use case, like BCH, will recover.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i97k9o3",
                            "author": "CurvyGorilla202",
                            "score": 12,
                            "created_utc": 1652972636.0,
                            "response": "Paging Bitcoin Jesus - let’s fuck these fucks",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9cnix2",
                                    "author": "YllFigureItOut",
                                    "score": 1,
                                    "created_utc": 1653066164.0,
                                    "response": "What do you want Ver to do?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9fg0iy",
                                            "author": "moleccc",
                                            "score": 2,
                                            "created_utc": 1653120867.0,
                                            "response": "Well, *actually*, Ver is probably lending out his BCH and thus part of the problem. Makes sense for tax reasons. I know of at least one whale who's doing this. \n\nSo if you want to remove bch available for shorting, offer lending products to whales that don't result in the bch hitting market.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9fk9fo",
                                                    "author": "YllFigureItOut",
                                                    "score": 1,
                                                    "created_utc": 1653124826.0,
                                                    "response": "That's how DEFI works (aka leveraging) but where is it possible to borrow BCH?\n\nLet's be real, BCH price isn't gonna recover in BTC terms.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9dhb53",
                                            "author": "skanderbeg7",
                                            "score": 1,
                                            "created_utc": 1653079431.0,
                                            "response": "Buy BCH",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9di011",
                                                    "author": "YllFigureItOut",
                                                    "score": 1,
                                                    "created_utc": 1653079747.0,
                                                    "response": "Why would he?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9di79g",
                                                            "author": "skanderbeg7",
                                                            "score": 1,
                                                            "created_utc": 1653079837.0,
                                                            "response": "Y u mad?",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i99hoe2",
                                    "author": "minghaizai",
                                    "score": -4,
                                    "created_utc": 1653002841.0,
                                    "response": "thank you very much for this explanation. I was already very worried .",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9ax1ij",
                            "author": "bitcoinjason",
                            "score": 3,
                            "created_utc": 1653033520.0,
                            "response": "Are we talking about a Game stop style?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9b89uq",
                                    "author": "skanderbeg7",
                                    "score": 2,
                                    "created_utc": 1653042839.0,
                                    "response": "Fuk yea",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9btl1k",
                                    "author": "fiendishcrypro",
                                    "score": 1,
                                    "created_utc": 1653054157.0,
                                    "response": "Yep. Bang on 👍 by buying and withdrawing, it will cause a short squeeze (if the allegations are true) as they will be forced to buy the BCH at market price.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i98s3mi",
                            "author": "THE_LOBATOMIZER",
                            "score": 4,
                            "created_utc": 1652990434.0,
                            "response": "Post this on /r/WSB and say “short squeeze” “moon” and use emojis. They’ll take care of the rest.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i99bs9q",
                            "author": "brxn",
                            "score": 2,
                            "created_utc": 1652999907.0,
                            "response": "Imo.. I wouldn’t be surprised if Coinbase doesn’t have near the BCH needed to cover balances in everyone’s accounts. They’re tied closely with shititdel and the coinbase price is often the lowest bch exchange price",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i99wjrv",
                            "author": "production-values",
                            "score": 2,
                            "created_utc": 1653010318.0,
                            "response": "it does not need to be organized .... it's just people need to realize exchanges will steal everything they have eventually. never keep coin on exchanges period!",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9abe8n",
                            "author": "Beneficial_Rain2",
                            "score": 1,
                            "created_utc": 1653017870.0,
                            "response": "We need wallstreet bets",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9auhss",
                            "author": "synergyinvest",
                            "score": 1,
                            "created_utc": 1653031251.0,
                            "response": "True, will probably be a very expensive lesson for them .",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i98xi3q",
                            "author": "Blazedout419",
                            "score": -3,
                            "created_utc": 1652993330.0,
                            "response": "BCH not worth nearly enough to break the exchanges. Now if you pulled Bitcoin that would crater them, but even then maybe you need to pull Bitcoin and ETH...",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9b8iec",
                                    "author": "1molon3labe7",
                                    "score": 1,
                                    "created_utc": 1653043019.0,
                                    "response": "Looks like your point seems to be going totally off track and the fact you need to more about BCH!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i97mynr",
                    "author": "2q_x",
                    "score": 25,
                    "created_utc": 1652973757.0,
                    "response": "- First they ban you. \n\n- Then they troll you. \n\n- Then they short you.\n\n- Then they suspend withdraws.\n\n- Then they say they were \"hacked\".\n\n- Then they mine.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i99oov0",
                            "author": "krisdries",
                            "score": -1,
                            "created_utc": 1653006414.0,
                            "response": "Use paper or simulated trading to learn that lesson without eating dirt.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9b7rxs",
                                    "author": "2q_x",
                                    "score": 2,
                                    "created_utc": 1653042452.0,
                                    "response": "bot, ignore",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i97y1sa",
                    "author": "lucasmcducas",
                    "score": 12,
                    "created_utc": 1652978232.0,
                    "response": "We will squeeze them",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9d1snb",
                    "author": "fanruoxue",
                    "score": 5,
                    "created_utc": 1653072361.0,
                    "response": "When btc will dried out by the bug guys, and it will no longer be applicable for the small guy.\n\nThey will finally realize bitcoin is garbage for many reasons.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i98l3is",
                    "author": "arruah",
                    "score": 5,
                    "created_utc": 1652987564.0,
                    "response": "Any sources?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9am97z",
                    "author": "ml_trader",
                    "score": 4,
                    "created_utc": 1653024806.0,
                    "response": "The market will take take of it eventually. A sudden rise of prices in the crypto sphere will lead to an unstoppable short squeeze.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9em6la",
                    "author": "Tigrrra123",
                    "score": 5,
                    "created_utc": 1653099947.0,
                    "response": "BCH trading pair add margin trading support.\n\n It seems a good chance to short $BSV now.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i98cst4",
                    "author": "gym7rjm",
                    "score": 9,
                    "created_utc": 1652984173.0,
                    "response": "Users should try to move volume to things like ThorSwap using ThorChain. This platform allows better price discovery because it uses liquidity pools instead of order books. You can't spoof the order books or flood the market with borrowed BCH. \n\nIf more buying takes place on ThorChain the exchange price diverges from CEXs and Arbitrage bots buy up cheaper BCH on CEXs to transfer out to services like ThorSwap. Exchanges that don't allow withdrawals will not be used as much and over time more accurate price can be found.\n\nFurthermore, ThorChain allows LP providers to earn a return for providing liquidity, this mechanism pulls liquidity away from lending services that can lend out BCH to short. Note, this is not without risk, so understand completely what providing liquidity entails. ThorChain is releasing something called Synths which will abstract away the complexity of LP and give people a simple way to earn yield.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i98ssm4",
                            "author": "doramas89",
                            "score": 8,
                            "created_utc": 1652990715.0,
                            "response": "Precisely this. Crypto coins should be on DEXes as much as possible, not on CEXes or idle all in wallets (you get paid for \"putting it to work\" in this financial system). It makes the coin more liquid and its price more real.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i97j43i",
                    "author": "chainxor",
                    "score": 14,
                    "created_utc": 1652972151.0,
                    "response": "That sounds extremely fraudulent.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i97l7bb",
                            "author": "fiendishcrypro",
                            "score": 15,
                            "created_utc": 1652973025.0,
                            "response": "Unregulated space. This is the wild west.\nThis is why not all regulation is bad imo.\nBanning naked Shorting is a very good thing in my humble opinion.\n\nUntil then, communities have to work together to handle such issues 😎🔥",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i99c0yl",
                                    "author": "brxn",
                                    "score": 2,
                                    "created_utc": 1653000023.0,
                                    "response": "The stock market is over-regulated and it ended up turning into a wild wild west where the fat cats hold all the power and don’t follow any of the regulations",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9bcj3p",
                                            "author": "horizontween",
                                            "score": 1,
                                            "created_utc": 1653045648.0,
                                            "response": "But when you have the good shares and if hodl it for long term you might possibly get some good returns!",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i99o70v",
                                    "author": "capistor",
                                    "score": 2,
                                    "created_utc": 1653006162.0,
                                    "response": "Fraud is fraud. The simple laws still apply. Someone has to actually make a claim in their jurisdiction however.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9bhc5u",
                                            "author": "Jio43",
                                            "score": 1,
                                            "created_utc": 1653048343.0,
                                            "response": "True though you need to commit that because the fact that you know well about the sequences later!",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i99homc",
                                    "author": "linjieowen",
                                    "score": 1,
                                    "created_utc": 1653002844.0,
                                    "response": "Man, I'm glad I'm too stupid to figure that stuff out! I'd get myself in all sorts of trouble!",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9cqkuy",
                                            "author": "proxyz10",
                                            "score": 5,
                                            "created_utc": 1653067393.0,
                                            "response": "Someone who bought the shares  in the Stock market seems like they made a mistake!",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9f5owx",
                                                    "author": "rusik72",
                                                    "score": 2,
                                                    "created_utc": 1653112026.0,
                                                    "response": "I am not a proponent of BTC.  Cheers .\n\nI am slowly and cautiously diversifying my way out of BTC.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i97q56z",
                    "author": "Blazedout419",
                    "score": 15,
                    "created_utc": 1652975055.0,
                    "response": "Where can we view these millions of BCH being shorted? I always hear BCH is being shorted, but no one ever shows me some stats. Where is the data to verify this?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i983sgj",
                            "author": "mpkomara",
                            "score": 11,
                            "created_utc": 1652980536.0,
                            "response": "I would love to see more analysis as well!  BCH borrowing rates are in line with other cryptocurrencies.  While this doesn't prove anything, it suggests that the amount of shorting BCH is the same as other cryptos.  Of course, don't keep your BCH on exchange, but at the same time, don't necessarily believe that BCH is \"over-shorted\" without harder evidence.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9847oh",
                                    "author": "Blazedout419",
                                    "score": 3,
                                    "created_utc": 1652980706.0,
                                    "response": "It’s also possible that people just don’t like BCH and there for do not buy it. Price declines as more keeps getting mined and sold to market… would explain the 4+ year decline versus Bitcoin.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i985c8d",
                                            "author": "mpkomara",
                                            "score": 11,
                                            "created_utc": 1652981151.0,
                                            "response": "Hey that's my explanation, too!  But unlike you, I think the market is making the wrong decision so I continue to buy BCH.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i98zdob",
                            "author": "Bag_Holding_Infidel",
                            "score": 3,
                            "created_utc": 1652994172.0,
                            "response": "Every trade has a counter party. You cannot short 1.54m BCH as OP suggests without a counterparty to buy it.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i99arjd",
                            "author": "lazman10",
                            "score": 3,
                            "created_utc": 1652999419.0,
                            "response": "Just don’t leverage crypto. It’s not the stock market, stop treating it that way or it’ll end up the same .\n\nLeverage will destroy you if you don’t know what you’re doing .",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9c321a",
                                    "author": "eseiquattro",
                                    "score": 1,
                                    "created_utc": 1653058079.0,
                                    "response": "That would be good if people be much aware of all this stuffs a bit more earlier though!",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9dmb24",
                                            "author": "jnsannella",
                                            "score": 3,
                                            "created_utc": 1653081729.0,
                                            "response": "Bitcoin Cash is the highly improved version of BTC. Anyone can verify for themselves",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i97wnhj",
                            "author": "saylor_moon",
                            "score": 3,
                            "created_utc": 1652977671.0,
                            "response": "If you add up the outflows from [here](https://bitinfocharts.com/bitcoin%20cash/address/17om4dHcDNy9LAagMj8mGW59vyXjvA3GBn) and [here](https://bitinfocharts.com/bitcoin%20cash/address/19dQkvaH2NGgkGomzZu3qrnqRGCicXwedM), it's about 2 million BCH total.  It's unclear how much of that was repurchased, but the estimate that millions of BCH were short sold is certainly possible.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9994ds",
                                    "author": "bel9ev",
                                    "score": 2,
                                    "created_utc": 1652998636.0,
                                    "response": "I tried leveraging my kids but I was told there are not assets.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i99dhb3",
                                            "author": "saylor_moon",
                                            "score": 3,
                                            "created_utc": 1653000729.0,
                                            "response": "/u/MobTwo",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i9eo2oj",
                                            "author": "nefyrekafus",
                                            "score": 1,
                                            "created_utc": 1653100980.0,
                                            "response": "Again - all love and respect for the community. Just a dude tryna learn!",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i98dbzr",
                    "author": "smartguy_m",
                    "score": 3,
                    "created_utc": 1652984394.0,
                    "response": "Are you sure you're not conflating margin trading with futures? Margin orders are placed at the same order books as spot. But futures has their own order book and their price can sometimes deviate significantly from the spot price during periods of high volatility.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i98qbxz",
                            "author": "big--if-true",
                            "score": 2,
                            "created_utc": 1652989709.0,
                            "response": "Futures use margin. The numbers of millions of BCH make no sense otherwise.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9bvnmv",
                                    "author": "smartguy_m",
                                    "score": 1,
                                    "created_utc": 1653055047.0,
                                    "response": "Arbitrage traders may use margin trading to arbitrage. But most futures trading is purely speculative. Speculators just place bets against each other. This is where these millions come from.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9av8zn",
                    "author": "LatvianMen",
                    "score": 3,
                    "created_utc": 1653031915.0,
                    "response": "It’s highly likely that some of those traders are among us.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9epskh",
                            "author": "jewboy66",
                            "score": 1,
                            "created_utc": 1653101913.0,
                            "response": "BCH is literally a meta state. Everything else is same old trade Fi scams",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9b7w9j",
                    "author": "skanderbeg7",
                    "score": 3,
                    "created_utc": 1653042547.0,
                    "response": "Can't stress this enough. Pull your BCH out of exchanges so they can't short it. \n\nPlus Coinbase recently said if they go bankrupt you don't own your coins.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i99atbo",
                    "author": "mk112ning",
                    "score": 5,
                    "created_utc": 1652999443.0,
                    "response": "I think BCH got everything it need in its bag right now. Technically, it is just a question of time that the awareness of BCH reaches a tipping point that the awareness multiples itself within the population. Informing people and sperading awaress is indeed the key role at this stage.\n\nHas it been massively shorted? According to my observation the answer is very likely yes.\n\nThere is a crypto sectior on plus500 future exchange platform, someone interested in this issue could try paying attention on how the percentage of buyer and seller moves on BCH compare to different cryptos over time. I have noticed some interesting things in the recent 6 month compare to last year, in short I do think it takes someone more effort to pin down the price of BCH than other coins(of which if effort is needed at all). But the limited supply of BCH made it somewhat \"short proof\" in the long term.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ctubp",
                    "author": "YllFigureItOut",
                    "score": 2,
                    "created_utc": 1653068726.0,
                    "response": "If you wanna get conspiratorial...:\n\nhttps://youtu.be/FDd14aLaSG0?t=2500",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9cu358",
                            "author": "big--if-true",
                            "score": 1,
                            "created_utc": 1653068828.0,
                            "response": "Hey, thanks for that vid.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9f61xz",
                                    "author": "hitu4cash",
                                    "score": 1,
                                    "created_utc": 1653112305.0,
                                    "response": "Bitcoin maxis getting cocky…not a good sign. \n\nI hold it but I don’t think that’s the solution for all the change we wanna see into the future BCH .",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9fbtxy",
                    "author": "antoshko",
                    "score": 2,
                    "created_utc": 1653117123.0,
                    "response": "Geez, BCH is not a debt based currency like the dollar.\n\n it's a new money not controlled by same idiot's!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i991b5a",
                    "author": "lammbo_2",
                    "score": 1,
                    "created_utc": 1652995061.0,
                    "response": "Seems to be the case, prob similar dynamics with a few other coins...it will not end well for those shorts/exchanges",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9cmn5c",
                    "author": "YllFigureItOut",
                    "score": 1,
                    "created_utc": 1653065811.0,
                    "response": "The price doesn't reflect demand. The chart shows same price level as end of 2017!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9djxtv",
                            "author": "putnikvetra",
                            "score": 1,
                            "created_utc": 1653080630.0,
                            "response": "Got rid of BNB short and doubled down on BCH long.\n\n“One last dance” .",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}