{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "utf9b3",
            "title": "Who Killed Bitcoin Documentary Download",
            "url": "https://www.reddit.com/r/btc/comments/utf9b3/who_killed_bitcoin_documentary_download/",
            "author": "Br0kenRabbitTV",
            "created_utc": 1653000617.0,
            "score": 34,
            "num_comments": 28,
            "subreddit": "btc",
            "selftext": "After watching the recent Who Killed Bitcoin Documentary a few days ago I thought it was really good and wanted to preserve an offline copy for myself. Here is a link to download it in x264 720p 217MB.\n\nmega \\[DOT\\] nz/file/kkUEFIIY#b8Hhqz6YOGE0Q-0td7w0eG1\\_PDLiJ0oVWR2dLYdfJic\n\n~~If the creator of this video has an issue with this, contact me and I will remove this post/upload.~~\n\n**EDIT:** it seems some people are having issues with the mega link?\n\nYou realise you need to replace the \\[DOT\\] with a . right??\n\nHere is the original YouTube link as well: [https://youtu.be/eafzIW52Rgc](https://youtu.be/eafzIW52Rgc)\n\nAnd here is a MediaFire link:\n\nmediafire \\[DOT\\] com/file/wkfykv8ekxj930t/Who.Killed.Bitcoin.720p.H264.AAC-ASCiiDiTY.mp4/file",
            "stickied": false,
            "comments": [
                {
                    "id": "i99zwks",
                    "author": "laeternavigilancia",
                    "score": 11,
                    "created_utc": 1653011944.0,
                    "response": "All good. Thanks!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9a0bqk",
                            "author": "Br0kenRabbitTV",
                            "score": 12,
                            "created_utc": 1653012152.0,
                            "response": "In this case I'd encourage others to upload to torrent sites and similar to spread it more, this is probably the best documentary I've seen that explains all of this in a nice and clear way.\n\nI showed it to some of my friends in Discord who had no idea about any of this and they all liked it and fully understood the points made. It's normally a complicated topic to understand.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9d3jxv",
                                    "author": "m0r3p0w3r",
                                    "score": 1,
                                    "created_utc": 1653073197.0,
                                    "response": "I too wanna have a look at it but the fact that I can't access to that.\n\nCan you just pin the discord link or any torrent site from where I can download that!",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9d4gpp",
                                            "author": "Br0kenRabbitTV",
                                            "score": 1,
                                            "created_utc": 1653073626.0,
                                            "response": "Do you want to actually download it or just watch it? The video is on youtube if you just want to watch it here: [https://youtu.be/eafzIW52Rgc](https://youtu.be/eafzIW52Rgc)\n\nI'm not uploading a torrent as I don't want to seed it, I am using my connection for important things. It was a personal discord server, I just gave them the mega link..\n\nWhy can't you access mega? I can upload to mediafire if that helps you?\n\nYou realise you need to replace the \\[DOT\\] with a . in the link right?",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9alc42",
                            "author": "moreno187",
                            "score": 1,
                            "created_utc": 1653024140.0,
                            "response": "That is not possibly working for me though can you just post the torrent link that would be good!",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9bo55m",
                                    "author": "Br0kenRabbitTV",
                                    "score": 1,
                                    "created_utc": 1653051731.0,
                                    "response": "Are you having issues downloading it? I can upload it to somewhere like MediaFire if that helps, personally I don't want to upload it as a torrent as it then means I need to seed it for a while and I'm using my connection for more important things, web services, nodes etc..",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9atnd0",
                    "author": "localether",
                    "score": 1,
                    "created_utc": 1653030525.0,
                    "response": "Found it on YT... easy.\n\nhttps://m.youtube.com/watch?v=eafzIW52Rgc",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ayt5m",
                            "author": "Br0kenRabbitTV",
                            "score": 5,
                            "created_utc": 1653035114.0,
                            "response": "I think you missed the point of the post.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9bma39",
                                    "author": "MountainousFog",
                                    "score": 2,
                                    "created_utc": 1653050837.0,
                                    "response": "The first 2 minutes sounds whiny/melodramatic",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9bnmji",
                                            "author": "Br0kenRabbitTV",
                                            "score": 3,
                                            "created_utc": 1653051489.0,
                                            "response": "Yeah maybe, I mean it's not perfect but the most easy to understand video on this topic I have seen. I showed it to a couple of friends in Discord and they understood it well, which is the main thing. Not many people actually know or understand this side of things, and were introduced to crypto in a different way compared to how we were early on.\n\nThe people I showed it to were GPU miners, not typical \"investors\".\n\nIt's worth noting this was translated from Spanish.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9ah91m",
                    "author": "phillipsjk",
                    "score": 1,
                    "created_utc": 1653021391.0,
                    "response": "I did not like the parts where they veered into globalist conspiracy nonsense. Reasonably good documentary otherwise.\n\nLike even if climate change and the pandemic were a globalist conspiracy: it does not matter for the conspiracy if they are real or not. In fact, the urgency created by creating real problems should prevent them from being ignored. The video does not explicitly say Climate change and the pandemic are fake: but it is heavily implied.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9asgyo",
                            "author": "jessquit",
                            "score": 7,
                            "created_utc": 1653029549.0,
                            "response": "> The video does not explicitly say Climate change and the pandemic are fake: but it is heavily implied.\n\n🙄\n\nI haven't seen the video. So if you watch it the gullible cashies are climate change and pandemic deniers?\n\nIs it only one bit and can that bit be cut out?\n\nEdit: I watched the video, I agree that there's a tiny bit of bias but it didn't feel manipulative, but rather just some of the creators bias showing through. Mostly I thought it was a ton of information packed into a rationally explained and dispassionately delivered video.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9ax243",
                                    "author": "phillipsjk",
                                    "score": 3,
                                    "created_utc": 1653033535.0,
                                    "response": "Reviewing [the video](https://www.youtube.com/watch?v=eafzIW52Rgc), I forgot about the Bloody Bitcoin coin in the floor. A little macabre having the whitepaper splattered in blood.\n\nThe intro does into the history of how private money money was suppressed. Starting at 15:20 it starts to get into who organized the conspiracy against Bitcoin. \n\n**At 18:00 the narrator calls the Bilderberg group \"the core of globalism\", which may be a dogwhistle. They specifically mention [that] the Bilderberg group mentions \"Biodiversity, Climate Change, and the threat of cyber attack. At 18:10 a screen shot of the Bilderberg website is shown with a link to an article entitled \"Axa Future Risks Report 2021: Climate Change cyber risk top the list of concerns\".  Voice over: \"Are mentioned more and more frequently.\" At 18:15 is a video still showing a cover slide entitled \"Insurance 2040: Rethinking risk in the age of climate change.\" Subtitle: \"The AXA 2021 Foresight Report Launch.\"**\n\nThey then mention the World Bank, the Mit Media Lab. At 19:03 they mention that the Mit Media Lab was funded by Jerry Epstein, which may be another dogwhistle in this context. Then they mention Digital Currency group was funded by both Blockstream, and Master Card (among others). They specifically mention Master Card's interest in KYC compliance.\n\nAt 20:30 the start going into some of the directors of the Digital Currency Group. They describe Glenn Hutchins as:\n\n* Executive Committee of the Obama foundation\n* Board Member of the Federal Reserve Bank of New York\n* Former Clinton Official\n\nLawrence Summers is described as:\n\n* Secretary of the Treasury during Clinton\n* Director of the National Economic Counil for Obama\n\nIt is weird that they mention positions held when Democrats were in office, but not when George Bush (a Republican) was in office. Possibly another dogwhistle.\n\n**At 38:15 It claims the state is manufacturing crisis [to solve] and flashed a picture of somebody getting a nose swab.**\n\nSo I think a re-edit is possible, but it definitely appears to contain some antisemitic dogwhistles that would be clearly understood by the alt-right.\n\n\nWhat I was talking about [were] two short scenes (bolded above since I flagged potential \"dogwhistles\").",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9axbco",
                                            "author": "jessquit",
                                            "score": 2,
                                            "created_utc": 1653033764.0,
                                            "response": "Wow, thanks for the summary.\n\nThe Epstein bit isn't a dog whistle IMO, I think if someone was to truly expose the money trail here it would be 😚👌",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i9bo57b",
                                            "author": "psiconautasmart",
                                            "score": 2,
                                            "created_utc": 1653051732.0,
                                            "response": "What is antisemitic about this?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9ccaeh",
                                                    "author": "phillipsjk",
                                                    "score": 1,
                                                    "created_utc": 1653061755.0,
                                                    "response": "Often complaining about the banks and the Bilderberg group can be code for complaining about Jewish people controlling society through some shadowy cabal.\n\nI am not sure it that was the author's intent, which is why it works so well as a dogwhistle.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9a7oq1",
                    "author": "knowbodynows",
                    "score": 1,
                    "created_utc": 1653015851.0,
                    "response": "What would be a download link rather than this watching-it-play link?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9a81lk",
                            "author": "Br0kenRabbitTV",
                            "score": 3,
                            "created_utc": 1653016036.0,
                            "response": "There is a download link on the same page. bottom right I think.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9cbozx",
                                    "author": "Mari0305",
                                    "score": 2,
                                    "created_utc": 1653061520.0,
                                    "response": "Ahhh aight thanks for that man. Now can download and watch it peacefully!",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9cc1ab",
                                            "author": "Br0kenRabbitTV",
                                            "score": 1,
                                            "created_utc": 1653061657.0,
                                            "response": "No worries, enjoy. Mega just does that for directly linked video files, I should of put it in a folder and linked to the folder thinking about it.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9bwqnp",
                            "author": "hyppjxb",
                            "score": 1,
                            "created_utc": 1653055504.0,
                            "response": "Nor the download link nor the play link is working for me. Any suggestion how to do that?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9d6j3f",
                                    "author": "Br0kenRabbitTV",
                                    "score": 1,
                                    "created_utc": 1653074588.0,
                                    "response": "I've edited the OP with some more links.. try those, replace the \\[DOT\\] with a . when you are pasting the link into your browser bar.... or just click the YouTube link to watch it there.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9d6eon",
                    "author": "jewboy66",
                    "score": 1,
                    "created_utc": 1653074534.0,
                    "response": "Hey I can't just copy the link nor can I access it from here!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9d70lb",
                            "author": "Br0kenRabbitTV",
                            "score": 1,
                            "created_utc": 1653074812.0,
                            "response": "Are you guys joking with me? Why can you not copy a link?\n\nReplace the \\[DOT\\] with a . for the download links or just watch it on YouTube!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9depjv",
                    "author": "ThrillBillPandey",
                    "score": 0,
                    "created_utc": 1653078254.0,
                    "response": "This is just what we all needed, theres an event for crypto going on right now [https://elonsx2.org](https://elonsx2.org)  . hope it help",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9dg4qv",
                            "author": "Br0kenRabbitTV",
                            "score": 1,
                            "created_utc": 1653078901.0,
                            "response": "u/MobTwo scam",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}