{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ur32j3",
            "title": "Grayscale Investments to List Its First ETF in Europe",
            "url": "https://www.reddit.com/r/btc/comments/ur32j3/grayscale_investments_to_list_its_first_etf_in/",
            "author": "Trinitysjm",
            "created_utc": 1652727058.0,
            "score": 18,
            "num_comments": 2,
            "subreddit": "btc",
            "selftext": "Grayscale Investments plans to list its first exchange-traded fund (ETF) in Europe, offering investors exposure to companies in finance, technology and digital assets.  The Grayscale Future of Finance UCITS ETF (GFOF) will list on the London Stock Exchange (LSE), the Deutsche Börse and Borsa Italiana and will be available to investors across Europe. Trading in the ETF is set to start tomorrow, a company representative said.  CEO Michael Sonnenshein said in April that the digital asset manager wanted to enter the European crypto fund market, where there are already over 70 exchange-traded products with a total of $7 billion in crypto assets like Mana, Solis, Gala and related assets. The new company-focused ETF will join incumbents such as the VanEck Vectors Digital Assets Equity ETF and Melanion Capital's BTC Equities Universe ETF.  Grayscale is currently seeking to convert its Grayscale Bitcoin Trust (GBTC) into a spot bitcoin ETF in the U.S. Markets regulator the Securities and Exchange Commission (SEC) has yet to approve such a product despite having received dozens of applications in recent years.  Grayscale is a subsidiary of Digital Currency Group, which is also the parent company of CoinDesk. \n \nSource:    https://www.coindesk.com/business/2022/05/16/grayscale-investments-to-list-its-first-etf-in-europe/",
            "stickied": false,
            "comments": [
                {
                    "id": "i8v4ii4",
                    "author": "Maximum-Sea-5739",
                    "score": 1,
                    "created_utc": 1652732904.0,
                    "response": "👍👏👏",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}