{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "v0eqmz",
            "title": "1 ETH giveaway",
            "url": "https://discord.gg/8g7Re5wn",
            "author": "Same-Page-2813",
            "created_utc": 1653841563.0,
            "score": 0,
            "num_comments": 3,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "iag0fj7",
                    "author": "Quirky_Poetry_",
                    "score": 1,
                    "created_utc": 1653842787.0,
                    "response": "Thank you for such an opportunity to win 1 ETH   \n\n\nI do need this ETH. The matter is that AngelBlock NFT Mint is live and I want t mint their NFTs very much. It's one of the most hyped NFT collection.  \n\n\nSo, I want to be the winner. Once again, thanks for such a chance",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iag0l65",
                            "author": "Same-Page-2813",
                            "score": 0,
                            "created_utc": 1653842858.0,
                            "response": "Join discord [discord ](https://discord.gg/8g7Re5wn)",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iag7hts",
                    "author": "Remora_101",
                    "score": 1,
                    "created_utc": 1653845993.0,
                    "response": "Smells like a big pile of scam.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "v0euod",
            "title": "is BTC rational?",
            "url": "https://www.reddit.com/r/btc/comments/v0euod/is_btc_rational/",
            "author": "leoOuma",
            "created_utc": 1653841887.0,
            "score": 0,
            "num_comments": 11,
            "subreddit": "btc",
            "selftext": "seriously, other than the reason you will make money from it why is BTC important?\n\nP2P? well, mostly criminals and people who have something to hide can support p2p. thieves love this.\n\nblockchain transaction? I'd rather use MPESA from Africa",
            "stickied": false,
            "comments": [
                {
                    "id": "iag7fjm",
                    "author": "Remora_101",
                    "score": 4,
                    "created_utc": 1653845963.0,
                    "response": "There is a tiny difference. \n\nP2p cash  would be empowering. No more money printer, no more denied banking service, no more frozen accounts because ????\n\nEverything can be used by criminals. The dollar is used by criminals, cars are used by criminals, telephones are used by criminals, encryption on general is used by criminals. \n\nThat is not an argument. \n\nThe tiny difference is, that BTC is not p2p cash anymore they chanced into Store of Value, digital gold or a settlement layer depending on who you ask. And that I find indeed irrational.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iag4mwt",
                    "author": "Shibinator",
                    "score": 8,
                    "created_utc": 1653844687.0,
                    "response": "Of course it isn't.\n\nIt's a giant bubble, and will collapse to worthless once the majority of the slowly-learning market learns that other cryptos do the same thing faster and cheaper.  Bitcoin Cash and other actually useful alternatives will rise in its place.\n\nMight take a while, but it will happen.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iah0ejh",
                            "author": "TinosNitso",
                            "score": 1,
                            "created_utc": 1653859700.0,
                            "response": "If the market cap of [cash-gold](https://www.ebay.com/itm/164961330561) is only **0.6%** that of gold bullion (or much less), then dissing bullion won't help with cash-gold adoption. If BTC goes down, BCH goes down **more**. If gold goes down, cash-gold goes down even more.\n\nUnfortunately almost everything other than BTC may as well be a scam (imo), and therefore BCH is considered a scam as well (e.g. by Max Keiser). It looks like maybe some cryptos only go down after ppl buy in, like an illusion. Each crypto is like a bullet with an investor's name on it.\n\nThe problem BTC seems to solve is that of paying ppl online. But it can only solve it to the extent of its value & market cap. Txn rates & fees actually don't matter anywhere near as much as it being a **S**tore-**O**f-**V**alue. If BCH ever reaches anywhere near half of BTC, I'll probably sell at least half of mine (if I'm lucky enough to hold that long). Whenever someone claims BTC has high fees, I just point at the free withdrawals from FTX (anything under $300 is just once/day).",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iah6aut",
                                    "author": "Shibinator",
                                    "score": 1,
                                    "created_utc": 1653862641.0,
                                    "response": "I don't think we need to prop up BTC in order to have a flow on effect to BCH.\n\nThe point is to build a separate BCH economy, and when that economy gets big enough and resilient enough then it will disconnect from BTC fluctuations and it won't matter if their scam blows up.  We shouldn't be propping up their scam out of desperation, we should ignore that and build an economy that makes their scam (and its influence on us) obsolete.\n\nAs for Max Keiser, he's a scammer: https://www.youtube.com/watch?v=begtnFv5css\n\n> Whenever someone claims BTC has high fees, I just point at the free withdrawals from FTX\n\nWell most people in the world don't want to withdraw from FTX, they want to pay for goods and services or transact with their friends, so it doesn't really matter what FTX does BTC still isn't useful to most people because of its high fees in every other scenario.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iag0nhs",
                    "author": "opcn_admin",
                    "score": 3,
                    "created_utc": 1653842888.0,
                    "response": "BTC has been hijacked and sabotaged in 2017 by the bankster proxy Blockstream Inc. \n\nIt's a failed project propped up by idiocy (people who fomo into it without doing their due diligence) and fraud (USDT).\n\nMPESA is a centralized shitcoin.\n\nUse and embrace independent peer to peer money like BitcoinCash and Monero.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iagcgk0",
                    "author": "ApplicationAny1434",
                    "score": 3,
                    "created_utc": 1653848283.0,
                    "response": "criminals? Do you even know the definition of that word?\n\nIf you want to talk about criminals, all of them sit in the goverment. Only way to protect yourself is real cash, p2p money or gold/silver.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iag0a4g",
                    "author": "FieserKiller",
                    "score": 2,
                    "created_utc": 1653842721.0,
                    "response": "everyone has something to hide",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iagpnx5",
                    "author": "LovelyDayHere",
                    "score": 1,
                    "created_utc": 1653854464.0,
                    "response": ">well, mostly criminals and people who have something to hide can support p2p.\n\nwot\n\nthis isn't the reason I use Bitcoin\n\nit's because it gets rid of unnecessary middlemen who are constantly siphoning money from me and billions of other people\n\nstealing the fruits of our labor for NO GOOD TECHNICAL REASON anymore\n\nand telling people how they are allowed to spend their money when it's none of their business (interfering with economic rights of others for their own gain)\n\n> blockchain transaction? I'd rather use MPESA from Africa\n\nuse what you want, but one of these days you might find out that fiat currency can have bad things happen to it as well, and then MPESA is no solution, in fact, your money can get stuck too when with Bitcoin (Cash) you can be MORE in charge of your money and no-one will easily stop your transaction or seize your funds.\n\nTo each their own. You have more to learn about blockchain and the nature of the bank money :-D :-D :-D",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iagjdk8",
                    "author": "zdch3",
                    "score": 0,
                    "created_utc": 1653851516.0,
                    "response": "We have a service in Poland called BLIK. You start the payment, enter 6 digit code on the checkout and then approve in your mobile app. It's as fast as the fastest crypto, and it's free from user perspective (and probably from merchant as well, as they prefer it over credit cards). So I can only wonder whats the point of crypto.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaguneo",
                            "author": "Remora_101",
                            "score": 2,
                            "created_utc": 1653856873.0,
                            "response": "The point is you trust someone with all your wealth. And you are dependent on their service. With crypto you are in charge. Think about giving your house keys to the caretaker every time you leave your house, because you could of course lose it. It is much saver with the caretaker and it is so convenient. From time to time he suspects you of doing drugs, so he inspects your home, or denies access, but that is nothing compared to the convenience he provides.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iagl4xi",
                            "author": "leoOuma",
                            "score": 0,
                            "created_utc": 1653852337.0,
                            "response": "ikr?!\n\nmost people I know that really push crypto just want to get rich out of it. there certainly have to sell it to a greater fool to get rich when it goes high. this is not helpful to society.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}