{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ut2y2e",
            "title": "\"Bitcoin.com will be deprecating support for SLP and will instead be supporting smartBCH (SEP-20)\"",
            "url": "https://support.bitcoin.com/en/articles/6196127-support-for-slp-tokens-in-the-bitcoin-com-wallet",
            "author": "Mr-Zwets",
            "created_utc": 1652965339.0,
            "score": 49,
            "num_comments": 45,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i97ncfx",
                    "author": "KallistiOW",
                    "score": 14,
                    "created_utc": 1652973916.0,
                    "response": "SLP will be moot once the CashTokens proposal makes it into the protocol.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i97r024",
                            "author": "Mr-Zwets",
                            "score": 8,
                            "created_utc": 1652975396.0,
                            "response": "Hopefully May 2023!",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i993wdk",
                                    "author": "linjieowen",
                                    "score": 3,
                                    "created_utc": 1652996242.0,
                                    "response": "I'm just starting out so any and all constructive criticism is welcome !",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i98ezfr",
                            "author": "JonathanSilverblood",
                            "score": 8,
                            "created_utc": 1652985071.0,
                            "response": "Be aware though, that CashTokens have not achieved consensus and that the next activation target is a year in the future.\n\nA lot can happen in a year.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i98jvam",
                                    "author": "jldqt",
                                    "score": 4,
                                    "created_utc": 1652987064.0,
                                    "response": "Just to add to the above info: the proposal would need to achive consensus and be *fully* implemented, verified and released within 6 months. This not a lot of time.\n\nhttps://gitlab.com/im_uname/cash-improvement-proposals/-/blob/master/CHIPs.md",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9ahzr4",
                            "author": "jhlee630",
                            "score": 0,
                            "created_utc": 1653021866.0,
                            "response": "Tokens are in a slump and $SLP is very low these days .\n\n but all that means is that breeding can be profitable if you breed something that is in demand.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9aom9m",
                                    "author": "RowanSkie",
                                    "score": 2,
                                    "created_utc": 1653026545.0,
                                    "response": "u/MobTwo something for tomorrow maybe, but possible bot confusing the Axie Infinity token to the SLP protocol.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i990aoy",
                    "author": "fatalglory",
                    "score": 9,
                    "created_utc": 1652994592.0,
                    "response": "I struggle to care much because I don't see a whole lot of value in tokens. People used to talk about the \"tokambrian explosion\" and how every type of asset was going to be tokenised and traded on chain. But increasingly I think this is misguided.\n\nSay I tokenised a bunch of gold coins. I can trustlessly transfer the tokens to you, but you still have to trust that I will actually redeem the tokens for coins. So the element of trust in a counter-party is not actually removed.\n\nIf trust is not removed from the transaction, then what's the point of having it on a distributed ledger? It's much faster and cheaper to track ownership with a centralised database. If you trust me to redeem the physical metal, then you might as well also trust me to keep the ownership logs.\n\nOr what about in-game assets in a video game? They are useless if you don't trust the game creators to redeem the tokens in the game. And if you trust the game creators, then you might as well trust them to maintain the records of players' inventories.\n\nThis seems to be true for any asset that is exogenous to the decentralised network. Which leads me to conclude that tokens are largely pointless.\n\nWould be glad for someone to tell me what I am missing.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i99msw6",
                            "author": "SecularCryptoGuy",
                            "score": 5,
                            "created_utc": 1653005452.0,
                            "response": "Lemme start by saying that you are almost there, and understand these things WAY more than most people (who are far bigger advocates of tokens and NFTs).\n\nI understand that the cases listed by you are not good enough use cases which would require blockchain, but what  I want to elaborate this specific point you made because it nails the crux of the issue:\n\n> This seems to be true for any asset that is exogenous to the decentralized network. Which leads me to conclude that tokens are largely pointless.\n\nYou're right. Any asset which is exogenous to the blockchain cannot be that well controlled by the blockchain, but there is one thing which isn't tangible but when derived from blockchain or non-blockchain system creates a big difference.\n\n- Centralized system: You are not going to scam me because I will (worst case scenario) file a report with the police, take you to court, and even if you were a citizen of another country, get you extradited (etc). The trust is top down.\n- Blockchain system: You are not going to scam me, because the setup in which we are going to interact (escrow, smart contracts, tokens etc) will ensure that you will lose more than you gain. (YET TO BE BUILT). The trust is built bottom up.\n\nIn other words, using blockchain, we don't need the authority of the king/supreme court/republic/united nations, in order to successfully interact with each other. That system is still in the process of being built, and tokens seem to be an important building block for that.\n\nA use case: Banks using clearinghouses to deal with each other. Why do they need clearinghouses? Because there are too many parties and not everyone has enough trust, PLUS with large amounts they don't want to get tied up in dispute resolution. So they trust a clearinghouse instead.\n\nWith blockchains they can perform the clearing in a far shorter amount of time, and tokens is just how they will do it.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i97a60x",
                    "author": "lightswarm124",
                    "score": 13,
                    "created_utc": 1652968277.0,
                    "response": "Hypothetical scenario, but if further down the line, smartBCH shows to inherit all of the scaling problems Ethereum is currently facing, will Bitcoin.com's wallet stop supporting for smartBCH the same way they are stopping SLP support? Asking cuz right now platforms like OpenSea require indexers (i.e. TheGraph) to properly query things such as token balances, and I'm not seeing what solutions are being used to address this.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i97wmga",
                            "author": "SecularCryptoGuy",
                            "score": 7,
                            "created_utc": 1652977660.0,
                            "response": "> will Bitcoin.com's wallet stop supporting for smartBCH the same way they are stopping SLP support? \n\nAbsolutely (not speaking for Bitcoin.com btw). We are building a product on SLP NFTs and it sucks that Roger goes through these ebbs and flows of faith, I can't imagine what it would be like to be in his shoes, but although Bitcoin.com is biggest BCH influence, we will continue working on supporting Bitcoin Cash ecosystem. I like SmartBCH, but unless they are launching a more advanced scalable sidechain (like Tezos for instance), its a nice to have functionality on Bitcoin Cash.\n\nBitcoin Core Maximalism at this point is purely a faith based investment movement (they even act like zealots) because their technology cannot match up to competition, so they must bridge this gap with faith. Bitcoin Cash, with its better UX and continuous upgrades is playing catch up on some aspects (like NFTs, Smart Contracts, DeFi) but leading on others (merchant adoption), and I appreciate that at least Bitcoin.com is focused on merchant adoption. I still watch /u/mafalzon (Marc Falzon's) videos on adoption everyday with lunch and its one of the best part of my day.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i97wz6x",
                                    "author": "Mafalzon",
                                    "score": 3,
                                    "created_utc": 1652977803.0,
                                    "response": ">level 1SecularCryptoGuy · 1 min. agowill Bitcoin.co\n\nWow thank you!",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i98d2ib",
                                            "author": "NeoDemocrito",
                                            "score": -4,
                                            "created_utc": 1652984285.0,
                                            "response": "You are right but the reality is we put investment (money), of course to earn day by day not for fun.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i99o7lh",
                                    "author": "cangocan",
                                    "score": 1,
                                    "created_utc": 1653006170.0,
                                    "response": "Well no one said it was easy! Gotta be smart about it.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9a2lnl",
                            "author": "tompater",
                            "score": 2,
                            "created_utc": 1653013276.0,
                            "response": "And after you breed and found the best team composition, they will just nerf it.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i97hdq0",
                    "author": "dinopawnz",
                    "score": 6,
                    "created_utc": 1652971429.0,
                    "response": "Bitcoin Cash users need to give SmartBCH a chance. It works great",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9756mu",
                    "author": "xjunda",
                    "score": 8,
                    "created_utc": 1652965925.0,
                    "response": "Makes sense.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9axzo1",
                            "author": "bluekwj",
                            "score": 1,
                            "created_utc": 1653034374.0,
                            "response": "I see a lot of people suggesting lotteries and raffles as burning mechanisms for SLP.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i976rgc",
                    "author": "SecularCryptoGuy",
                    "score": 7,
                    "created_utc": 1652966686.0,
                    "response": "This is a bad move. One of the main values of BCH and SLP tokens is that you can get NFTs on Layer1 with super cheap fees. One of the biggest wallets on BCH ecosystem stopped supported Layer1 NFTs, that doesn't make sense.\n\nAlso, I couldn't get the answer form the support page, but what will happen if some users do decide to send their SLP tokens to bitcoin.com wallet? Are you going to burn them?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i977ulh",
                            "author": "chainxor",
                            "score": 16,
                            "created_utc": 1652967202.0,
                            "response": "SLP has shown to be really bad at scale. It was always a sub-par solution to tokens. The best way to have L1 tokens on BCH is to have new script OP codes added that supports native tokens so that they become 1st class citizens. There are proposals being worked on. Until then SmartBCH is a much better and scalable approach than SLP.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i979ilp",
                                    "author": "lightswarm124",
                                    "score": 9,
                                    "created_utc": 1652967981.0,
                                    "response": "how much developer support was put in since launch compared to other projects? do you realize the indexer is almost 3 years out of proper maintenance?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i97iozr",
                                            "author": "chainxor",
                                            "score": 3,
                                            "created_utc": 1652971975.0,
                                            "response": "Yes, and apparently nobody has shown much interest in working on it (or financing it), whereas SmartBCH has basically hit the ground running on both accounts compared to SLP.\n\nHowever, I believe PSF is doing an indexer.   \n\n\nDon't get me wrong I hope SLP survives and improves, since there are actually a few companies that use it and it would be bad if their service stopped working.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i97jj0m",
                                                    "author": "lightswarm124",
                                                    "score": 3,
                                                    "created_utc": 1652972325.0,
                                                    "response": "Will smartBCH require indexers like TheGraph or Moralis? Because if not, I think the entire ETH community would want to know how smartBCH does it",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9a32hy",
                                                            "author": "bes5117",
                                                            "score": 0,
                                                            "created_utc": 1653013506.0,
                                                            "response": "This game is boring as hell what do you mean for fun. \n\nIf you don't spend tons of money you don't win games, not winning is the most annoying game I ever played .",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i9846mn",
                                                    "author": "jhonjmmi",
                                                    "score": -2,
                                                    "created_utc": 1652980694.0,
                                                    "response": "Thanks for sharing your thoughts ! \n\nI was thinking the same things yesterday.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i97adjd",
                                            "author": "LovelyDayHere",
                                            "score": 6,
                                            "created_utc": 1652968372.0,
                                            "response": "There isn't just one indexer, there are several.\n\nIncluding a new one that is being worked on by the Permissionless Software Foundation.\n\nIt still does not appear to be a solution that scales well. I don't think the ecosystem is willing to invest the effort into that rather than native tokens, which would get the full benefit of BCH scaling work and end up saving on the external indexing software maintenance.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i97beio",
                                                    "author": "lightswarm124",
                                                    "score": 9,
                                                    "created_utc": 1652968834.0,
                                                    "response": "Outside of the PSF-Indexer (in beta) that Chris is working on, I haven't come across any other functioning indexers out there. Also, the PSF-Indexer came about because the old SLPDB indexer, which is used in almost every single SLP-supporting app, was so bloated by all of the FLEX SLP transactions. IIRC, one of the core reasons for this bloat was the fact that the original BitDB (from which SLPDB forked from) was due to the indexer using MongoDB, which apparently did not perform well at the large scales. I know that the PSF-Indexer is currently using LevelDB, which is suppose to have better scaling capabilities.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i97j0bw",
                                                            "author": "chainxor",
                                                            "score": 4,
                                                            "created_utc": 1652972107.0,
                                                            "response": "Lets hope PSFs indexer can spark som confidence into SLP tokens again.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i98me68",
                                                                    "author": "jldqt",
                                                                    "score": 2,
                                                                    "created_utc": 1652988086.0,
                                                                    "response": "Probably not since the main issue with SLP is in the protocol, not necessarily the implementation(s). There simply isn't any viable way for a SPV wallet to verify tokens on, or beyond, FlexUSD scale.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                },
                                                                {
                                                                    "id": "i99nugf",
                                                                    "author": "Michelletim25",
                                                                    "score": 1,
                                                                    "created_utc": 1653005989.0,
                                                                    "response": "The price of SLP is affected by various factors, it would be difficult to limit the price in a fixed range.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i97bdoz",
                    "author": "KeepBitcoinFree_org",
                    "score": 3,
                    "created_utc": 1652968824.0,
                    "response": "SLP > offchain EVM bullshit. I stopped using/supporting their wallet long ago anyways.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i98010t",
                            "author": "TheFireKnight",
                            "score": 3,
                            "created_utc": 1652979024.0,
                            "response": "Have you tried using SmartBCH? It's much easier than SLP",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i984u0k",
                                    "author": "KeepBitcoinFree_org",
                                    "score": 4,
                                    "created_utc": 1652980948.0,
                                    "response": "Using a trusted bridge to swap from BCH to sBCH to a L2 token is not easier than using a BCH/SLP wallet directly. I’m fine with using and developing with SLP. It is far superior to using an ETH EVM off chain with a trusted bridge.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9advh7",
                                            "author": "TheFireKnight",
                                            "score": 2,
                                            "created_utc": 1653019310.0,
                                            "response": "I've tried using SLP man. Maybe it was the bad infrastructure, cause I was using mint.Bitcoin.com, but sometimes it would work sometimes it wouldn't. And there's no market, no interface that I've heart of, and only know of the electron cash wallet that accepts it really.\n\nI've never done anything Ethereum related before Smartbch, and I feel like a whiz now. Very easy.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9agrb2",
                                                    "author": "KeepBitcoinFree_org",
                                                    "score": 2,
                                                    "created_utc": 1653021080.0,
                                                    "response": "Understandable, I hear where you’re coming from. That specific issue falls on Bitcoin.com, as they hosted APIs and created wallets with little intention of maintaining them but it happens. There are some infrastructure issues with SLP right now but they are actively being worked on by the Permissionless Software Foundation - https://psfoundation.cash, creating a new indexer. \n\nSLP tokens are still better and safer than these off chain “smart contract” EVM tokens and the centralized “DEX” liquidity platforms that get hacked or rugpulled every other day. \n\nSLP has at least two real functioning p2p DEXs right now that cannot steal your money and a number of wallets. It is real peer to peer trading via atomic swaps and that is what I’m interested in. \n\nhttps://memo.cash (only centralized in the front end)\n\nhttps://dex-demo.fullstack.cash (fully decentralized desktop application - this is a demo. It is still in development). \n\nTo me, these are inherently better than anything on EVM. How many people actually read or understand any of the contract code used in those projects. It’s likely that not many do, they’re just chasing more fiat and the latest fads.\n\nElectron Cash SLP is the best desktop wallet. \n\nhttps://wallet.fullstack.cash is the best web wallet. \n\nMemo.cash works but the interface is a bit confusing, as it’s also a social media site and a DEX. \n\nEven Blockchair.com now supports BCH SLP transactions.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9antg1",
                                                            "author": "LovelyDayHere",
                                                            "score": 1,
                                                            "created_utc": 1653025943.0,
                                                            "response": "Memo.cash used to be great, but the developer doesn't seem incentivized to improve or properly maintain it.\nOne of the issues seems to be a philosophical opposition to BCH upgrades.\n\nI would still recommend it as a somewhat censorship resistant social platform, but the downtimes are unpredictable.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9cgy5p",
                                                                    "author": "KeepBitcoinFree_org",
                                                                    "score": 1,
                                                                    "created_utc": 1653063588.0,
                                                                    "response": "Memo.cash is very interesting but it has it’s issues. The protocol is open so anyone can post to memo directly from their BCH wallet, or build a different UI on top of it (like https://member.cash). The memo UI/app itself is closed source though I believe (because the DEX is for-profit, taking a small percentage on each trade).",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i99c94w",
                    "author": "hemarg2000",
                    "score": 2,
                    "created_utc": 1653000133.0,
                    "response": "Disagree strongly about looking at raffles/lotteries as taxing the poor. Casinos too.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i97lhd1",
                    "author": "ShadowOrson",
                    "score": 1,
                    "created_utc": 1652973141.0,
                    "response": "ohh no... \n\nLet's see who and how many people will throw childish fits about an independent business making a choice about what service they will/will not support.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i98yj50",
                            "author": "tuami24",
                            "score": -1,
                            "created_utc": 1652993789.0,
                            "response": "The prob is the game will not be long term if the devs focus on the earning aspect.\n\nmaybe its time to leave then. the path forward is play & earn and play for fun. if you see this as an investment, take your loss",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i99ahe4",
                                    "author": "ShadowOrson",
                                    "score": 3,
                                    "created_utc": 1652999282.0,
                                    "response": "What?\n\nNever mind. You're a bot.\n\nhey u/MobTwo ,the comment I am replying to I suspect is bot/ai.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9ar65d",
                    "author": "abdul12131",
                    "score": 1,
                    "created_utc": 1653028510.0,
                    "response": "While this is one potential path to burn tokens, I find it to be one of the least elegant solutions.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}