{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uyp7z5",
            "title": "19 Year Old Pet Supplies Businesswoman accepts BCH! 🐶🦴",
            "url": "https://youtube.com/watch?v=07npcew1F_o&feature=share",
            "author": "BitcoinCashCity",
            "created_utc": 1653622858.0,
            "score": 67,
            "num_comments": 33,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "ia5i1c4",
                    "author": "BitcoinCashCity",
                    "score": 12,
                    "created_utc": 1653622933.0,
                    "response": "At 14 years old, Tianna Bloomfield was mowing a lawn with her dad when she came across a dog bone. They picked it up and said 'There's money to be made in dogs'. 🐶\n\nTianna's dad Andy, a single father raising Tianna and her 5 siblings, sat in his car for half an hour thinking about this then drove to a local butcher and purchased a large quantity of dog brisket bones. Tianna started selling the bones initially to raise money for her Netball Club then, like most ingenious ideas with consumer demand, the concept grew and grew. 🐕💰🦴 Once she graduated from high school and with the help of her dad, Tianna set up her business which has become so popular with locals that she is expanding into the shopfront next door to open up a fishing bait store. 🎣🐟\n\nAccepting Bitcoin Cash as payment in her Hungry Dog Pet Supplies business was a no brainer for Tianna.  👏🏼\n\nBitcoin Cash - Future currency for future generations.\n\n[https://www.facebook.com/Hungry-Dog-P](https://www.facebook.com/Hungry-Dog-P)...\n\n🎥 DigiRyder\n\n\\#BCH #BitcoinCashCity #HungryDogPetSupplies #futurecurrency #futuregenerations #youngentrepreneur #peer2peer #GenZ",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia67ksi",
                            "author": "a532933202",
                            "score": 9,
                            "created_utc": 1653641780.0,
                            "response": "Great new North Queensland BitcoinCash merchant.\n\nA young businesswoman applying sound money payments to her business is such a great example. Thanks for sharing.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia5l171",
                    "author": "EmergentCoding",
                    "score": 8,
                    "created_utc": 1653624628.0,
                    "response": "What a fantastic new BitcoinCash merchant. Thanks for sharing. In a single stroke, Tianna has future proofed her business.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia5myyl",
                            "author": "BitcoinCashCity",
                            "score": 10,
                            "created_utc": 1653625783.0,
                            "response": "Tianna is a forward-thinking individual with a very bright future ahead for her and her businesses. 😃",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia6hy81",
                                    "author": "kimolsen",
                                    "score": 7,
                                    "created_utc": 1653650301.0,
                                    "response": "Yeah , I wish a very good luck for her business . Cheers .",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "ia8m95m",
                            "author": "bfbntrnes",
                            "score": 6,
                            "created_utc": 1653685141.0,
                            "response": "What a great story of entrepreneurship on Bitcoin Cash .",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia80o5n",
                    "author": "pu4kov",
                    "score": 7,
                    "created_utc": 1653675437.0,
                    "response": "BCH price is holding up so well during this dump. Good luck to her .",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia876xw",
                    "author": "Warm-Top-4816",
                    "score": 7,
                    "created_utc": 1653678295.0,
                    "response": "Love to see this. Not been in the community for so long but i see BCH merchants in my area a lot and it's pretty dope. I'm a chronic holder but i do convert my shiryo at times to encourage them",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia8tc9c",
                    "author": "Caesar91core",
                    "score": 8,
                    "created_utc": 1653688531.0,
                    "response": "Bitcoin cash utility is what crypto was intended for . Cheers to her .",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia676h5",
                    "author": "bitcoinjason",
                    "score": 7,
                    "created_utc": 1653641419.0,
                    "response": "Anything is possible when you put your mind to it!!!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia7xp6s",
                    "author": "Responsible-Olive879",
                    "score": 6,
                    "created_utc": 1653674141.0,
                    "response": "great story of entrepreneurship on Bitcoin Cash",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia6ttpt",
                    "author": "aaj094",
                    "score": 0,
                    "created_utc": 1653657188.0,
                    "response": "How many payments did she receive in bch though?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia6wysg",
                            "author": "Dunedune",
                            "score": 1,
                            "created_utc": 1653658700.0,
                            "response": "Typically in the single digits",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iadcllt",
                                    "author": "bitcoinjason",
                                    "score": 3,
                                    "created_utc": 1653781910.0,
                                    "response": "Typical sales are between $20 to $50 per sale",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iadcvrq",
                                            "author": "Dunedune",
                                            "score": 1,
                                            "created_utc": 1653782063.0,
                                            "response": "I meant the yearly payment count",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iae0ry4",
                                                    "author": "bitcoinjason",
                                                    "score": 3,
                                                    "created_utc": 1653795651.0,
                                                    "response": "Well she is a new business her count this week was 5, curating her most businesses do let me know how they are travelling, some are seasonal like the Bloom room that had an increase of BCH sales from mothers day.\n\nOne grocery store owner told me that his bch sales were up too 5% of all transactions cash around 15% a drop and pay wave makes up the rest. \n\nRestaurant staff at billing showed me their transactions history and they were average $10,000 per month.\n\nSome do better than others that people who use a service often, then those like the helicopter ride service that just gets 1 or 2 a year.\n\nIts hard to tell the annual usage as I need to have all the details to make a report.\n\nI am working on a system to get the general outlook an usage of BCH so I can better a better curator in my region. \n\nI must say I'm a little disappointed with some of these keyboard warriors here that run their mouth with ignorance and do nothing to nurture and cultivate the use and adoption of bch.\n\nEveryone cheers and gets excited about a guy buying pizza with bitcoin,  I buy and live off it everyday and part of a effort for everyday people to disconnect from a fraudulent fiat system and myself and the businesses that genuinely accept bch peer to peer gets slammed labelled and told its a publicity stunt when its btc and lighting doing those stunts not us.\n\nAnyone can come here the Bitcoin Cash City and not need fiat, I'm doing it and others can too.. More and more Countries like saint kits are doing it making it more common than people realise.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "ia6xkrt",
                                    "author": "aaj094",
                                    "score": 1,
                                    "created_utc": 1653658986.0,
                                    "response": "Precisely. Because no one cares about paying with crypto. And yet BCH makes big noise about some merchants partaking in what is mainly a publicity stunt.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iadd4ei",
                                            "author": "bitcoinjason",
                                            "score": 3,
                                            "created_utc": 1653782195.0,
                                            "response": "You be surprised, granted there is a hodler mentally,  yet the user base of spenders are growing, sales come from tourists, tradesmen, other participating businesses and in this case dog owners who have bch they go there other than other businesses because she accepts bch.\n\nGuys like me who live 100% on bch so its no publicity stunt",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iaeu890",
                                                    "author": "aaj094",
                                                    "score": 1,
                                                    "created_utc": 1653819286.0,
                                                    "response": "But you haven't made a rational decision. Living 100% on bch has cost you a lot of money.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iaivk60",
                                                            "author": "bitcoinjason",
                                                            "score": 1,
                                                            "created_utc": 1653899480.0,
                                                            "response": "I am doing well, see i have been in this for a long time, I see the developments and the potential you don not see. People thought i was Nuts when i 1st started this journey now its a viable way of true money and exchange.\n\nI earn, I spend and I save all in Bitcoin Cash cost averaging is the key",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "iaizwz1",
                                                                    "author": "aaj094",
                                                                    "score": 1,
                                                                    "created_utc": 1653903456.0,
                                                                    "response": "How is cost averaging of any consolation with BCH? That only works if trajectory is overall stable or upwards. BCH is just a continous slide over time. Averaging hasn't helped mitigate the losses.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "ia6z1q3",
                                            "author": "Dunedune",
                                            "score": 0,
                                            "created_utc": 1653659669.0,
                                            "response": "This community now lacks critical thinking because everyone who doesn't left this sub",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}