{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "u44kak",
            "title": "Store Paper Wallet in a Smarter Way",
            "url": "https://www.reddit.com/r/btc/comments/u44kak/store_paper_wallet_in_a_smarter_way/",
            "author": "tommy737",
            "created_utc": 1650016498.0,
            "score": 3,
            "num_comments": 17,
            "subreddit": "btc",
            "selftext": "So, if you will ever store your mnemonic key in a physical paper. I suggest to use this technique. Download an offline QR code generator (I use one from softpedia). Convert each word into a png file which you will then import into a word file table as follows. So what's the idea behind this? Why not just write each word instead? So, each day you check for your paper wallet, if it's in place then you're safe but what if it's stolen? Then you will need to have more time to transfer the funds from your wallet to another one. Storing the words in QR codes guarantees that it's not human readable, the thief must qr code scan each word to be able to unlock the wallet. This should give you some time ahead to transfer the funds (in case you are still alive). Of course I am assuming that the paper is not the only way you store your keys and you have a backup in an ecnrypted password cloud storage service.\n\nhttps://preview.redd.it/go0cyf7i0ot81.png?width=744&format=png&auto=webp&s=73f9fd338d5cf2ef0c65a99a32452e61ca0d3092",
            "stickied": false,
            "comments": [
                {
                    "id": "i4tjabb",
                    "author": "Remora_101",
                    "score": 12,
                    "created_utc": 1650022579.0,
                    "response": "This does not help for various reasons:\n\n1. Scanning QR code takes seconds\n2. He can just take a photo and decode later.\n3. You can't spot when the code has been taken.\n\nMuch better to encapsulate your seed so that the attacker needs to break in to get it. Glue your piece of paper. Put it in an case and glue it. Doesn't matter as soon as the attack has to destroy something you can spot that the seed was taken 100%",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4tm1ev",
                    "author": "moleccc",
                    "score": 7,
                    "created_utc": 1650024321.0,
                    "response": "Here's a better idea against theft risk: use encrypted paper wallet. \n\nOnly downside: you need to remember the encryption password.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uhot9t",
            "title": "Joe Rogan is hyping the ruined BTC shitcoin again - drop by in the comment section to educate the unsuspecting pleb",
            "url": "https://www.youtube.com/watch?v=qZwaDUBAPcE",
            "author": "WippleDippleDoo",
            "created_utc": 1651608748.0,
            "score": 8,
            "num_comments": 15,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i77nkei",
                    "author": "Pablo_Picasho",
                    "score": 9,
                    "created_utc": 1651613590.0,
                    "response": "Can we not stoop to the toxic maxi level of discourse that labels things \"shitcoins\"?\n\nTo the average crypto user this isn't eye-opening, it's off-putting and we won't win them over to the real peer to peer electronic cash experience like that.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "ui0mzp",
            "title": "May the 4th be with you",
            "url": "https://i.redd.it/8azhgr4mpex81.jpg",
            "author": "user4morethan2mins",
            "created_utc": 1651647211.0,
            "score": 35,
            "num_comments": 21,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i79more",
                    "author": "cheaplightning",
                    "score": 10,
                    "created_utc": 1651650981.0,
                    "response": "That is a big spike.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7agi65",
                            "author": "minghaizai",
                            "score": 3,
                            "created_utc": 1651671237.0,
                            "response": "I mean yeah, that's a pretty big spike, is it recent?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i79opcb",
                    "author": "NilacTheGrim",
                    "score": 6,
                    "created_utc": 1651652742.0,
                    "response": "What is the explanation? Today's price movements?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i79p9bn",
                            "author": "cheaplightning",
                            "score": 7,
                            "created_utc": 1651653227.0,
                            "response": "Too localized. I assume testing something.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i7a01ks",
                            "author": "Indean8",
                            "score": 3,
                            "created_utc": 1651662235.0,
                            "response": "I don't see a spike in today's chart tho, what chart that is?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7b0i6r",
                    "author": "ErdoganTalk",
                    "score": 3,
                    "created_utc": 1651679544.0,
                    "response": "Powerful force behind that title",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7a0vi8",
                    "author": "ItsCollinT",
                    "score": 3,
                    "created_utc": 1651662801.0,
                    "response": "What's that spike? I think it's something that has happened in the past, it's not about now.\n\nI don't think that has happened in the bch in a long time. I think it's From the past. And it's kinda fitting a narrative.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uhxpip",
            "title": "When you know, you know",
            "url": "https://v.redd.it/ird6gra9bax81",
            "author": "Turnip_Salesman6285",
            "created_utc": 1651635525.0,
            "score": 174,
            "num_comments": 107,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i790ahc",
                    "author": "DuncanWhiteLDP",
                    "score": 47,
                    "created_utc": 1651635788.0,
                    "response": "Wow! This lady understand more than most in crypto.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i799u9r",
                            "author": "YummaySmoohie",
                            "score": 14,
                            "created_utc": 1651641218.0,
                            "response": "This lady invented crypto",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7a2a99",
                                    "author": "Bohgos",
                                    "score": 8,
                                    "created_utc": 1651663715.0,
                                    "response": "She's serious dude. She ain't playing around. She knows her shit.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i79tlh9",
                    "author": "KiruNarch",
                    "score": 15,
                    "created_utc": 1651657121.0,
                    "response": "Not wrong, but at the same time, the more bitcoin will be known the more it will be easy to be able to use it without centralized exchange platforms.  \n\n\nAt first it was utterly difficult to exchange bitcoins against fiat currencies or consumer goods because it was not adopted. The more it is adopted, the more people will use bitcoin wallets and not exchange platforms.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7a2j5b",
                    "author": "ramirezdoeverything",
                    "score": 14,
                    "created_utc": 1651663871.0,
                    "response": "Exchanges are centralised yes. Don't keep your decentralised crypto currency in a centralised exchange and this ladies argument falls apart",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7ba8lg",
                            "author": "AmericanScream",
                            "score": 3,
                            "created_utc": 1651683480.0,
                            "response": "Not at all.  Because whether you keep crypto in a CEX or not, you're still measuring the value of your crypto in fiat, based on a number that is published by the exchanges.   And this number is largely an illusion, created by the pumping and wash trading of more than $160B in unsecured stablecoins.\n\nSo no matter where your coins are, their \"value\" is set by the CEXs.  And with the exception of a few online illegal drug stores and some coffee shops in some third world island nation, you have to convert your crypto to fiat to realize any value, and once again, that requires a CEX.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7cbqct",
                                    "author": "dnick",
                                    "score": 5,
                                    "created_utc": 1651698072.0,
                                    "response": "That is a growing pain, and something that is all but inevitable for a new technology.  There's no way for a new thing to replace an old thing without a transition period, and something as complex and difficult to understand as crypto will have a longer transition period than color tv vs black and white.  The fact that comparisons fluctuate widely right now is a function of human nature, not on the underlying usefulness of the technology and there will be an exchange rate (dictated by people more than exchanges) for the forseeable future, but that will be the case until fiat is measured against crypto instead of the other way around until/unless fiat goes away completely.  Fiat is too universally familiar to expect it's replacement to be like a light switch.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i79g528",
                    "author": "yes5262021",
                    "score": 19,
                    "created_utc": 1651645632.0,
                    "response": "She ain’t wrong",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7a7zke",
                    "author": "jaredx3",
                    "score": 12,
                    "created_utc": 1651667049.0,
                    "response": "She thinks she knows but she doesn't. Keep your coins off exchanges. They can manipulate all they want at end of the day supply will continue to dwindle and those that hodl will be empowered",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i79w80p",
                    "author": "LovelyDayHere",
                    "score": 13,
                    "created_utc": 1651659359.0,
                    "response": "That doesn't make _Bitcoin_ a scam, although it is very easy to see how most people will reach that base conclusion.\n\nIf anything, it makes whatever is sold as Bitcoin (i.e. tokens on centralized exchanges which very likely do fractional reserve) a scam. Just like fiat money is a \"scam\" in that sense (centralized, inflatable at will, censorable, favoring those who control the issuance etc)\n\nIt comes down to people not _really_ using Bitcoin, but accepting substitutes. And of course in some cases, thinking the purpose of Bitcoin is number go up in fiat money terms.\n\nThe effective psyop is making people believe that _that_ is using Bitcoin. \"Muh store of value\", \"muh digital gold\", \"muh exchange tokens\".\n\n---\n\nI must point out that in all of the above, the usage of the word 'scam' is far too loose, it's basically pop culture in the cryptosphere, but these are not scams in a stricter sense and a lot of people actually disapprove of applying the term 'scam' too loosely. Caveat emptor.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i79l4ey",
                    "author": "localether",
                    "score": 10,
                    "created_utc": 1651649640.0,
                    "response": "The mistake is underestimating the scarcity and how much more it will go up. Nobody needs to get scammed out of thousands of dollars. If you buy and hold some portion (and actually use some as well), you will most likely make a very good return as per the 13 year history to date (an excellent indicator).\n\nOtherwise.... HFSP in your one piece.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i79k0u9",
                    "author": "bitmeister",
                    "score": 5,
                    "created_utc": 1651648713.0,
                    "response": "We know too, but face it, most of us can't pull off a one-piece.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uhw6yn",
            "title": "Why use Bitcoin cash? my 5 important points. (My opinion) ENGLISH/ESPAÑOL",
            "url": "https://read.cash/@Bitcoincashtrue/why-use-bitcoin-cash-my-5-important-points-my-opinion-enes-917fd188",
            "author": "LowIndividual3126",
            "created_utc": 1651630469.0,
            "score": 14,
            "num_comments": 11,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uhuuso",
            "title": "Request for feedback on my critique of \"The Bitcoin Standard\" by Saifedean Ammous",
            "url": "https://www.reddit.com/r/btc/comments/uhuuso/request_for_feedback_on_my_critique_of_the/",
            "author": "fatalglory",
            "created_utc": 1651626244.0,
            "score": 15,
            "num_comments": 23,
            "subreddit": "btc",
            "selftext": "I have written a fairly pointed critique of Ammous' book \"The Bitcoin Standard\". In my critique, I basically argue that the 1MB block size cap in BTC makes it a terrible reserve asset for free banking, because the block size cap makes it virtually impossible for consumers to execute a \"bank run\" on a Bitcoin bank.\n\nI haven't seen this point argued anywhere else. Before I start pushing it more broadly, I wanted to post it here and ask for feedback. Is my logic sound? Or am I missing something?\n\nAnyone interested in Austrian economics will hopefully find the article interesting, whether or not you agree. Thanks in advance for any thoughts.\n\n[https://www.cryptoforconservatives.com/blog/20220228-the-bitcoin-standard-destined-to-fail/](https://www.cryptoforconservatives.com/blog/20220228-the-bitcoin-standard-destined-to-fail/)",
            "stickied": false,
            "comments": [
                {
                    "id": "i78wtwn",
                    "author": "Knorssman",
                    "score": 10,
                    "created_utc": 1651634054.0,
                    "response": "A sudden spike in demand for transactions such as a bank run really does look like the worse case scenario for BTC that I hadn't considered before. And I'm sure the banks would appreciate such a bottleneck on transaction capacity",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i79eh1m",
                    "author": "AmbitiousPhilosopher",
                    "score": 7,
                    "created_utc": 1651644394.0,
                    "response": "Good write up. One problem with LN is that if there is a mass channel shut down at the same time, many poor channels will be wiped by the spike in onchain fees. Ultimately, any Bank can only work in a market based way if there is the possibility of a bank run, and the only way you can make it possible is if it is easy to withdraw the money.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7ao2fi",
                    "author": "jessquit",
                    "score": 4,
                    "created_utc": 1651674516.0,
                    "response": "This is one of the best things I've read in a long, long time.  In fact I doubt I can find it but I remember reading a Gmax argument a long time ago in which he very clearly pointed out that the block size limit reduces the ability to conduct a bank run (in the context of that being a good thing).  It didn't feel right when I read it but it didn't occur to me until now why that's a bad thing.  After many years I now understand the counterargument.  It will take a while to assimilate it into my thinking, because it is indeed critical. \n\nAlso your handy treatment of LN is extremely salient.  If in fact Bitcoin BTC becomes the world standard settlement system then it becomes prohibitive for almost anyone to run an LN wallet trustlessly.  And even if you could run a trustless wallet, who would you be connecting to and routing through?  *The banking system.*\n\nThanks so much for this.\n\n/u/chaintip",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7asl4h",
                    "author": "LovelyDayHere",
                    "score": 3,
                    "created_utc": 1651676344.0,
                    "response": "> Since Bitcoin cannot scale (on the main chain) to accommodate peer-to-peer payments for billions of people\n\nand\n\n> Bitcoin can't scale for peer to peer transactions without a banking layer\n\nI think you mean BTC when you write Bitcoin. I understand why you would not want to write \"Bitcoin (BTC)\" in every place where you make this statement in this article, but it would be more correct because the general statement is unproven and Bitcoin (Cash) or some other Bitcoin derived coin might well prove it wrong in future.\n\n__The article is good, but swallowing the small blockers' main premise without labeling it as a hypothesis (or axiom in their case) makes the argument presented against the Bitcoin Standard here seem incomplete to me.__ It could even be just a footnote indicating that this claim against on chain scalability of the protocol is still in dispute.\n\nI'm not even going to cite Satoshi's view on the scalability of the base protocol, they're well known to everyone ;-)\n\nBut let's look at the minimum of 1B people doing 1 cash transactions each per day at ~220b/tx, that requires ~1.5Gb blocks. It's not out of the realm of the possible, quite the contrary. People have run [1GB Bitcoin Cash blocks](https://read.cash/@mtrycz/how-my-rpi4-handles-mining-1gb-blocks-e5d09d83) on a Raspberry Pi on the scaling testnet, not even commodity desktop PC much less server level hardware. Another Bitcoin-derived blockchain has run multi-GB blocks albeit I would not lend my full credence to their methodology as being representative of cash transactions on an open Bitcoin network.\n\nMy point is : blocks of a couple GB are not out of reach by any means. That would accomodate billions of people doing a single tx per day, and strictly speaking, would cover what your article currently claims is not achievable.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uhvywp",
            "title": "Lobster BCH!!! (Bitcoin Cash is by far the easiest crypto to use and accept for retail merchants)",
            "url": "https://v.redd.it/37cahpam9dx81",
            "author": "MemoryDealers",
            "created_utc": 1651629762.0,
            "score": 80,
            "num_comments": 36,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i78nq1m",
                    "author": "MemoryDealers",
                    "score": 21,
                    "created_utc": 1651629846.0,
                    "response": "Any business can start accepting BCH in less than 2 minutes, with NO SIGNUP required thanks to the [Bitcoin Cash Register App](https://www.bitcoin.com/bitcoin-cash-register/), or [POS.CASH](https://POS.CASH)   \n\n\nPeople should also try sharing this video and links across other crypto sub reddits.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i78sg91",
                    "author": "big--if-true",
                    "score": 13,
                    "created_utc": 1651631971.0,
                    "response": "Would be awesome to have community style economies where people do lots of trades, which is what money is for. No need for inflation tax or government control.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i79lwkx",
                            "author": "krisdries",
                            "score": 7,
                            "created_utc": 1651650312.0,
                            "response": "The fact that we see more and more merchants being thus so adaptive to Bitcoin Cash.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i78tla0",
                    "author": "Br0kenRabbitTV",
                    "score": 8,
                    "created_utc": 1651632497.0,
                    "response": "Is it just me or is Reddit terrible at displaying videos? Recently, I've been constantly getting videos breakup and not display properly after a few seconds, well specced PC, Firefox.\n\nLike they are running at 2FPS.\n\nNice to see some more adoption, anyway.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i79i2wv",
                    "author": "installgen4",
                    "score": 5,
                    "created_utc": 1651647137.0,
                    "response": "That is indeed pretty fast indeed long way to go and much more adoption is on it's way.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i799472",
                    "author": "fiendishcrypro",
                    "score": 5,
                    "created_utc": 1651640748.0,
                    "response": "Go Rolando Brison! How awesome is that, and MP enjoying a meal out all paid for by p2p decentralised payments Bitcoin Cash.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i79b0e6",
                    "author": "PublicCurrency9039",
                    "score": 3,
                    "created_utc": 1651641986.0,
                    "response": "If a picture, (video), is worth a thousand words, then this beautiful meal, says it all!! Time, and time again, BCH demonstrates it’s ease of use in commerce!!! It’s fast, cheap, reliable, and is the future!!!",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "ui1fv6",
            "title": "Knuth Node (KTH) is a Python library Flipstarter, less then 1 day left!",
            "url": "https://www.reddit.com/r/btc/comments/ui1fv6/knuth_node_kth_is_a_python_library_flipstarter/",
            "author": "chainxor",
            "created_utc": 1651650766.0,
            "score": 25,
            "num_comments": 16,
            "subreddit": "btc",
            "selftext": "[https://fund.kth.cash/?id=13](https://fund.kth.cash/?id=13)   \n\n\n70.85 */* 120.00 BCH, less than 1 day left!   \n\n\nJust like Verde, The Knuth team has made a number of important contributions to BCH, herein important optimizations and of course the high performant Knuth node.   \nHaving Knuth node as Python library sounds like a good way to get BCH development into more hands, since Python is much easier to code in for a lot of people.",
            "stickied": false,
            "comments": [
                {
                    "id": "i7ab9jb",
                    "author": "Bagatell_",
                    "score": 9,
                    "created_utc": 1651668743.0,
                    "response": "The campaign has been funded.\n\nWell done Knuth Node!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7axniw",
                            "author": "chainxor",
                            "score": 6,
                            "created_utc": 1651678352.0,
                            "response": "That was fast 😂",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}