{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ogij2x",
            "title": "⚠️ Celsius Network WARNING ⚠️ 🚩",
            "url": "https://www.reddit.com/r/btc/comments/ogij2x/celsius_network_warning/",
            "author": "Tyranoc4",
            "created_utc": 1625784770.0,
            "score": 56,
            "num_comments": 87,
            "subreddit": "btc",
            "selftext": "This is a warning for all current clients and people thinking join [Celsius Network](https://celsius.network/).I learned the hard way that lending plateforms are not trustable at all.They say they support decentralisation and freedom etc... THEY DON'T. All they want is more (your) money.Celsius created hodl mode for clients that want a \"security\" so a hacker can't withdraw everything instant and will need at least 24 hours to deactivate it and 24 more to change withdraw address.Once again all of these measures aren't for your protection but for them to keep your money longer (as banks do).So the hodl mode wasn't created to help celsius clients but for the sole purpose of blocking clients funds at their will (with or without their consent).\n\nFreezing account COULD be ok for legal reason not for personal reason of a staff member.\n\n\\*\\*So what happened exactly?\\*\\*Withdraws on celsius are free and seems to be unlimited. So I wondered if there was a limit, even a big limit to avoid spam and what's celsius policy about lot of withdraws.So before doing anything I asked on the telegram group these questions politely.An admin nicked \"Xineohp\" answered me “Don’t abuse the system” several times pretty aggressively. I said it wasn't multiple times too but he didn't seem to understand and told me to contact support.So I proposed to contact support to ask them directly and maybe show a potential flaw so they can patch it.So in view of the aggressiveness I decided to not do any batch withdraw and just make a single withdraw. Just withdraw MY funds peacefully.\n\n*few minutes later*Before take my phone in my hand I got a notification from celsius app \"We activated HODL mode on your behalf\" and my mom got the SAME.So the guy seems to have search for me in clients files based on my telegram username AND ip to link to my mother (which live in same home) to completely freeze us.\n\nAsking questions politely is not a reason to block ME and all my family members. Even worse as anybody could use your nickname on telegram, so anybody could say anything using your name and your money get frozen. So that could be someone else than me!\n\nWhen I said \"Celsius team forced all mode on my wallet\" I got muted from the group by the same admin \"to avoid FUD spread\". FACTS are here.\n\nI did a thread on twitter that was ignored by influencers I tagged which prefer share their referrals and make money than warn their community. I also tagged CEO which is active on twitter (maybe he isn't aware of these internal practises?) but he played blind too.I tagged cointelegraph writers and proposed to tell them more about al lof this but I wasn't contacted. Probably the same reason again, not financially interesting. If I'm not wrong they are paid to write about companies, why would they write a free article warning ppl?I contacted the admin the again which doesn't denyed anything but just answered\n\n`I do not want FUD in the chat. Celsius placed you in HODL mode because of your actions.`\n\n`I'm no longer going to communicate with you. Please communicate directly with Celsius via support email at` [`app@celsius.network`](mailto:app@celsius.network)`.`Then I contacted another admin of that group and described all of this and after insistance I got that answer:\n\n`I have just heard back from support and they said they will be in contact with you about your account`then no way to get any response from him either and of course refuse to unmute me too.\n\nThe so called support doesn't answer since more than 72 hours now and I have serious doubt getting answer anytime soon, telegram muted and telegram group admins refusing to answer anymore.Celsius often give welcome bonus to get more clients, they once proposed to do review on App Store/Play Store/TrustPilot in exchanges of bonus (20$ crypto if I remember well).\n\nCryptocurrencies have a bad reputation because it's often related to scam, rug pull, ponzi schemes AND exit scams.My family members don't want to hear about crypto anymore after about -50% and now plateform blocking us just because a staff member doesn't like me.From my side I hope to get our accounts unfrozen asap so if I still have that right I'll withdraw everything and uninstall the app forever if not I will sue them. My family members will market sell asap because as I said they're now disgusted of crypto.\n\nFor current and potential futures clients of Celsius you are free to listen that warning, you can't get a worse red flag than this. I you absolutely want a lender I may redirect you to [Nexo](https://nexo.io/).You should think twice before depositing anything on Celsius.\nI’ll update this post as soon as (if?) I get an official answer from them.\nMy DM are open for any journalist that would like more infos about this.  \n\n\n[In-app warning](https://preview.redd.it/bewxcf71j2a71.png?width=1242&format=png&auto=webp&s=04f32ff1193b1b630741f8f08433006724a58a03)\n\n[e-mail received](https://preview.redd.it/zqagra22j2a71.png?width=632&format=png&auto=webp&s=92a9e43ca921ec341966b628549b4684001d960d)",
            "stickied": false,
            "comments": [
                {
                    "id": "h4jdwpa",
                    "author": "ATHSE",
                    "score": 9,
                    "created_utc": 1625791416.0,
                    "response": "Good to know there's so much human intervention... that alone makes your account as unsafe as a facebook account (I just got banned, and they are going to ignore the appeal forever).\n\nI hold some CEL on Bittrex purely because it seemed like a contrarian holding, moving independently of BTC and the general alts. I do not plan to hold beyond trading or stake any.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "h4je7jd",
                            "author": "Tyranoc4",
                            "score": 3,
                            "created_utc": 1625791575.0,
                            "response": "This coin is going the opposite way of the market most of time. That’s weird too",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "h4jydyr",
                    "author": "WiseAsshole",
                    "score": 7,
                    "created_utc": 1625802484.0,
                    "response": "That's why you should stick to decentralized currencies only. Sorry for your loss.\n\nu/chaintip",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "h4jyt98",
                            "author": "WiseAsshole",
                            "score": 3,
                            "created_utc": 1625802739.0,
                            "response": "/u/tibanne is the chaintip bot down?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "h4kl2ub",
                                    "author": "Tibanne",
                                    "score": 4,
                                    "created_utc": 1625820345.0,
                                    "response": "Looks like the node went down (no idea why)... I've put it back up now... let me know if it stops working again.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "h4laq0p",
                    "author": "SpecialForse",
                    "score": 6,
                    "created_utc": 1625838910.0,
                    "response": "Just wanted to make people aware before they deposit anything",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "h4j3oev",
                    "author": "Terrible_Bid2021",
                    "score": 13,
                    "created_utc": 1625785991.0,
                    "response": "Nasty. Why not posting that in the Celsius sub?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "h4j4btk",
                            "author": "Tyranoc4",
                            "score": 11,
                            "created_utc": 1625786318.0,
                            "response": "Would be deleted/censored as they did in the telegram group. I want to warn people before they deposit anything too",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "h4klx3j",
                    "author": "liqfan",
                    "score": 3,
                    "created_utc": 1625821157.0,
                    "response": "I used them for a while, got out of it quick. Besides what you mentioned there is\n\n\\- No full security on your funds, they lend it out to third party and it's only insured up to a specific number, exactly like banks work. If it goes down the shitter they'll just be yeah it was in the T&C. \n\n\\- Limits in place although it's unlimited. They say it's because they only have a limited amount available in the hot wallet but I doubt that as I wasn't withdrawing hundreds of thousands. \n\n\\- Completely centralized",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "h4kv6b0",
                    "author": "doramas89",
                    "score": 3,
                    "created_utc": 1625829347.0,
                    "response": "It is beyond my comprehension why this kind of centralized poop projects have any value at all. The world is upside down.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}