{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uw8lq5",
            "title": "BTC is red for 8 weeks now. Do you think BTC touched the bottom?",
            "url": "https://www.reddit.com/r/btc/comments/uw8lq5/btc_is_red_for_8_weeks_now_do_you_think_btc/",
            "author": "Becneldjh",
            "created_utc": 1653335174.0,
            "score": 0,
            "num_comments": 2,
            "subreddit": "btc",
            "selftext": "In two months, a lot can happen in the cryptocurrency world, and it did for bitcoin. The asset was at $50,000 at the end of March, and just as the community expected a rally to that level, the landscape shifted, and BTC reversed course, heading for its longest weekly losing streak.   \n \n\nTwo weeks ago, CryptoPotato claimed that bitcoin has tied the previous negative record with six consecutive red candles. It shattered it last week after dropping $15,000 at one point, and the problem has only gotten worse since the weekly shutdown hours ago.   \n \n\nBTC completed the week at little over $30,000, according to Bitstamp statistics, making it eight consecutive weekly candles in the red.   \n \n\nWith bitcoin presently in the green, the start of the new trading week has been somewhat more optimistic. The bears, on the other hand, still have time to return to the scene and continue their losing run. Do you think it's the time for alts to skyrocket?   \n \n\nNow, this is the time for decisions. Are you going to believe in BTC as strong as you believed in it when it was all over the news for its insanely high prices, or are you going to exit the market and chill for a while? Both options are completely fine, it's good to rest a little bit, it's not easy to be in such a turbulent market tbh. I'm combining both, so my BTC savings are going straight to ETH since I'm a sucker for NFTs - communities like High Sloth Society, BAYC, CryptoPunks, etc. :). What move are you making?",
            "stickied": false,
            "comments": [
                {
                    "id": "i9q7444",
                    "author": "Remora_101",
                    "score": 3,
                    "created_utc": 1653338530.0,
                    "response": ">What move are you making?\n\nBuying more BCH :) And trying to finally get a crypto CC so that I can spend more BCH",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9q8yqb",
                    "author": "hero462",
                    "score": 1,
                    "created_utc": 1653339335.0,
                    "response": "BTC has a lot of troubles from a fundamentals perspective.  I don't like investing in hype.  I'm with Remora, and buying up BCH at sale prices, and then spending and replacing whenever I can.  We're not watching trend lines on a chart, we're trying to build an economy that can serve and benefit the world.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}