{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uy4pkr",
            "title": "Let crypto go into capitulation mode or not? Where’s our saviour? Last line of support, please stand up. I an so ready! hype hype!",
            "url": "https://www.reddit.com/r/btc/comments/uy4pkr/let_crypto_go_into_capitulation_mode_or_not/",
            "author": "hdn3007",
            "created_utc": 1653561642.0,
            "score": 1,
            "num_comments": 0,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uy4hip",
            "title": "Help! Can anyone help me get rid of my USDT on BCH blockchain?",
            "url": "https://www.reddit.com/r/btc/comments/uy4hip/help_can_anyone_help_me_get_rid_of_my_usdt_on_bch/",
            "author": "keshav_thebest",
            "created_utc": 1653560694.0,
            "score": 9,
            "num_comments": 10,
            "subreddit": "btc",
            "selftext": "Hi, if anyone remembers my previous post here, I have been stuck with around $1k in USDT on BCH for a while now. The exchange I used to get my hands on it to begin with was Sideshift, but they have removed the coin. I contacted both them and my wallet (Bitcoin.com) to see what my options were. Turns out Bitfinex is the only place I can exchange at.\n\nProblem is Bitfinex requires intermediate level of verification to exchange stablecoins. I am not interested in doing KYC there since  the regulation around crypto is very confusing in my country right now so I don't wanna mess with stuff until some clarity is there.\n\nSo this is where I need help: Is anyone willing to take the USDT off my hands and converting it themselves? (I am willing to keep it as favorable for you as possible; I will give you a discount of $100. We will use the marketplace at memo.cash for doing the deal so no one will be scammed).\n\nPlease PM me if you are interested! \n\nThanks",
            "stickied": false,
            "comments": [
                {
                    "id": "ia1w4p9",
                    "author": "Remora_101",
                    "score": 5,
                    "created_utc": 1653564238.0,
                    "response": "I just checked, I have no way of selling USDT. Sorry :( This is a shitty situation.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia1sbyq",
                    "author": "Deminero30",
                    "score": 5,
                    "created_utc": 1653561539.0,
                    "response": "SLP- USDT?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia1symo",
                            "author": "keshav_thebest",
                            "score": 4,
                            "created_utc": 1653562013.0,
                            "response": "Yeah",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia1yy3c",
                                    "author": "Deminero30",
                                    "score": 1,
                                    "created_utc": 1653566025.0,
                                    "response": "How to ensure transparency and that this isn't a scam?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia1zuv5",
                                            "author": "keshav_thebest",
                                            "score": 1,
                                            "created_utc": 1653566583.0,
                                            "response": "Well, we will be doing the exchange on memo.cash. It's a decentralized marketplace with non-custodial wallets, I will be putting the coins up for sale there. We can chat on Discord through the process to keep things transparent and clear.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia1tsn4",
                    "author": "LovelyDayHere",
                    "score": 3,
                    "created_utc": 1653562625.0,
                    "response": "Perhaps you can put it up for exchange to BCH on the memo.cash DEX .\n\nIf that's still operational (I didn't check).\n\nMight be hard to find buyers though. If you're not in a hurry though, it might be an option.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia1tzfo",
                            "author": "keshav_thebest",
                            "score": 2,
                            "created_utc": 1653562763.0,
                            "response": "Yeah, I have checked that place out, but as you guessed, there doesn't seem to be any demand for USDT there. I talked to an admin there and he suggested me I try to find a buyer from outside, hence why I mentioned the marketplace in this post.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia1u5xe",
                                    "author": "LovelyDayHere",
                                    "score": 2,
                                    "created_utc": 1653562887.0,
                                    "response": "Oh haha, I only read the first half of your post so I didn't catch that you already proposed a swap via Memo.\n\nGood luck!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}