{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uqqg2t",
            "title": "My biggest concern about BCH is that darknet drug dealers don’t accept it.",
            "url": "https://www.reddit.com/r/btc/comments/uqqg2t/my_biggest_concern_about_bch_is_that_darknet_drug/",
            "author": "Sugarbird676",
            "created_utc": 1652686839.0,
            "score": 0,
            "num_comments": 4,
            "subreddit": "btc",
            "selftext": "I first started paying attention to bitcoin in the Silk Road days, and very early on, when people would say that bitcoin is backed by nothing, I thought it was backed by drugs. I don’t value heroin any more than I value gold. I am not a jeweler or addict, but I know someone always values these things and will trade money for them, and if someone can use bitcoin to buy them, then via the transitive property, bitcoin is worth money. As long as it can be used to obtain something of value, and especially if it is the only or best way to obtain that thing, then it has value.\n\nWe say we want to build parallel economies, but those economies tend to be outlawed. So something that can continue to exist and be used in the face of being outlawed is truly resilient. We focus on means of exchange over store of value, but people need to value your thing in order to trade with you.\n\nSo, why do you think there are no BCH darknet markets? Would widespread awareness of Cash Fusion change this?",
            "stickied": false,
            "comments": [
                {
                    "id": "i8stdc4",
                    "author": "Redhead_Empire",
                    "score": 5,
                    "created_utc": 1652693021.0,
                    "response": "Most darkened markets are monero only. One of if not the most bullish use case for the coin",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ss76w",
                    "author": "Phptower",
                    "score": 3,
                    "created_utc": 1652691945.0,
                    "response": "Piratebay is also a BTC maxi (core). What a shame! I use them a lot but it's just irrational.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8srned",
                    "author": "MobTwo",
                    "score": 4,
                    "created_utc": 1652691453.0,
                    "response": "lol, if you're a drug addict, this is your chance to shine. Ask your friendly neighborhood drug dealer to accept Bitcoin Cash!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8sw85m",
                    "author": "LovelyDayHere",
                    "score": 2,
                    "created_utc": 1652695582.0,
                    "response": "Once all the non-drug-dealer establishments accept Bitcoin Cash, where are the drug dealers going to buy regular goods?\n\nThat's why I don't see a problem with not focusing on the dark markets. At all.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uqqb9w",
            "title": "Do you feel weird that this upgrade was without drama? We BCH community used to be full of drama.",
            "url": "https://www.reddit.com/r/btc/comments/uqqb9w/do_you_feel_weird_that_this_upgrade_was_without/",
            "author": "No-Bookkeeper4061",
            "created_utc": 1652686255.0,
            "score": 0,
            "num_comments": 3,
            "subreddit": "btc",
            "selftext": "\n\n[View Poll](https://www.reddit.com/poll/uqqb9w)",
            "stickied": false,
            "comments": [
                {
                    "id": "i8sn5f7",
                    "author": "BewareOfShills",
                    "score": 7,
                    "created_utc": 1652687366.0,
                    "response": "Smells like concern trolling. If there is no drama, lets at least talk about past drama.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8snlsz",
                            "author": "user4morethan2mins",
                            "score": 6,
                            "created_utc": 1652687773.0,
                            "response": "Not the first time OP has tried this. [fake drama](https://www.reddit.com/r/btc/comments/uiee37/lots_of_btc_supportors_are_having_war_with_elon/i7cgbyk?utm_medium=android_app&utm_source=share&context=3)\n\n>You already created one drama-stirring post about Elon & BCH today. Why not engage in your original post? LovelyDayHere",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8sxy8j",
                    "author": "Br0kenRabbitTV",
                    "score": 1,
                    "created_utc": 1652697020.0,
                    "response": "What type of dumb poll is this, where is the simple \"Yes\" option?",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}