{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "usopez",
            "title": "Calling BCH Folks",
            "url": "https://www.reddit.com/r/btc/comments/usopez/calling_bch_folks/",
            "author": "MobTwo",
            "created_utc": 1652913357.0,
            "score": 34,
            "num_comments": 30,
            "subreddit": "btc",
            "selftext": "Luna has a big community and obviously that crypto is pretty much done. Let's invite over their ecosystem developers and good folks from there into Bitcoin Cash. Invite them over nicely without prejudice. We have a community here who would want to use their products (on BCH or SmartBCH network). We have a community here who would welcome them. /r/terraluna\n\nWe need to bring more people into the BCH economy. Not just Luna but all the failed crypto ecosystems out there. I can't do it alone. Let's do it together and make our community bigger.",
            "stickied": false,
            "comments": [
                {
                    "id": "i94ui5j",
                    "author": "ShadowOrson",
                    "score": 22,
                    "created_utc": 1652914785.0,
                    "response": "I'm going to be the negative nelly.\n\n> Luna has a big community\n\nSure. Bots, moonbois, WSB morons, etc. Not exactly the types this community supports, usually.\n\n> Let's invite over their ecosystem developers\n\nWhy? So they can fuck up this project?\n\n>  Let's invite over their... good folks from there into Bitcoin Cash.\n\nWhy? If they wanted to be part of this community they would already be a part of this community.\n\n> Invite them over nicely without prejudice.\n\nGood luck with that. I hope you don't expect there to be 0 prejudice if they do decide to come over.\n\n> all the failed crypto ecosystems out there. \n\nThey usually fail for good reasons. Nothing stopped them from being members of this community before or after. They'll likley prefer to move on to some other get-rich-quick scam, instead of true p2p electronic cash.\n\nI think I'll leave with just saying the above.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i955i6u",
                            "author": "hero462",
                            "score": 8,
                            "created_utc": 1652919972.0,
                            "response": "I gotta believe there's some good folks in the community that  just latched on to Terra because it was the first thing they were introduced to.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i95drum",
                                    "author": "ShadowOrson",
                                    "score": 6,
                                    "created_utc": 1652923845.0,
                                    "response": "Hey, I'm not saying there is no chance, though I do believe the amount of \"good folks in the Luna community\" may not as large think it is. I believe that anyone involved in the Luna community, expecting ridiculous ROI, is what makes the entire crypto-sphere look bad. You get them here, expecting ridiculous ROI on BCH backed stablecoins, and I expect the same thing will happen.\n\nI could be wrong though. Prove me wrong. I look forward to it.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i96r8t6",
                                            "author": "hero462",
                                            "score": 1,
                                            "created_utc": 1652957688.0,
                                            "response": "I definitely agree that the \"good folks in Luna\" are the minority.  That subreddit is a cesspool right now.  I'll keep reaching out when I see opportunities.  If I get a convert I'll introduce you;) lol",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i94uy7u",
                            "author": "MobTwo",
                            "score": 11,
                            "created_utc": 1652914990.0,
                            "response": "How do you expect to grow to be world money if you only include people you like to be in your community?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i95cria",
                                    "author": "ShadowOrson",
                                    "score": 8,
                                    "created_utc": 1652923378.0,
                                    "response": "Eric, we're going to disagree on things, this is one of them. \n\n> How do you expect to grow to be world money if you only include people you like to be in your community?\n\n(1) I believe your question is ridiculous.\n\n(2) I am not BCH, p2p electronic cash\n\n(3)  I do not speak for BCH, p2p electronic cash\n\n(4) BCH, p2p electronic cash, grows to be \"world money\" by being the best at p2p electronic cash.\n\nI see no reason to support or welcome moonbois, WSB morons, or others like them. It is my opinion that they are not in the crypto space for the same reasons I am in it, and likely not the same reasons you are in it.\n\nI have no problem with anyone being in this community that actively supports BCH, p2p electronic cash.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i97qfmx",
                                            "author": "CurvyGorilla202",
                                            "score": 0,
                                            "created_utc": 1652975171.0,
                                            "response": "One can be a moon boi, rocket boi, and a P2P cash ape. I may be a minority but I’ll pump rockets all day\n\n🚀🚀🚀💚",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i96asa1",
                                    "author": "WippleDippleDoo",
                                    "score": 2,
                                    "created_utc": 1652943405.0,
                                    "response": "1.) go outside of this niche and obscure forum to promote BCH\n\n2.) avoid marketing directly to mlm scum like the audience of the luna scam\n\n3.) win\n\nMost people don’t even have or use any crypto currently.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i94vguj",
                    "author": "big--if-true",
                    "score": 12,
                    "created_utc": 1652915231.0,
                    "response": "Luna community want the 20% interest rates.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i94xc7k",
                            "author": "MobTwo",
                            "score": 3,
                            "created_utc": 1652916104.0,
                            "response": "That's an oversimplified and overgeneralization of an entire community of people. An all encompassing statement usually turns out to be incorrect.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i94zrg1",
                                    "author": "big--if-true",
                                    "score": 5,
                                    "created_utc": 1652917246.0,
                                    "response": "We cant compete with bitconnect style ponzi scheme payouts, they advertise they will pay 20% interest, like they claimed they would do on UST.\n\nBCH simply doesn't have the same function.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i950zmm",
                                            "author": "MobTwo",
                                            "score": 1,
                                            "created_utc": 1652917827.0,
                                            "response": "What I meant was that, not everyone in Luna is there for the 20% interests. We cannot assume they are a single hive mind. There will be people coming into BCH (if we try) based on the merits of sound fundamentals and utility of Bitcoin Cash. If we never try, we get nothing. If we try, we get something.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i95apz8",
                                                    "author": "ShadowOrson",
                                                    "score": -1,
                                                    "created_utc": 1652922417.0,
                                                    "response": "> What I meant was that, not everyone in Luna is there for the 20% interests.\n\nI'm from Missouri",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i96b168",
                                    "author": "WippleDippleDoo",
                                    "score": 2,
                                    "created_utc": 1652943609.0,
                                    "response": "This is not true at all.\n\nMajority of the crypto demand comes from greedy/mentally questionable people currently.\n\nThe bch community should focus the adoption efforts on normal people and not trying to mimick staking and pnd scams.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i96bonv",
                                            "author": "MobTwo",
                                            "score": 2,
                                            "created_utc": 1652944141.0,
                                            "response": "Have you been paying attention to the tokens in SmartBCH?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i96by5p",
                                                    "author": "WippleDippleDoo",
                                                    "score": 2,
                                                    "created_utc": 1652944367.0,
                                                    "response": "Yes, I think all of them are pretty pathetic mimic campaigns to lure in mentally challenged people who are attracted to pseudo-stablecoins and scammy staking schemes.\n\nThere is essentially 0 real use for them and I think it’s a huge mistake that this community wastes money on metoo style campaigns and project goals like this.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i955agz",
                            "author": "hero462",
                            "score": 3,
                            "created_utc": 1652919870.0,
                            "response": "They can get good returns on BCH-FlexUSD liquidity pools.  That's relatively low-risk.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i96af8s",
                    "author": "Ancapworld",
                    "score": 4,
                    "created_utc": 1652943106.0,
                    "response": "BCH needs to be for everyone, but it has to stay true to its P2P cash roadmap.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i954zyi",
                    "author": "hero462",
                    "score": 6,
                    "created_utc": 1652919730.0,
                    "response": "I'm on it, Mobtwo!  I've been reaching out there since the shit hit the fan.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i955kr0",
                            "author": "MobTwo",
                            "score": 7,
                            "created_utc": 1652920006.0,
                            "response": "👍 👍",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i96b5a7",
                            "author": "WippleDippleDoo",
                            "score": 2,
                            "created_utc": 1652943699.0,
                            "response": "Yeah! More brainless people will potentially “join” our community!",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i96rgra",
                                    "author": "hero462",
                                    "score": 1,
                                    "created_utc": 1652957846.0,
                                    "response": "Lol  I share your fears but I'm selling BCH as sound money, not a get rich quick scene so that filters out 99% of crowd.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i95ok9j",
                    "author": "EmergentCoding",
                    "score": 2,
                    "created_utc": 1652929001.0,
                    "response": "Great idea. If Bitcoin Cash is to become electronic cash for the world, it implies everyone will one day be using it.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i96b6zk",
                            "author": "WippleDippleDoo",
                            "score": 2,
                            "created_utc": 1652943737.0,
                            "response": "And we all know that MLM scum is the best group to make bch great again.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}