{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "8eamfz",
            "title": "\"In a discussion group of BCH, lots of investors concerned about the address confusing problem. BCH community should push every software of ecosystem to upgrade to Cashaddr ASAP.\"~Jihan Wu",
            "url": "https://twitter.com/JihanWu/status/988370452824244225",
            "author": "Windowly",
            "created_utc": 1524481573.0,
            "score": 369,
            "num_comments": 205,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "dxtn9mp",
                    "author": "btcnewsupdates",
                    "score": 46,
                    "created_utc": 1524481847.0,
                    "response": "Hopefully all ecosystem participants will be part of the planning process for all future forks/upgrades and this will not happen again.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "dxunuq8",
                            "author": "aitrading",
                            "score": 2,
                            "created_utc": 1524519259.0,
                            "response": "oh, yes. agree",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "dxu0d9e",
                            "author": "macadamian",
                            "score": -69,
                            "created_utc": 1524497738.0,
                            "response": "Nah Jihan Wu runs BCH and this post makes it blatantly obvious. \n\nThe dangers of centralization are now bearing fruit. Fun. ",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "dxu40km",
                                    "author": "Dday111",
                                    "score": 14,
                                    "created_utc": 1524501076.0,
                                    "response": "Keep bullshitting,  seems to what you're  born to do",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "dxufgge",
                                    "author": "jersan",
                                    "score": -4,
                                    "created_utc": 1524511424.0,
                                    "response": "It is hilarious how this sub cries all day about censorship but if you say anything bad about Bitmain or Jihan Wu then you get a million downvotes.\n\nFuck Bitmain, fuck Jihan Wu, fuck mining cartels.  Miners should have zero influence over the Bitcoin network, and if you feel otherwise then you are a fucking idiot.  Bitcoin belongs to the community of users, not the greedy miners",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "dxug0e0",
                                            "author": "BitcoinCashHoarder",
                                            "score": 12,
                                            "created_utc": 1524511935.0,
                                            "response": "Miners protect the network with hashpower to make it hack-proof. ",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "dxuh33f",
                                                    "author": "jersan",
                                                    "score": 1,
                                                    "created_utc": 1524512923.0,
                                                    "response": "Good for them.  That has nothing to do with governance -- mining corporations should not have any influence over the direction of the currency.  If miners don't like the way the currency is being developed they can fuck off.  I don't understand how Jihan's tweets end up in this sub, seriously he deserves zero attention.\n\n\n\n",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "dxujdf0",
                                                            "author": "BitcoinCashHoarder",
                                                            "score": 7,
                                                            "created_utc": 1524515023.0,
                                                            "response": "Miners are the gatekeepers! Don’t believe me.  Look at what the markets are buying! Join the winners or lose more than you have already. BCH is #1",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "dxuk34l",
                                                                    "author": "jersan",
                                                                    "score": 0,
                                                                    "created_utc": 1524515685.0,
                                                                    "response": "what you just said makes absolutely zero sense and has nothing to do with my previous comment.\n\nwhatever, not like it makes any difference.  this sub can keep sucking bitmain's dick and continue to promote Chinese Bitcoin aka Bitcoin Cash",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "dxundaw",
                                                                            "author": "BitcoinCashHoarder",
                                                                            "score": 2,
                                                                            "created_utc": 1524518791.0,
                                                                            "response": "You’re probably a troll in China getting paid a penny a day by Core LMAO. While I’m making millions because my investments are soaring 😉",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "dxurpxh",
                                            "author": "Steve132",
                                            "score": 3,
                                            "created_utc": 1524523162.0,
                                            "response": "A downvote isn't the same as a deleted comment and then a ban.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "dxv077q",
                                            "author": "wudaokor",
                                            "score": 2,
                                            "created_utc": 1524532086.0,
                                            "response": "How much money/time have you invested in bitcoin? Jihan is multiples higher on both accounts. Plus the white paper describes how those that invest in the network and show proof of their work get rewarded and have a say in the consensus mechanism. If miners don't deserve a say, who does?",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "dxul5xi",
                                            "author": "zeptochain",
                                            "score": 1,
                                            "created_utc": 1524516687.0,
                                            "response": "> a million downvotes\n\nI see -8.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "dxtrsqv",
                    "author": "NeVroe",
                    "score": 17,
                    "created_utc": 1524488855.0,
                    "response": "Ye, I wonder when Ledger will implement Cashaddr.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "dxtsddz",
                            "author": "btchip",
                            "score": 42,
                            "created_utc": 1524489571.0,
                            "response": "it's already implemented in the latest BCH app (1.2.5, available on firmware 1.4.2) and should be supported in Electron Cash this week. It will also be supported in our new client application suite available around June.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "dxtwxms",
                                    "author": "normal_rc",
                                    "score": 10,
                                    "created_utc": 1524494496.0,
                                    "response": "Thanks for the update.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "dxty92a",
                                    "author": "NeVroe",
                                    "score": 10,
                                    "created_utc": 1524495754.0,
                                    "response": "Awesome, did not know this. Thanks for the update! ",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "dxu0zgz",
                                    "author": "deadalnix",
                                    "score": 14,
                                    "created_utc": 1524498308.0,
                                    "response": "Thanks.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "dxtpzod",
                    "author": "DaSpawn",
                    "score": 47,
                    "created_utc": 1524486383.0,
                    "response": "unfortunately the address format that **actually** has a problem with loss of funds is SegWit address confusion, so this is not a problem with Bitcoin Cash, this is a problem with the BTC frankenstein confusing everything so I think it would be good to add a warning **only** to Bitcoin Cash clients even if they do not want to support the new address format (and warn on SW addresses)\n\nall clients should remain compatible with all formats if they are still usable, end user confusion is a UI issue",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "dxu0l5n",
                            "author": "deadalnix",
                            "score": 30,
                            "created_utc": 1524497940.0,
                            "response": "While this is technically true, you have no way to impact what core is doing. Permissionlessness works both way.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "dxu1el3",
                                    "author": "DaSpawn",
                                    "score": 13,
                                    "created_utc": 1524498692.0,
                                    "response": "Agreed;  Core chose to create a dangerous address type where users can loose money at worst and payments maybe succeed at best and I never expect them to change that (they appear to love creating user confusion/horrible end user experiences)\n\nOur community appears much more open to actual system upgrades that eliminate user confusion rather than add confusion, so we are in a perfect position to point out the flaws/help new users by greatly warning if someone tries to use a SW address in a Bitcoin Cash client and maybe gently warning them when they use a legacy address format\n\nBut in the end technically not Bitcoin Cashes problem, just happier end user potential with **any** Bitcoin usage, even the legacy version",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "dxx792v",
                            "author": "RudiMcflanagan",
                            "score": 1,
                            "created_utc": 1524622955.0,
                            "response": "What is wrong with cashaddr being able to encode P2SH segwit addresses?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "dxxn7sw",
                                    "author": "DaSpawn",
                                    "score": 1,
                                    "created_utc": 1524648968.0,
                                    "response": "the problem is specifically P2SH **SW** addresses/transactions that are not spendable/lost if submitted to the network",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "dxxs0vu",
                                            "author": "RudiMcflanagan",
                                            "score": 1,
                                            "created_utc": 1524658044.0,
                                            "response": "Aren't Segwit transactions submitted to the BCH network \"Anyone can spend\" I don't see how funds are lost ? ",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "dxxu284",
                                                    "author": "DaSpawn",
                                                    "score": 1,
                                                    "created_utc": 1524660739.0,
                                                    "response": "you would need to be a miner to claim them AFAIK but I honestly do not know the complete details (I think there was something more than that)",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "dxtqir0",
                            "author": "Hernzzzz",
                            "score": -50,
                            "created_utc": 1524487147.0,
                            "response": "No, since BCH forked off it was their responsibility to add replay protection, change address formats.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "dxtqn6r",
                                    "author": "DaSpawn",
                                    "score": 27,
                                    "created_utc": 1524487323.0,
                                    "response": "BTC is also a fork for a very long time and failed to add replay protection long ago and actually recently **created** more client confusion with Frankenstein modifications of legacy software;  Bitcoin Cash will continue to upgrade Bitcoin and **actually** ensure older client compatibility\n\nso whats your point?\n\nas I said this is a UI issue, nothing more",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "dxtth62",
                                            "author": "45sbvad",
                                            "score": -30,
                                            "created_utc": 1524490858.0,
                                            "response": "BTC is the original chain; BCH is the fork. This kind of manipulative doublespeak is exactly why many people believe BCH is an outright scam.\n\nBCH broke Bitcoins consensus rules and forked off the network. They are not both \"Forks\" ; They are both chains that share the same history , but using this kind of manipulative whitewashing language that BTC and BCH both forked off Bitcoin is continuing to drive people into believing BCH is a scam.\n\nUnless you are talking about ancient forks in Bitcoins past circa ~2010 ; BTC is not a fork; BTC is Bitcoin and BCH is a fork off Bitcoin.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "dxtu5m8",
                                                    "author": "FerriestaPatronum",
                                                    "score": 48,
                                                    "created_utc": 1524491612.0,
                                                    "response": "I'm a Bitcoin developer.  Both chains are forks--segwit was a fork: it literally changed the way blocks are structured.  It seems confusing, but it's true.  The only misconception here is your misappropriation that \"fork\" is a derogatory term.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "dxu3jja",
                                                            "author": "johnhardy-seebitcoin",
                                                            "score": -2,
                                                            "created_utc": 1524500650.0,
                                                            "response": "Bitcoin cash was a hard fork that forced a chain split. Segwit, like many others in BCH lineage was a soft fork that stayed on the same chain and consensus rules.\n\nI'd wince to see your development work, I assume its BCH. ",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "dxukjlo",
                                                                    "author": "RandomNumsandLetters",
                                                                    "score": 0,
                                                                    "created_utc": 1524516114.0,
                                                                    "response": "Stayed on the same chain? I don't think you understand how forks work, both bch and btc have the same genesis block / start if chain ",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "dxuuawb",
                                                                            "author": "johnhardy-seebitcoin",
                                                                            "score": 1,
                                                                            "created_utc": 1524525924.0,
                                                                            "response": "Bitcoin cash created a split which resultd in two seperate 'different' chains.\n\nSoft forks do not result in a chain split, therefore Bitcoin BTC is the original chain.\n\nPeople struggle with basic facts in this sub!",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "dxuub3b",
                                                                                    "author": "CommonMisspellingBot",
                                                                                    "score": 2,
                                                                                    "created_utc": 1524525930.0,
                                                                                    "response": "Hey, johnhardy-seebitcoin, just a quick heads-up:  \n**seperate** is actually spelled **separate**. You can remember it by **-par- in the middle**.  \nHave a nice day!\n\n^^^^The ^^^^parent ^^^^commenter ^^^^can ^^^^reply ^^^^with ^^^^'delete' ^^^^to ^^^^delete ^^^^this ^^^^comment.",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                },
                                                                                {
                                                                                    "id": "dxuvgxj",
                                                                                    "author": "RandomNumsandLetters",
                                                                                    "score": 0,
                                                                                    "created_utc": 1524527169.0,
                                                                                    "response": "'two separate different chains', one of which would be the BTC chain? When there is a fork there is no absolute \"True chain\" technically they are both he true chain",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "dxvha6f",
                                                                                            "author": "johnhardy-seebitcoin",
                                                                                            "score": 2,
                                                                                            "created_utc": 1524554489.0,
                                                                                            "response": "One is the original chain, one is a new chain.\n\nThe incumbent would generally be considered the true chain, unless there is clear consensus. In the event of clear consensus a hard fork would be achieved without chain split. Even if there is a split, most cumulative work is a fair measure of the true chain.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "dxtuan0",
                                                            "author": "45sbvad",
                                                            "score": -11,
                                                            "created_utc": 1524491760.0,
                                                            "response": "Segwit was a softfork and you know that. Consensus breaking changes creates a hardfork which has repercussions on the whole ecosystem.\n\n",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "dxtvkru",
                                                                    "author": "chernobyl169",
                                                                    "score": 33,
                                                                    "created_utc": 1524493121.0,
                                                                    "response": "My full node became unable to validate the chain after the introduction of SegWit. Since that was the case, my service that was dependent on full chain validation was no longer secure. My use case doesn't include SegWit, but I am forced to either validate it or sacrifice the security of my own use case. For all intents and purposes, from a provider use case perspective, the \"softfork\" was nothing but damage. The \"upgrade\" wasn't an improvement, it was a complication to existing use cases. The end result is that my use case is no longer supported by Bitcoin.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "dxu7omw",
                                                                            "author": "0xHUEHUE",
                                                                            "score": 2,
                                                                            "created_utc": 1524504368.0,
                                                                            "response": "So, you were running pre 2016 node software?",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "dxu7u00",
                                                                                    "author": "chernobyl169",
                                                                                    "score": 2,
                                                                                    "created_utc": 1524504501.0,
                                                                                    "response": "In 2015? Of course I was. I'm not a time traveler. The (imminent in mid-2016) procedure to upgrade to SegWit-validating software was prohibitively difficult for my use case as I was required to also rewrite my application to accept SegWit transactions. Better to abandon the project than retrofit years' work into a structure that isn't designed to do what I was trying to.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "dxua5fl",
                                                                                            "author": "0xHUEHUE",
                                                                                            "score": 3,
                                                                                            "created_utc": 1524506586.0,
                                                                                            "response": "Can you talk about your use case more?",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "id": "dxtwq6g",
                                                                    "author": "mushner",
                                                                    "score": 18,
                                                                    "created_utc": 1524494289.0,
                                                                    "response": "> Segwit was a soft**fork**\n\nSo it was a fork, glad we agree ...",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "dxuitz2",
                                                                            "author": "jonald_fyookball",
                                                                            "score": 8,
                                                                            "created_utc": 1524514523.0,
                                                                            "response": "> So it was a fork, glad we agree ...\n\nPeople here are forgetting, omitting, or are unaware that the only reason segwit doesn't \"break consensus\" is that non upgraded nodes see the segwit transactions as having \"anyone can spend\" outputs.  It's basically saying: we're introducing a new kind of transaction that, even though has new rules, we can force into the old set of rules by just having old nodes always think its valid.  ",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "dxtu174",
                                                    "author": "Cmoz",
                                                    "score": 23,
                                                    "created_utc": 1524491478.0,
                                                    "response": "You realize 'soft'forks are still forks....right?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "dxtu8cw",
                                                            "author": "45sbvad",
                                                            "score": -21,
                                                            "created_utc": 1524491692.0,
                                                            "response": "They aren't. Nobody is forced to follow softforks. Hardforks break consensus; soft forks do not.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "dxtv1cl",
                                                                    "author": "Cmoz",
                                                                    "score": 23,
                                                                    "created_utc": 1524492555.0,
                                                                    "response": "If nobody is forced to follow softforks, why if I mined a block with a non-segwit upgraded node, will it be rejected by default by 98% of the network? Its because segwit was a fork...the 'soft' part just means that old nodes are tricked into following the new fork by default, even if they cant properly validate the new transactions and the unupgraded node's blocks are going to be orphaned by default.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "dxvceet",
                                                                            "author": "0xHUEHUE",
                                                                            "score": 3,
                                                                            "created_utc": 1524545938.0,
                                                                            "response": "You can still mine without upgrading. It's only when you mine a segwit output that you don't own that you get orphaned. Aka when you deliberately try to make an invalid block...\n\nYou filter out segwit tx from your mempool when you run old node software because those tx fail the isStandard() check. The only way to make an invalid block is when you create the fraud tx manually yourself and mine it.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "dxvsw62",
                                                                                    "author": "Cmoz",
                                                                                    "score": 1,
                                                                                    "created_utc": 1524576098.0,
                                                                                    "response": "You're probably right, I havent mined in a long time, dunno where I heard that old nodes had problems mining. Thought that unupgraded miners tried to include segwit transactions, but did so incompletely, but it sounds like they ignore segwit transactions by default, and just produce a non-segwit block?\n\nI guess the better point is that if you dont upgrade you cant validate some of the transactions on the blockchain, and if you cant validate the entire blockchain, you're not a fully functional node anymore, you've been depreciated by the fork. ",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                },
                                                                                {
                                                                                    "id": "dxx72j8",
                                                                                    "author": "RudiMcflanagan",
                                                                                    "score": 1,
                                                                                    "created_utc": 1524622761.0,
                                                                                    "response": "Do they even fail `isStandard()` if they're P2SH segwit though ?",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "id": "dxtvvwf",
                                                                            "author": "45sbvad",
                                                                            "score": 4,
                                                                            "created_utc": 1524493444.0,
                                                                            "response": "I didn't have to upgrade my node. I haven't had to change my address format. I didn't have to get new wallet software. \n\nThats what you get with a softfork. Users have the choice to embrace the upgrade or can choose to be conservative with their funds. I for instance have not upgraded and have no issue using Bitcoin as it has been used for years.\n\n\nWhen I wanted to use Bitcoin Cash (a hard fork) I needed new wallet software, and if I wanted to run a node I would need new node software. My Bitcoin node is not compatible with the BCH network but is compatible with the BTC network. If they are both equal forks that require users to upgrade why am I still on the BTC network?\n\nThere are major, major differences between hard and soft forks; pretending they are the same and have the same consequences is outright dishonest; or maybe you're ignorant of the differences.\n",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "dxtw319",
                                                                                    "author": "Cmoz",
                                                                                    "score": 15,
                                                                                    "created_utc": 1524493644.0,
                                                                                    "response": "If you're still running a pre-segwit node, you didnt 'have' to upgrade your node because you're not actually mining any blocks and you're content to not actually be able to validate some transactions (segwit transactions) on the blockchain. You're not a fully functional node anymore, because the network forked and left you behind. If you wanted to actually be able to trustlessly validate the entirety of the blockchain, as full nodes do, you have to update.\n\nIm not pretending hardforks and softforks are the same. Infact I told you how theyre different. Im just not pretending that softforks arent even forks at all, like you're doing.",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "id": "dxtun6l",
                                                                    "author": "Cmoz",
                                                                    "score": 8,
                                                                    "created_utc": 1524492136.0,
                                                                    "response": "If no one is forced to follow softforks...how can I prevent someone from sending me money from a segwit address? A softfork is simply a fork that is imposed on you by default, while a hardfork requires you to actively update in order to accept it.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                },
                                                                {
                                                                    "id": "dxx700j",
                                                                    "author": "RudiMcflanagan",
                                                                    "score": 1,
                                                                    "created_utc": 1524622687.0,
                                                                    "response": "They're still forks. Thats why they're called \"forks\"",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                },
                                                                {
                                                                    "id": "dxuyz9p",
                                                                    "author": "rdar1999",
                                                                    "score": -1,
                                                                    "created_utc": 1524530845.0,
                                                                    "response": "You are incredible stupid or dishonest, hard forks don't break anything, you follow one of the chains, can't be more democratic than this.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "dxtts1a",
                                                    "author": "DaSpawn",
                                                    "score": 11,
                                                    "created_utc": 1524491198.0,
                                                    "response": "there is no doublespeak here, this is reality, even if you want to ignore reality\n\nBTC had not been the original chain in years.  It has had 1 hard fork long ago and 2 separate soft fork (changes against the majority will/knowledge of the network)\n\nBCH is much closer to the original version than the BTC Frankenstein that was co-opted long ago; BTC **blatantly** stated by its developers/leaders/dictators BTC is no longer cash and it is **only** to be a \"store of value\"\n\nfunny how all you can do is throw around inflammatory/manipulated words like manipulative doublespeak/scam/consensus rules/ancient forks since you have no actual arguments here",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "dxtu8z3",
                                                            "author": "fruitsofknowledge",
                                                            "score": 9,
                                                            "created_utc": 1524491710.0,
                                                            "response": "> BCH is much closer to the original version than the BTC Frankenstein that was co-opted long ago; BTC blatantly stated by its developers/leaders/dictators BTC is no longer cash and it is only to be a \"store of value\"\n\nMore exactly the developers and big influencers now usually say it never _was_, or was never _intended_ to be.",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "dxtu5jk",
                                                            "author": "45sbvad",
                                                            "score": -3,
                                                            "created_utc": 1524491610.0,
                                                            "response": "The argument is very simple and I will call out manipulative doublespeak when I see it.\n\nIf you want to say that BCH follows the \"original vision\" thats fine. But if you are going to use technical terms improperly in order to push your narrative; that is lying. Lying for the sake of persuading the uninformed. Thats manipulation.\n\nBCH is a fork off Bitcoin.\nBitcoin is not a fork off BCH\n\nBTCP is a fork off Bitcoin\nBitcoin is not a fork off BTCP\n\nBTD is a fork off Bitcoin\nBitcoin is not a fork off BTD\n\nThey are not all forks of each other and you are using outright dishonesty in order to push a narrative.\n\nBut hey; thanks for the free BCH; sold at $2600 and neutralized 100% of my debt and got my dream home and I got to keep my precious Bitcoin. ",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "dxtx413",
                                                                    "author": "Kay0r",
                                                                    "score": 10,
                                                                    "created_utc": 1524494669.0,
                                                                    "response": "Yes, the argument is simple:  \nBCH is a fork of bitcoin.  \nBTC is a fork of bitcoin too.  \n\nThe original chain is embedded in both, but bitcoin as we knew it doesn't exists anymore.\n",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                },
                                                                {
                                                                    "id": "dxu2nyn",
                                                                    "author": "capistor",
                                                                    "score": 3,
                                                                    "created_utc": 1524499846.0,
                                                                    "response": "so you can change bitcoin fundamentally and still believe you're running p2p cash?  good for you mate.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                },
                                                                {
                                                                    "id": "dxtucjj",
                                                                    "author": "DaSpawn",
                                                                    "score": 6,
                                                                    "created_utc": 1524491816.0,
                                                                    "response": "lol **MY PRECIOUS**\n\nyea, Bitcoin helped me buy my house too, and also paid off my debt.  You must be repeating one of my posts long ago\n\nbut that was never the point of Bitcoin and I did that **before** the price got manipulated and designed to grab people over tax dodging\n\nOnly one Bitcoin remains and that is Bitcoin Cash",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "dxu175a",
                                                                            "author": "midipoet",
                                                                            "score": -1,
                                                                            "created_utc": 1524498504.0,
                                                                            "response": "> I did that before the price got manipulated and designed to grab people over tax dodging\n\nTin hat time. ",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "dxu1i15",
                                                                                    "author": "DaSpawn",
                                                                                    "score": 0,
                                                                                    "created_utc": 1524498778.0,
                                                                                    "response": "Thanks for confirming my snide comment (labeling it as tin hat is a dead giveaway I am not entirely wrong)",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "dxu7hi7",
                                                                                            "author": "midipoet",
                                                                                            "score": 1,
                                                                                            "created_utc": 1524504193.0,
                                                                                            "response": "So you are saying that price was manipulated by the deep state as bait for potential tax evaders? You do realise that the manipulation would have cost more than the tax revenue, right? I mean we are talking world wide price manipulation here. ",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "dxutvii",
                                                    "author": "TotesMessenger",
                                                    "score": 1,
                                                    "created_utc": 1524525466.0,
                                                    "response": "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/negativewithgold] [\"BTC is the original chain; BCH is the fork. This kind of manipulative doublespeak is exactly why many people believe...\" \\[-24\\]](https://www.reddit.com/r/NegativeWithGold/comments/8efvh0/btc_is_the_original_chain_bch_is_the_fork_this/)\n\n&nbsp;*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "dxx758i",
                                                    "author": "RudiMcflanagan",
                                                    "score": 1,
                                                    "created_utc": 1524622841.0,
                                                    "response": "In the event of a hard fork, what is the formal definition of the original chain ? ",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "dxxmz06",
                                                            "author": "45sbvad",
                                                            "score": 1,
                                                            "created_utc": 1524648392.0,
                                                            "response": "The original chain is the one that is backwards compatible; the original chain requires no change in behavior or software on the part of the users. Funds are not lost if users do not \"upgrade\" software. ",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "dxu4s16",
                                                    "author": "Zer000sum",
                                                    "score": 1,
                                                    "created_utc": 1524501767.0,
                                                    "response": "Only BTC maximalists use \"fork\" as a derogatory term. Out of 2000 coins out there maybe 20 were coded from scratch. Forks create a vibrant ecosystem that pushes back hard against BTC toxicity.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "dxu2kp0",
                                    "author": "capistor",
                                    "score": 2,
                                    "created_utc": 1524499764.0,
                                    "response": "if bitcoin had no replay protection, BTC would be even more dysfunctional while BCH keeps running as it has for more than seven years",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "dxtyre0",
                                    "author": "Egon_1",
                                    "score": 1,
                                    "created_utc": 1524496235.0,
                                    "response": "/u/cryptochecker ",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "dxtysks",
                                            "author": "cryptochecker",
                                            "score": 1,
                                            "created_utc": 1524496266.0,
                                            "response": "Of [u/Hernzzzz](https://www.reddit.com/u/Hernzzzz)'s last **258** posts and **1000** comments, I found **256** posts and **996** comments in cryptocurrency-related subreddits. Average sentiment (in the interval -1 to +1, with -1 **most negative** and +1 **most positive**) and karma counts are shown for each subreddit:\n\nSubreddit|No. of posts|Avg. post sentiment|Total post karma|No. of comments|Avg. comment sentiment|Total comment karma\n:--|:--|:--|:--|:--|:--|:--\nr/CryptoCurrency|0|0.0|0|1|0.0|1\nr/BitcoinMarkets|0|0.0|0|2|-0.14|2\nr/Bitcoin|16|0.1|217|7|0.38 **(quite positive)**|8\nr/btc|240|0.1|769|986|0.13|-823\n\n***\n\n^(Bleep, bloop, I'm a bot trying to help inform cryptocurrency discussion on Reddit.) ^| [^About](https://www.reddit.com/user/cryptochecker/comments/7q3jum/faq_about_ucryptochecker/) ^| [^Feedback](https://www.reddit.com/message/compose?to=jamcowl&subject=cryptochecker%20bot) ",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "dxug2xg",
                            "author": "BitcoinCashHoarder",
                            "score": 0,
                            "created_utc": 1524512000.0,
                            "response": "BTC has Segshit AND LN addresses now and LN address is the worst! LOL 😂",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "dxupmdp",
                            "author": "mathaiser",
                            "score": -1,
                            "created_utc": 1524520985.0,
                            "response": "Who he fuck said anything about segwit.  You guys are all so far gone and so convinced... there are more cryptos out there.  Start looking at the broader market and compete with them, stop just comparing to Btc.  If Btc is so shitty, then why do you even care or keep bringing that up.  There are bigger fish to fry if you want to be top dog.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "dxut08o",
                                    "author": "DaSpawn",
                                    "score": 2,
                                    "created_utc": 1524524541.0,
                                    "response": "Bitcoin != external markets\n\n",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "dxtzwsr",
                    "author": "caveden",
                    "score": 5,
                    "created_utc": 1524497310.0,
                    "response": "A much more important thing is BIP70 implementation. ",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "dxuaugp",
                            "author": "jakeroxs",
                            "score": 6,
                            "created_utc": 1524507213.0,
                            "response": "Yeah, was thinking this, I prefer cashaddr for compatibility but BIP70 is so freaking good if you've got everything compatible.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "dxu8xj9",
                    "author": "madden04",
                    "score": 3,
                    "created_utc": 1524505492.0,
                    "response": "Yeah it's true, although whether Cashaddr will prove to be much better has not to be proven. ",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "dxugo9z",
                    "author": "moleccc",
                    "score": 3,
                    "created_utc": 1524512545.0,
                    "response": "Anyone know wether Satoshilabs is planning support in the trezor firmware?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "dxvb97p",
                            "author": "Bagatell_",
                            "score": 2,
                            "created_utc": 1524544358.0,
                            "response": "> It's done, pending next firmware update.\n\nhttps://np.reddit.com/r/TREZOR/comments/8eaqhd/honest_opinion_please/dxu4pcl/",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "dxvyp2v",
                                    "author": "moleccc",
                                    "score": 1,
                                    "created_utc": 1524581901.0,
                                    "response": "awesome!!!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "dxtzk87",
                    "author": "1Hyena",
                    "score": 9,
                    "created_utc": 1524496987.0,
                    "response": "Bitcoin Core will fade into oblivion. After that cashAddr can safely be reverted back to Base58. I'm not going to upgrade my services. Especially because there is no self-contained javascript function for the conversion, only a bunch of bloated and horrible libraries.\n\nBitcoin (Bitcoin Cash) Wallets should simply be able to scan both types of QR codes and take both address formats as input.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "dxudffn",
                            "author": "GolferRama",
                            "score": 7,
                            "created_utc": 1524509551.0,
                            "response": "Dude.   CashAdd is simple and front end only.  Offer both ",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "dxugvcs",
                                    "author": "1Hyena",
                                    "score": 7,
                                    "created_utc": 1524512723.0,
                                    "response": "agreed, will do",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "dxuc2ie",
                    "author": "KingofKens",
                    "score": 4,
                    "created_utc": 1524508311.0,
                    "response": "People here need to start focusing to our users but not r/bitcoin... If you had no problem for the Cashaddr upgrade, you are either not using BCH often or you are geeks who spend significant time learning BCH. We should realized that people here are not mass, a tiny fraction of the early birds. Mass are like our moms and dads or Grand moms or Grand dads. We want these people start using BCH, then we really need to change the geek mentality that doesn't care about usability of non technical people... ",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "dxuhhke",
                            "author": "DoomedKid",
                            "score": 2,
                            "created_utc": 1524513287.0,
                            "response": "Have you seen handcash or [cointext.io](https://cointext.io)? These are very new user focused.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "dxuiigv",
                                    "author": "KingofKens",
                                    "score": 1,
                                    "created_utc": 1524514230.0,
                                    "response": "Yes. These apps are great, but something that we are talking is a bigger issue. It is eccentially in between communication problems of our industry. We got to figure out better way to communicate, discuss and propergate information, so our users won't stuck using BCH. ",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "dxuboc9",
                    "author": "dnick",
                    "score": 2,
                    "created_utc": 1524507957.0,
                    "response": "Can someone ELI5 what the cashaddr thing is?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "dxudm59",
                            "author": "GolferRama",
                            "score": 5,
                            "created_utc": 1524509723.0,
                            "response": "Every coin has their own format.   Bitcoin addresses start with 1 and 3.   Since Bitcoin Cash forked from Bitcoin our addresses also started with 1 and 3. \n\nSo you could send to the wrong chain and lose your coins forever.  Other coins like Dash starts with X and other coins start with different characters.   Also the number of characters is another defining characteristic.  \n\nWith cashaddr bitcoin cash has their own format.  Its clean and has other benefits _(I don't understand them)_ but to me the main one is that you absolutely cannot send bitcoin cash to bitcoin if using cashaddr",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "dxugq0z",
                                    "author": "AmIHigh",
                                    "score": 3,
                                    "created_utc": 1524512590.0,
                                    "response": "If you send the coins to the wrong address there's the possibility of recovering them, but it could be a hassle.\n\nWhoever you send the coins to, also has the same private key for the other address.  If you send the wrong money to coinbase, coinbase could recover it, but they'd be annoyed. ",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "dxui037",
                                    "author": "dnick",
                                    "score": 1,
                                    "created_utc": 1524513758.0,
                                    "response": "Ah.  So is this more of a problem after the 'coin coloring' thing? or just the same issue that's existed ever since the fork?\n\nNot that it matters that much, just trying to wrap my head around this if it's going to be the next drama.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "dxukixx",
                                            "author": "chrimata",
                                            "score": 1,
                                            "created_utc": 1524516097.0,
                                            "response": "Something that's existed since the fork. \n\nWhy would it be drama? It seems like everyone's Ok with having a unique and identifiable address format and people have been adding support for it for months",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "dxukx2h",
                                                    "author": "dnick",
                                                    "score": 1,
                                                    "created_utc": 1524516459.0,
                                                    "response": "Well, I don't mean it 'should' be a drama, just that I've seen it start springing up in a few different places where it seems that it's suddenly an issue and that resolving it is imperative, where it doesn't seem like a universal fix is really possible.  \n\nThen, on top of that, people pointing it out as something that was called optional at first, but now benefits some group or other so now it's suddenly 'immediately' necessary.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "dxuloxi",
                                                            "author": "chrimata",
                                                            "score": 1,
                                                            "created_utc": 1524517175.0,
                                                            "response": "Who does an address format benefit exactly? It's not like anyone can only support cashaddr. It's a display feature",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "dxumao2",
                                                                    "author": "dnick",
                                                                    "score": 1,
                                                                    "created_utc": 1524517753.0,
                                                                    "response": "I don't really know, from what i saw, guessing maybe it could benefit by driving adoption to a client or software version that has this built in, where otherwise adoption might be slower or more distributed?\n\nLike i said, I was just trying to get my head around this, since the address confusion has been a possible issue since the fork, and it seems like people are saying it's suddenly more of an issue now.  Usually urgency without a well understood reason is a good indication of someone doing something that doesn't withstand long term analysis.  'You can wait, but I can't guarantee you this car will still be available at this great price tomorrow...my manager might change his mind and i have 30 people coming to look at it in 15 minutes...' comes to mind.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "dxunywx",
                                                                            "author": "chrimata",
                                                                            "score": 1,
                                                                            "created_utc": 1524519375.0,
                                                                            "response": "I don't understand what you're saying or your analogy sorry. \n\nThis isn't being driven by one central entity or in only one client. Most of the BCH ecosystem has either already adopted this display format or is actively working on it. \n\nA bunch of people released open source libraries in different languages to help people integrate it. \n\nIt's been happening for months and is talked about a lot here. It's definitely not new and it's definitely not controversial",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "dxuocqy",
                                                                                    "author": "dnick",
                                                                                    "score": 1,
                                                                                    "created_utc": 1524519748.0,
                                                                                    "response": "Thank you, that’s helpful, and apparently I’ve missed a bit of conversation on this.  I thought I’d been keeping up on things reasonably well, but it’s just been suddenly that I’ve heard from multiple places that cashaddr is urgent when I wasn’t aware that anything had changed to make it any more urgent than last week or last month, etc.  Perhaps they’re referring to expanded adoption and the obvious risks of branding and matching too close to btc are hitting more people at a faster rate.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "dxupys6",
                                                                                            "author": "chrimata",
                                                                                            "score": 1,
                                                                                            "created_utc": 1524521335.0,
                                                                                            "response": "No worries. The BCH hardfork is coming up to upgrade the network. All of the miners and nodes need to upgrade or they will fork themselves off the network. Wallets don't need to update. \n\nI think most node software devs are making this update also have cashaddr. Perhaps that's where you heard it since it's coming up May 15\n\n",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "dxukps6",
                                            "author": "Areign",
                                            "score": 1,
                                            "created_utc": 1524516275.0,
                                            "response": "can you elaborate/link to the 'coin coloring' thing. I think this is the second time i've seen it referenced but couldn't find much.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "dxulxom",
                                                    "author": "dnick",
                                                    "score": 2,
                                                    "created_utc": 1524517405.0,
                                                    "response": "There was a roadmap item to basically use one of the less used parameters in a bitcoin transaction to effectively 'color' a coin as belonging to a specific group (say 'Starbucks') to use as a loyalty coin or gift card, or something like that.  \n\nI don't know if i'm getting this exactly right, but if you owned a coin and distributed it with 'your' parameter, you could use it in any way you wanted.  They used the term 'color' just as terminology.  What i saw from this is that Starbucks could buy a bch, and by 'coloring' it with their code (some derivative of, or signed by, their private key?), they could say it was worth anything they wanted within their stores, so they could give away 300 milli-bch to customers and say each one was worth a cup of coffee. The 'security' is provided by the BCH network, and the 'color' guarantees it is a valid part of their promotion.  basically a free-ish, non-counterfeitable gift card/loyalty program.  \n\nThe idea seems kind of cool, the implementation seemed a little hacky, but to me it sounded like maybe that was adopted and then related to this cashaddr thing.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "dxum47y",
                                                            "author": "Areign",
                                                            "score": 1,
                                                            "created_utc": 1524517581.0,
                                                            "response": "thanks, i was completely off",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "dxv37rx",
                                            "author": "GolferRama",
                                            "score": 1,
                                            "created_utc": 1524535014.0,
                                            "response": "Unrelated ",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "dxx7mc4",
                            "author": "RudiMcflanagan",
                            "score": 1,
                            "created_utc": 1524623340.0,
                            "response": "It's an alternative text codec to Base58Check for key hashes and script hashes",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "dxxcd4m",
                                    "author": "dnick",
                                    "score": 1,
                                    "created_utc": 1524628763.0,
                                    "response": "Ha, not that it was a bad description, but that might be a good entry for ‘worst ELI5’ in history?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "dxu66dw",
                    "author": "awless",
                    "score": 1,
                    "created_utc": 1524503015.0,
                    "response": "I guess those investors want to drop all those tracking tokens into all those unsuspecting users.\n\nfor those promised the addr change was optional this is a bit of a let down; remember people need to check the address manually....e.g. its displayed on ledger and need confirmed, the new addr format is just more hassle.\n\nIsnt the problem here that the new addr format was pushed to support colored coins/tokens? it might be that ppl who want those features are now pushing for everyone to support them so they can use the feature all over?\n",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "dxubh91",
                    "author": "wilbil90",
                    "score": 1,
                    "created_utc": 1524507782.0,
                    "response": "Yeah, there must be good communication above all else to token holders. ",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "dxv7k1m",
                    "author": "awless",
                    "score": 1,
                    "created_utc": 1524539667.0,
                    "response": "@current rate of growth for bitcoin cash I dont see the segwit fork will be around much longer so its a non issue.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "dxvz0ap",
                    "author": "PanneKopp",
                    "score": 1,
                    "created_utc": 1524582189.0,
                    "response": "I guess Jihan should add CashAddr to Bitmain - todays order still with legacy address - very LoL",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "dxu7cgc",
                    "author": "RareJahans",
                    "score": 1,
                    "created_utc": 1524504066.0,
                    "response": "I just made a post about my own confusion this weekend actually. I would appreciate and say that this needs to be addressed asap. ",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "dxtuk9w",
                    "author": "cryptorebel",
                    "score": -1,
                    "created_utc": 1524492047.0,
                    "response": "The cashaddr has been a nightmare pretty much and just made everything more confusing.  I wish we never did it, I think we got trolled into it by Core supporters. There is no way to force everyone to follow a certain format.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "dxu8138",
                            "author": "BigBlockIfTrue",
                            "score": 5,
                            "created_utc": 1524504674.0,
                            "response": "> There is no way to force everyone to follow a certain format.\n\nThere is no way to force everyone to follow a hard fork. Should we never hard fork?\n\nOf course we should keep upgrading. It causes some inconvenience in the short term but is worth it in the long term.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "dxu8695",
                                    "author": "cryptorebel",
                                    "score": -1,
                                    "created_utc": 1524504804.0,
                                    "response": "Who says a new address format is an upgrade though?  I have tried helping newbs and sending Bitcoin to help people who aren't too cryoto savvy.  And I can say the cashaddr just makes everything more confusing, turns people away, and causes frustration, adds extra steps, and wastes time.  Its a lot worse than the people who used to accidentally send BCH to a BTC address, which still happens regardless of the new format.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "dxu9hu2",
                                            "author": "BigBlockIfTrue",
                                            "score": 5,
                                            "created_utc": 1524505998.0,
                                            "response": "The additional confusion and frustration is only temporary while there is no universal support. Once the new format is fully adopted, sending BCH to BTC addresses can be fully eliminated.\n\nThere are three possible situations:\n\n1. No CashAddr support. People keep sending transactions on the wrong chain.\n2. Partial CashAddr support. People get confused and annoyed because they have to convert address formats.\n3. Full CashAddr support. People are happy.\n\nSince only situation 3 is acceptable long term, the best course of action is to get to situation 3 as quickly as possible.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "dxu9rp6",
                                                    "author": "cryptorebel",
                                                    "score": 0,
                                                    "created_utc": 1524506243.0,
                                                    "response": "I don't know, I could see a scenario where Bitcoin-Legacy kind of peters out and dwindles in popularity, and then BCH takes over and we just use normal addresses.  I am all for competition of ideas though.  We can't force the market to do something.  One thing I think we should get people who upgrade to focus on is having the option.  Have old address format and new format and ability to switch.  Then you are fully compatible with the full ecosystem.  But when people or services upgrade to cashaddr and get rid of the option to use old addresses it really causes problems.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "dxtra1q",
                    "author": "aggressive_simon",
                    "score": 0,
                    "created_utc": 1524488180.0,
                    "response": "No shit.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "dxu48sf",
                    "author": "Esoterimix",
                    "score": -2,
                    "created_utc": 1524501287.0,
                    "response": "BCH should just be downgraded to the dumpster where it belongs 😂😂😂😂😂",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "dxu0nyx",
                    "author": "freework",
                    "score": -3,
                    "created_utc": 1524498013.0,
                    "response": "The stupidity of changing the address format is right up there with the stupidity of segwit/lightning network. You don't fix what is not broke. Base58 is not broke. In my opinion, everyone should move off \"cashaddr\" and onto base58. There will never be 100% cashaddr, there will always be people that will not change. Therefore there will never be \"address consensus\" in the BCH network which is a fucking shame. Fuck everybody who is trying to push for cashaddr.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "dxu3iy5",
                            "author": "No_Me_Jodas",
                            "score": 7,
                            "created_utc": 1524500635.0,
                            "response": "This is the beauty of Bitcoin Cash. Fuck bitcoin core and their consensus. You keep using Base58, I keep using Cashaddr and BCH moves forward either way.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "dxuk28n",
                                    "author": "freework",
                                    "score": 2,
                                    "created_utc": 1524515662.0,
                                    "response": "If you insist on using cashaddr, I won't be able to send to you. My wallet doesn't recognize those addresses. If you show me base58 addresses, my wallet will be able to send to you.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "dxuarlj",
                            "author": "rdar1999",
                            "score": 1,
                            "created_utc": 1524507141.0,
                            "response": "I particularly use only legacy Base58 because I know what I'm doing, and electron cash has the conversion there in case I need (also block explorers such as blockchair.)\n\nThe problem was created by segwit addresses, and it is just fantastic how core managed to cause so much problems with everything they did. This is why \"coder\" and \"developer\" are different things. One can be a great coder, but an asinine developer.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "dxujz86",
                                    "author": "freework",
                                    "score": 0,
                                    "created_utc": 1524515584.0,
                                    "response": "> The problem was created by segwit addresses,\n\nCashaddr does nothing to stop accidental sending of BCH to a segwit address. Cashaddr makes no attempt to make \"3\" addresses invalid, therefore, it's still very possible for a cashaddr enabled wallet to lose money to a segwit address. The morons who supported cashaddr should be ashamed of themselves.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "dxukvhf",
                                            "author": "rdar1999",
                                            "score": 1,
                                            "created_utc": 1524516419.0,
                                            "response": "Could you get a random segwit address and convert to cashaddress so we can check?\n",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "dxutknl",
                                                    "author": "freework",
                                                    "score": 1,
                                                    "created_utc": 1524525144.0,
                                                    "response": "There are two type of segwit addresses, \"p2sh wrapped\" and bech32. Bech32 will not be compatible with any BCH wallet, but P2sh wrapped addresses will. There is still a lot of people using P2SH wrapped segwit addresses.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "dxuvlwh",
                                                            "author": "rdar1999",
                                                            "score": 1,
                                                            "created_utc": 1524527319.0,
                                                            "response": "Converting 35SegwitPieWKVHieXd97mnurNi8o6CM73 to cashaddress gave me pq5j3ap67xxj6c8g4pp4grvqs6es2dqn8y3ggnucz5\n\nConverting 38Segwituno6sUoEkh57ycM6K7ej5gvJhM gave me pp9pz4x4pvpjj2esysmsjqt3r9rvklxvcvg4ndrguk\n\nSeems that all BCH cashaddresses begin with \"q\", but I'm not sure.",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "dxx85w0",
                                                            "author": "RudiMcflanagan",
                                                            "score": 1,
                                                            "created_utc": 1524623917.0,
                                                            "response": "Is there anything wrong with cashaddr being able to covertly encode P2SH addresses that come from segwi redeemScripts? Whats wrong with being able to spend BCH to a segwit address if that's what the address creator told you to do? \n\nIn order for a segwit address to exsist someone needs to create it from a signing key. ",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "dxu71j7",
                    "author": "sumsaph",
                    "score": -4,
                    "created_utc": 1524503797.0,
                    "response": "you heard your master, the bcash overlord. start enforcing people to use cashaddr, r/btc shills. jihan wants at least 100 shilling  topics about why every bcasher should use cashaddr by tomorrow!! \n\nnow, get to work, shills! hip hip! :))\n\n** \n\na great example of why decentralization is more important than bigger block sizes.\n\n**is this the future you promise/offer to people, is this why you support/shill bcash, bcashers? for jihans cryptoworld domination?**",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "dxufwhw",
                    "author": "BitcoinCashHoarder",
                    "score": -1,
                    "created_utc": 1524511835.0,
                    "response": "They won’t have to worry for long once BTC is dead LOL 😂 \nBCH transactions increased by 30% and hashrate increased by 20% this week!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "dxut0oz",
                    "author": "nfxcrypto",
                    "score": -1,
                    "created_utc": 1524524555.0,
                    "response": "LMFAO\n\nahahahahahaahhhhaaaaaaaahhhhhhaa haahahaha",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "dxut11d",
                            "author": "trolldetectr",
                            "score": 1,
                            "created_utc": 1524524565.0,
                            "response": "Redditor /u/nfxcrypto has low karma in this subreddit.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "dxu2i7v",
                    "author": "capistor",
                    "score": 0,
                    "created_utc": 1524499703.0,
                    "response": "or just remove replay protection.  why would bitcoin need protection from itself?  we could clear all transactions just fine",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "dxtte5e",
                    "author": "MentalDay",
                    "score": -14,
                    "created_utc": 1524490764.0,
                    "response": "Jihan must be lying because I've seen lots of comments in here saying no one has *ever* accidentally mixed up bitcoin and bitcoin cash. Just doesn't happen, apparently.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "dxtu19r",
                            "author": "DaSpawn",
                            "score": 6,
                            "created_utc": 1524491480.0,
                            "response": "\"Everyone\" \"lots of comments\"...  funny how none of that exists when you posted...\n\nnot a single comment claims there was never a problem.  The problem is **directly** caused by SW addresses being incompatible with Bitcoin\n\nSW addresses are the addresses that loose money, not standard/upgraded Bitcoin addresses that can receive funds just fine\n\nThis is **not** a Bitcoin Cash problem, this is a legacy BTC non-upgraded Frankenstein directly caused problem\n\ndo I need to add **another** L to the *MANIPULATIVE LYING TROLLLLLLL* tag I have in RES for you?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "dxtu84x",
                                    "author": "MentalDay",
                                    "score": -3,
                                    "created_utc": 1524491685.0,
                                    "response": ">This is not a Bitcoin Cash problem\n\nYes it is, the address format should have been modified when BCH forked and this never would have been a problem in the first place. Continue to believe whatever you want though, I'm sure you will anyway.\n\n> do I need to add another L to the MANIPULATIVE LYING TROLLLLLLL tag I have in RES for you?\n\nKnock yourself out.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "dxtydav",
                                            "author": "mushner",
                                            "score": 1,
                                            "created_utc": 1524495867.0,
                                            "response": "> Yes it is, the address format should have been modified when BCH forked\n\nIt's BTC that changed the interpretation of some addresses when they forked to SegWit, BCH uses addresses the same way Bitcoin always used them before - it's the one who makes the change that should protect users from mistakes involving the change, so in this case clearly BTC.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "dxu3tf8",
                                                    "author": "Crully",
                                                    "score": 1,
                                                    "created_utc": 1524500895.0,
                                                    "response": "Err, no, nothing has changed on bitcoin, you must be confused over P2SH addresses. Native SegWit addresses are fine, but not many wallets can generate them.  \n\nThe cause of the problem is bitcoin cash cannot work out how to claim the funds in a P2SH (3) address wrapping SegWit. Its not a bitcoin or SegWit issue at all. \n\nP2SH addresses have nothing special to do with SegWit, they are used for other reasons (such as multi sig) fine. ",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "dxtz3e4",
                                                    "author": "MentalDay",
                                                    "score": -2,
                                                    "created_utc": 1524496548.0,
                                                    "response": "Except segwit became active *after* BCH forked. BCH \"changed the interpretation of some addresses when they forked\" by changing consensus rules to fork in the first place. THAT is when BCH should have modified the address format.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "dxu3ew2",
                                                    "author": "Amichateur",
                                                    "score": -4,
                                                    "created_utc": 1524500533.0,
                                                    "response": "As usual, you guys are spreading lies. Shameful for the whole crypto community. Every community has scum when it grows. You are the scum of the crypto community, acc. to your behaviour.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "dxu34xy",
                    "author": "Amichateur",
                    "score": -4,
                    "created_utc": 1524500279.0,
                    "response": "I said that lots of times long time before the hard fork. but the dumb decision makers of btc did not want to listen. Now they have to learn the hard way.\n\nThey are the opposite of what one would call visionary. ",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "dxtoy8c",
                    "author": "Essexal",
                    "score": -68,
                    "created_utc": 1524484783.0,
                    "response": "It'll be epic when one of these upgrades break your shitcoin ~ me \n\n* Edit: 'Lot's of investors' ~ Jihan and Roger lol \n\n",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "dxtprxo",
                            "author": "mushner",
                            "score": 18,
                            "created_utc": 1524486065.0,
                            "response": "> 'Lot's of investors' ~ Jihan and Roger lol \n\nRecent price movements would disagree ...",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "dxtw0k2",
                                    "author": "east_village",
                                    "score": 3,
                                    "created_utc": 1524493574.0,
                                    "response": "My best guess as to why a thread smearing BCH is nearing the top is because of the latest price movements. I honestly hate when both sides smear each other and unfortunately it happens from both sides. It doesn't matter what either of you think of each other, the users will decide. ",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "dxtq576",
                                    "author": "Essexal",
                                    "score": -31,
                                    "created_utc": 1524486610.0,
                                    "response": "So hang on, Bitchcoins biggest argument - Bitcoin is controlled by the few. \n\n'Bunch of investors' say jump, you lot ready to jump. \n\nWAKE UP YOU CLOWNS.\n",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "dxtqljv",
                                            "author": "mushner",
                                            "score": 13,
                                            "created_utc": 1524487260.0,
                                            "response": "What? You're not making sense, how on Earth do you imagine increasing adoption if you're not going to listen to the stake-holders?\n\nIt's not like anybody is jumping to do whatever \"investors\" say, but it's important to listen and do the things that make sense, which in this instance is the case.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "dxtqnsc",
                                            "author": "mittremblay",
                                            "score": 8,
                                            "created_utc": 1524487345.0,
                                            "response": "Price action doesn't match \"bunch of investors saying jump\"\n\nYou're an idiot, go back to your sub or make a decent informative argument.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "dxtsyy4",
                                            "author": "SILENTSAM69",
                                            "score": 4,
                                            "created_utc": 1524490280.0,
                                            "response": "Where do you get the strange idea that the Cash fork is controlled by a few people. That is the funniest of all the claims. You back it up with nothing.\n\nYet when we point to BS being one central point of funding and authority for development you guys have nothing to say.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "dxtpw3w",
                            "author": "CityBusDriverBitcoin",
                            "score": 10,
                            "created_utc": 1524486238.0,
                            "response": "Look how cute this troll is :)",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "dxtrsjc",
                            "author": "Raineko",
                            "score": 6,
                            "created_utc": 1524488849.0,
                            "response": "The fact that the only names you know are Roger and Jihan shows that all you have done is consume spoonfed propaganda.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "dxu3jgk",
                                    "author": "Amichateur",
                                    "score": -1,
                                    "created_utc": 1524500648.0,
                                    "response": "just because he named just 2 he knows just two?\n\nManipulative \"logic\" - as usual. That's how scum is acting.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "dxue4tv",
                                            "author": "Raineko",
                                            "score": 0,
                                            "created_utc": 1524510198.0,
                                            "response": "No he named the 2 people that are always mentioned by Core trolls and labeled as frauds on the censored subreddit, so I think it is very unlikely that he has any actual understanding about the scaling debate.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "id": "uskd1v",
            "title": "We have 4 new Bitcoin Agents in Guarico and Aragua - Venezuela!",
            "url": "https://www.reddit.com/r/btc/comments/uskd1v/we_have_4_new_bitcoin_agents_in_guarico_and/",
            "author": "Joseignacioarajo",
            "created_utc": 1652901109.0,
            "score": 29,
            "num_comments": 8,
            "subreddit": "btc",
            "selftext": "&#x200B;\n\nhttps://preview.redd.it/8lh4r4w1aa091.jpg?width=1080&format=pjpg&auto=webp&s=640d8e5ba466df1c8ce4cf5deecbf65f4a5b702f\n\nhttps://preview.redd.it/9z3i1je2aa091.jpg?width=960&format=pjpg&auto=webp&s=a1e05030ea9a10c7768058249162e3353bac5aa2",
            "stickied": false,
            "comments": [
                {
                    "id": "i94csba",
                    "author": "Remora_101",
                    "score": 3,
                    "created_utc": 1652907078.0,
                    "response": "Nice!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia0yfjp",
                            "author": "Joseignacioarajo",
                            "score": 1,
                            "created_utc": 1653537828.0,
                            "response": "Of course :)",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i94nz29",
                    "author": "EmergentCoding",
                    "score": 2,
                    "created_utc": 1652911835.0,
                    "response": "Adoption. It's how Bitcoin Cash becomes electronic cash for the world.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia0ybp0",
                            "author": "Joseignacioarajo",
                            "score": 1,
                            "created_utc": 1653537764.0,
                            "response": "Thank you so much",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}