{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uxddcd",
            "title": "On common FUD about Bitcoin",
            "url": "https://www.reddit.com/r/btc/comments/uxddcd/on_common_fud_about_bitcoin/",
            "author": "cryptoundead",
            "created_utc": 1653470070.0,
            "score": 0,
            "num_comments": 11,
            "subreddit": "btc",
            "selftext": "I hear a lot of FUD in the mainstream media about Bitcoin being this risky zero-sum ponzi scheme. Bitcoin has no value, it's rat poison squared, you all know the lines, we all heard it.  \nI undestood Bitcoin in the first second after hearing about it, why? The first place I heard about Bitcoin was on a private torrent site, where they accepted bitcoin donations. Everything made sense immediately.  \nThere is nothing innovative about blockchain. The term cryptocurrency is more of a buzz word and a gimmick at this point, the decentralized technology behind the blockchain existed way before Bitcoin came around.  \nBlockchain innovation is in it being used for wealth and value transfer. It's a long proven secure way of storing data. It has been around for many many years yet some people struggle to understand it to this day.  \nWe know for a fact it cannot be stopped - they tried, not just for Bitcoin, but all the private and public torrent sites out there. They seize their domain names and the next day you find another 20 proxy domains for the same website.  \nIf you think that has no value, then I don't know what else to say.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9wy5rn",
                    "author": "LovelyDayHere",
                    "score": 3,
                    "created_utc": 1653470411.0,
                    "response": "> The term cryptocurrency is more of a buzz word\n\nHmm, to those of us who use it regularly, it isn't\n\n> It's a long proven secure way of storing data.\n\nNot really for general data storage. Any tech that's < 15 years old in that field is still relatively new and can't really claim to be \"proven\".",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9xg401",
                            "author": "cryptoundead",
                            "score": 1,
                            "created_utc": 1653482776.0,
                            "response": "The only argument here is how you define proven. I guess the network could be 100 years  old and there would still be people who doubt it saying it has still not proven itself. Gold worked for thousands of years.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9x0975",
                    "author": "Kay0r",
                    "score": 3,
                    "created_utc": 1653472253.0,
                    "response": "> There is nothing innovative about blockchain  \n> I undestood Bitcoin in the first second after hearing about it\n\nIf you did, you would have understood that the blockchain concept is something that have never existed on this earth, and most importantly the implications of using it.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9xacmx",
                            "author": "cryptoundead",
                            "score": 1,
                            "created_utc": 1653479556.0,
                            "response": "It did exist, people just didn't call it that. All blockchain is, it's a decentralized network of computers used to securely store data.\n\nMining itself is just an incentive to make sure people keep storing data. The math the miners do is only there to decide who gets to validate (store) the transaction first. Mantaining a blockchain does not require mining (that's why the word crypto is a gimmick), that's why proof of stake is even possible. All this consensus algos are just incentives for people to keep the network alive and you don't have something like dead torrent when nobody is seeding anymore.\n\nCrypto is just a different application of a previously existing technology.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9xemc7",
                                    "author": "jessquit",
                                    "score": 2,
                                    "created_utc": 1653481989.0,
                                    "response": "A blockchain is more than \"a decentralized network of computers used to securely store data.\"  Proof of Work is the key ingredient that makes the data secure.  Prior to blockchain, there was no decentralized way to ensure that the data were secure and that write access remained decentralized.\n\n> The math the miners do is only there to decide who gets to validate (store) the transaction first.\n\nThis is only partially true.  The more important feature is that the application of work onto the chain tip makes each block successively harder to reverse.  This did not exist before blockchain.\n\nAnd then we can talk about maintaining consensus on the rules in a decentralized adversarial environment.....",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9xf2jp",
                                            "author": "cryptoundead",
                                            "score": 1,
                                            "created_utc": 1653482229.0,
                                            "response": "They are called torrents look it up. Proof of stake blockchains are still blockchains, you dont need proof of work or mining to have a blockchain. Proof of work is just an incentive to make sure people have a reason to store the data. The data itself can be stored without incentives but that bring uncertainty to the network.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9xfujh",
                                                    "author": "jessquit",
                                                    "score": 2,
                                                    "created_utc": 1653482639.0,
                                                    "response": ">They are called torrents look it up.\n\nTorrents are not blockchains, they are not immutable, and do not have a consensus forcing mechanism.\n\n>  Proof of work is just an incentive to make sure people have a reason to store the data. \n\nNo, this is incorrect. PoW freezes the state because an ever increasing amount of work is required to undo the chain.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i9xghhj",
                                    "author": "Kay0r",
                                    "score": 1,
                                    "created_utc": 1653482966.0,
                                    "response": "No it did not exist.  \nYou're confusing Distributed Computing with Byzantine Fault Tolerance. The latter is, to this day, considered a problem impossible to solve, theoretically speaking.  \nWhat blockchain tech do is solving BFT on a *practical* level, and it is the only known technology that deal with the problem.  \nMost of your assumptions are based on your incomplete knowledge of the tech.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9wy9j2",
                    "author": "porpoisebuilt",
                    "score": 1,
                    "created_utc": 1653470500.0,
                    "response": "Not sure about public and private torrent sites…..but cryptography predates BTC (obviously) as does some or most of the intellect in the above fore mentioned crypto. Not common, and unique, are the fundamental principles of peer to peer transactions without a third party. Simple sounding, revolutionary for a centralised monetary system overseen and sanctioned by seemingly less democratic governments.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9xfqop",
                            "author": "cryptoundead",
                            "score": 1,
                            "created_utc": 1653482582.0,
                            "response": "Yes, using blockchain for monetary value is unique, but the tech behind a blockchain was implemented long before cryptocurrency. It is used to share any sort or files peer to peer in a decentralized network. Proof of work is new, but blockchain does not rely on it. Its just an incentive layer on top of a torrent-like network.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}