{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uu4my7",
            "title": "Microstrategy CEO Expects Bitcoin to 'Go Into the Millions' Despite Crypto Market Sell-Off. Could Bitcoin Actually hit the Million Mark in the Long Run?",
            "url": "https://www.reddit.com/r/btc/comments/uu4my7/microstrategy_ceo_expects_bitcoin_to_go_into_the/",
            "author": "Bowiedku",
            "created_utc": 1653071843.0,
            "score": 20,
            "num_comments": 5,
            "subreddit": "btc",
            "selftext": "Michael Saylor, the CEO of Microstrategy, spoke with Yahoo Finance Live on Thursday about his bitcoin prognosis.\nDespite the latest sell-off, the executive remains bullish on bitcoin. He was asked if Microstrategy had a price goal for when it will begin liquidating some of its bitcoins. The corporation presently has 129,218 BTC in its possession.\n\"We are in it for the long haul,\" the CEO said emphatically. \"Our approach is to acquire bitcoin and hold bitcoin, therefore there is no price target,\" he explained. I believe we'll be buying bitcoin at the local peak for the rest of our lives.\" He proceeded, saying:\n\nBitcoin, I believe, will reach millions of dollars. As a result, we're incredibly patient. We believe it is the currency of the future.\n\"There's been a deadlock in D.C. and on Capitol Hill around stablecoin regulations and around securities token regulations,\" he said of cryptocurrency regulation. \"The Administration wants to move faster,\" Saylor continued, \"but Congress is moving slower.\"\n\nSaylor has long been a bitcoin bull. He stated in February that there is evidence of much greater institutional acceptance. He predicted that bitcoin would become a $100 trillion asset class in November of last year.\n\nIn my opinion the world is beginning to recognise the value of Bitcoin has we are seeing an influx of the rate of adoption of Bitcoin use with government and commercial entities. The innovative nature of Bitcoin's technology would cause it's value to increase exponentially overtime. I don't think that anyone who really understands Bitcoin is concerned about price valuation of the cryptocurrency and would be more focused on how Bitcoin would in coming years would revolutionize the global financial system, by becoming the global standard for monetary transaction of value. \n\nThe rapidly developing blockchain ecosystem is an indicator of how cryptocurrencies and the metaverse would come to be an integral part of society. Innovative projects catering to diverse from gaming to payment that could potentially revolutionize these sectors are being created such as Decentraland  an online world that allows users to create their own avatars and purchase plots of virtual land, Planet Maya which is powered by champions games is  a decentralized and collaborative online casino which allows developers to build Games around betting,Luckyblock which  is a digital asset project that decentralizies the lottery process via blockchain technology, PancakeSwap a decentralized  exchange allows users to buy and sell digital tokens without going through a third party. Blockchain technology is on par to become utilized in different sectors of day to day life from Insurance ,marketing, to education. When this eventually does happen it would cause a significant increase in the value of Bitcoin and other cryptocurrencies. \n\nWith all this it is quite possible to see Bitcoin value hit the millions and it might not be a question of if but when. I think most people selling Bitcoin because of  the downward tutn of price didn't bother to research Bitcoin and just got in because of previous bull markets frenzies or they are in dire need of cash.\n\nNews source  :https://news.bitcoin.com/microstrategy-ceo-expects-bitcoin-to-go-into-the-millions-despite-crypto-market-sell-off/",
            "stickied": false,
            "comments": [
                {
                    "id": "i9d563w",
                    "author": "Remora_101",
                    "score": 2,
                    "created_utc": 1653073964.0,
                    "response": "Man if I have to read this fucking name here too I'm gonna break something. Get this mf muppet snakeoil salesmen out of my sight.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9d3n0d",
                    "author": "PanneKopp",
                    "score": 1,
                    "created_utc": 1653073236.0,
                    "response": "sure he wants the Ponzi to ride on finding a bigger fool to sell his bags",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9d57ag",
                            "author": "ApplicationAny1434",
                            "score": 1,
                            "created_utc": 1653073980.0,
                            "response": "If his stock ever go back to old dotcom bubble highs. I dump it on him lol.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}