{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "utqktu",
            "title": "Make an Income Doing What You Love",
            "url": "https://www.reddit.com/r/btc/comments/utqktu/make_an_income_doing_what_you_love/",
            "author": "flipsis",
            "created_utc": 1653040203.0,
            "score": 2,
            "num_comments": 0,
            "subreddit": "btc",
            "selftext": "&#x200B;\n\n[  ](https://preview.redd.it/ejreysworl091.png?width=495&format=png&auto=webp&s=2ab1a7eeab93dde97da94dfef2df7cbf4ad4bdde)\n\n*The easy way to make money. Earn money from subscriptions, premium posts and paid live streams.*\n\n## Become a Creator\n\nJoin our community now and start growing yours while generating money easily! Creative can use many features. For example, creators can earn money. What you need to do for this is very simple. Register and click the Become a Creator button. Making money is not far off. Come on, be a creator.\n\nLike, comment, create new posts and earn money!\n\n[Twikii | Support Creators Content](https://twikii.com/)",
            "stickied": false,
            "comments": []
        },
        {
            "id": "utqo7v",
            "title": "I have no doubt that cryptocurrencies will be around for a long time",
            "url": "https://www.reddit.com/r/btc/comments/utqo7v/i_have_no_doubt_that_cryptocurrencies_will_be/",
            "author": "AdReal4844",
            "created_utc": 1653040414.0,
            "score": 0,
            "num_comments": 0,
            "subreddit": "btc",
            "selftext": "There are so many reasons why cryptocurrencies are going to stay, they're like going nowhere and I dunno why some people doubt that.  \n\n\nI really wouldn't like the fact that the big amount of money that went to Ethereum gas fees was a waste until I started using Metis lol. Kidding ofc, but seriously what's the reason someone would've thought something like that?   \n\n\nJust keep in mind the fact that there are only 21 million bitcoins in existence and it is estimated that there will only be 18 million by the year 2040. However, this limited supply combined with increasing demand from investors will likely continue to drive up prices. And who knows what other currencies are going to be huge as Ethereum or Bitcoin until 2040, probably we would have some new crypto that popped out.   \n\n\nThe Crypto market is here to stay and is expected to continue growing at an exponential rate. Investors find cryptocurrency attractive, and crypto is showing high returns.  \n\n\nIf you've ever doubted it in this, what was the reason for that?  \n\n\nThe most popular reason why people are crazy about crypto is the fact that cryptocurrency has created a new way to store and transfer value and it's making  t possible for people to buy and sell goods and services without the need for a middleman and ofc  providing  ways for people to escape from government control and censorship  \n\n\nIn fact, cryptocurrency is still in its early stages of development, what do you think about all of this, can you even imagine the end of crypto?",
            "stickied": false,
            "comments": []
        }
    ]
}