{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ur12bg",
            "title": "Roger Ver on Twitter: Everyone should read the Bitcoin white paper. Anyone who does will notice that it isn’t describing BTC",
            "url": "https://twitter.com/rogerkver/status/1526221542723846146",
            "author": "btcxio",
            "created_utc": 1652721586.0,
            "score": 112,
            "num_comments": 58,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8vbaco",
                    "author": "mtrycz",
                    "score": 18,
                    "created_utc": 1652735677.0,
                    "response": "That's one way to say it. A very concise way.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8vjvmu",
                            "author": "undadatunda",
                            "score": 11,
                            "created_utc": 1652739416.0,
                            "response": "whats the point of a 'trustless' system if it just turns back into 'trusted' i.o.u's?\n\nthats the funny part is that basically 'all' of the coins have turned back into 'trusted' i.o.u's and so basically the laws of supply and demand dont work with 'trusted' i.o.u's\n\nsilver being a great example cuz they say there is now over 800 times the paper silver in the world vs real silver\n\nprice discovery is in the same place where all of the trusted i.o.u's are..its like its soo obvious people are blind to it\n\nelon musk explains shorting in this vid starts at about 42 mins in https://www.youtube.com/watch?v=YAtLTLiqNwg and he repeats it again in the latest ted talk too https://www.youtube.com/watch?v=cdZZpaB2kDM from 1 month ago",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8wsgup",
                                    "author": "wtfCraigwtf",
                                    "score": 5,
                                    "created_utc": 1652762522.0,
                                    "response": ">they say there is now over 800 times the paper silver in the world vs real silver\n\nactually that's a huge bullish indicator for physical silver\n\nwhen the rehypothecation stops, silver goes 10x\n\nBut most \"Bitcoin\" being fake is different, because the Tether used to buy it is also fake!",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8xblv0",
                                            "author": "undadatunda",
                                            "score": 1,
                                            "created_utc": 1652778163.0,
                                            "response": "i dont think any i.o.u's have ever stopped with anything..so thats wishful thinking\n\nsame with the shorting which has been going on for about 100 yrs now\n\nthis is why those cypherpunks spent so much time searching for the solution to the problem until they discovered bitcoin..now with math we can verify and do proof of reserves instantly for anyone\n\ni think the traiters(paper bitcoiners) biggest fear is that bitcoin keeps forking..and forks sooo much like 50+ forks a day dropped into the hodlers hands that no sane person would dare to hold paper bitcoin over real bitcoin cuz then they would miss out on all of the forks\n\ni think thats the only way to solve the paper bitcoin i.o.u's problem..and they banned me in the r bitcoin sub for talking about that..so that tells me that the mods in that sub are likely wrapped up in the paper bitcoin world(traiters)",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8vrxmc",
                    "author": "bitmeister",
                    "score": 13,
                    "created_utc": 1652743161.0,
                    "response": "The number of BSV shill responses is staggering.\n\nSaylor's response isn't much enlightened either:\n\n> Bitcoin has outgrown the cognitive limits of any individual or information limits of any document. - Michael Saylor\n\nSpoken like a true purveyor of snake oil.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8vd2f7",
                    "author": "phillipsjk",
                    "score": 9,
                    "created_utc": 1652736435.0,
                    "response": "I am not so sure: [many] people who [bought] since 2017 probably never tried to transfer any BTC. Exchanges, especially the \"exchanges\" that don't allow you to withdrawal BTC, hide how expensive it actually is to use the network.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8vdze0",
                    "author": "PublicCurrency9039",
                    "score": 9,
                    "created_utc": 1652736832.0,
                    "response": "Very nicely put, Roger!!! It was supposed to be a P2P electronic cash, and that is BCH, today!!! BCH is fulfilling that role of what BTC was meant to be, and then some!!!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8vv4sj",
                    "author": "elguapo4twenty",
                    "score": 5,
                    "created_utc": 1652744727.0,
                    "response": "No truer words!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8y0iqy",
                    "author": "capistor",
                    "score": 2,
                    "created_utc": 1652794679.0,
                    "response": "The controversial fork never would have happened without censorship. Getting Twitter back is a big deal. Everyone get on Twitter and make noise.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8vdrey",
                    "author": "JustMyTwoSatoshis",
                    "score": -7,
                    "created_utc": 1652736734.0,
                    "response": "\"The majority decision is represented by the longest chain, which has the greatest proof-of-work effort invested in it.\"\n\nBCH has implemented emergency difficulty adjustment and checkpoints specifically to omit this part of the whitepaper from its design.\n\nWhen a minority fork shitcoin pretends to be the real thing while diverting multiple consensus mechanisms that the white paper describes would determine the real thing, it's laughable.\n\nThe whole entire point of Bitcoin was decentralized money. So much for that with BCH:\n\nhttps://twitter.com/rogerkver/status/1063123138081370112\n\n/u/memorydealers I've noticed you never comment on this time you hijacked your pool's BTC hashrate to carry out a centralized upgrade/attack on BCH.\n\nEDIT: /u/FreeFactoid blocked me. My response to him would be:\n\nI do not speak for or represent blockstream. You'll see I'm also currently arguing the uselessness of LN in another thread.\n\nNothing I said was even slightly dishonest. That's a quote from the whitepaper and  quote from Roger Ver himself.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8vh2uj",
                            "author": "FreeFactoid",
                            "score": 6,
                            "created_utc": 1652738173.0,
                            "response": "When will the dishonesty end? \n\nhttps://www.businesstelegraph.co.uk/blockstream-when-will-the-level-of-dishonesty-and-manipulation-end/",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8wb3ak",
                            "author": "Remora_101",
                            "score": 3,
                            "created_utc": 1652752722.0,
                            "response": "> \"The majority decision is represented by the longest chain, which has the greatest proof-of-work effort invested in it.\"\n\nNakamoto conesus only works if chains can interact. Since the blocksize war was a social decision. The longest chain can not automatically seen as Bitcoin. One can argue that Segwit removed the \"chain of signature\"  feature from bitcoin and is there not Bitcoin anymore. The point is, none of that can be decided by nakamoto consensus.\n\n\n>The whole entire point of Bitcoin was decentralized money. \n\nBTC is not money anymore, didn't you get the memo? https://twitter.com/DavidShares/status/1526171371004473346",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8wcs0y",
                                    "author": "JustMyTwoSatoshis",
                                    "score": -3,
                                    "created_utc": 1652753566.0,
                                    "response": "Segwit is an opt in soft fork and did not change consensus. Hence no hardfork. That’s by definition\n\nBCH implemented an EDA to disallow Nakamoto consensus. BCH literally does not follow nakamoto consensus with BTC, BSV, or any other fork. It’s literally called nakamoto consensus, BCH doesn’t follow it, and you guys claim it is satoshi’s Bitcoin 😂😂😂\n\nYou can make whatever excuses you want.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8wf997",
                                            "author": "Remora_101",
                                            "score": 4,
                                            "created_utc": 1652754824.0,
                                            "response": ">Segwit is an opt in soft fork and did not change consensus.\n\nThat is false. Softforks narrow the rules any node that did not update would fork of. It did change consensus, both ways to fork do Hardforks widen the rules Softforks narrow them. \n\n\n>BCH implemented an EDA to disallow Nakamoto consensus. BCH literally does not follow nakamoto consensus with BTC, BSV, or any other fork. It’s literally called nakamoto consensus, BCH doesn’t follow it, and you guys claim it is satoshi’s Bitcoin\n\nAgain you did not understand what nakamoto consus is. I bet you would not accept BSV as bitcoin even if Faketoshi would by all the hasrate and BSV would surpass BTC in PoW. \n\n\n>You can make whatever excuses you want.\n\nYou can start using your brain, pl kk thx bye.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8wfrlo",
                                                    "author": "JustMyTwoSatoshis",
                                                    "score": 2,
                                                    "created_utc": 1652755088.0,
                                                    "response": "You can literally run a pre-segwit version of core or another Bitcoin client and it will verify consensus with the current Bitcoin chain…\n\nThere are many nodes and miners that still today don’t accept process segwit transactions \n\nYes of course if BSV or BCH had became the chain with the most cumulative sha-256 work that still spawned from the genesis block, that would be bitcoin.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8wh33e",
                                                            "author": "Remora_101",
                                                            "score": 4,
                                                            "created_utc": 1652755780.0,
                                                            "response": ">You can literally run a pre-segwit version of core or another Bitcoin client and it will verify consensus with the current Bitcoin chain\n\nYes but the node will also accept tx that are segwit as \"everyone can spend\" if that happens all segwit nodes will reject the block while your node will accept it. The key part why this isn't happening is because all miner nodes run segwit nodes. There is no hashpower to built a block on the old rules. Which is kinda ironic since it means for the network to work and not fork all miner nodes ARE REQUIRED to upgrade. There is no backwards compatibility. And also ironic, that it shows, non-mining nodes have no power, another false argument often heard from the BTC crowd.\n\n\n>Yes of course if BSV or BCH had became the chain with the most cumulative sha-256 work that still spawned from the genesis block, that would be bitcoin.\n\nDon't dismiss it as BTC has won. If you want to apply nakamoto consensus, then the game is still on, if BSV overtakes BTC you have to call it Bitcoin. Let me say that I very much doubt that you would accept BSV as Bitcoin.\n\nOr how about ETH overtaking BTC in work done?",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8zdnrs",
                                                                    "author": "tl121",
                                                                    "score": 3,
                                                                    "created_utc": 1652815041.0,
                                                                    "response": "The amount of “work” done depends on the specific consensus rules.  Indeed,  these rules must define how to compare the “work” of a given chain.  \n\nExample 1.  Satoshi’s white paper said the following:  “The majority decision is represented by the longest chain, which has the greatest proof-of-work effort invested in it.”     This statement was ambiguous because it did not take into account difficulty adjustments.  A code change was required to fix what was admitted to be a bug.  \n\nExample 2.  ETH uses a different hash algorithm.  How is it possible to compare the amount of “work” in the ETH and BTC blockchains?",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i8zf3i2",
                                                                            "author": "Remora_101",
                                                                            "score": 1,
                                                                            "created_utc": 1652815626.0,
                                                                            "response": "example 1 has nothing to do with the problem?!?\n\nexample 2 is exactly my point why JustMyTwoSatoshis can't use nakamoto consensus to determine wich fork is the \"real\" Bitcoin.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i90de7y",
                                                                                    "author": "tl121",
                                                                                    "score": 3,
                                                                                    "created_utc": 1652830614.0,
                                                                                    "response": "Example one is the subtle one.  It raises a lot of questions based on a lack of precise and critical definitions.  \n\nWhat is bitcoin?  How is it defined?  Where is it defined? Who gets to decide?  How do they decide?   What disciplines are useful for making these decisions?  Does any of this matter?",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i90ex7c",
                                                                                            "author": "Remora_101",
                                                                                            "score": 1,
                                                                                            "created_utc": 1652831355.0,
                                                                                            "response": "Use less drugs.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "id": "i8whiw7",
                                                                    "author": "JustMyTwoSatoshis",
                                                                    "score": 1,
                                                                    "created_utc": 1652756015.0,
                                                                    "response": "> The key part why this isn't happening is because all miner nodes run segwit nodes. There is no hashpower to built a block on the old rules. Which is kinda ironic since it means for the network to work and not fork all miner nodes ARE REQUIRED to upgrade. There is no backwards compatibility. And also ironic, that it shows, non-mining nodes have no power, another false argument often heard from the BTC crowd.\n\nPerhaps that's why they patiently waited months for 95% consensus for two weeks straight before it activated?\n\n>Let me say that I very much doubt that you would accept BSV as Bitcoin.\n\nCool, now you are just arguing with someone with thoughts that you want them to have. An imaginary person.\n\n>Or how about ETH overtaking BTC in work done?\n\nNot two forks of the same chain.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i8x91qu",
                                                                            "author": "Remora_101",
                                                                            "score": 1,
                                                                            "created_utc": 1652775797.0,
                                                                            "response": ">Cool, now you are just arguing with someone with thoughts that you want them to have. An imaginary person.\n\nNo, read again. I just do not believe you. \n\n\n\n\n>Perhaps that's why they patiently waited months for 95% consensus for two weeks straight before it activated?\n\nlol is this your answer to the fact that I utterly destroyed your argument. What do you even say here?",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        },
                                                                        {
                                                                            "id": "i91hmhl",
                                                                            "author": "phillipsjk",
                                                                            "score": 1,
                                                                            "created_utc": 1652851643.0,
                                                                            "response": "> Perhaps that's why they patiently waited months for 95% consensus for two weeks straight before it activated?\n\nExcept the core developers overrode [the wishes of miners](https://dcgco.medium.com/bitcoin-scaling-agreement-at-consensus-2017-133521fe9a77): [within a week of the soft-fork](https://github.com/bitcoin/bitcoin/pull/10982).\n\nThat patch made it impossible for any commercially relevant nodes to safely upgrade for the scheduled hard-fork.\n\nIf the Core devs were truly worried about \"consensus\", they would have implemented the 2MB base block upgrade instead of actively blocking it.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i91sd2i",
                                                                                    "author": "JustMyTwoSatoshis",
                                                                                    "score": 1,
                                                                                    "created_utc": 1652860438.0,
                                                                                    "response": "You guys literally backed out first with the exact for you wanted",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i947zww",
                                                                                            "author": "phillipsjk",
                                                                                            "score": 1,
                                                                                            "created_utc": 1652905127.0,
                                                                                            "response": "A hard-fork is the only way to opt out of a \"soft-fork\".\n\nAlso in the [Hong Kong agreement that the Core developers quickly distanced themselves from](https://medium.com/@bitcoinroundtable/bitcoin-roundtable-consensus-266d475a61ff), miners agreed to only run the Core software. That is why the Core developers had so much power to prevent scaling.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "i8x27vq",
                                                            "author": "LovelyDayHere",
                                                            "score": 3,
                                                            "created_utc": 1652769721.0,
                                                            "response": ">You can literally run a pre-segwit version of core or another Bitcoin client and it will verify consensus with the current Bitcoin chain…\n\nNo it doesn't.\n\nIt just doesn't know that it doesn't.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8x2b5c",
                                                                    "author": "JustMyTwoSatoshis",
                                                                    "score": 1,
                                                                    "created_utc": 1652769798.0,
                                                                    "response": "Then its consensus rules aren’t in violation",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i8x398t",
                                                                            "author": "LovelyDayHere",
                                                                            "score": 3,
                                                                            "created_utc": 1652770614.0,
                                                                            "response": "Actually they are.\n\nIf a nonupgraded node tries to a transaction which clashes with the rules of the soft fork but is perfectly valid before the upgrade, such a transaction is not accepted.\n\nThat goes to show the nonupgraded nodes are not in consensus.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "id": "i8xd8gb",
                                                                    "author": "trakums",
                                                                    "score": 1,
                                                                    "created_utc": 1652779666.0,
                                                                    "response": "Just look at the stats. There exist pre segwit nodes right now as I am writing this.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i8xdqwh",
                                                                            "author": "LovelyDayHere",
                                                                            "score": 1,
                                                                            "created_utc": 1652780130.0,
                                                                            "response": "Someone forgot to upgrade and is no longer fully validating.\n\nNow they have nodes which don't understand the true consensus on BTC.\n\nShould we feel sorry for them?",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i8xfd3t",
                                                                                    "author": "trakums",
                                                                                    "score": 1,
                                                                                    "created_utc": 1652781555.0,
                                                                                    "response": "Why feel sorry? As long as the node owner doesn't care about segwit (because Segwit actually IS an opt in) the node only neds to verify his classic transactions.   \nMaybe the owner will upgrade his node if the fees rise.    \nCurrently the fees are fine.    \nhttps://bitcoinvisuals.com/bitcoind-minfee",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i8z9nkr",
                                            "author": "tl121",
                                            "score": 1,
                                            "created_utc": 1652813402.0,
                                            "response": "It is useless to argue with sophists, liars, idiots, fools, sock puppets or bots, ….",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i90747a",
                                                    "author": "JustMyTwoSatoshis",
                                                    "score": 1,
                                                    "created_utc": 1652827634.0,
                                                    "response": "Easier to dismiss facts than try to understand them",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i90c77n",
                                                            "author": "tl121",
                                                            "score": 1,
                                                            "created_utc": 1652830038.0,
                                                            "response": "Statements.  Not facts.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i90drhu",
                                                                    "author": "JustMyTwoSatoshis",
                                                                    "score": 1,
                                                                    "created_utc": 1652830796.0,
                                                                    "response": "> Segwit is an opt in soft fork\n\nfact\n\n>BCH implemented an EDA to disallow Nakamoto consensus\n\nfact\n\n>BCH literally does not follow nakamoto consensus with BTC, BSV, or any other fork. It’s literally called nakamoto consensus, BCH doesn’t follow it, and you guys claim it is satoshi’s Bitcoin\n\nfacts",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i90fyil",
                                                                            "author": "tl121",
                                                                            "score": 1,
                                                                            "created_utc": 1652831863.0,
                                                                            "response": "Nakamoto consensus was never properly defined from the perspective of computer science.  A white paper was written which was imprecise, as technical marketing documents must be.  There was no formal specification, backed up by mathematical proofs of correctness.  There was a belief and a public statement that there should only be a single implementation of bitcoin.  Later, this turned into “code is law”.  Eventually, after there were multiple competing codebases there were DDoS attacks on nodes.  \n\nMost of the players, possibly all of them, were clueless, lacking skills in one or more of the critical areas which included many disciplines across the hard sciences and the social sciences.  \n\nIt is no wonder that the entire cryptocurrency space is AFU.  You didn’t have to be a conspiracy theorist to see this coming. This is not to diminish the greatness of Satoshi’s invention because he was not a renaissance man, just a normal genius.  \n\nThe question is where do we go from here?",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i90gsse",
                                                                                    "author": "JustMyTwoSatoshis",
                                                                                    "score": 1,
                                                                                    "created_utc": 1652832273.0,
                                                                                    "response": "> Nakamoto consensus was never properly defined from the perspective of computer science. A white paper was written which was imprecise, as technical marketing documents must be. There was no formal specification, backed up by mathematical proofs of correctness. There was a belief and a public statement that there should only be a single implementation of bitcoin. Later, this turned into “code is law”. Eventually, after there were multiple competing codebases there were DDoS attacks on nodes.\n\nHahaha oh my god try applying this logic to \"peer to peer cash\"\n\nHe describes the consensus mechanisms in pretty good detail for a high level whitepaper.\n\n>The question is where do we go from here.\n\nWherever it makes sense for each individual to want to go. It's a free world. People will use crypto for whatever it is useful to them for. You can resent them for that if you want. I embrace it and seek out the solutions for my problems and don't expect others to do any more than that either.",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8vq9kv",
                            "author": "Br0kenRabbitTV",
                            "score": 2,
                            "created_utc": 1652742355.0,
                            "response": "The person that blocked you loves leaving a comment then blocking any response.\n\nDid the same to me recently.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}