{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uw7uaj",
            "title": "CFTC Chairman Confirms Bitcoin, Ether Are Commodities. Are Regulations good for the Growth of the Crypto Ecosystem?",
            "url": "https://www.reddit.com/r/btc/comments/uw7uaj/cftc_chairman_confirms_bitcoin_ether_are/",
            "author": "Juliet_bv",
            "created_utc": 1653333124.0,
            "score": 1,
            "num_comments": 0,
            "subreddit": "btc",
            "selftext": "In an interview with CNBC last week, CFTC Chairman Rostin Behnam discussed the CFTC and SEC's supervision of cryptocurrencies.\nThe chairman was asked for his thoughts on a plan in Congress that would place the Securities and Exchange Commission in control of security tokens and the Commodities Futures Trading Commission in charge of commodity tokens.\n\n\"This is a long-standing dispute between the CFTC and the SEC. We had a fantastic history together... Commodities should be regulated by the Commodity Futures Trading Commission, and securities should be regulated by the Securities and Exchange Commission,\" Behnam explained.\n\nSome currencies in the crypto world will be securities, while others will be commodities, according to the CFTC chairman.\n\nWhen asked about SEC Chairman Gary Gensler's contention that most crypto tokens are securities, Behnam emphasized that the most popular cryptocurrencies are commodities. He stressed:\n\nI can say with certainty that bitcoin... is a commodity As well as Ether \n\n I think regulation of Bitcoin could potentially be good or bad for the mainstream adoption of Cryptocurrencies.\nRegulation could help prevent scams and protect the interest of users, regulations would create a framework for investors to work with to further expand the growth of the ecosystem. Regulation would help accelerate the mainstream adoption of Bitcoin. \n\nAlso one has to consider the blockchain ecosystem which continues to experience exponential growth by enabling the creation of innovative projects such as\nDecentraland  an online world that allows users to create their own avatars and purchase plots of virtual land, Planet Maya which is powered by champions games is  a decentralized and collaborative online casino which allows developers to build Games around betting, Luckyblock which  is a digital asset project that decentralizies the lottery process via blockchain technology and many more that could change how diverse industries operate from real estate, gaming, insurance, academia. The need for regulation increases as blockchain technology becomes more mainstream and becomes a part of different industries of human endeavour.\n\nI think it is quite ironic that a decentralized network should be subject to regulation by a central body but a much needed evil it Bitcoin is to become mainstream.\nRegulations could mean that Bitcoin is subject to the whims of these regulatory bodies making the decentralized network lose it's decentralized nature indirectly. It will be interesting to see how these regulatory bodies regulate Bitcoin. \n\n\nNews Source: \nhttps://news.bitcoin.com/cftc-chairman-confirms-bitcoin-ether-are-commodities/",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uw7t29",
            "title": "Tether revealed it owns $286 million on non-Us government bonds, which coincides with the amount of money an entity paid for La Geo’s stocks -an electric firm funded by the Salvadoran state- two weeks ago. La Geo was supposed to back the now delayed Bitcoin bonds.",
            "url": "https://twitter.com/ricardovalp/status/1528772559709163520",
            "author": "Remora_101",
            "created_utc": 1653333030.0,
            "score": 55,
            "num_comments": 56,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9s5yle",
                    "author": "moreno187",
                    "score": 4,
                    "created_utc": 1653377452.0,
                    "response": "Tether is the FED in crypto.. they do as they wish .. print .. print ... It's all a scam .. which scam do you invest in ?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9qa8mi",
                    "author": "Egon_1",
                    "score": 16,
                    "created_utc": 1653339893.0,
                    "response": "Translation: Tether invested (or just on paper) in highly secure El Salvadorian bonds, better than Chinese commercial papers /s",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9rtuho",
                            "author": "meatloaf-toaster",
                            "score": 4,
                            "created_utc": 1653367934.0,
                            "response": "So they bribed them?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9s7lfs",
                                    "author": "mendelua",
                                    "score": 4,
                                    "created_utc": 1653378938.0,
                                    "response": "This means that Tether's currency's actual worth increases or decreases based on the economic situation of El Salvador, and if you were a Tether user who wanted your money back.\n\nYou wouldn't be able to get it if the Salvadoran economy or government collapses.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9shelt",
                            "author": "exetherasta",
                            "score": 3,
                            "created_utc": 1653387900.0,
                            "response": "Tether is supposed to have a lot of cash on hand. Now they're saying some of the \"cash\" they have is in the form of El Salvadoran government bonds.\n\nIt would already be bizarre, if the Salvadoran PM hadn't sunk a lot of the country's money into bitcoin schemes.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9pwhge",
                    "author": "Zyoman",
                    "score": 6,
                    "created_utc": 1653333957.0,
                    "response": "So 3 weeks ago it had 0?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9qkv4a",
                    "author": "gotamd",
                    "score": 4,
                    "created_utc": 1653344799.0,
                    "response": "That is awfully coincidental.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9qahq0",
                    "author": "Ronoh",
                    "score": 5,
                    "created_utc": 1653340007.0,
                    "response": "Trust Tether! What can go wrong? /s",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9stz5k",
                            "author": "mattbrow",
                            "score": 2,
                            "created_utc": 1653396234.0,
                            "response": "I don’t trust these guys for a second, was just pointing out that the amount is negligible. That being said their numbers overall are likely fake. \n\nWithout a full audit we must assume that all balances listed on the “atteststion” are nothing more than a flash loan lol.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9r9uxh",
                    "author": "FreeFactoid",
                    "score": 2,
                    "created_utc": 1653356995.0,
                    "response": "We shouldn't trust USDT nor use it but we don't really know how much it's really backed by liquid asset. Could be a little but could also be a lot.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9rymbs",
                            "author": "mtrycz",
                            "score": 4,
                            "created_utc": 1653371375.0,
                            "response": "If it was all cash then 1. There would have been no secret sauce, 2. They would have made an audit pronto.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9snpq2",
                                    "author": "jleval1982",
                                    "score": 1,
                                    "created_utc": 1653392508.0,
                                    "response": "If El Salvador didnt default during whatever the full period of the bond (probably 10 years?) then it’s a great investment!\n\nBut we shall see, lol .",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9sq30j",
                                            "author": "mtrycz",
                                            "score": 2,
                                            "created_utc": 1653393981.0,
                                            "response": "> it’s a great investment\n\nIt is aweful backing.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9s0nre",
                                    "author": "FreeFactoid",
                                    "score": -2,
                                    "created_utc": 1653372979.0,
                                    "response": "That's a good point but it seems they have a few billion in assets in excess of what is required to fully back USDT according to the latest attestation report. Sure the composition of those assets might be ugly but I would like to think that USDT is at least 80% fully backed in terms of liquid assets.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9s1bc3",
                                            "author": "LovelyDayHere",
                                            "score": 7,
                                            "created_utc": 1653373498.0,
                                            "response": "> at least 80% fully backed\n\nAnd my friends wife is a little bit pregnant",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9thr96",
                                                    "author": "qk188",
                                                    "score": 1,
                                                    "created_utc": 1653407080.0,
                                                    "response": "I mean $300mil is nothing compared to their current mcap.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9s79v2",
                                            "author": "mtrycz",
                                            "score": 5,
                                            "created_utc": 1653378641.0,
                                            "response": "> I would like to think\n\nIE \"trust me bro\".",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i9t6pgu",
                                            "author": "jessquit",
                                            "score": 1,
                                            "created_utc": 1653402400.0,
                                            "response": "> the latest attestation report\n\nAn attestation is like me going and renting a Lambo for a day and parking it in the driveway the day all my friends come over.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9slfrd",
                            "author": "psgrom",
                            "score": 2,
                            "created_utc": 1653390980.0,
                            "response": "That’s correct. It will end in tears anyway because they don’t have liquidity in their reserve funds, and they have never had a published audit of their reserves anyway.\n\nThat “commercial paper” is highly suspect .",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9qlr5j",
                    "author": "tophernator",
                    "score": -6,
                    "created_utc": 1653345228.0,
                    "response": "I love the insanely selective reading here. The image posted suggests tether holds:\n\n$39,200 million in US treasury bonds.  \n$20,100 million in commercial bonds.  \n$286 million in non-US government bonds.  \n\nSo of course the people obsessed with trying to pin BCH’s lack of success on tether focus entirely on the 0.48% that *might* be invested in El Salvador… which is a bad thing I guess?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9qv25c",
                            "author": "phro",
                            "score": 6,
                            "created_utc": 1653349775.0,
                            "response": "1:1 dollar backed. Nah. Drake meme.\n\nSome unknown quantity of shit commercial paper and a smidgen of bonds from a country whose currency is rated speculative grade caa3, credit is rated CCC, and all signs point to further downgrades.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9qx9zo",
                                    "author": "tophernator",
                                    "score": 5,
                                    "created_utc": 1653350870.0,
                                    "response": "> Some unknown quantity of shit commercial paper \n\nThe quantity is right there in the post. \n\n> and a smidgen of bonds from a country whose currency is rated speculative grade caa3\n\n… and $39.2 billion of bonds from the US.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9qxjm0",
                                            "author": "phro",
                                            "score": 10,
                                            "created_utc": 1653351006.0,
                                            "response": "Link me reputable 3rd party audit of Tether's backing.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9t88gp",
                                                    "author": "vxiaolongv",
                                                    "score": 2,
                                                    "created_utc": 1653403065.0,
                                                    "response": "I guess el hodleador is not only hodling btc, but tether.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i9qyaup",
                                                    "author": "tophernator",
                                                    "score": -5,
                                                    "created_utc": 1653351394.0,
                                                    "response": "No. My comments here are solely about this post/tweet/image. I genuinely don’t give a crap about tether. But I hate watching people engage in this kind of irrational and manipulative bullshit.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9r7up9",
                                                            "author": "phro",
                                                            "score": 6,
                                                            "created_utc": 1653356038.0,
                                                            "response": "Link me what tether alleges is their full backing.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9s6124",
                                                                    "author": "tophernator",
                                                                    "score": 2,
                                                                    "created_utc": 1653377516.0,
                                                                    "response": "> No. My comments here are solely about this post/tweet/image. I genuinely don’t give a crap about tether. But I hate watching people engage in this kind of irrational and manipulative bullshit.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9sv049",
                                                                            "author": "phro",
                                                                            "score": 1,
                                                                            "created_utc": 1653396791.0,
                                                                            "response": "Then your purpose is irrational manipulative bullshit. No source. Only white knighting Tether. You don't care though. lol",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i9t1oro",
                                                                                    "author": "tophernator",
                                                                                    "score": 2,
                                                                                    "created_utc": 1653400125.0,
                                                                                    "response": "> No source. Only white knighting Tether.\n\nYou’ve officially reached the bottom of the reading comprehension barrel.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i9tfpiy",
                                                                                            "author": "phro",
                                                                                            "score": 2,
                                                                                            "created_utc": 1653406225.0,
                                                                                            "response": "You like to show up and defend it until you can't. If you don't like Tether why bother?",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "id": "i9thclk",
                                                                    "author": "EMw8SYJ4Qv",
                                                                    "score": 1,
                                                                    "created_utc": 1653406911.0,
                                                                    "response": "Can I ask why you think that? \n\nTether is part of my portfolio should I sell it to be safe?",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9tip6d",
                                                                            "author": "phro",
                                                                            "score": 1,
                                                                            "created_utc": 1653407471.0,
                                                                            "response": "Tether has never upheld their promises for transparent audits since it was first issued. They admit to the NY attorney general that they were ~70% backed. They are allegedly a top 10 commercial paper holder in the world. The other 9 largest don't know any of them. \n\nI would not trust tether. To me crypto is about removing the need for trust.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "i9t82em",
                                                            "author": "jessquit",
                                                            "score": 1,
                                                            "created_utc": 1653402992.0,
                                                            "response": "> I genuinely don’t give a crap about tether. \n\nThat's why you rush in here to defend it whenever it feels threatened. Got it.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9t90mk",
                                                                    "author": "tophernator",
                                                                    "score": 1,
                                                                    "created_utc": 1653403400.0,
                                                                    "response": "I step in whenever and wherever I see people spouting bullshit and making nonsensical arguments. That frequently being the case on this sub says more about certain members of this community than it does about me.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9tgm98",
                                                                            "author": "jessquit",
                                                                            "score": 1,
                                                                            "created_utc": 1653406606.0,
                                                                            "response": "Continuing the thread [here](https://www.reddit.com/r/btc/comments/uw7t29/tether_revealed_it_owns_286_million_on_nonus/i9t7fgz)",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "i9sgo4n",
                                                            "author": "polattah",
                                                            "score": 0,
                                                            "created_utc": 1653387299.0,
                                                            "response": "Here comes the real crash. Get your cash ready for the dip.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9t7xfj",
                                            "author": "jessquit",
                                            "score": 1,
                                            "created_utc": 1653402930.0,
                                            "response": "I'm old enough to remember when every USDT was supposedly backed 1:1 by real USD.\n\nhttps://c.tenor.com/BzdybKbJj7gAAAAd/moving-goalpost.gif",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9tarwm",
                                    "author": "se0maks0x",
                                    "score": 1,
                                    "created_utc": 1653404151.0,
                                    "response": "Tether comes from China.  How can a US Stable-coin come from China. \n\nThis is foreign interference in the US financial system, and a matter of National Security.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9qmqng",
                            "author": "Remora_101",
                            "score": 8,
                            "created_utc": 1653345696.0,
                            "response": "Did I say anything about BCH?\n\n>So of course the people obsessed with trying to pin BCH’s lack of success on tether focus entirely on the 0.48% that might be invested in El Salvador… which is a bad thing I guess?\n\nAnd you think a company that does shit like that has everything else just mighty fine? Even completely ignoring the fact, that we have no proof for anything. They could hold cow manure for all we know. \n\nEvery day I discover that people can be even more gullible than I thought  the day before.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9tgcdo",
                                    "author": "tmw2442",
                                    "score": 3,
                                    "created_utc": 1653406493.0,
                                    "response": "I’m the biggest bear of crypto… \n\nbut tether is fine… it’s not collapsing or depegging .",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9qs4rg",
                                    "author": "doramas89",
                                    "score": 7,
                                    "created_utc": 1653348323.0,
                                    "response": "You're talking to state sponsored trolls defending the tether façade...dont lose energy mate",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9qx1pv",
                                    "author": "tophernator",
                                    "score": -5,
                                    "created_utc": 1653350754.0,
                                    "response": "> Did I say anything about BCH?\n\nNo, but we regularly get the answer to the question “why on Earth are BCH enthusiasts so obsessed with tether” in the form of rambling mental gymnastics conspiracy theories.\n\n> Even completely ignoring the fact, that we have no proof for anything. They could hold cow manure for all we know.\n\nIf you have no proof for the $39 billion US bonds then you certainly have no proof for the relatively tiny amount of possible El Salvador bonds. It’s all from the same screenshot. You can’t choose to believe only the bits that suit your existing narrative. Or rather you can do that, but you’ll look like an idiot to anyone paying attention.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9sn7cm",
                                            "author": "velvetysilk",
                                            "score": 1,
                                            "created_utc": 1653392174.0,
                                            "response": "I think LaGeo will be sold off in case the government cant pay the bonds.\n\nThats bad for us salvadorans.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9rtdbh",
                            "author": "chainxor",
                            "score": 1,
                            "created_utc": 1653367609.0,
                            "response": "What is it with BTC bagholders and their almost Stockholm-syndrom-like eagerness to defend Tether? ...almost as if it is the (only?) underpinnings that pumps their BTC,-bags... :-)",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9tgvij",
                                    "author": "jessquit",
                                    "score": 1,
                                    "created_utc": 1653406714.0,
                                    "response": "they know where the butter for their bread comes from but they're ashamed to admit it\n\nwe talk crap about most stablecoins in here but strangely it's only when we talk bad about Tether that they get so triggered. Funny isn't it.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9t6jpg",
                            "author": "Javibtc",
                            "score": 1,
                            "created_utc": 1653402329.0,
                            "response": "Ricardo, LaGeo hasn't issued any securitized debt for several years, so Tether can't have bought any.\n\nThe securitization referred to in that tweet from Hencorp Valores happened in 2014.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9t7fgz",
                            "author": "jessquit",
                            "score": 0,
                            "created_utc": 1653402712.0,
                            "response": ">I love the insanely selective reading here. \n\nI love how you're always Johnny on the spot to defend Tether. It's so flipping transparent dude.\n\nI'm old enough to remember when bitcoiners wanted to bring down the USD not play dress up and make believe we're the Fed.\n\nAt least the USD is *actually* fiat. Tether is, quite literally, counterfeit dollars.\n\nImagine shilling for the second rate version of the USD. In 2013 you would have been laughed out of the community and with good reasons.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9tar3t",
                                    "author": "tophernator",
                                    "score": 1,
                                    "created_utc": 1653404141.0,
                                    "response": "I’m *actually* old enough to remember what the Bitcoin community was like before the split, not an account set up in the wake of that disagreement. \n\nI remember when people talked about how TPTB would try to divide and conquer bitcoin/crypto communities. Kinda like how *this* community of supposed Bitcoin enthusiasts now wastes so much time and effort trying to bring down BTC…\n\nI remember the small blockers arguing that hardforking the blocksize cap would cause division and open the door to other protocol changes. I thought that was a terrible cop out argument at the time. But here we are with repeated hijacking attempts persisting as their own somehow significant coins in exactly the same way that BCH relates to BTC.\n\nI remember when this sub first became a haven for uncensored discussions. Then people got annoyed by what they saw as trolling and bad actors, so people including you repeatedly shift the narrative of what constitutes censorship (just like theymos did).",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9tbjg2",
                                            "author": "jessquit",
                                            "score": 0,
                                            "created_utc": 1653404473.0,
                                            "response": ">I’m *actually* old enough to remember what the Bitcoin community was like before the split, not an account set up in the wake of that disagreement. \n\nHey buddy if you want to go there the reason I set up this new account is because your new buddies started sending credible death threats to my old account. Do I really talk like I just showed up in Bitcoin yesterday? JFC\n\n>I remember when people talked about how TPTB would try to divide and conquer bitcoin/crypto communities. Kinda like how *this* community of supposed Bitcoin enthusiasts now wastes so much time and effort trying to bring down BTC…\n\nWell we're still building Satoshi's vision of p2p hard money cash and you're here defending *a knockoff USD.* I mean seriously dude. [You've been weaponized against the very thing we once were trying to build together](https://bitcoin.com/bitcoin.pdf) and you don't even know it.\n\nThey figured out [how to divide us](https://www.reddit.com/r/btc/comments/7lio87/debunking_blockstream_is_3_or_4_developers_out_of/): \"It is difficult to get a man to understand something when his salary depends on his not understanding it.\" [Which side is funded by TPTB?](https://www.reddit.com/r/btc/comments/7d8pjq/blockstream_is_funded_by_the_bankers_that_bitcoin/) not us that's for sure.\n\n>I remember the small blockers arguing that hardforking the blocksize cap would cause division and open the door to other protocol changes. I thought that was a terrible cop out argument at the time. But here we are with repeated hijacking attempts persisting as their own somehow significant coins in exactly the same way that BCH relates to BTC.\n\nTo \"hijack\" a coin would require changing it from what it was to something else. Did **we** do that? No. *Wake up brother.*\n\n>I remember when this sub first became a haven for uncensored discussions. Then people got annoyed by what they saw as trolling and bad actors, so people including you repeatedly shift the narrative of what constitutes censorship (just like theymos did).\n\nGaslight harder. You're still here aren't you?!? Our moderation logs are public, aren't they?!? I haven't been allowed to post in rbitcoin since 2016. Where is the rbitcoin modlog? Damn man. What happened to you?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9td902",
                                                    "author": "tophernator",
                                                    "score": 1,
                                                    "created_utc": 1653405196.0,
                                                    "response": "> Well we're still building Satoshi's vision of p2p hard money cash and you're here defending a knockoff USD.\n\nAs I’ve said so many times in this thread and other: no, I’m not defending tether! I’m criticising the insanely selective way that the tether conspiracy theorists choose to read and report on information.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9teq8f",
                                                            "author": "jessquit",
                                                            "score": 1,
                                                            "created_utc": 1653405812.0,
                                                            "response": "\n>As I’ve said so many times in this thread and other: no, I’m not defending tether!\n\nGreat, then we're not attacking it. See what I did there?\n\n> I’m criticising the insanely selective way that the tether conspiracy theorists choose to read and report on information.\n\n*There is no conspiracy theory.* Tether lied about being 1:1 backed by USD. Then it lied about being 1:1 backed by *anything*. It has never had a proper audit. It is in bed with Blockstream. Its corporate leadership appears to be in hiding. Its issuance was incredibly suspiciously correlated with the BTC/BCH split. The dots don't need connecting. They are already touching.\n\nThis is the adversarial world of crypto, which works on the principle that that which cannot be verified must not be trusted, and which is supposed to be antagonistic to fiat money. But we're supposed to *trust* a company that's printing *unbacked fiat?!?* Dude. There is **no way** the old you would look at this as anything other than a guaranteed racket. What happened to you?",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "id": "uw7wwb",
            "title": "BCH/XMR trading pair all-time high today, approaching PARITY",
            "url": "https://www.reddit.com/r/btc/comments/uw7wwb/bchxmr_trading_pair_alltime_high_today/",
            "author": "wtfCraigwtf",
            "created_utc": 1653333317.0,
            "score": 16,
            "num_comments": 58,
            "subreddit": "btc",
            "selftext": "XMR went to 0.977 BCH today, I suspect we'll see some strong resistance at 1.0/parity. I am bullish both coins, so I have no fears of trading them for each other. I did get a Monero BCH hater this week,  maybe they are trying to run down BCH? Guy was delusional about XMR having better UX and more merchants than BCH. \n\nWhen I asked \"Is Tether used to pump Monero price\" in rMonero, it was deleted, TWICE. Something tells me that subject is off limits in the sub.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9q509c",
                    "author": "ArticMine",
                    "score": 24,
                    "created_utc": 1653337610.0,
                    "response": "> When I asked \"Is Tether used to pump Monero price\" in rMonero, it was deleted, TWICE. Something tells me that subject is off limits in the sub.\n\nPrice discussions are not allowed in r/Monero. Use r/xmrtrader instead.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9s1jkv",
                            "author": "Clean_Drag_2783",
                            "score": 6,
                            "created_utc": 1653373684.0,
                            "response": "ngl man but that makes the r/Monero community way more pleasant, imo I think separating both into different subreddits is smart",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9so4ge",
                                    "author": "LovelyDayHere",
                                    "score": 1,
                                    "created_utc": 1653392770.0,
                                    "response": "As an illustration of how pleasant, here's a thread:\n\nhttps://np.reddit.com/r/xmrtrader/comments/uvocr9/monero_vs_bitcoin_cash/",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9sov8q",
                                            "author": "Clean_Drag_2783",
                                            "score": 2,
                                            "created_utc": 1653393236.0,
                                            "response": "I was talking about r/Monero",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9qot43",
                    "author": "KallistiOW",
                    "score": 8,
                    "created_utc": 1653346697.0,
                    "response": ">  I did get a Monero BCH hater this week, maybe they are trying to run down BCH? Guy was delusional about XMR having better UX and more merchants than BCH.\n\nMy first thought was Graphenist (who I suspect to be yet another nullc alt)\n\nThen I checked your history, and it was Graphenist.\n\nGraphenist is definitely a troll posing as someone who's not a bad actor, imo. :)",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9sa3bg",
                            "author": "Doublespeo",
                            "score": 3,
                            "created_utc": 1653381264.0,
                            "response": "I am a big fam of XMR but saying it got better UX is just not true.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9qso2b",
                    "author": "doramas89",
                    "score": 6,
                    "created_utc": 1653348588.0,
                    "response": "XMR/BCH*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9spcdd",
                    "author": "rebelwill",
                    "score": 2,
                    "created_utc": 1653393536.0,
                    "response": "I think Tether is not involved in this",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9q9087",
                    "author": "imperator285",
                    "score": 6,
                    "created_utc": 1653339353.0,
                    "response": "I see great things possible if we work together. If BCH becomes more widely adopted, i could see it being the less private, but easier to use, version of Monero.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9q9p6v",
                            "author": "LovelyDayHere",
                            "score": 17,
                            "created_utc": 1653339656.0,
                            "response": "BCH is already much more widely adopted than Monero.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9q9vuy",
                                    "author": "imperator285",
                                    "score": 8,
                                    "created_utc": 1653339737.0,
                                    "response": "Not in DNMs, the place where people actually have to use crypto",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9qnkep",
                                            "author": "indirecteffect",
                                            "score": 1,
                                            "created_utc": 1653346096.0,
                                            "response": "Dnm?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9qnpgm",
                                                    "author": "imperator285",
                                                    "score": 4,
                                                    "created_utc": 1653346164.0,
                                                    "response": "DarkNet Markets\n\nWhere people get drugs and stuff online. Ya can't use a credit card lol",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9qzqle",
                                                            "author": "knowbodynows",
                                                            "score": 9,
                                                            "created_utc": 1653352116.0,
                                                            "response": "Correct. But outside dnms BCH is far more accepted perhaps partially because merchants don't want to associate with the dnm coin.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9rcw7k",
                                                                    "author": "ArticMine",
                                                                    "score": 8,
                                                                    "created_utc": 1653358436.0,
                                                                    "response": "Monero has a lower support on centralized exchanges largely because the blockchain surveillance (BS) companies have lobbied regulators and exchanges hard against listing Monero. If Monero were to become dominant these BS companies could go out of business. One must keep in mind that these BS companies also censor cash fusion transactions or any other attempt to add any kind of privacy to Bitcoin, Bitcoin Cash or similar coins.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9rz6he",
                                                                            "author": "jessquit",
                                                                            "score": 9,
                                                                            "created_utc": 1653371808.0,
                                                                            "response": "If you find censorship there's *always* an intermediary involved.\n\nThe solution is people using the coin as p2p cash with no payment processors or other intermediaries.  At that point, mixing is mostly irrelevant. The problem is that we're still living in a world of intermediaries. Think in terms of fiat. You can censor at the bank, but you can't censor the flow of paper bills from peer to peer.\n\nBut to get there we have to end our dependence on intermediaries. The coin that becomes widely used as p2p cash will break through to the other side first.\n\nTo do that what is needed is widespread legal merchant adoption.  That means the 1st priority is scaling not privacy.\n\nA coin that's used in dnm but not legal business, and which has barriers to high volume scaling, has no chance of being that coin. IMO.\n\nIf I'm wrong and Monero becomes the coin that breaks the backs of intermediaries and becomes P2P cash for the world, I'll still be incredibly happy that our shared goals were achieved. That's why, although I don't participate in the Monero community, I'm still a supporter of the work being done there.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        },
                                                                        {
                                                                            "id": "i9rjteq",
                                                                            "author": "knowbodynows",
                                                                            "score": 2,
                                                                            "created_utc": 1653361916.0,
                                                                            "response": "What do you mean by \"censor?\" Censoring how and from whom?",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i9ru8vn",
                                                                                    "author": "ArticMine",
                                                                                    "score": 2,
                                                                                    "created_utc": 1653368211.0,
                                                                                    "response": "Here are some examples of BS companies censoring transactions because of coinjoins, https://np.reddit.com/r/Monero/comments/ugqb3y/theyre_now_sending_warnings_to_accounts_that_use/",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i9ryfvq",
                                                                                            "author": "jessquit",
                                                                                            "score": 5,
                                                                                            "created_utc": 1653371239.0,
                                                                                            "response": "The same companies will simply censor monero outright. How is that better?\n\nEdit: don't get me wrong BTW. I'm not anti monero. I think the BCH and Monero communities want the exact same thing but disagree on how to get there.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "id": "i9s9tep",
                                                                            "author": "TinosNitso",
                                                                            "score": 0,
                                                                            "created_utc": 1653380997.0,
                                                                            "response": "I really like FTX & Binance. In the case of FTX it might just be that it's too much work to support XMR deposits & withdrawals. FTX does 100% free BTC & USDT withdrawals, etc, but the JavaScript is **slow**. Sometimes good coders write slow code, because the slowest code is easiest to write, and adding more features takes precedence over speed. If clicking my mouse on things causes me to have to wait, they're going to struggle trying to guarantee a secure XMR wallet.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "id": "i9qzvkg",
                                                                    "author": "imperator285",
                                                                    "score": 2,
                                                                    "created_utc": 1653352184.0,
                                                                    "response": "Ofc. Thats why i just said i think the two go well together.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i9rxidi",
                                    "author": "Nordle_420D",
                                    "score": 1,
                                    "created_utc": 1653370537.0,
                                    "response": "On reddit maybe…\n\nhttps://cryptwerk.com/pay-with/xmr/",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9q59ty",
                    "author": "Bag_Holding_Infidel",
                    "score": -3,
                    "created_utc": 1653337727.0,
                    "response": "> Is Tether used to pump Monero price\n\nTether truthers are mostly a BCH thing. Its (mostly) not entertained in other subs.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9q693g",
                            "author": "jessquit",
                            "score": 10,
                            "created_utc": 1653338154.0,
                            "response": "go figure",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9q6qp1",
                                    "author": "Bag_Holding_Infidel",
                                    "score": -1,
                                    "created_utc": 1653338369.0,
                                    "response": "Well, apart from r/buttcoin of course.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9q786l",
                                            "author": "jessquit",
                                            "score": 14,
                                            "created_utc": 1653338580.0,
                                            "response": "ah yes, the mark of a True Crypto Believer is when you defend not just fiat, but *counterfeit* fiat -- because it pumps your bags\n\nsmh at this market\n\nyou: [this is fine](https://i.imgflip.com/6g12ka.jpg)",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9qoziw",
                                                    "author": "KallistiOW",
                                                    "score": 0,
                                                    "created_utc": 1653346786.0,
                                                    "response": "Buttcoin is anti-Tether, idk what you mean by them defending it",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9rwlva",
                                                            "author": "jessquit",
                                                            "score": 5,
                                                            "created_utc": 1653369870.0,
                                                            "response": "You lost the context.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i9q85hx",
                                                    "author": "Bag_Holding_Infidel",
                                                    "score": -11,
                                                    "created_utc": 1653338982.0,
                                                    "response": "The mark of a true BCH believer is the cognitive dissonanace required to support conspiracy theories to justify weak fundamantals.\n\n> you: https://i.imgflip.com/6g12ka.jpg\n\nPeer to peer cash is not limited to (or even possible long term with) BCH.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9qdnkf",
                                                            "author": "jessquit",
                                                            "score": 11,
                                                            "created_utc": 1653341436.0,
                                                            "response": "\"conspiracy theory\" you say.\n\nBlockstream opposition to p2p cash: not theory\n\nBlockstream in bed with Bitfinex: not theory\n\nBitfinex attacker of p2p cash: not theory\n\nBitfinex creator of tether: not theory\n\nTether only partially backed: not theory\n\nTether backed by BTC: not theory\n\nWhere exactly is the \"theory\" in the picture? I can't find it. I just see the conspiracy.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9qhbs3",
                                                                    "author": "Bag_Holding_Infidel",
                                                                    "score": -2,
                                                                    "created_utc": 1653343131.0,
                                                                    "response": "There is considerable context to most of those points that would take days to point out the conspiracies correctly. And you will dismiss it anyway. There is a reason noone bothers doing it here anymore. You seem like the only technically minded person left here and you are doing yourself a disservice (unless you are paid) associating yourself with Egon's constant conspiracy peddling.\n\nThe world values decentralisation and needs a fee market to ensure this.\n\nNo one cares about p2p cash (not yet anyway). Alt-L1's cost nearly nothing to use, so they make nearly zero in fees. BCH doesn't have a security budget to survive.\n\nBCH's 10 min blocktime isn't necessary either and it would work much better as an L2 or L3 on Ethereum.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9rweph",
                                                                            "author": "jessquit",
                                                                            "score": 4,
                                                                            "created_utc": 1653369723.0,
                                                                            "response": "Deep inside every BTC maxi there's a fiat apologist dying to get out. Good thing for the scammers at iFinex they've got you on their team.\n\nMeanwhile thanks for demonstrating point #1 which you say is theory.\n\n\"The world values decentralization\" that's why your blockchain is designed to be used by only 0.1% of the population, max... such decentralization, wow.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i9te4sk",
                                                                                    "author": "Bag_Holding_Infidel",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653405567.0,
                                                                                    "response": "> \"The world values decentralization\" that's why your blockchain is designed to be used by only 0.1% of the population, max... such decentralization, wow.\n\nThe BTC blockchain isn't designed to be used by any particular %age of the population. Its value is its decentralization and that it doesn't change. Innovation builds around this value. People adapt to use it because thats what gives them value. And it scales by value.\n\nA secure L1 doesn't change to facilitate everyones needs.\n\nYou know what is designed to be used by 100% of the population?\n\nFiat, and credit cards. And you call me a fiat apologist.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i9tg0kt",
                                                                                            "author": "jessquit",
                                                                                            "score": 1,
                                                                                            "created_utc": 1653406354.0,
                                                                                            "response": "\n>The BTC blockchain isn't designed to be used by any particular %age of the population. \n\nThat's false, it's been redesigned to be usable only by 0.1% of the population, max. Everyone else will need an intermediary. And you call that decentralized.\n\n>You know what is designed to be used by 100% of the population?\n>\n>Fiat, and credit cards. And you call me a fiat apologist. \n\nYes, fiat and credit cards achieve scale using the exact sort of intermediaries you've reinserted into the BTC architecture. That's why we call you a fiat apologist.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "i9sadmo",
                                                            "author": "Doublespeo",
                                                            "score": 2,
                                                            "created_utc": 1653381537.0,
                                                            "response": ">\tThe mark of a true BCH believer is the cognitive dissonanace required to support conspiracy theories to justify weak fundamantals.\n\n\nby weak fundamentals you mean price? then you dont know what fundamental mean.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9t6rbs",
                            "author": "Chill-BL",
                            "score": 1,
                            "created_utc": 1653402423.0,
                            "response": "So you agree, that we're the only one, interested in sound money.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9tbtik",
                                    "author": "Bag_Holding_Infidel",
                                    "score": 1,
                                    "created_utc": 1653404591.0,
                                    "response": "You can't fork the BTC network, change some parameters and then pretend to be interested in sound money. BTC derives its value by not changing - Sound Money",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9tcyjy",
                                            "author": "Chill-BL",
                                            "score": 1,
                                            "created_utc": 1653405073.0,
                                            "response": "Bitcoin is a software protocol, software updates (that is changes) are entirely normal.\n\nThe network? That is the people using the protocol.\n\nThat network split in seperate groups.\n\nOne group still maintained the P2P cash system.\n\nThe other chose the Store of Value system.\n\nThat summarizes the fork. \n\nI still have to come up with one thing that actually doesn't change and therefore derive value.\n\nThe only thing I can imagine is: Historic Value. \n\nWhich to be frank, Bitcoin scarcely if ever will possess. \n\nNFT's in that respect stand to have a higher chance.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9shifk",
                    "author": "Lonsmrdr",
                    "score": 0,
                    "created_utc": 1653387988.0,
                    "response": "Weirdly I aways witnessed  as much hostility from the XMR community towards BCH as from the BTC maxis!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9qai3d",
                    "author": "Zealousideal_Year551",
                    "score": -12,
                    "created_utc": 1653340012.0,
                    "response": "Monero is a coin for selling child abuse pictures. Im not interested",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9qjctn",
                            "author": "Dehydration9986552",
                            "score": 9,
                            "created_utc": 1653344087.0,
                            "response": "And internet is used to exchange that. Why do you use it?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9qla54",
                                    "author": "Zealousideal_Year551",
                                    "score": -8,
                                    "created_utc": 1653345000.0,
                                    "response": "Learn to read",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9qsb9s",
                                            "author": "Hakametal",
                                            "score": 7,
                                            "created_utc": 1653348411.0,
                                            "response": "If criminals use money, does that make money bad?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9r00ad",
                                                    "author": "knowbodynows",
                                                    "score": 5,
                                                    "created_utc": 1653352250.0,
                                                    "response": "By his measure, children are bad 😞.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i9r0d0j",
                                                    "author": "Zealousideal_Year551",
                                                    "score": -6,
                                                    "created_utc": 1653352426.0,
                                                    "response": "Amazing. You cant read either",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9si4ce",
                                                            "author": "i_have_chosen_a_name",
                                                            "score": 1,
                                                            "created_utc": 1653388483.0,
                                                            "response": "[ Removed by Reddit ]",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9sn5wt",
                                                                    "author": "Zealousideal_Year551",
                                                                    "score": -2,
                                                                    "created_utc": 1653392147.0,
                                                                    "response": "Everyone here is mentally ill. Are you sick in the head?",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9ufw1y",
                                                                            "author": "bitsconnected",
                                                                            "score": 1,
                                                                            "created_utc": 1653421219.0,
                                                                            "response": "Maybe everyone isn’t the problem…\n\n>! You are !<",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9pxvbh",
                    "author": "onemoneroisonemonero",
                    "score": -9,
                    "created_utc": 1653334547.0,
                    "response": "I dumped all my BCH for XMR at 0.2 BCH. No regrets.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9pyrk3",
                            "author": "wtfCraigwtf",
                            "score": 7,
                            "created_utc": 1653334929.0,
                            "response": "I guess you're not interested in making a 5x gain buying BCH today? Or simply buying back all of your BCH for 1/5th of ur XMR?\n\nokthxbye",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9qeymr",
                                    "author": "Blazedout419",
                                    "score": 1,
                                    "created_utc": 1653342035.0,
                                    "response": "Why when it just keeps going down?",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9q5kwg",
                                    "author": "ArticMine",
                                    "score": 1,
                                    "created_utc": 1653337863.0,
                                    "response": "I sold my BTC over 99% in 2014 - 2015 with the balance in 2017 before the BCH fork for XMR over blocksize scaling. I am not interested in selling my XMR for BTC, BCH, BSV etc. at a profit.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9t4332",
                                    "author": "onemoneroisonemonero",
                                    "score": 1,
                                    "created_utc": 1653401235.0,
                                    "response": "Not really to be honest. I am a fan of BCH's mission but I just don't see it out preforming XMR anytime soon.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}