{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uxnmg2",
            "title": "Why are you still using fiat currency?",
            "url": "https://www.reddit.com/r/btc/comments/uxnmg2/why_are_you_still_using_fiat_currency/",
            "author": "KallistiOW",
            "created_utc": 1653502940.0,
            "score": 13,
            "num_comments": 17,
            "subreddit": "btc",
            "selftext": "If there's one thing that BTC and BCH supporters can both agree on, it's that Bitcoin (legacy) has completely revolutionized money.\n\nSo if Bitcoin is so great, why are you still using your national currency?\n\nFor me, I treat BitcoinCash as my savings account. I allocate as much of my income as I possibly can into BCH. I try to purchase things using BCH when the option is available. I encourage local businesses to accept BCH and I tell my friends that I prefer to be paid in BCH for petty favors. I give BCH as an option when I invoice clients for my business.\n\nAnd yet, it's still such an uphill battle to \"convince\" people to use \"cryptocurrency,\" and even the ones who are \"convinced,\" (like my own S.O.!) still don't hold any BCH of their own.\n\nAt least once a week in meatspace I see a legitimate usecase for Bitcoin-based payments. So many convoluted systems can be replaced with a simple QR code. Parking meters, restaurant tabs, anywhere Apple Pay is accepted. Getting money to/from family across the country is so much easier with BCH and yet we always go through some stupid song and dance with the banks/payment apps.\n\nPart of me still recognizes that \"we're still early.\" Part of me recognizes how cringe that statement is. :)\n\nReally, until I can convince my landlord and my grocery store to accept BCH, I'm stuck with my increasingly worthless US dollars. Feels bad, man.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9ytvn8",
                    "author": "Shibinator",
                    "score": 15,
                    "created_utc": 1653503313.0,
                    "response": "It's a tough road, but we are winning.  Step by step.\n\nIt is now impossible to find someone who hasn't heard of Bitcoin.\n\nIt is now rare to find someone totally against crypto currency.\n\nIt is uncommon to find people who don't know \"that one friend\" that really loves crypto and who they would go to for advice if they suddenly wanted to get involved.\n\nIt is now common to find people who have a bit of crypto somewhere.\n\nWe haven't jumped over the mass adoption hurdle of people FOMO'ing in en-masse for the purposes of actually using it as currency while the price and utility skyrockets, but we aren't far off.  Maybe 4-8 years.  And every day the infrastructure, wallets, exchanges, tools, information is all getting better and better to truly onboard people at global scale.\n\nDay by day it's hard to see the difference.  But year to year, the impact is really adding up.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia1res7",
                            "author": "tulasacra",
                            "score": 1,
                            "created_utc": 1653560821.0,
                            "response": "Ok but why are you personally still using fiat? Not why do you think other people are using fiat.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia1xlxn",
                                    "author": "Shibinator",
                                    "score": 1,
                                    "created_utc": 1653565197.0,
                                    "response": "Any chance I can, I use BCH.\n\nThe fiat I have is because my rent and some of the local restaurants I can't pay in BCH.  I've been trying to get them onboard but no luck yet.\n\nIf I got a breakthrough on either of those, I wouldnt use any fiat.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9zajn6",
                    "author": "RevelacaoVerdao",
                    "score": 5,
                    "created_utc": 1653509989.0,
                    "response": "\\> Really, until I can convince my landlord and my grocery store to accept BCH, I'm stuck with my increasingly worthless US dollars. Feels bad, man.\n\nI think you answered the question. There is an established financial system that most businesses and individuals operate in, therefore to survive as a consumer/producer until crypto becomes more commonplace there is a need to operate within the current model.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9zai3c",
                    "author": "knowbodynows",
                    "score": 3,
                    "created_utc": 1653509972.0,
                    "response": "As inflation bites and people slowly learn by osmosis what causes inflation and they get a load of that money printing chart from the last 20 years (or 3!) then another wave of people will start to see the value of a predictable unchangeable inflation schedule with an upper bound. \n\nComing across Bitcoin yrs ago I did not have a grasp of this even though it's a top 3 feature of the whole invention. But now the lesson is in full swing for society at large since the effects of brrrr are becoming apparent and not just a negligible 2%..",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia1qrbh",
                            "author": "tulasacra",
                            "score": 1,
                            "created_utc": 1653560306.0,
                            "response": "This is not a usable argument while the BCH price is going down against the dollar.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9zw7oz",
                    "author": "Blazedout419",
                    "score": 1,
                    "created_utc": 1653519346.0,
                    "response": "Since spending crypto in the USA is a taxable event it’s not worth using over a credit card with a few % cash back.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia00s5h",
                    "author": "tl121",
                    "score": 1,
                    "created_utc": 1653521491.0,
                    "response": "To pay my biggest expense:  taxes.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia1qvha",
                            "author": "tulasacra",
                            "score": 1,
                            "created_utc": 1653560397.0,
                            "response": "Is that the last and only thing you use it for?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia1ojr6",
                    "author": "FieserKiller",
                    "score": 1,
                    "created_utc": 1653558445.0,
                    "response": "If you check out the bitcoin white paper you'll find the sentence that customers should not transact directly but use escrow instead. \n\nAn escrow standard never materialised, and thats basically why I don't use bitcoin that much for online orders or basically any bigger purchases.  \nWith credit cards and paypal I can get back my money easily when the seller wants to fuck me over, with bitcoin not so much.\n\nWhats left is me using bitcoin for small payments when consumer protection is not that important and me loving being paid in bitcoin which not many people do because of the consumer protection problems described above...",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia1r2wa",
                    "author": "tulasacra",
                    "score": 1,
                    "created_utc": 1653560559.0,
                    "response": "u/chaintip",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia1r8xr",
                            "author": "chaintip",
                            "score": 1,
                            "created_utc": 1653560694.0,
                            "response": "***\nu/KallistiOW, you've [been sent](https://www.blockchain.com/bch/address/bitcoincash:qrelay2wusru2ktnw3u5kqm6ckhxhq8445gdgalsg2) `0.01576924 BCH` | `~2.87 USD` by u/tulasacra\nvia [chaintip](http://www.chaintip.org).\n***",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9zdj69",
                    "author": "TinosNitso",
                    "score": -4,
                    "created_utc": 1653511202.0,
                    "response": "Even without landlords and grocery stores, fiat is still needed to **back** bitcoin. A rich person needs a large amount of fiat with which to **B**uy **T**he **D**ip. Imo to fully eliminate fiat might require **Gold-Cash** (gold embedded in polymer), like [this](https://ebay.com/itm/164961330561) note on eBay containing $6 of gold. 10mg, 100mg & 1g notes could be made popular (60c through $60). Without gold, bitcoin isn't good enough. Gold-Cash combined with **XRF** (X-Ray machines) make the gold standard decentralized. A country like El Salvador could conceivably try a trust-less version of the gold standard, in combination with Bitcoin, since it should beat the fiat+Bitcoin alternative. The gold-cash notes could set an international standard copied everywhere.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}