{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uyeiid",
            "title": "US Senator Cruz 'Incredibly Bullish' on Bitcoin — Says 'I Have a Weekly Buy. Will Bitcoin's Value Grow Exponentially in Coming years.",
            "url": "https://www.reddit.com/r/btc/comments/uyeiid/us_senator_cruz_incredibly_bullish_on_bitcoin/",
            "author": "Aggrgis",
            "created_utc": 1653590847.0,
            "score": 8,
            "num_comments": 0,
            "subreddit": "btc",
            "selftext": "At the Heritage Foundation's Bitcoin and the American Experiment event on Monday, Senator Ted Cruz (R-TX) discussed bitcoin. He began by saying:\nI have to confess, when it comes to bitcoin, and crypto in general, I am really enthusiastic.\n\n\"I believe it is changing the world now, and will continue to do so in the future,\" he predicted.\nHe then went on to discuss the numerous reasons why people are drawn to bitcoin. To begin with, many people are utilizing it as an inflation hedge. Second, he continued, \"there's also an appeal of speed, the capacity to conduct a financial transaction anywhere in the world in an immediate, nearly costless\" manner.\n\n\"And then there's the benefit of liberty,\" he continued. There isn't a single person in command. Government decision-makers are terrified by this.\" Cruz made the following remark in response to reports that communist China and US Senator Elizabeth Warren intend to regulate currencies:\n\nFor individuals who want control over their money, uncontrolled, decentralized currency is unsettling.\n\nCruz revealed his own cryptocurrency stakes, saying, \"I'm a bitcoin investor.\" \"I've put my own money into bitcoin.\" The senator went on to say:\nBecause I believe in dollar-cost averaging, I have a weekly buy that is an automatic purchase of bitcoin every week.\n\nIn my opinion Bitcoin Value would increase in coming years. I don't think anyone can accurately predict when Bitcoin's value would rise or fall but one thing for sure is that Bitcoin's market cap, it's decentralized nature and it's security makes it a great store of value. Thus it will over time increase in value as more people adopt it's use. Also Bitcoin in it's wake paved the way for a thriving crypto ecosystem thereby creating a self sustaining market.  \n\nThe blockchain ecosystem is experiencing tremendous growth by facilitating the development of innovative projects in it's ecosystem that could reorganize how diverse industries operate such as \nSilks a blockchain-based metaverse that enables users to own, trade, and profit from thoroughbred racing horses, Shiryo is a P2E Card trading game in the metaverse that allows users to hold their cards as NFTsbased on the Ethereum network, Sandbox is like the metaverse-equivalent of MineCraft in terms of its design and functionality. It like a real estate on the metaverse, Decentraland  an online world that allows users to create their own avatars and purchase plots of virtual land. I think that as more industries adopt the use of Blockchain technology so will the value of Bitcoin and it's alternatives increase. \n\nI think that Bitcoin could potentially become the Global standard for monetary transaction of value as more people adopt it's use and it's value increases. \n\n\nNews Source: https://news.bitcoin.com/us-senator-cruz-incredibly-bullish-on-bitcoin-says-i-have-a-weekly-buy/",
            "stickied": false,
            "comments": []
        }
    ]
}