{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "upr8fz",
            "title": "Why does BCH not follow other coins sometimes?",
            "url": "https://www.reddit.com/r/btc/comments/upr8fz/why_does_bch_not_follow_other_coins_sometimes/",
            "author": "wll",
            "created_utc": 1652565001.0,
            "score": 10,
            "num_comments": 47,
            "subreddit": "btc",
            "selftext": "How is Bitcoin still down but BCH is up 8% lol I don’t get it can somebody educate me.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8misjx",
                    "author": "homopit",
                    "score": 14,
                    "created_utc": 1652565608.0,
                    "response": "Tomorrow is an upgrade.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8p95im",
                            "author": "bazakoparka",
                            "score": 1,
                            "created_utc": 1652626152.0,
                            "response": "Yeah maybe You're right. Maybe that's  keepin it up.\n\nBecause it follows rest of the market like how btc controls it so there's that. Nothing new.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8mzuym",
                    "author": "mk112ning",
                    "score": 7,
                    "created_utc": 1652573745.0,
                    "response": "The question really should be why most coins move up and down at the same time, imagine some interest group is able to make this happen, while they also have data of how much money other people buy and sell, in that case they can make a bull and bear market as they see fit and to make money out of this. \n\nThere are also people and interest group invest in real values. \n\nWith that being said, only you can decide for yourself what is what based on your experence and knowledge(sometime courage)",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8n2518",
                            "author": "surprise-pikachu",
                            "score": 6,
                            "created_utc": 1652574899.0,
                            "response": "The correlation has long been assumed to be market manipulation by Tether.\n\nThe reason why they would want to do this is that, contrary to their denials and claims about \"commercial paper\", USDT is primarily backed by BTC.  Therefore they want BTC to always look like the best investment.  When it is not possible for BTC to be ahead of the pack, the next best thing is to have everything move up and down at the same time, so at least it's not behind.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8nisro",
                                    "author": "skanderbeg7",
                                    "score": 3,
                                    "created_utc": 1652583622.0,
                                    "response": "Tether rug pull incoming",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8w3gvj",
                                            "author": "mersleydith",
                                            "score": 1,
                                            "created_utc": 1652748897.0,
                                            "response": "Not so soon lol, they're going to take some time in that.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i8opigi",
                                    "author": "trollbawks",
                                    "score": 1,
                                    "created_utc": 1652615555.0,
                                    "response": "The correlation has definitely caused by the tether manipulation.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8qemqe",
                                            "author": "surprise-pikachu",
                                            "score": 2,
                                            "created_utc": 1652644421.0,
                                            "response": "/u/MobTwo",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8qguj9",
                                                    "author": "MobTwo",
                                                    "score": 1,
                                                    "created_utc": 1652645397.0,
                                                    "response": "Thanks, bot removed.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8o4b0a",
                            "author": "Sugarbird676",
                            "score": 2,
                            "created_utc": 1652597987.0,
                            "response": "This is a really interesting question, and I have also wondered why everything should move together. How many projects depend on the price of BTC for their success? Arguably none. It seems manipulated- maybe there’s some way to leverage different coins against each other so they have a tendency to move with BTC? Or maybe the top 50 coins are all more manipulated than we know. The entire marketcap of these tokens is pretty small. Probably easier to rig crypto markets than traditional ones.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8o813l",
                                    "author": "mk112ning",
                                    "score": 2,
                                    "created_utc": 1652601107.0,
                                    "response": "The crypto market is very easy to rig at this point because it is rather unregulated and uncapitalised. Let along the fact that much more regulated market such as morgage and stock market occasionally get rigged nonetheless.\n\nThere are ways to leverage different coins against each other. One way this could have been done is through the centralised exchanges. That is why the SEC is targetting them.   So always expect the worst when something is runing at the backstage. After all this is what bitcoin(later BCH) is created for, a transparent, fair, reliabile system that free people from someone else's funny business.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8w3hiu",
                                            "author": "ElZeta500",
                                            "score": 1,
                                            "created_utc": 1652748906.0,
                                            "response": "Yep, it's not regulated and many things are being manipulated.\n\nBecause no one pays attention to what anyone is doing. And most if it is private too.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8ofl7g",
                            "author": "titelibo",
                            "score": 1,
                            "created_utc": 1652607603.0,
                            "response": "When I was new in the space, I found that fascinating man.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8p4str",
                            "author": "Tiblanc-",
                            "score": 1,
                            "created_utc": 1652624125.0,
                            "response": ">The question really should be why most coins move up and down at the same time\n\nIt's all the market makers providing liquidity between coins. Any move in the USD market ripples into the other coins USD markets through these pairs, thanks to arbitrage. Selling BTC for USD produces a sell of BTC for ETH and ETH for USD.\n\nThere's no conspiracy here.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8nt5ct",
                    "author": "FangornEnt",
                    "score": 3,
                    "created_utc": 1652589752.0,
                    "response": "Coins can go up or down with each other(market wide moves) and you'll usually see this differentiate by sector. Large, mid, small caps and then by use(privacy based coins for example). This is similar to how stocks move within the market as well...certain sectors strong while others are weak and cycling through under and overvalued relative to each other.\n\nFor the most part, these coins are priced in USD, so X/USD being the fraction. You have the individual coin's worth/USD...meanwhile USD can move up or down in strength which can impact movement though USD is more stable in value than the coins for the most part. \n\nSo BCH can move with it's own behavior if there are factors that lead it's  valuation to change in the midst of a market wide move. This type of logic can be used when looking at charts of X/BTC compared to X/USD. Say BTCUSD is moving up, as is the rest of the crypto market. You can look at the X/BTC pairings and through analysis..see which crypto coins are stronger or weaker relative to BTC. So if BTCUSD is pumping along with BCHUSD, but BCHBTC is pumping, that would mean that BCH would be the stronger asset at the moment. Can be used in relative value analysis as well. \n\nDoes that make sense?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8w3fdc",
                            "author": "ppdemeijer",
                            "score": 1,
                            "created_utc": 1652748876.0,
                            "response": "Whatever the reason may be, I'm just sick of the correlation.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8mz8w8",
                    "author": "Remora_101",
                    "score": 5,
                    "created_utc": 1652573426.0,
                    "response": "BCH is severely undervalued and maybe suppressed.  Sometimes the pressure is lifted and BCH makes big jumps.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8w3fjo",
                            "author": "boubilami",
                            "score": 1,
                            "created_utc": 1652748878.0,
                            "response": "I'm here for those big jumps, that's actually all I want.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8pbdqa",
                    "author": "number_go_up",
                    "score": 2,
                    "created_utc": 1652627156.0,
                    "response": "Why did BCH go up roughly 8% in a 24-hour period between May 13, and May 14, 2022?\n\nThis appears to be a short squeeze.  Someone was selling borrowed BCH, got margin called and was forced to buy back at increasing prices for approximately 8 hours, before the price suddenly fell again.\n\nThese events have occurred with increasing frequency lately, and together with [high interest rates](https://www.reddit.com/r/btc/comments/ttzarh/after_just_1_month_gemini_yet_again_raises/) strongly suggest that someone is repeatedly short selling BCH in an effort to manipulate the price, and occasionally failing.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8mlsru",
                    "author": "2q_x",
                    "score": 4,
                    "created_utc": 1652567019.0,
                    "response": "Someone borrowed a BUNCH of BCH ~~on~~ *in May ~~14~~... 2021\n\nTime's up.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8mlxb5",
                            "author": "wll",
                            "score": 3,
                            "created_utc": 1652567078.0,
                            "response": "What do you mean Time’s up?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8mnth1",
                                    "author": "homopit",
                                    "score": 6,
                                    "created_utc": 1652567968.0,
                                    "response": "Borrowed coins have to be returned. If the borrower doesn't have them, she has to buy them on the market.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8mnvkh",
                                            "author": "wll",
                                            "score": 2,
                                            "created_utc": 1652567995.0,
                                            "response": "Oh sorry I’m a newb thanks!",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8ndgo7",
                                                    "author": "DigitaleDukaten",
                                                    "score": 3,
                                                    "created_utc": 1652580748.0,
                                                    "response": "As an investor, you usually go \"long\" (you buy because you think you can sell it later for a higher value)\n\nOr, you do the opposite, you go \"short\" (you borrow because you think you can buy it back later at a cheaper price, causing you to gain in $€¥)\n\nShorting is like betting against the market, and making money off of it. Its kind of unethical, but whatever, everyone wants money anyway.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8ndm17",
                                                            "author": "wll",
                                                            "score": 3,
                                                            "created_utc": 1652580828.0,
                                                            "response": "Thanks for explaining what “shorting” is basically I’ve been trying to figure out what people meant by that!",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8nh5z3",
                                                                    "author": "DigitaleDukaten",
                                                                    "score": 2,
                                                                    "created_utc": 1652582718.0,
                                                                    "response": "For some reason I never could explain it easily until I wrote that comment. Learned about shorting like 2 years ago. So yeah, thanks for that lol",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i8w35xb",
                                                                            "author": "tichepidor",
                                                                            "score": 1,
                                                                            "created_utc": 1652748744.0,
                                                                            "response": "Yeah a lot of people wonder about the same thing here.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "id": "i8opexm",
                                                                    "author": "seraspolas",
                                                                    "score": 1,
                                                                    "created_utc": 1652615489.0,
                                                                    "response": "Yeah a lot of people don't know that, and it's helpful for them I'm sure.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i8w3asv",
                                                    "author": "firstlast0024",
                                                    "score": 1,
                                                    "created_utc": 1652748812.0,
                                                    "response": "No problems dude, being newbie is good. Get to learn.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i8mpgh3",
                                    "author": "2q_x",
                                    "score": 1,
                                    "created_utc": 1652568733.0,
                                    "response": "Well, they have to pay it back sometime, or find someone to loan them the difference. \n\nI was wrong about the specific date. It looks like there were about six blocks with over 50M coindays destroyed and one with 100M in 2021.\n\nThey're echos of a bad bet made in 2018.\n\nEDIT:\n\nEchos is perhaps a bad metaphor, because echos get quieter.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8msscy",
                                            "author": "saylor_moon",
                                            "score": 1,
                                            "created_utc": 1652570276.0,
                                            "response": "I assume you mean the coins spent from\n\n[https://bitinfocharts.com/bitcoin%20cash/address/1FjHwcUf7rptVA7Pa3r3RGcdFaNwVYfCwJ](https://bitinfocharts.com/bitcoin%20cash/address/1FjHwcUf7rptVA7Pa3r3RGcdFaNwVYfCwJ)\n\nand\n\n[https://bitinfocharts.com/bitcoin%20cash/address/1Cwggz8nqgtfceB4jcUYpQoVUbDbVd4GeD](https://bitinfocharts.com/bitcoin%20cash/address/1Cwggz8nqgtfceB4jcUYpQoVUbDbVd4GeD)\n\nBut who did those coins belong to?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8w348u",
                                                    "author": "RiccaVern1",
                                                    "score": 1,
                                                    "created_utc": 1652748720.0,
                                                    "response": "I mean the person who holds the private keys for that.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i8mtzsz",
                                                    "author": "2q_x",
                                                    "score": 0,
                                                    "created_utc": 1652570846.0,
                                                    "response": "The owner of the private keys.\n\nIf someone wants to dump them on the market for 110 USD^2019 in 2022, they'll have new owners.\n\nThe market manipulation is kinda great.\n\nEDIT: \n\nThose addresses don't look like the recipients of loaned coins in May 2021.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8mw355",
                                                            "author": "saylor_moon",
                                                            "score": 1,
                                                            "created_utc": 1652571853.0,
                                                            "response": "I assume those addresses held coins that were loaned out and sold.\n\nIt wouldn't make much sense for an investor to slowly accumulate BCH for a year and then dump it at a very low price, so I assume it was a loan and the original investor expects to be repaid.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8oh7t4",
                                                                    "author": "bitkoin2014",
                                                                    "score": 1,
                                                                    "created_utc": 1652609018.0,
                                                                    "response": "Yep I guess so too. I guess they were loaned out dude.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "i8myncf",
                                                            "author": "number_go_up",
                                                            "score": 1,
                                                            "created_utc": 1652573119.0,
                                                            "response": "Which addresses did the loaned coins go to in May 2021?",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8w36z9",
                                                                    "author": "V4ND47",
                                                                    "score": 1,
                                                                    "created_utc": 1652748759.0,
                                                                    "response": "You can't really tell that. You kinda need chain analysis for that dude. Maybe it's just me.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "i8w30ij",
                                                            "author": "wallalons",
                                                            "score": 1,
                                                            "created_utc": 1652748667.0,
                                                            "response": "Whenever owns the key owns the keys. That's how it is.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i8w37sy",
                                            "author": "anthonyativo",
                                            "score": 1,
                                            "created_utc": 1652748771.0,
                                            "response": "Sometimes it's not about loaning the money it's about the manipulation.\n\nSome People borrow it because they want to manipulate the market too so yeah.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i8w3ah5",
                                    "author": "progirafov",
                                    "score": 1,
                                    "created_utc": 1652748808.0,
                                    "response": "He means that Time's up for the shit like luna. That's what it is.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8w3ath",
                            "author": "galagar12",
                            "score": 1,
                            "created_utc": 1652748813.0,
                            "response": "Well that wasn't true sir, they borrowed the btc and fucked luna.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8w3g82",
                    "author": "nunovenancio",
                    "score": 1,
                    "created_utc": 1652748888.0,
                    "response": "It follows them most of the time, but there's an update tomorrow.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uppu07",
            "title": "Bitcoin Cash Satoshi what? I use the real Bitcoin: Bitcoin cash.",
            "url": "https://read.cash/@Bitcoincashtrue/bitcoin-cash-satoshi-what-i-use-the-real-bitcoin-bitcoin-cash-0f72b57c",
            "author": "LowIndividual3126",
            "created_utc": 1652560557.0,
            "score": 15,
            "num_comments": 15,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8oqhlj",
                    "author": "TinosNitso",
                    "score": -2,
                    "created_utc": 1652616194.0,
                    "response": "The real Bitcoin is a **S**tore-**O**f-**V**alue, no matter what. If a bunch of scammers chose to fork it (&/or support the fork), then that just set back its development as cash by several years. LN etc is merely delaying the inevitable. If BCH can't be supported as a speculative **SOV**, then it should die, so that big-blockers can get back to work on turning the real Bitcoin into cash. There's a chance of smartBCH becoming a massive scam, and bringing BCH down with it (financial suicide may be a better option).",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8pt1tc",
                            "author": "hero462",
                            "score": 4,
                            "created_utc": 1652634909.0,
                            "response": "Say whaaaa?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "upr8ww",
            "title": "#SmartBCH tokens such as Xolos $RMZ are under a BitcoinCash Standard. We are creating The new Economy of the World 🌎🌏🌍",
            "url": "https://www.reddit.com/r/btc/comments/upr8ww/smartbch_tokens_such_as_xolos_rmz_are_under_a/",
            "author": "XolosRamirez",
            "created_utc": 1652565044.0,
            "score": 8,
            "num_comments": 11,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8mhnvg",
                    "author": "XolosRamirez",
                    "score": 1,
                    "created_utc": 1652565079.0,
                    "response": "https://memo.cash/a/d46a81619c",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}