{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "v0x253",
            "title": "😱 Have your miners gotten the Miner Breakeven Price? The past 2-week cycle was recorded with the mining revenues of $0.12 per 1 TH/s.",
            "url": "https://www.reddit.com/r/btc/comments/v0x253/have_your_miners_gotten_the_miner_breakeven_price/",
            "author": "YeemaPoli",
            "created_utc": 1653905814.0,
            "score": 0,
            "num_comments": 6,
            "subreddit": "btc",
            "selftext": "&#x200B;\n\nhttps://preview.redd.it/x9du0hui9l291.png?width=2000&format=png&auto=webp&s=6c1f5ebf0d808e78cc05b35539b48a7e3373a1bc\n\nThe Bitcoin network saw a change of -4.33% in the hashrate on 2022-05-25, the biggest negative percentage change in the recent 10 months. As the price fluctuates to around $30,000, the past 2-week cycle was recorded with the mining revenues of $0.12 per 1 TH/s.\n\nMore ASICs approach their breakeven prices. At the time of writing, miners with unit power of 60W/T could barely generate profits since the electricity cost rate was around 95%, and the cost rate for miners with a unit power above 65 W/T was more than 100%. This means that their electricity costs had exceeded the revenues that could be brought by the miners at the power rate of $0.08 per kWh. You may learn more details about this topic on f2pool’s [**Popular Miners**](https://www.f2pool.com/miners) page.",
            "stickied": false,
            "comments": [
                {
                    "id": "iajl0uv",
                    "author": "GETSOME88-007",
                    "score": 1,
                    "created_utc": 1653918211.0,
                    "response": "Make the switch to mining Bitcoin Cash!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iajw7vo",
                            "author": "big--if-true",
                            "score": 1,
                            "created_utc": 1653923625.0,
                            "response": "Wont help. They will have to shut off their machines since currently BCH isnt paying much to miners. At this point just buying the crypto mining rewards is cheaper than their electric bills.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "v0v18f",
            "title": "BCH, the UNTETHERED BItcoin",
            "url": "https://www.reddit.com/r/btc/comments/v0v18f/bch_the_untethered_bitcoin/",
            "author": "SnooHamsters7507",
            "created_utc": 1653896923.0,
            "score": 28,
            "num_comments": 21,
            "subreddit": "btc",
            "selftext": " BCH is the real BItcoin that is not backed by Tether assets, a purely peer-to-peer, decentralized digital currency that is not under the control of a central entity. It's high time you know this, so you know which Bitcoin you are putting your money into. When Tether collapse in the near future, I foresee Bitcoin BTC holders taking the rope of suicide. You need to take refuge in BCH because of the UNTETHERED nature of the currency. Other people may be jumping on the TETHERED Bitcoin  BTC bandwagon, but those who understand the doom Tether represents knows what's right to do.\n\n[https://read.cash/@Fexonice1/bch-the-untethered-bitcoin-78fd92d5](https://read.cash/@Fexonice1/bch-the-untethered-bitcoin-78fd92d5)",
            "stickied": false,
            "comments": [
                {
                    "id": "iaj2epw",
                    "author": "jessquit",
                    "score": 10,
                    "created_utc": 1653905700.0,
                    "response": "I thought this was an interesting article but it seems to be saying something backward, or is failing to make a point.\n\n> With BItcoin BTC being backed by tether \n\nYou say throughout the article that BTC is backed by Tether.\n\nIf anything, it is Tether which is backed by BTC.  This in turn supports / pumps the price of BTC.  So you could say that BTC *price* is backed by Tether, but obviously BTC itself isn't \"backed\" by anything.\n\nAlso it should be made clear that nobody knows what is backing Tether.  The close affiliation between iFinex and Blockstream  (as well as the price correlations etc) would surely imply a likelihood that BTC makes up at least some of Tether's backing.  But in reality we don't know, we just assume.\n\nHTH",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iak6hdx",
                    "author": "shadowmage666",
                    "score": 5,
                    "created_utc": 1653928208.0,
                    "response": "You do realize bch is traded all day for tether right? And that the exchange volume of bch is more than the available supply and bots are trading it all day using tether?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iak67w3",
                    "author": "-UNi-",
                    "score": 4,
                    "created_utc": 1653928093.0,
                    "response": "What a load of bullshit.\nIf BCH would be untethered it would have risen against BTC.\nMeanwhile it keeps dropping and dropping.\nIf anything its an indication BCH is tethered much more than BTC, or people just really dont give a fuck bout it. Spoiler: they dont give a shit. Buy order books are nearly empty on BCH trading pairs, sadly my bags are getting heavier by the day because nobody gives a shit. Even Russia doesnt give a shit, and they are blocked from international payment systems. What else needs to happen for people to care for p2p money? Idk, seems we can fight whatever we want, the masses dont give a fuck.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaistn4",
                    "author": "SnooHamsters7507",
                    "score": 3,
                    "created_utc": 1653897016.0,
                    "response": "I guess you need to read this to see how Tether spells doom for Bitcoin BTC",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iald4mb",
                            "author": "StephenJooba",
                            "score": 0,
                            "created_utc": 1653948006.0,
                            "response": "And if Bitcoin (BTC) goes down what do you think will happen to bcash (Bitcoin cash)?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ialjrp3",
                                    "author": "SnooHamsters7507",
                                    "score": 1,
                                    "created_utc": 1653951336.0,
                                    "response": "For now, BTC is still pulling the market, but when BCH reaches global adoption influence would not e a thing anymore.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ialot3s",
                                            "author": "birdman332",
                                            "score": 1,
                                            "created_utc": 1653953937.0,
                                            "response": "Absolutely detached from reality here",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iakal8q",
                    "author": "BCHisFuture",
                    "score": 1,
                    "created_utc": 1653930018.0,
                    "response": "Hard to compete with BTC who don't follow Coubertin's spirit...",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ialom3u",
                    "author": "birdman332",
                    "score": 0,
                    "created_utc": 1653953836.0,
                    "response": "Do you honestly think if the tether collapse you invision happens, that bch holders won't be absolutely wiped out? Btc props up the entire market",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iamvre4",
                    "author": "lightcorecash",
                    "score": 0,
                    "created_utc": 1653979308.0,
                    "response": "This is pure Comedy. Some People are brainwashed and really believe this bullshit 😂😂😂",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "v0nedj",
            "title": "Subtipper has just tipped the top posts for this community! [23:44 GMT May 29, 2022]",
            "url": "https://www.reddit.com/r/btc/comments/v0nedj/subtipper_has_just_tipped_the_top_posts_for_this/",
            "author": "rbtc-tipper",
            "created_utc": 1653867868.0,
            "score": 18,
            "num_comments": 4,
            "subreddit": "btc",
            "selftext": "Thanks to all posters for providing great content!\n\nThe top posts since the last payout (~1 week) have been tipped 1 US cent per vote, or 5395 sats per vote.\n\nFor an explanation of Subtipper and how it works, please see [this article](https://read.cash/@dave_gutteridge/subtipper-8e6564f2).\n\n&nbsp;\n\nWinning posts:\n***\n\n[Bitcoin breaks the record for the longest drop in quotes. The largest cryptocurrency in terms of capitalization has been falling in price for the eighth week in a row, setting an all-time record.](https://np.reddit.com/r/btc/comments/uxhyo4/bitcoin_breaks_the_record_for_the_longest_drop_in/) by u/KravoxWeb\n\n[[tip](https://np.reddit.com/r/btc/comments/uxhyo4/bitcoin_breaks_the_record_for_the_longest_drop_in/iahgcne/)] - 64740 sats = 0.00064740 BCH = ~0.12 USD\n\n\n***\n\n&nbsp;\n\nTips not claimed within 7 days will be returned to the Subtipper fund and tipped out to future posts.\n\n&nbsp;\n\nTo support this bot, help spread Bitcoin Cash, and encourage great content in the r/btc community, tip this post using Chaintip by including u/chaintip in your comment!\n\nThanks!\n\nNote: this payout event was triggered by [block 742264](https://explorer.bitcoin.com/bch/block/0000000000000000005c6f9f281466e71bb99ef49c0015439836cf4a3bc10005), which was mined more than 3 days since the last event and has the last three hex digits of its hash (joined as a number) strictly smaller than 7. The BCH price at the time of activation was $185.37",
            "stickied": false,
            "comments": []
        }
    ]
}