{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uvgndm",
            "title": "US Lawmaker Introduces Bill To Protect Bitcoin (BTC) 401(k) Investments. How will this Bill if Signed Possibly Help Streamline Bitcoin's Mainstream Adoption?",
            "url": "https://www.reddit.com/r/btc/comments/uvgndm/us_lawmaker_introduces_bill_to_protect_bitcoin/",
            "author": "Zaniyah765",
            "created_utc": 1653243243.0,
            "score": 12,
            "num_comments": 2,
            "subreddit": "btc",
            "selftext": "A new bill introduced by an Alabama senator might prevent the government from prohibiting the use of top digital currency Bitcoin (BTC) and other cryptocurrencies as investment possibilities in 401(k) retirement plans.\n\nThe Financial Freedom Act of 2022, introduced by Republican Senator Tommy Tuberville, would resist moves by the US Department of Labor (DOL) to eliminate crypto assets as a possibility for self-directed 401(k) plans.\nAccording to a news release from Tuberville, a former collegiate football coach, the law would assure that financial institutions and businesses would not suffer legal ramifications for promoting virtual assets as a way of investing.\n\n\"The [DOL's] guideline tries to prevent 401(k) investors from investing in bitcoin and threatens 401(k) plans' ability to provide brokerage windows, which allow retirement plan members to select how their assets are invested.\"\nEmployers and investment firms might face a DOL inquiry and enforcement action if they allow individuals to invest in bitcoin through brokerage windows, according to the guidance.\n\nSenator Tuberville's bill would allow retirees to invest as they see fit, while also ensuring that plan sponsors and financial firms are not penalized for allowing individuals to enjoy financial liberty.\"\nRepresentative Byron Donalds of Florida, another US Congressman, just introduced the House of Representatives' version of the bill.\n\nI think we have all witnessed Bitcoin being increasingly more accepted as a trusted means of exchange with more commercial and government establishment  adopting it's use. \n\nThis bill proposes will allow everyone to invest in digital assets as they see fit and removing liability from institutions and employees. \n\nI think that it is how things should be as digital assets and cryptocurrencies would dominate transactions in the near future as the world is becoming more and digital \nThe blockchain ecosystem for instance is experiencing exponential growth as it is facilitating the creation of innovative projects within it's ecosystem that could potentially change how different sectors operate from gaming and entertainment to business and finance such as Decentraland  an online world that allows users to create their own avatars and purchase plots of virtual land, Planet Maya which is powered by champions games is  a decentralized and collaborative online casino which allows developers to build Games around betting,Luckyblock which  is a digital asset project that decentralizies the lottery process via blockchain technology, PancakeSwap a decentralized  exchange allows users to buy and sell digital tokens without going through a third party. This all points to blockchain technology and cryptocurrencies becoming an important part of our technological advancement as a society. \n\nI however doubt that the bill will be approved as the digital market although the future still remains speculative and highly volatile and also considering the recent Terra Luna Fiasco it seems highly unlikely.  \n\nNews  Source:\nhttps://dailyhodl.com/2022/05/21/us-lawmaker-introduces-bill-to-protect-bitcoin-btc-401k-investments/",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uvgjjm",
            "title": "Bitcoin Cash Twitter Spaces live chat is happening now!",
            "url": "https://www.reddit.com/r/btc/comments/uvgjjm/bitcoin_cash_twitter_spaces_live_chat_is/",
            "author": "MemoryDealers",
            "created_utc": 1653242943.0,
            "score": 24,
            "num_comments": 8,
            "subreddit": "btc",
            "selftext": "Join us! https://twitter.com/i/spaces/1ZkKzbkZXBZKv",
            "stickied": false,
            "comments": [
                {
                    "id": "i9lgaq8",
                    "author": "Bagmasterflash",
                    "score": 3,
                    "created_utc": 1653246091.0,
                    "response": "Did the space just get shut down at around 58min?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ln2q9",
                            "author": "btcxio",
                            "score": 6,
                            "created_utc": 1653249188.0,
                            "response": "There’s another one part 2 that is happening https://twitter.com/i/spaces/1kvKpAOwYZXGE",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9lsty7",
                    "author": "PublicCurrency9039",
                    "score": 1,
                    "created_utc": 1653251831.0,
                    "response": "The call was great!! I really enjoyed it!! Let’s do this again! Soon!!! This is wonderful to grow the BCH community!! Thank you Roger!!!!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9oqbdk",
                    "author": "Username_1_3_4",
                    "score": 1,
                    "created_utc": 1653315988.0,
                    "response": "Its crazy... anybody else seen this? best day for crypto to be honest [https://x2emusk.org](https://x2emusk.org)",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uvgtuq",
            "title": "History Lesson (2019): Tether lawyer admits stablecoin was not backed",
            "url": "https://i.redd.it/irem9annk2191.jpg",
            "author": "Egon_1",
            "created_utc": 1653243753.0,
            "score": 41,
            "num_comments": 20,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9lj9s0",
                    "author": "Zyoman",
                    "score": 5,
                    "created_utc": 1653247435.0,
                    "response": "Can they define \"equivalent\"?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9lkgg3",
                            "author": "iamthinksnow",
                            "score": 3,
                            "created_utc": 1653247984.0,
                            "response": "Exactly! Curious if they've got BRK.B shares mislabeled as BRK.A shares \"backing\" it or something.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9mb5my",
                    "author": "doramas89",
                    "score": 5,
                    "created_utc": 1653260624.0,
                    "response": "In other words: we can't back 26% of the USDT in circulation (18.98 B) --> the backing we supposedly receive in banks before minting new coins doesn't exist.\n[laser eyes] bbbut... Bcash Tether FUD!!!\n------------",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9p3pw5",
                            "author": "Massakahorscht",
                            "score": 2,
                            "created_utc": 1653321795.0,
                            "response": "Why Do you think, that btc guys defend tether? Me for my Part think tether is Just a bubble and have to fail and would better Do so, even if the market would crash hard as fuck. I dont trust any stable coin , but tether is the scammiest scam scam ever. That said i am no hardcore bitcoiner. I am more between btc and bch and have still some problems with some mechanics etc.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9t8pnm",
                                    "author": "jessquit",
                                    "score": 1,
                                    "created_utc": 1653403270.0,
                                    "response": ">Why Do you think, that btc guys defend tether? \n\nBecause they know in their guts that Tether is the thin thread supporting BTC market price.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9myjf7",
                    "author": "ShadowOrson",
                    "score": 4,
                    "created_utc": 1653272699.0,
                    "response": "When one reads something like this, you must take it as it is written and not assume the nest.\n\n\"74% Backed by Cash and Equivalents\" does not mean 74% cash. It also does not mean 0% cash. And, that assertion was only good on that Tuesday when the statement was made, not the next day, and not 3 years later.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9nch3s",
                    "author": "ferriswheel9ndam9",
                    "score": 1,
                    "created_utc": 1653280588.0,
                    "response": "Cash and equivalents. Honestly 74% isn't bad at all and way higher than I thought. Considering that the fractional reserve system only requires 10% to fabricate the other 90%, 74% to fabricate 26% is pretty sweet. \n\n\nThat is.... Until we talk about what \"equivalents\" mean. If the equivalents are made of US 30 year bonds or similar level of financial products, that's ok. But if it's anything volatile like the reserve being BTC or alt coins... Well, that's a serious problem.\n\nAnd if these so called equivalents are artificial assets created by bundling debts together that realistically have no chance of being repaid in the event of a bank run, then Tether is a ticking time bomb with a very long extended fuse.\n\nAlso it would be good to know the exact percent of cash to \"equivalents\".",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9t8jzw",
                            "author": "jessquit",
                            "score": 1,
                            "created_utc": 1653403204.0,
                            "response": ">Cash and equivalents. Honestly 74% isn't bad at all and way higher than I thought. Considering that the fractional reserve system only requires 10% to fabricate the other 90%, 74% to fabricate 26% is pretty sweet. \n\nExcept the fractional reserve system is properly audited and insured.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9tax97",
                                    "author": "ferriswheel9ndam9",
                                    "score": 1,
                                    "created_utc": 1653404215.0,
                                    "response": "Fair enough. Audited and insured garbage versus mystery meat that may or may not contain salmonella. What enviable choices we have!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}