{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "unh8wt",
            "title": "Best Place To Put BTC And Hold Your Private Keys?",
            "url": "https://www.reddit.com/r/btc/comments/unh8wt/best_place_to_put_btc_and_hold_your_private_keys/",
            "author": "Fauxlosophys",
            "created_utc": 1652295752.0,
            "score": 3,
            "num_comments": 10,
            "subreddit": "btc",
            "selftext": "Just looking to consolidate some accounts holding BTC here and there.    \nWould love it if there's a way to have private keys and earn a small amount of APY but don't know if that's possible.  Suggestions?",
            "stickied": false,
            "comments": [
                {
                    "id": "i87zx03",
                    "author": "LovelyDayHere",
                    "score": 6,
                    "created_utc": 1652296318.0,
                    "response": "I have a different suggestion. Hear me out.\n\nMain point of Bitcoin is: sound money in your control.\n\nHolding private keys is a good step.\n\nBut now you expect to earn money simply by holding it?\n\n---\n\nThere is one way I believe this can work:\n\nWork on making the money more valuable (increase its utility).\n\nBitcoin Cash, for example, is working on that in various ways, the most important one being to expand the user base and network effect of [peer to peer electronic cash](https://bitcoin.com/bitcoin.pdf), through promoting its adoption in commerce.\n\nAs the economic network grows, so can the value of the coin, and thus the coins you hold become worth more.\n\nThis requires work, and there's of course no guarantee that the world will recognize its value, but ... it also doesn't have some of the risks of other ways.\n\nI just wanted to mention this option.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}