{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "usjnwh",
            "title": "FTX Founder Sam Bankman-Fried Thinks Bitcoin Has No Future as a Payments Network. Could Bitcoin beat it Scalability issues and be an effective means of exchange on a Global issues ?",
            "url": "https://www.reddit.com/r/btc/comments/usjnwh/ftx_founder_sam_bankmanfried_thinks_bitcoin_has/",
            "author": "Bourneser",
            "created_utc": 1652899191.0,
            "score": 1,
            "num_comments": 0,
            "subreddit": "btc",
            "selftext": "FTX founder Sam Bankman-Fried has shared his thoughts on bitcoin's future direction and the true worth of its structure. Bankman-Fried challenged the implementation of Bitcoin as a payment network in an interview with the Financial Times. For various reasons, he believes the Bitcoin blockchain technology will never operate as a day-to-day payment system.\n\nOne of them is the Bitcoin blockchain's perceived lack of scalability, while the executive's second concern is the energy and environmental ramifications of this possible increase compared to other options. Bitcoin, according to Bankman-Fried, is similar to gold in that it is impractical to utilize. He explained:\n\nWhy don't we go to a store and buy gold bars in person? First and foremost, it would be foolish and ridiculous. It would be prohibitively costly. I'm sure it'd be harmful for the environment as well.\n\nHe also stated that proof-of-stake (PoS) networks would be more effective in completing these duties, \n\nBitcoin, according to Bankman-Fried, has other unique features that make it suitable as \"an asset, a commodity, and a store of value.\"\n\nHowever, certain viewpoints differ from those of Bankman-Fried. The Bitcoin Lightning Network (LN), a second layer (L2) expansion protocol for Bitcoin that promises extremely low transaction costs, may be a solution to the scaling issues that first-generation blockchains such as Bitcoin encounter when they get congested.\n\nI think there has been an increase in the discussion of  whether Bitcoin is more than just a store of value and can be used has a means of exchange. This argument is even more heated now that there has  the number of government and commercial institutions adopting Bitcoin continues to grow. The question is whether Bitcoin's scalability issue would ever allow it to be an effective means of exchange. We have seen an increase in the use of cryptocurrencies and also a surge in the use of blockchain technology by diverse innovative projects. This makes the issue more important because the question isn't what is Bitcoin and is it here to stay any more but how can  Bitcoin be effectively utilized. \n\nBitcoin paved the way for a thriving blockchain ecosystem system. \nThe blockchain ecosystem is experiencing phenomenal growth with more innovative projects cratering to different needs being invented such as\nDecentraland  an online world that allows users to create their own avatars and purchase plots of virtual land, Planet Maya which is powered by champions games is a decentralized and collaborative online casino which allows developers to build Games around betting, Luckyblock which  is a digital asset project that decentralizies the lottery process via blockchain technology, Silks a blockchain based metaverse that enables users to own, trade, and profit from thoroughbred racing horses. Blockchain technology seems on track to being adopted to different sectors of our society's system to make them more effective such as business and entertainment. When this fully happens cryptocurrencies  would see more use with Bitcoin potentially taking half of the demand. \n\nIt would be interesting to see how Bitcoin would meet this increased demand.\nI am not really convinced about how effective the lighting network is and I would rather just view bitcoin has a store of value until a more effective solution is provided. \n\nNews source:\nhttps://news.bitcoin.com/ftx-founder-sam-bankman-fried-thinks-bitcoin-has-no-future-as-a-payments-network/",
            "stickied": false,
            "comments": []
        }
    ]
}