{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ux53yl",
            "title": "BTC failed as a MoE and as SoV. Bitcoin Cash is the future.",
            "url": "https://youtu.be/84p4WCbfCyw?t=2473",
            "author": "tralxz",
            "created_utc": 1653438477.0,
            "score": 20,
            "num_comments": 8,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9y9wrc",
                    "author": "1molon3labe7",
                    "score": 4,
                    "created_utc": 1653495540.0,
                    "response": "You sir, are a blessing for the Bitcoin cash space. Thank you!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9x6anq",
                    "author": "TinosNitso",
                    "score": 2,
                    "created_utc": 1653476977.0,
                    "response": "BTC has so far succeeded as a **SoV**, at least it has compared to BCH. The price charts make that much clear enough.\n\nWhile I wish BCH is the future, I think gold is still theoretically probably superior. The biggest problem is that leaders like Schiff are like hopeless (possibly even retarded) at actually explaining how a **decentralized gold standard** would work. [Here](https://coincraft.com/cashgold-01g-in-gold-we-trust)'s an example of a cash note embedded with **0.1g** of gold (**$6** worth) selling for **$37**, before tax & shipping. Schiff's first response would be to diss it, because it has numismatic value. But that's how a gold standard is supposed to work! He'd have to give away a bunch of **100mg** & **10mg** gold notes (worth **$6** & **60c**), so that a country like El Salvador could have good cash (equal to gold, but better than Russia's Rouble). You see, giving away numismatic notes is like a Bitcoin faucet, like how Andresen gave away a bunch of BTC. Without such leadership, Schiff's gold standard seems doomed.\n\nIn defense of Schiff, he could allege that it's the engineers holding him back. We all need cheap X-ray machines which we can pass gold notes through. The machine must read out the weight of gold + purity, with at least 90% accuracy (to verify it's not a complete fake). Unfortunately, X-Ray weighing of embedded gold doesn't even exist. So Schiff could argue it's the **engineers** who are the retards. The cheapest [X-Ray machine](https://www.ebay.com/itm/152863175730?hash=item23975af432:g:ucMAAOSw5mFdw6fE) is like **$9k** after tax + shipping, and it can't even calculate volume/weight using an X-Ray cross-section, making it possibly worthless in the long-run.\n\nBut if gold is the best possible standard to use, why BCH? The problem with gold on the internet is it all relies on the threat of violence. e.g. Perfect Money executives are under threat of jail & prison if they ever defraud verified users, not to mention vigilante justice. If someone \"exits\" Bitcoin, no such threat of violence exists. True digital gold like bitcoin is arguably essential, for libertarians to support **e-commerce**. The possibility of having to give ppl life in prison, just because we want some trades to work properly, is holding back the internet itself!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ycm54",
                            "author": "tua79344",
                            "score": 2,
                            "created_utc": 1653496582.0,
                            "response": "Amazing stuff. Once the world discovers BCH it will disrupt literally everything.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia0ej28",
                    "author": "ALEX110392",
                    "score": 1,
                    "created_utc": 1653527946.0,
                    "response": "Stop dreaming… BTC, at best, is successful membership  tokens. It will not replace any fiats, never.\n\nThere is no doubt that Bitcoin cash has always been a powerful crypto currency .",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9y3o8p",
                    "author": "fjjjfjfnfnfng",
                    "score": 0,
                    "created_utc": 1653493090.0,
                    "response": "LMAO Peter Schiff. Bitcoin is the present and future, Bcash is trash",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}