{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uwnuzf",
            "title": "Bitcoin moves $6.7 billion around the world every day",
            "url": "/r/Currencycom/comments/uwnuoe/bitcoin_moves_67_billion_around_the_world_every/",
            "author": "currencycom",
            "created_utc": 1653388892.0,
            "score": 0,
            "num_comments": 15,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9t45tf",
                    "author": "jessquit",
                    "score": 2,
                    "created_utc": 1653401270.0,
                    "response": "SWIFT moves over $5T.\n\nThat's it boys. The market has spoken. USD is the real Store of Value.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9t51yg",
                    "author": "TinosNitso",
                    "score": 1,
                    "created_utc": 1653401678.0,
                    "response": "The $6.7B/day might be **spam** txns. However spammers are unlikely to move large amounts with spam-bots.\n\nAssuming a fee rate of 1 sat/vB, it'd cost only a max of **$42k/day** (or $15M/year, assuming zero holdings from when BTC was cheap) to permanently congest **1MvB** blocks. That's a lot cheaper than a 51% attack, and virtually guarantees a fork, since **4c** fees block micro-transactions. A micro-fork could be attempted, even if it's a bad **S**tore-**O**f-**V**alue, since a fork is arguably superior to a side-chain (anyone can buy equal amounts of either). A fork like BCH could **exit-scam** investors, but so could a side-chain like Liquid. Whenever a fork fails, BTC can just be re-forked, if everyone has equal amounts of either. Speculators can cause hostile congestion for no hostile reason.\n\nWhen I withdraw BTC from Binance, I wonder who all the other outputs are, since I alone am always charged the full fee for **23 to 26 outputs**. They increase the anonymity set, making Binance harder to trace. Could be spam. Could be that Binance could just as well make all withdrawals free, since it'd help add spam to beef up the BTC chain. But giving out **free withdrawals**, like at FTX, makes the spam too obvious.\n\n**Edit**: Binance hot wallet is [this](https://www.blockchain.com/btc/address/bc1qm34lsc65zpw79lxes69zkqmk6ee3ewf0j77s3h) one.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9uc6no",
                            "author": "number_go_up",
                            "score": 2,
                            "created_utc": 1653419663.0,
                            "response": "Can you identify Binance's BCH wallet?\n\nThere has been a lot of speculation about whether they have any BCH since they keep disabling or delaying withdrawals.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9x0ag7",
                                    "author": "TinosNitso",
                                    "score": 1,
                                    "created_utc": 1653472282.0,
                                    "response": "Sorry, I can't find it. BCH wallet probably operates completely differently to BTC. Withdrawal fees are approx 2c for XMR, **20c** for BCH, **$1** for USDT & **$6** for BTC. Binance deposits & withdrawals ([network status](https://www.binance.com/en-AU/network)) are reportedly fine.\n\nIf anyone's interested, we can simultaneously withdraw BTC from our Binance accounts (we both enter the final 2FA code simultaneously). If our 2 withdrawals are both in the exact same BTC txn, then maybe all the outputs are real ppl like us, & everyone pays $6. Otherwise, if our withdrawals are separate, the outputs are almost all like spam dummies.\n\nThe spam-theory idea is that for all the alt-coins to have value, BTC must be operating at its upper limit, therefore huge amounts of deliberate spam are required. BCH operates at only **0.3 TPS**, instead of **3 TPS** for BTC. Furthermore, Binance can mislead its investors by pretending to have more customers, by faking BTC withdrawals, since they need spam anyway.\n\nWith a crypto like ETH, for it to have the highest possible value (or arguably *any* value), it needs to operate at like **13 TPS**. It's a bit like Satoshi using a pre-mine to spam his own chain, to fake volume. TRON, imo, should be at least 1 or 2 TPS, given \"we\" traders all use USDT on Tron, but it's reported at well over **50 TPS**.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9xdafh",
                                            "author": "number_go_up",
                                            "score": 3,
                                            "created_utc": 1653481256.0,
                                            "response": "The sudden 100 MB backlog on May 11 was widely assumed to be spam, possibly someone covering up for being unable to meet withdrawal requests.\n\nI'm not sure what motivation they would have for daily spam though. Much of it seems to be in big batches specifically targeted to slow down the network during periods of extreme price volatility.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9tktp0",
                    "author": "-ism-isa-con",
                    "score": 1,
                    "created_utc": 1653408342.0,
                    "response": "That's not bad.  Still it isn't able to serve everyone.  Not enough network capacity.  \n\nInteresting that the network capacity problem is a policy decision from Bitcoin Core central command, at least 3 of whom also happen to be working on CBDC: https://dci.mit.edu/people",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}