{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uywoxj",
            "title": "NY Assemblyman Clyde Vanel passed a bill that will require Cryptocurrency advertisers to disclose how much they own in what they advertise",
            "url": "https://i.redd.it/p9rt1g6kd0291.jpg",
            "author": "chase_mike86",
            "created_utc": 1653652898.0,
            "score": 31,
            "num_comments": 10,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "ia6m704",
                    "author": "chase_mike86",
                    "score": 1,
                    "created_utc": 1653653037.0,
                    "response": "Excerpt from the bills memo:\n\n\"It is not enough for security token advertisers to state\nthat their advertisement is in fact an advertisement to\nsafeguard investors. Instead, to protect investors from\nbeing misled by security token advertisers, it is critical for such advertisers to disclose the amount they were paid, whether their purchase will directly result in the\nadvertiser making money on the security token, and the\nnumber of security tokens they received. If prospective\ninvestors learn that an advertiser was compensated in the form of security tokens or other forms of compensation for their advertisement, they may or may not be hesitant to put their hard-earned money into such an investment. Regardless of the decision they end up making, it is every investor's right to have the information necessary to make that decision in the first place.\n\nhttps://assembly.state.ny.us/leg/?default_fld=&leg_video=&bn=A09029&term=0&Summary=Y&Text=Y",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia6rcj6",
                            "author": "LovelyDayHere",
                            "score": 1,
                            "created_utc": 1653655936.0,
                            "response": "Bitcoin is not a security token.\n\nThis is not a general crypto sub.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia7o9vi",
                    "author": "OrigamiMax",
                    "score": 1,
                    "created_utc": 1653670210.0,
                    "response": "Does this apply to all advertising? Eg how much did Pfizer pay company x to run its latest ad campaign?",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}