{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uvhkpf",
            "title": "After adopting Bitcoin and cryptocurrencies, El Salvador is on the brink of crisis. Will Bitcoin become the first coin to destroy a nation's economy as it originated De-FI?",
            "url": "https://www.reddit.com/r/btc/comments/uvhkpf/after_adopting_bitcoin_and_cryptocurrencies_el/",
            "author": "Livid_Toe_721",
            "created_utc": 1653245922.0,
            "score": 1,
            "num_comments": 0,
            "subreddit": "btc",
            "selftext": "After Terra depegging, everything was demolished in De-Fi, but the place that got affected the most is El Salvador, without any doubt. \n\nEl Salvador is a Central American state that recently became the world's first region to regulate BTC cryptocurrency as legal tender, nearly allowing it to replace traditional currency in its economy by planning to issue tokens for sovereign bonds. \n \nAs per Mint\n( https://www.livemint.com/market/cryptocurrency/bitcoin-sees-flash-crash-on-the-day-el-salvador-adopts-it-as-legal-tender-11631032181072.html )\n\nEl Salvador injected significant liquidity of its holdings in BTC while it was down. The purpose behind it was to attract FDI, reduce economic dependence on the US dollar, etc. However, it backfired after bitcoin crashed to 40% of its all-time high, and it declined more after Terra depegging. \n\nThe state's debts have increased, the economy is in a negative trend, and it is near to a crisis and whatnot. Exiting now and selling all BTC could be a table-turning move as the state will nearly lose half of its liquidity. Yet, the suitable option for El Salvador seems to be to hold on till the market recovers. \n\nIt is the best option since new protocols might help De-Fi and BTC recover better; Tea, for example. It is a protocol that allows users to develop open-source projects alongside providing remunerations, hence paving the way for projects which have the potential to clinch success.",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uvho6s",
            "title": "China Can’t Seem to Stop Bitcoin Mining",
            "url": "https://www.coindesk.com/layer2/2022/05/22/china-cant-seem-to-stop-bitcoin-mining/",
            "author": "Aggressive-Collar882",
            "created_utc": 1653246173.0,
            "score": 1,
            "num_comments": 8,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9locog",
                    "author": "big--if-true",
                    "score": 2,
                    "created_utc": 1653249771.0,
                    "response": "They can just turn off their machines and buy the same crypto for less. WTF is wrong with them?...Or do they hold so much crypto they need the price to recover or they are bankrupt? So they continue to mine even at a loss, to reduce sell pressure.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9nwtwz",
                            "author": "Doublespeo",
                            "score": 3,
                            "created_utc": 1653297213.0,
                            "response": ">\tThey can just turn off their machines and buy the same crypto for less. WTF is wrong with them?\n\nI guess theyight have access to cheap or free electricity.\n\nOr it is the only way to get Bitcoin in china?\n\n>\tSo they continue to mine even at a loss, to reduce sell pressure.\n\nselling pressure form miner is really minimum, I doubt it affect the price much.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9mcpex",
                            "author": "doramas89",
                            "score": 2,
                            "created_utc": 1653261437.0,
                            "response": "They can reduce the sell pressure by a higher amount by spending what they would spend in electricy this way in buying coins at market price. Article is just sensationalism, the machines online are models that are still profitable and these articles assume the hashrate is coming from old rigs operating at a loss.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}