{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uwsu7x",
            "title": "Bitcoincash is redefining the financial system. It is debunking the myth that surrounds traditional money. It is making a statement that money can be used at will, anyhow and anywhere. It is stating that financial freedom is achievable. BCH needs to be heard and we are the voice!",
            "url": "https://read.cash/@Gabu/bitcoincash-a-tool-to-redefine-the-worlds-financial-system-762315a5",
            "author": "GabbyShare",
            "created_utc": 1653404510.0,
            "score": 43,
            "num_comments": 15,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9to2js",
                    "author": "CurvyGorilla202",
                    "score": 5,
                    "created_utc": 1653409666.0,
                    "response": "100% agree",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9te8a0",
                    "author": "CDSagain",
                    "score": 3,
                    "created_utc": 1653405608.0,
                    "response": "Yes yes bitcoin cash great. But your constant spamming of your read cash links is just really fucking boring. \n\nYour entire Reddit history is 1 long chain of read.cash links. \n\nThis is Reddit, this is r/BTC, this is not read.fucking.cash. if I want to read a endless number of circle jerking, cheerleading \"hey guys, isn't bitcoin cash just the best thing ever\" BS written by people just writing shite they think will earn them the most tips, then I'll go to read.fuckin.cash.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia1r35t",
                    "author": "Warm-Top-4816",
                    "score": 1,
                    "created_utc": 1653560564.0,
                    "response": "Indeed, i got familiar with BCH at stores around Florida. Once i saw 3 merchants accepting it i knew I had to look it up. So yeah, I've experienced this first hand. Even though i prefer holding my BCH i still convert shiryo or others to encourage these sellers.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9u3w96",
                    "author": "Da0ptimist",
                    "score": -9,
                    "created_utc": 1653416170.0,
                    "response": "Incorrect. BTC, ETH, AMP, Loopring, Lightning network.\n\nThis is the true leaders redefining finance. \n\nLet's be real. BCH is down 75% and has a cult following.\n\nEdit: the replies clearly demonstrate the very low IQ of BCH holders. Hahaha",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9upjlx",
                            "author": "TheSupremist",
                            "score": 2,
                            "created_utc": 1653425286.0,
                            "response": "Whoa dude go easy on your copium there you're not Charlie Sheen to handle that amount",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}