{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uxrwun",
            "title": "Crypto Whales Ditched Tether for USDC After Stablecoin Panic",
            "url": "https://www.coindesk.com/markets/2022/05/25/crypto-whales-ditched-tether-for-usdc-after-stablecoin-panic",
            "author": "Egon_1",
            "created_utc": 1653514970.0,
            "score": 22,
            "num_comments": 25,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9zmn1i",
                    "author": "Egon_1",
                    "score": 9,
                    "created_utc": 1653515062.0,
                    "response": "> But it might also be the case that some large accounts are de-risking their holdings, turning to the perceived assurances of USDC’s monthly attestations and full-reserve backing.\"",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9zzx5n",
                    "author": "knowbodynows",
                    "score": 4,
                    "created_utc": 1653521080.0,
                    "response": "> USDC, the second-largest stablecoin, has been gaining market share since the once-$18 billion UST stablecoin collapsed and USDT’s peg to the dollar wobbled.\n\nWhy didn't they switch over long ago? What's the advantage of tether over USDC?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia02sdt",
                            "author": "xjunda",
                            "score": 3,
                            "created_utc": 1653522447.0,
                            "response": "\n> What's the advantage of tether over USDC?\n\n\nNone, unless you are the one printing it.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "ia0ix5u",
                            "author": "Ok_Aerie3546",
                            "score": 2,
                            "created_utc": 1653529966.0,
                            "response": "I think the whales holding usdt were holding it because there are more returns to be made through defi in usdt.\n\nOnce luna crashed, whales and their liquidity providers wanted to derisk, but still stay around to buy bitcoin, so they swapped it for usdc as usdc is somewhat less risky to hold due to their monthly assurances.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia0pw5p",
                                    "author": "knowbodynows",
                                    "score": 3,
                                    "created_utc": 1653533244.0,
                                    "response": "Downrisking to USDC is a negligible change in risk if you believe a Tether collapse will crash the whole space. Do you think USDC would hold just fine in a Tether implosion? Why wouldn't it?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia0r84k",
                                            "author": "Ok_Aerie3546",
                                            "score": 0,
                                            "created_utc": 1653533891.0,
                                            "response": "Lol ofcourse usdc would hold. Thats what the monthly assurances mean. Investors can go straight to circle and redeem 1 usd for 1 usdc no matter what the exchange rate.\n\nJust recently blackrock acquired a stake in circle and said they would be reponsible for holding circles reserves. The largest asset manager providing liquidity is as risk free it can get.\n\nYou think blackrock cant conjure up 50 billion in a day?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia0t5wk",
                                                    "author": "knowbodynows",
                                                    "score": 3,
                                                    "created_utc": 1653534868.0,
                                                    "response": "If the tether vs usdc security is so night& day it just seems that the big migration would have taken place well over a year ago.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "ia0u55h",
                                                            "author": "Ok_Aerie3546",
                                                            "score": 4,
                                                            "created_utc": 1653535381.0,
                                                            "response": "\"By partnering with ​​BlackRock, Circle is looking to explore capital market applications, per the announcement. BlackRock will also play a role as an asset manager of USDC cash reserves.\"\n\n-April 12, 2022",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "ia0tb37",
                                                            "author": "Ok_Aerie3546",
                                                            "score": 1,
                                                            "created_utc": 1653534944.0,
                                                            "response": "Blackrock buying the stake only happened like a month ago.\n\nPlus tether has always had a first mover advantage. It has more liquidity in defi products. More liquidity means more efficient markets means higher profit margins.\n\nWe needed a luna crash to get people to move over from the status quo and value safety more than yields.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "ia0yyca",
                                                                    "author": "knowbodynows",
                                                                    "score": 2,
                                                                    "created_utc": 1653538143.0,
                                                                    "response": "I see! Thank you. So Luna kinda took one for team crypto, itself a warning shot to maybe soften the crash. But how much can USDC issue and how fast..?",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "ia10vjl",
                                                                            "author": "Ok_Aerie3546",
                                                                            "score": 2,
                                                                            "created_utc": 1653539341.0,
                                                                            "response": "Circle is planning to go public through a spac. I think that will help them expand quickly when needed. And also provide users much needed confidence regarding usdc.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia1qkth",
                    "author": "WippleDippleDoo",
                    "score": 1,
                    "created_utc": 1653560156.0,
                    "response": "USDC is equally corrupt.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}