{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "utadqb",
            "title": "Thoughts on Hal Finney suggesting banks to be a second layer scaling solution for Bitcoin in 2010?",
            "url": "https://bitcointalk.org/index.php?topic=2500.msg34211#msg34211",
            "author": "Maxwell10206",
            "created_utc": 1652986438.0,
            "score": 0,
            "num_comments": 15,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i98zw1d",
                    "author": "Shibinator",
                    "score": 11,
                    "created_utc": 1652994402.0,
                    "response": "Hal Finney seemed to take quite a separate track to Satoshi in terms of scaling and the end goals of the currency, even right from the start, which was quite interesting.\n\nIt has now elevated him above Satoshi to the BTC crowd, who have been quoting him more and more frequently since that's convenient, as they have essentially ceded the vision and ideas of Satoshi and can't refer to his whitepaper or scaling commentary without looking foolish.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i98tz7l",
                    "author": "Remora_101",
                    "score": 10,
                    "created_utc": 1652991205.0,
                    "response": "It's a nightmare.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i98qs0g",
                    "author": "iseetable",
                    "score": 7,
                    "created_utc": 1652989890.0,
                    "response": "It is wishful thinking to believe a significant number of crypto users will keep their own keys. \n\nMost people fall for \"This is Johnny from the Microsoft of the United States\" scam.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i98zop6",
                            "author": "Shibinator",
                            "score": 11,
                            "created_utc": 1652994310.0,
                            "response": "Yes, they will.\n\nBut they won't the second time.\n\nBitcoin is going to globally realign people's ability to take responsibility.  This is yet another revolutionary aspect to it.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9baycm",
                    "author": "Bagmasterflash",
                    "score": 2,
                    "created_utc": 1653044662.0,
                    "response": "He is right.  Most won’t want the responsibility of holding their own keys.  \n\nBack then defi didn’t exist so banks were Hal’s conclusion. \n\nNow with sBCH we have a decentralized way of holding your coins without actually having keys. \n\nDefi protocols will be de facto banks with more or less inherent risk vs reward rates.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9h5cf8",
                    "author": "jessquit",
                    "score": 1,
                    "created_utc": 1653157007.0,
                    "response": "All the transaction capacity in the world is pointless if you must sacrifice the very thing that makes Bitcoin special to begin with: the ability to make hard money casual transactions between any two willing parties with no need of a financial intermediary.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}