{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uuke4g",
            "title": "Okay here's a question - BTC fees are literally as low as they can go right now. It has been like this for like 95% of the time for the past year. There's only been twice when there was a substantial fee market on bitcoin - 2017 and Q1 2021. Was the BCH hard fork really necessary?",
            "url": "https://i.redd.it/myh8wdu13t091.png",
            "author": "EnterShikariZzz",
            "created_utc": 1653129024.0,
            "score": 0,
            "num_comments": 69,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9fwrvk",
                    "author": "JonathanSilverblood",
                    "score": 13,
                    "created_utc": 1653135130.0,
                    "response": "> Was the BCH hard fork really necessary?\n\nYes, there was a divergence in consensus about what to do, and to reconcile there had to be two chains. It doesn't matter if none, one or both of those chains succeds or fails at any metric - the fork was a matter of subjective opinion at the time.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9g1neb",
                    "author": "jessquit",
                    "score": 6,
                    "created_utc": 1653138145.0,
                    "response": "Don't you understand that your argument is exactly **why** the fork was necessary?\n\nBTC is completely failing to meet its security goals. With no more additional onchain transactions possible, the only way for BTC to maintain its current security is for fees to double at least every four years. But as you point out, despite the popularity of BTC, fees have not trended up as they predicted. People simply aren't going to spend $50 on a transaction on a regular basis. They'll exit instead.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9j2qzw",
                            "author": "EnterShikariZzz",
                            "score": 1,
                            "created_utc": 1653194037.0,
                            "response": "If BTC fails because it doesn't generate a sufficient security budget from fees post block reward than BCH certainly won't either. BCH fees in the block reward are even lower\r  \n\r\r  \nAlso you know that if BTC collapses the whole cryptocurrency market will collapse alongside it? Including BCH",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9j7gwz",
                                    "author": "jessquit",
                                    "score": 1,
                                    "created_utc": 1653197468.0,
                                    "response": ">If BTC fails because it doesn't generate a sufficient security budget from fees post block reward than BCH certainly won't either. BCH fees in the block reward are even lower\r  \n\nAgain, neither coin is meeting it's security requirement at all \n\nThe difference is that on BTC there is **no opportunity to increase security due to increased adoption and volume.** It *must* come from the \"fee market.\"\n\nAnd **as you pointed out,** for the last five years, the \"fee market\" has failed to materialize, **despite** BTC being the defacto market leader. It appears that BTC fees have already hit their lifetime highs, and security can only go down from here. \n\nBCH earns fees from adoption. The only limit to BCH security is adoption. We don't know whether BCH's security model has failed, because it lacks adoption. The worst we can say at this point is that it lacks adoption.\n\r  \n>Also you know that if BTC collapses the whole cryptocurrency market will collapse alongside it? Including BCH\n\n**Good.** You get rich quick bozos are what ruined the entire crypto space.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9fprlo",
                    "author": "LovelyDayHere",
                    "score": 16,
                    "created_utc": 1653129869.0,
                    "response": "I hope you realize that low fees on BTC base layer means a security failure for the store-of-value-with-L2-as-payments coin.\n\nThe BCH hardfork was done to ensure that a bitcoin with a viable economic model survives.\n\nBecause when BTC finally collapses, a lot of folks are going to get severely burned.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9fqere",
                            "author": "EnterShikariZzz",
                            "score": 1,
                            "created_utc": 1653130409.0,
                            "response": "If BTC fails because it doesn't generate a sufficient security budget from fees post block reward than BCH certainly won't either. [BCH fees in the block reward are even lower](https://bitinfocharts.com/comparison/fee_to_reward-btc-bch.html#log&3y).\n\nAlso you know that if BTC collapses the whole cryptocurrency market will collapse alongside it? Including BCH",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9fv62d",
                                    "author": "chainxor",
                                    "score": 12,
                                    "created_utc": 1653134046.0,
                                    "response": "Wrong. BCH can grow and rather quickly change those dynamics. BTC can't, not even if the whole alt market decided to go back to BTC. BCH would handle that WAY better.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9j7drr",
                                            "author": "EnterShikariZzz",
                                            "score": 1,
                                            "created_utc": 1653197399.0,
                                            "response": "ah yes, of course BCH will suddenly turn around and save the day even though it has shown no signs of doing that in the last 5 years.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9jbr0o",
                                                    "author": "jessquit",
                                                    "score": 1,
                                                    "created_utc": 1653200922.0,
                                                    "response": "ah yes, of course BTC will suddenly turn around and develop a fee market even though you admit it has shown no signs of doing that in the last 5 years",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9jcbye",
                                                            "author": "EnterShikariZzz",
                                                            "score": 1,
                                                            "created_utc": 1653201406.0,
                                                            "response": "It's shown it more than BCH at least",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i9fwhn1",
                                    "author": "JonathanSilverblood",
                                    "score": 11,
                                    "created_utc": 1653134942.0,
                                    "response": "past success is not an guarantee for future performance. or some such.\n\nWhat I'm saying is that neither BTC nor BCH (nor any other PoW blockchains) are paying their security budget form fees today.\n\nWe can't know today what the future holds, but what we can know is that the structure of a limited blocksize cannot pay for the security necessary in the future withour having a high fee.\n\nThat does not mean that BCH automatically succeeds just because it can support more transactions per block, for BCH to succeed it must produce value that is attractive to users.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9fxxdc",
                                    "author": "The_Jibbity",
                                    "score": 9,
                                    "created_utc": 1653135885.0,
                                    "response": "The goal is to achieve on the order of 10,000X more transactions. The fork doesn’t look necessary for current demand, however no one knows how much more adoption Bitcoin would have if it didn’t reach it capacity as easily as it does over the las 4-6 years… the goal of scalable P2P currency is maybe silly to some but most people in this sub think it will be feasible, to achieve this the fork was necessary regardless of how things seem right now.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9g2j2c",
                                    "author": "jessquit",
                                    "score": 7,
                                    "created_utc": 1653138645.0,
                                    "response": "You're entirely right that BCH has also been failing to meet its security goals.\n\nBut BCH security goals can be met through adoption since the security model is [low fees] x [high volume]\n\nBTC's model is [high fees] x [low volume] so its goal can only be met with ever higher fees\n\nIn the long run it's a question of finding 3M ppl willing to pay $0.01 for a txn vs 3000 ppl willing to pay $10.\n\nAs you point out, BTC's fees aren't going up any more than BCH's adoption.\n\n> you know that if BTC collapses the whole cryptocurrency market will collapse alongside it?\n\nThanks Blockstream.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9g0atv",
                                    "author": "LovelyDayHere",
                                    "score": 3,
                                    "created_utc": 1653137361.0,
                                    "response": "Both your points are speculation.\n\nWhereas the halving on BTC and its self-imposed economic constraints are fairly hard to change. Even though BTC supporters have been proposing to inflate it past the 21M limit. But I guess they know it would lose even more claim to being 'Bitcoin' then.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9g5i2r",
                                    "author": "mrtest001",
                                    "score": 3,
                                    "created_utc": 1653140283.0,
                                    "response": "As long as BTC is in the top 10 crypto, it means cryptocurrency is not being used by many people for its intended purpose. \n\nSo yes, its absolutely inevitable for BTC to not just drop - by die.  Unless of course, crypto never really solved a problem the world had.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9j5z6n",
                                            "author": "EnterShikariZzz",
                                            "score": 1,
                                            "created_utc": 1653196330.0,
                                            "response": ">  Unless of course, crypto never really solved a problem the world had.\n\nYou might be on to something here.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9fvkeo",
                    "author": "PanneKopp",
                    "score": 4,
                    "created_utc": 1653134325.0,
                    "response": "BTC Maximalism has brought down on chain usage to its lowest, forcing people into custodial 3rd party solutions or dragged them away onto other centralized blocxkchains - do you still believe BTC is \"Bitcoin\" ?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9fxm59",
                    "author": "BewareOfShills",
                    "score": 5,
                    "created_utc": 1653135681.0,
                    "response": "Yes, because the spikes and the fee auction is a way to curb BTCs adoptions and will lead to its demise when the coinbase runs out.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9g42wt",
                    "author": "mrtest001",
                    "score": 4,
                    "created_utc": 1653139512.0,
                    "response": "I am not sick right now.  Are hospitals really necessary?\n\nIts not enough for \"Bitcoin\" to be low fee every other Tuesday on a full-moon.  For it to be used as cash it needs to be low-fee 24/365 and not just for a select few, but for billions of people.\n\nIf BTC is low-fees right now it means less than 300K transactions are happening per day.  It means BTC is not being used by few hundred thousand people.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9g5pjw",
                    "author": "mrtest001",
                    "score": 5,
                    "created_utc": 1653140391.0,
                    "response": "So do the math with me.\n\nif BTC can process 400K txns per day.\n\nAnd BTC miners are getting $1B / month in block reward and fees.\n\nWhat SHOULD the fees be for 400K txns a day to take over $1B / month?  Answer $80.\n\nSo if its \"basically free\" , is that a good thing or a bad thing?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ftok1",
                    "author": "doramas89",
                    "score": 3,
                    "created_utc": 1653132975.0,
                    "response": "You must be trolling because this level of no-knowledge of Bitcoin is hilarious. If the fees were low it means the 4tx/sec capacity limit was not demanded enough. People have stopped using BTC, they have learned it can't process enough transactions so the world has resorted to not transacting it. Buy & spectate. Go read the whitepaper before spewing more nonsense that takes other people's time.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9gfwsd",
                    "author": "Kazakkbdk",
                    "score": 3,
                    "created_utc": 1653145326.0,
                    "response": "Every time people get excited about BTC and try to use it, fees skyrocket to dozens of dollars per transaction, they give up, and either entirely give up on cryptocurrencies or search for better alternatives.\n\nThen the fees go down as nobody is using it, and sometimes the cycle repeats.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ftvgq",
                    "author": "chainxor",
                    "score": 7,
                    "created_utc": 1653133119.0,
                    "response": "YES! It was neccessary for number of reasons. BTC can't grow - and as you point out on-chain txs have flattened out (and actually fallen) since 2017., hence the lower fees. This is a serious security concern on the long run, since miners subsidies get cut in half every 4 years and if the prize stops doubling every 4 years BTC is in serious trouble. Problem is that BTC fundamentals won't be able to carry price appreciation, since on-chain transactions are not rising - propably because people know now that BTC cannot scale and has moved to other chains instead for usage. Also, Lighting Network (aside from not really working at scale) does not improve the onchain security in the long run either - quite the contrary actually.\n\nBCH might still have lower adoption than BTC (though I suspect it actually has higher adoption when it comes to payments and brick and mortar shops), but it can grow 1000x more today without having ANY problems with scaling. Planned development will up that number an order of magnitude at least in the near term.\n\nSo BCH actually has a viable path when block subsidy goes down. Sure BCH prize is still low, but if it continues to grow in usage, it is only a question of time before prize and fees from onchain transactions will outpace BTC and hence BCH end up as the chain with the most security.\n\nAlso, BCH already has better features, besides higher blockspace, such as better smart contract script features, scaling tech, faster and generally more efficient mempool code in all of the node implementations, ditto with validation and far better node implementation decentralization already today. In addition, it has a kickass EVM smartcontract sidechain called SmartBCH that nukes the competion in scalability, speed, ease of use and cheap fees compared to the competition.\n\nBCH certainly has the fundementals in place, make no mistake about that.\n\nWhat is missing is still major whale adoption and/or critical mass adoption and hence network effect. When/if that happens BCHs price will melt faces far beyond what was seen in 2017.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9gxv7h",
                    "author": "KallistiOW",
                    "score": 2,
                    "created_utc": 1653153558.0,
                    "response": "Key words \"right now\"",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9fp0oc",
                    "author": "Kay0r",
                    "score": 6,
                    "created_utc": 1653129219.0,
                    "response": "Low fees on artificially constrained database=little transaction count.  \nBlockstream: Mission accomplished.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9g38ih",
                    "author": "FieserKiller",
                    "score": 0,
                    "created_utc": 1653139046.0,
                    "response": "It was necessary and BCH fulfills 2 functions:\n\n1. A real life study case of what happens when you fork off without consensus\n2. The fork took many plain crazy people with it and bitcoin progresses with much less drama and controversy ever since",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9g7y0f",
                            "author": "Bagatell_",
                            "score": 3,
                            "created_utc": 1653141546.0,
                            "response": "> and bitcoin progresses\n\non the BCH chain certainly, BTC not so much.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9j9zh7",
                            "author": "EnterShikariZzz",
                            "score": 1,
                            "created_utc": 1653199467.0,
                            "response": "you are right. This is an underrated comment.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9jblch",
                            "author": "jessquit",
                            "score": 1,
                            "created_utc": 1653200790.0,
                            "response": "Hilarious levels of gaslighting.\n\n**Segwit** activated without consensus.\n\n**THAT'S WHY THERE WAS A SPLIT.**\n\nBig blockers weren't the ones who split Bitcoin. Big blockers rolled out *four different clients* to support big blocks prior to Segwit, but since **we** didn't activate without consensus none of them activated.\n\nIt was the small blockers who rammed Segwit through using attacks on the community that split the chain.\n\nSegwit was an **offensive** fork. BCH was a **defensive** fork.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9jc31d",
                                    "author": "FieserKiller",
                                    "score": 1,
                                    "created_utc": 1653201201.0,
                                    "response": "A defensive hard fork, that's a new one!",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9jcy8w",
                                            "author": "jessquit",
                                            "score": 1,
                                            "created_utc": 1653201936.0,
                                            "response": "No it's not a \"new one\" you troll. It is literally baked into the origin story of BCH. It's absolutely unquestionable that BCH originated as a defensive fork. Do I have to drag out proofs?\n\nFFS man, defensive forking is literally a critical part of Bitcoin's self defense mechanism. **Without the ability to defensively fork, Bitcoin could easily be hijacked simply by corrupting the reference client.**\n\nWhich is exactly what happened. Fortunately we *did* fork defensively and the original Bitcoin continues on now as Bitcoin Cash.\n\nEdit: this is the origin of BCH, a **defensive hard fork client**\n\nhttps://bitco.in/forum/threads/announcement-bitcoin-project-to-full-fork-to-flexible-blocksizes.933/",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9gd7vd",
                    "author": "Hefty-Scallion-8499",
                    "score": 1,
                    "created_utc": 1653144088.0,
                    "response": "Are you sure the transaction fee is $0.04 and not $1.90?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9fqt27",
                    "author": "CryptoAnarchyst",
                    "score": -3,
                    "created_utc": 1653130745.0,
                    "response": "Man, you really are stirring shit up.\n\nBTC fees have always been low relative to the security and ability to transfer large amounts of money without realized losses. Try transferring $100 million on BCH chain.\n\nYou have two fundamental issues here, one is network security and stability, second is ease of making small payments... And they always compete. Bch took the focus of making small payments but the network security is severely compromised, BTC is the opposite.\n\nAnd \"purists\" will tell you that L2, like lightning, are not what Bitcoin is about... But then fail to actually provide the security and safety brought by the size of btc network in bch format.\n\nSo no, the fork wasn't necessary...\n\n\nGood luck",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9fyju1",
                            "author": "The_Jibbity",
                            "score": 4,
                            "created_utc": 1653136290.0,
                            "response": "How is the security inherently compromised? I see people say this all the time but never put any numbers or technical details behind it. I’m fairly certain had the fork gone better for bch, and hash and price were similar for the two chains their would be nearly no difference in the security.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9gmgzu",
                                    "author": "CryptoAnarchyst",
                                    "score": 0,
                                    "created_utc": 1653148360.0,
                                    "response": "It takes about $500k in leased computing power to 51% attack the network for an hour and doublespend coins. No one has done it because, and this is the sad part, you wouldn't make money because the BCH coins you'd get would collapse the price of bch once being sold because the network activity and volume are absolute shit. A while ago I read a security analysis showing that nearly 90%of bch volume were micro transactions intended to keep the network alive.\n\nIn btc the 51% attack is impossible",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9ht4y1",
                                            "author": "jessquit",
                                            "score": 2,
                                            "created_utc": 1653168759.0,
                                            "response": ">It takes about $500k in leased computing power to 51% attack the network for an hour and doublespend coins. \n\nhttps://read.cash/@Jessquit/debunking-btc-is-more-secure-than-bch-e77527a9\n\n/u/The_Jibbity",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9i8vx2",
                                                    "author": "The_Jibbity",
                                                    "score": 2,
                                                    "created_utc": 1653177056.0,
                                                    "response": "I do recall reading this last year- thanks for putting out actual digestible technical information. Really I’m just conceding the point that BTC is “more secure” in that it is more secure for high value (million dollar) transactions. I probably shouldn’t engage with the obstinate BTC folk but I feel if people read reasonable back and forth in the comments here that BCH advantages will click- that’s how I ended up following BCH.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9gzea8",
                                            "author": "The_Jibbity",
                                            "score": 1,
                                            "created_utc": 1653154243.0,
                                            "response": "This doesn’t have anything to do with the inherent security model. This is only relevant to price and hash power, as I was alluding to above. Do you have anything to back up your first comment, and how the security model is different? Or are you just repeating points from others that sounded smart?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9gzk2e",
                                                    "author": "CryptoAnarchyst",
                                                    "score": 2,
                                                    "created_utc": 1653154318.0,
                                                    "response": "Excuse me? You can't be this sheltered bud, seriously... Go learn a bit more about the world you live in",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9h093t",
                                                            "author": "The_Jibbity",
                                                            "score": 2,
                                                            "created_utc": 1653154642.0,
                                                            "response": "There is no need to take offense. You could prove me wrong by giving any example of how BCH’s security model is is different than BTC’s (Besides current price and hashpower!). I am open ears, would love to be educated how the security model is different/compromised if you have an example.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9h2rrm",
                                                                    "author": "CryptoAnarchyst",
                                                                    "score": 1,
                                                                    "created_utc": 1653155794.0,
                                                                    "response": "First, you have to understand that Price, Hash Power, Node Count and Distribution, and Developer capability are ALL a security feature and/or risk.\n\nSaying that hash power doesn't matter as security is like saying that locks, cameras, and a fence don't matter for home security... they do, they make a big difference. Just because a house is not worth robbing, doesn't mean that it is secure (that's the price side of things).\n\nNode count and distribution is another important aspect and BCH (BitcoinABC) is highly centralized. One of the hackers a while back claimed that 98% of all nodes are located in one single rack... which might be a bit of an overstatement, but right before the China exodus 58% of all nodes were running on the Alibaba servers in China. That's a bunch... even today research shows that network centralization is a big issue for BCH. China exodus has been great for BTC decentralization, forcing the miners and node operators to move operations all over the world. \n\nDevelopers for BTC are significantly more responsive to issues and threats, and I believe they are significantly more competent than the BCH lot, but that can be argued. \n\nTransaction speed is actually about same between BTC and BCH networks... BCH can take minutes or hours, BTC can take seconds. What BTC has is the lightning network which provides true instant transactions, which BCH doesn't have. There is significant security in having the payment transactions on an L2 network, because you can screen and detect fraudulent transactions (and even prevent them) before they hit the L1 blockchain.\n\nThat's just a starter.\n\nGo read more about things... and don't be insulting and then tell people not to take offense. Being a prick and then saying \"Don't take it personally\" is a douche move, so stop being one.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9h6pgg",
                                                                            "author": "The_Jibbity",
                                                                            "score": 3,
                                                                            "created_utc": 1653157652.0,
                                                                            "response": "I think you are being overly sensitive. The point we were discussing was security and stability. I mentioned that, if price and hash power were the same there would be no difference in security. Your rebuttal was calculating cost of a 51% attack (basically, this is only  relevant to hash power and price)… so I surmised you are either not comprehending my point, or you are just using talking points from elsewhere that are thrown about ad-nauseam.\n\nI appreciate you latest comment, much better attempt at responding to point. \n\nNote* I did NOT say hash power isn’t important to security. My point was if BCH had the same price and hash power as BTC their would be no difference in the security. (Very nice, subtle use of strawman on your part)\n\nRegarding node count and distribution, and developer capability… sure ok, these could be reasonable points. But I must ask you again, how are are any of these part of the inherent security model? What is baked into the code/technology that produces an inferior outcome for bch?\n\nEven if I concede these points (which, come on, “98% of all nodes on a single rack” according to some hacker- you can do better than this) these would be great points if the argument was why BTC is currently a more secure network. But again none of has anything to with the underlying technology… You have only political or hypothetical answers for a technical question.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i9hlrh7",
                                                                                    "author": "CryptoAnarchyst",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653165042.0,
                                                                                    "response": "Yeah, overly sensitive, not sure I would agree with that assessment but I'll move on.\n\nWe were actually talking about the security differences between BCH and BTC, not just security in general. It is very noble of you to ignore the two largest aspects of the PoW security, I mean, talk about a strawman argument... WHOA... but at least you are admitting that BCH security regarding price and hash rate is crap... so that's progress. \n\nI also find it absolutely hilarious that nearly everyone on here spewed BTC centralization hatred and once the China ban went into effect all of the sudden BTC became the most decentralized digital currency. That's important. That is actually VERY important because China used to have political influence on BTC price... remember that BTC FUD in the past related to China. Today it doesn't matter. US has influence over all crypto because it is the largest economy in the world, not because it has the most hash power. If US banned PoW mining, it would be a tiny blip on the radar toward greater decentralization... but that's never going to happen. \n\nEveryone has this argument here that the larger block size makes payments faster on BCH, the thing is the 1MB block size of BTC forces decentralization and prevents humongous pools from forming. BCH has a miner pool problem, if you look it up you'll see that I am right. \n\nSo to ignore decentralization, or the lack thereof, when viewed from security aspect is just... well ignorant.\n\nAnyways, I have to go to a party. I think you can do plenty of research into BCH to understand the security flaws. Like I said, L2 benefit of Lightning is great because it allows you to detect and prevent fraudulent transactions before it hits your L1 blockchain... you quickly ignored that.\n\nNow let's keep focus... this is a discussion between BCH and BTC security... not just individual security of isolated components... k?\n\n&#x200B;\n\nGood",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i9hmkl3",
                                                                                            "author": "The_Jibbity",
                                                                                            "score": 2,
                                                                                            "created_utc": 1653165444.0,
                                                                                            "response": "Looks like just a misunderstanding. By security model, I mean how security works not just at the current moment but also how it should respond to variables such as price and hashpower so we can predict if it is sustainable and what it could look like under different future scenarios.\n\nIf all you were trying to say is that BTC has better security now, then you are correct, it has better security at the moment.\n\nHave a nice party 👍🏼",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9gq30k",
                            "author": "tl121",
                            "score": 0,
                            "created_utc": 1653150012.0,
                            "response": "No, you stupid fuck.  The one time I tried to use BTC and it failed was in December 2017.  My fee wasn’t enough and the market movement ended up costing me 100 times more.  \n\nWould you use a fly by night third world airline that only kills passengers every other year?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9gz0v7",
                                    "author": "jessquit",
                                    "score": 2,
                                    "created_utc": 1653154075.0,
                                    "response": "Please refrain from aggressive and abusive language. Thank you.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9gt5po",
                                    "author": "CryptoAnarchyst",
                                    "score": 1,
                                    "created_utc": 1653151418.0,
                                    "response": "OK... soo... you are blaming your own idiotic behavior for not being able to get your money out... yeah, makes sense that a dumbass would blame someone else for their fuckup.\n\nThanks for proving my point... good luck with staying poor.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9hue4y",
                                            "author": "jessquit",
                                            "score": 1,
                                            "created_utc": 1653169411.0,
                                            "response": "Please refrain from aggressive and abusive language. Thank you.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9hujbs",
                                                    "author": "CryptoAnarchyst",
                                                    "score": 1,
                                                    "created_utc": 1653169487.0,
                                                    "response": "Just tit for tat",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9hus1c",
                                                            "author": "jessquit",
                                                            "score": 2,
                                                            "created_utc": 1653169611.0,
                                                            "response": "If someone tits, please don't tat. Thank you.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i9hwish",
                                                    "author": "CryptoAnarchyst",
                                                    "score": 1,
                                                    "created_utc": 1653170509.0,
                                                    "response": "Just tit for tat",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9h6b0x",
                            "author": "jessquit",
                            "score": 1,
                            "created_utc": 1653157461.0,
                            "response": "> Try transferring $100 million on BCH chain.\n\nWorks great. Why wouldn't it? There are no liquidity constraints in a cash system.\n\nNow you do it with Lightning. Good luck!",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9i9bln",
                                    "author": "tl121",
                                    "score": 2,
                                    "created_utc": 1653177301.0,
                                    "response": "Assuming two $100M transactions, one on BTC and one on BCH, which were each accepted into their chain’s next block, the receiver’s BCH payment would be at greater immediate risk of loss due to a block reorg attempt.  The risk would be abated by awaiting for more confirmations.  It seems likely that waiting a day for 150 cofirmations would equalize the risk.\n\nAssuming that the BTC network were operating under overload as it was in December 2017,  it’s entirely possible that the delay between sending and receiver acceptance could be shorter with BCH.\n\nA well designed system should be immune to user error, so calling users stupid is misplaced.  If there is any stupidity it is more likely in the system designers,  specifically the architects and designers of the “fee market”.  But there is a better explanation, which is corruption, induced behind the scenes.  We know that there were evil DDoS attacks on large block nodes.  In August 2015 there were many DDoS attacks on large block bitcoin nodes.  My node was DDoS’d twice in one day.  These attacks took out the entire internet service for six rural communities along with their long distance and emergency 911 telephone service.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9h7ggn",
                                    "author": "CryptoAnarchyst",
                                    "score": 1,
                                    "created_utc": 1653158021.0,
                                    "response": "Actually, it doesn't work well k on bch at all. But you'd know that if you tried moving anything more than $10k on bch payment.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9hc54w",
                                            "author": "jessquit",
                                            "score": 1,
                                            "created_utc": 1653160288.0,
                                            "response": ">Actually, it doesn't work well k on bch at all. \n\n[Heh.](https://preview.redd.it/q32kuo0jbz731.png?auto=webp&s=ae0265f2f3bd752838597bc583bb950582dafeb8)\n\nkek 🤡",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9hf5xi",
                                                    "author": "CryptoAnarchyst",
                                                    "score": 1,
                                                    "created_utc": 1653161767.0,
                                                    "response": "Lmao, why don't you just link the actual transaction...\n\nAnd what was the slippage on both ends? Or do you just like bouncing money between two parties?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9hfxgx",
                                                            "author": "jessquit",
                                                            "score": 1,
                                                            "created_utc": 1653162141.0,
                                                            "response": "Show me a $1.2B LN tx\n\nI'll wait",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9hghis",
                                                                    "author": "CryptoAnarchyst",
                                                                    "score": 1,
                                                                    "created_utc": 1653162419.0,
                                                                    "response": "Lol it's just an exchange move... That is not a payment my friend, and you know it.\n\nSo stop being a contentious prick.\n\nMaking large PAYMENTS on bch is not good... Anything more than $100k moves the market too much up or down that the slippage is atrocious. It literally costs more than the bank would",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9hj2j5",
                                                                            "author": "jessquit",
                                                                            "score": 1,
                                                                            "created_utc": 1653163697.0,
                                                                            "response": ">Lol it's just an exchange move... That is not a payment \n\nNobody makes $1.2B or $100M \"payments,\" but if they did, it would look and work *exactly* like this, **and you know it.**\n\nI'm still waiting to see a $1.2B LN tx. I'm not really interested in pursuing this further until you show me one.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i9hkzfc",
                                                                                    "author": "CryptoAnarchyst",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653164647.0,
                                                                                    "response": "[https://cointelegraph.com/news/bitcoin-worth-2-billion-moves-for-just-78-cents](https://cointelegraph.com/news/bitcoin-worth-2-billion-moves-for-just-78-cents)\n\n&#x200B;\n\nlook at that, BTC has done it a few times",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i9hsk0x",
                                                                                            "author": "jessquit",
                                                                                            "score": 1,
                                                                                            "created_utc": 1653168456.0,
                                                                                            "response": "[your comment was removed by Reddit]\n\n> I'm still waiting to see a $1.2B **LN** tx. I'm not really interested in pursuing this further until you show me one. \n\nSorry, you lose this round.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9h3kq2",
                    "author": "btcxio",
                    "score": 1,
                    "created_utc": 1653156164.0,
                    "response": "[BTC fees have consistently been in the $1.00 per transaction range](https://bitcoinfees.cash/) for quite a while now. I wouldn’t call that good.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9fqjj4",
                    "author": "swgo1",
                    "score": -6,
                    "created_utc": 1653130522.0,
                    "response": "Heresy!!!!!",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}