{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uypw9t",
            "title": "Why Bitcoin Cash Will Fail In Spite Of Being Superior To Bitcoin",
            "url": "https://www.reddit.com/r/btc/comments/uypw9t/why_bitcoin_cash_will_fail_in_spite_of_being/",
            "author": "JoyradProcyfer",
            "created_utc": 1653625165.0,
            "score": 0,
            "num_comments": 33,
            "subreddit": "btc",
            "selftext": "# IPv4 aka The Internet As We Know It\n\nWe use IPv4. It is the basis of the Internet as we know it, for now (yes, IPv6 is being used by some and is expected to replace it).\n\n# IPv5 -What Could Have Been\n\nIPv5 is an objectively superior technology to IPv4. IPv5 would have made certain things such as streaming faster.\n\nIPv5 died because nobody used it. Its lack of popularity killed it. A superior technology, ignored because no one else was using it, and therefore because no one was using it, no one else used it since it lacked enough people to be worthwhile.\n\n# Bitcoin Cash -What Could Have Been\n\nIPv5 reminds me of Bitcoin Cash.\n\nBitcoin Cash is a superior technology to Bitcoin. It makes transfers cheaper. It is a slightly sleeker code, but otherwise very simple.\n\nBitcoin Cash has been down tremendously from its ATH. While it has not completely died and is superior to most coins out there, it has ultimately died compared to its previous trajectory and the reality it has no realistic chance of regaining its former potential to overtake Bitcoin.\n\nBitcoin Cash in other words, is superior, but its lack of popularity has created a cycle of it not being adopted, just like what happened to IPv5.\n\n# IPv6 -What Is Inevitable\n\nIPv6 on the other hand is gaining steam and is 100% expected to replace IPv4 -but why? IPv6 essentially does tons of things, far more than IPv5 did, that elevate IPv4. It improves Internet speeds, Internet security, and increases the number of IPs one can add to IPv6 drastically compared to IPv4 and IPv5.\n\nIn other words, IPv6 will achieve what IPv5 did not, simply because it is a little more. It does a little more.\n\nIn fairness, a new IP version was not as pressing a few years ago, given that we had more IP addresses left to allocate to computers a few years ago, and thus were not as in-need of a new protocol, so all of this logic COULD be a moot point in this regard.\n\nHowever, I believe IPv6 was going to be shifted to even if we were not running out of space. Simply put, it offers so much more than IPv5, that it is not merely superior, but IMMENSELY superior.\n\n# Why Bitcoin Cash Will Likely Fail\n\nBitcoin Cash is superior to Bitcoin because it does exactly what Bitcoin does but with a lower cost.\n\nThis is completely, 100%, true.\n\nBut I need you all to understand a simple truth, too.\n\nSuperior, is not good enough for a social shift in power -MASSIVELY superior, will only move the needle just barely enough, for a social shift in power.\n\nThere are systems superior to present politics in varied Western countries, that do not gain traction because they lack enough popularity for people to bother switching to them. Liberalism, in its traditional context of overthrowing monarchism, did not happen for a very long time; not just because of militant oppression, but also because most did not think this or similar alternative systems to monarchy would actually prove effective, even if the idea was out there. Only when it proved abundantly necessary did people jump ship from monarchism to liberalism -they did not do so merely because it looked fun.\n\nBitcoin Cash is not going to become popular enough to surpass Bitcoin, because it just does not do enough to justify an entire social movement from one major currency to another, even if Bitcoin Cash is otherwise better. It is in other words, while superior, not superior enough to justify a massive socio-crypto-market shift. \n\nYou have to be multiple leagues better, for people to trust that everyone else, will eventually shift to you -it is otherwise socially just not worth the likely doomed-to-fail inorganic campaigning and social influence required to convince people to perform that shift.\n\nEven Ethereum at least tries to be a leap forward by doing something original that could prove to have some immensely useful benefits to programmers, even if it is a mountain of spaghetti code.\n\nBitcoin is a leap forward compared to its predecessor -banks.\n\nBitcoin Cash is a step forward compared to its predecessor -Bitcoin.\n\n**Bitcoin Cash is not a leap forward from Bitcoin, though.**\n\nThat is why Bitcoin Cash will fail.",
            "stickied": false,
            "comments": [
                {
                    "id": "ia5r1vl",
                    "author": "chainxor",
                    "score": 13,
                    "created_utc": 1653628403.0,
                    "response": "BCH _is_ MASSIVELY superior. It does everything all the new VC funded centralized shitcoins does, which also means better than ETH - ie. fast, cheap, decentralized EVM smart contracts. \n\nAt the SAME time BCH does everything BTC does, just vastly better, the Bitcoin way. It also has the best Bitcoin variant of smart contract features and improvements for scaling.\n\nThis was the technical argument. But BCH also has the best UX overall. One of the reasons is of course the tech, but also because businesses in the BCH ecosystem care about UX.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia5qggj",
                    "author": "Remora_101",
                    "score": 11,
                    "created_utc": 1653627996.0,
                    "response": "Just FYI it has been crossposted https://www.reddit.com/r/CryptoCurrency/comments/uyqd23/why_bitcoin_cash_will_fail_in_spite_of_being/",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia62m6m",
                            "author": "LovelyDayHere",
                            "score": 11,
                            "created_utc": 1653637335.0,
                            "response": "LOL, turned out people in rCC were too supportive of BCH, so the moderators had to remove even the post that attempted to shit on it.\n\nLOCK THE THREAD!\n\nREMOVE THE POST!\n\nDON'T LET PEOPLE HEAR POSITIVE OPINIONS OF BITCOIN CASH!",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia66vlo",
                                    "author": "BewareOfShills",
                                    "score": 3,
                                    "created_utc": 1653641147.0,
                                    "response": "Not sure if this is the reason. For example I cannot crosspost anything to r/cc so   I don't know how wwmore11 circumvented that. Maybe that is the reason it got moderated. \n\nIt is also not removed but locked. Something I have never seen before.\n\nAnyway a little Streisand effect would have been nice, I agree.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia67lcz",
                                            "author": "LovelyDayHere",
                                            "score": 2,
                                            "created_utc": 1653641795.0,
                                            "response": "I think when I first looked at it, it showed up as removed, then I looked later and it showed up locked.\n\nMaybe they changed their mind and unremoved it but locked it.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia5oelv",
                    "author": "knowbodynows",
                    "score": 8,
                    "created_utc": 1653626666.0,
                    "response": "When the iphone came out it didn't have cut & paste. Then the iOS was upgraded.\n\nIt's easy to find an analogy that makes you comfortable if you don't like mine.\n\nI'm glad you have a rationale at least. But your confidence level wrt knowing what the future holds will disserve you.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia5tahp",
                    "author": "darkbluebrilliance",
                    "score": 6,
                    "created_utc": 1653629960.0,
                    "response": "With all the upgrades done since 2017 BCH is vastly superior to BTC. BCH with smartBCH is also vastly superior to ETH.\n\nWhat we lack is a 100 mio marketing budget to fight the propaganda of BCHs mighty adversaries, the old financial world, those benefiting massively from free money printing.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia62hvi",
                    "author": "LovelyDayHere",
                    "score": 7,
                    "created_utc": 1653637230.0,
                    "response": "What this post ignores:\n\n- BTC took  a MASSIVE step BACKWARDS. It's like it went from IPv4 to ... tin can radio ham network.\n\n- BCH not only didn't take that step back, it took big steps forward which result in a huge technical superiority over BTC, not a small one as OP wants to paint it as.\n\n  - BCH fees have traditionally been sub-cent and often a factor of THOUSANDS less than on BTC. This will be even greater if / when BTC suffers its next congestion event, which might happen any time that the market slightly panics.\n\n  - BCH has shown that capacity of THOUSANDS of times that of BTC is possible on chain. In that it is sticking with Bitcoin's original premise which has been discarded on BTC\n\n  -  BCH has demonstrated the real resilience against centralization.\n\n__BCH is not a leap forward from Bitcoin - BCH _is_ Bitcoin (peer to peer electronic cash)__",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia86t7w",
                            "author": "hans7070",
                            "score": 1,
                            "created_utc": 1653678124.0,
                            "response": "Just curious, what's that \"massive step backwards\" BTC took? I mean it hasn't changed a lot, so what could that be?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia8745u",
                                    "author": "LovelyDayHere",
                                    "score": 1,
                                    "created_utc": 1653678261.0,
                                    "response": "Clearly you haven't been a Bitcoin user for long.\n\nhttps://www.youtube.com/watch?v=eafzIW52Rgc\n\nBTC doesn't work the way Bitcoin used to anymore.\n\nWait until the chain gets congested and you'll understand. Or inform yourself on the changes made by Blockstream/Core, before the shit hits the fan.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia5p7u1",
                    "author": "HyunJinX",
                    "score": 6,
                    "created_utc": 1653627181.0,
                    "response": "Ye of little faith",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia5s2lo",
                    "author": "mrtest001",
                    "score": 5,
                    "created_utc": 1653629105.0,
                    "response": "> Bitcoin Cash is not a leap forward from Bitcoin, though.\n\nThis is the error in your logic.\n\nBTC is a *high-fee* version of Bitcoin.\n\nBCH is a *low-fee* version of Bitcoin.\n\nI call that a giant leap.\n\nA car that can travel a 100 miles per gallon is a leap over the exact car that can only travel 3 miles per gallon.\n\nYour definition of \"leap\" might be that the cars look and act the same - therefore there is no \"leap\".  But when the world needs a car, the 100MPG wins.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia5prjl",
                    "author": "MobTwo",
                    "score": 12,
                    "created_utc": 1653627543.0,
                    "response": "> Why Bitcoin Cash Will Fail In Spite Of Being Superior To Bitcoin\n\n> Bitcoin Cash is a superior technology to Bitcoin.\n\n> That is why Bitcoin Cash will fail.\n\nWhy Facebook will fail in spite of being superior to MySpace/Friendster? Even though Facebook is an objectively superior technology to MySpace/Friendster... bla bla bla, that is why Facebook will fail and lose to MySpace/Friendster.\n\nWhy digital cameras will fail in spite of being superior to Kodak film cameras? Even though digital cameras is an objectively superior technology to Kodak film cameras... bla bla bla, that is why digital cameras will fail and lose to old style film cameras.\n\nWhy the Internet and YouTube will fail in spite of being superior to Blockbuster tape rentals? Even though Internet and YouTube is an objectively superior technology to Blockbuster tape rentals... bla bla bla, that is why Internet and YouTube will fail and lose to Blockbuster tape rentals.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia5ogzb",
                    "author": "Remora_101",
                    "score": 11,
                    "created_utc": 1653626708.0,
                    "response": "Welp I disagree. And I don't find the comparison to IPvX a good one.\n\nBTC is a supposedly SoV, we already have hundreds of them, BTC is the only one without an underlying use case. Looks like a house of cards.\n\nBCH on the other hand is the first ever sound p2p cash and has a use case as MoE.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia5vvvi",
                            "author": "Ok_Aerie3546",
                            "score": 0,
                            "created_utc": 1653631836.0,
                            "response": "What are the \"hundreds of them\" that you talk about?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia5rjif",
                    "author": "mk112ning",
                    "score": 2,
                    "created_utc": 1653628744.0,
                    "response": "Exactly! except Bitcoin Cash IS a leap forward to Bitcoin, it is driven by a sound community toward its principle to become global P2P electronic cash system, not a overpriced bond with misleading name.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia5wbtw",
                    "author": "Choice-Business44",
                    "score": 2,
                    "created_utc": 1653632172.0,
                    "response": "What can we use then as p2p cash with all transactions on chain? What is the alternative?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia6fdj7",
                    "author": "eth-slum-lord",
                    "score": 1,
                    "created_utc": 1653648468.0,
                    "response": "Can we just have both in the future? Btc as gold and btcash as cash",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia7qsaw",
                    "author": "Bagmasterflash",
                    "score": 1,
                    "created_utc": 1653671238.0,
                    "response": "So BCH isn’t a big enough improvement over BTC to justify it eclipsing BTC because, in your analogy, IPv5 was the same as to Ipv4. (We will ignore the fact that BCH is a living protocol at this point.)\n\nThere is no reference to any IPv6 equivalent (Let’s ignore that too). \n\nBCH also eclipses ETH with its elegant sBCH code (Nothing to see here). \n\nRight. Moving on. Good Luck to you.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaa5z48",
                    "author": "Big_Bubbler",
                    "score": 1,
                    "created_utc": 1653715100.0,
                    "response": "The dream of Bitcoin was a kind of unstoppable electronic cash for the people of the world. BTC development was captured by a team that abandoned that goal even though they pretend they still seek it. BCH's fork was created to save the potential to achieve the Bitcoin dream. Until BCH can scale for massive worldwide adoption, your analysis may hold.\n\nBTC believers still have time to think they are the future. They do this by assuming no BCH fork will scale and have it's adoption go viral. The ability to serve the entire world is the leap forward needed to unseat BTC. Other bells and whistles may make it more popular than BTC someday, but scaling and viral growth are what's needed to make BTC seem less secure, tiny and unimportant in comparison. If a BCH scales and goes viral, BTC will remain a valuable antique with collector value.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia5tjmw",
                    "author": "Vedaykin",
                    "score": -2,
                    "created_utc": 1653630137.0,
                    "response": "Copy FB make it more efficient and still it will fail. It’s the network that is missing, functionalities are not the focus never has been. It’s about trust, and trust cannot be copied. BTC has a lot of trust, all forks don’t.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia5u35s",
                            "author": "Remora_101",
                            "score": 9,
                            "created_utc": 1653630524.0,
                            "response": "I think you confuse \"trust\" with \"media attention\" and \"network effect\" with \"hopium\".\n\nBTC has a lot of media attention which constantly gets new people in. This currently supports the SoV narrative. But we already see this flow of new people dry up.\n\nThis is the longest red phase BTC has been in, ever!\n\nI don't think people \"trust\" BTC. They gamble that they make a fortune, like many others did before them. The last ones will be fucked. That is why the BTC community change to an almost cult like following around \"hodl\" \"diamond hands\" \" buy the dip\" All religiously enforcing the \"number go up\" believe.\n\nThere is no network effect in BTC. You just hold and you can sell at any point without repercussion. Compare that to a working and adopted p2p coin. If you sell you suddenly won't be able to send money to friends buy from your favorite merchant etc. Leaving a payment network has repercussions.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia5v1g1",
                                    "author": "Vedaykin",
                                    "score": -3,
                                    "created_utc": 1653631221.0,
                                    "response": "Hash rate goes up and hash rate is related to network security. Hash rate goes up, I trust the network more. My trust is somehow proportional to the hash rate of the network. And yes I think I can see network effects on there eg. Lightning update etc.\n\nAnd yes you are right, I got the info of the China ban of btc mining through the media. BTC performed much better than expected. So media helped increasing my hopium that my money will be stored good over time within the btc network. The network might fail at some point in the future, actually nothing lasts forever, so I rephrase that opinion and I think the networks chance of failing at some point in the future is 100%.\n\nIt is impossible to not get the most attention from the media when you are the biggest player in the field. Do you think my favorite shitcoin is more entitled to that ;)?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia8gnwh",
                                            "author": "Remora_101",
                                            "score": 1,
                                            "created_utc": 1653682557.0,
                                            "response": ">Hash rate goes up and hash rate is related to network security. Hash rate goes up, I trust the network more. My trust is somehow proportional to the hash rate of the network. \n\nThen you haven't yet understood how Bitcoin functions. Currently almost all the blockreward that pays for hashrate comes from the coinbase. It is fixed and only goes up and down with price. Therefore hashrate is directly relate to price. And while all ways lead to rome it looks like all BTC features are derived from price, which is directly corespondent to media hype. But price is a finicky thing and if BTC isn't the darling of the masses anymore price might crumble, and with it hashrate and security.  \n\n\n> And yes I think I can see network effects on there eg. Lightning update etc.\n\nLightning is a mess, but yes in theory it could create a network effect, like any payment method. \n\n>So media helped increasing my hopium that my money will be stored good over time\n\nLet me rephrase that. My only hope and use case of this thing I hold is to sell it later for a higher price for the next one to hold it and hope it goes up in price. Sound awfully familiar to some scam. \n\nNo compare that to a crypto with a use case. There is lots I can do besides hodling and praying and selling. There is value in the coin by itself not just by mass delusion.   \n\n>Do you think my favorite shitcoin is more entitled to that ;)?\n\nYour favorite shitcoin with a use case other than SoV alone will beat BTC as soon as the the speculative hype bubble bursts.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia8la9j",
                                                    "author": "tl121",
                                                    "score": 2,
                                                    "created_utc": 1653684682.0,
                                                    "response": "LN is unlikely to create a positive network effect because it barely works, has a poor user experience and doesn’t scale.\n\nI could be wrong, it all might turn around in 18 months.   /s",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "ia8j1th",
                                                    "author": "Vedaykin",
                                                    "score": 1,
                                                    "created_utc": 1653683646.0,
                                                    "response": "RemindMe! 800 days \"Let future me check the state of btc.\"",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "ia8j51y",
                                                            "author": "RemindMeBot",
                                                            "score": 1,
                                                            "created_utc": 1653683687.0,
                                                            "response": "I will be messaging you in 2 years on [**2024-08-04 20:34:06 UTC**](http://www.wolframalpha.com/input/?i=2024-08-04%2020:34:06%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/btc/comments/uypw9t/why_bitcoin_cash_will_fail_in_spite_of_being/ia8j1th/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fbtc%2Fcomments%2Fuypw9t%2Fwhy_bitcoin_cash_will_fail_in_spite_of_being%2Fia8j1th%2F%5D%0A%0ARemindMe%21%202024-08-04%2020%3A34%3A06%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20uypw9t)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "ia8jcbv",
                                                            "author": "Remora_101",
                                                            "score": 1,
                                                            "created_utc": 1653683778.0,
                                                            "response": "👍",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "ia615q4",
                            "author": "ApplicationAny1434",
                            "score": 4,
                            "created_utc": 1653636042.0,
                            "response": "I dont trust BTC. I know if fee to low transaction will fail. \n\n2017 one transaction stuck for a week and failed. Other I had to pay $30 fee ($50 high fee) and after 3 days I got through.\n\nIf Im store owner I would never acsept  Bitcoin. I would say to customer \"you stay here sir until 1 block confirmed even if it takes 10h\"",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia6mde9",
                    "author": "TinosNitso",
                    "score": 0,
                    "created_utc": 1653653141.0,
                    "response": "I think [CashGold](https://ebay.com/itm/164961330561) is a leap forward from gold bullion. Like being able to cut a bull into steaks, dividing ounce coins into 10mg & 100mg bar-polymer is a leap forward. With Bitcoin, only big blocks allow this! The block-size limit makes it the equivalent of bullion which can never be reasonably divided (decentralized). Even if BTC's txns were spam, not actual cash txns, the limit still had to be increased (however both versions can co-exist).",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}