{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uq68qf",
            "title": "Bitcoin vs Bitcoin Cash",
            "url": "https://www.reddit.com/r/btc/comments/uq68qf/bitcoin_vs_bitcoin_cash/",
            "author": "ClimbingTheCurve",
            "created_utc": 1652621647.0,
            "score": 3,
            "num_comments": 3,
            "subreddit": "btc",
            "selftext": "I recently listened to a pair of BTC maximalists talking about how Bitcoin is the greatest thing ever, all other coins are shitcoins and fiat is the root of all evil. I could believe it. The thing is, I can't for the life of me understand why BTC is fundamentally special.  If I spin up my own truly decentralized proof-of-work chain that I truly don't control why is that \"fundamentally\" worthless while BTC remains the greatest thig ever? Asked another way, why is BTC the greatest thing ever but BCH is a shit coin.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8ozyf6",
                    "author": "MobTwo",
                    "score": 5,
                    "created_utc": 1652621715.0,
                    "response": "It's more likely that BTC is the real shitcoin here. Bitcoin Cash is the highly improved version of BTC. Anyone can verify for themselves. Just send $10 worth of BTC and $10 worth of Bitcoin Cash from your own wallet A (not an exchange) to your own wallet B (not an exchange) and see for yourself the difference. But Bitcoin Cash is more than just fast cheap and reliable, it has many unique advantages over the old tech BTC (forever stuck on 1mb). Here are the improvements from Bitcoin Cash.\n\n&nbsp;\n\n**Better Security** – BTC has a vulnerability called RBF which increases the risk of double spending. Bitcoin Cash developers aim to make 0-confirmation transactions safe again so that anyone accepting Bitcoin Cash is much safer accepting payments without having to wait for multiple confirmations. This RBF security vulnerability exists only in BTC and not Bitcoin Cash. That's why Bitcoin Cash is more secure as a payment method.\n\nHere is an example of hackers stolen $150000 worth of BTC using the RBF security vulnerability. https://thenextweb.com/hardfork/2019/03/14/double-spenders-scam-150000-bitcoin/\n\nIt is super easy to double spend on Bitcoin using the RBF vulnerability. Source: https://news.bitcoin.com/video-shows-how-easy-it-is-to-double-spend-btc-using-rbf/\n\n&nbsp;\n\n**Rapidly Growing Transactions Volume** - Bitcoin Cash has more transactions than BTC+Lightning Network combined recently. On some days, Bitcoin Cash has more than double the transactions volume of BTC. Bitcoin Cash is growing rapidly while BTC is on the decline.\n\n&nbsp;\n\n**Defi Smart Contracts** - Bitcoin Cash has defi smart contracts functionalities (eg. AnyHedge, Detoken, SmartBCH). SmartBCH allows Ethereum smart contracts to be deployed as a sidechain to the Bitcoin Cash network. This means as an Ethereum developer, you no longer has any friction jumping over to join the Bitcoin Cash ecosystem. All of them can come over to the Bitcoin Cash ecosystem to enjoy the low transaction fees of Bitcoin Cash.\n\n&nbsp;\n\n**Low Fees** – One of the advantages of using cryptocurrencies over traditional payment methods is the low fees. Due to the limited block size of BTC, fees have exceeded over $70/transaction during peak period. On the other hand, I have never paid more than 1 penny/transaction during my entire time in using Bitcoin Cash. This makes using Bitcoin Cash ideal for merchants, businesses, companies and everyday usage. The industries that may be disrupted such as Remittances, Derivatives, Payment Gateways, etc are worth trillions of dollars and Bitcoin Cash is well positioned for use cases in these industries.\n\n&nbsp;\n\n**Improved Scalability** – BTC is limited to 1MB blocksize and even with Segwit activated, the capacity increase is only around 1.7x whereas the upgraded Bitcoin Cash blocks capacity is currently at 32x with no limitations. This means Bitcoin Cash can handle PayPal transactions volume today and be global money after a few more upgrades.\n\n&nbsp;\n\n**Supply Scarcity** – During the fork from Bitcoin, some Bitcoin Cash supply were removed from active circulation due to users unable to claim their Bitcoin Cash from unsupported exchanges and wallets among other reasons. This means each Bitcoin Cash is actually more scarce than BTC.\n\n&nbsp;\n\n**Improved Confirmation Times** – Due to the limited block size of BTC, some users were made to wait days for their transactions to be confirmed. Contrast this to Bitcoin Cash where transactions may be accepted immediately with less risk and you can see why it makes sense to use Bitcoin Cash. In other words, if you are a shop owner and you just sold a cup of coffee and some sandwiches, and you accept the old BTC, you may have to wait hours for the transaction to be confirmed because the customer may use RBF to void the original payment. With Bitcoin Cash, your risk is minimized.\n\n&nbsp;\n\n**Higher Merchants Adoption** - Bitcoin Cash is global money with more than 2,651,820 merchants accepting it. You can pay for your hotels, air tickets, food/drinks, groceries, nightlife, and more with Bitcoin Cash today. Source: https://slp.1bch.com/?action=showBitcoinCashBenefitsFrame\n\nWhile Bitcoin Cash adoption is growing very quickly every single day, Bitcoin is having declining adoption and if this trend continues then Bitcoin is on a dead end. Source: https://np.reddit.com/r/NotAcceptingBitcoin/top/?sort=top&t=all\n\n&nbsp;\n\n**Lightning Network Problems And Vulnerabilities And Loss Funds** - Some people may claim Lightning Network will solve Bitcoin problems but it has failed to gain traction due to many problems and vulnerabilities, such as loss of funds, unreliable transactions (constantly failing), and many other vulnerabilities.\n\nSource: https://www.crypto-news-flash.com/why-does-the-bitcoin-lightning-network-fail-new-study-proves-inefficiency/\n\nSource: https://news.bitcoin.com/researchers-scathing-lightning-network-analysis-finds-flaws/\n\n&nbsp;\n\n**Barriers To Success** - Unfortunately, for the past 5 years, Bitcoin Cash has been constantly undermined by lies, propaganda, censorships and other malicious activities...\n\n**1a) censorships** - https://medium.com/@johnblocke/a-brief-and-incomplete-history-of-censorship-in-r-bitcoin-c85a290fe43\n\n**1b) propaganda** - https://steemit.com/bitcoin/@adambalm/in-2013-peter-todd-was-paid-off-by-a-government-intelligence-agent-to-create-rbf-create-a-propaganda-video-and-cripple-the-btc and  https://np.reddit.com/r/btc/comments/8dd5ij/why_bitcoin_cash_users_reject_the_name_bcash_so/\n\n**1c) threats and harassments** - https://np.reddit.com/r/btc/comments/is1130/it_seems_tim_draper_is_being_misled_about_bch_and/g54x63q/\n\n**1d) DDOS attacks** - https://wakgill.github.io/deryk/bitcoin-cyber-attacks\n\n**1e) Plus a bunch of other unethical stuff** if you care to read more at https://np.reddit.com/r/btc/comments/hgpjph/the_pitiful_state_of_bitcoin_cash_transactions/fw5qczk/\n\nAnyone who dares to promote increasing the blocksize or favorably on Bitcoin Cash, they got banned and their voices silenced in the Bitcoin or Cryptocurrency subreddit. They also get harassed and attacked by online paid trolls. All these started back in 2015 even before Bitcoin Cash existed.\n\n&nbsp;\n\n**\"Digital Gold\" Or \"Store Of Value\" Propaganda** - BTC is good with propaganda but this is simple economics. Something cannot be a store of value without it first be a means of exchange. Bitcoin Cash is both a store of value AND means of exchange thanks to its low fees. Bitcoin is not feasible as a means of exchange due to its high fees of around $10 (or more) per transaction.\n\n> Store of Value: To act as a store of value, money must be reliably saved, stored, and retrieved. It must be predictably usable as a medium of exchange when it is retrieved. Additionally, the value of money must remain stable over time.\n\n> Source: https://courses.lumenlearning.com/boundless-economics/chapter/introducing-money/\n\n&nbsp;\n\n**Tokens** - Today, anyone can issue their own loyalty tokens or digital money on Bitcoin Cash from as low as 1 cent. It's incredibly easy and anyone can do it at https://mint.bitcoin.com/. And anyone can then buy/sell/trade their newly created tokens on https://1BCH.com/ exchange which is fully focused on Bitcoin Cash and BCH tokens.\n\n&nbsp;\n\n**Increased Privacy** - Bitcoin Cash has better privacy than BTC thanks to CashShuffle/CashFusion. You can enable it through the setting in the Electron Cash wallet and it's completely optional. If you don't want others to know how you spent your money, it is better to use Bitcoin Cash over BTC.\n\n&nbsp;\n\n**Continuous Innovations** - For example, Cash Accounts allow people to send BCH to an easy to remember non-custodial alias such as MobTwo#12345. You may register your Cash Account at https://www.cashaccount.info/\n\nTogether with Reusable Payment Addresses (RPA), Cash Accounts will allow people to send BCH to your easy to remember alias with increased privacy. You can read more about RPA at https://np.reddit.com/r/btc/comments/o1z8a1/help_me_test_the_prototype_of_electron_cash_rpa/\n\nMany more innovations on BCH not covered in this comment to avoid turning this into an encyclopedia.\n\n&nbsp;\n\n**Better Risk/Reward** - If BTC gains another 1 trillion marketcap, it only 2x in price. But that same 1 trillion will give you around 168x your Bitcoin Cash investments. It is such a smarter option given the risk/rewards probabilities. As an investor, it make sense to know the difference between price and value. Bitcoin Cash has a high value low price while BTC has low value high price.\n\n&nbsp;\n\nAt the moment, the old BTC has first mover advantage (eg. Friendster or MySpace or Kodak or Nokia) but that can only last them to a point. Eventually, I believe that Bitcoin Cash will overtake BTC's marketcap. Bitcoin Cash is the second opportunity to buy Bitcoin at a low price if you missed that opportunity back in 2013.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uq5c9b",
            "title": "Bitcoin's Unfinished Business: Why Micropayments Still Matter",
            "url": "https://www.coindesk.com/layer2/paymentsweek/2022/04/28/bitcoins-unfinished-business-why-micropayments-still-matter/",
            "author": "megankerr7",
            "created_utc": 1652618673.0,
            "score": 3,
            "num_comments": 1,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8oz02a",
                    "author": "LovelyDayHere",
                    "score": 5,
                    "created_utc": 1652621208.0,
                    "response": "> Tiny, cheap-to-deliver payments can open new markets for small digital goods.\n\nTrue\n\n> “A third fascinating use case for Bitcoin is micropayments, or ultrasmall payments,” Andreessen wrote. “… It is not cost-effective to run small payments (think $1 and below, down to pennies or fractions of a penny) through the existing credit/debit and banking systems. The fee structure of those systems makes that nonviable. [But] all of a sudden, with Bitcoin, that’s trivially easy.”\n\nThat's why it still works on Bitcoin Cash.\n\n>The fee for a single transaction on ~~Bitcoin~~ BTC in the Year of our Lord Two Thousand and Twenty-Two is nearly $2, according to BitInfo, making it not just extremely nonviable for sub-$1 payments, but also more expensive than a credit card even for many larger payments.\n\nFunny how such sub-$1 payments are completely viable on Bitcoin Cash ;-)\n\n> Fees have risen so dramatically because Bitcoin has a competitive market for transaction fees, which fund network security, and rising demand has made transactions more pricey.\n\nThe other half of an honest answer would be:\n\nIt's because the blocksize on BTC has been constrained by design (due to Blockstream / Core and their investors).\nWith the intent of driving BTC traffic to 2nd layers like LN, and sidechains like Liquid.\n\nIt's not because Bitcoin was initially designed to be like that. These decisions were made contrary to the stated design espoused by Satoshi Nakamoto and many early Bitcoin developers and adopters.\n\n> The last time Bitcoin fees were low enough for anything close to micropayments was June of 2015\n\nYeah, sad\n\nBut fortunately the working Bitcoin survived under another name.\n\nhttps://whybitcoincash.com",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}