{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uuv9td",
            "title": "Looking for feedback on an experiment. I think a debate platform might help with rigorous discussions between BCH and BTC so that claims can be shared as links without being reiterated over and over. Good idea or not?",
            "url": "https://www.reddit.com/r/btc/comments/uuv9td/looking_for_feedback_on_an_experiment_i_think_a/",
            "author": "post_mortar",
            "created_utc": 1653164812.0,
            "score": 6,
            "num_comments": 9,
            "subreddit": "btc",
            "selftext": "Hi. I took some time this week playing around with a new debate platform called Kialo which might be a nice pattern for structuring and adding rigor to arguments which happen so often between BTC and BCH.\n\nThis is just a proof of concept at this point. As a starting point, last weekend I asked for some of your arguments [in favor of Bitcoin Cash's scaling approach](https://www.reddit.com/r/btc/comments/upbpzn/for_or_against_bitcoin_cash_has_a_better_scaling/). (Yes, this is just one side, but it's primarily for testing at this point.)\n\nI tried to build out some of the claims which lead up to the above argument, while also adding some support for/against underneath. Hopefully, this illustrates the platform's capability.\n\nI've included a link which anyone can use to make comments and suggestions to the discussion. If this experiment goes well, I will continue to add to it as well as open it up to the public for further contributions/discourse.\n\nPlease share feedback on all aspects of this. Any feedback about the arguments themselves should be added to Kialo. Any meta feedback should go in this thread. Eager to hear your thoughts, r/btc. 🍻\n\nhttps://www.kialo.com/p/4625da49-6139-48d4-9935-33402490e0ea/58272",
            "stickied": false,
            "comments": [
                {
                    "id": "i9ibdnw",
                    "author": "aphelio",
                    "score": 5,
                    "created_utc": 1653178429.0,
                    "response": "Thanks for linking the debate platform, looks pretty cool. I suggest a slightly less subjective debate. For example, \"Which is more likely to achieve global reserve currency status?\"",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9imbbi",
                            "author": "post_mortar",
                            "score": 2,
                            "created_utc": 1653184349.0,
                            "response": "While some of the points are subjective, I believe questions like that could be phrased in support or against one the positions. My goal was to capture the whole landscape of claims between BCH and BTC. And while some subjectivity may leak in, they can be disputed publicly. Which is still a win.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9huem7",
                    "author": "CurvyGorilla202",
                    "score": 3,
                    "created_utc": 1653169418.0,
                    "response": "Great idea",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9kjvln",
                    "author": "knowbodynows",
                    "score": 1,
                    "created_utc": 1653232055.0,
                    "response": "Pretty neat. I find it difficult that your central argument is too general. Btc or bch is better? How can we even proceed if your don't define \"better?\"",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9l3s75",
                            "author": "post_mortar",
                            "score": 1,
                            "created_utc": 1653240544.0,
                            "response": "I think all aspects of \"better\" are up for discussion. I don't want to artificially constrain dimensions of value in the initial positions, so I leave it up to interpretation.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9l40go",
                                    "author": "post_mortar",
                                    "score": 1,
                                    "created_utc": 1653240643.0,
                                    "response": "The nice thing about this design is that every claim is it's own tree. If you really wanted to start from a specific position, that could be an independent root which we can move around on this main tree.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}