{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uq929a",
            "title": "HSABank.com bonus - Earn $300, $700, or $1,000",
            "url": "https://www.reddit.com/r/btc/comments/uq929a/hsabankcom_bonus_earn_300_700_or_1000/",
            "author": "S00P3R-SL1M3Y",
            "created_utc": 1652630308.0,
            "score": 6,
            "num_comments": 0,
            "subreddit": "btc",
            "selftext": "hsabank.com is offering up to $1,000 to old customers\n\nRight now, old [**HSABank.com**](https://hsabank.com/) customers can enjoy a **$1000 bonus.**\n\nConsumers who haven’t closed accounts within the past 90 days, may qualify for a $0, $300, $700 or $1000 bonus.\n\n**The bonus requires:**\n\n* Accounts must be opened by **January 1, 2022**\n* One **HSABank** account bonus is permitted per customer.\n* Offer valid only for **Health Savings Account (HSA)**.\n\n**Take these steps to get the bonus you deserve:**\n\n* Follow the link to your account [http://myaccounts.hsabank.com/Login.aspx](http://myaccounts-hsabank.com/Login.aspx)\n* Go to **Resources** section > **Marketplace**\n* Select any of our stores (**HSA or FSA store**)\n* **Create an account** in the selected store\n* Back to **HSABank** \\> **Account Summary**\n* **Refresh your balance**\n\n**You can get $0, $300, $700 or $1000 bonus.**\n\nHSABank earned 4.7 out of 5 stars in Bankrate’s review.\n\n&#x200B;\n\n&#x200B;\n\nhttps://preview.redd.it/rk4x3tuqwnz81.png?width=1406&format=png&auto=webp&s=0a4ca85e042d254c90b8593b8d1f84f6347d4923\n\nhttps://preview.redd.it/ts0owwuqwnz81.png?width=1302&format=png&auto=webp&s=704103b994d49ac677aa21bfa5c9431d4ef8ba4c\n\nhttps://preview.redd.it/4mbfqwuqwnz81.png?width=1156&format=png&auto=webp&s=804eddbaf649733edc7e684f21c772446270d384",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uq8fqv",
            "title": "If USDT did the same scam as recent failed UST \"stablecoin\" and backed their token with Bitcoin they may be forced to sell off their holdings and crash BTC and USDT in the process.",
            "url": "https://www.reddit.com/r/btc/comments/uq8fqv/if_usdt_did_the_same_scam_as_recent_failed_ust/",
            "author": "big--if-true",
            "created_utc": 1652628485.0,
            "score": 11,
            "num_comments": 4,
            "subreddit": "btc",
            "selftext": "**It took less than 24 hours for the other algorithmic stablecoin to collapse, to say it cant happen to USDT is nonsense. They likely backed themselves with Bitcoin the same way the other project did. If Bitcoin crashes you can expect to get a small percentage per $1 token of USDT. Dont act ignorant and want sympathy like the other project holders. We tried warning you for a long time.**\n\nUSDT is redeeming a lot of tethers recently. They are definitely not fully backed as historically they never were fully backed by dollars, so if large holders try cash out and dont get their cash , the peg between USDT and USD may break as people run for the exits. \n\nIf they did the same scam as the recent failed algorithmic stablecoin and backed their token with Bitcoin they may be forced to sell off their holdings and crash BTC.\n\nHistorical, along with current data can be found here: https://coinmarketcap.com/currencies/tether/historical-data/\n\nAs we know, Tether is supposed to be backed by 1:1 to the USD by Tether’s reserves. Tether allegedly has fiat, bonds, and other assets to do this (will address this a bit more below). Even though Tether is near its’ peg, the change in market cap shows an overwhelming amount of redemption.\n\nThis is concerning for a few reasons, for one because the overall market is down. Meaning, the assets in Tether’s reserve also most likely are down as well. I’m not just talking about the crypto market, either. Since we do not have full transparency in Tether’s backing, many have speculated it’s tied to assets like BTC, which is also way down as well. Meaning, their backing “power” may be lower than it was previously and not exactly at 1:1.\n\nAs an example, for arguments sake, let’s say that BTC was bought and fully backed the USDT. Their average price for backing was when Bitcoin was at 30k. Now let’s say the market dips, and bitcoin goes to 27k. At the same time, many start redeeming Tether to cash out to fiat out of fear of the market conditions. This means that the backing of Tether is no longer 1:1 and since people are redeeming, Tether would have to sell off its bitcoin reserves for a loss of 10% to cover the redemption.\n\nFor doubters asking for factual evidence:**\n\nhttps://www.cftc.gov/PressRoom/PressReleases/8450-21\n\nUS government: \n\n>In fact Tether reserves were not “fully-backed” the majority of the time.\n\n>The order further finds that Tether failed to disclose that it included unsecured receivables and non-fiat assets in its reserves, and that Tether falsely represented that it would undergo routine, professional audits to demonstrate that it maintained “100% reserves at all times” even though Tether reserves were not audited.\n\n>As found in the order, Tether held sufficient fiat reserves in its accounts to back USDT tether tokens in circulation for only 27.6%\n\n>held reserves in non-fiat financial products\n\nEdit: **Tether and Bitfinex have gotten beyond desperate, they are offering 30-50% interest rates for USD loans on Bitfinex, thats higher than ponzi schemes, these guys have lost the plot.**",
            "stickied": false,
            "comments": [
                {
                    "id": "i8ph5ql",
                    "author": "MobTwo",
                    "score": 9,
                    "created_utc": 1652629769.0,
                    "response": "For newcomers who are unaware of the fraudulent Tethers USDT used to artificially inflate BTC and crypto market in general, here's some articles about it.\n\nhttps://crypto-anonymous-2021.medium.com/the-bit-short-inside-cryptos-doomsday-machine-f8dcf78a64d3\n\nhttps://www.youtube.com/watch?v=-whuXHSL1Pg",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}