{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uxfu9b",
            "title": "As a Bitcoin Cash supporter, here is how I view the rise of Monero.",
            "url": "https://www.reddit.com/r/btc/comments/uxfu9b/as_a_bitcoin_cash_supporter_here_is_how_i_view/",
            "author": "LovelyDayHere",
            "created_utc": 1653480235.0,
            "score": 3,
            "num_comments": 4,
            "subreddit": "btc",
            "selftext": "I got into [Bitcoin](https://bitcoin.com/bitcoin.pdf) a number of years ago, before the block size wars, before Bitcoin Cash existed. Back when BTC could still pass as the \"peer to peer electronic cash\".\n\nI believe financial privacy is important - when someone tells you privacy is dead, they are usually ignorant about the possibilities of strong cryptography and how it protects against exploitation (by criminals, by foreign governments, even by one's own government) or they are knowingly or unknowingly assisting psychological operations intended to reduce peoples' awareness of privacy as a right and frankly, something worth having and achievable if we engage ourselves for it.\n\nSo, I do like Monero's emphasis on privacy by default, while at the same time I like Bitcoin (now Bitcoin Cash) for its default transparency and making privacy available to those who want it (through e.g. CashFusion). I know some Monero people strongly disagree and believe that privacy is not achievable through opt-in. But I think this is not a settled matter. Combinatorics and pseudonymity at large scale (millions / billions of people using Bitcoin) can make compromise of financial privacy very costly.\n\nHowever, that's not my main point here.\n\nI want to make the point that the rise of Monero is good for all of p2p electronic cash.\n\nFirstly, it proves that there is some market interest in privacy. This is encouraging. Privacy does not come for free! Work has to be done to make it happen, and that work costs money. (This is also why I'm fine with people who have privacy use cases, paying extra for those, even on BCH through layered protocols such as CashFusion, or in the future perhaps, sidechains where all transactions are private similar to Monero).\n\nSecondly, it shows that even if a p2p cash coin has dropped by a lot in the past (I read that Monero had dropped down to even 50th spot?) there is potential for the coin to rise substantially.\n\nThe higher p2p cash coins rise compared to others, the better it will be for economic freedom and human rights (incl. privacy) in the world.\n\nSo I say to the Monero community: Well done, thanks for sticking to your guns, there is a long way ahead but the Bitcoin Cash community is fighting along side you for decentralized p2p cash, with complementary features.\n\nI don't think it's a zero sum game at all.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9xe7zh",
                    "author": "jessquit",
                    "score": 2,
                    "created_utc": 1653481769.0,
                    "response": "**Nothing would make the enemies of p2p cash happier than for the Monero and BCH communities to fight each other.**",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9xc5us",
                    "author": "Bagatell_",
                    "score": 2,
                    "created_utc": 1653480617.0,
                    "response": "> I don't think it's a zero sum game at all.\n\nI doubt the central banksters think that.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9xccpb",
                            "author": "LovelyDayHere",
                            "score": 3,
                            "created_utc": 1653480726.0,
                            "response": "I'm talking about competition among cryptocurrencies that have some overlap but also unique selling points.\n\nLike BCH and XMR.\n\n> I doubt the central banksters think that.\n\nTo the extent that they'd like to force us all into centralized systems under their control, I agree...\n\nThey will want to crush all cryptocurrencies.\n\nIn that sense, I am wary of what can be pumps to capitalize on FOMO, then hard dumps to destroy confidence.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9xe6q2",
                    "author": "UcharsiU",
                    "score": 1,
                    "created_utc": 1653481749.0,
                    "response": "If you look at it from the point of view of competition between crypto, you might not be happy with monero rise as a bitcoin cash supporter.\n\nBut, if you don't like that crypto in general is being perceived and used as a speculation, holding or investment, you should be very happy with rise of monero.\n\nIt looks like there is a struggle. Is the crypto something to use or something to hold and wait for a better price?\n\nThat's the beginning of something bigger that I don't feel knowledgeable enough to talk in great depth, but bitcoin cash and monero are part of \"use it\" movement which might have a future.\n\nHolding mentality brings scams and a ponzi scheme vibe in general.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}