{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uxh2uz",
            "title": "Bitcoin needs to increase transaction throughput to stay relevant",
            "url": "https://www.reddit.com/r/btc/comments/uxh2uz/bitcoin_needs_to_increase_transaction_throughput/",
            "author": "snorketre",
            "created_utc": 1653484318.0,
            "score": 4,
            "num_comments": 15,
            "subreddit": "btc",
            "selftext": "Bitcoin needs to increase transaction throughput to stay relevant and to stay the dominant crypto currency for the future, and for today.This needs to happen either on the main net, or on a secondary layer that does not require you to lock your coins. Your coins have to be able to be spent freely whenever you want, Cheaply, and fast. Without compromising on safety.Is this possible?Should we increase the block size to do it on the main net? What block size would we need for bitcoin to run with a average transaction cost under 1 cent. I think 1 cent is a good transaction roof if you want to be able to use bitcoin for everything and anything. How much could we raise the block size without compromising safety or peoples ability to run their own full node?\n\nOr what could be done (maybe with a second layer) to be able to spend your coins freely, fast and cheaply without locking them up in for example a lightening network channel?  \nThe problem i see is that if you lock your funds in a channel you cant access them if you need to send to someone not in the network. And you cant withdraw your funds to cash (fiat) without completely closing the channel.  \nAllso there is a cost to opening a channel, and if you have paychecks that you deposit regulary you would have to open new channels regularly and/or close the old ones as you go.\n\nMy base thesis is that for a network to be used as daily money, you would need the following:  \nFast (instant) transfer.  \nFees under 1 cent (Fast educated guess)  \nYour money needs to be available to you at any time.  \nIt needs to be safe.\n\nFull disclaimer, i know about the block war, i know about bitcoin cash, i know about the lightening network. This post is made because people are not using bitcoin, and i want to find the problem that causes it, and i want to find the solution to solve it. I think i know some of the problems, but i want to find the solutions, and maybe more of the problems (if there are any more).\n\nI tried posting this in r/Bitcoin, but it did not go well so im posting it here to hopefully get more constructive responses.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9xjh95",
                    "author": "simon-v",
                    "score": 10,
                    "created_utc": 1653484456.0,
                    "response": "Bitcoin Cash is a variant of Bitcoin that did just what you are suggesting. It's doing well enough, as far as i can tell.\n\nWelcome.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9xjt2r",
                    "author": "LovelyDayHere",
                    "score": 6,
                    "created_utc": 1653484615.0,
                    "response": "> This post is made because people are not using bitcoin, and i want to find the problem that causes it\n\nFees kill commerce. It's pretty simple. You figured this out already.\n\n> Should we increase the block size to do it on the main net?\n\nIt's been done :) it's called [Bitcoin Cash](https://whybitcoincash.com).\n\nIt's got all you need, people only need to use it as Bitcoin was intended.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9xjz0u",
                            "author": "snorketre",
                            "score": 1,
                            "created_utc": 1653484694.0,
                            "response": "Thank you. And yeah i know about bitcoin cash, but not being the main bitcoin chain kills it a bit i think.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9xkiad",
                                    "author": "LovelyDayHere",
                                    "score": 5,
                                    "created_utc": 1653484940.0,
                                    "response": ">  i know about the block war\n\nThen you know why the things you propose, aren't going to happen on \"the main bitcoin chain\" (BTC).\n\nInstead, it's much more likely that other cryptocurrencies will flip BTC.\n\nCurrent first contender is probably ETH, which has already flipped BTC in many metrics other than market cap.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9xp6tb",
                                    "author": "Kazakkbdk",
                                    "score": 1,
                                    "created_utc": 1653487101.0,
                                    "response": "Banker employees control the BTC chain and will do whatever it takes to stop that chain from competing with the currency of central banks.\n\nThey banned everyone who disagrees with them, so those who were banned were forced to fork the network with the intention of preserving the original Bitcoin protocol, as described in the original whitepaper.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9xjwrp",
                    "author": "Shibinator",
                    "score": 6,
                    "created_utc": 1653484664.0,
                    "response": "https://bitcoincashpodcast.com/start#episode-8-of-10-bitcoin-cash\n\nBitcoin needs to increase capacity, so that's what we did nearly 5 years ago.\n\nWelcome.\n\n> Full disclaimer, i know about the block war, i know about bitcoin cash, i know about the lightening network. This post is made because people are not using bitcoin, and i want to find the problem that causes it, and i want to find the solution to solve it. \n\nWell, there's your answer.  People are not using Bitcoin. That's why we switched to BCH.  The problem is that Bitcoin BTC got captured, and the solution was that we switched to BCH.\n\nhttps://www.youtube.com/watch?v=eafzIW52Rgc",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9xk67e",
                    "author": "BewareOfShills",
                    "score": 5,
                    "created_utc": 1653484788.0,
                    "response": ">I tried posting this in r/Bitcoin, but it did not go well so im posting it here to hopefully get more constructive responses.\n\nr/bitcoin and other subs are heavily censored to suppress the need for Bitcoin L1 scaling. That is the reason why BitcoinCash exists. There was no other way to scale Bitcoin than to fork.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9xlaxi",
                    "author": "Aggravated-Bread489",
                    "score": 3,
                    "created_utc": 1653485315.0,
                    "response": "You are in the right place. Reasonably scale the main chain over time to keep up with demand. We haven't run into any issues yet. Better yet, BCH accepts 0-conf transactions which are faster than lightning and don't lock your funds on another layer. It works just like magic internet money.\n\nu/chaintip",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9xlovp",
                            "author": "chaintip",
                            "score": 3,
                            "created_utc": 1653485498.0,
                            "response": "***\nu/snorketre, you've [been sent](https://www.blockchain.com/bch/address/bitcoincash:qrelay2d2pekqjxmease6q26pp65xndxautjxdeph7) `0.01046839 BCH` | `~2.02 USD` by u/Aggravated-Bread489\nvia [chaintip](http://www.chaintip.org). Please [claim it!](https://www.chaintip.org/reddit#claim)\n***",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9xksfs",
                    "author": "snorketre",
                    "score": 2,
                    "created_utc": 1653485072.0,
                    "response": "The problem i see with the lightening network is the need for people to have their money available to them at any time. With the lightening network you have to lock your funds up in the network and you cant transfer them to anyone not in the network unless you take them out of the network again.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9xluzj",
                    "author": "Aggravated-Bread489",
                    "score": 2,
                    "created_utc": 1653485579.0,
                    "response": "Let me ask you, what do you think are the problems with raising the block size?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9xmajs",
                            "author": "snorketre",
                            "score": 1,
                            "created_utc": 1653485783.0,
                            "response": "Bigger block size = bigger ledger. So you need bigger HDDs to store the complete ledger. This makes it so that only companies or well off individuals can store the entire ledger.  \nThis however will be a diminishing problem as storage costs decline. However the ledger will continue to grow, so it might not be a diminishing problem.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9xpmq8",
                                    "author": "simon-v",
                                    "score": 2,
                                    "created_utc": 1653487298.0,
                                    "response": "Ask yourself something. Suppose, the block size is kept small. This means the majority of economic actors are excluded from transacting — their transactions simply won't fit. Therefore, the majority of the blocks will be filled with the transactions of whales, exchanges and banks.\n\nWhy would hobbyists and individuals who are not so well-off want to store and validate a bunch of interbank settlement transactions?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}