{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uz2jyf",
            "title": "I bought all of u/JarmoViikki's BCH.",
            "url": "https://www.reddit.com/r/btc/comments/uz2jyf/i_bought_all_of_ujarmoviikkis_bch/",
            "author": "54545455455555",
            "created_utc": 1653670435.0,
            "score": 37,
            "num_comments": 90,
            "subreddit": "btc",
            "selftext": "Just saw this post saying this guy sold all his Bitcoin, u/JarmoViikki. Well, I bought around $10k yesterday so hopefully it evens out.\n\nBut seriously, people like  u/JarmoViikki were always on the wrong side, in crypto ONLY to increase their USD, so if a crypto fails to increase their USD they see it as a failure. Of course, this is beyond stupid, like saying if Amazon stock doesn't increase in price one year it's a failed company.\n\nI post this only because I know we are going to have A LOT of kids like u/JarmoViikki who get angry and confused, just try to support them and be nice, I know it's hard for me.",
            "stickied": false,
            "comments": [
                {
                    "id": "ia8r6mv",
                    "author": "don2468",
                    "score": 19,
                    "created_utc": 1653687492.0,
                    "response": "I don't agree with kicking people when they are down and especially not rubbing it in, it smacks of the Bitcoin Maxi's 'have fun staying poor' only worse because it is personal.\n\n\nWe don't know u/JarmoViikki's situation, he reached the point where he had completely lost faith in BCH. We don't know how much of his net worth was tied up in BCH. It's hard watching a substantial part of your future evaporate.\n\n\nMarc De Mesel had a good point in one of his interviews, 'one needs to get to a personal level of self sufficiency before one can invest in others'.\n\n\nPersonally I mourn his loss and all the others that silently lost faith.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iadewvy",
                            "author": "th2013bk",
                            "score": 3,
                            "created_utc": 1653783163.0,
                            "response": "Lmao you will find a lot of people like taht here and this is worst if I say.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iaa2m3s",
                            "author": "JarmoViikki",
                            "score": 6,
                            "created_utc": 1653712705.0,
                            "response": "Thank you for your nice words. I understand my haters. They are also in pain.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iaaxcd9",
                                    "author": "don2468",
                                    "score": 4,
                                    "created_utc": 1653738388.0,
                                    "response": "Good Luck!\n\n\nHopefully we will meet again, down the road.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iabdmp2",
                                            "author": "JarmoViikki",
                                            "score": 2,
                                            "created_utc": 1653747835.0,
                                            "response": "Yes I got to know some great people from BCH community. \n\nOf course a lot of trolls also but also some great people.\n\nI hope BCH can make it and become a rescue boat from the slavery of cabal.\n\nI think some sort of inter-chain service of BCH-XRP would be helpful in the future where a person can convert XRP to BCH. I believe this service will have demand under the proper circumstances. And BCH can be a saving vehicle from the government oppression of carbon footprint tracking, transactional approval and other BS we all will be dealing with in the future.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "iaceo03",
                                            "author": "roliviera",
                                            "score": 1,
                                            "created_utc": 1653765412.0,
                                            "response": "Yeah we all are going to be together in this kind of stuff though.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "iaajfmx",
                                    "author": "ppdemeijer",
                                    "score": 3,
                                    "created_utc": 1653726441.0,
                                    "response": "Good day to buy more BCH.\n\nSo much growth happening, price is a bargain.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "ia9zlfx",
                            "author": "crustycalzone",
                            "score": 2,
                            "created_utc": 1653710715.0,
                            "response": "\"Lost faith in BCH\", or perhaps completely misunderstood the premise of digital currencies.  It's understandable because that's very common.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iab00x6",
                                    "author": "don2468",
                                    "score": 3,
                                    "created_utc": 1653740179.0,
                                    "response": "> \"Lost faith in BCH\", or perhaps completely misunderstood the premise of digital currencies. It's understandable because that's very common.\n\n\nOne might really believe in a digital currency to be used in commerce and go all in wanting to whole heartedly support the idea of **Separating Money from State** then watch your life savings evaporate in front of you in a Bear Market. Get cold feet thinking the idea just won't work and you have to feed your family, or the time is just not right for [*Permissionless P2P Money For The World*](https://www.youtube.com/watch?v=9mBc0Zk1YWs&t=148s). I remember some very low points, Dev's growing despondent, Bitcoin Unlimited Assert(0) DDOS attack, XT node DDOS... and yes painful price swings I probably only held on because I could afford to.\n\n\n\nBut in reality I believe 99%+ to be on a spectrum split between Medium of Exchange, Store of Value, Long Term Investment, Get Rich Quick.... and of those 99%+, 99%+ have their breaking point.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iackjnr",
                                            "author": "crustycalzone",
                                            "score": 1,
                                            "created_utc": 1653768231.0,
                                            "response": "You can separate money from state, but not from debt.  Anything else is just going to trade like a commodity which can go up and down in value.\n\nBanks create money, not governments, at best governments standardize this process.\n\nYou can't separate money from rights to property, torts, etc.  If someone or something has the power to enforce laws, that's going to matter a hell of a lot more than some \"smartcontract\", whatever.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "iacky8s",
                                            "author": "crustycalzone",
                                            "score": 1,
                                            "created_utc": 1653768433.0,
                                            "response": "Money has never \"scaled\", and never will.  A payments network can scale, but that is different.  But at the end of the day, money is just a bank having the right to foreclose on your home, and you being allowed to sell said right to the bank for money, ie debt.\n\nPayments can be handled with very little total capital.  Especially in a digital age.  A cryptocurrency with a market cap of a few million could facilitate daily payments for the entire world.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iae580q",
                                                    "author": "tl121",
                                                    "score": 1,
                                                    "created_utc": 1653798543.0,
                                                    "response": ">A cryptocurrency with a market cap of a few million could facilitate daily payments for the entire world.\n\nI don’t see how that’s remotely possible.  People living paycheck to paycheck and paid weekly hold on average half a week’s pay.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "iads84r",
                                            "author": "smgabf",
                                            "score": 0,
                                            "created_utc": 1653790573.0,
                                            "response": "Indeed this is the breaking point as we had seen in the past as well.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "iac4zkb",
                                    "author": "vicovolk",
                                    "score": 1,
                                    "created_utc": 1653760743.0,
                                    "response": "Buying Crypto today is far safer than buying last week.\n\nBuying Crypto today feels far scarier than buying last week.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia7ur3v",
                    "author": "sqrt7744",
                    "score": 29,
                    "created_utc": 1653672892.0,
                    "response": "It's kind of odd to be upset about the ranking of BCH in market cap. Remember that Luna was once a top 10 coin. Lots of junk.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia7zhlr",
                            "author": "54545455455555",
                            "score": 15,
                            "created_utc": 1653674915.0,
                            "response": "I know, it's hilarious that people think doge is good just because, \"number so big\".",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iacniu9",
                                    "author": "toinzter",
                                    "score": 1,
                                    "created_utc": 1653769675.0,
                                    "response": "Good for you taht you have got the options as of now as well.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "iae8jqg",
                            "author": "volkov_ks",
                            "score": 1,
                            "created_utc": 1653800818.0,
                            "response": "It is going to be on the top for a long time as we know about it now.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia8rjmo",
                    "author": "hero462",
                    "score": 7,
                    "created_utc": 1653687664.0,
                    "response": "I bought some as well.  Not sure what the point was of the big goodbye he made.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iace0bd",
                            "author": "raznotorg",
                            "score": 2,
                            "created_utc": 1653765101.0,
                            "response": "Some people just want something called “Bitcoin”.\n\nbut don’t care that it doesn’t work as p2p cash for the world.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia8hxvx",
                    "author": "big--if-true",
                    "score": 3,
                    "created_utc": 1653683138.0,
                    "response": "At least stocks went up today :)\n\nWith adoption BCH WILL go up in price, just take a look at what Bitcoin hit, and that was without a use case or utility. I do think the next crypto billionaires will be investors who throw say 10-200m at BCH and then 10x-100x their crypto. With Bitcoin, it would take tens of billions, maybe more, to just double their investment.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iacafv7",
                            "author": "onybus",
                            "score": 1,
                            "created_utc": 1653763385.0,
                            "response": "Yeah they have been trying to do that same kind of stuff from a long time.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia7yhhs",
                    "author": "bonafidebob",
                    "score": 8,
                    "created_utc": 1653674478.0,
                    "response": "> in crypto ONLY to increase their USD\n\nHow is this any different from “in crypto ONLY to increase their wealth” though?   I mean, that’s what the “store of wealth” story is all about.\n\nIf you want it to buy and sell stuff with, then talking about acquiring $10K is more like me saying “hey guys, I just took $10K in USD out of my bank.”    OK, and… ?\n\nMight be more interesting if you tell me what you’re buying with it: “Hey guys, I just paid my rent with BCH!”",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia7zd7z",
                            "author": "54545455455555",
                            "score": 12,
                            "created_utc": 1653674861.0,
                            "response": "Actually great point! I was being a hypocrite by accident :(\n\nRight now I'm spending BCH on web hosting and a VPN. Just bought a bunch of birthday presents for my son on purse. Io and got 20% off. I have a live hate relationship with purse because even at 20% off i still basically break even most of the time for small stuff. But for anything over like $100 it's insane. I've saved nearly $10k using purse (spent around $50k total over the years). Like this electric unicycle alone i saved $150 on.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia802xy",
                                    "author": "bonafidebob",
                                    "score": 9,
                                    "created_utc": 1653675176.0,
                                    "response": "You bought an electric unicycle for your son's birthday *at a discount* with BCH?   That's really cool, I've got a couple of teen boy birthdays coming up, tell me more!  What unicycle?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia8evhp",
                                            "author": "54545455455555",
                                            "score": 6,
                                            "created_utc": 1653681744.0,
                                            "response": "This one: https://www.amazon.com/INMOTION-V5F-Electric-Unicycle-Adults/dp/B098QW8XTT/ref=pd_aw_lpo_1?pd_rd_i=B098QW8XTT&psc=1\n\nPromise, not an affiliate link :)",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "iacp3sk",
                                            "author": "wyc83189510",
                                            "score": 1,
                                            "created_utc": 1653770391.0,
                                            "response": "If it is going to be like that only then we will see that change as well.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "iacd4ct",
                                    "author": "crytoddjack",
                                    "score": 2,
                                    "created_utc": 1653764683.0,
                                    "response": "Since it is just about the early adopters it has limited chances.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "iabt8sn",
                            "author": "duan269",
                            "score": 1,
                            "created_utc": 1653755215.0,
                            "response": "MONERO will become globally synonymous with bitcoin cash.\n\nIt already is among the early adopters that actually have a real need for digital cash.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iactmjq",
                                    "author": "Dzejos2",
                                    "score": 0,
                                    "created_utc": 1653772576.0,
                                    "response": "Indeed! for the digital cash this is going to be a normal thing if you say,",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia9zgsz",
                    "author": "crustycalzone",
                    "score": 3,
                    "created_utc": 1653710637.0,
                    "response": "Crypto currencies are not investments.  It's literally in the name: crypto \"currency\".  They are meant for buying stuff.  A lot of people who would never dream of stuffing cash under their mattress, somehow think it's a good idea to buy stacks of digital money.  And then they complain when it doesn't appreciate.\n\nUse crypto to pay people, use it to buy things, make donations, and perhaps to carry a highly liquid asset in a very convenient form.\n\nIf you are merchant who deals in a lot of crypto transactions, then it makes sense to trade and accumulate, so as to manage risk in price fluctuations.  But otherwise, not really meant for that.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaa8ppf",
                            "author": "richardamullens",
                            "score": 5,
                            "created_utc": 1653717167.0,
                            "response": "BCH is intended to be sound money, but it is being used mainly for speculation and is wildly volatile as a result.  But our fiat is purposely inflated and now in the UK there is 10% annual inflation.  One of the reasons that I buy BCH is because inflation in fiat is guaranteed.  One of the reasons that I spend BCH is to reward companies that accept it, so that others follow suit.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iadkmge",
                                    "author": "bosscui",
                                    "score": 1,
                                    "created_utc": 1653786301.0,
                                    "response": "i wonder that how tthey are going to do that as well now lol.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia7utqj",
                    "author": "TripleReward",
                    "score": 9,
                    "created_utc": 1653672922.0,
                    "response": "That guy has a weird posting history",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia8kt3z",
                            "author": "saylor_moon",
                            "score": 6,
                            "created_utc": 1653684461.0,
                            "response": "Kinda obvious paid shill.\n\nWhen Gamestop?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iaddktg",
                                    "author": "bitsanctuary",
                                    "score": 1,
                                    "created_utc": 1653782441.0,
                                    "response": "Indeed we all have been waiting for this from a long time to be honest.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia80e1g",
                    "author": "Nomorenownomoreever",
                    "score": 9,
                    "created_utc": 1653675311.0,
                    "response": "HOLY SHIT. BCH is a CRYPTOCURRENCY. It is not digital gold! It is different in philosophy fundamentally, regardless of it trading on exchanges. A lower price does not matter if you are paying the same amount if you buy to transfer at the moment. This is a currency",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia8d2cl",
                            "author": "sqrt7744",
                            "score": 7,
                            "created_utc": 1653680926.0,
                            "response": "Yes, but it is nice when the value goes up.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia9ztdn",
                                    "author": "crustycalzone",
                                    "score": 1,
                                    "created_utc": 1653710853.0,
                                    "response": "> Yes, but it is nice when the value goes up.\n\nWhen you are trying to sell.  But if you are trying to buy, you would prefer to buy at a lower price.  All in all it's a complete wash.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iacelay",
                                            "author": "yiying125",
                                            "score": 1,
                                            "created_utc": 1653765376.0,
                                            "response": "Indeed it was more complete as it has just started and it got some more time.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "iaaqmxi",
                                    "author": "bastone357",
                                    "score": 1,
                                    "created_utc": 1653733091.0,
                                    "response": "They want sound money above all else. There’s BCH for all type of transactions.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "ia8ix1k",
                            "author": "Remora_101",
                            "score": 14,
                            "created_utc": 1653683586.0,
                            "response": "I reject the SoV religion of BTC but I do not think price appreciation doesn't matter. A slow but steady price rise would help immensely with adoption for example.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iadmxxb",
                                    "author": "sdfm33m1",
                                    "score": 1,
                                    "created_utc": 1653787583.0,
                                    "response": "Yeah this is the basic example and this is what we need in this moment as well.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "ia8i2e7",
                            "author": "TinosNitso",
                            "score": 1,
                            "created_utc": 1653683196.0,
                            "response": "But according to gold bugs, gold could be seen as currency! Meaning maybe BCH really **is** like digital gold, or is at least intended to be, but not gold bullion (bulk amount).\n\nFor example, [here](https://www.ebay.com/itm/164961330561) is a **Cash Gold** note (polymer with embedded 100mg gold bar). There are at least two fundamentally different ways of looking at gold: it should either be stored as bullion, or else stored as **cash** (divided into lots & lots of tiny bars, embedded in currency). Supporters of fiat see gold as just a **S**tore-**O**f-**V**alue, which shouldn't be used directly as currency. I suspect some of the same ppl prefer BTC because its block-size limit means only large amounts (like bullion) should ever exist on-chain, stopping its use as cash.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia9xiw4",
                                    "author": "dominipater",
                                    "score": 3,
                                    "created_utc": 1653709454.0,
                                    "response": "Gold “could be seen” as currency?\n\nGold was THE universal currency of humanity for millenia until 100 years ago.  Paper currency was pegged to gold till 60 yrs ago.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iabl5wt",
                                            "author": "blueghost1948",
                                            "score": 1,
                                            "created_utc": 1653751435.0,
                                            "response": "incredible how many triggered BTC maxis there are in the comments",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iacgid1",
                                                    "author": "jhonjmmi",
                                                    "score": 1,
                                                    "created_utc": 1653766263.0,
                                                    "response": "Indeed it If it is going to be like that only it will be a major problem for them as well as we say.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "iaclmta",
                                    "author": "252898484",
                                    "score": 1,
                                    "created_utc": 1653768776.0,
                                    "response": "He's spent 100% of his credibility on bcash. Tough one to walk back on.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "iac8v0g",
                            "author": "vasik510",
                            "score": 1,
                            "created_utc": 1653762617.0,
                            "response": "I agree, that BTC is not Cash like written in the whitepaper.\n\nBut why isn‘t BCH popular and used as cash?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia8n4ak",
                    "author": "Twoehy",
                    "score": 5,
                    "created_utc": 1653685545.0,
                    "response": "I get the conflict, we all know that BCH will have to increase in price over the long term to be successful, but it was never meant to be a get rich quick scheme, it's always been a sound alternative to fiat, which is a get poorer slowly scheme (or quickly, in the case of the past year).\n\nThat said, I have no interest in supporting coins that aren't either A) Sound Money or B) Have a clearly defined use case. Obviously neither of those requirements is sufficient on their own, but it's astonishing how many can't meet either of those criteria.\n\nThis is still a long term bet against the stability of fiat, not a path to immediate riches.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iadnf40",
                            "author": "Securitly07",
                            "score": 1,
                            "created_utc": 1653787851.0,
                            "response": "I think we are going to see a lot of changes since this has just started yet.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia8iiic",
                    "author": "Remora_101",
                    "score": 4,
                    "created_utc": 1653683400.0,
                    "response": "My limit offers are set, hopefully get some more cheap BCH. If necessary  I'll buy on the way  up.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iacka58",
                            "author": "kynethic",
                            "score": 1,
                            "created_utc": 1653768101.0,
                            "response": "Indeed the reality is that they ahve been buying the same stuff from long time and this is the major reason \n\nas in the market we had seen that this is quite common that most of them are going to be at same position.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia7ovw4",
                    "author": "54545455455555",
                    "score": 6,
                    "created_utc": 1653670459.0,
                    "response": "Thanks for the BCH u/JarmoViikki",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iacfw7g",
                            "author": "Katrotat",
                            "score": 1,
                            "created_utc": 1653765985.0,
                            "response": "Are you running out of fools willing to hold bags? Oh dear .",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia9ksop",
                    "author": "Blazedout419",
                    "score": 3,
                    "created_utc": 1653702627.0,
                    "response": "Where do you see BCH increasing any kind of actual usage? Obviously the price has declined for years, but I keep hearing about all this adoption and how it will help the price long term. I do not see increased activity on the blockchain...only posts saying some stores accept it. It is one thing to put a sticker on your door and accept BCH, but where is the usage??",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaa7g0c",
                            "author": "richardamullens",
                            "score": 2,
                            "created_utc": 1653716200.0,
                            "response": "I saw that two restaurants in London had started accepting BCH.  I have visited one, twice and will visit the other soon.  \n\n\nThe usage is from people holding BCH who decide to use it.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iacci57",
                                    "author": "nlfanmherrb",
                                    "score": 2,
                                    "created_utc": 1653764394.0,
                                    "response": "Yeah it is more like they were just testing the waters before coming in it as well because it is very important to do that\n\nThey have to do that and looks like this is the best option we can just think about going up on as well.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia8pagc",
                    "author": "_risho_",
                    "score": 2,
                    "created_utc": 1653686583.0,
                    "response": "holy fucking cope.\n\nfirst of all who gives a shit if redditor x sells your token, second you have no idea what the future brings. bch has been in a freefall vs bitcoin and ethereum since it's inception. that's not to say that it won't be successful, but it certainly hasnt been thus far. third drop the fucking good guy charity facade. if you were a good guy looking to be nice and supporting people you wouldn't be calling out some random pleb on the front page of the subreddit for being an idiot. you have already failed.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iac9yt7",
                            "author": "qk188",
                            "score": 1,
                            "created_utc": 1653763157.0,
                            "response": "would love to buy this dip .\n\nbut i am already all in bch and no cash left to buy this dip :)",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia8rpiv",
                    "author": "TenshiS",
                    "score": 0,
                    "created_utc": 1653687743.0,
                    "response": "I'm into Bitcoin because I want something that challenges the status quo, banks the unbanked, and that could become a global currency which is both fast and cheap.\n\nI no longer see BCH ever becoming that. It's either Lightning or something else.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia8xnsr",
                            "author": "jbrev01",
                            "score": 4,
                            "created_utc": 1653690636.0,
                            "response": "You realize lightning only works with centralization right? If it requires centralization and trust, then it isn't sound money.\n\nBCH is currently the best crypto for sound money.\n\nI think more people need to educate themselves on sound money: [Hidden Secrets of Money](https://www.youtube.com/playlist?list=PLE88E9ICdipidHkTehs1VbFzgwrq1jkUJ)",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia9tqy2",
                                    "author": "TenshiS",
                                    "score": -2,
                                    "created_utc": 1653707379.0,
                                    "response": "I think you need to educate yourself more on lightning, in no way does it require centralization. Its a (peer to peer) presigned bitcoin multisig which is being renegociated and broadcasted at a later date.\n\nPerhaps you should read a book like Mastering Lightning before commenting on it.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia9ytm3",
                                            "author": "dominipater",
                                            "score": 0,
                                            "created_utc": 1653710241.0,
                                            "response": "I’ve learned more about LN in this sub than anywhere else.\n\nIf LN was a boat taking ppl across a river everyday, this sub would spend it’s days calling all passangers idiots pointing to pictures of crocodiles in the water.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iaax8tn",
                                                    "author": "Bittarder",
                                                    "score": 3,
                                                    "created_utc": 1653738315.0,
                                                    "response": "It's never a crash, it's always a dip or a market correction.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iadfnfz",
                                                            "author": "a532933202",
                                                            "score": 1,
                                                            "created_utc": 1653783559.0,
                                                            "response": "Indeed this looks like this is just a co5rection and we all should just welcome and wait for it more now lol.\n\nmore as of now we had seen that these type of changes needs to be there for the betterment of that situation lol.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "iac7e3h",
                                            "author": "btc2okpay",
                                            "score": 1,
                                            "created_utc": 1653761907.0,
                                            "response": "The clouds of fear desperately captured our mind but those who will able to shatter it now will never regret.\n\nBuy bitcoin cash now! Cheers !",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iacbv3o",
                                                    "author": "TenshiS",
                                                    "score": 1,
                                                    "created_utc": 1653764080.0,
                                                    "response": "You sound like cult lunatics",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "iab3qty",
                                    "author": "kersmi",
                                    "score": 1,
                                    "created_utc": 1653742470.0,
                                    "response": "Don’t catch a falling knife, wait for a consolation period.. XD .",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iacvu4i",
                                            "author": "mrenouf",
                                            "score": 1,
                                            "created_utc": 1653773630.0,
                                            "response": "Haha you are right! and more than that the same piece is going to be there for the long time\n\nand people needs to understand that why all this is very important and why they should do it.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "iabzswf",
                            "author": "bosoko1",
                            "score": 1,
                            "created_utc": 1653758273.0,
                            "response": "the only gold of the present and the future . Cheers .\n\nit's not hard to see that the only solution to beat the whole system is bitcoin cash. enlighten people",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iadhblm",
                                    "author": "galagar12",
                                    "score": 1,
                                    "created_utc": 1653784468.0,
                                    "response": "Yeah it must be there so that people will understand that how important this all is to start\n\nand this is the reason why we should see that all these changes are very much needed as well.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iaalj4j",
                    "author": "JarmoViikki",
                    "score": 1,
                    "created_utc": 1653728368.0,
                    "response": "Thank you for the liquidity you provided me. Without you I would have got even less for my bch so I appreciate it.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iae5nmk",
                            "author": "sunnycares11",
                            "score": 1,
                            "created_utc": 1653798831.0,
                            "response": "It generally depends on how how they are going to start it and how it will eventually meet the expections as well\n\nmore as of now the fees id the only problem II can think of to be honest I can't think of anything other than that.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iabhbbx",
                    "author": "Hiteshew",
                    "score": 1,
                    "created_utc": 1653749622.0,
                    "response": "The last few days can be said to be a disaster for the entire crypto market, but it will pass.\n\nWe should all adjust our mentality, like looking ahead",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iae1m03",
                            "author": "crynncitizen",
                            "score": 1,
                            "created_utc": 1653796182.0,
                            "response": "Indeed it is going to pass as it is just the starting and it will eventually reach to the top as we had seen in the pas t as well\n\nmore than that we have to wait for the best as we have just started yet it will be there in some time.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iabknln",
                    "author": "Bohgos",
                    "score": 1,
                    "created_utc": 1653751198.0,
                    "response": "Time to fill the bags with BitcoinCash.Buy BCH and spend in SmartBCH to enjoy low fees.\n\nThis is why you never give up on BCH!!  Only losers didn’t buy bch .",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iac7ygx",
                            "author": "deliriousintent",
                            "score": 1,
                            "created_utc": 1653762175.0,
                            "response": "Yeah you are right since we are going to find a lot of differnce and we are going to find it as well\n\nand more than that we will find it and it will eventually change for the better as well to be honest.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iacaqpx",
                    "author": "vgnz690",
                    "score": 1,
                    "created_utc": 1653763532.0,
                    "response": "Buying BCH is more safe because BCH has use cases in real life.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iacgn1a",
                    "author": "kalmanpool",
                    "score": 1,
                    "created_utc": 1653766324.0,
                    "response": "I wish i've some BCH to buy large pizza for my family .",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uz2jbx",
            "title": "DREAMS DON'T WORK UNLESS WE DO",
            "url": "https://i.redd.it/i0uzhpzjt1291.png",
            "author": "BCHisFuture",
            "created_utc": 1653670385.0,
            "score": 14,
            "num_comments": 11,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "ia8j4jq",
                    "author": "Remora_101",
                    "score": 3,
                    "created_utc": 1653683681.0,
                    "response": "👍👍\n\nThe only good reason to come here and complain that a service does not accept BCH is to get more people to demand they accept BCH.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia9guiy",
                    "author": "PublicCurrency9039",
                    "score": 2,
                    "created_utc": 1653700548.0,
                    "response": "BCH adoption is growing, and merchants that accept BCH know that the transactions are secure, fast, reliable, and NO chargebacks!! People love to use BCH because the transaction times are quick, smooth, and it’s a p2p decentralized transaction!!!",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}