{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uwroq5",
            "title": "Bitcoin Cash Conference in St. Maarten - November 2022",
            "url": "https://read.cash/@Pantera/bitcoin-cash-conference-in-st-maarten-november-2022-184bbf15",
            "author": "coinflip1211",
            "created_utc": 1653401283.0,
            "score": 51,
            "num_comments": 42,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9urdip",
                    "author": "hero462",
                    "score": 7,
                    "created_utc": 1653426065.0,
                    "response": "I look forward to seeing how this comes together!  I hope to attend!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9w5xj1",
                    "author": "bitcoinjason",
                    "score": 12,
                    "created_utc": 1653449686.0,
                    "response": "I am just thankful that someone is having a go, I know i would love to attend and meet the BCH family, share stories, trade tips and talk about whatever even the weather.\n\nIt will be my 1st experience to travel overseas providing fate smiles upon me, the world is rapidly changing and Bitcoin Cash was made for such a time as this.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9t8wfm",
                    "author": "knowbodynows",
                    "score": 2,
                    "created_utc": 1653403350.0,
                    "response": "Has the coordinator ever coordinated a conference? That's like real work... ~~Well I guess if hayden did it at the north Queensland conference it's possible.~~\n\nEdit- I don't know who coordinated the NQ conference, but coordinating a conference requires entirely different skills than posting videos.\n\nAnother edit- I apologize for using a name without knowing the whole story. Obviously it takes a team to pull off a conference. Thank you all for making it memorable, as I only heard good things (and thanks for being the positive example of my point:).",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9uem0f",
                            "author": "cheaplightning",
                            "score": 7,
                            "created_utc": 1653420679.0,
                            "response": "Afaik Hayden was not alone in pulling it off. Iirc Cindy did the heavy lifting. But I was not there.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9tk1e6",
                            "author": "Thanah85",
                            "score": 5,
                            "created_utc": 1653408021.0,
                            "response": "I'm wondering about this myself.\n\nI have no reasons to doubt that it will be a successful conference and I've seen nothing to suggest that Marc and company aren't giving this effort the attention it deserves.\n\nBut orchestrating an event like this is not a trifling amount of work, and anyone attending this (myself and my squad hopefully included) will be committing thousands of dollars and jumping through all the hoops of international travel. It would be big sad if it flops due to mismanagement after all the buzz it's created in the community.\n\nI'm eagerly awaiting the \"official\" announcement (and the extra details I'm hoping will be revealed - pricing, venue, sponsors, w/e) next week.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9uegx2",
                                    "author": "cheaplightning",
                                    "score": 6,
                                    "created_utc": 1653420620.0,
                                    "response": "Same",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9tsuak",
                                    "author": "emergent_reasons",
                                    "score": 5,
                                    "created_utc": 1653411607.0,
                                    "response": "Same.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9tpja3",
                            "author": "user4morethan2mins",
                            "score": 4,
                            "created_utc": 1653410256.0,
                            "response": "Actually there was a huge team of local people who coordinated, supported, volunteered and funded the conference. Sunny seems to have a good network of people in the community and is a business person, so it will be successful.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9tt2e1",
                                    "author": "emergent_reasons",
                                    "score": 2,
                                    "created_utc": 1653411696.0,
                                    "response": "Do you know that Sunny is involved in organizing it?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9u0kn5",
                                            "author": "Sunnyskn",
                                            "score": 8,
                                            "created_utc": 1653414785.0,
                                            "response": "Actually I am not involved in the organizing of this conference, Marc Falzon is ..",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9u0ofe",
                                                    "author": "emergent_reasons",
                                                    "score": 3,
                                                    "created_utc": 1653414828.0,
                                                    "response": "Thanks for confirming. Looking forward to hearing more details when Marc publishes them.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9txx6c",
                                            "author": "user4morethan2mins",
                                            "score": 4,
                                            "created_utc": 1653413691.0,
                                            "response": "Sunny's involvement was an assumption on my part. I was going to also mention Roger. Marc is mentioned as host on the [website.](https://www.bitcoincash2022.com/)\n\nu/Sunnyskn might wish to comment.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9u0tvg",
                                                    "author": "Sunnyskn",
                                                    "score": 9,
                                                    "created_utc": 1653414890.0,
                                                    "response": "Yes I am not involved ..I think I travel during those dates , have a friends wedding to attend in Europe. But I will try my best to see how I can be there \nWont be nice to miss a event on my own island .",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9ukbx1",
                                                            "author": "hero462",
                                                            "score": 7,
                                                            "created_utc": 1653423081.0,
                                                            "response": "Your friends need to reschedule.  Clearly;)",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "i9u17xz",
                                                            "author": "user4morethan2mins",
                                                            "score": 6,
                                                            "created_utc": 1653415052.0,
                                                            "response": "Thanks for the clarification.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9tsmxv",
                            "author": "emergent_reasons",
                            "score": 3,
                            "created_utc": 1653411524.0,
                            "response": "Hayden didn't organize it. It was organized by people with experience organizing in general, although I'm not sure specifically with conference-type events.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9tyd8i",
                                    "author": "EmergentCoding",
                                    "score": 7,
                                    "created_utc": 1653413878.0,
                                    "response": "True. A not-for-profit company BCHpacific Ltd organised the conference. BCHpacific did hire Cindy among others. Hayden did speak at the conference but it was Cindy that was given special credit at the end of the event.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9w7gwe",
                                    "author": "CryptoStrategies",
                                    "score": 2,
                                    "created_utc": 1653450501.0,
                                    "response": "I was directly involved in the organization of this event. See my comment below.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9wm1qt",
                                            "author": "emergent_reasons",
                                            "score": 1,
                                            "created_utc": 1653459921.0,
                                            "response": "~~You were involved but were not the organizer.~~\n\nOk.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9w3ool",
                            "author": "DramaticAd3378",
                            "score": 1,
                            "created_utc": 1653448554.0,
                            "response": "If you want to speak the truth, speak the whole truth. \nIt seems like you are claiming all the credits.\n\nMy account and what I associate with is not really relevant. Unless you want to change the topic.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9vwlyz",
                            "author": "CryptoStrategies",
                            "score": 0,
                            "created_utc": 1653445120.0,
                            "response": "Disappointing to see a few users spreading blatant disinformation in the comments. It's no secret that Cindy Feng was the primary organizer of the last BCH conference and pretty much all credit goes to her. She handled all the planning, logistics, paperwork and organized various venues for the conference itself and side events. \n\nI worked directly with Cindy on a day to day basis and I personally contacted and organized most of the speakers and sponsors. I did all the marketing for the event, did media coverage for the event and built the website with Corentin Mercier. Additionally I will add that I coined the term \"Bitcoin Cash City\" when I made a video by that title on the CoinSpice YouTube channel. I also registered and own the domain BitcoinCashCity.com which was utilized for the conference. It was my idea to do the conference and anyone claiming to be \"Bitcoin Cash City\" today has no affiliation with myself or Cindy Feng, the primary organizers of that event.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9vz84w",
                                    "author": "DramaticAd3378",
                                    "score": 5,
                                    "created_utc": 1653446353.0,
                                    "response": "I wonder if you and Cindy did all of them out of your good faith. Or perhaps you have someone paying you all for the work and now you are claiming the credit for it.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9vzbyj",
                                            "author": "CryptoStrategies",
                                            "score": 1,
                                            "created_utc": 1653446405.0,
                                            "response": "Try to make it less obvious when using your reddit shill accounts, or you might get banned from the site again.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i9vzy3j",
                                            "author": "DramaticAd3378",
                                            "score": -1,
                                            "created_utc": 1653446700.0,
                                            "response": "Lol. Why changing the topic? Am I being banned for asking genuine question. Or you have something to hide?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9w0rqn",
                                                    "author": "CryptoStrategies",
                                                    "score": 2,
                                                    "created_utc": 1653447096.0,
                                                    "response": "You never asked a question, you made a claim. But a quick overview of your account shows that you only engage in the astroturfing of posts by the group laying claim to the name \"Bitcoin Cash City\", thus revealing your identity. Why don't you make such comments from your real account instead?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9wxkvp",
                                                            "author": "pleasantmaggie",
                                                            "score": 0,
                                                            "created_utc": 1653469885.0,
                                                            "response": "I think you seriously underestimate the number of people who want to express their disappointment.  We're not alt accounts, we're real people.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9xhxfm",
                                                                    "author": "CryptoStrategies",
                                                                    "score": 0,
                                                                    "created_utc": 1653483694.0,
                                                                    "response": "Another shill/astroturf account. 2 months old. First Reddit interaction is literally a comment attacking me, and all other interactions beyond today are astroturfing on Bitcoin Cash City adoption posts. You should be ashamed of yourself for this disgraceful behaviour.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "ia0ekej",
                                                                            "author": "DramaticAd3378",
                                                                            "score": 3,
                                                                            "created_utc": 1653527962.0,
                                                                            "response": "Too bad so sad the only thing you can blame on is the shill account. You should be ashamed of yourself for stepping on people to make to look better",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i9wpzim",
                                    "author": "pleasantmaggie",
                                    "score": 2,
                                    "created_utc": 1653463077.0,
                                    "response": ".... and Craig Write invented Bitcoin.  LOL",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9tiobg",
                    "author": "shitpersonality",
                    "score": -8,
                    "created_utc": 1653407462.0,
                    "response": "The Reed Amendment (8 U.S.C. § 1182(a)(10)(E)), which became law as part of the Illegal Immigration Reform and Immigrant Responsibility Act of 1996, attempted to make people who had renounced citizenship for the purpose of avoiding taxation by the United States inadmissible.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9tunpy",
                            "author": "knowbodynows",
                            "score": 8,
                            "created_utc": 1653412347.0,
                            "response": "And the relevance to this post is...?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}