{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uxou6q",
            "title": "The Largest Crypto Conference in TLV",
            "url": "https://www.reddit.com/r/btc/comments/uxou6q/the_largest_crypto_conference_in_tlv/",
            "author": "ZilviaMcclain",
            "created_utc": 1653506363.0,
            "score": 1,
            "num_comments": 1,
            "subreddit": "btc",
            "selftext": "Thanks to Covid-19 slowly declining, we are gradually able to resume the life we once all knew and loved, which in my case is physical conferences. Don't get me wrong, I did enjoy the virtual conferences, but just not as much. One of the conferences I most looked forward to in these past couple of months has to be the 2022 Israel Crypto Conference taking place on May 23-25, 2022, in TLV based in a hybrid format- which I, like many others, believe is the best of both worlds. We can expect to see over 800 guests attending the event physically, with over 2000 local and international partners joining via live stream.\n\nAs the crypto market grows and develops, we can see its impact on our everyday lives. Those searching for a more passive investment avenue can utilize Cefi or centralized platforms, making cryptocurrency more accessible to those who are either new to the world of decentralized coins or just aren't interested in following the value of their coins full time. Furthermore, motivated entrepreneurs worldwide are bursting with ideas on how to capitalize and develop what is quickly becoming a new virtual universe. Cryptocurrency gives rise to new digital architectures such as NFTs. \n\nWith that said, the ICC (Israel Crypto Community) is sponsoring what will be known as the largest crypto event in the country and provides a platform for panels, presentations, and workshops from many influential players in the industry. The conference will be a unique opportunity to see the landscape of Israeli and international crypto, from the significant players to newer startups with disruptive ideas. \n\nThe following event brings together enthusiasts, builders, experts, and leaders to discuss and collaborate on different topics, such as Defi, crypto regulations challenges, cyber security, NFT, etc. Additionally, there are representatives from various startups, some well-known companies, and investors and venture capitalists participating in panels and networking events. \n\nOne of the event's co-sponsors happens to be Oobit, a financial services and blockchain technology provider, enabling fast, free and seamless payments between individuals and businesses. They recently launched their payment app, which strives to accelerate crypto adoption significantly. Furthermore, the company is currently negotiating with leading CEXs to list their utility token, $OBT, and is expecting an official listing in the upcoming months. They might not be participating in the event this year, but we can expect to see them build and develop connections with their blockchain peers throughout the conference. \n\nBased on everything mentioned herein, we can expect to hear great feedback from the Israel Crypto Conference, coming to an end today. On a personal note, I can say that after tuning in to a few very memorable panels, my love for the crypto industry has only grown, and I can only expect that the Israel Crypto Conference will become an annual event. As for Oobit, you may ask? Well, I truly believe that by next year, they will co-sponsor the event and take part in it, thanks to their recently launched payment app.",
            "stickied": false,
            "comments": []
        }
    ]
}