{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "v17vxm",
            "title": "Davos Forum calls for regulation, hahsrate falls, Bitcoin difficulty",
            "url": "https://www.reddit.com/r/btc/comments/v17vxm/davos_forum_calls_for_regulation_hahsrate_falls/",
            "author": "Breendky",
            "created_utc": 1653939104.0,
            "score": 16,
            "num_comments": 4,
            "subreddit": "btc",
            "selftext": "Among the week's top news stories was that more bankers from around the world have called for bitcoin (BTC) regulation to be accelerated. This, during the World Economic Forum in Davos. \n\nAt the annual conference, which took place from May 25 to 26, a paper called \"Crypto Crash\" was presented in which the current situation of the cryptocurrency market was analyzed from the collapse of Terra.\n\nBut not only this is the main reason for the regularization, there is evidence of large movements of money within different blockchain as in DeFi protocols such as Yearn Finance, OlympusDao, exchanges such as PancakeSwap or even in pre-launch projects such as Minosis Token or LunaFi.\n\nThe bear market is still going on, although the price of bitcoin seems to have stabilized in a range between USD 29,000 to USD 30,000. The cryptocurrency's drop over the past seven days is estimated at 2.6%. At the time of this writing, bitcoin is trading at USD 29,234, as reflected in the market price in Latin America and Spain.\n\n\nWell This week the European Central Bank (ECB) and the US Federal Reserve (Fed) released two surveys showing a substantial increase in bitcoin adoption in their respective territories. The ECB survey revealed that up to 10% of households own bitcoin; while the Fed report indicated that Americans increasingly view the cryptocurrency as a form of investment. For both regulators this increase is worrying, because it increases the risk of interconnectedness between cryptoassets and the traditional financial sector.",
            "stickied": false,
            "comments": [
                {
                    "id": "iakvhq0",
                    "author": "LovelyDayHere",
                    "score": 7,
                    "created_utc": 1653939518.0,
                    "response": "What one can deduce from this is that they always planned to strangle crypto via regulation once they feel the time has come to decommission the legacy fiat currencies whose nations are croaking under unsustainable debt levels.\n\nThey are calling for this now because they have gone on an all-in course of pulling down the existing economic and social order and they do not want a risk of crypto interfering with their plans of CBDC etc.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iam89g5",
                            "author": "ATHSE",
                            "score": 1,
                            "created_utc": 1653963951.0,
                            "response": "Remember the elites plans always require us to want them, they are positioning the world, and thus the economies, to crash or implode so that we beg for the Great Reset to \"fix\" the mess.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iam83lv",
                    "author": "ATHSE",
                    "score": 1,
                    "created_utc": 1653963867.0,
                    "response": "Well CBDC is clearly on the agenda, though in a very real sense, more than 80% of currency is already digital, because the bills in circulation don't even come close to the actual money created as digital loans.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}