{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "usbn3h",
            "title": "How can crypto and the metaverse represent the future when the majority of people are unaware of the metaverse or cryptocurrencies?",
            "url": "https://www.reddit.com/r/btc/comments/usbn3h/how_can_crypto_and_the_metaverse_represent_the/",
            "author": "Fun_Art8013",
            "created_utc": 1652876574.0,
            "score": 0,
            "num_comments": 6,
            "subreddit": "btc",
            "selftext": "Are you aware that the majority of people are unaware of the metaverse or cryptocurrencies, and that cryptocurrencies are not accepted everywhere?  \n\n\nI had never considered this, and I must admit that I was unaware that those of us who are interested in crypto is really a smaller number of individuals than those who don't know anything about crypto, which is pretty bizarre when you think about it.  \n\n\nWe have our \"bubble\" on Reddit where we can express our love about it, but we forget that many people don't have any interest or knowledge in it, and I don't just mean older people, people of all ages use the internet, and many of them aren't interested in it because they think it's rubbish.  \n\n\nI figured it out because when I hear any amazing crypto news, like this week's gas fees being cheap, or about Unicoins and Unicorn companies, or about Moonbirds, or whatever, I don't have many people around me who I could tell about it.  \n\n\nThat's why I'm so grateful for all of our Reddit communities. What is your current situation?  \n\n\nSo, how come some individuals feel that cryptocurrencies represent the future, as well as the metaverse, while a large part of the population is uninterested in it? Maybe all of that is possible in 100 years, who knows...",
            "stickied": false,
            "comments": [
                {
                    "id": "i92hbj2",
                    "author": "Collaborationeur",
                    "score": 3,
                    "created_utc": 1652878950.0,
                    "response": "Here's a famous graph regarding the rate of take-up of tech in the US:\n\nhttps://hbr.org/resources/images/article_assets/2013/11/FELTON-CONSUMPTION--850x441.png\n\nNow consider that this measurement is for a rich western country only - try to extrapolate this to the whole world...\n\n---\n^Source: ^https://hbr.org/2013/11/the-pace-of-technology-adoption-is-speeding-up",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i92db1z",
                    "author": "Aggravating_Deal_572",
                    "score": 2,
                    "created_utc": 1652876821.0,
                    "response": "And again… It took like 20 years from the start of web1 to get where we are now. Bitcoin is only around 14 years old, and Eth only around 7. So massadoption wont happen soon i think",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i92r356",
                    "author": "Shibinator",
                    "score": 2,
                    "created_utc": 1652883533.0,
                    "response": "\"How can the Internet be the future if most people are unaware of it?\" - Commenter in 1990",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i92lbz0",
                    "author": "swgo1",
                    "score": 1,
                    "created_utc": 1652880898.0,
                    "response": "More learn each day.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}