{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uwzhci",
            "title": "Is \"faith in the coin\" the #1 thing which keeps 99.999% of coins alive and which prevents them from crashing to zero? 🤔",
            "url": "https://www.reddit.com/r/btc/comments/uwzhci/is_faith_in_the_coin_the_1_thing_which_keeps/",
            "author": "MountainousFog",
            "created_utc": 1653422164.0,
            "score": 7,
            "num_comments": 28,
            "subreddit": "btc",
            "selftext": "I just watched [this video by ColdFusion](https://www.youtube.com/watch?v=3KZY41SqaTI) and the \"takeaway\" is that no matter how useful, great, or purposeful a coin is -- that all it takes is a lack of faith to bring its value down to zero. Is this **absolutely true** in all cases? If not, is there a single coin out there that has value even though virtually everyone has no faith in it?\n\nThis seems like it could be very exploitable to social engineering attacks by shorting the coin then shilling tons and tons of FUD against the coin and hope it enters a [death spiral](https://www.forbes.com/sites/rahulrai/2022/05/17/the-death-spiral-how-terras-algorithmic-stablecoin-came-crashing-down/).\n\n___\n\n**TL;DR:** Is \"faith in the coin\" the #1 thing which keeps 99.999% of coins alive and which prevents them from crashing to zero? 🤔",
            "stickied": false,
            "comments": [
                {
                    "id": "i9uphib",
                    "author": "2q_x",
                    "score": 17,
                    "created_utc": 1653425262.0,
                    "response": "No.\n\nIt's math. Compounding rates specifically. \n\nBitcoin-like currencies have about a 1.5% annual issuance rate, the FED was increasing the M3 supply 24% annually for the last two years. Inflation will catch up with the dollar in a few years, and the price of coins will catch up when shorts have to cover or rollover their positions—which could be soon.\n\nSince 2017, the US dollar has been diluted 58% in total. And with manipulation, if someone made $330M shorting 100,000 BCH in 2017, it would only take $18M to lock up all the coins they sold and prevent them from doing it again. We basically gain 30x leverage, in hard-currency, without leverage. And that $18M is getting cheaper by the day, like having $11M in 2017.\n\nFor most of the decent currencies, the manipulators are trying to keep the price below the 2017 ATH for two reasons, they want to invoke a death spiral narrative, and two, they don't want to have to recapitalize their initial short position. They can borrow as many coins as they can to short, but eventually that are going to be borrowing coins just to pay back borrowed coins.\n\nWe're moving real money from people who think they have it in a \"custodial\" app, into our own wallets for pennies on the dollar. And we're screaming at the people getting scammed to stop thinking for a moment that those were ever \"their coins\".\n\nDecentralized currencies don't die like companies, the dogecoin squeeze last year is proof of that, if you know what you saw. What hedge funds were doing to companies was appalling, but decentralized projects aren't like companies, they are designed to never stop, the main goal is resiliency against attacks and uptime. If someone is stupid enough to short a decentralized fixed-issuance currency to make a triangle in a hyper-inflationary fiat chart, they're too stupid to have access to sound money. \n\nThe exchanges that loaned ultra-hard currencies didn't know enough math to honor their fiduciary responsibilities.   \n\nThe collective sum of coins that everyone holds in apps like Robinhood, Square, Paypal, Venmo, Coinbase, Kraken, Gemini and Cashapp is exactly zero. We told everyone that again and again. \n\nIf the exchanges bankruptcy claims are denominated in the coins they lost, the amount owed in fiat will never go down.  The Mt Gox hack was $450M at the time, it's $25B today. No exchange that loans coins is going to survive in the long run and none of them will make customers whole.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9vziya",
                            "author": "big--if-true",
                            "score": 3,
                            "created_utc": 1653446495.0,
                            "response": "Wow. What a great explanation.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9wuveg",
                            "author": "jessquit",
                            "score": 4,
                            "created_utc": 1653467400.0,
                            "response": "**Please** write a long form article or post going into more detail about what you just wrote.\n\nThis isn't an area I think deeply about and I would love the deep dive version of this story.\n\nThat said I'm inclined to think OP is right. And if exchanges lose some untold amount of BCH it's still possible that they'll owe less in the future as long as public faith and confidence in the currency continues to drop. Scarcity doesn't mean anything if the scarce thing isn't valued.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9uy9r4",
                            "author": "Shibinator",
                            "score": 10,
                            "created_utc": 1653429071.0,
                            "response": "Next level comment.\n\n/u/chaintip",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9v59ny",
                                    "author": "2q_x",
                                    "score": 9,
                                    "created_utc": 1653432187.0,
                                    "response": "WOW. Thank you kind sir!",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9v6pcz",
                                            "author": "Shibinator",
                                            "score": 9,
                                            "created_utc": 1653432855.0,
                                            "response": "Thank you for the quality insight.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9uyg08",
                                    "author": "chaintip",
                                    "score": 7,
                                    "created_utc": 1653429146.0,
                                    "response": "***\nu/2q_x, you've [been sent](https://www.blockchain.com/bch/address/bitcoincash:qrelay2djf3rq3e4r38p8j530wt9qln9lcx4ev4kga) `0.25495895 BCH` | `~49.90 USD` by u/Shibinator\nvia [chaintip](http://www.chaintip.org).\n***",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9vudpu",
                                    "author": "CurvyGorilla202",
                                    "score": 6,
                                    "created_utc": 1653444066.0,
                                    "response": "As said above - next level indeed. Thank you for the educated response. Very few subs gain the feedback this sub does. The light and truth wins out",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9uw3d4",
                    "author": "ErdoganTalk",
                    "score": 6,
                    "created_utc": 1653428113.0,
                    "response": "I don't like the word faith, as it indicates trust in somebody. A better word is speculation, the thinking that in the future, people will value it.\n\nThis \"is nothing\" thing, is not rational when the fiat people say it. When gold people say it, there is at least the intrinsic, or direct use value, which we don't have.\n\nThe reason why some people say that money is nothing, is that the value it has is not specific. We need some things to complete our lives, grain meat, a jacket, or more generally we need food, clothes and shelter, each of which is value. Money is also value, but so general, that you can also say it is nothing. Money is both nothing, and it is also all of those things.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9uwq6e",
                            "author": "MountainousFog",
                            "score": 3,
                            "created_utc": 1653428393.0,
                            "response": "Thanks for mentioning gold -- I don't see why my argument doesn't apply to gold as well. (other than it has industrial uses in electronic devices)",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9v0581",
                                    "author": "ErdoganTalk",
                                    "score": 7,
                                    "created_utc": 1653429882.0,
                                    "response": "Yes, in my opinion the intrinsic value of gold is of no importance whatsoever. Yes you can save your gold for your family, and it can be used to fill teeth in 200 years. But the value of that is questionable, because you will have to take time into account. You need to reduce the future value of some percentage, for example you can discount it by 3% per year, which could be the average real interest rate. After 200 years it will be 4 dollars left from the current 1800 dollars for an ounce. So obviously, it would be smarter to delay the extraction of that gold to some time closer to its use, which we do with other metals like steel. On the other hand, the market has decided that gold is money, and that makes everything different. The value of gold is mostly monetary, which means that it is a general value that can be exchanged for other things with more specific, and directly useful, value.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9xj9gx",
                    "author": "WippleDippleDoo",
                    "score": 3,
                    "created_utc": 1653484350.0,
                    "response": "Demand > faith\n\nCurrently, most of the demand is speculative, but as the fiat economy continues to race towards complete collapse, utility driven demand will be more and more significant.\n\nThe current state of the market and BTC is unsustainable and the sooner it collapses the best for everyone who values financial sovereignty.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9uy3wp",
                    "author": "Shibinator",
                    "score": 7,
                    "created_utc": 1653429001.0,
                    "response": "Is faith in the USD the only thing that keeps it crashing to 0?\n\nThere's your answer.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9uyrj9",
                            "author": "MountainousFog",
                            "score": 2,
                            "created_utc": 1653429284.0,
                            "response": "I have no faith in the USD -- the federal reserve has a license to print FIAT money that is backed by nothing.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9uzeys",
                                    "author": "Shibinator",
                                    "score": 5,
                                    "created_utc": 1653429565.0,
                                    "response": "There's your answer.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9uzof3",
                                            "author": "MountainousFog",
                                            "score": 2,
                                            "created_utc": 1653429678.0,
                                            "response": "But other people still have faith in the USD.\n\nThere are hundreds of millions of Americans and if I lose my faith in the USD, then the amount of faith in the USD only drops by 0.0000001%",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9v2wq6",
                                                    "author": "Shibinator",
                                                    "score": 9,
                                                    "created_utc": 1653431111.0,
                                                    "response": "Exactly.\n\nAnd when those hundreds of millions lose faith, so does the USD lose value.\n\nJust like crypto. A few or a few million people believe in a given coin, and if they lose faith the coin is worthless.\n\nAll currencies are just proxies for the time of the community that believe in them.\n\n> This seems like it could be very exploitable to social engineering attacks by shorting the coin then shilling tons and tons of FUD against the coin and hope it enters a death spiral.\n\nNow here's where it goes up a level.  The entire crypto industry is the social engineering attack you describe on the USD.  What do you think all the crypto forums and meetups and crypto company ads are?  It's a FUD attack on the USD.  And rising inflation is the start of its death spiral.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9v5oyg",
                                                            "author": "MountainousFog",
                                                            "score": 5,
                                                            "created_utc": 1653432384.0,
                                                            "response": "> Now here's where it goes up a level. The entire crypto industry is the social engineering attack you describe on the USD. \n\nIf this is true, then nothing today will bring me more joy than this statement! 😁",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9v4abw",
                    "author": "Techutante",
                    "score": 5,
                    "created_utc": 1653431739.0,
                    "response": "Look at the stock market.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9uni7v",
                    "author": "sos755",
                    "score": 1,
                    "created_utc": 1653424421.0,
                    "response": "To be fair, that could be said about anything. If people completely lost faith in **water**, it would become totally worthless.\n\nAll currencies are inherently unstable. While a currency may have a range of stable equilibrium, there is always the possibility that something will take it beyond that range and lead to an inflationary or deflationary \"death spiral\". No currency is immune to this, but some are more susceptible than others.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9uxtt9",
                            "author": "173827",
                            "score": 2,
                            "created_utc": 1653428878.0,
                            "response": "If you are in the desert and no one believes in water but everyone believes in btc, which will you sell your body for?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9vh94i",
                                    "author": "sos755",
                                    "score": -1,
                                    "created_utc": 1653437845.0,
                                    "response": "BTC of course.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9ul3ev",
                    "author": "Remora_101",
                    "score": 1,
                    "created_utc": 1653423408.0,
                    "response": "Stockholm Syndrom",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9x5zse",
                    "author": "DragonfruitLarge7805",
                    "score": 1,
                    "created_utc": 1653476766.0,
                    "response": "Gold is real.  You can hold it.  It has industrial value.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}