{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uru1sj",
            "title": "Why was BCH created, when the big block community had the opportunity to join Monero (or other coins)?",
            "url": "https://www.reddit.com/r/btc/comments/uru1sj/why_was_bch_created_when_the_big_block_community/",
            "author": "Graphenist",
            "created_utc": 1652815215.0,
            "score": 0,
            "num_comments": 64,
            "subreddit": "btc",
            "selftext": "Okay, so first of all, full disclosure: I dont own BCH, i dont even like BCH, and I dont ask this as a person who is likely to change either of those things. I am strictly a Monero person, at this time. But I am curious, because BCH encompasses a higher market cap than Monero at this time, and a large portion of liberty-minded individuals. And its just a question Ive never thought to ask straightforwardly. (Also this doesnt have to be strictly about Monero, there were other coins at the time too like Dash, but I want to focus on Monero.)\n\nMonero was created in 2014, BCH 3 years later in 2017. \n\nIf this isnt a strawman, I believe the *sole* or at least *main* reason for forking was to increase the blocksize limit, to allow for onchain scaling. Okay. But Monero already solved this problem with the automatic blocksize limit. And this is a particularly novel solution, because it solves both sides of the equation: It prevents spam by keeping the ceiling close to usage, and it prevents consensus failure of increasing the limit in the future, since its automatic.\n\nNow I could just stop here, because the blocksize limit seems to be the main point of contention in BCH. If so, how did Monero not fix it? Why was BCH needed?\n\n(And its not like Monero is some random coin, its been *the* privacy coin, *the* darknet coin, and *the* cryptoanarchist coin for years. Fair distribution, adoption, and strong track record.)\n\nI dont want to go on a long spiel detailing every reason why i think Monero solves every importantly solvable blockchain problem ever, because im sure i will have plenty of time engage with such ideas in the comments. But I would like to generally know why 1) You did not want to join Monero instead of create BCH and 2) Why your preference still lies with BCH?\n\nHeres some examples of responses:\n\nA) Didnt know Monero existed (and still doesnt? idk)\n\nB) Ideologically opposed to privacy by default?\n\nC) It *has* to be Bitcoin? (Leftover maximalism type of feelings? Or emotional attachment?)\n\n\nIdk this really all that comes to me at the top of my head. Im having a hard time imagining what the reasons could be.\n\nFeel free to list 1 to 3 solid reasons. Nonnegotiables. Please no \"I like Monero too i just like BCH more\" responses with no substantiation, i would like cold hard data. If you have a criticism of Monero, give it to me hot. \n\nAlso please avoid long lists of negotiables, with no single strong reason (nonnegotiable) tying it all together. Creating a long list of loosely cohesive reasons for something is usually argument with poor structural integrity, aka coming up with reasons to meet parity with ones feelings.\n\nAnyways, interested to hear the responses.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8zjjoc",
                    "author": "GETSOME88-007",
                    "score": 23,
                    "created_utc": 1652817460.0,
                    "response": "Great question! I chose BCH vs Monero because:\n\n1. BCH Has limited supply (BCH=21million max,      Monero=unlimited supply)\n\n2. BCH has incredible DEFI / SMART CONTRACT\n Potential via SMARTBCH \n\n3. BCH has the wide spread branding of “Bitcoin”\n\n4. Monero blockchain doesn’t seem as secure as Bitcoin’s due to Monero’s “dandelion++” transaction broadcast system\n\nhttps://cryptopotato.com/monero-xmr-sybil-attack-not-broken/",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8zfoqp",
                    "author": "Remora_101",
                    "score": 19,
                    "created_utc": 1652815869.0,
                    "response": "For the same reason the people didn't change from BTC to Monero between 2014 and 2017. 🤷‍♂️\n\nI'm sure people left for other projects during the scaling wars. We saw the same in later forks. But there were still enough people believing in the original goal to keep it going.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8zgje1",
                            "author": "Graphenist",
                            "score": -3,
                            "created_utc": 1652816217.0,
                            "response": "So in your view, joining BCH wasnt even joining another project? If you sold BTC for BCH, that didnt feel like moving from one project to another?\n\nOkay, but objectively, id argue that it was. So is this it, or is there more to your reasoning?\n\nAlso, lots of BTC people joined Monero. Obviously not most, but, many vocal cryptoanarchist supporters.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8zh7jz",
                                    "author": "Remora_101",
                                    "score": 15,
                                    "created_utc": 1652816491.0,
                                    "response": ">So in your view, joining BCH wasnt even joining another project?\n\nAbsolutely not. BTC maxis used censorship and bigger numbers to spread that narrative, but if you look at the tech BCH is actually a p2p electronic cash system, while BTC is not. BCH is a continuation. \n\n\n>So is this it, or is there more to your reasoning?\n\nPersonally, I came in right after the fork. When I looked at monero a few things didn't sit right with me. I do not like the tail emission or the how they handled the blocksize. Also default privacy is a mixed bag. \n\nBCH is my #1 coin. Monero #2 if they don't make it and nothing better comes along  than the revolution failed.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i90d1tx",
                                            "author": "54545455455555",
                                            "score": 2,
                                            "created_utc": 1652830448.0,
                                            "response": "I'm just like you! BCH is #1 by far, then I hold some XMR for back up and anything else is just a gamble.\n\nFunny how confused people are, we have two coins, one for daily usage, one for secure transactions, BCH and XMR are borthers in arms.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i8zis0a",
                                            "author": "Graphenist",
                                            "score": -4,
                                            "created_utc": 1652817140.0,
                                            "response": "> Personally, I came in right after the fork.\n\nOkay, so this *does* imply that you made a conscious choice to choose BCH above XMR, as you did not simply descend from BTC prefork. But maybe your point will work for others. Fair? \n\n> I do not like the tail emission\n\nI am interested to talk about this. What do you dislike about having a stable supply equilibrium, or what makes you prefer deflation / eventual degradation of coins and erosion of divisibility?\n\nI used to not understand or appreciate a tail emission myself, until i learned its not \"inflation\" if its linear and there exists coin loss. This might require some math to understand.\n\n> or the how they handled the blocksize\n\nCan you clarify? You dislike an automatic limit? Why exactly?\n\n> Also default privacy is a mixed bag.\n\nDo you see any significant disadvantages besides a few less CEXes not listing it?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8zltxx",
                                                    "author": "Remora_101",
                                                    "score": 11,
                                                    "created_utc": 1652818405.0,
                                                    "response": "As most I bought BTC, but that shit didn't work read about BitcoinCash which made a whole lot more sense and switched. Read about XMR later and decided to stay with BCH.\n\n\n>I am interested to talk about this. What do you dislike about having a stable supply equilibrium, or what makes you prefer deflation / eventual degradation of coins and erosion of divisibility?\n\nWe had inflation for like forever. Lets try a deflationary currency and see if we can come up with an economy that isn't based on exponential growth that eats the planet alive.\n\nAnd 0 emission at the end is a stable state. If you introduce tail emission or burn I guarantee you there will be discussions fights and politics to change it. And it will be fought dirty.  \n\n>eventual degradation of coins and erosion of divisibility?\n\nNot a problem.\n\n\nThe automatic limit is an artificial limit on the blocksize and therefore an artificial prop up of fees. If it exists there will be discussions on the size and the same problem arises as above. And the more people use the  chain the more expensiv it gets, cutting off the poorest of us.\n\n>Do you see any significant disadvantages besides a few less CEXes not listing it?\n\nOptions are always better. Besides the risk of hidden inflation bugs, there is the need for transparent transactions. On BCH the privacy is optional but easy to achieve. I like this a lot more.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i90t7j0",
                                                            "author": "Graphenist",
                                                            "score": 2,
                                                            "created_utc": 1652838129.0,
                                                            "response": "> We had inflation for like forever.\n\nMonero does not have inflation. It has supply equilibrium.\n\nAt any linear emission *n*, the percentage of annual burned coins will eventually reach parity with *n*. I can prove this mathematically. Linear emission is not inflation.\n\n> And 0 emission at the end is a stable state. If you introduce tail emission or burn I guarantee you there will be discussions fights and politics to change it\n\nIf you \"introduce\" it, sure... If it was always there, no. It doesnt matter what the emission rate is so long as its unchanging. Much like it doesnt matter what the supply is so long as its consistent.\n\n> Not a problem.\n\nOkay then how are you replacing lost coins? In 300 years do you plan to perform a global hard fork to extend or move the decimal place?\n\n> The automatic limit is an artificial limit on the blocksize and therefore an artificial prop up of fees. If it exists there will be discussions on the size and the same problem arises as above. And the more people use the chain the more expensiv it gets, cutting off the poorest of us.\n\nOof theres a lot to unpack here. Lets take it one by one...\n\n> The automatic limit is an artificial limit on the blocksize \n\nAnd setting the limit at 32 megabytes by a cabal of developers isnt artificial? And i will have to disagree, an automatic limit implies it is natural.\n\n> and therefore an artificial prop up of fees.\n\nMaybe slightly, to reduce spam, but Monero transactions are still cheap, oftentimes under a penny.\n\n>  If it exists there will be discussions on the size and the same problem arises as above.\n\nWhat?!? No there wont. Its an automatic limit. You dont have to touch it ever. The Monero network will automatically scale as needed, while preventing spam.\n\n> And the more people use the chain the more expensiv it gets, cutting off the poorest of us.\n\nNo because the automatic limit would just expand dude.\n\n> Options are always better.\n\nPersonally i would not reccomend someone use a KYC CEX ever.\n\n> Besides the risk of hidden inflation bugs, there is the need for transparent transactions.\n\nI dont think there can be any hidden inflation bugs. The cryptography is testably verifiable. And Monero supports transparent transactions via view keys.\n\n> On BCH the privacy is optional but easy to achieve. I like this a lot more.\n\nIt doesnt have any decentralized privacy though. Cashfusion, if thats the privacy you speak of, is a centralized serverside coinmixing service, and everyone knows mixing can only obfuscate your origin, not protect future transactions from being linked to each other.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i91wlvb",
                                                                    "author": "Remora_101",
                                                                    "score": 1,
                                                                    "created_utc": 1652864428.0,
                                                                    "response": "I disagree. I told you my viewpoint and I have no desire to continue this discussion. I have done it too often. \n\nStay with monero and build. I'll do the same with BCH. Good luck.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i9069bt",
                                    "author": "Collaborationeur",
                                    "score": 15,
                                    "created_utc": 1652827233.0,
                                    "response": "I joined Bitcoin even before Monero was created and very strongly feel that the BCH side of the 2017 fork is the continuation of that project and the BTC side is a radical change of direction.\n\n**BCH is what I signed up for in 2011.**\n\n----\n\nThe block size narrative of the BTC proponents were \n\n* that Satoshi was wrong and a 'fee market' had to be introduced by capping the blocksize\n* a market for 2nd layer scaling protocols had to be forced into existence by making this blocksize limit extremely small\n\nThis change was forced upon me in 2017 by the Bitcoin developers, fortunately others here arranged for the BCH fork to be viable :-)\n\n---\nedit: \nSorry to see you downvoted for asking questions,\n\nduring the scaling wars adaptive blocksize cap has been discussed and is currently explicitly implemented in BCH by economic forces (a mining parameter) rather than a formalized hard-coded consensus rule as Monero has.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i90d5h2",
                                            "author": "54545455455555",
                                            "score": 5,
                                            "created_utc": 1652830498.0,
                                            "response": "Agree! I joined in 2012 and BCH is Bitcoin, simple. BTC is a digital Ponzi scheme, not Bitcoin",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i91q1zl",
                                            "author": "cheaplightning",
                                            "score": 5,
                                            "created_utc": 1652858373.0,
                                            "response": "This. The end.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i90cqn0",
                                    "author": "54545455455555",
                                    "score": 4,
                                    "created_utc": 1652830299.0,
                                    "response": "I've been in Bitcoin since 2012, and I still am, period, that's it. Its so simple but people like you put your head in the sand, ignore reality the act confused by people who do live in the real world.\n\nLouder for the trolls in the back now:\n\nBTC IS NOT BITCOIN.\n\nJust because you have been taken in by the Blockstream (Samson Mow) marketing scheme doesn't change the facts. BCH is Bitcoin, BTC is not, anyone who doesn't understand that is either an idiot or a scammer.\n\nI've used Monero from very early on and still do but Bitcoin is far superior for day to today usage and ive never had any reason to switch.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i90qgfo",
                                            "author": "Graphenist",
                                            "score": 0,
                                            "created_utc": 1652836838.0,
                                            "response": "> BTC IS NOT BITCOIN.\n\n> Just because you have been taken in by the Blockstream (Samson Mow) marketing scheme doesn't change the facts. BCH is Bitcoin, BTC is not, anyone who doesn't understand that is either an idiot or a scammer.\n\nBTC is listed as \"Bitcoin\" on... Bitcoin(dot)com, blockchain(dot)com, Kraken, Gemini, Coinex, hundreds of other exchanges, coinmarketcap, coingecko, Bitpay, and pretty much anywhere else you look.\n\nIm sorry, if this doesnt meet your definition of a thing being Bitcoin, then im not sure we are eye-to-eye on how the definition of words is supposed to work.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i919w1b",
                                                    "author": "54545455455555",
                                                    "score": 7,
                                                    "created_utc": 1652846601.0,
                                                    "response": "That is correct, the vast majority of people are wildly confused about what Bitcoin is. For the record, Bitcoin is a peer to peer electronic cash system, BTC is not that.\n\nAgain, most people, most of the time, have no idea what is going on around them or what they are talking about.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i91opak",
                                                            "author": "Graphenist",
                                                            "score": 0,
                                                            "created_utc": 1652857205.0,
                                                            "response": "Go ahead, you can accept BCH, and call it \"Bitcoin\" or even \"BTC\". But when they send you real Bitcoin and you dont recieve any BCH, you cant blame the customer. \n\nIf youre \"right\", then whats stopping you? You dont think youd be frauding anybody, do you?",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8zn77v",
                    "author": "mrtest001",
                    "score": 17,
                    "created_utc": 1652818973.0,
                    "response": "We wanted \"Bitcoin\" with low-fees (ie big blocks).  \n\nMonero is NOT \"Bitcoin\".\n\nI cannot explain it more simply than that.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i915w73",
                            "author": "Graphenist",
                            "score": 4,
                            "created_utc": 1652844347.0,
                            "response": "I just dont understand your thought process though. Why do you care about Bitcoin? You care about Bitcoin BECAUSE its Bitcoin? Bro this doesnt even make sense, its circular reasoning in action.\n\nI respect your feelings though. If you want Bitcoin, have Bitcoin.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i91u2li",
                                    "author": "Shibinator",
                                    "score": 2,
                                    "created_utc": 1652862016.0,
                                    "response": "> You care about Bitcoin BECAUSE its Bitcoin? \n\nYes.\n\nBitcoin has a brand name, narrative story and believable credibility as a currency for the entire planet.\n\nMonero doesn't.\n\nNo matter how you slice it up and whatever arguments you use, Bitcoin was the first and a global phenomenon, Monero is a knock off like Litecoin or Dogecoin.  That's just the truth of how people understand things, and it can't be reversed.  Yes, I understand you might like Monero better, but you care about Monero because it's Monero it seems, just like we care about Bitcoin.  And the pool of people that cares about Bitcoin is titanic and growing at a faster rate than Monero, that's all there is to it.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i918b4h",
                                    "author": "phillipsjk",
                                    "score": 1,
                                    "created_utc": 1652845688.0,
                                    "response": "I definitely used Monero as a hedge, but still prefer BCH.\n\nMonero offered one thing that BCH at the time lacked: privacy. [Over] the years coinfusion was developed: allowing privacy on the BCH chain. \n\nI also concluded that [the whole bytecoin/cryptonote](https://bitcointalk.org/index.php?topic=740112.0) thing can be adequately explained as a NSA honeypot set up after the arrest of Ross Ulbricht in 2013. Greed did not adequately explain the *very steep* emissions curve, resulting in an 80% pre-mine for me. However it makes sense if you want to be able to claim than it was invented before the shut-down of Silk Road. Controlling 80% of the transactions on the network would also allow a TLA to decode the transaction graph: since they would know which transactions are decoys most of the time. The NSA [loves doing shit where they have access, but can cryptographically prove others do not](https://en.wikipedia.org/wiki/Dual_EC_DRBG).\n\nUnlike others in this thread, I actually *like* the \"tail emission\", and would not be opposed to adding it to Bitcoin eventually. Some people are wedded to the \"fixed cap\" though.\n\nThere is also the matter of Bitcoin having better mobile wallet support. Though I guess light wallets are possible if you share a \"view key\" with the server you are using. In practice, any host serving your electrum based, or even SPV-based wallet will have your transaction history anyways.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i923nyt",
                                            "author": "LovelyDayHere",
                                            "score": 1,
                                            "created_utc": 1652870591.0,
                                            "response": "Reddit nuked your comment due to Bitcoin Talk link - restored",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i93h7hc",
                                    "author": "mrtest001",
                                    "score": 1,
                                    "created_utc": 1652894251.0,
                                    "response": "i see your point.\n\nMy thinking is that Bitcoin invented crypto.  It is really really good at being trustless cash.\n\nVery few coins have fundamentally added anything new.\n\nETH brought smart contracts, fair enough.\n\nMonero is super private, good addition.\n\nEvery other coin basically changed the coin count, played with the block time, added some variations like \"satellite validators\" - just variations on a theme.\n\nThe Bitcoin design is low-level optimized p2p cash. and nothing is better at p2p cash than Bitcoin - not eth, not monero.\n\nBut its not even fair to compare it to eth or monero - those coins are solving different problems.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8zlk17",
                    "author": "2q_x",
                    "score": 11,
                    "created_utc": 1652818292.0,
                    "response": "Before the block size wars, bitcoin could be used in places with spotty internet and rolling blackouts. Some of us didn't change communities or projects, we were ousted.\n\nIn 2017, Monero was still in a state where there was no easy way to use it without trusting a website or downloading a full blockchain. Cakewallet didn't exist (?).\n\nDownloading a full blockchain, while traveling, was the deal-breaker for me.\n\nIt looks like it's getting much better. And they seem like a good group of people.\n\nIn general, consider the practice of valuing anything by it's fiat market value. The Federal Reserve has increased the M3 monetary supply 50% in the last three years, and it CAN'T stop, because they're trying to print themselves out of a 40x leverage crisis. We haven't started to see the 24% inflation that comes from increasing the monetary supply 24% a year, it's on a three year lag.\n\nIf you want to be rich, identify structural problems in the market that cause certain assets to be over-valued while others are undervalued. \n\nYou know from Monerun that a large number of exchanges have lent their coins, presumably to shorts. The first project, or group of projects, that band together to exploit that structural problem will have more fiat value than could ever need—if they wanted fiat whatsoever in a hyper-inflationary period.\n\nThe downside loss potential from shorting 100 XMR is greater than the current fiat market cap of the entire crypto market. \n\nPresently, the exchanges in question can simply suspend all XMR withdraws and stop a squeeze. They won't go to Kraken and buy real coins to cover their users because they know some Monero users decide to wait it out. \n\nConsider how BCH can be useful to the Monero community with it's current predicament. Does Binance, et al, allow BCH withdraws? Can users get assets off insolvent exchanges with BCH, LTC, BTC & ETH and then swap back using haveno?\n\nThe structural issue of naked-shorting in crypto is manipulating the price and it's not something that can be solved by one community acting alone.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8zw1ga",
                    "author": "Pablo_Picasho",
                    "score": 9,
                    "created_utc": 1652822677.0,
                    "response": "I have nothing against Monero, but Bitcoin Cash was created to continue the peer to peer electronic cash blockchain that espouses the fundamental economic and open source principles that were started by Bitcoin. And to do it while preserving the stakes of those who invested a lot in Bitcoin (unless of course they opted to sell, which they could after the fork).\n\n> I would like to generally know why 1) You did not want to join Monero instead of create BCH and 2) Why your preference still lies with BCH?\n\n1) why should we lose our investment in Bitcoin just to continue with Bitcoin?\n\n2) BCH, continuing p2p cash, still has many advantages over Monero. I'm not going to bore with details here, and Monero certainly has an advantage for those that want on-by-default, opt-out privacy.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i90tuw8",
                            "author": "Graphenist",
                            "score": 1,
                            "created_utc": 1652838427.0,
                            "response": "> Bitcoin Cash was created to continue the peer to peer electronic cash blockchain that espouses the fundamental economic and open source principles that were started by Bitcoin\n\nSo was Monero, and Monero did it first.\n\n> And to do it while preserving the stakes of those who invested a lot in Bitcoin \n\nNot really, seeing as how the value fell... How much again? You wouldve been about four orders of magnitude better off buying Monero. I dont think this is a coincidence. The market is actively pricing utility to the best of its ability, despite the scams infesting our space.\n\n> 2) BCH, continuing p2p cash, still has many advantages over Monero.\n\n...Like? Go ahead and bore me. I can read it if you can write it...",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i91u79w",
                                    "author": "Shibinator",
                                    "score": 3,
                                    "created_utc": 1652862137.0,
                                    "response": "> So was Monero, and Monero did it first.\n\nLol no Bitcoin did it first, and BCH is Bitcoin.\n\n> 2) BCH, continuing p2p cash, still has many advantages over Monero.\n\nhttps://bitcoincashpodcast.com/faqs/BCH/why-bitcoin-cash",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i92ybe9",
                                            "author": "Graphenist",
                                            "score": 1,
                                            "created_utc": 1652886592.0,
                                            "response": "> Lol no Bitcoin did it first, and BCH is Bitcoin\n\nNo its not. Its an arbitrary fork at an arbitrary time made by an arbitrary group of people with arbitrary parameters without consensus of the Bitcoin community and it doesnt even carry the name anywhere you go.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i932820",
                                                    "author": "Shibinator",
                                                    "score": 1,
                                                    "created_utc": 1652888196.0,
                                                    "response": "You claim to be curious and open to learning, but then dismiss all education as soon as you receive it.\n\nEnjoy staying stuck in your preexisting confused beliefs.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i933xhx",
                                                            "author": "Graphenist",
                                                            "score": 1,
                                                            "created_utc": 1652888893.0,
                                                            "response": "Enjoy your cult.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i91z33u",
                                    "author": "Aggravated-Bread489",
                                    "score": 2,
                                    "created_utc": 1652866723.0,
                                    "response": "> So was Monero, and Monero did it first.\n\nMany people in this sub consider BCH to be the original Bitcoin dating back to 2008. \n\nOthers can correct me if I'm wrong, but the only reason BTC got to keep the ticker is because (I think) small blockers had control of the Git repository and booted out Gavin Andresen (a big blocker and the one Satoshi passed the torch to).\n\nSo even though BCH needed a new ticker, the change was simply to increase the block size which Satoshi said was inevitable and the person he handed the keys to wanted to implement.\n\nSo yes, BTC is Bitcoin, but people here believe that BCH is also Bitcoin and at some point we will be able to drop the \"cash\" suffix.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i924o69",
                                            "author": "LovelyDayHere",
                                            "score": 2,
                                            "created_utc": 1652871346.0,
                                            "response": "> the only reason BTC got to keep the ticker is because (I think) small blockers had control of the Git repository\n\nNo, not the only reason, though it may have played some part...\n\nMajor exchanges played a bigger role.\n\nThey wouldn't list the forked coin unless it implemented replay protection. (Oddly, they didn't put this requirement on many subsequent forks!)\nSentiment was not in favor of a naked \"hashwar\" between BTC and BCH, potentially destroying the value of both in the process. Miners didn't want that, obviously.\n\nBCH also had to make provision for potentially having a lower hashrate (ie. being a minority hashrate chain), for despite having large community support, it's support among the mining pools was mixed. Definitely not a clear majority who were willing to put money into this fight of ideals.\n\nThe new name 'Bitcoin Cash' was proposed by a supporting exchange / mining company and accepted as a way to distinguish from the incumbent coin while drawing attention to the perceived function of this system.\n\nThe opponents tried to make life difficult by pushing the re-branding to 'bcash' which failed. Still, I think even some exchanges listed it as that.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i936git",
                                            "author": "Graphenist",
                                            "score": 1,
                                            "created_utc": 1652889921.0,
                                            "response": "> Many people in this sub consider BCH to be the original Bitcoin dating back to 2008.\n\nI can see that, but its so wrong.\n\n> Others can correct me if I'm wrong, but the only reason BTC got to keep the ticker is because (I think) small blockers had control of the Git repository \n\n\"The\" Git repository? Think about your words. What makes it \"The\" Git repository? Its \"The\" Git repository because thats what the overwhelming consensus of nodes (including miners, users, and exchanges) are using. \n\nAt the end of the day, BTC kept the ticker because thats what the consensus of the community wanted, and it kept the higher price for the same reason.\n\nSatoshi nor Gavin ever had control of the Github. Development happened outside, Gavin became inactive, and a group of members of the community decided to move to Github. The community just decided to follow, autonomously.\n\n> and booted out Gavin Andresen (a big blocker and the one Satoshi passed the torch to\n\nThis is a common lie told in BCH. Nobody booted Gavin out of anything. Nobody took any power away from him. He stopped being active and the community moved on without him. Its not like Bitcoin uses some democratic voting enclave that would allow developers to forcibly eject each other.\n\n> So even though BCH needed a new ticker, the change was simply to increase the block size which Satoshi said was inevitable and the person he handed the keys to wanted to implement.\n\nIronically, when the BCH fork finally happened, it didnt even have enough usage to warrant a 1 mb blocksize much less 8 or 32 megabytes. I guess it wouldve been pretty bad PR though to fork and not immediately increase it.\n\n> So yes, BTC is Bitcoin, but people here believe that BCH is also Bitcoin and at some point we will be able to drop the \"cash\" suffix.\n\nWill never happen. This would result in fraud, lost coins all over the board. You HAVE to specify what you are using. And theres no imaginable timeline where BTC just rolls over, dies, and stops existing. BCH could flippen it, but BTC would still exist. And if it did happen BSV and other scams will be fighting you for it.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i93b2hv",
                                                    "author": "Aggravated-Bread489",
                                                    "score": 1,
                                                    "created_utc": 1652891798.0,
                                                    "response": "I can't logically argue with your points (maybe others can), but from going through the experience of the block size wars, it seems obvious to me that BCH is the original Bitcoin. But I understand why people outside of this community would argue otherwise.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i93cnvb",
                                                            "author": "Graphenist",
                                                            "score": 1,
                                                            "created_utc": 1652892430.0,
                                                            "response": "> but from going through the experience of the block size wars, it seems obvious to me that BCH is the original Bitcoin.\n\n...Why?\n\nAmaury and ftrader, two random nobodies, on a random day, picked a random time to fork the Bitcoin blockchain, changed a parameter arbitrarily, did not get the consensus of the Bitcoin community, and created a spinoff of Bitcoin with a new name that got immediately market manipulated (huge pump and dump) and you think this is the REAL Bitcoin???\n\nIf i did exactly what Amaury and ftrader did, forked the Bitcoin blockchain, raised the blocksize limit, yada yada yada... Would my spinoff be the \"Real Bitcoin\" too? If you say yes, thats a problem, if you say no, theres really no consistent reason you could give me why, as BCH was not the first effort to fork the Bitcoin blockchain. Lesser known, arguably failed projects did it too. And arguably BCH is somewhat failed as well, given its market cap collapse in the past few years...",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i90binx",
                    "author": "mk112ning",
                    "score": 7,
                    "created_utc": 1652829712.0,
                    "response": "We are not the big block community, you knocked the wrong door. This is just a regular forum with reasonable people.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i90dc80",
                            "author": "54545455455555",
                            "score": 4,
                            "created_utc": 1652830588.0,
                            "response": "We'll put!\n\nIts hilarious people think we all love BCH but truth is if you don't censor people BCH just comes up a lot because it works",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i91pdkt",
                                    "author": "Graphenist",
                                    "score": 1,
                                    "created_utc": 1652857772.0,
                                    "response": "No, its because all the mods are BCH supporters and literally one of the rules says no heavy altcoin discussion",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8zvtqi",
                    "author": "big--if-true",
                    "score": 6,
                    "created_utc": 1652822587.0,
                    "response": "BCH transactions are smaller so it scales better. Monero only needed if you require anonymity but it comes at a price of increased blockchain size.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i90ln1m",
                            "author": "tl121",
                            "score": 6,
                            "created_utc": 1652834567.0,
                            "response": "XMR seems to use at least ten times the resources per transaction as does bitcoin or bitcoin cash.  Bitcoin cash has been specifically engineered for scaling but this has not been done for XMR.  The user experience with XMR is distinctly inferior to that of BCH running ElectronCash.  \n\nIn addition to the 10x cost for incremental privacy, XMR does not appear to support an effective SPV user experience in the form of a quick user agent spin up.  Perhaps this is just a lack of mature software, but more likely, there are serious tradeoffs between privacy and efficiency.   (These also exist with BCH unless you run or otherwise have access to a trusted node.) There is also no ability to spend unconfirmed transactions with XMR.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i91q414",
                                    "author": "Graphenist",
                                    "score": 1,
                                    "created_utc": 1652858421.0,
                                    "response": "> XMR seems to use at least ten times the resources per transaction as does bitcoin or bitcoin cash.\n\nIn return for privacy. And its way more efficient than mixing your coins every transaction.\n.\n> In addition to the 10x cost for incremental privacy,\n\nIncremental?!? Monero fully delinks every transaction from each other, and hides sender, receiver, and amount. Its three+ layers of state of the art privacy.\n\nAs opposed to cashfusion which is just a hyped up coinmixer living on Jonald Fyookballs personal server. Go ahead, prove to me its not backdoored. Prove to me the FBI cant gag order Jonald into backdooring it. Having a centralized privacy solution creates a myriad of problems.\n\n> there are serious tradeoffs between privacy and efficiency\n\nYep, and yet i choose to use TOR everywhere i go on principle, while the normies do not. Privacy requires extra steps, extra energy... But privacy is a requirement for freedom.\n\n> There is also no ability to spend unconfirmed transactions with XMR.\n\nWell, okay... Is this a big deal though? Who does this? Also im okay with payments that has hardened security and privacy in return for fancy features very few people use...",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i91uagd",
                                            "author": "Shibinator",
                                            "score": 4,
                                            "created_utc": 1652862222.0,
                                            "response": "> while the normies do not.\n\nExactly.\n\nThe normies don't, and never will, care about Monero.  Maybe you like it, but normies don't give a single fuck.  They want Bitcoin, and the network effect will do the rest.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i92nito",
                                            "author": "tl121",
                                            "score": 1,
                                            "created_utc": 1652881921.0,
                                            "response": "Monero does not *fully* delink transactions.  A source transaction and a sink transaction are connected by a path on the blockchain.  Two totally unrelated transactions may or may not be.  While a single transaction may not not provide evidence at the level of probable cause repeated usage will eventually reach reasonable doubt stage.\n\nInability to send funds from unconfirmed change transactions back in 2011 was my first experience with Bitcoin not working.  Immediately, it was clear that lack of confirmation was not just a matter for the paranoid.  Since I knew why my funds weren’t available I knew that I would eventually get them back, but normies who have no clue might think otherwise.  With Monero as it is today it would not be possible to reliably replicate the numerous video demonstrations of bitcoin cash usage that Roger Ver and others do.\n\nIf a coin is not easy and cheap to use for every day usage then users who need privacy for some purposes create red flags.  They also need more moves, which complicates their opsec and increases the risk of exposure due to cockpit error.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i92wlir",
                                                    "author": "Graphenist",
                                                    "score": 1,
                                                    "created_utc": 1652885880.0,
                                                    "response": "> Monero does not fully delink transactions. A source transaction and a sink transaction are connected by a path on the blockchain\n\nAnd yet i dont think anyone is able to crack Monero despite this. Monero is private enough that it will protect normies in their day to day lives and experienced users know how to use it even more privately. Perfection is the enemy of good. Just because Monero only gives you a ~99.9% confidence that txs are unlinkable doesnt mean you may as well forget privacy...\n\n> Inability to send funds from unconfirmed change transactions back in 2011 was my first experience with Bitcoin not working.\n\nYeah, but whats a usecase though? \n\n> If a coin is not easy and cheap to use for every day usage then users who need privacy for some purposes create red flags.\n\nRight... Unless you use privacy for everything all the time, then it becomes less suspicious, and more of a general rebellion.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i932w39",
                                                            "author": "tl121",
                                                            "score": 1,
                                                            "created_utc": 1652888468.0,
                                                            "response": "Here is a normi use case requiring unconfirmed transactions.  A user has one coin in his wallet containing sufficient funds for a day’s shopping at several stores in a mall.  He goes into the first store and spends a small amount.  He then walks to the next store, attempts to make a second purchase.  This fails because the wallet has no spendable funds.  The user has to wait for confirmations.  \n\nEven worse, sometimes this scene plays out OK because of timing or multiple coins in the wallet.  This makes it obvious the crypto currency is unreliable, a reputation that will linger even should the problems be fixed or minimized by improvements to node or wallet software.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i934jd2",
                                                                    "author": "Graphenist",
                                                                    "score": 1,
                                                                    "created_utc": 1652889142.0,
                                                                    "response": "Yeah, so this is a problem in Monero. But theres an easy self fix, and thats to send \"change amount\" of coins to yourself to break them up before you go shopping.\n\nWallets can obviously do this automatically, im just not sure theres enough people complaining about it to warrant it...\n\nIf you were using Monero *all the time* and you received many different coins to the same wallet, your funds would probably already be broken up into change. Its the investor with a giant lump sum that runs into this problem...",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i93lasx",
                                                                            "author": "tl121",
                                                                            "score": 1,
                                                                            "created_utc": 1652895902.0,
                                                                            "response": "This is an acceptable workaround for the wealthy,  but not those closer to  “hand to mouth”.  Even the wealthy will experience this problem if they keep the bulk of their funds in off-line wallets, or just experimenting with a new crypto currency.  \n\nIn doing experimentation I have followed the practice of envisioning problems and seeking out problematic situations where various computing systems were likely to fail and have a talent for finding and enjoying problems.  This was a useful skill when managing a group of researchers, architects and developers.\n\nI have not yet figured out whether it is possible to scale Monero at linear cost, as I know is the case with bitcoin cash.  The approximate 10x size and processing overhead (probably increasing when more decoys are added at the next hard fork) is not my concern.  My biggest concern is whether or not it is possible to fully parallelize transaction processing and fully shard the databases, as can be done with bitcoin cash.  In addition, I am concerned that SPV user interfaces will lack privacy unless a user has a trusted node.  (This is also a problem with bitcoin cash, but bitcoin cash is not marketed as a privacy coin.)  \n\nI only started looking into privacy coin technology recently, thanks to Canada’s fascist dictator and his confiscation of trucker funds, so I have been busy refreshing my knowledge of “state of the art” cryptography only recently.  Until I fully understand the technology presently available I am not sure what the possibilities and limitations are.  I have been looking at both XMR and ZEC.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i908ln1",
                    "author": "Shibinator",
                    "score": 5,
                    "created_utc": 1652828331.0,
                    "response": "https://bitcoincashpodcast.com/faqs/bch/why-bitcoin-cash\n\nhttps://bitcoincashpodcast.com/faqs/Cryptocurrency/what-about-monero-xmr",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i91441d",
                    "author": "Aggravated-Bread489",
                    "score": 5,
                    "created_utc": 1652843420.0,
                    "response": "First of all, I've been lurking through these conversations. Thanks for making this post and asking these questions. It's too bad you are getting down voted so much because you've made some good points and have had a fair discussion.\n\nI was a Bitcoin owner prior to the block size wars. I didn't even know I was a big blocker until after the split. I couldn't weed through the propaganda and theoretical arguments so I just held steady until things worked themselves out. My goal was to have magic internet money that could be sent to anyone for a very low fee without being censored. If I remember correctly, even BTC promised that this was their solution with SegWit2x to increase transaction efficiency and block size. So I didn't now who to believe. Fast forward and it became clear to me that the BTC camp was wrong and BCH kept their promises. Turns out that I was a BCHer the whole time (even pre 2017).\n\nNow to answer your questions. I currently hold more BCH than XMR, but I am equally a fan of both projects. But I didn't get into XMR until recently. Why did I choose BCH?\n1. I didn't know about XMR\n2. When I finally did learn about XMR, I thought it was just for drug dealers. I didn't even know how to get it. (I used coinbase)\n3. One concern with privacy by default is I assumed there was a higher risk of being banned by governments. Still is, but I dont care about that anymore. Good riddance to them.\n\nNow onto the reasons why I am still pro BCH and not a Monero maxi. \n4. I think the ease of use of BCH is much better than XMR. 0-conf in BCH works just like PayPal. Transaction sent, phone pings, funds received, and you can send them again instantly. \n5. Scalability - BCH has SPV nodes which allows anyone to verify if a transaction is valid without relying on a central server or downloading the whole block chain. It is even more efficient than pruned nodes. If you aren't familiar with SPV nodes, check it out. I don't think this would be possible in Monero based on how the block chains work. \n\nEdit: 6. I forgot about tail emissions. When I first heard about tail emissions I immediately disregarded Monero as an inflationary scam coin. Years later when I finally decided to learn about Monero, I realized it isn't endless inflationary. It is fixed inflation that can be calculated and trends towards 0. I still don't know if I'd say fixed vs tail emission is better, but I think both options are reasonable so I'm glad we've got competing options to see which ends up working better.\n\nIn summary, I am equally a fan of both coins. I think there will be room for more than one crypto when this all shakes out, so I think they will both continue to complement each other. I think BCH wins the scaling and usability aspects and Monero wins the privacy aspect. But both can achieve all three of those aspects if you had to choose just one coin.\n\nI think our communities have a lot of common beliefs and goals so hopefully we stay friendly. Thanks again for your post!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i91eb1u",
                            "author": "Graphenist",
                            "score": 2,
                            "created_utc": 1652849347.0,
                            "response": "Thanks and yw.\n\nYeah, BCH is inherently more scalable. Privacy is a higher entropy phenomenon. But that doesnt mean Monero cant scale. I think onchain scaling on Monero will roll smooth, and I do hope to see private and decentrslized L2s eventually...\n\nOn principle, I could never touch a surveillance coin (thats what i call non-privacy coin). Its equally terrifying as it is dangerous imo. It permanently etches your financial history into a public global ledger. Its doxxing, information govts and feds love to have. I dont trust coinmixing, it could have surveillance backdoors, and it only delinks two points in time. Plus theres tainted coins and how that could hurt innocent people, especially people using DEXes where tainted coins flourish most.\n\nI wish more people in crypto cared about privacy and fungibility.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i91xw7i",
                                    "author": "Aggravated-Bread489",
                                    "score": 1,
                                    "created_utc": 1652865624.0,
                                    "response": "I actually think the fungibility issue was what drove me to look into XMR. When people started talking about controlling CEX's to block \"tainted coins\" and people paying a premium for \"virgin coins\".\n\nAnother argument is that if you only need a private currency for \"illegal\" transactions then people will assume that all transactions on XMR are illegal, which isn't true.\n\nSo I agree on all of those points. However, just as you expect additional scaling solutions for XMR, I think it is equally likely that there will be additional privacy solutions for BCH. So I hold both. Except that I lost all my XMR in a boating accident ☹️",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i90ipkl",
                    "author": "knowbodynows",
                    "score": 3,
                    "created_utc": 1652833198.0,
                    "response": "I like both.\n\nHere is an obvious thing that I never see expressed when Monero fans get all confused a la \"why would anyone want anything else?\"\n\nWe know the downside to having a public ledger- less privacy.  But there is a very important upside to a public ledger: a ledger that is public! Everyone can read it! Some use cases call for everyone (including code) being able to verify and trace what happened. The publicly readable traversable blockchain is like a framework, a platform,a scaffolding with visible verifiable handholds. \n\nPlease be open minded about this simple example. It's just an example I'm making up right now. Consider a lottery where everyone sends an amount of their choosing to a single receiving address, and then the one who sent the second most as of midnight (the winner) automatically gets the total balance of the wallet sent to them at midnight. With this game everyone can verify the winner is valid and that the winnings were sent to the proper winner. The public nature of the Blockchain in this case (and many more relevant cases) is an asset. Maybe a dev could express this more succinctly.\n\nTo enjoy the default nature of Monero privacy you must sacrifice use cases that require open readability. \n\nI like them both but one is not a replacement for the other.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i91p3d6",
                            "author": "Graphenist",
                            "score": 2,
                            "created_utc": 1652857525.0,
                            "response": "Well Monero has opt-out privacy, via view keys. So you could create your lottery game, and all participants would just have to list their view keys on your lottery website or whatever. I dont think theres any transparency usecase Monero cant theoretically cover just fine...",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i91rppe",
                                    "author": "mk112ning",
                                    "score": 2,
                                    "created_utc": 1652859838.0,
                                    "response": "We all love privacy but transparency also comes in handy when you need it. I would argue that extreme privacy better come as an additional option rather than a standard one. If every company use Monero(which is untraceable if I understand it correctly) in the future, how can they be audited properly in order to restrain them from conducting fraud? Similar issue also apply to banks and financial institutions, however it is pretty cool for us as people to have Monero around just in case that our privacy is in stake, who knows what they will come up with.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9253kl",
                                    "author": "LovelyDayHere",
                                    "score": 1,
                                    "created_utc": 1652871660.0,
                                    "response": "Can you point to any commercial entity using Monero view keys for accountability today?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i92xzo5",
                                            "author": "Graphenist",
                                            "score": 1,
                                            "created_utc": 1652886456.0,
                                            "response": "No idea if anyone would feel the need to publicly announce that they do this.\n\nBut you can verify tx authenticity yourself using this online tool: https://blockchair.com/monero/",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i92yw8k",
                                                    "author": "LovelyDayHere",
                                                    "score": 1,
                                                    "created_utc": 1652886835.0,
                                                    "response": "> No idea if anyone would feel the need to publicly announce that they do this.\n\nFor the same reason Tether would publish an audit if they could get one done.\n\nAny company using this feature would want others to know they're transparent by using it.\n\nIt seems the case that this feature exists, but hardly anybody - if anybody - is seriously using it.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i934tmc",
                                                            "author": "Graphenist",
                                                            "score": 1,
                                                            "created_utc": 1652889259.0,
                                                            "response": "> Any company using this feature would want others to know they're transparent by using it.\n\nBy doxxing every user? Only users who are initiating a dispute against a merchant would be using this. If the merchant is honest then theres no need.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9090u0",
                    "author": "CurvyGorilla202",
                    "score": 2,
                    "created_utc": 1652828531.0,
                    "response": "Bitcoin is a P2P cash system and that’s what I signed up for. Bitcoin Cash now continues that idea",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i91p7b1",
                            "author": "Graphenist",
                            "score": 2,
                            "created_utc": 1652857621.0,
                            "response": "Well if you like a P2P cash system, youll probably *love* a private P2P cash system...",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8zpw8u",
                    "author": "Zealousideal_Year551",
                    "score": -6,
                    "created_utc": 1652820101.0,
                    "response": "Have u actually used Monero? Its not suitable for normal commerce at all. No legitimate normies are gonna use that. And for that reason only one use case remains: pedophilia. That is an immoral use case for Monero. \n\nI dont invest in weapons manufacturers for moral reasons, I wont invest in Monero because I dont want to enable child sexual abuse either",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i91paar",
                            "author": "Graphenist",
                            "score": 3,
                            "created_utc": 1652857694.0,
                            "response": "People using money for bad things doesnt make the money bad",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i929inr",
                                    "author": "Zealousideal_Year551",
                                    "score": 1,
                                    "created_utc": 1652874605.0,
                                    "response": "Thats not what I said. Thats the only purpose for Monero, because its worse in every other regard",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "id": "uru01d",
            "title": "In a bit of a rut, please help",
            "url": "https://www.reddit.com/r/btc/comments/uru01d/in_a_bit_of_a_rut_please_help/",
            "author": "Electrical_Remove651",
            "created_utc": 1652815085.0,
            "score": 8,
            "num_comments": 11,
            "subreddit": "btc",
            "selftext": "Need suggestions for a low fee, fast delivery crypto service in the USA. For my business.\n\nCoinbase pro randomly cut me off, and kraken doesn't take my card. I use Chase.\n\nI haven't been able to find reasonable fees anywhere. Tried about 6 different services with no luck.\n\nTaking any and all advice. Thanks.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8zzosa",
                    "author": "kraken-frankie",
                    "score": 10,
                    "created_utc": 1652824260.0,
                    "response": "Hey r/Electrical_remove651,\n\nHope you're having a good day!\n\nI'm sending you a link which shows you the details of how you can do cash deposits on Kraken. I would also recommend checking with your bank to see if they allow crypto transaction, if you haven't already.\n\n➔ [https://support.kraken.com/hc/en-us/articles/360000381846-Cash-deposit-options-fees-minimums-and-processing-times-](https://support.kraken.com/hc/en-us/articles/360000381846-Cash-deposit-options-fees-minimums-and-processing-times-)\n\nIf you need any further assistance feel free to reach out.\n\nFrankie from Kraken",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8zw482",
                    "author": "ThomasZander",
                    "score": 8,
                    "created_utc": 1652822709.0,
                    "response": "> and kraken doesn't take my card.\n\nuse bank transfers.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i907x0u",
                    "author": "Collaborationeur",
                    "score": 4,
                    "created_utc": 1652828007.0,
                    "response": "Credit cards don't mix with buying crypto since you can retract the payment after receiving the crypto.\n\nTry non-reversible payment means like a debit card or bank transfer",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ze7dw",
                    "author": "Stockleezy",
                    "score": 4,
                    "created_utc": 1652815259.0,
                    "response": "Moonpay?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8zflg2",
                            "author": "OrangeHODLr",
                            "score": 2,
                            "created_utc": 1652815832.0,
                            "response": "I second moonpay.  Also having luck with Binance.us.  I think Coinbase uses an algorithm to determine your limits and then the holds are pretty unreasonable.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8zg5e2",
                                    "author": "Stockleezy",
                                    "score": 2,
                                    "created_utc": 1652816059.0,
                                    "response": "It wasn't like this for me until recently,  I think they are trying to attribute to the velocity of crypto in market\n\nScams",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i92lkzt",
                    "author": "0321Reddit",
                    "score": 1,
                    "created_utc": 1652881017.0,
                    "response": "Pro.Coinbase.com using ACH withdrawals from my checking account, then Limit orders to get the BCH price I want, then transfer to CoinEx.com for trades and doing stuff on a non-IRS exchange (China), then buy precious metals like gold/silver/platinum/palladium online at sites like JMBullion.com and a few others, then sell the physical coins at a local coin shop\n\nyou're welcome :)",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}