{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uzzmuv",
            "title": "TAAL Offices Raided, Execs Arrested in “Crackdown on Companies Passing Off BTC as Bitcoin” - Th Soon Times",
            "url": "https://i.redd.it/rer0mpm95b291.png",
            "author": "mkgll",
            "created_utc": 1653783321.0,
            "score": 0,
            "num_comments": 10,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "iae3yh5",
                    "author": "Frunknboinz",
                    "score": 0,
                    "created_utc": 1653797712.0,
                    "response": "Fake news",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaeh6aa",
                            "author": "WippleDippleDoo",
                            "score": 0,
                            "created_utc": 1653807613.0,
                            "response": "The post literally has a joke tag.\n\nImagine being this butthurt about the value crash of store of calue scamcoin.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iaer0fp",
                                    "author": "LovelyDayHere",
                                    "score": 3,
                                    "created_utc": 1653816376.0,
                                    "response": "I put the 'Joke' flair there.\n\nBecause it wasn't flaired, and could be mistaken for actual news otherwise.\n\nThis is not a sub to spread fake news, so I would ask people who post satire / jokes that involve real companies, to mark them so as make it clear they are not trying to spread fake news.\n\nIf people don't cooperate, I will interpret it as a means of trying to attract negative attention of Reddit admins to our sub, and will remove such fake news posts in future. u/mkgll",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iaf6i9j",
                                            "author": "simon-v",
                                            "score": 1,
                                            "created_utc": 1653828505.0,
                                            "response": "Okay, but to me, it was obvious satire. Do we really must issue an explicit content warning on satire, every time? What sad state our society must be in, if it's precisely what expected!",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iaf8s3w",
                                                    "author": "Frunknboinz",
                                                    "score": 1,
                                                    "created_utc": 1653829786.0,
                                                    "response": "Unfortunately this is the sad state of our society.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "iafd8zs",
                                                    "author": "LovelyDayHere",
                                                    "score": 1,
                                                    "created_utc": 1653832134.0,
                                                    "response": "Maybe it's more obvious in some cases. In this one, I think the image was depicted to appear real, and would've been taken as such by anyone not following the BSV drama in detail. It was obvious to you and me because you're familiar with that, but it isn't to your average Redditor.\n\nWe know that Faketoshi / Calvin Ayre (basically the guy financing TAAL) is sue happy, we know Reddit is happy to ban subs for \"reasons\" we may not find agreeable.\n\nWe know \"fake news\" and \"disinformation, misinformation, malinformation\" is a hot topic right now because the elites would like to use that as a hot button for the kinds of censorship they want to happen on the Internet.\n\nI don't want to take unnecessary risks of real \"fake news\" being used to switch off the lights on this sub, launch a takeover via admins or get people running it sued more than they already have been.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iadf8eo",
                    "author": "mkgll",
                    "score": 2,
                    "created_utc": 1653783333.0,
                    "response": "https://twitter.com/TheSoonTimes1/status/1530675898994675712",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}