{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "usrjck",
            "title": "Incentive for holding BCH",
            "url": "https://www.reddit.com/r/btc/comments/usrjck/incentive_for_holding_bch/",
            "author": "Ok_Aerie3546",
            "created_utc": 1652922074.0,
            "score": 10,
            "num_comments": 177,
            "subreddit": "btc",
            "selftext": "I did the bitcoin maxi AMA a few days ago.\n\nThis was my main doubt after a while.\n\nI just checked the chart of bch. I had never properly seen it before. Its below the price it was in July 2017. \n\n- What should be my incentive to hold it?\n- If there is no incentive, isnt it just better that I convert my dollars or bitcoin to BCH when I want to take advantage of this high tps or low fees. \n\nI get that this can change in the future. Like fees in bitcoin can become too high, etc. But right now, why should a person put the dollars that he earns at work to BCH, just to hold it. If he wants to buy something worth 20 dollars at a BCH accepting store due to some advantage, then he should just convert 20 dollars into BCH and use them. Why convert the rest of your dollars?\n\nThis happens in countries. People keep dollars in a safe at home, and only convert to their country's fiat if the want to pay for something in it.\n\nWhats the incentive to hold bitcoin cash? Usually any persons incentive to hold something is for price appreciation or some emotional attachment.\n\nWhat is the BCH community's to hold BCH right now?",
            "stickied": false,
            "comments": [
                {
                    "id": "i95c28u",
                    "author": "Remora_101",
                    "score": 17,
                    "created_utc": 1652923055.0,
                    "response": "What do you think current crypto prices represent?\n\nWhat do you think price in the future will represent?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i95edpe",
                            "author": "Ok_Aerie3546",
                            "score": -2,
                            "created_utc": 1652924120.0,
                            "response": "Price in general represent the same thing in the present and the future. How many dollars can be exchanged to get the thing.\n\nDont need to complicate it.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i965kac",
                                    "author": "wtfCraigwtf",
                                    "score": 12,
                                    "created_utc": 1652939294.0,
                                    "response": "Ask yourself this: will more or less people will be using crypto for payments in 5 years?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i966wmy",
                                            "author": "Ok_Aerie3546",
                                            "score": 2,
                                            "created_utc": 1652940307.0,
                                            "response": "Maybe same or even less. If people are using debit cards less and less every day, same will happen with crypto. Credit cards are preferred for a reason, you know.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i969ujg",
                                                    "author": "wtfCraigwtf",
                                                    "score": 10,
                                                    "created_utc": 1652942633.0,
                                                    "response": "lol again, perhaps you don't know that merchants lose 5% on every credit card transaction? that's a lot of money. \n\nhave you ever made a payment with cryptocurrency? With 2 mobile wallets it's literally faster than any POS system. Not to mention it's irreversible, doesn't require the permissions of: \n\n2 banks, the government, and any intermediaries who might choose to stop the payment for increasingly arbitrary reasons.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i96aoc0",
                                                            "author": "Ok_Aerie3546",
                                                            "score": 3,
                                                            "created_utc": 1652943317.0,
                                                            "response": "How does a payment being irreversible benefit me? I use credit cards specifically because they can be reversed.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i96b8lj",
                                                                    "author": "Remora_101",
                                                                    "score": 10,
                                                                    "created_utc": 1652943773.0,
                                                                    "response": "Try to understand Bitcoin and why it brings people financial sovereignty then you will understand why credit cards, bank transfers etc. will be replaced by crypto.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i96c0te",
                                                                            "author": "Ok_Aerie3546",
                                                                            "score": 4,
                                                                            "created_utc": 1652944433.0,
                                                                            "response": "Yeah so when they get replaced, ill use the thing that replaces them. But till then why not use credit cards if they are leaps and bounds better than any crypto transfer.\n\nPurchase protection, cashback, easier to payback in the currency you earn. To name a few examples. Not to mention debt in a dying currency is better than any other currency for spending.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i96c4g7",
                                                                                    "author": "Remora_101",
                                                                                    "score": 6,
                                                                                    "created_utc": 1652944519.0,
                                                                                    "response": ">But till then \n\nAnd how do you think this point in time will come when nobody uses it because they are all waiting to use it?",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i96cqgi",
                                                                                            "author": "Ok_Aerie3546",
                                                                                            "score": 0,
                                                                                            "created_utc": 1652945036.0,
                                                                                            "response": "It wont come, because its not making sense. \n\nPrice appreciates when people keep buying and not selling.\n\nSpending it has no effect on price.\n\nThats why I am saying, store of values dont need utility to appreciate in price. Buy a piece of land and do nothing with it, it will rise in value after 1 or 2 years. Same with gold, collectibles, any store of value.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "id": "i96e8r4",
                                                                    "author": "wtfCraigwtf",
                                                                    "score": 4,
                                                                    "created_utc": 1652946365.0,
                                                                    "response": ">How does a payment being irreversible benefit me?\n\nif you were a merchant you would understand, try to think about it from a  perspective other than your own. yes, it is an advantage for the merchant and a disadvantage for the buyer, just as credit cards hurt merchants while protecting buyers. But credit cards also create traceability and reversal concerns for both buyer and merchant when a third party intervenes in their transaction. haven't you ever had a CC payment declined?!",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i96b5wl",
                                    "author": "Remora_101",
                                    "score": 6,
                                    "created_utc": 1652943712.0,
                                    "response": "The right answer would have been:\n\n- Hype, because crypto \"usage\" is basically zero\n- Real world usage, because finally one or two coins have materialized their real world use case.\n\n\nAnd there is your answer. BCH has a real world use case, and when it materializes BTCs high will be peanuts against it. BTC on the other hand has botched its real world use case and chose number go up as usecase, which is not sustainable.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i96bgnt",
                                            "author": "Ok_Aerie3546",
                                            "score": -2,
                                            "created_utc": 1652943956.0,
                                            "response": "Even in the bottom of the bear market when their was no hype, bch was valued less than bitcoin. So the current price isnt just hype talking.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i96bzn7",
                                                    "author": "Remora_101",
                                                    "score": 6,
                                                    "created_utc": 1652944404.0,
                                                    "response": "It is all hype bear or bull, there is no real world usage, it is all anticipation.\n\nRead about the dot.com bubble. People put millions in devs in their basement. It all collapsed and only few companies with a real world use case survived. \n\nThe first coin that demonstrates real world widespread usage will suck the money out of every other coin.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i96c988",
                                                            "author": "Ok_Aerie3546",
                                                            "score": 1,
                                                            "created_utc": 1652944632.0,
                                                            "response": "Isnt bitcoin cash the first coin that showed real world usage, and its not sucking more money that what it had already sucked 4 years ago. \n\nAt some point you have to accept that usage doesnt give something value. Stores of values stay stores of value even without usage. And we have so many examples for that.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i96cn2r",
                                                                    "author": "Remora_101",
                                                                    "score": 6,
                                                                    "created_utc": 1652944956.0,
                                                                    "response": ">Isnt bitcoin cash the first coin that showed real world usage, and its not sucking more money that what it had already sucked 4 years ago.\n\nYes and no, BCH real world use is increasing, but it is way to low to convince and cut trough the hype. \n\nNot even BTCs highly marketed but botched El Slavador rollout had any effect.\n\n\n\n>At some point you have to accept that usage doesnt give something value. Stores of values stay stores of value even without usage. \nThis is complete bullshit.\n\n- There never was a SoV without a use case\n- People did not pick up Gold for the first time and thought oh, this looks like a good SoV\n\nThe story that a SoV is a SoV because people say it is a SoV is a bamboozle. It will crash like beanie babies. \n\n\n\n>And we have so many examples for that.\n\n\nName a single one.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i96d7cd",
                                                                            "author": "Ok_Aerie3546",
                                                                            "score": 1,
                                                                            "created_utc": 1652945448.0,
                                                                            "response": "For many years and even now, corals are treated as stores of value. They might be the most useless.\n\nAll collectibles have no use.\n\nArt has no use.\n\nRolexes have no use, nothing more than what a regular watch can do.\n\n90 percent of gold has no use.\n\nDiamonds, precious stones, pearls.\n\nSo many more\n\nEven when we started using gold as money, we had absolutely no use for it.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i96dm37",
                                                                                    "author": "Remora_101",
                                                                                    "score": 5,
                                                                                    "created_utc": 1652945810.0,
                                                                                    "response": ">All collectibles have no use.\n\n>Art has no use.\n\n>Rolexes have no use, nothing more than what a regular watch can do.\n\n>90 percent of gold has no use.\n\n>Diamonds, precious stones, pearls.\n\n\n\nDon't oversimplify it. Collectibles are unique and people like to collect stuff but NFTs satisfy this urge much better. Most collectibles also have a history or a personal involvement. Nothing BTC can provide\n\nArt has a use case, it is mostly tax evasion \n\nRolex has a very real usecase of bragging\n\nGold has a use case you can'T ay 90% has no use case. Really you should try to wrap your head around it, there is a lot of false assumption in your head.\n\nAll the precious stones have a use case as jewelry and bragging rights.\n\n\n>Even when we started using gold as money, we had absolutely no use for it.\n\nYou couldn't be more wrong.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i96ebb9",
                                                                                            "author": "Ok_Aerie3546",
                                                                                            "score": 1,
                                                                                            "created_utc": 1652946430.0,
                                                                                            "response": "Saying something has a history and that it makes the owner feel good is not utility.\n\nI can say bitcoin has history and makes me feel good. Is that utility too?\n\nYeah art has that use case. Accepted.\n\nI can brag about the bitcoin I own as well. Is that enough use to become a store of value like a rolex.\n\nOnly 10 percent of gold is used in industry, I wouldnt say jewelry is a use case, coz I can tie a string around my bitcoin private keys and wear it around my neck. Thats not a use case.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i987rdl",
                                    "author": "DrKamikadze",
                                    "score": 1,
                                    "created_utc": 1652982125.0,
                                    "response": "Bruh price indeed matters a lot and we can see the variations in the price bothering the market much!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i96p2sb",
                            "author": "Vad80",
                            "score": 1,
                            "created_utc": 1652956040.0,
                            "response": "The simple fact that I see is something great is yet to come we have a long way to go with crypto!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i95k8qs",
                    "author": "phillipsjk",
                    "score": 13,
                    "created_utc": 1652926859.0,
                    "response": "Keep in mind there were two splits (BSV and XEC).\n\nIf you were able to sell the new tokens at about 1:1 (I was), the price would have to be down 75% before you lose any money.\n\nEdit: the BCH chart almost looks like a damn stable coin if you look at the long view (other than the Dec 2017 spike and May 2021 spike).",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9685cm",
                            "author": "ErdoganTalk",
                            "score": 5,
                            "created_utc": 1652941273.0,
                            "response": "XEC is not sound money, due to the tax. The king, with the extra profitability, can outmine everybody else, then control the coin alone. The market is left out.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i97ztc6",
                            "author": "jinkv06",
                            "score": 3,
                            "created_utc": 1652978939.0,
                            "response": "I see that there is indeed slightly a variations in the price chart!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i95lqf4",
                    "author": "Maxwell10206",
                    "score": 24,
                    "created_utc": 1652927589.0,
                    "response": "Simple. The fundamentals for Bitcoin Cash look way more promising than BTC and many other cryptocurrencies. To quote Peter Lynch, a famous & profitable mutual fund manager that invested in stocks from the 70s to the 90s.\n\n\"It takes remarkable patience to hold on to a stock in a company that excites you, but which everybody else seems to ignore. You begin to think everybody else is right and you are wrong. But where the fundamentals are promising, patience is often rewarded.” - Peter Lynch",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i95n8ft",
                            "author": "MobTwo",
                            "score": 20,
                            "created_utc": 1652928330.0,
                            "response": "Exactly. I bought more Bitcoin Cash today! =D",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i964sxn",
                                    "author": "lewisre2847",
                                    "score": 6,
                                    "created_utc": 1652938753.0,
                                    "response": "Good to hear that Bitcoin Cash is what we have and we would indeed love to make it a globally accepted peer to peer electronic Cash!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i965qin",
                            "author": "putnikvetra",
                            "score": 5,
                            "created_utc": 1652939419.0,
                            "response": "True though I see why the indulgence is more into Bitcoin Cash!",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i96fhyw",
                            "author": "daniel-tech",
                            "score": 1,
                            "created_utc": 1652947497.0,
                            "response": "To play devils advocate, I've looked at various different crypto projects and this holds true for a lot of crypto communities.\n\nZcash, monero, harmony, nano, dash.\n\nThey all have arguable good \"fundamentals\" compared to BTC.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i971atn",
                                    "author": "Maxwell10206",
                                    "score": 2,
                                    "created_utc": 1652963922.0,
                                    "response": "Which of those cryptos has as large of a network effect like BCH? I would argue while Monero has big adoption on the dark web..which is great but idk if it can grow its adoption to the rest of the population. But overall Monero has good fundamentals. Largest adopted privacy coin.\n\nDash is doing alright. It is accepted on Bitrefill. But I don't think it has as large of a userbase like BCH.\n\nZcash, Harmony, and Nano I have seen little to no adoption of these coins. Poor fundamentals imo. Product works but no one uses it...",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i97ru8z",
                                            "author": "daniel-tech",
                                            "score": 1,
                                            "created_utc": 1652975734.0,
                                            "response": "How do you quantify adoption and network effect?",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i96ie9r",
                    "author": "fiendishcrypro",
                    "score": 6,
                    "created_utc": 1652950145.0,
                    "response": "BCH price performance has been abysmal. If it continues like this, it will be bad to hold in BCH.\n\nWhat then is the incentive?\n\nWell... BCH is pretty much the only coin that is really gunning for real world adoption. Crypto without a real life purpose will all go to zero, even BTC. It is just a matter of time.\n\nThere are several projects launching this year, such as FileShop, that will use the BCH chain and heavily drive adoption and onchain usage.\n\nThe is smartBCH which is growing in value daily. The Verse token will be launching soon on the Verse Dex, and that whole ecosystem is ready to explode. FlexUSD is also now on smaetBCH.\n\nThere is also the small fact of an MP in St. Maarten accepting his whole salary in BCH, who is currently writing a law to make BCH a legal tender on the island. There will also be a BCH conference there on the 12/11/2022.\n\nSo loads of reasons to think that BCH price will go up, and fast. And once it does it generates a posiitve feedback loop, that helps further adoption and people will trust BCH more and not swap it out for BTC or a stablecoin.\n\nThen the price increases more, fuelling a very rapid agenda and adoption phase.\n\nAnd the great thing is, big blocks allow for that massive jump in adoption.\n\nSo bring it on BCH!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9li596",
                            "author": "Graphenist",
                            "score": 1,
                            "created_utc": 1653246928.0,
                            "response": "> Well... BCH is pretty much the only coin that is really gunning for real world adoption.\n\nMonero owns at least half of the darknet, people are living off Monero using Monero-purchased gift cards, and you have the audacity to say this?\n\nMonero price performance has been exceptional btw.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i965fvr",
                    "author": "wtfCraigwtf",
                    "score": 6,
                    "created_utc": 1652939204.0,
                    "response": ">I just checked the chart of bch. Its below the price it was in July 2017.\n\nIf the BCH price was double the amount of July 2017, wouldn't you say \"price has gone up too much in the past few years, I can't buy now as this growth can't be sustainable\"?\n\nAny merchant who accepts BCH for payments has two options: they can exchange it for fiat immediately or they can hold it. If you think even for one second, with the price down right now, holding the coins for a higher exchange rate is an obvious choice. But of course it's still their choice!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i96654i",
                            "author": "Ok_Aerie3546",
                            "score": 1,
                            "created_utc": 1652939727.0,
                            "response": "Any merchant who accepts bch doesnt hold it. Coz if they were, they would also price things in bch. \n\nRight now they price things in usd and accept an equivalent bch amount as payment. That means they are immideately converting it to usd or their countrys fiat.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i966r0d",
                                    "author": "wtfCraigwtf",
                                    "score": 7,
                                    "created_utc": 1652940190.0,
                                    "response": "well funny you say that, because I'm a merchant and I price my products in dollars and I accept BCH and I hodl it and spend it and occasionally redeem it for fiat when it pumps 3x \n\nI don't think I'm making a mistake at all :)",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i96736h",
                                            "author": "Ok_Aerie3546",
                                            "score": 0,
                                            "created_utc": 1652940445.0,
                                            "response": "Yes you have to convert to fiat at some point. And its best to convert it immediately, coz if it goes down in price, you are stuck with a large tax bill.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i969m6q",
                                                    "author": "wtfCraigwtf",
                                                    "score": 7,
                                                    "created_utc": 1652942450.0,
                                                    "response": "yeah you're definitely new here...\n\ncrypto natives \"spend and replace\". we avoid fiat in general. think it through, and I think you'll perceive that cryptocurrency has very radical potential. \n\nright now you're valuing everything in fiat money, that's a very natural thing to do as most things you buy are paid for in fiat. but did you know that the fiat is GUARANTEED TO LOSE VALUE? that's how central bank inflationary policies keep you poor!",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i96agx3",
                                                            "author": "Ok_Aerie3546",
                                                            "score": 1,
                                                            "created_utc": 1652943146.0,
                                                            "response": "I know fiat is garunteed to lose value. Literally everyone does. So thats why I dont save in fiat. \n\nBut knowing that fiat will lose, why exactly would I not want to pay in it? As long as people accept it, I will pay people in fiat itself, because thats what I get paid in.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i96dzeo",
                                                                    "author": "wtfCraigwtf",
                                                                    "score": 3,
                                                                    "created_utc": 1652946135.0,
                                                                    "response": "ok I think you are getting there, but you're still stuck on the \"paying in fiat\" trip. If somebody accepts crypto payment, and you have crypto, why not pay them in crypto?  The point is, you don't have to buy crypto with fiat and then pay in crypto, that makes no sense, it just adds a layer of complexity and you'll lose value during the exchange transactions. \n\nBitcoin whitepaper title is \"Bitcoin: a Peer to Peer Electronic Payment System\". There is no reason to use fiat if you can use crypto and you like it. And if you don't like crypto for payment, why are you here?!",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i96efjx",
                                                                            "author": "Ok_Aerie3546",
                                                                            "score": 1,
                                                                            "created_utc": 1652946537.0,
                                                                            "response": "Coz I like crypto to shield my money from inflation and central banks. Doesnt mean I like paying with it.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i96fa2q",
                                                                                    "author": "wtfCraigwtf",
                                                                                    "score": 3,
                                                                                    "created_utc": 1652947300.0,
                                                                                    "response": "it's fine to hedge against inflation, but the crypto that is used the most for payments will always have the most value. study up on network effects and utility theory and you will understand this better. nobody cared about BTC until Silk Road exploded onto the scene, then BTC price skyrocketed.  BTC Maxies basically invented these \"store of value\" and \"digital gold\" concepts out of thin air to sidestep their inability/resistance to scale BTC, they don't have a strong academic underpinning. \n\nan easy comparison is buying a vintage car and keeping it in a garage for 30 years until it is worth more money, versus buying a functional car and using it every day for 30 years. clearly the value you extract from using the functional car every day is far more than the price appreciation of the vintage car over 30 years!",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i965cig",
                    "author": "ErdoganTalk",
                    "score": 3,
                    "created_utc": 1652939135.0,
                    "response": "You have to move to sound money well in advance, because a fiat fall will always come first slowly, then fast, and always as a surprise. As with the LKR these days, before you know it, the money has lost half its value, and only the informed even at that time, will start to do something about it. And you will be dragged between your self interest and the support for the state (presented as the society). Do it in advance. If you don't like BCH, then BTC and Monero.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i965t0p",
                            "author": "Ok_Aerie3546",
                            "score": 0,
                            "created_utc": 1652939471.0,
                            "response": "Why not house and businesses? Even if fiat falls, having an asset that produces goods and services will always be valuable.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i967k3i",
                                    "author": "ErdoganTalk",
                                    "score": 3,
                                    "created_utc": 1652940812.0,
                                    "response": "That's what everybody else does, they flock to real. But there is the case for money too, so you can make your future safer, then consider what to do when the dust is cleared. An old chinese saying: Your first fortune should be in gold, the next in investment.\n\nWith housing specifically, remember it is a consumer good, not investment. Unless you can rent it out profitably. But that is not the purpose for most people, they will rent it out without looking to profit, just to keep their saving. If so, there will be overinvestment in housing, and a crash will follow.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i95lkle",
                    "author": "AD1AD",
                    "score": 8,
                    "created_utc": 1652927508.0,
                    "response": "> What should be my incentive to hold it? If there is no incentive, isnt it just better that I convert my dollars or bitcoin to BCH when I want to take advantage of this high tps or low fees.\n\nBCH doesn't need an incentive to hold. In the short term, it's volatile, because it's a new asset, so the incentives are to convert it to a more stable asset when you're not using it. But the demand early on comes from its usefulness as a payment method. When the volatility declines enough for the average person compared to fiat, the incentive will be \"It doesn't go up and down that much, and I know I can always spend it when I want to.\"\n\nBCH enthusiasts may hold it and ride the ups and downs (I do, to some degree), but as long as it remains useful as money and volatility keeps going down (as the supply is more and more distributed), it will eventually be a store of value too. This is as opposed to BTC, which is NOT a store of value. So far it's been a good investment, but its short term volatility makes it a terrible store of value.\n\nhttps://youtu.be/2mTypxJVL-g",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i95ngx5",
                            "author": "Ok_Aerie3546",
                            "score": 1,
                            "created_utc": 1652928448.0,
                            "response": "Im not even talking about volatility. Just calculate cagr on the price for a long period of time. Thats usually any persons incentive to buy something right?\n\nWhats the difference between a store of value and a good investment? Rolexes, houses, fine art, indexes all of these are both. How can something be a good investment over a long period of time and not imply that its also a store of value.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i96ec6w",
                                    "author": "AD1AD",
                                    "score": 3,
                                    "created_utc": 1652946453.0,
                                    "response": ">Whats the difference between a store of value and a good investment?\n\nA store of value needs to have low volatility so that people can use its spending power *when they need it*. At least as I understand it, it's not a long/short term thing. It's a when the-owner-needs-to-spend-it thing, which could be during a \"bear market\" for their so-called store-of-value.\n\n>Just calculate cagr on the price for a long period of time. Thats usually any persons incentive to buy something right?\n\nRegardless of potential future price performance, people buy things for other reasons, like to use them because they need them or consider them their best option for a given use case.\n\nImagine if everyone in the world sending remittances were just buying BCH when they wanted to send it, and then the receivers were selling it for local currency when the received it. The users would be buying it because its the easiest, simplest option for their use case, and neither would be exposed to much volatility given the short time frames. But still this would provide constant demand for BCH.\n\nYou don't need HODLers if you have constant demand from users as an efficient payment method. If you manage to be an efficient payment method for long enough, the price may stabilize from widespread demand enough for people to start treating it as a store of value as well. (As oppsoed to something starting as a store of value, and then become used as money eventually.)",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i97y02i",
                            "author": "antoshko",
                            "score": 1,
                            "created_utc": 1652978213.0,
                            "response": "Indeed true though that is what we see the adoption rate gradually increasing at an instant though!\n\nI see that Bitcoin Cash was meant to be spent and not to be hold and this point seems to clear enough to me!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i96f1tw",
                    "author": "chainxor",
                    "score": 3,
                    "created_utc": 1652947098.0,
                    "response": "Would you rather buy a stock in a company at ultra discount prices considering the fundamentals of that company, or do you prefer buying an expensive stock in a popular company where growth has stagnated?\n\nI know what I prefer.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i96fa5c",
                            "author": "Ok_Aerie3546",
                            "score": -1,
                            "created_utc": 1652947302.0,
                            "response": "I just buy indexes when I get paid. Thats how 401k work too.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i96lhlu",
                                    "author": "chainxor",
                                    "score": 3,
                                    "created_utc": 1652952982.0,
                                    "response": "You missed the point.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i96lnne",
                                            "author": "Ok_Aerie3546",
                                            "score": 0,
                                            "created_utc": 1652953136.0,
                                            "response": "I dont speculate on the price of a stock is what I meant, I just assume us economy would continue to grow as it has been. So I buy them regularly.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i95kl1r",
                    "author": "big--if-true",
                    "score": 5,
                    "created_utc": 1652927028.0,
                    "response": "BCH is cheap internet money.\n\nTo create BCH it costs hardware and electricity, you effectively destroy these 2 values to gain a digital token. \n\nThe idea is that the value from the proof of burn will be transferred to this token.\n\nOver time more electricity and mining power is needed while the amount of tokens given in exchange for mining become lower. This raises the creation price of each token.\n\nSo given enough time BCH is headed upward, with faster adoption this could go much faster. \n\nThe result is internet tokens that we all can use as money without inflation or government control. \n\nCurrently the price is controlled by speculators and margin traders. Eventually they will lose their power as BCH leave their wallets and long term investors buy them.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i95mw93",
                            "author": "Ok_Aerie3546",
                            "score": 3,
                            "created_utc": 1652928162.0,
                            "response": "If the past 4 years havent shown any price appreciation. When almost every other thing has (stocks, real estate, bitcoin), why would a person put his extra cash into bch and not into any of the others. Then when he needs to use bch, just sell the thing he bought, buy bch and use it and go on with his life.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i95zmm8",
                                    "author": "big--if-true",
                                    "score": 6,
                                    "created_utc": 1652935216.0,
                                    "response": "Short term stuff can end up the same way TerraUSD ended, just because you made quick money in the past with certain projects, doesnt mean the project is good. It can collapse within hours as we saw with Luna/USTerra. \n\nYou have to find projects that have long term utility.\n\nMany here believe that with high fees Bitcoin no longer has utility and just because the price went up in the past, doesnt mean it will survive. BCH is the upgraded version that will keep the fees low forever and provide internet money for whoever needs it: https://whybitcoincash.com/",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i960eqm",
                                            "author": "Ok_Aerie3546",
                                            "score": 2,
                                            "created_utc": 1652935725.0,
                                            "response": "But then why not buy and index fund, and later when you need to use the utility of bch, sell the etf and buy bch and use bch. \n\nIf the price doesnt matter, why buy it now and not when you want to use it?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i968zv9",
                                                    "author": "Shibinator",
                                                    "score": 2,
                                                    "created_utc": 1652941959.0,
                                                    "response": "You can do exactly that if you want to.\n\nEventually, you will get sick of selling fractions of your index fund every week.  Then you'll start holding a balance in BCH.\n\nAs time passes, you will see the BCH community growing and adoption spreading.  Then you will start allocating a little more and a little more.  You'll never really have a need to sell any, because the whole point is that it's money so if you need something you spend it.\n\nThat's how it happens.\n\nThis is a slow and educational process.  BCH has by far the highest educational bar to being invested in, because you need to learn the history of crypto and get past all the BTC FUD and actually have to use it as a currency.  But once ALL those pieces have clicked, you join the highest resilience community in crypto there is, by a enormous chasm.\n\nBCH is completely different from all the other hype based cryptos, and that's why you're confused by it.  It's not as simple as \"buy some, hope it moons with a crowd of people doing the same, try and luckily dump at the right time\".  Instead you genuinely need to approach it as a brand new economy that you are joining, and use it as such.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i969st7",
                                                            "author": "Ok_Aerie3546",
                                                            "score": 1,
                                                            "created_utc": 1652942594.0,
                                                            "response": "You talk as if people dont have an income. People pay for their usual expenses with their income and invest the rest. \n\nIf I buy index funds as my investment, I wont need to sell it every week, maybe once every 4-5 years for any large purchase that might come up.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i96a060",
                                                                    "author": "Shibinator",
                                                                    "score": 3,
                                                                    "created_utc": 1652942758.0,
                                                                    "response": "> People pay for their usual expenses with their income\n\nYes, and you should start trying to earn BCH, not purchase it.  That's how money works: Earn, save, spend (not buy, sell).\n\nAsk your employer to pay 5% of your salary in BCH for instance.\n\nRemember, you need to think of this as joining an economy - not \"buy some, hope it moons with a crowd of people doing the same, try and luckily dump at the right time\"",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i96aslv",
                                                                            "author": "Ok_Aerie3546",
                                                                            "score": 1,
                                                                            "created_utc": 1652943412.0,
                                                                            "response": "Asked my employer and he said no, what then? Change jobs till someone pays me in bch? \n\nThat even sounds crazier.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i96c1rs",
                                                                                    "author": "Shibinator",
                                                                                    "score": 3,
                                                                                    "created_utc": 1652944455.0,
                                                                                    "response": "If you want to find objections, you will be able to find them.  If your attitude is for this NOT to work, of course it won't work, nothing will.  I can't explain to you how to join BCH if you're dead set on finding argumentative ways NOT to be involved.\n\nIf you genuinely want to join the BCH economy, of course this stuff can be handled and if you think about it for 2 minutes you shouldn't need me to walk you through it.\n\n> Employer says no\n\nAsk why not.  Help educate them on crypto.  If they are really against it, simulate the experience by doing a 5% BCH buy on an exchange every week, so that you have some stash for your BCH spending (remember, joining an economy, and if you gotta start with one half you gotta start with one half then).  Continue to request it every couple of months, and as adoption spreads and confidence in crypto grows, their minds will change.  Or, like you say, if you truly believe in a crypto future, maybe you end up switching jobs for it (yes, extreme but it's an option if you truly are passionate about crypto).\n\nThe truth is, you have a job because you are valuable.  Employers aren't in the habit of unreasonably and persistently rejecting reasonable employee requests - they literally want to keep their employees happy so they stay at the company.  Crypto is already big enough and known enough that few companies will decide it's something they can completely ignore, given that it is rapidly becoming a reality of society.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i96ceov",
                                                                                            "author": "Ok_Aerie3546",
                                                                                            "score": 1,
                                                                                            "created_utc": 1652944763.0,
                                                                                            "response": "The employer will always say, \"why dont you just buy bch with 5 percent of the salary, why are you bringing the employer into this?\"",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i95xcvr",
                    "author": "aj2fromtheblock",
                    "score": 5,
                    "created_utc": 1652933793.0,
                    "response": "Bitcoin cash is P2P electronic cash as Satoshi envisioned. It offers the entirety of humanity an alternative to transact and store wealth in a digital environment. You are way to focused on the price. It can be manipulated and influenced in different ways. What matters is the utility and future adoption expectations.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i95xle1",
                            "author": "Ok_Aerie3546",
                            "score": 0,
                            "created_utc": 1652933937.0,
                            "response": "The utility is the same if I just buy it before I want to use it. But if the price isnt rising, whats the point in just holding bch?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i96bbwb",
                                    "author": "Remora_101",
                                    "score": 5,
                                    "created_utc": 1652943847.0,
                                    "response": ">The utility is the same \n\nIt is not.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i96bnx0",
                                            "author": "Ok_Aerie3546",
                                            "score": 0,
                                            "created_utc": 1652944123.0,
                                            "response": "How?",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i95v1tw",
                    "author": "Sugarbird676",
                    "score": 4,
                    "created_utc": 1652932443.0,
                    "response": "The question is based on a speculative mindset, and also on the assumption that the dollar is stable right now.\n\nThe question isn’t, “Why should I hold BCH?” The question is, “Why should I care about BCH adoption by merchants?” And the answer is, “Because the dollar is about to hyperinflate and be replaced by a government digital slave-coin, and we need an alternative when that happens.”",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i95wck2",
                            "author": "Ok_Aerie3546",
                            "score": 1,
                            "created_utc": 1652933187.0,
                            "response": "Its not speculative. Its like saying apple stock has been growing at 20 percent every year for the past 10 years, and based on that you decide to hold apple stock for another ten years. Thats not speculation. Thats like the safest way to invest.\n\nDo you think that you would never invest in any company because it uses digital slave coin?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i95yk60",
                                    "author": "JonathanSilverblood",
                                    "score": 9,
                                    "created_utc": 1652934536.0,
                                    "response": "Past success does not guarantee future performance.\n\nThat said, I think the reason you're having issues getting the same framing as many others, is because you're thinking in terms of investment and eventual exist strategy.\n\nI started working with bitcoin and earning my way long before the BTC/BCH split because the way I see it, I'll never exit - crypto in one form or another will become the global interconnected currency of this planet and so far Bitcoin Cash looks like the most likely outcome.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i95yznx",
                                            "author": "Ok_Aerie3546",
                                            "score": 1,
                                            "created_utc": 1652934811.0,
                                            "response": "So youll never use your bch to start a business or buy a house. You only use it to spend on things?\n\nIf your answer to the first question is yes, then why not hold stock in a company, and convert it to bch when you want to use bch?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9674h6",
                                                    "author": "JonathanSilverblood",
                                                    "score": 5,
                                                    "created_utc": 1652940474.0,
                                                    "response": "If you're asking if I ever intend to invest my BCH into something else with the hopes of making a profit of my investment, then the answer is I don't know, but at this point in time I prefer to invest in things I believe in, because I want them to come to life so I can benefit of the value they provide.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i967px4",
                                                            "author": "Ok_Aerie3546",
                                                            "score": 2,
                                                            "created_utc": 1652940938.0,
                                                            "response": "I was asking if you would be open to the idea of investing your saved bch into something else in the future. To get a better return.\n\nA lot of people do this even now by just buying index funds and taking out margin to do payments. Why keep holding on to bch, neither is it going up in value, and because you wanna self custody, you wont take matgins either. This is like you holding yourself back.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i968qvv",
                                                                    "author": "jessquit",
                                                                    "score": 3,
                                                                    "created_utc": 1652941761.0,
                                                                    "response": "Your argument rests on the assumption that past performance guarantees future results. So far, you're right. So far.\n\nYou hold crypto in a wallet you control because it's the only thing that gives crypto value in the first place: sovereignty.  When you own an index fund you own an entry in a custodial database. It could literally vanish tomorrow.\n\nI get a real kick out of people who buy Bitcoin and leave it on exchange. Like, do you even know why the thing exists in the first place? Those of us who lived through mtgox know how fast the rug can be pulled.\n\nI see the current market as a house of cards and expect a terrible day of reckoning when everyone who's playing musical chairs with their crypto suddenly finds themselves with nowhere to sit. But then that's just my opinion.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i969lb3",
                                                                            "author": "Ok_Aerie3546",
                                                                            "score": 1,
                                                                            "created_utc": 1652942432.0,
                                                                            "response": "So you think securities like stocks should not be bought because they dont let you be sovereign?\n\nSo there should be no stock market? Only family owned businesses? Or how far back to we go? Make your own electricity, food, everything?",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i96ct56",
                                                                                    "author": "jessquit",
                                                                                    "score": 3,
                                                                                    "created_utc": 1652945102.0,
                                                                                    "response": "No of course not. A stock is a stock, a Bitcoin is a Bitcoin. They do completely different things.\n\nStocks let you do one thing (participate in the ownership of a company) and Bitcoin lets you do something else (exercise sovereignty over your money).\n\nSo I use stocks when I want to participate in the ownership of a company, and I use Bitcoin (BCH) to have sovereignty.\n\nI know some people like to trade / speculate / gamble on coins, but I'm not a trader. I have enough hours of finance to know that that's not a game I can win. I'm a buy and hold fundamentals sort of investor. That's true of stocks and anything else I invest in.\n\nPeople who trade cryptos on exchange are not actually getting any of the benefit of crypto. They're getting the benefit of speculation. When you put your coins on exchange you completely lose your sovereignty. **At that point the crypto is just a number in a database, and you're exposed to the exact systemic risk that crypto exists to protect you from.** I bolded that so that you'd read it twice.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i96dije",
                                                                                            "author": "Ok_Aerie3546",
                                                                                            "score": 1,
                                                                                            "created_utc": 1652945723.0,
                                                                                            "response": "Yes but arent you better off just holding all your excess capital in an index than holding bch?\n\nEven if you think of it in bch terms, you end up with more bch at the end.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "id": "i96iamx",
                                                                    "author": "jessquit",
                                                                    "score": 2,
                                                                    "created_utc": 1652950050.0,
                                                                    "response": "I'm replying to this higher level comment to point out that none of my comments below are intended as investment advice and should not be construed as such. I hope I've made it perfectly clear that I think the crypto market is a shambles of manipulation and do not believe it's possible to even offer sound investment advice in such a climate. If I were to give advice it would probably be to follow the manipulation and hope that you don't get rug-pulled. Or hedge everything like crazy. But that isn't investment advice either 😁",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i96ievb",
                                                                            "author": "Ok_Aerie3546",
                                                                            "score": 1,
                                                                            "created_utc": 1652950161.0,
                                                                            "response": "Its reddit, no ones gonna come after you.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i96j6z5",
                                                                                    "author": "jessquit",
                                                                                    "score": 2,
                                                                                    "created_utc": 1652950881.0,
                                                                                    "response": "I'm a mod of this sub. My role here is to foster healthy discussion. I think it's important to make it perfectly clear that I'm not here to suggest anyone purchase a particular cryptocurrency, not from the standpoint of legal liability, but as a demonstration of good faith.",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "id": "i96jfui",
                                                                    "author": "jessquit",
                                                                    "score": 2,
                                                                    "created_utc": 1652951105.0,
                                                                    "response": ">I was asking if you would be open to the idea of investing your saved bch into something else in the future. To get a better return.\n\nBy the way I don't hold all my investments in crypto, not by a long shot. I live by the advice I give others: don't invest more than you can afford to lose completely. My overall portfolio is a mix of investments.\n\nIn my opinion, diversification is the key to a solid return, despite the fact that there's always going to be some magic investment that would have earned better returns in hindsight if I had gone \"all in.\"\n\nThis isn't investment advice either 😁",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i984ta2",
                                    "author": "kostas_ck",
                                    "score": 1,
                                    "created_utc": 1652980939.0,
                                    "response": "Just hit the simple thing in mind that the future is yet unseen and none can say what would that bring.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i985go7",
                                            "author": "Ok_Aerie3546",
                                            "score": 1,
                                            "created_utc": 1652981201.0,
                                            "response": "Except that providing value and the institutions that provide value to the most people will always be valuable.\n\nPeople providing value to others is the actual scarcity.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i964i1q",
                    "author": "bitcoincashautist",
                    "score": 2,
                    "created_utc": 1652938539.0,
                    "response": ">If he wants to buy something worth 20 dollars at a BCH accepting store due to some advantage, then he should just convert 20 dollars into BCH and use them. Why convert the rest of your dollars?\n\nThis is exactly what people of St. Kittis are doing, here's their MP talking about it (and also note that he takes salary in BCH): https://youtu.be/IybKAL7C_Sg?t=7760\n\nEven if people do that, they still have to buy a little extra, right? It is very low, but it is not 0. Even if the fee is 0.01$, maybe you'd still keep around 1-2$ in BCH after paying for your thing, right? Now scale that to 1b users.\nWith 1MB blocks such low fees wouldn't amount to much, but think of the potential, imagine filling 32MB blocks with real commerce, 256MB blocks, and so on...\n\nBCH is like a pre-revenue startup... you either see the potential, or you don't. Once everyone sees it, it will be priced in.\n\nBut here's the plan for the next stage... cash is always exchanged for something, right? It's only one part of the trade, and right now with BCH only the cash part can be trustlessly and permissionlessly exchanged on the blockchain. The other part is a good or a service, it must be delivered, too. What if those are digitized? What if instead of signing a car, you transfer a digital record  of car ownership and police recognizes such record as \"car papers\". We're late to having native tokens, but once we have them, they are going to scale, massively: https://github.com/bitjson/cashtokens",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i96e3sj",
                    "author": "ActionParticular7697",
                    "score": 2,
                    "created_utc": 1652946245.0,
                    "response": "BCH is the long term coin, use it for real commerce, and for that reason it will come to dominate over time.  Not quickly, but inevitably.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i96stom",
                    "author": "WippleDippleDoo",
                    "score": 2,
                    "created_utc": 1652958800.0,
                    "response": "The incentive to hold peer to peer money is the issuance cap and utility (cheap, permissionless payments without relying on authority)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i971zdd",
                    "author": "smartguy_m",
                    "score": 2,
                    "created_utc": 1652964288.0,
                    "response": ">Its below the price it was in July 2017.\r  \n\r  \nWhat should be my incentive to hold it?\n\nYou named one of the incentives yourself. Lower price and stronger fundamentals means more upside potential.\n\nThe following are my personal incentives to hold Bitcoin Cash, they do not need to be incentives for everyone.\n\n1. My Bitcoin Cash wallet is my own bank account in my own bank. No one can freeze my account or prohibit certain my transactions for whatever excuse (like stupid AML of CTF). I literally have NO bank account with traditional banks. I simply do not need their \"services\".\n2. Bitcoin Cash has a limited number of coins. No one can print more than this amount, thereby depreciating them. That basically means than no John Smith (or whoever) from the central bank can get into my pocket and halve its contents simply by printing and carefully cutting the same amount of paper (or by just adding zeroes to his own account).  This also means that the real value of my coins is independent of the current price. This is why it makes sense to buy when the price is low and sell some when the price is relatively high.\n3. Bitcoin Cash has a relatively uniform distribution of coins among users, without much concentration of wealth in narrow circles of whales. [https://bitinfocharts.com/top-100-richest-bitcoin%20cash-addresses.html](https://bitinfocharts.com/top-100-richest-bitcoin%20cash-addresses.html) Compare this distribution to other coins. This means that it is not very likely that the price could collapse as a result of whales rushing to the exit.\n4. Bitcoin Cash allow everyone to perform quick transactions for a fraction of a penny. For holders this means very high potential for adoption as electronic cash, independent of governments and central banks, especially in these days when invasion of privacy, censorship, inflation and control over the population in general run rampant. And Bitcoin Cash is already adopted as electronic cash like no other coin. And the higher the adoption the higher the price.\n5. Bitcoin Cash price has high volatility. Yes, the combination of strong fundamentals and high volatility (precisely this combination, not just one thing or the other) is a big plus for me. It allows to make money by simply rebalancing a portfolio of some percentage (lets's say 50%) of dollars and some percentage of BCH. Instead of dollars or stablecoins I use short positions in perpetual futures, and keep most of my BCH in my non-custodial wallet. To rebalance my portfolio I just place limit orders in advance to buy or sell at calculated priced for calculated amounts. And they are executed automatically and with very low fees (perpetual futures generally have lower fees than spot). This way I not only reduce the volatility of the BCH price for me, but also make some money out of this volatility.\n\nHere I just outlined some of the incentives for me to hold BCH. And there are even more incentives to use BCH, but this is another topic.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i97oq1g",
                    "author": "CurvyGorilla202",
                    "score": 2,
                    "created_utc": 1652974479.0,
                    "response": "What I learned from this thread… we have some smart peeps in the group. Anyone who thinks we’re a bunch of delusional idiots, engage in the community. Challenge ideas, throw out questions, that is how we become better.\n\nGreat ideas thrive in the light, and we constantly are promoting discussion to bring dark corners into the light. That is how great communities THRIVE.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i97tlnt",
                            "author": "Ok_Aerie3546",
                            "score": 3,
                            "created_utc": 1652976445.0,
                            "response": "Yeah I kinda liked the no censorship part here. I did not even get downvoted much. That is a breath of fresh air.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i985z2c",
                                    "author": "CurvyGorilla202",
                                    "score": 2,
                                    "created_utc": 1652981408.0,
                                    "response": "Welcome everyone, listen to everyone, entrust no one",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i968n1q",
                    "author": "steadyfap",
                    "score": 4,
                    "created_utc": 1652941672.0,
                    "response": "Buying BCH right now is like buying BTC in 2013 and BCH works like BTC worked in 2013. Fast with low fees!\n\nYou are getting a second chance to buy the real bitcoin for under $200 and I expect BCH to eventually flip BTC.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9695im",
                    "author": "PanneKopp",
                    "score": 2,
                    "created_utc": 1652942081.0,
                    "response": "If you want a speculative answer to a speculative question I would say by fundamentials the chances of Bitcoin Cash BCH going x100 are by far higher then the chances of BTC (Bitcoin Core) are .",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i962da3",
                    "author": "TinosNitso",
                    "score": 0,
                    "created_utc": 1652937051.0,
                    "response": "For the losers among us it's often like the **gambler's fallacy**. If a tossed coin has landed tails repeatedly, then it ought to land heads next, to even out the score. If BCH is already down 5x from when we entered, it ought to go up in price.\n\nIf we want BCH to succeed then it has to be a **S**tore-**O**f-**V**alue, otherwise it shouldn't necessarily be recommended for payments, especially since many traders prefer USDT (tether). If BCH holders keep exiting by dumping coins, it (should) ruin the coin.\n\nIn my opinion, to defend their coin's value, BTC (& then ETH) holders kept **spamming** their own chains, to keep the TPS high, & then fees high. Without spam, prices would collapse. Then the spam got excessive, imo. The goal of BCH might be to either dissuade spam, or stop spam from permanently increasing fees to unreasonable levels. Once a spammer starts spamming, stopping the spam ruins the coin's value.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i963g4r",
                            "author": "Ok_Aerie3546",
                            "score": 1,
                            "created_utc": 1652937797.0,
                            "response": "Yeah buts not a coin toss right. Not a 50 50 independent trial. \n\nBch people say adoption this, adoption that. The places that accept bch are converting it immediately into their currency of choice. Coz if they werent, they would set the prices in bch. Thats not adoption, thats just the store accepting an alternative payment option. You still pay dollars but through bch.\n\nPeople arent taking loans in bch, and people arent lending out their bch.\n\nThats not an economy or any kind of adoption.\n\nI agree bitcoin doesnt have any adoption either, but atleast it goes up in price and miners constantly add more hashrate. There is just no inventive to hold bch.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i965qmj",
                                    "author": "SoulMechanic",
                                    "score": 7,
                                    "created_utc": 1652939421.0,
                                    "response": ">The places that accept bch are converting it immediately into their currency of choice. \n\nYou don't know that.\n\n>Coz if they werent, they would set the prices in bch.\n\nThat's not how price works, not initially.\n\n>Thats not adoption, thats just the store accepting an alternative payment option.\n\nAdoption in a largely free world market is small steps, don't get ahead of yourself. First you have to earn people's trust that it works and has advantages over other methods of payment. Even Apple pay and Google pay haven't made mass adoption, and all they are is a an extension of your debit/credit card.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i966ijp",
                                            "author": "Ok_Aerie3546",
                                            "score": 2,
                                            "created_utc": 1652940016.0,
                                            "response": "Apple pay doesnt have mass adoption?? Atleast in the US it does. You can even pay with a watch. How much more adoption do you need to call it mass adoption?\n\nAsk a store what they do with the bch, its obvious. They run a business, they need to buy raw material inventory. And no raw material supplier is saying \"Bitcoin Cash accepted here\".\n\nBch right now is just a hobby payment method for stores. If I make coupons and tell them to accept these coupons for payment, and Ill pay them 10 dollars per coupon, theyll even start accepting coupons. Thats how they treat bch.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9672xw",
                                                    "author": "SoulMechanic",
                                                    "score": 4,
                                                    "created_utc": 1652940441.0,
                                                    "response": "Where I live, no most people don't pay with Apple or Google.\n\nOver 50% of people using something is mass adoption.\n\n>Ask a store what they do with the bch, its obvious. They run a business, they need to buy raw material inventory. And no raw material supplier is saying \"Bitcoin Cash accepted here\".\n\nThere to go getting ahead of yourself again.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i967g9j",
                                                            "author": "Ok_Aerie3546",
                                                            "score": 1,
                                                            "created_utc": 1652940726.0,
                                                            "response": "Now calculate if credit cards have been mass adopted compared to debit cards. Crypto in general act like debit cards. I dont see more and more people going back to using debit cards, when credit cards offer so much more.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i967n96",
                                                                    "author": "SoulMechanic",
                                                                    "score": 3,
                                                                    "created_utc": 1652940880.0,
                                                                    "response": "What a pointless tangent.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i967yso",
                                                                            "author": "Ok_Aerie3546",
                                                                            "score": 1,
                                                                            "created_utc": 1652941134.0,
                                                                            "response": "It isnt a tangent, I dont think any crypto will see mass adoption ever just by being accepting in stores. Coz credit cards will always be the better form of payment.\n\nOnly way a crypto see mass adoption is if bitcoin get adopted by central banks, and they start accepting taxes on crypto gains in crypto itself. Plus we need crypto credit cards too.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i968jdf",
                                                                                    "author": "SoulMechanic",
                                                                                    "score": 4,
                                                                                    "created_utc": 1652941591.0,
                                                                                    "response": "You're thinking from a first world country and consumer perspective.\n\nNow think from a poorer countries and business owners perspective. Think of families sending abroad, global destinations, online transactions, tips, etc etc.\n\nYou world view is very narrow, you need to step out of your bubble.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i968yjb",
                                                                                            "author": "Ok_Aerie3546",
                                                                                            "score": 1,
                                                                                            "created_utc": 1652941930.0,
                                                                                            "response": "I have lived most of life in a third world country. \n\nAll those use cases you mentioned are not reasons to hold bch. I can buy bch, and send it to someone in some other country and he'll sell it and say thank you. \n\nBut none of us will hold bch for this reason.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "id": "i96925i",
                                                                                    "author": "undadatunda",
                                                                                    "score": 1,
                                                                                    "created_utc": 1652942009.0,
                                                                                    "response": "the whole point of bitcoin is to get rid of central banks and their manipulation by a few over..everything\n\nalso 'credit' cards are like the devils work..the same thing where the few control the many",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i96a3yc",
                                                                                            "author": "Ok_Aerie3546",
                                                                                            "score": 1,
                                                                                            "created_utc": 1652942844.0,
                                                                                            "response": "Central banks might be evil. But businesses will always have value. Otherwise who will you work for. \n\nWill you make your own cars, electricity, food, chickens.\n\nEverything doesnt need to be self sovereign. Business work because people allow themselves to lose sovereignity and that takes society ahead.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i96i4or",
                    "author": "gnahor",
                    "score": 1,
                    "created_utc": 1652949897.0,
                    "response": "Its all about the price for you, isn't it? Maybe you arent a BTC maxi, but an $ maxi?\n\nI'm \"holding\" some of my BCH since 2011 and have seen some decent gains since then, so why wouldn't i?\n\nWhy would anyone who bought BTC in Nov '21 hold on to them?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i96id7v",
                            "author": "Ok_Aerie3546",
                            "score": 1,
                            "created_utc": 1652950118.0,
                            "response": "A store of value has to appreciate in price in dollars if dollars are losing value every year. The longer you wait, the more dollars get inflated, the more you benefit.\n\nThere has never been a store of value that kept getting cheaper over time.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i96iwwi",
                                    "author": "gnahor",
                                    "score": 1,
                                    "created_utc": 1652950628.0,
                                    "response": "i did not buy Bitcoin in 2011 to store value.. i've been (and still am) interested in the electronic-cash use case.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i96xzlr",
                    "author": "Keiji505",
                    "score": 1,
                    "created_utc": 1652962045.0,
                    "response": "Thought that Bitcoin cash was meant to be spent nor like it was meant to be hold!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i97b1yi",
                    "author": "Hefty-Scallion-8499",
                    "score": 1,
                    "created_utc": 1652968676.0,
                    "response": "Why put all your savings into one asset either way?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i97f4am",
                    "author": "Mafalzon",
                    "score": 1,
                    "created_utc": 1652970458.0,
                    "response": "This is why: https://youtu.be/de7z7jPqBjc\n\n(Link to a video I made explaining why I hold BCH.)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i990hnm",
                    "author": "Shefpan",
                    "score": 1,
                    "created_utc": 1652994681.0,
                    "response": "I hold my BCH in case I get the chance to travel internationally.  No need to exchange currency.   Not much use for it around where I live.  If it's dollar value increases, double bonus.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i95ffwv",
                    "author": "undadatunda",
                    "score": 0,
                    "created_utc": 1652924608.0,
                    "response": "im waiting to see what coin will be dropping 'many' forks into the hodlers hands then that will be the incentive to hold that coin..which has to be one of the versions of bitcoin cuz bitcoin is the only coin that had a fair start and now since the discovery of bitcoin a fair start is impossible for any 'new' coins\n\nhttps://old.reddit.com/r/Bitcoin/comments/m79l3c/bitcoins_fair_launch_cannot_ever_be_replicated_by/",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i95fvl5",
                            "author": "Ok_Aerie3546",
                            "score": 1,
                            "created_utc": 1652924811.0,
                            "response": "Yes I know this, but then why hold bitcoin cash?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i96e0nk",
                                    "author": "shevvir",
                                    "score": 1,
                                    "created_utc": 1652946167.0,
                                    "response": "I don't know I see like holding Bitcoin cash would bring you nothing.\n\nAs we see that as days pass the rapid increase in the adoption and the acceptance as a peer to peer electronic cash is what a major concern is!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i96551r",
                            "author": "Caesar91core",
                            "score": 1,
                            "created_utc": 1652938987.0,
                            "response": "So what you wanna say to hold Bitcoin Cash. But the fact that would be indeed better to hold!",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i967w8d",
                                    "author": "undadatunda",
                                    "score": 1,
                                    "created_utc": 1652941078.0,
                                    "response": "the op is asking about 'incentives' to hold bch and idk maybe pow dont have any incentives besides number go up tech..but number go up tech wont work if the coins turn back into paper i.o.u's\n\npos has incentive to hold the coin because you can stake it..but still pos is flawed in other ways",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i96ad6n",
                    "author": "undadatunda",
                    "score": 0,
                    "created_utc": 1652943059.0,
                    "response": "it seems all proof of work coins have this problem and that is there is no incentive to hold them besides number go up tech\n\nso whats happening is that the pow coins are doing things like lending their coin out to the shorters..but that ruins the whole supply and demand formula\n\nbut if a coin was dropping 50+ forks a day into the hodlers hands then you can have a pow coin that has 'incentive' to hold it\n\ni dont see how bch can escape this same problem..unless this community embraces forking from this coin and also need a exchange that will list all of the forks too without hinderances",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i96axih",
                            "author": "Ok_Aerie3546",
                            "score": 3,
                            "created_utc": 1652943526.0,
                            "response": "Forking doesnt give you more money. It just divides the market cap between the two forks.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i96c0ix",
                                    "author": "undadatunda",
                                    "score": 1,
                                    "created_utc": 1652944426.0,
                                    "response": "actually the forks create value because they are done for idea creation or improvements which right now is being done with premined coins which are where most of the value is according to bitcoin dominance stats\n\nso if bitcoin or bch cant do value creation by forking for the ideas then that value will go to the premined coins and the centralized exchanges like that cuz they are demanding lots of money to list a coin but a premined coin can just give a cut to the exchanges to list the coin\n\nalso\n\nhttps://old.reddit.com/r/btc/comments/us88vj/an_interesting_quote_from_theymos_the_user_who/i9675oc/?context=3",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i96t5vr",
                            "author": "WippleDippleDoo",
                            "score": 1,
                            "created_utc": 1652959034.0,
                            "response": "Finance without relying on authority is the fundamental value proposition",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}