{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uunog1",
            "title": "Machine Learning applied to cryptos",
            "url": "https://www.reddit.com/r/btc/comments/uunog1/machine_learning_applied_to_cryptos/",
            "author": "Crypt0_Bot",
            "created_utc": 1653141504.0,
            "score": 0,
            "num_comments": 2,
            "subreddit": "btc",
            "selftext": "Im following this guy since a few days [https://twitter.com/CallbotCrypto](https://twitter.com/CallbotCrypto). He's sharing his Deep Learning analyses . It seems to me a very interesting project. He uses different Machine learning algorithms to predict the trends of cryptos. What do you think?\n\nhttps://preview.redd.it/fgz9gjzv4u091.jpg?width=1329&format=pjpg&auto=webp&s=bf266e4ac39db3ebab021b028fe3ab2b97b1b631",
            "stickied": false,
            "comments": [
                {
                    "id": "i9glvsu",
                    "author": "rainbowlunarian",
                    "score": 1,
                    "created_utc": 1653148091.0,
                    "response": "Sounds like an interesting project, to be honest. I did a quick glance of the whitepaper, and i think it's neat that the learning algorithm takes into account social trends from many different sources. I'm not sure how it differs from other trading algorithms, since the whitepaper says that it doesn't significantly outperform other bots (and I'm not familiar enough with trading bots to know their algorithms). However, ≈86% accuracy is nothing to scoff at.\n\nIt sounds like a person could make some decent profits following the bot, except the exchange spread might eat up a lot of it (if a person exits the trade at 4% profit). I wonder if their algorithm is being refined to identify good exit points as well.\n\nPersonally though, I'm here for the idea of decentralized peer-to-peer cash and escaping the current fiat system. I usually don't have time or resources, nor do I have the desire, to play the markets for short-term trades. So this would probably be a project that I keep up with occasionally, just for fun and curiosity.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}