{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "um1hgg",
            "title": "El Salvador just bought 500 BTC @ $30744",
            "url": "https://twitter.com/nayibbukele/status/1523742670044413954",
            "author": "johndoeisback",
            "created_utc": 1652130759.0,
            "score": 3,
            "num_comments": 5,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i7zq44g",
                    "author": "swgo1",
                    "score": 3,
                    "created_utc": 1652144015.0,
                    "response": "Why dont they buy BCH?",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "um5q9p",
            "title": "The price may be down, but the activity happening on Smart BCH is way UP!",
            "url": "https://i.redd.it/0j3y88bdnjy81.png",
            "author": "MemoryDealers",
            "created_utc": 1652142856.0,
            "score": 85,
            "num_comments": 16,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i7znnyb",
                    "author": "MemoryDealers",
                    "score": 22,
                    "created_utc": 1652142912.0,
                    "response": "In the screen shot above, the tx rate may be even higher than what is happening on the BCH base chain.   \nSource: [smartscan.cash](https://www.smartscan.cash)",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i80mklq",
                            "author": "moleccc",
                            "score": 7,
                            "created_utc": 1652160444.0,
                            "response": "You're saying smartBCH is a better L2 than lightning? 🤣",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i80vhh6",
                                    "author": "leonidasmark",
                                    "score": 5,
                                    "created_utc": 1652167118.0,
                                    "response": "It's not an Layer 2. It's a sidechain",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i81z4j1",
                            "author": "ShortSqueeze20k",
                            "score": 3,
                            "created_utc": 1652192890.0,
                            "response": "Smartscan.cash is good, but it could be better if it had metrics like 'total transactions last 24 hours' 'transactions broken down by contract (shows how many transactions mist, verse, coinflex etc are generating). \n\n'How much the user saved by using smartbch vs ethereum'",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i7zydx9",
                            "author": "chriswilmer",
                            "score": 3,
                            "created_utc": 1652147712.0,
                            "response": "Great!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i81fd28",
                    "author": "pacman78",
                    "score": 5,
                    "created_utc": 1652183147.0,
                    "response": "Anybody know when decentralized bridge will be online?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i826n6l",
                            "author": "Shibinator",
                            "score": 3,
                            "created_utc": 1652195902.0,
                            "response": "Last we heard was estimated for September this year.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8130b0",
                    "author": "Zealousideal_Year551",
                    "score": 4,
                    "created_utc": 1652173774.0,
                    "response": "Most of the time its 0-1 tx per block",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "um9w8f",
            "title": "Steel fabrication company accepts BitcoinCash 👏🏼",
            "url": "https://youtube.com/watch?v=6ziILiOBOko&feature=share",
            "author": "BitcoinCashCity",
            "created_utc": 1652155688.0,
            "score": 32,
            "num_comments": 7,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i80eowz",
                    "author": "BitcoinCashCity",
                    "score": 11,
                    "created_utc": 1652155729.0,
                    "response": "Bitcoin Cash merchants in the service industry are growing rapidly in the Bitcoin Cash City!  🕺🏼\n\nRydweld is a North Queensland owned and operated car body fabrication company based in Townsville. They service the whole of North and West Queensland which covers a massive expanse of land. Rydweld build and fit custom trays, bullbar, side rails, toolboxes, canopies and even dog trailors and how good is it that they accept BCH as payment for their serv ices!?\n\nOur latest video for this Bitcoin Cash merchant is just pure magic. 👏🏼\n\nCheck out 🎥 DigiRyder 's work.\n\n[www.rydweld.com](http://www.rydweld.com)\n\n\\#rydweld #BCH #BCHmerchant #tradesandservices #carfabrication #bullbars #watertanks #toolboxes",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i80m4wx",
                    "author": "bitcoinjason",
                    "score": 9,
                    "created_utc": 1652160150.0,
                    "response": "Solar panel suppliers, 4x4 modification and rego services. Builders and Trades can get their work vehicle customised for work and then go camping!!!!\n\nTHIS IS GREAT!!!!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i80km09",
                    "author": "EmergentCoding",
                    "score": 10,
                    "created_utc": 1652159146.0,
                    "response": "Great to see industry adopting Bitcoin Cash. The Bitcoin Cash economy is growing at a great clip.  Congratulations.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "umdpkz",
            "title": "Never trusted stable coins",
            "url": "https://twitter.com/AlexCobb_/status/1523815617421262848",
            "author": "squarepush3r",
            "created_utc": 1652170464.0,
            "score": 7,
            "num_comments": 8,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i814kby",
                    "author": "Plenty_System45",
                    "score": 6,
                    "created_utc": 1652175155.0,
                    "response": "Or never trust Terra Luna",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i81xfzf",
                    "author": "Twoehy",
                    "score": 3,
                    "created_utc": 1652192181.0,
                    "response": "We’re reposting from bsv subs now?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i822vam",
                            "author": "Zyoman",
                            "score": 3,
                            "created_utc": 1652194415.0,
                            "response": "I'm no fan of BSV but if the information is relevant it should be. No matter who post it.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "um4svl",
            "title": "Electron Cash now supports SmartBCH LNS",
            "url": "https://www.reddit.com/r/btc/comments/um4svl/electron_cash_now_supports_smartbch_lns/",
            "author": "OrangeJyzu",
            "created_utc": 1652140023.0,
            "score": 40,
            "num_comments": 7,
            "subreddit": "btc",
            "selftext": "Electron Cash has just released a new version that includes support for SmartBCH LNS. You can now send money to LNS names.\n\nThis new integration will make it much easier for people to send their money to other wallets.\n\n[https://twitter.com/cculianu/status/1522977868816723968](https://twitter.com/cculianu/status/1522977868816723968)",
            "stickied": false,
            "comments": [
                {
                    "id": "i80ux4z",
                    "author": "knowbodynows",
                    "score": 3,
                    "created_utc": 1652166646.0,
                    "response": "> You can now send money to LNS names (e.g. calin.bch) which end up resolving to BCH addresses. See Tools -> Lookup LNS Names. \n\nAlso includes higher 10BCH level shuffle tier.\n\nIt's fun to browse the considerable effort of [this registrant](https://app.bch.domains/address/0x3b968177551a2aD9fc3eA06F2F41d88b22a081F7) who went all in on the name-grabbing business plan.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7zi1ar",
                    "author": "Joe_Omg",
                    "score": 4,
                    "created_utc": 1652140354.0,
                    "response": "I saw this last week, very cool improvement for lns and electron cash",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7zp1q0",
                            "author": "sheev2001",
                            "score": 3,
                            "created_utc": 1652143531.0,
                            "response": "Hey man have you tried having two domains by any chance?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7zub3j",
                                    "author": "Joe_Omg",
                                    "score": 3,
                                    "created_utc": 1652145909.0,
                                    "response": "For sure. Actually, I got 3 for myself.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "id": "um2zem",
            "title": "Flipstarter: Hercules A Multisignature Self Custody Wallet For IOS, Android",
            "url": "https://www.reddit.com/r/btc/comments/um2zem/flipstarter_hercules_a_multisignature_self/",
            "author": "jjmhtp",
            "created_utc": 1652134810.0,
            "score": 5,
            "num_comments": 6,
            "subreddit": "btc",
            "selftext": "Hello to everybody on r/btc\n\nMy name is Jiajun Qian, I'm a developer currently building out an open source self custody mobile wallet for Bitcoin Cash.  The project aims to provide users with a self custody wallet that's accessible to anyone via IOS, and Android. The Hercules wallet features an optional Multisignature setup permitting multiple users, signers to join into the mobile setup configured by the user (2-of-3, 2-of-2, 1-of-4, etc).  Together each of the cosigners sign off on transaction proposals for the funds being held in custody through the mobile client.\n\nI go into a bit more detail demonstrating the various types of different use cases, applications that the mobile wallet can serve in the Flipstarter campaign linked here: [http://flipstarter.bchhub.cash](http://flipstarter.bchhub.cash)\n\nWhile I continue to build out the mobile wallet; I'm also working on making the latest consensus changes scheduled to activate next week on May 15th to the badger-cash node library [https://github.com/bitcoincashhub/bcash](https://github.com/bitcoincashhub/bcash) .  Since the Multisignature library that the mobile wallet utilizes, is built on the badger-cash node library I believe it's good practice to update the library. In the same regard I'd like to be able to provide as much infrastructure tools, and applications to developers as possible during the process of me working on the mobile wallet.  \n\nAll of these projects are and will be hosted here : [https://github.com/bitcoincashhub](https://github.com/bitcoincashhub) .\n\nI'm dedicating as much time as possible into building out the mobile wallet. In search of achieving the milestones I've set for the projects beta release listed in the projects proposal section in the Flipstarter campaign. Please take a look at the campaign and support if the project, and  projects I'm working on seem valuable and worth supporting to you and the community.  My end goal is to improve the current Bitcoin Cash ecosystem and create great projects that can be used for to for everyday use . \n\n&#x200B;\n\nI'm able to be reached at via email at: [jiajunwuqiong@gmail.com](mailto:jiajunwuqiong@gmail.com) / [jjqian@163.com](mailto:jjqian@163.com)\n\nAnd on telegram, wechat:   jjqian01\n\nI want to thank all of the Bitcoin Cash supporters, and developers who help make Bitcoin Cash the best form of digital currency available in the world. I'm looking to continue building out great projects and advance the current ecosystem this year with new applications, projects under the BitcoinCashHub organization.\n\nI am also actively looking for new opportunities in the Bitcoin Cash development space as well. If there are any projects and teams looking for active contributors please reach out to me and let me know!",
            "stickied": false,
            "comments": [
                {
                    "id": "i7zi9tl",
                    "author": "LovelyDayHere",
                    "score": 3,
                    "created_utc": 1652140462.0,
                    "response": "Hercules sounds interesting!\n\n> I'm also working on making the latest consensus changes scheduled to activate next week on May 15th to the badger-cash node library\n\nWow, that's surely an ambitious work for which I wish you all the success!\nIt would be great to have the 'bcash' client join the rest of actively maintained full nodes again.\n\nUntil the library/node reaches full May 2022 consensus capability, are you running your wallet against other backend nodes?\n\nhttps://github.com/jiajunwuqiong/bcash/commits/cosmicinflation-hardfork\n\nOut of interest: I have not seen any other client refer to this coming upgrade as the \"Cosmic Inflation\" hardfork.\n\nDid you come up with that name or where does the name originate?\n\n> this.logger.warning('Cosmic Inflation has been activated.');\n\nlol, hopefully people will not be disconcerted by this log message! :)\n\nI appreciate your introduction of yourself and your project. Please keep us informed here of significant updates!",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "umfp59",
            "title": "Genuine question: Why should I prefer Bitcoin Cash over other coins like Litecoin or Monero for simple transactions?",
            "url": "https://www.reddit.com/r/btc/comments/umfp59/genuine_question_why_should_i_prefer_bitcoin_cash/",
            "author": "Blargon707",
            "created_utc": 1652179004.0,
            "score": 59,
            "num_comments": 102,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i81bitz",
                    "author": "LovelyDayHere",
                    "score": 65,
                    "created_utc": 1652180655.0,
                    "response": "It's a nuanced discussion.\n\nLet's do __Litecoin__ first. It's described by BTC camp as an incentivized testnet for their coin, and in practice follows the same kind of strategy as Bitcoin Core (LN as payment layer, severely restricted L1 capacity). That means despite slightly higher on chain capacity (4x what BTC can do), it essentially won't scale as global p2p cash _on chain_. This is very different from the approach that Bitcoin Cash takes, which is to accommodate as much capacity as technically possible on the blockchain, and to keep block space supply above demand so that it does not enter a cash-destructive fee bidding zone. Roughly, BCH is committed to raising the block size and solving the problems around dealing with that, in order to preserve the basic economic incentives of the p2p cash system, whereas Litecoin, like BTC, has embarked on a course of separating payment layer and settlement layer, ultimately. But ask yourself: If that strategy works on BTC, why would Litecoin be needed at all? Really, only as a testnet.\n\n__Monero__ has stronger privacy (all transaction are cryptographically privacy-protected, no exceptions) whereas BCH has opt-in privacy via CashFusion. This is a tradeoff zone, as the BCH thinking here goes towards at scale, fungibility will arise as long as the mixing is strong enough, and doing that allows BCH to scale slightly better and have some stronger cash-like properties (such as enabling respending of even unconfirmed coins, which provides for basically _instant_ transactions if the parties involved accept the risk for a given transaction. Double Spend Proofs provide additional confidence in the ~3 second timeframe, which is practically good enough for retail).\n\nBitcoin Cash and Litecoin, being descendants of BTC, have advantages over Monero's CryptoNote protocol when it comes to smart contracting. BCH is building out that capability, and even enabling sidechains like SmartBCH which offer full EVM-level scripting capability. That's not accessible on Litecoin or Monero. Also, since it doesn't require scanning all block contents to do Simplified Payment Verification on BCH (and Litecoin), it is easier to construct light wallets for BCH and LTC, and that's why there is a larger choice of e.g. mobile wallets than for Monero.\n\nTL;DR: small, simple transactions will scale better on BCH than on both Litecoin and Monero, but Monero for now has an edge in the privacy domain when it comes to use cases where privacy is more important. \n\n---\n\nDisclaimer: this is a very brief summary of my main feelings about the differences of these coins. There is surely much more to discuss, but I will leave it up to others to delve into that.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i81gxe3",
                            "author": "Blargon707",
                            "score": 17,
                            "created_utc": 1652184082.0,
                            "response": "Thanks I appreciate it",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i81kpq5",
                                    "author": "TooDenseForXray",
                                    "score": 12,
                                    "created_utc": 1652186208.0,
                                    "response": "Side not I would XMR and BCH being complementary, one excel in the area the other one underperform.  \n\n\nBut optimising BCH to beat XMR would give a horse.. and same on the reverse.\n\nMuch better using both for their respective qualities together.  \n\n\nLitecoin in my opinion, I don't see the point. it is yet another low capacity coin..",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i821ckr",
                            "author": "Choice-Business44",
                            "score": 5,
                            "created_utc": 1652193804.0,
                            "response": "BCH scales much better not just slightly but cashfusion does not compare to moneros privacy. The former is more important for the global reserve currency",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i82hxkg",
                            "author": "knowbodynows",
                            "score": 3,
                            "created_utc": 1652200337.0,
                            "response": "Totally agree. Ánd this is the fairest lite that Litecoin could be painted in. Well laid out.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i81hyjp",
                    "author": "big--if-true",
                    "score": 17,
                    "created_utc": 1652184684.0,
                    "response": "Litecoin doesnt scale.\n\nMonero transaction sizes are larger than BCH and so it scales less well for everyday transactions that dont specifically require anonymity at the protocol level.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i82i9ib",
                            "author": "E7ernal",
                            "score": 4,
                            "created_utc": 1652200464.0,
                            "response": "Monero scales just as well as BCH, it just has a higher constant requirement. In fact, it actually has no hard limit on block size anyways.\n\nThe reality is neither will bog down or fail on you, and both are really reliable and cheap right now.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i82q500",
                                    "author": "LovelyDayHere",
                                    "score": 4,
                                    "created_utc": 1652203629.0,
                                    "response": ">Monero scales just as well as BCH\n\nFor full nodes, I think something like UTXO commitments (or utreexo) is pretty important, to not have to download and validate the entire chain but be able to fast-sync to a UTXO set.\n\nDoes Monero research provide any way of having an equivalent?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i83zski",
                                            "author": "Rucknium",
                                            "score": 3,
                                            "created_utc": 1652222240.0,
                                            "response": "I consider \"Pruning of spent outputs\" an open research question. In fact, I put it on [the list of Monero's open research questions](https://github.com/monero-project/research-lab/issues/94) that I maintain for the Monero Research Lab.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i81a32y",
                    "author": "ApplicationAny1434",
                    "score": 16,
                    "created_utc": 1652179626.0,
                    "response": "2017 BTC fees gone up to$50. To use that you switched to Litecoin...send....switch back to BTC. Litecoin fees went from around $0.30 to $5. It was cheaper but still too much.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i81iera",
                    "author": "BewareOfShills",
                    "score": 15,
                    "created_utc": 1652184943.0,
                    "response": "Because BitcoinCash works, not just now but also when millions of people use it.\n\nBCH is the only PoW coin that scales, is working on scaling and is dead set on real world adoption.\n\nAt the moment coins like LTC have a slight advantage in exchange to exchange transfers but that is all. It will clog up like BTC if there is any real traffic. \n\nMonero is good for privacy but other metrics like tail emission and their scaling approach let me value it less than BCH.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i82xq92",
                            "author": "psiconautasmart",
                            "score": 3,
                            "created_utc": 1652206696.0,
                            "response": "The tail emission is an economic incentive mechanism that I think people around here should take a better look at. It asymptotically approaches zero% inflation while security not depending exclusively on tx fees.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i81tdjl",
                            "author": "Aggravated-Bread489",
                            "score": 4,
                            "created_utc": 1652190390.0,
                            "response": "The tail emission isn't so bad and it might actually be a good thing. I wrote off Monero at first just because of the tail emission, but I'm not as opposed to it as I've learned more about it.\n\nSome point v** that gave me comfort with it are:\n1. Inflation is fixed and calculatable in my lifetime\n2. Because the inflation is fixed, the inflation *rate* trends towards 0%\n3. The inflation *rate* is the highest now than it will ever be (because it trends towards 0) and it is less than 2%. I *think* Monero's inflation rate is actually lower than Bitcoin's right now, but I could be wrong about that.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i82if8t",
                                    "author": "E7ernal",
                                    "score": 5,
                                    "created_utc": 1652200525.0,
                                    "response": "Ya, in practice tail emission and mining inflation are pretty similar and both are known quantities which are good for a money.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i82hpgy",
                    "author": "E7ernal",
                    "score": 7,
                    "created_utc": 1652200249.0,
                    "response": "BCH has mobile SPV so is more secure and less hassle to use on the go.\n\nXMR has the best privacy and proven scalability, reliability, and security.\n\nLTC is dogshit copycat BTC that might work but why use it when BCH is proven to work at scales LTC can't hit.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i82qmff",
                            "author": "LovelyDayHere",
                            "score": 4,
                            "created_utc": 1652203825.0,
                            "response": "> LTC is dogshit copycat BTC that might work but why use it when BCH is proven to work at scales LTC can't hit.\n\nJust to play Charlie's advocate:\n\nLTC has a faster block confirmation target time than BCH, so it is popular among exchange users (I would say exchanges frequently apply excessive confirmation requirements to BCH transactions, for various reasons).",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i81o3gh",
                    "author": "Shibinator",
                    "score": 10,
                    "created_utc": 1652187921.0,
                    "response": "https://bitcoincashpodcast.com/faqs/bch/why-bitcoin-cash\n\nhttps://bitcoincashpodcast.com/faqs/Cryptocurrency/what-about-litecoin-ltc\n\nhttps://bitcoincashpodcast.com/faqs/Cryptocurrency/what-about-monero-xmr",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8276bz",
                            "author": "_pokkst",
                            "score": 10,
                            "created_utc": 1652196110.0,
                            "response": "For XMR:\n\n> **Inaudibtable supply**\n\nThere are two ways to \"verify\" the supply of the network. One, all block rewards and transaction fee amounts are publicly viewable. There's no cryptography hiding that.\n\nSecond, after adding up all of the block rewards, you can then run through each transaction and ensure the mathematical proof checks out. This is the same type of cryptography that CashFusion uses when players submit their commitments and components to the CashFusion to ensure no one is lying about their amounts in the Fusion.\n\n> Given that scarcity of supply is a critical component of cryptocurrency's monetary properties\n\nSays who? There are a lot of coins with no supply cap. Monero is still deflationary, actually. As the supply grows from the upcoming tail emission, eventually the amount of new coins coming in and adding to the supply will have less and less of an impact, meaning the inflation rate will go down.\n\n> **Inability to do public accounting**\n\nThis is false. Monero has opt-in transparency. If a charity organization or whoever chooses to, they can share a view key so that everyone can view incoming transactions and see how much XMR the charity has received. However, outgoing transactions cannot be reliably viewed as of 2017. So this statement:\n\n> BCH allows for both transparency or privacy where suited, while XMR gains increased privacy at the cost of the option for transparency.\n\nis completely false.\n\n> **Regulatory pressure**\n\nIf your coin isn't under regulatory heat and pissing off governments, then you're doing something wrong.\n\n> **Global scalability**\n\nWhile true, currently the XMR chain is smaller than the BCH/BTC chains, and with storage prices always on a downtrend and storage capacity always making improvements, this isn't an issue. Funny how it's not an issue for BCH, but it is for XMR? Lol.\n\nXMR already has a dynamic block size limit, a feature that BCH has had \"planned\" for several years.\n\nSad to see the BCH community be so dishonest about other currencies sometimes. Just thought I'd correct a few things here, though.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i82mwt2",
                    "author": "FamousM1",
                    "score": 3,
                    "created_utc": 1652202295.0,
                    "response": "monero requires a stronger computer to create a sign a transaction than BCH in my experience. sometimes it'll take 10 minutes to create a transaction on my 2011 imac and if it takes that long then I get an error about being out of sync\n        \nlitecoin is good when no one is using it but when people use it the fees go up too",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i81uiv6",
                    "author": "mrtest001",
                    "score": 6,
                    "created_utc": 1652190904.0,
                    "response": "You can rephrase your question as \"Why should I prefer *Bitcoin* over .... \"\n\n\"Bitcoin Cash\" IS Bitcoin but with a different name.  The original \"Bitcoin\" design is bare-metal p2p cash - and I have seen nothing that beats \"Bitcoin\" for being p2p cash.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i820dxn",
                    "author": "WippleDippleDoo",
                    "score": 5,
                    "created_utc": 1652193412.0,
                    "response": "BitcoinCash and Monero are complementary. You don’t have to choose between them, you can embrace both.\n\nLitecoin is a fraudulent scheme released by the scammer Charlie Lee who has been preaching “hodl” while dumping on greater fools. That project doesn’t even have a roadmap outside of copying BlockstreamCore and it has huge technical debts.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i827tsq",
                    "author": "rshap1",
                    "score": 3,
                    "created_utc": 1652196370.0,
                    "response": "Try some and let us know what you think\nu/chaintip",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "umdz40",
            "title": "The crypto community",
            "url": "https://i.imgflip.com/6fkuun.jpg",
            "author": "BewareOfShills",
            "created_utc": 1652171652.0,
            "score": 40,
            "num_comments": 16,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i813vnz",
                    "author": "user4morethan2mins",
                    "score": 3,
                    "created_utc": 1652174540.0,
                    "response": "*le parfait*",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "um9kmr",
            "title": "Reputable gold sellers where I can take delivery?",
            "url": "https://www.reddit.com/r/btc/comments/um9kmr/reputable_gold_sellers_where_i_can_take_delivery/",
            "author": "myfavoritesparestuff",
            "created_utc": 1652154625.0,
            "score": 3,
            "num_comments": 4,
            "subreddit": "btc",
            "selftext": "Hi all. I'm concerned about hyperinflation in the U.S. I'm in the U.S so I'd like to get me some gold and silver to hang onto, just in case. I've already got all the crypto I'm going to buy, and much of that is BCH. But it's time to get into something physical as well. So can anyone recommend a reputable gold and silver seller? I would just buy it off ebay but maybe they send you fools gold or a yellow rock. \n\nThanks!",
            "stickied": false,
            "comments": []
        },
        {
            "id": "umcu2l",
            "title": "A Focus On The Bitcoin Cash Ecosystem: 03 Bitcoin Cash Node (BCHN)",
            "url": "https://v.redd.it/n9vxudcbmly81",
            "author": "GeneralProtocols",
            "created_utc": 1652166707.0,
            "score": 38,
            "num_comments": 8,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i80vhn4",
                    "author": "GeneralProtocols",
                    "score": 7,
                    "created_utc": 1652167122.0,
                    "response": "Article and further BCH node links: https://read.cash/@GeneralProtocols/a-focus-on-the-bitcoin-cash-ecosystem-03-bitcoin-cash-node-bchn-b78afe19",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i82k49q",
                    "author": "knowbodynows",
                    "score": 4,
                    "created_utc": 1652201187.0,
                    "response": "##Banking on Freedom\n\nLove this tagline.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "umcwxy",
            "title": "Shopping in Tokyo with Crypto! Watch Akane and her friends buy lots of goods in Japan with Bitcoin Cash.",
            "url": "https://twitter.com/SatoshiAngels/status/1523879977225052160?s=20&t=Azu6uvG4-skCgiv_fjpVbg",
            "author": "satoshis_angels",
            "created_utc": 1652167021.0,
            "score": 26,
            "num_comments": 8,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "umg43m",
            "title": "How to Connect to Decentralized Internet (Web3) in 2022",
            "url": "https://medium.com/@Pointnetwork/tutorial-how-to-connect-to-decentralized-internet-web3-in-2022-c6810d64f5e5",
            "author": "josh252",
            "created_utc": 1652180631.0,
            "score": 7,
            "num_comments": 4,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "um5khv",
            "title": "UST (TerraUSD) collapsing is proof that premined trash in the top ten coins is a meaningless metric. BCH are the OG Bitcoin big blockers, and we will rise and take market share from Banks, Visa, Mastercard, Western Union, Government inflation taxes. The technology scales and works.",
            "url": "https://www.reddit.com/r/btc/comments/um5khv/ust_terrausd_collapsing_is_proof_that_premined/",
            "author": "big--if-true",
            "created_utc": 1652142365.0,
            "score": 52,
            "num_comments": 10,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i801y02",
                    "author": "GETSOME88-007",
                    "score": 14,
                    "created_utc": 1652149313.0,
                    "response": "That’s what I’m F’ing Talking About!!!!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i810lh7",
                    "author": "chainxor",
                    "score": 11,
                    "created_utc": 1652171618.0,
                    "response": "Yes, absolutely!   \nThe awakening will be rude for some. \n\n\\#BCHPLS",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i807ldm",
                    "author": "btcxio",
                    "score": 16,
                    "created_utc": 1652152047.0,
                    "response": "UST is fully centralized as today they did unthinkable things such as limiting redemptions and having exchanges halt trading. It’s not decentralized when DoKwon can control the whole show.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i80weqp",
                            "author": "i_have_chosen_a_name",
                            "score": 15,
                            "created_utc": 1652167916.0,
                            "response": "Yeah they asked Binance to make it impossible to sell UST for less then 70 cents and disable withdrawal to prevent arbitrage. \n\nlol\n\nThe people that control this system never allow you to make money at their expense, just like the system we already have!!",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i810jqf",
                                    "author": "chainxor",
                                    "score": 6,
                                    "created_utc": 1652171574.0,
                                    "response": "LOL indeed",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "id": "umb4qy",
            "title": "Subtipper has just tipped the top posts for this community! [05:21 GMT May 10, 2022]",
            "url": "https://www.reddit.com/r/btc/comments/umb4qy/subtipper_has_just_tipped_the_top_posts_for_this/",
            "author": "rbtc-tipper",
            "created_utc": 1652160075.0,
            "score": 11,
            "num_comments": 7,
            "subreddit": "btc",
            "selftext": "Thanks to all posters for providing great content!\n\nThe top posts since the last payout (~1 week) have been tipped 1 US cent per vote, or 4243 sats per vote.\n\nFor an explanation of Subtipper and how it works, please see [this article](https://read.cash/@dave_gutteridge/subtipper-8e6564f2).\n\n&nbsp;\n\nWinning posts:\n***\n\n[History repeats](https://np.reddit.com/r/btc/comments/ukt18e/history_repeats/) by u/user4morethan2mins\n\n[[tip](https://np.reddit.com/r/btc/comments/ukt18e/history_repeats/i80m0th/)] - 118804 sats = 0.00118804 BCH = ~0.28 USD\n\n\n***\n\n&nbsp;\n\nTips not claimed within 7 days will be returned to the Subtipper fund and tipped out to future posts.\n\n&nbsp;\n\nTo support this bot, help spread Bitcoin Cash, and encourage great content in the r/btc community, tip this post using Chaintip by including u/chaintip in your comment!\n\nThanks!\n\nNote: this payout event was triggered by [block 739479](https://explorer.bitcoin.com/bch/block/000000000000000003cbb3704fdf2c63788182c8661ff235cdc5f72d6f59e000), which was mined more than 3 days since the last event and has the last three hex digits of its hash (joined as a number) strictly smaller than 7. The BCH price at the time of activation was $235.66",
            "stickied": false,
            "comments": []
        },
        {
            "id": "umatkz",
            "title": "Luna Foundation Guard Is Now Selling All Of Its Bitcoins To Save UST Peg! What Is Happening?",
            "url": "https://news.coincu.com/87513-luna-selling-all-its-bitcoin-save-ust-peg/",
            "author": "thuynguyen174",
            "created_utc": 1652158944.0,
            "score": 10,
            "num_comments": 6,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i81jb4t",
                    "author": "Late_To_Parties",
                    "score": 6,
                    "created_utc": 1652185443.0,
                    "response": "Stuff that should have happened a long time ago",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "um5vel",
            "title": "TerraUSD stable coin seems to be having a fun time today.",
            "url": "https://www.reddit.com/r/btc/comments/um5vel/terrausd_stable_coin_seems_to_be_having_a_fun/",
            "author": "Hellgin",
            "created_utc": 1652143298.0,
            "score": 9,
            "num_comments": 7,
            "subreddit": "btc",
            "selftext": "0.7$ for 1. I guess it could just be a flash crash soon to be corrected by their \"algorithms\", Their \"algorithms\" probably also felt the need to lock down their communication channels.",
            "stickied": false,
            "comments": [
                {
                    "id": "i7zp38i",
                    "author": "big--if-true",
                    "score": 12,
                    "created_utc": 1652143550.0,
                    "response": "Its effectively the risks of owning Bitcoin but with no upside at all.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7zteaz",
                            "author": "L0ckeandDemosthenes",
                            "score": 8,
                            "created_utc": 1652145515.0,
                            "response": "You can lose... but you could also lose.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i805vln",
                                    "author": "Techutante",
                                    "score": 3,
                                    "created_utc": 1652151199.0,
                                    "response": "We'll say you're winning though, if it makes you feel better.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "id": "um41mi",
            "title": "Bitcoin's Network Has Just Seen the Largest Net Total of BTC Moving to Exchanges Since December, 2019",
            "url": "https://twitter.com/santimentfeed/status/1523801069758812161",
            "author": "BrianAtSantiment",
            "created_utc": 1652137758.0,
            "score": 9,
            "num_comments": 3,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "um4t5d",
            "title": "Are y’all gonna HODL with me?",
            "url": "https://www.reddit.com/r/btc/comments/um4t5d/are_yall_gonna_hodl_with_me/",
            "author": "wll",
            "created_utc": 1652140047.0,
            "score": 3,
            "num_comments": 16,
            "subreddit": "btc",
            "selftext": "Just bought 78 BCH and I’m just gonna HODL and see where it takes me.. This dip is beautiful..",
            "stickied": false,
            "comments": [
                {
                    "id": "i7zkj78",
                    "author": "Remora_101",
                    "score": 9,
                    "created_utc": 1652141503.0,
                    "response": "Never a good idea to disclose absolute values. \n\nOT: I'm DCAing since this mess started :)",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7zkuu1",
                            "author": "wll",
                            "score": 4,
                            "created_utc": 1652141649.0,
                            "response": "Sorry I’m young but why do you not disclose absolute values?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7zld7f",
                                    "author": "Remora_101",
                                    "score": 5,
                                    "created_utc": 1652141880.0,
                                    "response": "Because it makes you a target. For all kind of people, scamers, hackers, beggars  and so on.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i7zlgmm",
                                            "author": "wll",
                                            "score": 4,
                                            "created_utc": 1652141924.0,
                                            "response": "Oh alright thanks for the heads up will refrain…",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i7zj19i",
                    "author": "RowanSkie",
                    "score": 6,
                    "created_utc": 1652140816.0,
                    "response": "You can do fancy with it if you buy something, or swap it to flexUSD in SmartBCH. Who knows.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i80bd1t",
                    "author": "chrisgm3773",
                    "score": 6,
                    "created_utc": 1652153966.0,
                    "response": "Yeah i bought 64 today.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i80ntt4",
                    "author": "PanneKopp",
                    "score": 6,
                    "created_utc": 1652161296.0,
                    "response": "spend and replace",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i817xsa",
                    "author": "fiendishcrypro",
                    "score": 3,
                    "created_utc": 1652177981.0,
                    "response": "Love the share, and yes saving in BCH is the way to go, to be spend on things you want and need when the time is right.\n\nBut beware... when BCH hits 10k a coin you just put a mighty tasty target on your back 😉",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i81lngn",
                    "author": "Late_To_Parties",
                    "score": 3,
                    "created_utc": 1652186692.0,
                    "response": "I did a pretty big buy compared to average. I've been a hodler since before the term existed. My hands are adamantium.\n\nI will hodl with you (and spend)",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "um874e",
            "title": "Tips are very important for Bitcoin cash.",
            "url": "https://read.cash/@Bitcoincashtrue/tips-are-very-important-for-bitcoin-cash-e087b0c2",
            "author": "LowIndividual3126",
            "created_utc": 1652150264.0,
            "score": 4,
            "num_comments": 3,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "um5ax8",
            "title": "u/i_have_choosen_a_username, What in the fuck is going on with BUSD? Its down to $0.90???",
            "url": "https://www.reddit.com/r/btc/comments/um5ax8/ui_have_choosen_a_username_what_in_the_fuck_is/",
            "author": "ImRichBCH",
            "created_utc": 1652141529.0,
            "score": 4,
            "num_comments": 17,
            "subreddit": "btc",
            "selftext": "I've got a lot of money tied up in this \"stable\" coin. Can you give us any info? I'm $20k in this fucking thing and ready to pull it all out at a loss. \n\n&#x200B;\n\nWhats going on?",
            "stickied": false,
            "comments": [
                {
                    "id": "i80noap",
                    "author": "PanneKopp",
                    "score": 8,
                    "created_utc": 1652161194.0,
                    "response": "I do not trust any of them so called \"stable coins\" .",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i83yk8t",
                    "author": "i_have_chosen_a_name",
                    "score": 4,
                    "created_utc": 1652221698.0,
                    "response": " sBUSD is backed by BUSD and flexUSD. BUSD is fully audited and attested and the most regulated stablecoin in the world. It's fully backed. FlexUSD is backed by USDC and short and long positions.\n\nEvery single sBUSD is redeemable for at least one flexUSD or BUSD. (sometimes more if there is interest in the pool)\n\nWhat you are looking at on marketcap.cash is not the value of sbusd but the price of BCH in the sBUSD-BCH pool.\n\nIf sbusd is under 1 dollar that means you get to sell BCH above market. If sbusd is over 1 dollar that means you get to buy BCH undermarket.\n\nJust hit me up on telegram and swap your sbusd with as much BUSD or flexUSD as you want. (only BUSD swaps are guaranteed)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7zxnd1",
                    "author": "fgiveme",
                    "score": 7,
                    "created_utc": 1652147385.0,
                    "response": "What trading pair do you have with sBUSD?\n\nIf it trades mainly with UST it's fucked since UST lost peg a few hours ago.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7zl81f",
                    "author": "LovelyDayHere",
                    "score": 7,
                    "created_utc": 1652141813.0,
                    "response": "Have you tried resolving your question to this person via a PM instead of broadcast to the sub?\n\nAlso, are you sure you mean BUSD (which is a \"Binance USD\" stable coin) and not sBUSD?\n\nFinally, paging someone in the title of a post doesn't notifiy them. u/i_have_chosen_a_username <- doesn't seem like a correct username\n\nEDIT: Ok, I found him: u/i_have_chosen_a_name  (yeah, I'm also convinced that it used to be 'username')\n\nAnd it looks like he is just calling it \"BUSD\" on SmartBCH, I thought he used to call it sBUSD but I don't follow stable coins much.\n\nAnyway, now he is notified and can respond to you...",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7zlzkj",
                            "author": "ImRichBCH",
                            "score": 6,
                            "created_utc": 1652142158.0,
                            "response": "1) Its a VERY public issue. HIS $1 stable coin is currently trading at $0.90. Its a big deal. \n\n2) Yes, sBUSD. \n\n3) Yeh, its something like like, I'm sure Kain is here somewhere :)",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7zszcz",
                                    "author": "i_have_chosen_a_name",
                                    "score": 7,
                                    "created_utc": 1652145333.0,
                                    "response": "What are you talking about? 1 sbusd trades for 1.2 UST right now.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i83hvhf",
                                            "author": "chainxor",
                                            "score": 3,
                                            "created_utc": 1652214737.0,
                                            "response": "Are you serious?",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}