{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uytsmg",
            "title": "There are too many positive posts about cryptocurrencies",
            "url": "https://www.reddit.com/r/btc/comments/uytsmg/there_are_too_many_positive_posts_about/",
            "author": "peaceduk",
            "created_utc": 1653640965.0,
            "score": 0,
            "num_comments": 15,
            "subreddit": "btc",
            "selftext": "I am of the opinion that this is a pyramid that will collapse and bring a lot of losses to investors. I personally ran into her in 2021 and lost my family savings, my wife is still angry, and I hate this industry myself. This is a gold mine for scammers, there is as much deception as you can imagine. I advise you to withdraw your blood money from there and not pull fate for one place. Wait for more transparent and controlled crypto projects for investment.\n\nNFTs that no one will buy from you, but you have paid for their minting and placement; distributions with commission payment; \"multiplications\"; coins, from which the developer unexpectedly withdraws liquidity to his wallet through a multiaccount; hacking of wallets and exchanges allegedly by hackers and other murky schemes - this is a brief history of cryptocurrencies.\n\nP.S. I have seen honest projects, but there are very few of them and it is unrealistic to sort them from the scam until you get in.",
            "stickied": false,
            "comments": [
                {
                    "id": "ia67uux",
                    "author": "ShadowOrson",
                    "score": 2,
                    "created_utc": 1653642038.0,
                    "response": "You only have yourself to blame for your actions.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia681re",
                            "author": "peaceduk",
                            "score": 1,
                            "created_utc": 1653642209.0,
                            "response": "I blame myself, I broadcast to those who do not yet know the dark side of cryptocurrencies",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia6hq3w",
                                    "author": "ShadowOrson",
                                    "score": 1,
                                    "created_utc": 1653650142.0,
                                    "response": "You are not describing a \"dark side of cryptocurrencies\". You are describing the dark side of human behavior.\n\nYou were undoubtedly looking for a \"get rich quick\" scheme. You likley took unreasonable risks and failed to do your due diligence. You also invested more than you could afford to lose.\n\nI get tired of seeing people (you) claiming they take responsibility for their actions, but in the same breathe place the blame on something else, usually some nebulous idea.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia6a597",
                    "author": "ApplicationAny1434",
                    "score": 0,
                    "created_utc": 1653644123.0,
                    "response": "Everyone who does some research know that after 4 years holding Bitcoin/cryptos every wallet is in green.\n\nYou been 4 years in the market?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia6afp2",
                            "author": "peaceduk",
                            "score": 0,
                            "created_utc": 1653644388.0,
                            "response": "For the time being, nothing is eternal.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia6b7k6",
                    "author": "BewareOfShills",
                    "score": 1,
                    "created_utc": 1653645067.0,
                    "response": "I agree on 99% of the scene, BUT Bitcoin had a completely different goal at the start and that goal is still valid however deep it is buried under scams and gambling. \n\n\nIt is unfortunate that new people come into crypto because of the 99% and only a few find the true value proposition of Satoshis invention.\n\n\nI'm using BitcoinCash because I think the original use case of sound money is important and will change our society.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia6blm0",
                            "author": "peaceduk",
                            "score": 0,
                            "created_utc": 1653645410.0,
                            "response": "This is not a financial instrument, but an ordinary pyramid, everything is so opaque.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia6e4lb",
                                    "author": "BewareOfShills",
                                    "score": 1,
                                    "created_utc": 1653647511.0,
                                    "response": "It's sound p2p money, at least in its BitcoinCash implementation.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia6gx4b",
                                            "author": "peaceduk",
                                            "score": 0,
                                            "created_utc": 1653649572.0,
                                            "response": "as they say, black PR is also PR, and my desire to protect people from this pyramid will sow a seed of doubt to my words and people will still buy bitcoin and other air",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia6ho7c",
                                                    "author": "BewareOfShills",
                                                    "score": 1,
                                                    "created_utc": 1653650104.0,
                                                    "response": "Are you a bot? Do you even read and comprehend what I write?",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia6cdk6",
                    "author": "smartguy_m",
                    "score": 1,
                    "created_utc": 1653646062.0,
                    "response": "As it appears that you speak Russian (I have a nose for this kind of thing ;) ), let me recommend you the latest articles on this exact topic here: read . cash/@Awesome\\_Blogika (remove spaces to get the link). The articles are both in Russian and in English. Usually English versions are published with a little delay. Here is an excerpt from one of them (\"Cryptocurrency myths\"):\n\n>Indeed, any new phenomenon that has not yet been mastered by broad masses of people attracts a large number of various kinds of scammers. As usual, scammers exploit the desire of people to get rich quick. Cryptocurrencies are no exception, moreover, the scale of fraud has reached a systemic level. Do not forget that the biggest scammers in the world of finance are central banks, which we already talked about in the last article, but nevertheless they are somehow not considered to be scammers. “If you want to hide something, put it in the most visible place.” Approximately the same scale of fraud exists in the crypto industry. We will talk more about this later. And therefore, in order to avoid being a victim of large-scale fraud, we must abandon the emotional impulses that urge us to make a quick buck, and instead systematically improve our literacy. That is what we are doing here.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia6gqvk",
                            "author": "peaceduk",
                            "score": 1,
                            "created_utc": 1653649452.0,
                            "response": "There are a lot of clever words that will not help investors in the case of the bitcoin project closure scheme.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia6egtd",
                    "author": "TinosNitso",
                    "score": 1,
                    "created_utc": 1653647773.0,
                    "response": "One defense of Bitcoin is that maximalists are usually bearish on the rest of crypto, as they should be (imo). They curtail the growth of Bitcoin with excessive mining rewards, on purpose.\n\nMy defense of BCH is that without it, big blockers would have to fork BTC again. I figure BCH is a safer bet.\n\nPerhaps we should warn people against using leverage - even 2x is too much. It could even be a scam, but I can't tell. Leveraged trading can conceivably cause bloat to the blockchains themselves, with speculators taking out loans to spam txn rates and fees. On-chain leverage, based on tokens, might be more rigorous than trusting a centralized exchange.\n\n**Big blocks** are needed if Bitcoin is ever to serve like [CashGold](https://www.ebay.com/itm/164961330561), gold embedded in polymer cash. Gold itself could be forked, like Bitcoin & Bitcoin Cash. Gold vs CashGold. CashGold could have a different value (in $), and investors like Schiff would have to convert entire bullion vaults into **cash**! Cash-Gold would decentralize gold, even without cheap XRF machines, to X-Ray scan all the cash notes for **weight & purity**.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia67jmc",
                    "author": "MsStarstruck",
                    "score": -4,
                    "created_utc": 1653641751.0,
                    "response": "Why would you buy anything else but Bitcoin? You’re asking for trouble.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia67qz9",
                            "author": "peaceduk",
                            "score": 2,
                            "created_utc": 1653641940.0,
                            "response": "I'm ready for a flurry of negativity otherwise I wouldn't post this",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}