{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "us88vj",
            "title": "An interesting quote from Theymos, the user who started all the censorship within Bitcoin",
            "url": "https://www.reddit.com/r/btc/comments/us88vj/an_interesting_quote_from_theymos_the_user_who/",
            "author": "MemoryDealers",
            "created_utc": 1652862970.0,
            "score": 111,
            "num_comments": 116,
            "subreddit": "btc",
            "selftext": ">Satoshi definitely intended to increase the hard max block size… I believe that Satoshi expected most people to use some sort of lightweight node, with only companies and true enthusiasts being full nodes. Mike Hearn's view is similar to Satoshi's view.\n\nHe is basically admitting that Bitcoin was highjacked.\n\n[source](https://lists.linuxfoundation.org/pipermail/bitcoin-dev/2015-May/008004.html)",
            "stickied": false,
            "comments": [
                {
                    "id": "i91y159",
                    "author": "TooDenseForXray",
                    "score": 58,
                    "created_utc": 1652865747.0,
                    "response": "Well he even admitted that he knew how to use moderation to influence people.\n\nThis dude single handedly is responsible for the most damage on crypto adoption... fucking hurt that it is media centralisation that killed bitcoin.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i925f51",
                            "author": "Neutral_User_Name",
                            "score": 23,
                            "created_utc": 1652871882.0,
                            "response": "Exhibit A  \n\nTheymos' treasonous temporary tules are now over 6 years old: \n\nhttps://www.reddit.com/r/Bitcoin/comments/3h9cq4/its_time_for_a_break_about_the_recent_mess/",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i95cqku",
                                    "author": "undadatunda",
                                    "score": 2,
                                    "created_utc": 1652923366.0,
                                    "response": "seems the latest mods there have gone even farther cuz they want everything besides bitcoin to be called a 'shitcoin' that why they banned me from there lol\n\nhttps://old.reddit.com/r/btc/comments/umttme/7_day_ban_extended_to_28_day_ban_for_telling/\n\none thing i noticed is how in that old thread they are calling forks from bitcoin 'altcoins' not shitcoins and some of the replies even say forking is a integral part of bitcoin(which i agree with) cuz its the only way to get rid of the paper bitcoin i.o.u's and stop the fractional lending and cut off the shorters from ruining the laws of supply and demand\n\nthis is the comment that started it\n\n\"an altcoin is a fork from bitcoin so theres no premining of coins\n\ncrypto or shitcoins are 'premined' coins and theres a big difference between crypto and altcoins cuz so far 0 cryptocoins have been able to solve the fair distribution problem but a fork from bitcoin(altcoin) instantly solves it\n\nhttps://www.cdc.gov/parasites/crypto/index.html\n\nhttps://np.reddit.com/r/Bitcoin/comments/m79l3c/bitcoins_fair_launch_cannot_ever_be_replicated_by/\n\nso its bitcoin,altcoins and on the very bottom(vast majority of coins) is cypto/shitcoins\"",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i95zzzf",
                                    "author": "jimstough",
                                    "score": 1,
                                    "created_utc": 1652935454.0,
                                    "response": "I believe BCH has a larger block size. Same with litecoin .\n\nPeople fork bitcoin all the time. If you go to coinmarketcap and type in bitcoin you see 93 results .",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9675oc",
                                            "author": "undadatunda",
                                            "score": 1,
                                            "created_utc": 1652940499.0,
                                            "response": "but the exchanges dont have them coins listed cuz the exchanges are like dictators over what coins the plebs get to choose from\n\nalso the exchanges make more money from premined coins than they do from forked coins..so thats why we see sooo many premined coins on the exchanges and not forked coins\n\nalso if a coin was dropping like 50+ forks a day into the hodlers hands then people would want to hold the coin themselves so they get all of the forks and thats not good for the exchanges cuz they want people to keep their coins on the exchanges and trade them cuz the exchanges get a cut of all of the trades\n\nso ya the exchanges dont like coins forking and are working to prevent this i think",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i91yru1",
                            "author": "jessquit",
                            "score": 24,
                            "created_utc": 1652866440.0,
                            "response": "> This dude\n\nsold his account, it's patently obvious and frankly it's what I would have done if I simultaneously became a person of interest to the CIA while at the same time some mystery person was offering me 6000 BTC.  Life's too short to get renditioned over some magic internet beans.\n\nwe don't know and never knew who controlled that account.  years ago a name was mentioned but I believe that person is Theymos about as much as I think Luke Jr is Satoshi.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i93ck6u",
                                    "author": "driftingatwork",
                                    "score": 6,
                                    "created_utc": 1652892390.0,
                                    "response": "Ugh.. Luke Jr.... glad he faded into oblivion.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i968q0f",
                                            "author": "wtfCraigwtf",
                                            "score": 2,
                                            "created_utc": 1652941741.0,
                                            "response": "Most of the controversial Core devs have disappeared. It may have been too much heat, they got paid to stay quiet, or their provocations were causing too much attention on the BTC dev process and team. Nowadays it looks like at least half the BTC devs work directly for the government. But it's hard to prove. No question that Blockstream is a massive intel front, Austin Hill has three letters written all over him.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i97dbew",
                                    "author": "TooDenseForXray",
                                    "score": 2,
                                    "created_utc": 1652969678.0,
                                    "response": ">sold his account, it's patently obvious and frankly it's what I would have done if I simultaneously became a person of interest to the CIA while at the same time some mystery person was offering me 6000 BTC.  Life's too short to get renditioned over some magic internet beans.\n\nthat would make sense.\n\n\\>we don't know and never knew who controlled that account. years ago a name was mentioned but I believe that person is Theymos about as much as I think Luke Jr is Satoshi\n\nI would guess the account have been bought by blockstream.. the rbitcoin mod policies was just too consistently supportive of blockstream all the time.\n\nSeriously the place should have been renamed /r/blockstream\n\n(at least few years ago.. I am not been there for a while)",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i93g13b",
                                    "author": "rusik72",
                                    "score": 1,
                                    "created_utc": 1652893772.0,
                                    "response": "Yeah the stakes were too high at that moment and the risk too.\n\nAnd that's why Satoshi disappeared when the CIA got involved. They immediately disappeared.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i943j5z",
                            "author": "Br0kenRabbitTV",
                            "score": 3,
                            "created_utc": 1652903299.0,
                            "response": "They knew exactly what they were doing...\n\n..but you reap what you sow: https://ibb.co/wpWRjt4",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i94wjqi",
                            "author": "410984195",
                            "score": 2,
                            "created_utc": 1652915738.0,
                            "response": "This makes sense what you're saying. But it's not gonna make it for everyone.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i92n7qu",
                            "author": "AmericanScream",
                            "score": -21,
                            "created_utc": 1652881781.0,
                            "response": ">ucking hurt that it is media centralisation that killed bitcoin.\n\nWhat killed bitcoin is that it is incapable fulfilling the applications for which it was promised.  No amount of fidgeting with the block size will fix that.  Blockchain by design is too inefficient, and L2 add-ons just increase complexity and vulnerabilities.\n\nLook guys, I understand you want to point the finger everywhere else but at yourselves for falling for this pyramid scheme, but really, take some responsibility.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i92x0xf",
                                    "author": "emergent_reasons",
                                    "score": 10,
                                    "created_utc": 1652886057.0,
                                    "response": "[Don't believe us just watch](https://youtu.be/OPf0YbXqDm0?t=63)",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i95fxd8",
                                            "author": "dingus5355",
                                            "score": 2,
                                            "created_utc": 1652924834.0,
                                            "response": "Is the strength of the computer really a valid argument these days? With asic mining making up the majority?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i95k32a",
                                                    "author": "emergent_reasons",
                                                    "score": 2,
                                                    "created_utc": 1652926786.0,
                                                    "response": "/u/mobtwo 👨‍🌾",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i95k6be",
                                                            "author": "MobTwo",
                                                            "score": 2,
                                                            "created_utc": 1652926828.0,
                                                            "response": "Thanks, bot removed.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i998yet",
                                                    "author": "borotev",
                                                    "score": 1,
                                                    "created_utc": 1652998557.0,
                                                    "response": "No it is not it is having a lot of time left even now to grow more...",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i9418y2",
                                    "author": "Br0kenRabbitTV",
                                    "score": 11,
                                    "created_utc": 1652902379.0,
                                    "response": "You are such a fucking moron man.\n\nYou are in basically the only sub that is trying to use crypto as intended, as peer to peer cash, assuming we are all like the 95% of crypto bros you mock in r/buttcoin. The annoying thing is, I actually agree with a lot of what you say about crypto in general and so do many people here as well. I actually enjoy reading your sub and agree with a lot of what is said in there, but all you can do is come here, literally the only censorship free crypto sub and spew your bullshit as you know you won't be banned like you would in any of the other subs.\n\nI've seen how you guys operate.. you flat out ban anybody from your sub that might have any good arguments (like merchants and people who use crypto as peer to peer cash), and let all the dumb \"too the moon\" crypto bros stay, with their stupid arguments just so you can all feel like you are right about it all. I mean TBH you are right about most of what you say, but you come here attacking people that are not treating this all as a ponzi or get rich quick scheme, who have done nothing but try and carry on using it as intended.\n\nYou are speaking about L2 above like we are fans of it, we are not. Do you even realise what sub you are in? Or actually understand any of the history of the BTC and BCH fork and blocksize wars/debate? We are the people trying to use crypto as intended, peer to peer cash. Onboarding merchants, accepting it as payment etc.. the people you guys mock, we hate just as much as you do. When you couldn't win your bad faith debate with me in the past, you resorted to calling me a fentanyl dealer, and after our chat in DM you said maybe I am using crypto in a correct way, but I am the only person doing that and a tiny minority.. this whole sub is mostly full of people like me trying our best to keep carrying on the goal of peer to peer cash, and yes we are a tiny minority in the crypto space now days.\n\nThe way you operate your sub, banning anybody with a decent argument and leaving the stupid crypto bros there with an I'm a moron tag is just creating a giant echo chamber, you are almost as bad as the people you mock. I think I probably made about two comments in there (long ago) before I was banned, you can't handle a proper debate with anybody that actually uses crypto properly, you end up throwing your toys out of the pram and stamping your feet like a child. You're nothing but a hypocritical troll. You use censorship to make sure the only crypto people in buttcoin, are the dumbest of the dumb, to push your anti crypto agenda, I honestly can't imagine how sad your life must be to dedicate so much time to something you don't like or care about. We also hate the \"number go up\" people.\n\nI understand why you hate crypto as a whole but why constantly come here and attack the type of people that are actually trying to use it as intended, who have done for years?\n\nThe reason is because you are likely banned from any other crypto subs, and from your comments I don't think you even understand what the people in this sub are about at all.\n\nImagine only being able to win your debates in your own sub by censoring anybody with half a brain, and purposely letting dumb as fuck crypto bros stay in there to suit your agenda.\n\nYou are almost as bad as the folks over at r/bitcoin\n\nu/MobTwo this guy needs tagging as a Buttcoin mod, people need to know before engaging.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i95cdpv",
                                            "author": "AmericanScream",
                                            "score": -3,
                                            "created_utc": 1652923205.0,
                                            "response": "Look at you... so \"triggered\" you have to beg the mods to make me go away because... what?  You are offended by my words and you want to accuse me of \"censorship\" because you don't like my opinion?\n\nThat makes sense.\n\n> You are such a fucking moron man.\n\nAttack the messenger because you can't defend the tech.  I've seen it before.\n\n>I've seen how you guys operate.. you flat out ban anybody from your sub that might have any good arguments \n\nWHAT \"good arguments?\"\n\nAll you guys do is call everybody haters and yell \"have fun staying poor.\"  You wouldn't know a good argument if it gave you a reach-around.\n\nAnd suggesting I \"hate\" crypto is par for the course.  You're the one being emotional.  I'm the one being logical.  Stop projecting your crap onto me.\n\n>Imagine only being able to win your debates in your own sub by censoring anybody with half a brain,\n\nLook at all those words you typed.. a big wall of text calling people names.. IMPLYING you have more than half a brain, IMPLYING you have good arguments... but where are the arguments?  I can't ban you here...    just admit you don't have any \"good arguments\" which is why you stoop to personal attacks and playing the victim card suggesting you're being censored.    puh-leeze.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i982atc",
                                                    "author": "Br0kenRabbitTV",
                                                    "score": 1,
                                                    "created_utc": 1652979933.0,
                                                    "response": "I'm not \"triggered\". I asked them to tag you not ban, so people know what they are getting into when you start debating in bad faith (like you tag people in your sub). Yes banning people that have good arguments for actual use cases for crypto from your sub while allowing those idiotic crypto bro types there is censorship and just further suits your anti crypto agenda. Why not just let the downvotes do the talking??\n\nYou simply only want crypto bros there who present stupid arguments.\n\nI mean I myself get a laugh out of a lot of it TBH.\n\nJust like them though, you can't see past the \"investment\" side of crypto.\n\nNobody in this sub is the type of person who says \"have fun staying poor\".\n\nYou are thinking of toxic BTC maximalists from subs like r/bitcoin.\n\nI spent hours debating you before and gave you many good arguments for using crypto as peer to peer cash, I know full well you remember this, we took it to DM after you accused me of being a drug dealer. You even admitted that I might use it properly, but I am the only person that does and that I'm a tiny minority. You can check your own posts in this sub and your own DMs if you need a refresher.\n\nMaybe you genuinely forgot about this, but I doubt it.\n\nAgain, I'm not going over the masses of good arguments I already gave you both in this sub and in DM in the past, you can simply read them again instead of trying to get me to type it all out again. Sure I call you names, you deserve it, you are a hypocritical self absorbed little troll, who enjoys creating an echo chamber about something he hates to make himself feel better, and comes to other communities trying to annoy others.\n\nYes you guys censored me in Buttcoin.. but are happy to keep stupid crypto bros there, and any crypto lover that basically makes themselves look stupid when they debate you, I've seen it in real time and it's pathetic. I've proved for over a decade crypto can be useful to some people as a payment system.. though I agree that the majority of the crypto space is just a giant ponzi scheme and casino full of degenerate gamblers.\n\nI don't think you understand this sub well, it's not your average Bitcoin/crypto sub. It's mostly populated by people that agree with many Buttcoin points, that were into Bitcoin early on and always pushed for it's use case of peer to peer cash, before the masses came along after being told by the media and others it would make them rich.\n\nVery few of us here are fans of the coin BTC any more due to how it ended up.\n\nIf you were actually interested you could easily look into the history of what happened, but I assume you are not interested and only interested in trolling crypto as a whole, you speak to us in here like we are stupid degenerate gamblers, which isn't the case.\n\nThe goal and narrative of Bitcoin (BTC) was completely changed.\n\nMost of us like coins such as BCH and XMR that are widely used as actual p2p cash.\n\nWe are not buying crypto, \"HODLing\" and hoping to get rich.\n\nThough I understand how it can be confusing with the sub named r/btc.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i92z5k2",
                                    "author": "LovelyDayHere",
                                    "score": 3,
                                    "created_utc": 1652886946.0,
                                    "response": "Bitcoin is dead?\n\nObituary #1230213948",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i933q61",
                                            "author": "bitmeister",
                                            "score": 3,
                                            "created_utc": 1652888808.0,
                                            "response": "> Obituary #1230213948**2**\n\nI checked, and you missed the last digit... 2.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i95hfd3",
                                                    "author": "Jhawkfan101",
                                                    "score": -1,
                                                    "created_utc": 1652925523.0,
                                                    "response": "Basically the decentralization comes from the nodes, not the miners.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9711tp",
                                                            "author": "sunfeihan88",
                                                            "score": 1,
                                                            "created_utc": 1652963784.0,
                                                            "response": "Yeah you are right! most of the miners already know that how it is going to work for them.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i95rm7r",
                                            "author": "silviapierpaolo",
                                            "score": 1,
                                            "created_utc": 1652930565.0,
                                            "response": "Add long as the blockchain doesn't increase in size faster than speed at which the price of storage drops by, we're good on that front then, right? So the blockchain could double in size roughly every eighteen months (Moore's law)?",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i93gya9",
                                    "author": "etherael",
                                    "score": -2,
                                    "created_utc": 1652894148.0,
                                    "response": "I take all the responsibility imaginable for assuming decentralised cryptocurrency based on simple mathematical primitives and using technology that wouldn't have been hard for a bright high school student in the late twentieth century to grasp would be easy and impossible to sabotage using social engineering and narrative tailoring in a world peopled by those stupid enough to not understand the obvious attack that was BTC and then five years after the fact posting idiotic comments like this one insisting it's just impossible because dumb ass reasons empirically discredited by dozens of unsabotaged blockchains daily.\n\nThank you and those like you for being so free with your stupidity, you have permanently disabused me of the notion of faith in the intelligence of the species at large.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i95d5ph",
                                            "author": "AmericanScream",
                                            "score": 2,
                                            "created_utc": 1652923563.0,
                                            "response": "> Thank you and those like you for being so free with your stupidity\n\nJust a little note: Calling me names isn't going to make you ponzi portfolio rise.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i95ta7v",
                                                    "author": "etherael",
                                                    "score": 1,
                                                    "created_utc": 1652931452.0,
                                                    "response": "The goal isn't yield. It's education. Knowing the nature of human stupidity and the extent of its distribution is priceless.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i98044q",
                                                    "author": "Tigrrra123",
                                                    "score": 1,
                                                    "created_utc": 1652979058.0,
                                                    "response": "I know right this looks like a crime to me or something like that lol.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i987iqz",
                                            "author": "haicomarcus",
                                            "score": 1,
                                            "created_utc": 1652982030.0,
                                            "response": "Yeah for the long time this has been the only problem they were facing as well lol.\n\nIt certainly depends on what blockchain system they are working on and how it is going to work for them.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i97bo7i",
                                    "author": "TooDenseForXray",
                                    "score": 1,
                                    "created_utc": 1652968953.0,
                                    "response": ">What killed bitcoin is that it is incapable fulfilling the applications for which it was promised.  No amount of fidgeting with the block size will fix that.  Blockchain by design is too inefficient, and L2 add-ons just increase complexity and vulnerabilities.\n\nIt is not really we are not in 1980 anymore. \n\nData torage and processing is cheap.\n\n&#x200B;\n\n>Look guys, I understand you want to point the finger everywhere else but at yourselves for falling for this pyramid scheme, but really, take some responsibility.\n\nThere is no responsibility to take, the experiment has no chance to take place because of a selected few.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i97hhm4",
                                            "author": "AmericanScream",
                                            "score": 1,
                                            "created_utc": 1652971476.0,
                                            "response": ">Data torage and processing is cheap.\n\nNot on blockchain it isn't.  It's a lot more expensive.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i97k2xi",
                                                    "author": "TooDenseForXray",
                                                    "score": 1,
                                                    "created_utc": 1652972557.0,
                                                    "response": ">Not on blockchain it isn't.  It's a lot more expensive.\n\nI run on node on my computer for the last 5 years, it cost me nothing.\n\n\\> 256MB / block times 1 block / 600 s = 426666 B / s  \n426666 B/s times 1 transaction / 300B = 1422 tps  \nNote: my (rural home) internet connection runs at more than 100 MB/s up and down, so these rates represent less than 0.5% of my internet bandwidth. They would fill up one of my Raspberry Pi4s, per testnet measurements. These machines cost about $250 each, including SSD storage.\n\n[https://www.reddit.com/r/btc/comments/uqfzl9/comment/i8vyg5b/?utm\\_source=share&utm\\_medium=web2x&context=3](https://www.reddit.com/r/btc/comments/uqfzl9/comment/i8vyg5b/?utm_source=share&utm_medium=web2x&context=3)\n\nA calculation of a BCH at VISA level usage... is that expensive for you?",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i92f10c",
                    "author": "btcxio",
                    "score": 12,
                    "created_utc": 1652877759.0,
                    "response": "*The user who was paid off to do all the censorship*",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i94oar5",
                            "author": "vela0alev",
                            "score": 2,
                            "created_utc": 1652911976.0,
                            "response": "I don’t think they can increase it any more unless they do a hard fork, though.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i974vev",
                                    "author": "252898484",
                                    "score": 1,
                                    "created_utc": 1652965772.0,
                                    "response": "Yeah you are right since this has been done to them for multiple times it is just a normal stuff\n\n more over that w have to see if that is going to be forked for better or not as of now.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i91y68n",
                    "author": "Br0kenRabbitTV",
                    "score": 11,
                    "created_utc": 1652865881.0,
                    "response": ">with only companies and true enthusiasts being full nodes\n\nHe did, he explained it a ending up a bit like how usenet consolidated IIRC.\n\nI'm sure somebody here will have the topic where he talked about this saved?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i91ykl7",
                            "author": "Br0kenRabbitTV",
                            "score": 14,
                            "created_utc": 1652866253.0,
                            "response": "Found it: bitcointalk dot org/index.php?topic=125.msg1149#msg1149",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i94y0gy",
                                    "author": "TonFrantic",
                                    "score": 0,
                                    "created_utc": 1652916420.0,
                                    "response": "Thanks for the links, it's gonna help out some people here for sure.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i94z3l0",
                                            "author": "Br0kenRabbitTV",
                                            "score": 3,
                                            "created_utc": 1652916931.0,
                                            "response": "u/MobTwo suspected bot",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i97d6xq",
                                            "author": "Artem37011",
                                            "score": 1,
                                            "created_utc": 1652969623.0,
                                            "response": "Most of the people are going to understand it as well as of now lol.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i94359q",
                            "author": "BisratDB",
                            "score": -2,
                            "created_utc": 1652903146.0,
                            "response": "You can't use a soft fork to increase the block size.\n\n Not without doing something like layering a new chain on top and creating some kind of migration system from the current chain.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i944met",
                                    "author": "Br0kenRabbitTV",
                                    "score": 11,
                                    "created_utc": 1652903742.0,
                                    "response": "I'm too lazy to carry this on TBH, as I've said all this a million times. If you are genuinely interested in the answer to this, go and read all of Satoshi's comments relating to this, as he explained what would be needed to be done, and yes it would of required a hard fork.. he literally explained all of this at the time, and it's all been repeated over and over in here a million times. The plan was always to scale on chain and increase the block size..\n\n..you can read his comments and the comments of others and verify it yourself.\n\nTBH you shouldn't even be arguing about it unless you've already read all this stuff.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i968wen",
                                            "author": "wtfCraigwtf",
                                            "score": 2,
                                            "created_utc": 1652941884.0,
                                            "response": "Hard forks happen hundreds of times per year. Only Maxies fear hard forks. Soft forks are actually much more coercive and much more likely to create unintended consequences. \n\nVitalik blogged about it a few years back.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i980gcm",
                                                    "author": "Br0kenRabbitTV",
                                                    "score": 1,
                                                    "created_utc": 1652979194.0,
                                                    "response": "Yeah, I've noticed BTC people make it seem like some kind of terrible thing. The issue is a LOT of info people learn and think they know comes from those type of people.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i97h173",
                                            "author": "ernest_san",
                                            "score": 2,
                                            "created_utc": 1652971280.0,
                                            "response": "Yehah but reading is not enough they also needs to understand it as well lol.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i98ytzl",
                                    "author": "tomek1904",
                                    "score": 1,
                                    "created_utc": 1652993922.0,
                                    "response": "From the current chan we can also think of it as a working technology for them as of now.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i92iyms",
                    "author": "kimolsen",
                    "score": 7,
                    "created_utc": 1652879766.0,
                    "response": "I mean I've read it too, Satoshi had the vision to increase it later.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i93h1i9",
                            "author": "sq66",
                            "score": 3,
                            "created_utc": 1652894184.0,
                            "response": "...way before blocks become full. That time is now long gone.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i954dci",
                            "author": "johnwee75",
                            "score": 3,
                            "created_utc": 1652919435.0,
                            "response": "My question is: I don't understand the side that wants small blocks... What is the advantage of this?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i968zo1",
                                    "author": "wtfCraigwtf",
                                    "score": 1,
                                    "created_utc": 1652941954.0,
                                    "response": "lol they really have no logical reason\n\nbut behind the scenes it's all about Blockstream takeover and pushing their Layer 2 garbage like Liquid.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i981en7",
                                            "author": "rosynka",
                                            "score": 1,
                                            "created_utc": 1652979576.0,
                                            "response": "Indeed and this is the reason why this is going to be better at any end as we know.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i92smj8",
                    "author": "mjh808",
                    "score": 6,
                    "created_utc": 1652884202.0,
                    "response": "I found him dodgy when my account was stolen at bitcointalk.org and he wouldn't do anything about it, I could only post a warning to others about my old account.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i93r1sp",
                            "author": "gedger1",
                            "score": 2,
                            "created_utc": 1652898204.0,
                            "response": "Can't get the devs to agree I guess. Even if you could you'd have to get all the nodes to switch to the updated protocol.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i984yki",
                                    "author": "bastone357",
                                    "score": 1,
                                    "created_utc": 1652980999.0,
                                    "response": "Yeah you are right because they have to use the correct protocol otherwise this is going to be a major problem\n\nwe also had seen that quite a lot of time this has been a major issue for a lot of people and they are not able to solve it,",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i91xvy8",
                    "author": "LovelyDayHere",
                    "score": 14,
                    "created_utc": 1652865618.0,
                    "response": "> We need to accept that a global transaction system cannot be fully/constantly audited by everyone and their mother.\n\nTrue only because of lack of technical expertise. Otherwise, I'd say: not true.\n\nOne can trade space for time in doing the auditing (via open source software of course, that also needs to be audited)\n\nYou do not have to keep the full blockchain around during such an audit.\n\nIn the next comment, Jeff Garzik writes:\n\n> How high do you want to go - and can Layer 1 bitcoin really scale to get there?\n\n> It is highly disappointing to see people endorse \"moar bitcoin volume!\" with zero thinking behind that besides \"adoption!\"\n\nSadly, he didn't get involved again later. People on the Bitcoin Cash side have put non-zero thinking into scaling.\n\nhttp://blog.vermorel.com/journal/2017/12/17/terabyte-blocks-for-bitcoin-cash.html\n\nBut 2015 was still very early, obviously if some thought was put in on the small blocker (Blockstream/Core) side, they never managed to make a coherent case against scaling on chain. The arguments we got against it were FUD that was easily revealed as such later on, e.g. the \"infinite demand\" for cheap block space argument (implying that if the cap were raised, it would be filled up by spam almost immediately)",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i91za7i",
                            "author": "jessquit",
                            "score": 19,
                            "created_utc": 1652866894.0,
                            "response": ">  e.g. the \"infinite demand\" for cheap block space argument (implying that if the cap were raised, it would be filled up by spam almost immediately)\n\nyeah BCH raised the block size and offered minuscule fees and *that* was predicted to fill the chain with spam because of this \"unbounded demand.\"  didn't happen.\n\nthen BCH hardforked an upgrade and *that* was supposed to split the coin because \"hardforks cause chain splits.\"  didn't happen.\n\nfortunately BSV arrived just in time to save the narrative, good job False Flag Faketoshi, champaign all around at smallblock central",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i92x2pu",
                                    "author": "Contrarian__",
                                    "score": -2,
                                    "created_utc": 1652886077.0,
                                    "response": "> good job False Flag Faketoshi, champaign all around at smallblock central\n\nAre you just being silly, or do you actually think Craig is a false flag attack on big blocks sponsored by, what, Blockstream, the CIA, Mastercard? Was this the plan all along? Craig's tax fraud where he started his Satoshi nonsense was just laying the groundwork for this larger conspiracy?\n\nEdit: And the recent lawsuit against Bitcoin developers where they had to pay thousands of pounds to defend themselves... another false flag conspiracy?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i93cr9k",
                                            "author": "jessquit",
                                            "score": 7,
                                            "created_utc": 1652892467.0,
                                            "response": "\n>Are you just being silly, or do you actually think Craig is a false flag attack on big blocks sponsored by, what, Blockstream, the CIA, Mastercard? \n\nWell, if he wasn't, then Blockstream, the CIA, and Mastercard are all really lucky that he came along to pour gasoline on the big block ant pile.\n\n> Was this the plan all along? Craig's tax fraud where he started his Satoshi nonsense was just laying the groundwork for this larger conspiracy?\n\nNah, this stunt is how he and Calvin are working off their extensive debt.\n\n>Edit: And the recent lawsuit against Bitcoin developers where they had to pay thousands of pounds to defend themselves... another false flag conspiracy?\n\nSorry your boy turned on you. He's a loose cannon for sure, that one. But most of his damage has been limited to big block Bitcoin. Oh and also Cobra, the one maxi in your midst who doesn't play nice with Adam.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i93i7eh",
                                                    "author": "Contrarian__",
                                                    "score": 0,
                                                    "created_utc": 1652894651.0,
                                                    "response": "> Sorry your boy turned on you.\n\nLol, the irony... \"My boy\".. Remember your apology to me? What was that for again?\n\nOh, right:\n\n> To Contrarian__ and a lesser extent Zectro -- you've been a real pain in my ass for the last year. Turns out, you were right all along. Please forgive my willingness to go along and see how things turn out. Some things do need to be dragged into the sunshine to die. Thanks to both of you for your work compiling and exposing the myriad lies, plagiarisms, and frauds committed by the Attacker in Chief.\n\nLOL, my boy...",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i94bt77",
                                            "author": "phillipsjk",
                                            "score": 3,
                                            "created_utc": 1652906674.0,
                                            "response": "Bitcoin SV really looks like a parody of Bitcoin Cash to me.\n\n> You want bigger blocks? I'll show you bigger blocks!\n\n> You want to increase the OP_Return size a little bit? I'll show you a large OP_Return!\n\n> You want canonical transaction ordering to facilitate transmitting GB scale blocks using set theory? Now you are taking things too far! Bitcoin was perfected in version 1.0!",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i95va1k",
                                            "author": "ampatel7",
                                            "score": 1,
                                            "created_utc": 1652932572.0,
                                            "response": "Also bitcoin maxis always bring up security when the topic of expanding the block size comes.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i99jupp",
                                                    "author": "marshall_mmx",
                                                    "score": 1,
                                                    "created_utc": 1653003940.0,
                                                    "response": "It is all about faith only if you ask me as well to be honest.this is not going to change.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i94ie9x",
                                    "author": "zaerocosmic",
                                    "score": -2,
                                    "created_utc": 1652909452.0,
                                    "response": "It's to keep the size of the chain manageable, allowing anyone to sync their wallet.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i94iw2b",
                                            "author": "jessquit",
                                            "score": 4,
                                            "created_utc": 1652909665.0,
                                            "response": "But that's not how Bitcoin works. Everyone can trustlessly sync their wallet using SPV without having to download the chain.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i97a3ux",
                                            "author": "MD14620",
                                            "score": 1,
                                            "created_utc": 1652968250.0,
                                            "response": "For more than that we knew that this has been the similar case from long time.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i921h7h",
                            "author": "gandrewstone",
                            "score": 4,
                            "created_utc": 1652868825.0,
                            "response": "But unfortunately that blog post with its napkin math undermines your point :-(.\n\nIts like its calculating the energy and mass of the steel to get into orbit.  Then it prices that out and claims orbit.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i92d836",
                                    "author": "jessquit",
                                    "score": 10,
                                    "created_utc": 1652876776.0,
                                    "response": "> blog post with its napkin math \n\nNot to mention its wildly inflated requirements. 10B people making 50 tx per day? So now Bitcoin has to not only scale to everyone on Earth *but also on some undiscovered planet?*\n\nI remember this post. I really couldn't make it past the first paragraph. It screamed false flag propaganda, a sort of punching bag article for small blockers to rip apart.\n\nNo we don't need to set a goal to scale to 10B people all making 50tx/day. It's **preposterous.**\n\nIn fact if we scaled to **even 1% of that** (1B ppl making 5tx/day), we'd *still* be processing **10X more transactions than Visa** (5B tx/day * 365 = 1800B tx/yr vs Visa at ~180B tx/yr).\n\nI really couldn't take that article in good faith.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i93polw",
                                            "author": "tl121",
                                            "score": 5,
                                            "created_utc": 1652897650.0,
                                            "response": "Thing is, we could scale bitcoin cash to do this if wanted and without any consensus rules changes other than adding UTXO checkpoints.  Cost per transaction would remain unchanged, since node processing costs scale linearly with transaction processing capacity.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i97br04",
                                                    "author": "hnhdam",
                                                    "score": 3,
                                                    "created_utc": 1652968987.0,
                                                    "response": "It is the complete of what they can do and for long as well now.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i92edok",
                                            "author": "gandrewstone",
                                            "score": 6,
                                            "created_utc": 1652877409.0,
                                            "response": "Set within the historical context, its primary goal was probably to steal the limelight from Bitcoin Unlimited's Gigablock efforts and undermine our leadership, cementing ABC's role.  \n\nVermorel also posted a bad token system (IIRC self-described as written up during a plane ride) to add choice anxiety to that technical effort.\n\nThese and similar efforts delayed transaction introspection by 4 years and native tokens by at least 5.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i94lebd",
                                                    "author": "Monolitr",
                                                    "score": 1,
                                                    "created_utc": 1652910734.0,
                                                    "response": "The max block size was added by Satoshi Nakamoto to prevent spamming the blockchain.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i93s2tj",
                                            "author": "a532933202",
                                            "score": 2,
                                            "created_utc": 1652898622.0,
                                            "response": "Bitcoin is an extremely conservative project that likes to keep up the status quo .",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i922upx",
                                    "author": "LovelyDayHere",
                                    "score": 8,
                                    "created_utc": 1652869951.0,
                                    "response": "I think we can agree that there have been more hands-on attempts at demonstrating scaling potentials, such as the Gigablock testnet.\n\nPoint here being, why nothing like that was ever done on Core as a strong defense of their views.\nHmmm, perhaps because it would have demolished their arguments at the time.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i924clp",
                                            "author": "gandrewstone",
                                            "score": 5,
                                            "created_utc": 1652871106.0,
                                            "response": "Yes, unfortunately though posts like this one may have undermined our argument.  \n\nMakes people think other initiatives were similarly casual.\n  \nCauses knee-jerk horror -- forget running a home node, even large companies cant deploy that without a proven business case.  But ofc by the time we need that, tech will be much better...\n\nMakes people think that we might deploy that architecture, before having the demand to support the infrastructure cost (aka BSV).\n\nAlso, it was probably written more for internal political reasons than anything else.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i95xixi",
                                                    "author": "installgen4",
                                                    "score": 2,
                                                    "created_utc": 1652933896.0,
                                                    "response": "The problem here is that everyone is waiting for \"consensus,\" so nothing actually gets done. By the time an Internet forum reaches consensus, there will be another crash.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i987kje",
                                                            "author": "vccsell",
                                                            "score": 1,
                                                            "created_utc": 1652982050.0,
                                                            "response": "Indeed this is the reality since all this is going to change once it started as well.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i954m3e",
                                            "author": "kurtkrut",
                                            "score": 1,
                                            "created_utc": 1652919549.0,
                                            "response": "However, satoshi also added that the limitation needs to be increased (or removed) later on.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i96yytj",
                                                    "author": "zhaoyunkute",
                                                    "score": 1,
                                                    "created_utc": 1652962614.0,
                                                    "response": "You are right about that fact and later on they ahve to remove it as well to see it.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i93xn41",
                                    "author": "RobMeijer",
                                    "score": 1,
                                    "created_utc": 1652900899.0,
                                    "response": "You're basically right. There is no good reason to keep the small block size.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9253ba",
                            "author": "bitkoin2014",
                            "score": 1,
                            "created_utc": 1652871655.0,
                            "response": "And yet some people really try to change that, what a shame.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i92h18p",
                                    "author": "ShadowOrson",
                                    "score": 8,
                                    "created_utc": 1652878807.0,
                                    "response": "hey u/MobTwo ,the comment I am replying to I suspect is bot/ai.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i930v9n",
                                            "author": "MobTwo",
                                            "score": 2,
                                            "created_utc": 1652887639.0,
                                            "response": "Thanks",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i998bvv",
                                                    "author": "jishanalikhan123",
                                                    "score": 1,
                                                    "created_utc": 1652998263.0,
                                                    "response": "Thanks for the source it is going to help us a lot for that matter.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i97r7pq",
                                            "author": "Mineallcoins",
                                            "score": 0,
                                            "created_utc": 1652975481.0,
                                            "response": "Yeah but we also have to understand the requirements if we can help for that or not..",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i95v8rj",
                                    "author": "8fht9",
                                    "score": 1,
                                    "created_utc": 1652932553.0,
                                    "response": "My personal opinion is that the max block size should be removed altogether and to let the miners decide which size works for them.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i998tu7",
                                            "author": "miloy8",
                                            "score": 4,
                                            "created_utc": 1652998499.0,
                                            "response": "I am pretty much sure that it is going to be changed eventually from where it actually started.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i91zr82",
                    "author": "PublicCurrency9039",
                    "score": 6,
                    "created_utc": 1652867320.0,
                    "response": "Thank you for providing the source, Roger!!\n\nA bit of history, (regarding Bitcoin), that unfortunately went in the wrong direction!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i91wa20",
                    "author": "FieserKiller",
                    "score": 3,
                    "created_utc": 1652864119.0,
                    "response": "Your [source](https://lists.linuxfoundation.org/pipermail/bitcoin-dev/2015-May/008004.html) does not point to the quote above",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i91x4fn",
                            "author": "lugaxker",
                            "score": 16,
                            "created_utc": 1652864899.0,
                            "response": "Correct source: https://bitcointalk.org/index.php?topic=140233.msg1492629#msg1492629",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i91xqdt",
                                    "author": "LovelyDayHere",
                                    "score": 12,
                                    "created_utc": 1652865477.0,
                                    "response": "Comment manually approved - it ran into Reddit's filters because of BCT link",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i96zsxl",
                                            "author": "Ziggyland101",
                                            "score": -1,
                                            "created_utc": 1652963090.0,
                                            "response": "Indeed the reality is that that dude must hear that and they have to do something.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i92ie2w",
                                    "author": "maintumanov",
                                    "score": 0,
                                    "created_utc": 1652879485.0,
                                    "response": "Yep, and I'd like to hear to that too. I wanna hear that dude.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i95v70j",
                                            "author": "simonterschegget",
                                            "score": 1,
                                            "created_utc": 1652932525.0,
                                            "response": "Only if blocks are filled. And our max block size will increase as necessary. But 32MB blocks are plenty large for now .",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i979ys1",
                                                    "author": "Bohgos",
                                                    "score": 1,
                                                    "created_utc": 1652968188.0,
                                                    "response": "No doubt about it, since it is a new thing we should keep in mind that this is a really new thing\n\nwe can see that even if this is better we had seen a lot of chnages in it as well for the time being.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i91xhoy",
                            "author": "doramas89",
                            "score": 10,
                            "created_utc": 1652865249.0,
                            "response": "It's even better.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i94kweq",
                                    "author": "irrving",
                                    "score": 0,
                                    "created_utc": 1652910519.0,
                                    "response": "I don't know about that lol, I found that to be pretty normal.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i97dym3",
                                            "author": "MSJ631009",
                                            "score": 1,
                                            "created_utc": 1652969960.0,
                                            "response": "They are going to prove a lot of things and this is how it will be better for them as well.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i921rxm",
                            "author": "nunovenancio",
                            "score": 1,
                            "created_utc": 1652869077.0,
                            "response": "Same thing I'm thinking lol, it just doesn't seem to prove anything.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i94bhw6",
                                    "author": "Jio43",
                                    "score": 1,
                                    "created_utc": 1652906546.0,
                                    "response": "Block size did not increase with taproot. Still capped at 1MB. I suggest reading a bit more .",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i96zn1f",
                                            "author": "Sunweed_inc",
                                            "score": 1,
                                            "created_utc": 1652962997.0,
                                            "response": "Indeed but they are getting profit by using this so I am going good with that as well.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i94baf4",
                    "author": "JustMyTwoSatoshis",
                    "score": 1,
                    "created_utc": 1652906463.0,
                    "response": "Better than the alternative:\n\nhttps://twitter.com/rogerkver/status/1063123138081370112\n\nAt least theymos didn't brag about centralized control of the hashrate and forcing hardforks. At least he didn't literally steal hashrate intended to be pointed at BTC and point it at BCH to accomplish this.\n\nBy the way, you got the exact hardfork you wanted. You just didn't get the ticker. Still, no one wants your centralized shitcoin.\n\nWhat's even more ironic is that you have now forever crippled BTC's argument for larger blocks because they will just point at the disaster that is BCH when anyone tries to bring that idea up. Way to forever confirm all the fears of the big block side with your centralized big block bitcoin.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i97tfxy",
                            "author": "boedi070885",
                            "score": 1,
                            "created_utc": 1652976380.0,
                            "response": "Yeah this is the only change I can see that is constant and that is how they are going to make a lot of chnages as well\n\nThey won't be doing anything about that fact since this looks like a common change which will be there.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i92y5gx",
                    "author": "TinosNitso",
                    "score": -1,
                    "created_utc": 1652886523.0,
                    "response": "Instead of trying to scale bitcoin, a block-size increase could be argued for on the grounds of increasing fee revenue (for miners). Since ETH has more TPS, it has more fee revenue. Since that should lead to improved security, a bigger block-size fits in nowadays. Without the split, big-blockers could probably have achieved **2x** by now, by convincing the community to increase the limit.\n\nI personally think that both ETH (**14 TPS**) & BTC (**3 TPS**) are full of **spam**. BCH (**0.6 TPS**) encourages real humans to use it as much as humanly possible, and that isn't even a **fifth** of BTC's throughput. It's *ridiculous*!\n\nAccording to the spam theory, a bigger block-size is needed to fund the miners. Both ETH & BTC both have similar (within **40%**) fee for median simple transfer. The spammers don't want ordinary folk to pay too much, so a bigger block-size implies more spam revenue. It's like a small-blocker **compromise**.\n\n**Edit**: One of us could spam BCH at 3 TPS for under $200/day. (Tbh +1 TPS would look less suspicious.) Buy a whole bunch of BCHUP or BCHBULL (leveraged tokens) and then do a little pump n dump. BTC & ETH holders probably did this, but decided they'd only pump & never dump (their coins). Hence their blockchains are full of spam. It's a **gamblers' tragedy**!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i93bzo7",
                            "author": "kersmi",
                            "score": 4,
                            "created_utc": 1652892166.0,
                            "response": "Attacks will increase as bitcoin cash dominance increases.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i978lbb",
                                    "author": "DSuhinin",
                                    "score": 1,
                                    "created_utc": 1652967555.0,
                                    "response": "Yeah you are right as the dependency is there so it will eventually increase as well with the time.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}