{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "urfayr",
            "title": "Bitcoin Maxi AMA",
            "url": "https://www.reddit.com/r/btc/comments/urfayr/bitcoin_maxi_ama/",
            "author": "Ok_Aerie3546",
            "created_utc": 1652765185.0,
            "score": 40,
            "num_comments": 242,
            "subreddit": "btc",
            "selftext": "I beleive I am very well spoken and try to elaborate my points as clearly as possible. Ask any question and voice any critiques and ill be sure to respectfully lay out my viewpoints on it.\n\nMaybe we both learn something new from it.\n\nEdit: I have actually learnt a lot from these conversations. Lets put this to rest for today. Maybe we can pick this up later. I wont be replying anymore as I am actually very tired now. I am just one person after all. Thank you for all the civilized conversations. You all have my well wishes.👊🏻",
            "stickied": false,
            "comments": [
                {
                    "id": "i8xpgji",
                    "author": "jessquit",
                    "score": 1,
                    "created_utc": 1652788845.0,
                    "response": "Abusing my mod privilege a bit to ask everyone to **save this conversation** for the next time one of our usual aggressive maxi trolls tries to argue that this sub isn't welcoming to people who are pro-BTC. Don't let them get away with that argument. This is a place that values constructive reasoned discussion about all Bitcoin related topics.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8wx9nr",
                    "author": "mtrycz",
                    "score": 19,
                    "created_utc": 1652765853.0,
                    "response": "I appreciate this greatly.\n\nWhy you got involved in bitcoin? When did you get involved in bitcoin? Why did you stay in bitcoin?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8wzkss",
                            "author": "Ok_Aerie3546",
                            "score": 9,
                            "created_utc": 1652767594.0,
                            "response": "I remember hearing about it in 2013. I was very young then and in a third world country. I was still a student, so had no income and with our banking infrastructure already so archaic and with how new bitcoin was overall, I brushed off any thoughts of doing a deep dive in it. Plus I was a kid. What do you expect?😂\n\nThen I came to the us in 2017, still a student, still really low income. Thats when I heard my friend talking about how its price had gone up. I asked him what it was and what do you do with it. He gave me a very shallow explanation and that did not convince me enough. In any case I did not have any disposable income at the time to invest, so I went on with my life.\n\nThen in 2020 I had a good job, and was investing bit by bit like everyone does once they start making some money. I saw the price of bitcoin rise. And to be honest I thought of making a quick buck, so I bought some. \n\nAnd as happens with all investments, you start to read more about them once you invest in them. So I started listening to as much content as I possibly could to learn more about it. \n\nNow for why I stayed. I come from a third world country where gold is the main savings instrument people use. The stock market is usually deemed to risky by your elders and people live within their means, buy gold and finally pass on the gold to their children.\n\nThis made it very easy for my head to understand the bitcoin as digital gold proposition. I read as to why gold got deemed valuable. And it made sense as to why bitcoin would become the same if not more valuable.\n\nI also never had any hopes for democracy, because I would always see politicians enticing poor people with money to buy their votes. I could never think of a way it would ever change. After bitcoin I felt like it was a way to keep governments and banks in check, by making them compete in a free market fashion for your capital. And I felt that was the missing check part of the \"checks and balances\" for democracy.\n\nI want to see bitcoin as a part of my grandchildrens future. And I will always stay here till I die. (Unless ofcourse, I am convinced not to). Rational person after all.😂",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8x8vac",
                                    "author": "mtrycz",
                                    "score": 9,
                                    "created_utc": 1652775631.0,
                                    "response": "Thank you \n\n> you start to read more about them once you invest in them. So I started listening to as much content as I possibly could to learn more about it. \n\nWhat are your main sources? Did you read the whitepaper?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8x9e2a",
                                            "author": "Ok_Aerie3546",
                                            "score": 7,
                                            "created_utc": 1652776120.0,
                                            "response": "Did read the whitepaper. Main source for conviction was reading bitcoin standard though.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8xb7nv",
                                                    "author": "mtrycz",
                                                    "score": 8,
                                                    "created_utc": 1652777808.0,
                                                    "response": "You have stated that your main interest in Bitcoin is as an investment. \n\nHow important is it for you for its ability to transact freely? Does it come before or after the investment aspect? How often do you transact in BTC?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8xbjya",
                                                            "author": "Ok_Aerie3546",
                                                            "score": 6,
                                                            "created_utc": 1652778115.0,
                                                            "response": "I never transact in btc unless its my last option. I budget accordingly and only buy btc with the excess dollars that I earn. For all my expenses I feel credit cards provide me with more value.\n\nI try to maximize value for myself, so btc for investment/savings and debt for transactions.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8xco9n",
                                                                    "author": "mtrycz",
                                                                    "score": 9,
                                                                    "created_utc": 1652779149.0,
                                                                    "response": "I really appreciate your straight honest answers. \n\n> I never transact in btc unless its my last option.\n\nSo how often, actually? How is your experience with transacting on BTC? Do you ever buy anything (even as a last option)?",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i8xez3c",
                                                                            "author": "Ok_Aerie3546",
                                                                            "score": 5,
                                                                            "created_utc": 1652781216.0,
                                                                            "response": "It depends as to what you mean by did you buy anything. \n\nDid someone directly take bitcoin as a form of payment from me? No. Did not even think about doing it.\n\nDid I sell my a small amount of bitcoin to make a payment or buy something? Yes. I already use credit cards so I just liquidated a little bitcoin to pay the credit card bill. \n\nI also bought a house in india by converting my dollars to rupees. Does that mean I did not buy the house with dollars? That seems like a gray area. 😅😅",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i8xfodi",
                                                                                    "author": "mtrycz",
                                                                                    "score": 6,
                                                                                    "created_utc": 1652781819.0,
                                                                                    "response": "Hmm, let me ask, what are your thoughts of the whitepaper, then. Do you think BTC works as described in it?",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i8xhudp",
                                                                                            "author": "Ok_Aerie3546",
                                                                                            "score": 2,
                                                                                            "created_utc": 1652783618.0,
                                                                                            "response": "No it doesnt. \n\nI see the whitepaper as if someone discovered fire and wrote a paper on how to use the fire. Surely youd agree humanity would be doomed if we stuck to just that one use case.\n\nIts social consenus and a free market. People will make economic decisions on if they want to own bitcoin or not. Sure, bitcoin cash can more strictly follow the whitepaper if it chooses to.\n\nI just thought the world needs a better store of value than gold and that brought me into bitcoin. \nYou might think the world needs a better p2p form of payment than cash and that leads to bitcoin cash.\n\nWe can debate on why I think the world needs a better sov more than it needs a better p2p cash. But I am really tired now and sleepy. Sorry. We can continue later in dms if you want.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i8x4kvo",
                                    "author": "WippleDippleDoo",
                                    "score": -13,
                                    "created_utc": 1652771744.0,
                                    "response": "So typical. A latecomer with 0 comprehension of crypto or economics who jumped on board exclusively due to the price rally. :D\n\nKeep stacking digital turd.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8xdl8f",
                                            "author": "jessquit",
                                            "score": 17,
                                            "created_utc": 1652779992.0,
                                            "response": "In the spirit of this sub I'm going to let this stay up as a warning.\n\nOP came here to answer questions and is being extremely polite and graceful in the midst of a lot of pointed questioning.\n\nThis comment is rude, bad faith, and adds nothing to the discussion.\n\nYou frequently offer thoughtful commentary, so I know you aren't just a troll. But please, be better. Sincerely, thanks.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i8x6dku",
                                            "author": "Ok_Aerie3546",
                                            "score": 14,
                                            "created_utc": 1652773335.0,
                                            "response": "I did not have an income till 2020. But ill gladly accept your comments about me. Have a nice day.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8xdeou",
                                                    "author": "jessquit",
                                                    "score": 14,
                                                    "created_utc": 1652779827.0,
                                                    "response": "Thank you for responding gracefully to trolls.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8xfitz",
                                                            "author": "Ok_Aerie3546",
                                                            "score": 11,
                                                            "created_utc": 1652781688.0,
                                                            "response": "Trolls need love too.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i8y1j80",
                                                    "author": "gr8ful4",
                                                    "score": 7,
                                                    "created_utc": 1652795150.0,
                                                    "response": "I think this got a little bit out of hand, because someones emotions got triggered.\n\nBut just for your information.\n\nMany of the people you are having this conversation with are early adopters that invested in Bitcoin in 2010-2012. Today OGs are basically divided in four groups. BTC, BCH, ETH and XMR.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8y5h9r",
                                                            "author": "Ok_Aerie3546",
                                                            "score": 5,
                                                            "created_utc": 1652796920.0,
                                                            "response": "Yeah I understand. I can feel it in the comments that the people here have been here for a very long time. The r/Bitcoin sub feels like a giant revolving door with every day new people joining. So they are pretty easy going because most of them are new.\n\nNo harm no foul.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8x8kwq",
                    "author": "wtfCraigwtf",
                    "score": 16,
                    "created_utc": 1652775367.0,
                    "response": "OP, you're either brave or foolish posting this. Or maybe both! But I respect that.\n\nEvery single argument about \"scaling BTC\" had already been beaten completely to death by 2018. You can read threads on Bitcointalk to save yourself the time of reciting the same tired Maxi talking points that were thoroughly debunked. There were fake Blockstream conferences about \"scaling Bitcoin\" which made sure that BTC did not scale. There was the Segwit fork (which, by the way, totally changed BTC protocol, to the point that every wallet had to be rewritten to support it) that was so unpopular it took 6+ months of bribing and cajoling of the BTC miners to ram through. And now even after Segwit, BTC still can only process 5 transactions per second at best.\n\nThe technical arguments for why the BTC network can only transfer one floppy disk worth of data every 8 minutes were obliterated over and over. The idiotic FUD about \"BTC nodes running out of hard drive space to store the blockchain\" was buried under mountains of scorn and ridicule, as a single $100 hard drive can store 30 years of BTC blockchain data.  It was only then that the narrative shifted: suddenly \"bitcoin\" was \"digital gold\", and was \"not for payments\", and \"only for storing value\". T**he technical arguments for not removing a blocksize limit which was added as a temporary patch to prevent spamming were utterly inferior,** **So the Maxies pivoted to avoid the elephant in the room.**\n\nFor anyone who was there during the scaling war, Bitcoin Cash was subjected to a massive negative PR campaign, run by Adam Back's (Blockstream CFO's) \"full-time teams\" on Twitter and Reddit. Around this time, Adam gave a speech, and when asked how to scale Bitcoin, he said \"you could open a TAB with your local business\". The people who didn't die of laughter were fairly upset that a person so stupid could be in control of Bitcoin Core development!\n\nCritics of Bitcoin Cash said \"the network will be spammed into oblivion\", and millions of dollars were spent on spamming BCH network. These came to be known as the \"stress tests\", and they inadvertently proved precisely the opposite: BCH did fine with continuous 16MB blocks. Fees never rose exponentially like the regularly do on BTC, and the BCH network has had 100% uptime since its inception. BCH has shown that Bitcoin can scale, and as Satoshi directly said \"it never really reaches a limit\" if SPV light nodes are used (and they are).\n\nCongrats on making a profit on BTC in 2020. It feels good to make money by making the right call. But remember that you could've just been lucky...",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i909avz",
                            "author": "phillipsjk",
                            "score": 4,
                            "created_utc": 1652828662.0,
                            "response": "Nitpick: At least the [first] \"stress test\" had only 4MB blocks on average.\n\nThis is because Bitcoin-ABC forked from the Bitcoin Core codebase after rate-limiting code was added (ostensibly as an anti-DDOS measure) to prevent the mempool from accepting more than 4MB every 10 minutes. The ~30MB block mined during that time was mined ~40 minutes after the previous block.\n\nSo when Greg Maxwell claims scaling is harder than just changing a constant he was correct: because code was added to make scaling more difficult.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9669zq",
                                    "author": "wtfCraigwtf",
                                    "score": 1,
                                    "created_utc": 1652939832.0,
                                    "response": "You're right, if I recall the miners worked together with devs to make sure the network stayed stable. \n\nThe other attack on BCH was the BSV mining takeover attempt, which was cleverly sidestepped by adding an opcode to BCH that BSV did not recognize. This caused BSV to fork almost instantly. There was still a race to maintain the higher total proof of work for a few months, but BSV has been left in the dust of late.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i96blyn",
                                            "author": "phillipsjk",
                                            "score": 2,
                                            "created_utc": 1652944077.0,
                                            "response": ">  cleverly sidestepped by adding an opcode to BCH that BSV did not recognize.\n\nSince this opcode was announced months in advance, it  was not a clever sidestep.\n\nThe clever side-step was the 10 block rolling finalization: invalidating Craig Wright's presumed hidden attack chain. (It was never published, but BSV hashrate seemed to have disappeared for a few hours.)\n\nLuckily nobody on the BCH side was dumb enough to take the bait and build a hidden attack chain for BSV. (POW mining makes \"honest\" hashpower more profitable.)",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i96dlir",
                                                    "author": "wtfCraigwtf",
                                                    "score": 2,
                                                    "created_utc": 1652945796.0,
                                                    "response": "Your memory is quite good! I remember early on when Craig had not been thrown completely out of the community, and when people thought nChain could be a respectable company (lol in hindsight), there was fighting with Craig about which opcodes BCH would support. Craig stomped out of the room because he doesn't know what an opcode is, and his devs werent smart enough to figure out that BSV not supporting all the BCH opcodes would create a hard fork  :)\n\nThe rolling finalization I had forgotten about and there were murmurings that the checkpoints in the BCH chain were not entirely a great idea. There were even bugs where older BCH ABC nodes would choke on checkpoint blocks. At this point I think it's all in the past.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i96etxx",
                                                            "author": "phillipsjk",
                                                            "score": 2,
                                                            "created_utc": 1652946895.0,
                                                            "response": "I think the way that Craig Wright thought it was going to go was that \"satoshi's shotgun\" would flood both chains with more than 32MB of transactions every 10 minutes. BSV, with it's larger capacity would emerge victorious.\n\nThe problem is that \"satoshi's shotgun\" started publishing transactions invalid on the BCH chain. Not sure if the OPcode was the cause. If I had to guess: they were reusing coin outputs that had never confirmed on the BCH  chain (never looked into it myself).",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i96frhi",
                                                                    "author": "wtfCraigwtf",
                                                                    "score": 1,
                                                                    "created_utc": 1652947740.0,
                                                                    "response": "True, a >32MB BSV block with more cumulative proof of work could've hijacked the BCH chain. Thank goodness Craig's monkeys were such badc0d3rz, he had a shot at a 51% takeover. He had some *serious* hashpower behind him, so it was no small attack.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i96gfvw",
                                                                            "author": "phillipsjk",
                                                                            "score": 2,
                                                                            "created_utc": 1652948358.0,
                                                                            "response": "A takeover based on cumulative POW was never possible because the two chains had incompatible consensus rules.\n\nHowever, it *would be* possible to flood the network with so many transactions that legitimate ones are no longer processed reliably.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8x26ia",
                    "author": "JonathanSilverblood",
                    "score": 13,
                    "created_utc": 1652769691.0,
                    "response": "If someone were to make a copy of Bitcoin and it's entire history/ledger, and then only change a parameter that doesn't impact what you define as critical to \"purest form of money\", but that still keeps the two networks apart - that copy would massively lose network effect.\n\nBut the question is, would it make it any worse at being a \"purest form of money\"?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8x3a28",
                            "author": "Ok_Aerie3546",
                            "score": 4,
                            "created_utc": 1652770632.0,
                            "response": "Im sorry, I have not quite understood the question.\n\nIs the question, why do I think bitcoin cash is not the purest form of money?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8x9k6n",
                                    "author": "JonathanSilverblood",
                                    "score": 7,
                                    "created_utc": 1652776279.0,
                                    "response": "No, the question is - given two two identical bitcoin networks and tokens, what makes one of them more or less pure than the other?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8xa4yx",
                                            "author": "Ok_Aerie3546",
                                            "score": 7,
                                            "created_utc": 1652776822.0,
                                            "response": "The one that stayed bitcoin. Wherever its consensus took it. When you sign up to bitcoin, you also sign up to any politics that come with consensus in general.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8xeagv",
                                                    "author": "jessquit",
                                                    "score": 10,
                                                    "created_utc": 1652780620.0,
                                                    "response": "That's a great answer.\n\n> you also sign up to any politics that come with consensus in general\n\nThere's so much that I'd like to say here, but to be fair to you I'll try to stay really brief.\n\nAre you familiar with Jameson Lopp and his compelling pro-BTC writings on the topic of sovereignty? They seem to be integral to most maxis I run across. I find his logic very compelling, though I disagree very much with some of his conclusions.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8xgwlg",
                                                            "author": "Ok_Aerie3546",
                                                            "score": 3,
                                                            "created_utc": 1652782851.0,
                                                            "response": "I think I have read these or heard these from someone. Also Robert Breedlove, he is very articulate with his logic and reasoning.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8zj320",
                                                                    "author": "jessquit",
                                                                    "score": 2,
                                                                    "created_utc": 1652817266.0,
                                                                    "response": "The point is that Bitcoin permits a new kind of monetary sovereignty since the properties of your coins cannot be changed without your express consent.\n\nI was wondering if that was your view, since that runs somewhat headlong into the notion that with Bitcoin you just have to accept the politics as they are. But if that isn't a deeply held view on your part you may not find the argument compelling. I may try a different tack instead.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i8zjs4z",
                                                                            "author": "Ok_Aerie3546",
                                                                            "score": 1,
                                                                            "created_utc": 1652817556.0,
                                                                            "response": "Yes these are my views. Im listening to Jameson Lopp right now, and I do agree with most of his views.\n\nBitcoin kinda is what the consensus chooses it to be. Its a bit different than gold. Gold is like constant money. Bitcoin is like social money.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i8zlq2a",
                                                                                    "author": "jessquit",
                                                                                    "score": 4,
                                                                                    "created_utc": 1652818361.0,
                                                                                    "response": "So sovereign as long as you follow the popular crowd? I don't think that's what sovereign actually means and I don't think that's how Jameson uses it. I think sovereign means that nobody else gets to redefine Bitcoin for me. Even if everyone else jumps off the cliff, I don't have to, because I am sovereign. Maybe you feel differently.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i8znvug",
                                                                                            "author": "Ok_Aerie3546",
                                                                                            "score": 1,
                                                                                            "created_utc": 1652819258.0,
                                                                                            "response": "Yeah that makes sense, but its a feature that can be used, but more realistically, wont be used.\n\nIts good that this exists, but realistically it will never be used. One person making his fork and dying on the hill. Social and economic consensus money will always be most valuable where social and economic consensus lies.\n\nYou always have the right to die on the hill you want, just like people have the right to take their life. But realistically rational people dont choose these options.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i8y94w0",
                                                    "author": "JonathanSilverblood",
                                                    "score": 4,
                                                    "created_utc": 1652798492.0,
                                                    "response": "you're assuming a split and competition between the two. perhaps that competition is inherent to the purety test you do, but from where I'm standing bitcoin is easy-to-copy, while bitcoins network effect is hard-to-copy.\n\nSince your other arguments were about specific qualities that make something a \"more pure money\", I was hoping to distill what it is about bitcoin today that makes it so unique and that cannot or is not expected to be replicated.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8xdc1u",
                    "author": "jessquit",
                    "score": 10,
                    "created_utc": 1652779758.0,
                    "response": "Welcome to the uncensored Bitcoin sub. Your views are very appreciated here. Thank you for your time and for responding with integrity and politeness.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8xfea9",
                            "author": "Ok_Aerie3546",
                            "score": 6,
                            "created_utc": 1652781584.0,
                            "response": "Thank you. In principle i do prefer no censorship. So as a sub I do like this sub better. My investment thesis is different than most people here, but the willingness to communicate in a civilized manner is not different than the people here.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8xa1ys",
                    "author": "Remora_101",
                    "score": 9,
                    "created_utc": 1652776742.0,
                    "response": "I get told by maxis all the time it is of utter importance to run a node. Can you tell me what exactly a none mining node does when it detects a wrong block and how that effects the network.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8xal5x",
                            "author": "Ok_Aerie3546",
                            "score": 4,
                            "created_utc": 1652777233.0,
                            "response": "Im an average joe. I dont run a node. Not worth it for me. If companies come up with plug and play nodes for cheap, I would consider and make that decision for myself. \n\nAs for you, you are free to decide if you want to run a node or not. Dont let other people tell you what you should and shouldnt do.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8xaurq",
                                    "author": "Remora_101",
                                    "score": 5,
                                    "created_utc": 1652777476.0,
                                    "response": "Not really an answer. If you don't run a node, why aren't you in BCH than? You get a usable chain if you drop the believe that everyone should run a node.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8xbc6g",
                                            "author": "Ok_Aerie3546",
                                            "score": 4,
                                            "created_utc": 1652777922.0,
                                            "response": "I want to store my value, and bch doesnt seem to do that very well since inception. For payments I use a credit card. Why would I care if the person who recieves my payments gets a good store of value or not. He can buy it himself later.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8xbsrc",
                                                    "author": "Remora_101",
                                                    "score": 8,
                                                    "created_utc": 1652778333.0,
                                                    "response": "Can you quote the Bitcoin Whitepaper title for me?\n\nWhere does the SoV property come from? What do you think is the technical difference between BTC and BCH that facilitates a SoV?\n\nWhy do you think the need for another SoV is important, but the need for the first sound p2p cash isn't?",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8xkiag",
                    "author": "bitcoincashautist",
                    "score": 6,
                    "created_utc": 1652785617.0,
                    "response": "How about this, I tell you my views and then let me hear what you think of it.\n\nFirst, I think these are undisputable facts:\n\n1. \"Bitcoin\" is the original invention created by Satoshi Nakamoto and presented to the world in 2009, the whitepaper describes an invention, a technology. The paper didn't foresee there could be multiple implementations of it, or how the ecosystem would evolve to thousands of similar inventions.\n2. Until 2017-08-01, \"Bitcoin\" unambiguously meant both the invention and the first and, at that time, only implementation of the invention. I refer to blocks 0 through 478558 as the first Bitcoin blockchain.\n3. With the block `478559`, the era of one Bitcoin was forever ended, and we got what is now known as Bitcoin Cash (BTC) and Bitcoin *Core* (BTC).\n\nOk, now for some rambling, points to argue about (unless you have some objection on the above, too):\n\nTechnically, both blockchains are \"Bitcoin\", as in instances of the invention. However, the whitepaper is not forward-binding in how the invention continues to evolve. No man is perfect and can see it all, and serve everyone, not even Satoshi. Future of P2P cash depends not on people executing *(their view of)* Satoshi's vision but THEIR OWN VISION for P2P cash. I'm not here to execute a \"dead\" man's vision, but my own vision, and I want to see P2P cash exists, I want to see it be uncensorable, unstoppable, empowering, enabling! Many want to see such P2P cash, and having visions of many people aligned around P2P cash will move things forward, and I'm seeing some good alignment in BCH community.\n\nEven if I will say BTC is nerfed because it will not live up to the P2P potential, it is still an instance of Bitcoin, the invention, and I acknowledge that market has spoken and decided that the same \"Bitcoin\" label will refer to a particular blockchain, whose currency trades as BTC, and is now loved by big tech and finance as a sort of digital gold and speculation vehicle. Let them have it. If you're buying it to get those sweet +% \"tendies\", go ahead and good luck, I bought some too! But I know what I'm buying and why. I think many don't. Even if I align with the vision for P2P cash doesn't mean I don't like to make money along the way :)\n\nI think BCH has potential to bring me way more than x2 x3 BTC can, which is why my BCH bags are bigger and I'm working hard on actually [doing something](https://gitlab.com/0353F40E/group-tokenization/-/blob/master/CHIP-2021-02_Group_Tokenization_for_Bitcoin_Cash.md) to help move the needle. I expect the gains from BCH to be worth all my time and energy spent on this. BCH is also an instance of Bitcoin, the invention, one that may live up to the P2P potential, but as we have seen in 2017, that's not been enough to claim THE \"Bitcoin\" title, not as the invention, but a particular implementation of the invention that got the most market cap. Nothing is forever, and success of one doesn't preclude success of the other. If we grow big, the name won't matter. I like cash, and when I say cash I mean Bitcoin Cash :) **Market has spoken, but it never stops speaking, and I'm betting it'll start to speak more favorably about BCH.** Anyway, both blockchains are viable, they exist, they are used in one way or another, and compete with all the other blockchains to take the market cap.\n\nWith all that said, consider this... BCH is now at utility level BTC had back in like 2013/14, and I use this as metric: https://bitinfocharts.com/comparison/activeaddresses-btc-eth-ltc-bch.html right?\nNow, BCH community is working to serve markets that actually need and want p2p cash, carving our own path away from mainstream speculators. What could we expect when that metric grows to parity with BTC and ETH? And ETH had problems with fees at those utility levels - WE WON'T, we can scale to grow 10x beyond that, and more...",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8wwl6c",
                    "author": "MobTwo",
                    "score": 18,
                    "created_utc": 1652765356.0,
                    "response": "When you're a maximalist, by definition that means a person who holds extreme views. What do you say to such closed minded mindset?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8wwxw0",
                            "author": "Ok_Aerie3546",
                            "score": 14,
                            "created_utc": 1652765617.0,
                            "response": "I beleive bitcoin is on its way to be the purest form of money. Thats my maxi stance.\n\nI am here to answer questions to see if I can learn something new. My new learnings might increase or decrease my convinction about bitcoin. And I am willing to have that conversation. I dont think thats closed minded.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8wx7jj",
                                    "author": "MobTwo",
                                    "score": 21,
                                    "created_utc": 1652765809.0,
                                    "response": "If someone is willing to look at the facts and change their mind about Bitcoin, that wouldn't be a maximalist. That's being reasonable and logical. Having said that, one must admit the low transaction fees like Bitcoin Cash is a much better form of money than BTC that cost over $50 per transaction during peak periods. Do you agree low fees is better or do you think paying $50 transaction fees is better?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8wy0mj",
                                            "author": "Ok_Aerie3546",
                                            "score": 4,
                                            "created_utc": 1652766412.0,
                                            "response": "I beleive low fees makes bitcoin cash a better form of payment and not money. \n\nHow does it differ?\n\nPayment is the activity you do to exchange goods and services for some form of money.\n\nMoney has two main uses in the following order of importance \n- Money needs to store value over longer and longer periods of time. In other words money should be a good savings instrument.\n- Money should be able to be used as a form of payment.\n\nWhy did I write it in that order?\n\nBecause most of the times, you want to store money than spend it. Thats how we build for our future. A person prefers to have a larger part of his income saved rather than spent, hence implying the saving feature of money to be more important than the spending feature.\n\nThat being said, I agree that bitcoin cash is a better form of payment and I would not mind to use it to pay for things if required.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8x0tte",
                                                    "author": "SoulMechanic",
                                                    "score": 9,
                                                    "created_utc": 1652768588.0,
                                                    "response": "Money should store value but with crypto being fairly accessible to just about anyone and everyone, right now it's mostly being used for speculating, so no crypto is really storing value well except for maybe a few stablecoins at the moment.\n\nIf we want to move beyond speculation, usability as money should and hopefully will become more important to people and for that you need it to be faster and cheaper than the alternatives, for adoption as a currency to grow.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8x32w5",
                                                            "author": "Ok_Aerie3546",
                                                            "score": 4,
                                                            "created_utc": 1652770459.0,
                                                            "response": "Any market in the short term is more like a voting machine. People going I like luna because free money, I like dogecoin because elon, I like monero because privacy. \n\nAll crypto currencies are in their infant stages. You can never expect the one you hold to be the winner of the popularity contest every day over short periods of time.\n\nBut the same market over a longer time period acts like a weighing machine, where right choices get rewarded and wrong choices get punished. Crypto due to the young nature of the market, lower market cap, high divisibility, global nature and accessibility, will take a longer time to iron out volatility. But bitcoin atleast has shown to store value over longer periods of time.\n\nStoring value is something done over years or decades or generations. If anyone expects to make a big purchase in the next 6 months, he wont put that money in an index fund. He'll just save it and accept the inflation for the surety of not losing any value after 6 months.\n\nAs for the growth of the currency, I feel you are thinking of it in the opposite way. \n\nHumans did not start valuing gold more because it was accepted everwhere.\n\nHumans started accepting gold because it was valuable to everyone.\n\nThe real adoption is when people want to be paid in crypto and set their prices in crypto. I beleive whatever adoption is shouted about bitcoin as well is all marketting. Adoption is when someone prices and accepts things in bitcoin and keeps it as bitcoin. I think we are a generation away from that time.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8x4g1s",
                                                                    "author": "SoulMechanic",
                                                                    "score": 8,
                                                                    "created_utc": 1652771627.0,
                                                                    "response": "It's the properties gold has that made it work as a currency, it's rare, hard to forge, durable, moldable, recognizable, etc.\n\nBut as a currency it got replaced by paper, and that got replaced by electronics by the biggest factor, efficiency. Efficiency is the ultimate deciding factor in most things, eventually efficiency tends to win out.\n\nBitcoin doesn't have this, it's not efficient to use as a currency and instead has to rely on a band aid fix to kinda achieve this but in doing so throws out much of what made Bitcoin great in the first place.\n\nHaving to rely on a 2nd layer to just to be what your fundamental purpose was in the beginning, will push people to use coins that can do that in one layer, because it's simpler, easier, faster, and safer.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i8x6735",
                                                                            "author": "Ok_Aerie3546",
                                                                            "score": 2,
                                                                            "created_utc": 1652773177.0,
                                                                            "response": "Wait. Efficiency hasnt won out in the case of gold. It is estimated that the total value of all currency in the world is between 4-5.5 trillion usd. This is pure currency, cash + bank balances. The ones used for transactions. \n\nThe market cap of gold is estimated at 10 trillion. Even though gold performed badly as a currency, it still gets valued higher than fiat. So cant yet say that improvements in efficiency show up in the value stored in the asset.\n\nAlso, Fiat was not a free market phenomena, poeple were essentially forced to use fiat. A forced market cant be used well to depict values associated to the assets.\n\nBitcoin is not the best form of payment. I agree. Thats why I use credit cards. The best form of payment will always be debt in a depreciating currency. No amount of innovation and efficiency will win against the economics of this.\n\nI am a bitcoin maxi, not a lightning maxi. I have never used lightning before. As I only intend to save in bitcoin. The only transactions I do on the bitcoin network is moving money and paying to people who want to accept it. If I have to spend from my savings, that would be an error in my budgetting and I would try to minimuze these errors as much as possible. I happily pay the fee when I have to move my money, the highest I had paid was 8 dollars to move 20k in bitcoin. I did not mind it.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i8x7az5",
                                                                                    "author": "SoulMechanic",
                                                                                    "score": 4,
                                                                                    "created_utc": 1652774185.0,
                                                                                    "response": ">Efficiency hasnt won out in the case of gold.\n\nIn this case I'm talking about it has. Almost nobody pays for goods and services with gold. These days it functions as a commodity not so much a currency.\n\n>Fiat was not a free market phenomena, poeple were essentially forced to use fiat.\n\nThis is mostly incorrect. Fiat was started as bank notes by banks as a free market thing as banks wanted an easier (more efficient) way to pay loans, transfer funds, etc. This then became legal tender that could be swapped at any time for the equivalent in gold and eventually unified as a federated currency.\n\nThe only forcing, happened later when Nixon removed the requirement of banks holding their savings amounts in equivalent gold.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i8x7soi",
                                                                                            "author": "Ok_Aerie3546",
                                                                                            "score": 2,
                                                                                            "created_utc": 1652774632.0,
                                                                                            "response": "So if your question is that dollar is a superior payment method than gold, I would say yes. But gold is still the better store of value than the dollar.\n\nFiat is a forced phenomena. When dollars were redeemable for gold they were not fiat yet. Fiat was only introduced by Nixon like you said. Before that we were still living with gold as the monetary base.\n\nWe went to gold backed currency for efficiency, but we did not go to fiat for efficiency.\n\nFor reference, Fiat is a type of currency not backed any commodity and declared by decree by govt to be used as legal tender.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i8xm8ok",
                                                    "author": "jonathan_neil",
                                                    "score": 6,
                                                    "created_utc": 1652786797.0,
                                                    "response": "> Because most of the times, you want to store money than spend it. Thats how we build for our future. A person prefers to have a larger part of his income saved rather than spent, hence implying the saving feature of money to be more important than the spending feature.\n\nThis seems misguided to me. I would never want to store/save money that could not be spent when I needed to spend it, there would be no reason for me to save it in the first place. This is why the spending feature in my opinion is the more fundamentally important one.\n\nWith this is mind, how can the saving feature of money be more important if the entire purpose of saving it is for it to be spent at a later time?\n\nEven in a theoretical extreme scenario where there was money which I could spend immediately upon receiving (no ability to be saved) I could still use it to buy things I need, including other assets which are great for storing value to be extracted at a later time. But inversely, a money which I could save infinitely but never spend, would be absolutely useless to me.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8xnslb",
                                                            "author": "Ok_Aerie3546",
                                                            "score": 1,
                                                            "created_utc": 1652787807.0,
                                                            "response": "Oh thats easy. Your reason for saving is to protect your purchasing power. And if you cant spend it directly, just sell it and then spend it. I am not against fiat. Central banks can inflate all they want, I just dont want to be part of it when im saving. If I am spending, I dont care about inflation because inflation tends to 0 over shorter periods of time.\n\nGold is a form of money that cant be spent directly, but people still save it. This is no extreme scenario. The point is for immediating spending, you dont need good money. Look at the dollar. Horrible for saving, but great for spending (due to the fact that it loses value over time). Hence I feel the savings feature is more important criteria for a good money than the spending feature. Otherwise you would be promoting the dollar as good money.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8xp4yz",
                                                                    "author": "jonathan_neil",
                                                                    "score": 5,
                                                                    "created_utc": 1652788650.0,
                                                                    "response": "> And if you cant spend it directly, just sell it and then spend it.\n\nYou seem to be answering earnestly so I really hate to get down to semantics however my entire disagreement with your original post hinges on each of our interpretations of the word \"spend\". \n\nIn my current understanding, I see no difference between the words \"spend\" and \"sell\" when it comes to money. I consider being able to \"sell\" it as spending it on whatever you sold it for.\n\nSo again, money which could not be \"spent\" (including \"selling\") would be absolutely useless to me. \n\nEven when I buy gold with fiat (aka \"sell\" my money for gold) I have always considered that spending it. The fact that I am spending it on something that can also be considered money does not change my view that the money is being \"spent\" to buy something else, regardless of what that may be.\n\nIn an effort to help me better understand your position, can you elaborate clearly difference between \"selling\" a money and \"spending\" a money?",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i8xqhgc",
                                                                            "author": "Ok_Aerie3546",
                                                                            "score": 3,
                                                                            "created_utc": 1652789446.0,
                                                                            "response": "Oh when i say \"selling\" i mean exchanging it for another form of money. And when I say \"spending\" I mean exchanging for goods and services. Hope that clears the confusion.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i8xw072",
                                                                                    "author": "jonathan_neil",
                                                                                    "score": 2,
                                                                                    "created_utc": 1652792453.0,
                                                                                    "response": "So I think we both agree that gold is a form of money. However you can buy gold in many forms, such as coins, jewelry, bullion, etc.\n\n\nWould you not consider buying those coins/bullion/jewelry \"spending bitcoin\" even if those goods are made of solid gold and thus technically also fit your definition of money?",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i8xxuwe",
                                                                                            "author": "Ok_Aerie3546",
                                                                                            "score": 1,
                                                                                            "created_utc": 1652793389.0,
                                                                                            "response": "Exchanging between gold and bitcoin I would count as both spending and selling as both are valid forms of money. I also consider all forms of gold equivalent to gold itself and not separate goods and services. Thats also one of the definitions of money. Most markettable good. Which means that if you try to sell jewelry, you wont get more fiat than its value in gold. So gold is the highest form of money and nothing can be made from gold that is more makettable than gold itself. Same applies to bitcoin as in you can make nothing from bitcoin that is valued more than the bitcoin itself.\n\nI usually say selling for exchanging into fiat and spending as exchanging into goods and services that are not money.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i8wzkel",
                                                    "author": "LovelyDayHere",
                                                    "score": 9,
                                                    "created_utc": 1652767585.0,
                                                    "response": "Actually, how do most people get money?\n\nThrough _exchange_ for goods or services.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8wzs5h",
                                                            "author": "Ok_Aerie3546",
                                                            "score": 6,
                                                            "created_utc": 1652767759.0,
                                                            "response": "Yes. But most people get bad money (fiat) in exchange for goods and services and then they make a decision of what good money to buy to store it. And they usually spend the remaining bad money.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8x105p",
                                                                    "author": "LovelyDayHere",
                                                                    "score": 9,
                                                                    "created_utc": 1652768728.0,
                                                                    "response": "So they need to _echange_ twice if they get some bad money in the first place.\n\nThey are lucky if they can exchange for a better money. Surely the worst money is that which can not be exchanged for something at all.\n\nLet's look at a simple case for how many people or businesses earn money (good or bad money). They do many small exchanges over a longer period of time. Some of that money they are forced to spend again, on necessities, to survive.\n\nThere's a lot of payment required in an economy. Except for those who inherit, or live off charity, payment and spending on our survival comes first, long before savings.\n\nThe better a money handles that basic payment case every day, the more we can trust it to store value over time.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i8x4yqs",
                                                                            "author": "Ok_Aerie3546",
                                                                            "score": 7,
                                                                            "created_utc": 1652772079.0,
                                                                            "response": "They dont need to exchange twice neccesarily.\n\nIf your income = expenses, you would be fine using the bad money itself to pay for things as all of your income was gonna be spent any way. So one would not care about how well the money stores value.\n\nIf your income > expenses, you would budget to keep a portion in bad money for expenses and a portion in good money for savings. Needing only one exchange transaction every pay period.\n\nThe worst money is the one that cant be exchanged for goods or services even indirectly. Something like cat poop. No one is willing to exchange it for anything of value so its the worst money. With bitcoin as long as you are able to convert it to dollars and pay for things in dollars, it will serve as a valid mode of payment. \n\nExample: I cant use my dollars to buy a house in India. But as long as I can convert my dollars to rupees to buy the house, its a valid form of payment. But my inability to buy the house directly with dollars doesnt not make the rupee a better money than the dollar.\n\nFor the people for whom survival comes first are living jb a situation where income <= expenses. In their case, as I stated before, they are better off using the bad form of money ie the one they get paid in. This is because there is no surplus. And there first goal to a better life would be to get in a position where their income > expenses, and once they reach that point, savings become more important than payments.\n\nIts quite the opposite, a better money that you can trust to store value over time organically becomes a desirable form of payment. Thats why people working in tech are happy to be paid in stock, even though they can buy nothing with it for a year and after a year have to liquidate to buy anything, for the sole reason that they expect that stock to hold its value over time better than the dollar.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i8zcyf5",
                                                    "author": "throwawayo12345",
                                                    "score": 3,
                                                    "created_utc": 1652814754.0,
                                                    "response": "What benefit does BTC have over Gold, given the store of value argument?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8zec3e",
                                                            "author": "Ok_Aerie3546",
                                                            "score": 2,
                                                            "created_utc": 1652815313.0,
                                                            "response": "Portability: Bitcoin doesnt exist in a specific country that you need to transport it. And the fees are not calculated on a percentage basis. This makes it great for moving large amounts of bitcoin.\n\nSelf custody: the ability to self custody no matter what the amount. As bitcoin is not physical and doesnt take space. The security needed to secure 1000 dollars of bitcoin is the same as the security needed to secure 10 billion dollars of bitcoin. This makes it easier to self custody larger and larger amounts of bitcoin. And if security is done well (with multisigs and decoys and geographical separation of keys) you can minimize the risk of getting your bitcoin stolen. The same cant be said about gold.\n\nPeople stop stacking gold once they have too much gold in their house that it becomes expensive to secure and move it. Bitcoin does not have these flaws and thus can be stacked no matter the amount.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8zkgey",
                                                                    "author": "throwawayo12345",
                                                                    "score": 2,
                                                                    "created_utc": 1652817833.0,
                                                                    "response": "These are both usability arguments - having nothing to do with poor monetary policy.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i8znncy",
                                                                            "author": "Ok_Aerie3546",
                                                                            "score": 2,
                                                                            "created_utc": 1652819159.0,
                                                                            "response": "Yes only benefits as I see them are usability ones. The ones that make centralization of bitcoin unnecessary.\n\nCentralization of gold was the start of its downfall.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i8zs717",
                                                                                    "author": "don2468",
                                                                                    "score": 2,
                                                                                    "created_utc": 1652821053.0,
                                                                                    "response": "You say your main influence is 'The Bitcoin Standard' can you reconcile these two statements\n\n\n>> **Chris Pacia:** Currently reading \"The Bitcoin Standard\". The following two sentences are about 150 pages apart and seem to be written by either two different authors or someone who didn't see the irony of what he was writing:\n>>\n>>\n>> (1) \"The fatal flaw of the gold standard at the heart of these two problems was that settlement in physical gold is cumbersome, expensive, and insecure, which meant it had to rely on centralising physical gold reserves in a few locations―banks and central banks―leaving them vulnerable to being taken over by governments\"\n>>\n>>\n>> (2) \"The future use of Bitcoin for small payments will likely not be carried out over the distributed ledger, but through second layers. Bitcoin can be seen as the new emerging reserve currency for online transactions, where the online equivalent of banks will issue Bitcoin-backed tokens to users while keeping their hoard of Bitcoins in cold storage.\" [link](https://twitter.com/ChrisPacia/status/1028444869583425538)\n\n\nWhen the masses cannot self custody their own Bitcoin, why will Bitcoin not suffer the same fate as Gold?",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i8ztwl4",
                                                                                            "author": "Ok_Aerie3546",
                                                                                            "score": 1,
                                                                                            "created_utc": 1652821773.0,
                                                                                            "response": "Which masses cant self custody bitcoin? Setting up a hardware wallet and self custodying my bitcoin was by far the easiest activity regarding bitcoin that I have done so far. 50 dollar device. Am I missing some cost that you maybe thinking of?",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i8xhb05",
                                    "author": "pyalot",
                                    "score": 4,
                                    "created_utc": 1652783181.0,
                                    "response": "> I beleive bitcoin is on its way to be the purest form of money\n\nWhat if for lack of adoption/usability/utility and excess of friction/volatility, BTC becomes a forgotten footnote nobody remembers in 10 years?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8xiuuu",
                                            "author": "Ok_Aerie3546",
                                            "score": 2,
                                            "created_utc": 1652784406.0,
                                            "response": "Ill tell you something I found funny.\n\nIf you ask any indian why they buy gold, they will all say because \"number go up\". Even the most educated and travelled ones. At some point \"number go up\" technology gets so entrenched in your life that you stop looking for utility. Economic incentives are all that matter and nothings better than \"Number go up\".",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8ztb7k",
                                                    "author": "pyalot",
                                                    "score": 3,
                                                    "created_utc": 1652821518.0,
                                                    "response": "What if I told you gold costs $50 to transfer and only 3 people can do so every given second. Do you still think Indians would buy such \"gold\"?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8zueq3",
                                                            "author": "Ok_Aerie3546",
                                                            "score": 3,
                                                            "created_utc": 1652821991.0,
                                                            "response": "Yes!!! The gold we buy almost spends it whole life in a locker at home!! And only gets passed down. Selling your mothers gold is almost considered a sin. So those fees you outlined would not affect the demand of gold.\n\nYou think indians arent being price gouged by jewelers, they always are and they still buy it.\n\nIts so entrenched in the culture that the self custodied gold in peoples houses is estimated to be more than the country's gold reserves.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i90d4it",
                                                                    "author": "phillipsjk",
                                                                    "score": 5,
                                                                    "created_utc": 1652830486.0,
                                                                    "response": "Let's assume that BTC is ONLY used to move occasionally, like gold.\n\nPopulation of India: 1 380 000 000\n\n(1 380 000 000people)/(2000transaction/blocks)/(144blocks/day)/(365.25days/year)=13people.transaction.years\n\nIt is not a compelling improvement over gold, which has a much longer history: so why bother?",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i90erc6",
                                                                            "author": "Ok_Aerie3546",
                                                                            "score": 1,
                                                                            "created_utc": 1652831276.0,
                                                                            "response": "What did you calculate?\n\nI really dont know, I cant answer anything.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i90g3ut",
                                                                                    "author": "phillipsjk",
                                                                                    "score": 2,
                                                                                    "created_utc": 1652831938.0,
                                                                                    "response": "How many years it would take for every Indian to make ONE BTC transaction.\n\nBTC is being kept at such an artificially small capacity that, IMO, gold is still more portable.",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "i8zy5qi",
                                                            "author": "Ok_Aerie3546",
                                                            "score": 1,
                                                            "created_utc": 1652823595.0,
                                                            "response": "Ill tell you when indians will stop buying gold, if we found an unlimited supply of gold and gold price start dropping consistently, people would still buy during that drop. A whole generation might need to pass, for the people to realize gold is no longer number go up. Thats when they will stop buying it. \n\nFees and how often you can buy gets figure out by the people. Some people dont want to bring home small amounts of gold. So they setup a payment plan for 1-2 years, pay monthly and at the end of 1-2 years bring the gold home.\n\nIndians were the original hodl and dca army for the original number go up asset.😂😂😂",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8xdyri",
                    "author": "CDSagain",
                    "score": 17,
                    "created_utc": 1652780332.0,
                    "response": "I've read a few of your comments on this thread and the thing that stands out the most is your replies are polite and respectful while giving your thoughts and opinions. You are not a BTC maxi. To be a BTC maxi you need cult like disregard for logic or truth, you need to scream and shout about how bcash stole the name and most of all you need to secretly think that at some stage surly BTC will raise the blocksize but dare not say it as that would be heresy and the laser eyes will crusify you 🤣",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8xgd7n",
                            "author": "Ok_Aerie3546",
                            "score": 5,
                            "created_utc": 1652782401.0,
                            "response": "I dont cross out the possibility of bitcoin increasing its block size. I am just one single person. I cant possibly know how the consensus evolves. \n\nThere are so many cryptos that use bitcoin in the name. If bitcoin cash was just called bitcoin, id be concerned. But as long as its different, there will be no confusions. I just dont want people buying something they did not plan to, due to naming confusions.\n\nIf I am not a maxi, what am I?🤔",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8xk3tr",
                                    "author": "CDSagain",
                                    "score": 8,
                                    "created_utc": 1652785331.0,
                                    "response": "Well judging by what I read, I'd say you were just a normal person with a interest in cryptocurrency.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8xnv3i",
                                    "author": "jessquit",
                                    "score": 9,
                                    "created_utc": 1652787850.0,
                                    "response": "Bitcoin Cash absolutely should have just been called Bitcoin IMO.\n\nThere is no person, organization, institution, or government in control of Bitcoin. Nobody can decide for anyone else what Bitcoin is. At least that's how it was supposed to be.\n\nMight it produce market confusion to have two competing versions of Bitcoin? Quite likely. Strangely that wasn't a problem for anyone either of the times BCH got attacked. In those cases, nobody seemed to care whatsoever that there were two BCHs. The market sorted out which alternative got to keep the name. Funny isn't it?\n\nBut when big block and small block Bitcoin split, the fix was in from the start. There was never a time when there was \"Bitcoin Core BTCORE\" and \"Bitcoin Cash BTCASH\". The market never had a chance to have its say. An in-group of power brokers decided that the small block fork would be \"Bitcoin BTC\" and the big block fork would be \"Bitcoin Cash BCH.\"\n\nAnd here we are, forced to ask ourselves if it's really true that \"there is no person, organization, institution, or government in control of Bitcoin, and nobody can decide for anyone else what Bitcoin is.\"",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8xotwl",
                                            "author": "Blazedout419",
                                            "score": 1,
                                            "created_utc": 1652788458.0,
                                            "response": "Because BCH forked and also acknowledged it was the fork by adding replay protection. If I spin up a wallet from 2013 which chain does it end up on today?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8xq489",
                                                    "author": "jessquit",
                                                    "score": 10,
                                                    "created_utc": 1652789231.0,
                                                    "response": ">Because BCH forked \n\nBig blocks was a fork, Segwit was a fork. Forking the code and the coin is a fundamental and vital defense mechanism. **Without this mechanism, Bitcoin could be sabotaged by anyone who managed to assert sufficient control over the codebase.** Hint hint.\n\n> and also acknowledged it was the fork by adding replay protection.\n\nWe can also agree that it shouldn't have done that either.\n\n> If I spin up a wallet from 2013 which chain does it end up on today?\n\nI'm sorry this argument holds no water unless your point is that people in 2122 should be able to run unpatched 100-year old clients. Software upgrades. Don't upgrade? Things break. Imagine if all MS Word documents had to be readable by 1988 clients.  Nothing works like that.\n\nThe idea that the world's future money supply should be limited by a one-off code hack inserted without comment in the prototype version of the software is absolutely ridiculous and should always and everywhere be called out as such.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8xsomn",
                                                            "author": "Blazedout419",
                                                            "score": 1,
                                                            "created_utc": 1652790699.0,
                                                            "response": "A huge majority agree and stuck with the original chain. That’s what crypto is all about… consensus.",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "i8xz45v",
                                                            "author": "Contrarian__",
                                                            "score": 1,
                                                            "created_utc": 1652794001.0,
                                                            "response": "> I'm sorry this argument holds no water unless your point is that people in 2122 should be able to run unpatched 100-year old clients. Software upgrades. Don't upgrade? Things break.\n\nI think this is strawmanning the point.  Running the old software and having it still sync to the current chaintip **proves** that no rules you signed up for were broken. There may be additional rules that you don't care about, or even new validation things that you also don't necessarily care about, but that's not particularly relevant. If you're an only-occasional user of Bitcoin, and you go away for a while and come back, you'd somehow have to verify all the 'upgrades' that took place to make sure they didn't break any of the rules you cared about. By running an old client, you can verify it for yourself.\n\nOf course, that's not to say that it ought to be impossible to hard fork. It's just that there are advantages to making it safe and rare. Satoshi seems to agree, since he only deliberately hard-forked **once**, and that was to make soft-forking easier.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8y13ih",
                                                                    "author": "jessquit",
                                                                    "score": 7,
                                                                    "created_utc": 1652794949.0,
                                                                    "response": "\n>I think this is strawmanning the point.  Running the old software and having it still sync to the current chaintip **proves** that no rules you signed up for were broken. \n\nRule I signed up for: no blocks > 1MB.\n\nIt's clear as day right in the code. And yet, every day, the blockchain that I'm supposedly checking is producing blocks > 1 MB.\n\nAll the old software \"proves\" is that its validation rules can be exploited. Which is why it's extremely dangerous to base network security on the behavior of outdated nodes.\n\n> If you're an only-occasional user of Bitcoin, and you go away for a while and come back\n\nYou should always update your node software to the latest version to make sure you're compatible with the network and not vulnerable to newly discovered exploits. That's really the same procedure everyone should follow with software systems that protect financial assets.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i8y20kp",
                                                                            "author": "Contrarian__",
                                                                            "score": -2,
                                                                            "created_utc": 1652795374.0,
                                                                            "response": "> Rule I signed up for: no blocks > 1MB.\n\nNo, you signed up for no blocks serialized-in-a-certain-way exceeds 1MB, and that's still the case.\n\n> And yet, every day, the blockchain that I'm supposedly checking is producing blocks > 1 MB.\n\nOnly serialized in a certain way that those clients see. As I said, new rules can be added, but this doesn't steal your coins or print money, etc. The UTXO set is identical. No coins locked with rules you agreed to have moved without satisfying their locking conditions, etc. \n\n> All the old software \"proves\" is that its validation rules can be exploited.\n\nIt does a lot more than that. You're still strawmanning. \n\nA culture of constant consensus-**breaking** (ie - hard fork) changes is dangerous, splinter-prone, and centralizing.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i8y3end",
                                                                                    "author": "jessquit",
                                                                                    "score": 9,
                                                                                    "created_utc": 1652796007.0,
                                                                                    "response": ">> Rule I signed up for: no blocks > 1MB.\n>\n>No, you signed up for no blocks serialized-in-a-certain-way exceeds 1MB\n\nNo, I signed up for no blocks > 1MB until the limit is raised by a hard fork.\n\nThe fact that someone was subsequently able to exploit this perfectly explicit rule by removing the signatures was definitely not anticipated by anyone when I \"signed up.\"\n\nThe exact same thing holds true of other limits. If a smart hacker is able to exploit the 21M coin limit in a way that old nodes consider valid, we can't retroactively claim that everyone \"signed up\" for unlimited inflation.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i8y4hk1",
                                                                                            "author": "Contrarian__",
                                                                                            "score": -4,
                                                                                            "created_utc": 1652796491.0,
                                                                                            "response": "> I signed up for no blocks > 1MB until the limit is raised by a hard fork.\n\nGreat! Continue to enjoy that rule not being violated by running a node from before SegWit. (Not that it's 'violated' by the current software...)\n\n> exploit this perfectly explicit rule by removing the signatures was definitely not anticipated by anyone when I \"signed up.\"\n\nYou must hate P2SH, because it is almost identical in its level of \"exploitation\" (read: not an exploit at all).\n\nYou understand that Bitcoin supported locking and unlocking coins without signatures from the very beginning, right?\n\n> The exact same thing holds true of other limits. If a smart hacker is able to exploit the 21M coin limit in a way that old nodes consider valid, we can't retroactively claim that everyone \"signed up\" for unlimited inflation.\n\nBad faith argument. There's no \"bug\" being \"exploited\" in Segwit or P2SH. They work perfectly consistently with the intended rules.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8xqzvy",
                    "author": "doramas89",
                    "score": 6,
                    "created_utc": 1652789744.0,
                    "response": "I've read most of the comments and compliment your politeness and believe you are actually a logical person, not a blind BTC maximalist.\nYour points about BTC make sense for those in a position with excess income > expenses, and choose to store the savings in this new \"digital gold\" that is BTC.\nNevertheless, what I hear is a defense of BTC's limitations.\n-------------------------------------------------------------\nIt has no advantages over a counterpart that would allow it to be transacted, worldwide, instantly and for <1c fee. Bitcoin was stripped of its capacity to process enough economic activity by keeping it limited to ~4 tx/second. The only advantage BTC has is the higher security (hashrate), which is a mere function of the price. I will go ahead and say what many believe:\nBTC is a *coup d'etat*, a false flag that nerfed Bitcoin.\n--------------------------------\nUnfortunately, indians are not able to transition out of the Rupee into Bitcoin to escape their inflation theft. Just like you describe, BTC has become a \"savings account\" for those with income > expenses, and unreachable for the vast majority of the world on income <= expenses.\nThis nerf is by design so that the world keeps being run by the Bank of International Settlements, the International Monetary Fund, the Federal Reserve etc and so that they can keep stealing human wealth with their money creation. BitcoinCash is what BTC is and more: humans can live on good money beyond any third-party attempts to prevent them from prospering.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8xt945",
                            "author": "Ok_Aerie3546",
                            "score": 1,
                            "created_utc": 1652791007.0,
                            "response": "Hashrate would be the only benefit, and maybe a sense that slowly btc becomes an unchanging thing, hence leading people to trust it more. \n\nBy trust I mean \"I trust that the thing I buy will be the same thing 10 years from now\". Thats what gold people love. That its timeless. \n\nYeah man its horrible for Indians, They might even be taxed 28 percent on every buy and sell. The whole tax system is horrible there. I am remitting money from india to US and that has taken me 6 months so far. In the period I lost about 2.5 percent on the exchange rate itself.\n\nIndia has a lot of things of great cultural and historic value, but it also has some of the worst banks and one of the most overextending government.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8x9smv",
                    "author": "johndoeisback",
                    "score": 3,
                    "created_utc": 1652776496.0,
                    "response": "You said you think Lightning Network is \"shit\". Can you elaborate on that? Also you said that perhaps a new \"Lightning v2\" may rise. What do you think LN v2 will be and what differences with LN v1 it should have to succeed?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8xauih",
                            "author": "Ok_Aerie3546",
                            "score": 3,
                            "created_utc": 1652777470.0,
                            "response": "I never felt the need to use lightning, hence I dont care if lightning dies. And whenever something dies it would be because something else was providing more value to users for that use case. \n\nI said v2 only as a placeholder. I just meant whatever the next advancement that would arise to procide more value. And that might turn up to be shit as well. I couldnt care less.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8xdh0v",
                                    "author": "johndoeisback",
                                    "score": 4,
                                    "created_utc": 1652779885.0,
                                    "response": ">I never felt the need to use lightning\n\nOne thing that most users agree on (maxis and otherwise) is that the BTC base layer is not good for payments, which means you need something else for payments. I think you are the first person who claims they don't feel the need for lightning (which in this case is just a placeholder for something separate from the BTC base layer specifically for payments).",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8xfrfb",
                                            "author": "Ok_Aerie3546",
                                            "score": 3,
                                            "created_utc": 1652781888.0,
                                            "response": "Yes I completely agree. I use credit cards for all my payments. If the scenario comes where it would be in my economic interest to use bch or monero, i would happily use it. I dont discriminate with the forms of payment I use, I will always use the thing that gives me the most economic benefit.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i8xe83l",
                                    "author": "undadatunda",
                                    "score": 3,
                                    "created_utc": 1652780560.0,
                                    "response": "vast majority of people in the world are poor..so if a bitcoin maxi is not looking out for them(the poor) then what coin will serve the poor?(the vast majority of the world)",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8xgqxt",
                                            "author": "Ok_Aerie3546",
                                            "score": -1,
                                            "created_utc": 1652782725.0,
                                            "response": "Money doesnt look out for the poor. Why did you think that? People look out for the poor. Humanity, morals and compassion look out for the poor. Money just exists.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8xhwck",
                                                    "author": "undadatunda",
                                                    "score": 4,
                                                    "created_utc": 1652783659.0,
                                                    "response": "well if bitcoin cant serve the poor then its doomed dont you think?\n\ncheck out this vid it explains how the math of how bitcoin is 'supposed' to work and how finite in a expanding world means it should just go up forever..then it would serve the poor..and everyone\n\nhttps://www.youtube.com/watch?v=2pDlaOGA2ac\n\nbut bitcoin is not going up..its more like a plaything for the (fiat)rich and powerful to tame\n\n2017 https://web.archive.org/web/20171107235744/https://www.coindesk.com/cme-groups-leo-melamed-well-tame-bitcoin/\n\n2019 https://www.coindesk.com/markets/2019/10/22/trump-administration-popped-2017-bitcoin-bubble-ex-cftc-chair-says/\n\n2021 https://www.youtube.com/watch?v=W8mpzwCf8SE&list=LL&t=418s\n\n2021 more bitcoin futures go live right at the peak again..tamed\n\nedit: this guy also explains how its done but with gold n nickel starts at about 19:40 in the vid https://www.youtube.com/watch?v=DHY8sWt7EOE",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8xjemp",
                                                            "author": "Ok_Aerie3546",
                                                            "score": 0,
                                                            "created_utc": 1652784820.0,
                                                            "response": "Nope. Tell me a form of money that ever served the poor? Yes I think people are gonna be left out. Just like the poor might never be able to buy miami beach houses. But hopefully theyll have bitcoin cash right? So should be ok I guess. I am really sorry if the quality of my replies is dropping. I really need some sleep. Thank you for the conversation and the links though.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8xkavq",
                                                                    "author": "undadatunda",
                                                                    "score": 4,
                                                                    "created_utc": 1652785473.0,
                                                                    "response": "real gold,real property etc have served the poor for eons\n\nand actually when or if any version of bitcoin ever gets working right (just goes up forever) then no one gets left out,,cuz then bitcoin becomes like a elevator that you just get on and off as you like..so ya digital finite in a expanding world will benefit everyone even the very last person that adopts it will benefit\n\nya lol the brain uses most energy in the body ..gnight im take a break from this too",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8xb6vf",
                    "author": "gnahor",
                    "score": 4,
                    "created_utc": 1652777787.0,
                    "response": "Did you read the Bitcoin whitepaper?\n\nWould you agree that it's about an electronic cash system, suitable for small transactions?\nIf not, why?\n\nDo you believe that BTC resembles what is described in this white paper? Why?\n\nDo you believe that BCH resembles what is described in this white paper? Why?\n\n\nIf someone changed Bitcoin's policies in a way you would not agree.. what's Bitcoin to you then?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8xbw9q",
                            "author": "Ok_Aerie3546",
                            "score": 3,
                            "created_utc": 1652778426.0,
                            "response": "- yes for the whitepaper\n- yes I agree thats what the whitepaper talks about.\n- it does losely resemble in a way that is p2p and a bearer asset like cash.\n- yes bch better resembles whats written in the whitepaper.\n- Bitcoin is what the consensus produces, for good or bad",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8xc3qt",
                                    "author": "gnahor",
                                    "score": 4,
                                    "created_utc": 1652778621.0,
                                    "response": "Oh, interesting... how do you tell what \"consensus produced\" - there will never be 100% consensus, so is it about the majority of 51% - how could one even tell? Reading on social media won't do that for me..",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8xebzh",
                                            "author": "Ok_Aerie3546",
                                            "score": 1,
                                            "created_utc": 1652780658.0,
                                            "response": "Price appreciation post fork. Where people put their money is what would define consensus for me.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8y3cph",
                                                    "author": "gr8ful4",
                                                    "score": 5,
                                                    "created_utc": 1652795982.0,
                                                    "response": "People? Have you ever heard about Tether? How much trust do you put into Tether? Why?\n\nAs someone who invested in Bitcoin 2011, I can tell you that I divested completely from BTC. Bitcoin (BTC) without payment functionality is not a SoV but a ponzi scheme waiting to fall.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8xp0gf",
                    "author": "Br0kenRabbitTV",
                    "score": 4,
                    "created_utc": 1652788569.0,
                    "response": "How do you feel about the masses coming along in 2017 (and again in 2021) due to the price rising, and completely changing the narrative from peer to peer electronic cash, to a store of value and crypto asset, wrecking over half a decade of work that people had put in adding it to webstores, building dice games that need micro-transactions and other similar projects, basically setting back crypto as p2p cash back years, and destroying all the work they had put in, which is what gave it the initial value in the first place? Making them have to start again with other coins/forks etc...\n\n..driving them out of communities they had been in for years.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8xty6b",
                            "author": "Ok_Aerie3546",
                            "score": 1,
                            "created_utc": 1652791377.0,
                            "response": "To be honest, the narrative of peer to peer cash never spoke to me. Alot of my view I just took by relating bitcoin with gold. Having lived around a society of gold bugs, it made a lot of sense to me. Thats why I am here. \n\nI think of gold and bitcoin as like money to be saved and every other crypto as tools to spend money when you need them.\n\nKinda like internet vs vpns.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8xux3t",
                                    "author": "Br0kenRabbitTV",
                                    "score": 5,
                                    "created_utc": 1652791888.0,
                                    "response": "That's what's so annoying to me though TBH. Many of us worked towards the goal of using it as peer to peer cash for over half a decade, and had our worked destroyed when the masses came along, these very same people were the type of people that thought Bitcoin was a scam or anybody that used it was a criminal, but it wasn't so bad at the time, at least they stayed away from the communities back then, but as soon as the price went up, they suddenly forgot all that and became interested in it, thinking it would make them rich. Now these people outnumber us massively and just decided Bitcoin was not peer to peer cash as they have the loudest voice, and it spiralled into this shit-fest of a casino and ponzi like scheme that is the majority of the crypto space today. While at the same time shitting on any project they are not \"invested\" in, and making peer to peer cash people's lives and jobs even harder and worse.\n\nIt wasn't enough for them they destroyed our work and original goals, they want to shit on our new projects as well, and assume everybody is the same as them, caring about price only.\n\nWe were given one of the most disruptive technologies/currencies in history..\n\n..yet all 95% of people care about is how much $£$ the next person will buy it from them for.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8xvpnt",
                                            "author": "Ok_Aerie3546",
                                            "score": 1,
                                            "created_utc": 1652792307.0,
                                            "response": "I can understand why you feel so annoyed. There is no good answer to that feeling. Im sorry for what happened to you and your community.\n\nIn a very loose sense of defense, price is the only thing that would matter for a store of value. And \"Number go up\" is by far the best free marketting for a sov.\n\nI am not trying to pick any fights, just thought those two points needed to be said. Appreciate you voicing your concerns.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8xwjlk",
                                                    "author": "Br0kenRabbitTV",
                                                    "score": 6,
                                                    "created_utc": 1652792726.0,
                                                    "response": ">I am not trying to pick any fights, just thought those two points needed to be said. Appreciate you voicing your concerns.\n\nYes I can see that, but most people are not like this in the crypto space, they are very toxic and narrow minded, with no rational thought at all, basically just gamblers.\n\nFor all your sakes I hope the price of Bitcoin does keep going up, and my own TBH as I still have some and cashing out each bull run feels like the only compensation for what happened and I enjoy taking these people's money to make myself feel better.\n\nIf it ever implodes though and becomes almost worthless, all our work, and then all the work, hope and dreams of the people who came after us in 2017 will be ruined for absolutely nothing at all, and crypto will go back to being called a scam once again.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8y2gx2",
                    "author": "Jankylad",
                    "score": 4,
                    "created_utc": 1652795578.0,
                    "response": "I'm not into btc or bch but I'm interested in your views as a btc maxi. You only believe in btc for store of value and not any l2 solutions or buzzwords, correct?\n\n-Why do you think it's a store of value when the market is so manipulated? CEXs, stablecoins like Tether and bad actors drain liquidity and manipulate the price. How are you so sure it will continue growing? Past success is not an indicator of future growth.\n\n-Even if it succeeds and keeps growing. Why is it a good store of value with its 1mb limitation? Say you have an emergency and need access to cash. Btc blockchain is limited to 400k transactions a day so what if you can't get your money out in time because of transaction speed? \n\n-Since (I assume) you live in India. What if your or other sizable populations adopt bitcoin as a store of value? It would take decades for everyone to do one transaction to own or sell. What if you want to keep saving money in btc and want to keep doing deposits every month? Only about 20m are limited to doing that and you would spend 100+ dollars/market prices (insane) transaction costs for every attempt at \"storing your value\" in btc. Do you think that's a good way to store value for most people?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8x7c14",
                    "author": "user4morethan2mins",
                    "score": 8,
                    "created_utc": 1652774211.0,
                    "response": "You use the word 'believe' a lot. If something is going to facilitate the exchange of goods and services, then it does that, no believing required.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8xq20a",
                            "author": "Br0kenRabbitTV",
                            "score": 5,
                            "created_utc": 1652789195.0,
                            "response": "People use the word \"believe\" only about things they do not know as fact.\n\nAlmost like saying \"I think this is the case but I'm not actually sure\".",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8x8046",
                            "author": "Ok_Aerie3546",
                            "score": 3,
                            "created_utc": 1652774819.0,
                            "response": "Yes. Dollars (cash, credit, apple pay, stripe) facilitate the exchange of goods and services. No belief there. They just do.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8xcfsk",
                                    "author": "LovelyDayHere",
                                    "score": 8,
                                    "created_utc": 1652778933.0,
                                    "response": "> They just do.\n\nTo varying degrees.\n\nGenerally, the more they are like 'cash', the better they do this.\n\nGive you an example:\n\nThere are many kinds of goods or services which you cannot use a credit card to pay for, as the payment processor will just block your payment and you will perhaps be put on a hidden black list for further investigation by authorities.\n\nFiat cash is less affected by this problem than fiat \"digital money\" (essentially all forms of credit at some financial institution).\n\nNot to mention that most the above only work well in certain geographical locations. Credit cards and other modes of payment continually struggle to overcome this, and they do okay for now. But look what happens as soon as countries are at loggerheads. Or even if a person becomes designated as a political dissident in their own country. Just recently in Canada a whole lot of people where cut off from banking.\n\nThis is where decentralized [p2p electronic cash](https://bitcoin.com/bitcoin.pdf) shows its superiority.\n\nAnd to do it, it needs to have very low fees too.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8xe4qa",
                                            "author": "Ok_Aerie3546",
                                            "score": 2,
                                            "created_utc": 1652780476.0,
                                            "response": "My day to day life does not require purchasing those kinds of goods that you are referring to. When the time comes for me to buy something that needs bitcoin cash or monero, I will gladly use those currencies fir those purposes. \n\nI will always use the cheapest form of payment for all my payments. If its bch, i will use that. But as it currently stands its not, hence I use dollar debt or dollars.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8wx9lb",
                    "author": "CleanUrLobster85",
                    "score": 6,
                    "created_utc": 1652765852.0,
                    "response": "Why do you think the lightening network is a better solution than raising blocksize ?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8x1htn",
                            "author": "Ok_Aerie3546",
                            "score": 7,
                            "created_utc": 1652769134.0,
                            "response": "My answer might surprise you. I dont think lightning is the best solution. I am only a bitcoin maxi after all, not a lightning maxi.\n\nDuring the blocksize wars, there were basically two schools of thought:\n- One group of users wanted to change the properties of bitcoin to make it easier for transactions.\n- One group of users wanted bitcoin to be the same (atleast the economics of it) and wanted products (even if they were centralized) to be created to fulfill every use case people would need from bitcoin.\n\nNow I completely agree to second group. Throughout human civilations we have always found the best form of money and then we changed our lives in order to keep using them as money. Never did we think of changing the money itself.\n\nIll give an example. In India, Jewelry is an enhancement we do to our money (gold) just so we are able to:\n- recognize our money from other peoples money.\n- show our money to other people, in vain, but yeah. It is what it is. People have an urge to be shallow.\n- to attach emotional significance to the money such that it makes it less likely that we would spend the gold. I still have most of the jewelry since my grandmothers time and I would not sell it unless its a life and death situation. \n- a husband would gift jewelry to his wife. Thus increasing its value in the wife's mind, increasing its chances to not be spent.\n- we also associated gods to gold, all to add a religious layer as to why not to spend it.\n\nWe never tried to change the gold itself to something else, say maybe because gold would lose its shine or when gold stopped becoming a valid form of payment. We have always built our lives around the imperfections of gold and that made us closer to perfect.\n\nOk so why not change blocksize. It changes the economics of the money and the mining. Gives a message that we can change it again if we want, this increases the difficulty for miners to plan around it and hence drives them away. It kind of became a hit on the security.\n\nWhats a use case without security in the underlying asset tending towards infinity? \n\nMy stance is if lightning is shit, it will die, but bitcoin wont. And a new lightning v2 or whatever would rise with a better idea of how to do payments.\n\nBut if the security of bitcoin cash ever gets compromised, there will never be any further advancements and bitcoin cash itself would die.\n\nThere might be more points, but I have written a long enough messages. I will get back to your follow up.\n\nThank you",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8x5l5j",
                                    "author": "Greamee",
                                    "score": 11,
                                    "created_utc": 1652772636.0,
                                    "response": ">One group of users wanted bitcoin to be the same (atleast the economics of it) and wanted products (even if they were centralized) to be created to fulfill every use case people would need from bitcoin.\n\nKeeping the blocksize limit doesn't mean the *economics* are the same at all. There isn't any evidence Satoshi added the blocksize limit in 2010 for any economic reason actually.\n\nBitcoin with non full blocks behaves radically differently from Bitcoin with full blocks.\n\nYou could argue that *technically* nothing changed (as opposed to economically). But even that I'd contest because in a growing system, if you have hard coded limits, once those limits are hit you're actually changing the system. Doesn't matter if the limit was technically there before because it had no impact on the system.\n\nCase in point: the blocksize limit of 1MB had no (economic) effect on Bitcoin in, say, 2011. If you were a miner/node at that point and ran a node without the limit, you'd just stay in-sync with the rest of the network.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8x7ccf",
                                            "author": "Ok_Aerie3546",
                                            "score": 5,
                                            "created_utc": 1652774220.0,
                                            "response": "Good points. I will read up more about this. Thank you.\n\nAny reason why we are seeing bitcoin cash's hash rate drop or not increase sustainably since inception? \n\nAnd can you outline the scenario in which way bch starts gaining market share and bitcoin starts losing it to bch. Where do other crypto currencies rank during this event?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8x8ouy",
                                                    "author": "LovelyDayHere",
                                                    "score": 11,
                                                    "created_utc": 1652775470.0,
                                                    "response": "> Any reason why we are seeing bitcoin cash's hash rate drop or not increase sustainably since inception? \n\nHashrate is simply a function of the relative profiitabilty of mining the coin, which correlates with relative price, on average.\n\nIf the price of Bitcoin Cash goes up, so does its hashrate.\n\nActually, if you read what the outside world is saying about BTC, it is that its hashrate has _increased_ unsustainably (because it is consuming vast amounts of power for very little use).\n\n> And can you outline the scenario in which way bch starts gaining market share and bitcoin starts losing it to bch.\n\nThere are several, but here is one near-term plausible one:\n\nA major stablecoin collapses (e.g. USDT).\n\nA lot of BTC is sold  in an attempt to stabilize the market (or even to try to profit on the situation via shorting).\n\nPublic confidence in BTC goes down, many people try to sell, but since capacity is limited to something like < 14 transactions per second, a huge queue forms and median fees on BTC rise, first to $5, then $10, then $20, $50, $100 (per transaction!)\n\nLots of people are now prevented from selling BTC at all.\n\nLots of people have transactions stuck in the memory pool, transactions which have been outbid by others and which may never confirm, or take days or weeks to confirm. By that time who knows what the price of BTC could be.\n\nExcept for the stablecoin collapse part, this already happened once - in 2017.\n\nBut it's no longer 2017.\n\nMeanwhile, Bitcoin Cash works just fine, as it has sufficient capacity to absorb such shocks and others, like drastic hashrate changes which can occur when miners go out of business due to big price changes, or regulatory interference etc.\n\n> Where do other crypto currencies rank during this event?\n\nThe ones that work as proper cryptocurrencies will likely rise over time.\n\nOf course, a loss of confidence in BTC would shake the whole market. But we are here for the long term prospects of peer to peer electronic cash, not short term speculation.\n\nThe fundamentals of real cryptocurrency remain as attractive in 2022 as they were in 2008.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8x978e",
                                                            "author": "Ok_Aerie3546",
                                                            "score": 3,
                                                            "created_utc": 1652775938.0,
                                                            "response": "And wouldnt you want a higher hashrate for the crypto you use? Are there any benefits for having a lower hashrate supporting the network?",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i8x7579",
                                            "author": "wtfCraigwtf",
                                            "score": 8,
                                            "created_utc": 1652774036.0,
                                            "response": "Not to mention Segwit added 6000 lines of sh!tc0de, weakened BTC's verification protocol, and totally changed the BTC protocol in fundamental ways. Wallets, exchanges, and utility software all had to be rewritten to support Segwit. Heck , even the BTC CORE WALLET didn't support making Segwit transactions for the first few releases!\n\nSo much for the \"users who wanted Bitcoin to remain the same\"...",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8x8ov4",
                                                    "author": "Ok_Aerie3546",
                                                    "score": 2,
                                                    "created_utc": 1652775470.0,
                                                    "response": "Was it still backwards compatible after segwit?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8x99r4",
                                                            "author": "wtfCraigwtf",
                                                            "score": 9,
                                                            "created_utc": 1652776006.0,
                                                            "response": "Old nodes can't understand Segwit and process transactions as \"anyone can spend\". The old nodes won't crash outright, but not understanding the Segwit transactions is a security vulnerability, and they're not validating up to half of transactions. This was a nasty hack and there were MANY bugs in Segwit, one of which eventually led to the most catastrophic inflation bug of them all! \n\nEffectively node operators were coerced into upgrading after miners accepted the Segwit fork. Read up on the New York Agreement if you'd like to know how miners were lied to and bullied into accepting Segwit.\n\nSegwit Bitcoin is a radical change from Satoshi's code. And it hardly has any more capacity!",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i8x5bgu",
                                    "author": "LovelyDayHere",
                                    "score": 9,
                                    "created_utc": 1652772395.0,
                                    "response": "Thanks for this. I feel it needs the other side of the story, the \"payments maximalist\" side :)\n\n> During the blocksize wars, there were basically two schools of thought: - One group of users wanted to change the properties of bitcoin to make it easier for transactions. - One group of users wanted bitcoin to be the same (atleast the economics of it) and wanted products (even if they were centralized) to be created to fulfill every use case people would need from bitcoin.\n\nIn its early history, the economics of the coin were such that transactions were low-fee. This stimulated a lot of adoption and led to Bitcoin being considered as a new form of money. (\"Internet money\")\n\nThe limit of 1MB was introduced to fight a spam wave, but before that, Bitcoin was not limited to 1MB. It's limit was closer to 32MB, blocks being restricted by the maximum size accepted for network messages.\n\nThis limiting to 1MB (for spam reasons) was in fact to turn out to be a big change to the economics, creating a possibility of very high fees. But Satoshi didn't want that to be a persistent state of the network - which is why he suggested on how to remove the 1MB limit later on.\n\nBefore 2017, many people warned about the change of economics that was being pushed on BTC through keeping the limit. Even Core developers warned about it (Jeff Garzik clearly described this change of economics on the dev mailing list).\n\nThe group of users who wanted to _keep_ it easy for transactions (as had been before, when BTC was growing successfully in adoption) didn't want to change the fundamental economics of the coin. They wanted to keep them, because low fees X lots of transactions is how the system was envisaged in the first place.\n\n> One group of users wanted bitcoin to be the same (atleast the economics of it) and wanted products (even if they were centralized) to be created to fulfill every use case people would need from bitcoin.\n\nThe group of people who wanted the economics to stay the same can't really be said to be the people who pushed for high fees and a split of the functionality of the network into distinct settlement + payment networks. Or centralized services (banks in effect). Obviously those change the economics substantially.\n\nBut this is the crux of the debate, and the reason for Bitcoin Cash forking to preserve what we see as the proven successful economic model that got Bitcoin to be valued.\n\n> Ok so why not change blocksize. It changes the economics of the money and the mining.\n\nIncreasing the blocksize means miners could earn more money by processing more transactions. That's the original design. And the plan was to increase the number of transactions while keeping low fees. That means increase the block size or somehow make more block space available, to keep up with demand.\n\nFor miners it is not a problem to keep up technologically because they actually earn money from this.\n\nHashing also doesn't become more difficult when the blocksize increases (this is a common fallacy).\n\n> Gives a message that we can change it again if we want, this increases the difficulty for miners to plan around it and hence drives them away. It kind of became a hit on the security.\n\nCapacity planning and budgeting for increases is a part of any industry, miners became professional and they can easily plan for upgrades, especially if they have a long time to plan ahead which they do.\n\n> if the security of bitcoin cash ever gets compromised, there will never be any further advancements and bitcoin cash itself would die.\n\nThere is no reason to suspect the security of bitcoin cash would get compromised. But even if, the example of the real world shows coins being compromised all the time and recovering. This is just an indication that the crypto market is almost entirely speculative at this point. Otherwise coins which are running for years without being compromised, like Bitcoin Cash, would be better understood.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8x8rx8",
                                            "author": "Ok_Aerie3546",
                                            "score": 6,
                                            "created_utc": 1652775549.0,
                                            "response": "I will read up more about this. Thank you for taking the time to explain and not passing a rude comment.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8x9mjd",
                                                    "author": "LovelyDayHere",
                                                    "score": 6,
                                                    "created_utc": 1652776340.0,
                                                    "response": "You are welcome. Thanks also for stimulating a civil discussion about the views.\n\n\"Maximalism\" indeed has various flavors.\n\nThere are some maximalists who call themselves that simply because they believe that in the end, better money will win out and consolidate around one coin.\n\nI consider that viewpoint to be fairly close to what many Bitcoiners thought in the early days.\n\nEven if I don't think nowadays it will happen like that, because of ... people. For many reasons, including curiosity, stubbornness, and a constant need to improve driven by real world events, I think there will always be multiple systems of money competing. Even physical forms have their use cases that Bitcoin doesn't cover.\n\nI am happy that Bitcoin seeded that space, and I think the basic design of Bitcoin is still in an excellent position to keep a lead on its competition in that space.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8xacd9",
                                                            "author": "Ok_Aerie3546",
                                                            "score": 5,
                                                            "created_utc": 1652777007.0,
                                                            "response": "Yes as for me if bitcoin cash or monero ever felt like the better money to spend, I would budget in that way. \n\nBut right now as it stands, I feel credit cards provide me the most incentive to use for spending, so I stick with them. Maybe in the future things might change for me.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i8xft4v",
                                    "author": "jessquit",
                                    "score": 8,
                                    "created_utc": 1652781924.0,
                                    "response": "\n>- One group of users wanted to change the properties of bitcoin to make it easier for transactions.\n\nI want to jump right in here and politely disagree in the strongest way possible.\n\n\"Bitcoin's property\" - the thing that made it uniquely valuable in the first place, and the reason early adopters got involved - was that for the first time in history it was possible to transact electronically directly from A to B with no financial intermediary to facilitate the transaction.\n\nSo one group of users wanted to **maintain** Bitcoin's properties as a [Peer-to-peer Electronic Cash System](https://bitcoin.com/bitcoin.pdf) by performing a [simple hard fork upgrade that had been promised to them by Bitcoin's creator himself](https://satoshi.nakamotoinstitute.org/posts/bitcointalk/485/).\n\nThe other group *changed* Bitcoin into a low-volume, high fees settlement layer for a system based on intermediaries (Lightning). In short, 180° from its original purpose and value proposition.\n\n I don't see how someone can argue in good faith that between BTC and BCH, it's BTC which still works most like Bitcoin did from 2009-2016",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8xid4u",
                                            "author": "Ok_Aerie3546",
                                            "score": 2,
                                            "created_utc": 1652784026.0,
                                            "response": "I am on your side. BCH does behave more like bitcoin in the whitepaper than BTC. I just think that having a better store of value is more important than have a p2p cash. Even if it is against Satoshi's plan.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8xoomq",
                                                    "author": "jessquit",
                                                    "score": 6,
                                                    "created_utc": 1652788366.0,
                                                    "response": "I feel like we just went in a circle. Why is it that a smaller block size makes BTC a better store of value? Earlier I thought your argument was that it was because the \"store of value\" didn't change whereas the \"payment\" coin changed. But if you agree that's not really the case, then....",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8xumde",
                                                            "author": "Ok_Aerie3546",
                                                            "score": 1,
                                                            "created_utc": 1652791735.0,
                                                            "response": "Oh I meant that its parameters didnt change. Am I right about that?\n\nA person in the market for a store of value wants to buy something that he can say with high certainty will be the exact same thing after 10 years. Like if you went into a coma and woke up, you want it to be the same exact thing you bought along with its flaws.\n\nSay a guy bought some gold and he went into a coma and when we woke up, the gold was lighter. Sure its easy to carry around, be wont like that it changed at all. He bought the flaws along with the gold and wanted it to just stay like that. This is my thinking. But I might be just too tired and sleepy. So maybe we'll continue this some other day. Thank you for the conversation.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8y05i9",
                                                                    "author": "capistor",
                                                                    "score": 4,
                                                                    "created_utc": 1652794504.0,
                                                                    "response": "A lot of people in this sub bought with no block size in the code at all. Putting any block limit was extremely controversial.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i8xzzfb",
                                                    "author": "capistor",
                                                    "score": 5,
                                                    "created_utc": 1652794423.0,
                                                    "response": "Why does making it more difficult and more expensive to use, and making it so that banks can more easily control payment routing - why do those properties make btc a better store of value?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8y776v",
                                                            "author": "Ok_Aerie3546",
                                                            "score": 1,
                                                            "created_utc": 1652797666.0,
                                                            "response": "Because as long as bitcoin will be able to sold for fiat, its not really difficult to \"spend bitcoin\". Rather its easier for tax purposes. Coz you get taxed on cap gains either way. Might as well sell it on an exchange and get a proper 1099 than keeping track of the prices you spent the bitcoin at.\n\nAlso as long as credit cards exist, there is an economic incentive to use debt on a dying currency for payments. \n\nHence as long as bitcoin has enough global liquidity, its store of value use case stays intact, even without many ways to spend it directly.\n\nAt least I would use all the tools available to me, to make the best transaction that makes the most economic sense to me.\n\nAlso similar to how gold doesnt get accepted anywhere as payment but it doesnt hurt its store of value proposition.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i8xzl6r",
                                    "author": "capistor",
                                    "score": 5,
                                    "created_utc": 1652794229.0,
                                    "response": "Raising the block size was always a planned move by satoshi and Gavin.  It was just such a low priority item that Gavin never got around to do it. \n\nIt was not a change to bitcoin, it was following the original dev road map to update the block size as the network grew.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8x7h4n",
                    "author": "-ism-isa-con",
                    "score": 7,
                    "created_utc": 1652774347.0,
                    "response": "If BTC maximalists are really so interested in bitcoin, why do they depend as much as they do on US dollars and other fiat currencies?  Do you think they understand the implications of war for the fiat currencies involved in it?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8x8bkb",
                            "author": "Ok_Aerie3546",
                            "score": 4,
                            "created_utc": 1652775121.0,
                            "response": "I cant talk for the whole group but Ill talk for myself. Me being a rational economic actor, I use the currency that gives me the most economic benefit for the required purpose.\n\nI save in bitcoin as its gives me the most economic benefit while saving.\n\nAnd I use debt in dollars in the form of loans and credit cards to spend. Debt in a depreciating currency is by far the best way to spend.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8xnxcg",
                    "author": "the_letter_mu",
                    "score": 2,
                    "created_utc": 1652787890.0,
                    "response": "Due to the blocksize war, the Bitcoin community splits. It was a long battle, and a harsh time back then (even prior to the BCH fork). As much as the BCH community trying to adhere to the original Bitcoin vision, big-blockers (such as myself) have to swallow the fact that at this moment, we are the minority chain. \n\nMy question to you; what we could’ve done better? And what can we do better going forward?\n\n(Thank you for your willingness to engage the r/btc community with such politeness... we don’t get that often)",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8xpom9",
                            "author": "Ok_Aerie3546",
                            "score": 2,
                            "created_utc": 1652788978.0,
                            "response": "Nothing. I think you guys are on the right path. If you truly believe p2p cash is what the world needs, stick to those ideals and own it as it is. No need to fight will people on r/Bitcoin about it. \n\nIf someone asks about you guys, tell them that Bitcoin fees were too high and we beleive that Bitcoin should have lower fees to allow for financial inclusion. \n\nI like that about the monero guys, they rarely get into shitposts about bitcoin. They know they have a unique use case and they feel it is the most important. So they stick with it.\n\nArent we all doing that. Furthering the form of money we feel is most important for the world. At some point people which choose based on their use case, and one of us will see the future we imagined. \n\nWe arent enemies, we are just competitors. But at the end we are just fellow humans. Lower the salt, better the future.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8zaccr",
                    "author": "TooDenseForXray",
                    "score": 2,
                    "created_utc": 1652813686.0,
                    "response": "\\>Maybe we both learn something new from it.\n\nYears of exhausting debating with most of it in bad faith, censorship, bans, attacks, insults.. I doubt there is much left to learn",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8zbjhn",
                            "author": "Ok_Aerie3546",
                            "score": 3,
                            "created_utc": 1652814178.0,
                            "response": "I tried my best to debate in good faith. I believe people here overall liked my approach. Sorry for the exhaustion that you may have gone through. Have a nice day.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8x9c1g",
                    "author": "Remora_101",
                    "score": 3,
                    "created_utc": 1652776066.0,
                    "response": "Why do you have so many shitty thought leaders, that you worship?\n\n\nhttps://old.reddit.com/r/btc/comments/lh1p5f/bitcoin_core_developers_own_words/\n\nhttps://twitter.com/BitcoinUnlimit/status/1435951302018752514\n\nhttps://www.reddit.com/r/btc/comments/oz8umd/btc_maxi_poster_boy_michael_saylor_wants/",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8x9qvg",
                            "author": "Ok_Aerie3546",
                            "score": 2,
                            "created_utc": 1652776451.0,
                            "response": "I only worship the gods of my religion, hinduism. I know there are too many of them. But I still try to keep up with all of them. \n\nIdea of using credit cards, came to my mind on its own. I was using credit cards before and I kept using them afterwards. Did not have to follow anyone to figure out that its economical to do so.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8xnxc2",
                    "author": "gingeropolous",
                    "score": 1,
                    "created_utc": 1652787890.0,
                    "response": "Why do you think Bitcoin can be money when it's not fungible? \n\nSomeone could refuse your Bitcoin if they deem it to be tainted. How can that be money?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8xokx9",
                            "author": "Ok_Aerie3546",
                            "score": 1,
                            "created_utc": 1652788301.0,
                            "response": "We have monero for that, right? Money never will be fungible because people are not fungible and someone could refuse me from buying goods and services, no matter what I use to pay. What then? So lets rather fight against censorship of people than just forms of money.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8xp2a6",
                                    "author": "gingeropolous",
                                    "score": 3,
                                    "created_utc": 1652788601.0,
                                    "response": "Wat? Well that's a new twist on things.\n\nBut yes, let's fight against censorship of people by making it impossible for people to discriminate you based on where your money came from.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8xr29d",
                                            "author": "Ok_Aerie3546",
                                            "score": 1,
                                            "created_utc": 1652789783.0,
                                            "response": "Yep if I am being discriminated based on where my money is coming from, ill surely use monero. Btc monero swaps are a thing right? Hopefully.\n\nI just think in kyc land monero takes a big hit on accessibility, limiting its marketcap and hence the total value of transactions that can be done using the monero network.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8xx156",
                                                    "author": "gingeropolous",
                                                    "score": 2,
                                                    "created_utc": 1652792971.0,
                                                    "response": "Btc swaps are a thing as long as there are people willing to trade actual fungible money for traceable asset tokens.\n\nFor the life of me I can't figure out how long ppl will sell their monero for an inferior form of money.\n\nYou can get monero in kyc land. Plenty of exchanges carry it.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8xcg84",
                    "author": "trakums",
                    "score": 1,
                    "created_utc": 1652778944.0,
                    "response": "Why do you think that side-chains and second layer solutions are better than single layer solution with gigabyte blocks?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8xei0p",
                            "author": "Ok_Aerie3546",
                            "score": 1,
                            "created_utc": 1652780809.0,
                            "response": "Coz side chains dont destroy the underlying asset if they mess up. So there is more room for innovation. While letting the main asset just exist. I have only used the main network. I dont feel the need to use any sidechains or l2s.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8xf4d8",
                                    "author": "undadatunda",
                                    "score": 1,
                                    "created_utc": 1652781344.0,
                                    "response": "i dont think you get any forks if you in a sidechain or lightning\n\nhttps://old.reddit.com/r/TheLightningNetwork/comments/ucn72i/if_your_bitcoin_is_in_lightning_form_can_you/",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8xgzru",
                                            "author": "Ok_Aerie3546",
                                            "score": 1,
                                            "created_utc": 1652782924.0,
                                            "response": "I am not in any. Why?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8xhbgu",
                                                    "author": "undadatunda",
                                                    "score": 1,
                                                    "created_utc": 1652783192.0,
                                                    "response": "well if bitcoin is worldly then its likely that someone sometime somewhere will fork bitcoin into something much greater than it is today and you would miss out if your in a sidechain or in lightning\n\nso ya just getting that point in is all",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8xiy6c",
                                                            "author": "Ok_Aerie3546",
                                                            "score": 1,
                                                            "created_utc": 1652784477.0,
                                                            "response": "Ok ill watch out. Thank you.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i91tx6w",
                                    "author": "trakums",
                                    "score": 1,
                                    "created_utc": 1652861879.0,
                                    "response": "You need to use side-chains or l2s or increase the block size just to compete with credit cards. Gigabyte blocks also don't destroy the underlying asset.  \nI will change my question:  \nDo you think that side-chains and second layer solutions are better than single layer solution with gigabyte blocks?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i92hmpa",
                                            "author": "Ok_Aerie3546",
                                            "score": 0,
                                            "created_utc": 1652879105.0,
                                            "response": "I think credit cards are better than any crypto. Coz its debt and not instant payment.  Yes i do think side and l2s are the way to go.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i93ssgb",
                                                    "author": "trakums",
                                                    "score": 1,
                                                    "created_utc": 1652898912.0,
                                                    "response": "Nice to meet another maxi.  \nI think the future is behind miltiple decentralized interoperable side-chains.  \nMaybe one of those side chains will be will be BCH or something better than BCH.  \nYou can not prevent or stop decentralized side-chains.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8xdbii",
                    "author": "undadatunda",
                    "score": 1,
                    "created_utc": 1652779744.0,
                    "response": "take note there bitcoin maxi? of all of the paper bitcoin i.o.u's being pushed in the r bitcoin sub and at the same time they ban people for trying to find solutions to that problem(heavy censorship)-counter to what bitcoin is all about\n\nyour not a bitcoin maxi if you let that slide..proof of reserves and verification are instant and old satoshi has been doing 24/7/365 proof of reserves for like 13 yrs now so theres no excuses\n\nyou could do proof of reserves easy peazy..just show your public address\n\nbut yet none of the bitcoin custodians are doing proof of reserves and the r bitcoin sub has like 10,000 times the bitcoin 'paper' pushing posts compared to proof of reserves posts...but why?? paper bitcoin is worse than a premined shitcoin..paper bitcoin is trust..the opposite of what bitcoin is 'trustless'\n\neventually you realize that the i.o.u's cant be stopped..and actually trying to stop them just makes the ones that hold the i.o.u's richer and richer(thats why the interest % is now lower for lending bitcoin is cuz soo many are doing it..but if less do it than the ones that still do it get higher interest% ..so its unstoppable)\n\n...unless you can make the incentives to hold real bitcoin greater than that of the i.o.u's\n\nso thats where forking comes into the picture cuz its the only way to make the incentives greater than the i.o.u's\n\nright now the premining shitcoiners are premining for the ideas..but those ideas can also be done from forks of bitcoin\n\nbut you will get banned in the bitcoin sub when you get to that level and then start talking about it in the r bitcoin sub cuz obviously the mods there have been sucked into the paper bitcoin i.o.u's world..or they are just dumb and traiters to 'trustless bitcoin' lol\n\nso are you a maxi or are you just echoing what other much greaters have already said? ..twistedly for the paper bitcoin pushers",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8xhjdz",
                    "author": "Such_Lawfulness785",
                    "score": 1,
                    "created_utc": 1652783373.0,
                    "response": " the us in 2017, still a student, still really low income. Thats when I heard my friend talking about how its price had gone up. I asked him what it was and what do you do with it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8xtwg1",
                    "author": "Leithm",
                    "score": 1,
                    "created_utc": 1652791352.0,
                    "response": "We don't care what you think, and don't need you to teach us anything, we know what bitcoin is.  \n\nJust stop telling us what we can and cannot call Bitcoin.\n\nYou can call it whatever you like.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8xv5j6",
                    "author": "symmetric69",
                    "score": 1,
                    "created_utc": 1652792011.0,
                    "response": "Given that the \"argument\" for small blocks is the centralization due to block propagation delay, but considering this argument is asinine in the face of orders of magnitude faster consumer grade connections under the same TCP/IP MTU package size, which would render the delay of one order of magnitude bigger blocks going as fast as 1 MB blocks did 10 years ago, how do you square this circle?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8y3kb2",
                    "author": "gr8ful4",
                    "score": 1,
                    "created_utc": 1652796075.0,
                    "response": "What is your Bitcoin address? And if you don't want to share it with us - why not?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8z5zag",
                    "author": "jaimewarlock",
                    "score": 1,
                    "created_utc": 1652811904.0,
                    "response": "When I bought a house overseas, Bitcoin (BTC) failed. I had to use Bitcoin Cash (BCH). Here is my original post: \n\n[https://www.reddit.com/r/btc/comments/tzo0ei/rescued\\_by\\_bitcoin\\_cash/](https://www.reddit.com/r/btc/comments/tzo0ei/rescued_by_bitcoin_cash/)\n\nHow would you have bought a house using Bitcoin if nobody locally accepted it and there was no way to move from an exchange to your bank account?\n\nHow often have you used Bitcoin (BTC) to make medium-large transactions? A hundred times? A thousand? And if so, how fast did they confirm?\n\nI have done thousands of BTC transaction before the end of 2017 and thousands of BCH transactions since. How did you deal with the high fees near the end of 2017?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8zauw4",
                            "author": "Ok_Aerie3546",
                            "score": 1,
                            "created_utc": 1652813898.0,
                            "response": "See.\n\nI will always use the tool that makes the most sense to me in that moment. I will never tell anyone to use btc for every single transaction in their life. Heck I dont do that myself. I pay for everything with my credit card, do bank transfer with zelle, cashapp, apple pay, venmo. I use ach for deposits. Its usually the person whom I am paying, I ask him what hes comfortable with and then I use that.\n\nI even use random shitcoins like Nano or something, the zero fee ones, to transfer between exchanges. Payments are a commoditized market and Ill naturally use the method that is the cheapest, and sometimes the fastest based on the situation.\n\nIf I was in your situation, I wouldve done the same thing that you did. I am pretty financially rational. You seemed to have no other option in your situation, so you picked the only method that was working. I would do the same.\n\nI am currently remitting an ultra large amount from india to US. Why did I not choose crypto to do this.\n\nIndian tax policy on crypto\nThe 28 per cent GST will be in addition to the 30 per cent income tax on earnings from crypto asset transactions. There is also 1 per cent TDS (tax deducted at source) on transactions in such asset classes above a certain threshold. Gifts in crypto and digital assets are also taxed.\n\nThe tax headache did not make financial sense and I did not want to be seen skirting regulations with such a large amount. So im doing the regular remittance method, Its been six months, I filled 10 forms and still I feel this method makes more sense than using crypto in India. I really dont want to be caught in any legal trouble due to the size of my transaction. And on top of that it might not even be cheaper with 28 percent gst and 1 percent tds. \n\nSo my point being whenever a situation comes where I need to make a payment, I see all my options, weigh my risk rewards, and make a decision about what payment mode I want to use. There will never be a one size fits all. \n\nMy bitcoin maxi position is that I use btc as a savings instrument as I feel it will work the best for that purpose. I dont spend it (coz then its not savings, its just bad budgetting). And for every payment, im agnostic and use the thing that makes the most sense from an options (is it my only option), economic (is it my cheapest options), fastest, and the most convinient for both parties involved (if my brother needs 100 dollars, I am not gonna force him to take it in any crypto).\n\nI hope this clears my stance.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i90rl7z",
                    "author": "rshap1",
                    "score": 1,
                    "created_utc": 1652837367.0,
                    "response": "Thanks for the great conversation! Good luck out there\nu/chaintip",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i90rmto",
                            "author": "chaintip",
                            "score": 1,
                            "created_utc": 1652837387.0,
                            "response": "***\nu/Ok_Aerie3546 has [claimed](https://www.blockchain.com/bch/tx/1a9c043b05c30e81ecee38bb1add9572b035e6f089a3c8d5d9c49a9f351cb97e) the `0.00048883 BCH` | `~0.09 USD` sent by u/rshap1\nvia [chaintip](http://www.chaintip.org).\n***",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8xfjt7",
                    "author": "Fine-Flatworm3089",
                    "score": -1,
                    "created_utc": 1652781711.0,
                    "response": "Ignore this BTC maxi. Our time has better use.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8xh5zj",
                            "author": "Ok_Aerie3546",
                            "score": 5,
                            "created_utc": 1652783067.0,
                            "response": "I have spent a whole night replying. Havent slept yet. The least you could have done was not be rude. 🥹\n\nThank you for your comment. Have a nice day.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8xe4m1",
                    "author": "AtmosphereSimilar775",
                    "score": 0,
                    "created_utc": 1652780473.0,
                    "response": "bitcoin is on its way to be the purest form of money",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8xgg3k",
                            "author": "Ok_Aerie3546",
                            "score": 3,
                            "created_utc": 1652782471.0,
                            "response": "Are you making fun of me or just agreeing with me?",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8xelj8",
                            "author": "undadatunda",
                            "score": 1,
                            "created_utc": 1652780894.0,
                            "response": "lol maybe after the plebs edit the ledger and teach the cheaters a mighty lesson ))",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}