{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uvu3sh",
            "title": "\"Is Bitcoin bad for the environment?\" - New Bitcoin Out Loud explainer video!",
            "url": "https://www.youtube.com/watch?v=nU5kG_XuO6k",
            "author": "AD1AD",
            "created_utc": 1653288006.0,
            "score": 20,
            "num_comments": 16,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9o2w9c",
                    "author": "Shibinator",
                    "score": 3,
                    "created_utc": 1653302548.0,
                    "response": "Great video, added to https://bitcoincashpodcast.com/faqs/Roadblocks/what-about-the-environment",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9pts5t",
                            "author": "AD1AD",
                            "score": 2,
                            "created_utc": 1653332803.0,
                            "response": "Cool, thanks!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9nxfz6",
                    "author": "rhelwig7",
                    "score": 3,
                    "created_utc": 1653297790.0,
                    "response": "Very well done, but I think it could use a followup of that last point. Comparing the cost of bitcoin mining with all the costs of maintaining the legacy currency systems, including the cost of ATMs, bank branches, etc. Add in the indirect costs such as giving politicians access to easy money and the need to defend national currencies and you can better see the benefits of a decentralized global monetary system.\n\nI think it would be best done as a similar length video focused just on that.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ptnxw",
                            "author": "AD1AD",
                            "score": 1,
                            "created_utc": 1653332752.0,
                            "response": "Yeah that's definitely a whole video unto itself, and to be honest I'm probably not educated enough on where exactly that energy actually goes and what the biggest negatives are.\n\nI knew I needed to at least hint at it in this video, though, to get people thinking. I'll keep that in mind as a potential future video!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9o1urb",
                    "author": "rndltc",
                    "score": 1,
                    "created_utc": 1653301696.0,
                    "response": "If we don’t spend Bitcoin, then what good is it? At the present time is it not simply a risky asset to hold?\n\n More people need to spend it so that it becomes a medium of exchange thereby validating its existence.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9o6rkn",
                    "author": "LovelyDayHere",
                    "score": 1,
                    "created_utc": 1653305398.0,
                    "response": "Strong video and well done! Really like the presentation style.\n\nI agree with rhelwig7 on followup of last point. People are not (and should not) be easily convinced by claims, but they should reflect on the data that backs the claim that Bitcoin can be a net positive.\n\nI like the point you made about Bitcoin's POW being neutral and therefore not skewing the network towards some or other industry.\n\nOne of the points that made me pause is the \"Bitcoin could do 1000x more transactions and still use the same energy\". We know this is true for [a version of Bitcoin that scales on chain](https://bitcoincash.org), but most people might think it's true for BTC ... since they don't know that there are other reasons why BTC can't do so many transactions.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9puvsl",
                            "author": "AD1AD",
                            "score": 1,
                            "created_utc": 1653333280.0,
                            "response": "Thanks!\n\n>One of the points that made me pause is the \"Bitcoin could do 1000x more transactions and still use the same energy\". We know this is true for a version of Bitcoin that scales on chain, but most people might think it's true for BTC ... since they don't know that there are other reasons why BTC can't do so many transactions.\n\nI tried to clarify that in the description since bringing up the scaling debate and BTC vs BCH would have opened a whole new can of worms. I hope that enough people see the video and end up curious enough about transaction throughput to look into it, or at least to check the description. But if not then I'll at least be working on more videos to explain the details of Bitcoin's scalability =)",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9oq7yk",
                    "author": "TinosNitso",
                    "score": 1,
                    "created_utc": 1653315946.0,
                    "response": "If it's bad the environment, the mining reward can be halved. However that could cause excessive growth, causing price **instability**. Hence Satoshi's original plan might be best. (It curtails growth with excessive mining. For the same $ reward, in the long-run price should increase **19% pa**, keeping up with Saylor's \"cost of capital\".)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9or9i9",
                    "author": "Kerrminater",
                    "score": 1,
                    "created_utc": 1653316417.0,
                    "response": "Some arguments against PoW mining that I've gathered lately:\n\n1. There are a lot of miners using cheap energy in areas where wind expansion is currently blocked, so they are using coal that would have potentially never been burned. \n\nSee Miningstore in Grundy County, Iowa, which is seeking expansion even though the moratorium on wind is ongoing.\n\n2. Miners maintain demand for abandoned oil wells which should be plugged to prevent methane leakage. Plugging is costly and the existence of miner demand for the oil mean that these wells will continue to be bought by private industry for potential profit. Otherwise they would be plugged by the government. Private plugging is notoriously slow and they keep buying up the contractors that do the plug process. They are making money by delaying environmental action.\n\nThis is happening in Appalachia as we speak. \n\nThat said, using the abandoned oil wells can be better for the environment if it means there will be less methane leaks. But, if the mining continues indefinitely in these spots instead of being eventually plugged, the oil burn will be worse than the methane leak would have been as far as climate change goes.\n\nBoth of these issues would be could be mitigated if they received political attention from miners. Instead the miners are making ad-hoc decisions based on profitability, like any other business.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9pudxy",
                    "author": "Lucycv",
                    "score": 1,
                    "created_utc": 1653333066.0,
                    "response": "Nevertheless, businesses and investment are the easiest way to make money irrespective of which party makes it to the oval office.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9opscb",
                    "author": "Username_1_3_4",
                    "score": -1,
                    "created_utc": 1653315748.0,
                    "response": "Viral event going on right now, for  btc/eth hodlers, check it out :) [https://x2emusk.org](https://x2emusk.org)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9o8e85",
                    "author": "Artem37011",
                    "score": 0,
                    "created_utc": 1653306481.0,
                    "response": "What is the use if we don’t spend it? \n\nInfact what is the real use of Bitcoin at all if it is not used as money?",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}