{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "upx6ah",
            "title": "Absolutely the entire cryptocurrency sphere is people putting money in a box, and then if you are amongst the first to take out of it you win and if you are the last you lose.",
            "url": "https://www.reddit.com/r/btc/comments/upx6ah/absolutely_the_entire_cryptocurrency_sphere_is/",
            "author": "i_have_chosen_a_name",
            "created_utc": 1652585096.0,
            "score": 21,
            "num_comments": 44,
            "subreddit": "btc",
            "selftext": "It's absolutely disgusting. We were suppose to build something better then traditional financing and instead we made something a million times worse. \n\nI was hoping that somebody would join BCH that would have a plan on how to kickstart adoption, but that has not happened either.\n\nimho it's extremely likely that the entire cryptocurrency system dies and stays dead for a decade before somebody  starts a completely new cryptocurrency and this one actually becomes money. \n\nThat would mean all of us are to early, and we are not going to make it. And when the dust settles, all we have done is added a handful of the 99.9% to the 0.1%",
            "stickied": false,
            "comments": [
                {
                    "id": "i8of9po",
                    "author": "iguanarchist",
                    "score": 10,
                    "created_utc": 1652607320.0,
                    "response": "Years ago, I disengaged with crypto over somewhat similar feelings over the blocksize war. When I came back, I couldn't believe what I was seeing in DeFi. You could take your tokens and put them to use. All these services, once a hopeful promise for Bitcoiners, were now actually happening in Ethereum. I tried them out, and they were fantastic. Best of all, version two or three of these services were being released with major improvements. The ecosystem was alive with innovation. Then I looked at BTC and saw the sterile environment it had become.  \n\n\nBCH is still promising and still has a purpose. Blockstream's resistance to innovation is going to hurt BTC bad and put them in a position of catch-up or die. BCH has a major headstart on that.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ocylf",
                    "author": "Remora_101",
                    "score": 11,
                    "created_utc": 1652605330.0,
                    "response": "Nah, it's not so bad. Yes most cryptos are massive scams or just get rich quick schemes. BUT this is still a tiny fraction of people.\n\n\nBCH works. Adoption is slow and boring, until it isn't. If the market is gonna crash and burn it might be the absolut best for BCH, because speculation and volatility will suddenly die down and adoption and slow price appreciation go hand in hand.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8nll9a",
                    "author": "Bagmasterflash",
                    "score": 3,
                    "created_utc": 1652585198.0,
                    "response": "Except bch and this community.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8nmcj1",
                            "author": "i_have_chosen_a_name",
                            "score": 3,
                            "created_utc": 1652585633.0,
                            "response": "If people would just understand that if we turn this stuff in to money then we can all win because it stops being a zero sum guy. \n\nThe real Bitcoin community wants it all but the rest is like: \"Bitcoin taking over the world?  Replacing the dollar? Never gonna happen, just give up already. Grab your share of the pie and move on.\"\n\nI once heard somebody from the 99% say \"It's a fight between the 99% and the 1% and I am putting my money on the 1%, they never lose\"\n\nAnd with that attitude, never will ever change. \n\nHow can we get this attitude changed?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8nnagc",
                                    "author": "Stockleezy",
                                    "score": 8,
                                    "created_utc": 1652586181.0,
                                    "response": "Be the change you want to see in the world. \n\n\nBecause BCH has utility , it's not hard to incorporate in your life. Further opportunities will present themselves to  further incorporate adoption in daily use and among peer to peer. \n\nIf we agree bch has a value based on user experience, cost basis, and decentralization. What would be the dollar value ? It's obviously not independent of itself , it follows btc very closely.  \n\n\nSo in the end, it's decentralization and use case that will keep crypto strong. \n\nAlso , we shouldn't price things in dollars. It encourages the behavior you described",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "id": "upz08x",
            "title": "Watch the 2-hour Upgrade Livestream and Win BCH! Starts at 12:00pm UTC on May 15th. 🎉",
            "url": "https://twitter.com/SatoshiAngels/status/1525688865910140928?s=20&t=Rcaq6uqe8ITQbAAWHelIgg",
            "author": "satoshis_angels",
            "created_utc": 1652592015.0,
            "score": 43,
            "num_comments": 25,
            "subreddit": "btc",
            "selftext": "",
            "stickied": true,
            "comments": [
                {
                    "id": "i8nwp42",
                    "author": "Alex-Crypto",
                    "score": 6,
                    "created_utc": 1652592136.0,
                    "response": "Gonna be exciting!!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8od1wa",
                    "author": "LovelyDayHere",
                    "score": 4,
                    "created_utc": 1652605406.0,
                    "response": "For those running a full node who still need to upgrade:\n\nLinks to downloads for full nodes that are ready for the release (minimum versions in brackets are based on what's available that you need to to be compatible with the May 15, 2022 upgrade):\n\nBU: https://www.bitcoinunlimited.info/download (v1.10.0)\n\nBCHN: https://bitcoincashnode.org/en/download.html (v24.0.0)\n\nVerde: https://bitcoinverde.org / https://github.com/SoftwareVerde/bitcoin-verde/releases/tag/v2.2.0  (v2.2.0)\n\nKnuth: http://kth.cash/#download / https://github.com/k-nuth/kth/releases (v0.24.0, although v0.23.0 is minimum for this network upgrade - and you need to follow the instructions on the main website to download and install the upgrade)\n\nBCHD: https://bchd.cash / https://github.com/gcash/bchd/releases/tag/v0.19.0 (v0.19.0)\n\n---\n\nSource:\n\nhttps://np.reddit.com/r/Bitcoincash/comments/uk7dwz/node_operators_please_update_your_nodes_prior_to/\n\nhttps://www.reddit.com/r/btc/comments/uk7fd1/node_operators_please_update_your_nodes_prior_to/",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8nwjej",
                    "author": "the_timezone_bot",
                    "score": 3,
                    "created_utc": 1652592027.0,
                    "response": "12:00pm UTC happens when this comment is 6 hours and 39 minutes old.\n\nYou can find the live countdown here: https://countle.com/SGFYvyvrY\n\n---\n\nI'm a bot, if you want to send feedback, please comment below or send a PM.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8obh3f",
                    "author": "FamousM1",
                    "score": 3,
                    "created_utc": 1652604044.0,
                    "response": "Will I need to update my wallet?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8ocuo2",
                            "author": "LovelyDayHere",
                            "score": 5,
                            "created_utc": 1652605240.0,
                            "response": "Usually not, unless your wallet wants to offer access to some of the new Script opcodes, which is highly unlikely for all payments-focused wallets.\n\nAnyway, most wallets won't require an update, but if your wallet vendor does, they will put out an update in time when they have implemented whichever features they want. There is nothing urgent, existing payments (old wallet software) continues to work as before.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8ofnhd",
                            "author": "FUBAR-BDHR",
                            "score": 3,
                            "created_utc": 1652607653.0,
                            "response": "Do you use a full node as your wallet?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8ofrpx",
                    "author": "FUBAR-BDHR",
                    "score": 3,
                    "created_utc": 1652607756.0,
                    "response": "Well unless it's streaming on the back of my eyelids I'm going to miss it as usual.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}