{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "us0hi8",
            "title": "Big Update! (May 15th, 2022)",
            "url": "https://i.redd.it/9uzit8tmp4091.jpg",
            "author": "MadManD3vi0us",
            "created_utc": 1652833690.0,
            "score": 0,
            "num_comments": 12,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i90jt6e",
                    "author": "MadManD3vi0us",
                    "score": -3,
                    "created_utc": 1652833697.0,
                    "response": "More info here: https://news.bitcoin.com/bitcoin-cash-slated-for-may-15-upgrade-to-bring-improvements-for-users-and-merchants/\n\nEdit: Downvoting an informative link is the epitome of censorship, which I thought was the whole point of this sub... Booooo trolls",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i91wbi2",
                            "author": "Remora_101",
                            "score": 4,
                            "created_utc": 1652864157.0,
                            "response": "Downvoting is not censorship for the umptiest time.  \n\nCensorship is censorship. \n\nWanna experience censorship? I'll block you for a day, which completely blocks you from responding to me or anyone that answers me. \n\nI could write whatever I want here and you are unable to respond. Feel the difference?\n\nI'll unblock you tomorrow.\n\nRemindME! 24h \"unblock\"",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i96c8wd",
                                    "author": "Remora_101",
                                    "score": 1,
                                    "created_utc": 1652944623.0,
                                    "response": "u/adManD3vi0us I unblocked you. I hope you get the difference know. But I have little hope according to your other rants.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i91sdgi",
                            "author": "ekcdd",
                            "score": 1,
                            "created_utc": 1652860448.0,
                            "response": "This sub does not think mass down voting is a form a censorship as much as I have tried to say it is.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i95htp8",
                                    "author": "MadManD3vi0us",
                                    "score": 1,
                                    "created_utc": 1652925709.0,
                                    "response": "People who say mass downvoting content isn't censorship are either playing dumb, or don't understand how the algorithm pushes content. What else do you call it, when you actively attempt to prevent something from being seen? That's called censorship. And what are they censoring? Information about the new update, which nobody else is providing any context about. This whole situation with these salty randos downvoting all my posts is stressful and pathetic...",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i91whri",
                            "author": "MadManD3vi0us",
                            "score": -3,
                            "created_utc": 1652864321.0,
                            "response": ">Downvoting is not censorship for the umptiest time.  Censorship is censorship. Wanna experience censorship? I'll block you for a day, which completely blocks you from responding to me or anyone that answers me. I could write whatever I want here and you are unable to respond. Feel the difference?I'll unblock you tomorrow.\n\nWow, you're incredibly toxic. Block me forever.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i921sve",
                                    "author": "BewareOfShills",
                                    "score": 3,
                                    "created_utc": 1652869098.0,
                                    "response": "He is not toxic, not in the slightest. He even tries to demonstrate to you the difference and all you do is lash out. Good Job.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i95iqi6",
                                            "author": "MadManD3vi0us",
                                            "score": 1,
                                            "created_utc": 1652926133.0,
                                            "response": ">and all you do is lash out.\n\nI'm seriously asking, how did I \"lash out\"? I'm trying to spread news about Bitcoin Cash, and I'm getting downvoted for what? To prove that downvoting isn't censorship? I'm baffled at your motivation to attack me and accuse me of being in the wrong. I've done nothing to any of you. This whole comment thread has become one of those most negative experiences I've ever had on Reddit.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i96jkp0",
                                                    "author": "BewareOfShills",
                                                    "score": 1,
                                                    "created_utc": 1652951231.0,
                                                    "response": "You came into this sub accusing the community of the same thing many obvious trolls have done bevor. \n\nNot a good first impression. Maybe learn a bit about the community and its struggles before accusing anyone. \n\nWe are under constant slandered by BTC maxis who can come here, because this sub does not censor opposing views and when we speak out we are accused of toxicity. Not to speak of that we get instantly banned in r/bitcoin if we write our point of view.\n\n\n\nYour meme, to be frank, is also pretty shit. BCH was dope before the update now it is even better.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i93vz9o",
                                            "author": "MadManD3vi0us",
                                            "score": -1,
                                            "created_utc": 1652900222.0,
                                            "response": "This troll has been following me around from post to post. He's incredibly toxic and annoying. This sub has serious issues\n\nEdit: How on earth did I lash out in anyway shape or form? I'm literally just trying to post info about the update, and this nobody comes around trying to outdouche everyone and block me to prove his amazingly pointless point.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i96jmtw",
                                                    "author": "BewareOfShills",
                                                    "score": 1,
                                                    "created_utc": 1652951286.0,
                                                    "response": "Maybe it is you who is toxic, have you thought about that?\n\nhttps://old.reddit.com/r/btc/comments/us0hi8/big_update_may_15th_2022/i96jkp0/\n\n\n>I'm literally just trying to post info about the update, and this nobody comes around trying to outdouche everyone and block me to prove his amazingly pointless point.\n\nSounds pretty toxic and self absorbed to me.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}