{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uzkiis",
            "title": "Central Africa Republic to adopt BTC as legal currency. However, the World Bank has again tried to obstruct crypto adoption. What is the reason behind the World Bank's scepticism about space?",
            "url": "https://www.reddit.com/r/btc/comments/uzkiis/central_africa_republic_to_adopt_btc_as_legal/",
            "author": "Noemimb",
            "created_utc": 1653733449.0,
            "score": 1,
            "num_comments": 0,
            "subreddit": "btc",
            "selftext": "A new \"Sargo Hub\" has been established to bolster crypto-initiatives in the CAR (Central Africa Republic).  \n\nThe World Bank stated that it wouldn't be possible to carry out any operations with the BTC or crypto-locked liquidity of the Central African Republic and indicated its scepticism towards its Sargo Club and crypto-space. \n\nThis isn't the first time World Bank has done something to hinder the rapidly growing crypto and De-Fi communities.\n\nThe possible reason behind the World Bank's distrust can be anything, but the body's fall predictions for El Salvador were proven right. \n\nThe framework of how BTC and other cryptocurrencies work can also be the reason, since there's little to no backed-value for such assets. \n\nFor instance, since BTC is decentralised, there are no heads or chiefs. If it collapses or vanishes, there would be no responsible entity to blame and  recovering lost liquidity can be impossible.\n\nAs more and more people are injecting funds and growing the market, the World Bank is scared since the risk potential is also increasing.\n\nHowever, BTC and the market have remained successful in recovering from the greatest crashes and hence proved their potential to be the future.\n\nNew-day innovations are taking place in the market after BTC's arrival. Web3 projects, NFTs, and tokens have already made their place across the world. Monero and TokLok tokens are some unique projects. Monero tokens allow users to transact anonymously. \n\nWhile TokLok tokens give free access to its paid messaging app through which holders can communicate by keeping data confidential from servers and even the organization itself.",
            "stickied": false,
            "comments": []
        }
    ]
}