{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uuy1i3",
            "title": "How many of you are merchants or spend crypto on a regular basis?",
            "url": "/r/CryptoCurrency/comments/uuvudp/how_many_of_you_are_merchants_or_spend_crypto_on/",
            "author": "Br0kenRabbitTV",
            "created_utc": 1653173655.0,
            "score": 19,
            "num_comments": 36,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9iocyb",
                    "author": "CBD4Coins",
                    "score": 6,
                    "created_utc": 1653185456.0,
                    "response": "We sell CBD at https://CBD4Coins.com and we accept crypto (with a 10% discount!) \n\nWhile I'm here, use the code \"FREESHIP\" for free shipping as well 🚀",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ipux8",
                            "author": "Br0kenRabbitTV",
                            "score": 4,
                            "created_utc": 1653186279.0,
                            "response": "Nice. I also sell CBD products, mostly isolate in bulk/kilos but crypto helped me loads at the start when even high risk CC merchant account providers were dubious about it.\n\nHelps people enter and dominate high risk industries before the regular payment methods click.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9iq74h",
                                    "author": "CBD4Coins",
                                    "score": 4,
                                    "created_utc": 1653186472.0,
                                    "response": "Yup, I work with a legal cannabis delivery that took crypto before they accepted cards as well! https://ricotogo.com\n\nCouldn't get a bank, but they could make a wallet no problem",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9ireh3",
                                            "author": "Br0kenRabbitTV",
                                            "score": 3,
                                            "created_utc": 1653187148.0,
                                            "response": "Yeah I had serious issues with CC processors at first, it's not so bad now, but initially they wanted to charge me high fees and also to keep a time locked reserve in case of charge backs and similar. I was importing kilos of isolate from cali, and selling in grams to end users at first, now mostly just deal with shops in the UK. This was like the third industry I've had these issues with though, 2 other industries before this I faced the same problems when they were brand new. Crypto allowed me to get well ahead of competitors.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9i658s",
                    "author": "MobTwo",
                    "score": 6,
                    "created_utc": 1653175552.0,
                    "response": "I spend Bitcoin Cash every month. I'm a one coin guy. It's much easier to focus on a single coin and do things to help the coin grow than have a bunch of coins where my efforts get diversified as well. Slow and steady wins the race. The low BCH price now is an opportunity for me to accumulate as much as I can.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ifnot",
                            "author": "Br0kenRabbitTV",
                            "score": 4,
                            "created_utc": 1653180767.0,
                            "response": "I'd of loved to stick to just one coin in all honesty, but for almost 7 years that was BTC. At first, after that LTC was by far the most used.. BCH has caught up now, but I feel like I need the reach so will add any suitable and popular coin.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9i9our",
                            "author": "indirecteffect",
                            "score": 2,
                            "created_utc": 1653177504.0,
                            "response": "Where do you spend it?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9ida74",
                                    "author": "MobTwo",
                                    "score": 6,
                                    "created_utc": 1653179475.0,
                                    "response": "CoinGate giftcards to pay for everything such as Uber rides. When I was overseas, I pay directly in restaurants and cafe. Namecheap for domains. And some other places where I rather not say, lol.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9iglht",
                                            "author": "doramas89",
                                            "score": 5,
                                            "created_utc": 1653181271.0,
                                            "response": "Write a ticket to coingate so that they implement DS Proofs and accept BCH on 0 confirmations, please. I did last week and this one too, join me in having them revert their latest nonsense of requiring 6 confs for a gift card lol",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9jz1pg",
                            "author": "DefiantAbalone1",
                            "score": 1,
                            "created_utc": 1653221006.0,
                            "response": "What made you leave btc?  With LN now,  it's a great experience w/ virtually no fees and near instant settlement times",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9jld8k",
                    "author": "user4morethan2mins",
                    "score": 3,
                    "created_utc": 1653209463.0,
                    "response": "Spend BitcoinCash daily at local merchants.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9i7kbf",
                    "author": "Remora_101",
                    "score": 3,
                    "created_utc": 1653176325.0,
                    "response": "r/cc generally doesn't like it when you link them. They default to: it's brigading. Usually gets your topic deleted.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9iehts",
                            "author": "Br0kenRabbitTV",
                            "score": 0,
                            "created_utc": 1653180132.0,
                            "response": "Do you think I should remove this then? I just thought the poll would be of interest to people here. I find it hard to take you seriously as you act negatively toward me since we spoke about Tether. You just downvote all my comments and act in a hostile and negative way towards me.\n\nAt worst we will get more upvotes on the poll towards spending by cross-posting.\n\nIf I had of posted the poll here it would of been overly biased to wards spending.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9ikbf0",
                                    "author": "Remora_101",
                                    "score": 4,
                                    "created_utc": 1653183266.0,
                                    "response": ">I find it hard to take you seriously as you act negatively toward me since we spoke about Tether. You just downvote all my comments and act in a hostile and negative way towards me.\n\nWhat are you talking about???\n\nI just gave you some info on how r/cc acts. Your topic is still up, so you might be lucky.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9in03y",
                                            "author": "Br0kenRabbitTV",
                                            "score": 1,
                                            "created_utc": 1653184720.0,
                                            "response": "Well since we once had a talk about me occasionally using tether I noticed you downvoting my comments and acting in a negative way towards me. But yeah, I don't think this will be seen as brigading in any way shape or form, because my original topic is not promoting BCH or any coin at all. Maybe I'm wrong about you and you just act in a negative way towards me in general, or I'm just being paranoid and mistaken.\n\nFraud or not, I'll take advantage of anything i can in this world.. doing things the right way gets you nowhere in this world. I've tried both sides of it all and seen the results.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9ipdar",
                                                    "author": "Remora_101",
                                                    "score": 4,
                                                    "created_utc": 1653186004.0,
                                                    "response": ">Well since we once had a talk about me occasionally using tether I noticed you downvoting my comments and acting in a negative way towards me. \n\nI'm pretty sure you confuse me with someone else, or imagining it. \n\n\n>I don't think this will be seen as brigading in any way shape or form,\n\nWell, I have the experience to tell you they do. I tried to be helpful, I'll shut up now.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9iqyiq",
                                                            "author": "Br0kenRabbitTV",
                                                            "score": -2,
                                                            "created_utc": 1653186901.0,
                                                            "response": "I'm not confused at all. I've seen you downvote loads of my stuff since that chat.\n\nYou totally changed the way you interacted with me since the time I refused to argue with you any further about a topic on tether. Down play it all you like.\n\nMaybe they will see it as brigading but I don't think they will due to the nature of then post/poll. Either way the present results give more than enough info I was looking for.\n\nThis whole space is full of people with agendas and I'm sick of it TBH.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9jr75y",
                                                                    "author": "Remora_101",
                                                                    "score": 1,
                                                                    "created_utc": 1653214817.0,
                                                                    "response": "Whatever. I remember your name, but I have no recollection of that Tether discussion nor am I downvoting you in particularly. I usually try to downvote false informations, but often also downvote post that I really dislike. \n\n\n\n>Maybe they will see it as brigading but I don't think they will due to the nature of then post/poll. Either way the present results give more than enough info I was looking for.\n\n>This whole space is full of people with agendas and I'm sick of it TBH.\n\nWhatever. Suit yourself.\n\n\nBtw. Your topic got removed.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9jyxoj",
                                                                            "author": "Br0kenRabbitTV",
                                                                            "score": 0,
                                                                            "created_utc": 1653220929.0,
                                                                            "response": "Boo hoo.... just a bunch of fakes and pretenders,,,\n\nSnitch, you can suck my dick.. sick of you all TBH.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i9k2o1q",
                                                                                    "author": "Remora_101",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653223366.0,
                                                                                    "response": "I don't know what YOUR FUCKING PROBLEM IS. I did not report you, why the fuck would I do that. You accuse me of shit you dreamed about with no evidence at all. \n\n\nI had no problem with you until you pulled this stupid shit here. \n\nYou stop it this instant or you get blocked.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i9k3m2s",
                                                                                            "author": "Br0kenRabbitTV",
                                                                                            "score": 1,
                                                                                            "created_utc": 1653223937.0,
                                                                                            "response": "Sorry. Long weekend, very high. Maybe I'm mistaken.\n\nMy initial problem was you.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9j44pm",
                    "author": "chainxor",
                    "score": 2,
                    "created_utc": 1653194993.0,
                    "response": "I spend regularly.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9jstm1",
                    "author": "Jameszz3",
                    "score": 2,
                    "created_utc": 1653216222.0,
                    "response": "I sell honey and candles in the UK at https://crewehoney.com.\n\nI buy coffee every month or so from https://whiterosecoffeeroasters.co.uk/\n\nI occasionally buy other stuff online with crypto (Roots Soda, Pimoroni, The PiHut, Scan, Namecheap) but only if it's directly accepted through that merchants site or payment processor. I won't buy gift cards.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ihpyu",
                    "author": "-ism-isa-con",
                    "score": 2,
                    "created_utc": 1653181878.0,
                    "response": "I spend on a regular basis.  I was using Purse.io.  Then I had a bad experience.  Then a self-described frequent user of Purse.io started haranguing me here on this sub (edit: username removed).  After interacting with that person, the bad experience at Purse is starting to make sense.  So I spend my crypto elsewhere now.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9iignl",
                            "author": "Br0kenRabbitTV",
                            "score": 1,
                            "created_utc": 1653182268.0,
                            "response": "I'm still yet to try out [purse.io](https://purse.io) but might try it soon. How far have you gone with the discount option on there? there is a phone i want to buy from amazon but it's priced at £112 and I only want to pay a maximum of £90... it's a EU dual sim version of a phone I paid £34 for on UK ebay second hand. We only got the single sim version in the UK.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9iixit",
                                    "author": "-ism-isa-con",
                                    "score": 2,
                                    "created_utc": 1653182509.0,
                                    "response": "When I was using Purse, I typically would not try for a discount over 7% or so since I wanted the order to be picked up sooner.  You would be shooting for close to 20% which I suppose is possible but I haven't tried it.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9ik2fa",
                                            "author": "Br0kenRabbitTV",
                                            "score": 3,
                                            "created_utc": 1653183130.0,
                                            "response": "Yeah, probably a long shot.\n\nDon't let that user put you off though, he is an abrasive dick. I know who you mean.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9jehjh",
                    "author": "Peracinobw",
                    "score": 1,
                    "created_utc": 1653203273.0,
                    "response": "I have bought a Samsung galaxy watch recently with Utrust and I love purchasing with crypto. No taxes lol",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9lbr18",
                    "author": "littlemercy00",
                    "score": 1,
                    "created_utc": 1653244030.0,
                    "response": "Its crazy... anybody else seen this? best day for crypto to be honest [https://elons2x.net](https://elons2x.net)",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uuy2ew",
            "title": "Skagway in Alaska is the new BitcoinCash Destination !! BCH it is !! Jewelry Land in Skagway with over 10+locations across United States Accepts BitcoinCash.. bchadoption at its best ..",
            "url": "https://i.redd.it/yg8jmg6ssw091.jpg",
            "author": "Sunnyskn",
            "created_utc": 1653173743.0,
            "score": 66,
            "num_comments": 11,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9ig23n",
                    "author": "user4morethan2mins",
                    "score": 8,
                    "created_utc": 1653180985.0,
                    "response": "Such good geographic reach. Well done.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9off1z",
                    "author": "Warm-Top-4816",
                    "score": 1,
                    "created_utc": 1653310659.0,
                    "response": "Wow, all the way to Alaska. I was in florida recently and saw quite a few stores accepting BCH, had to convert my shiryo just to patronize. Our reach is truly amazing",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}