{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uvhx7l",
            "title": "Carl Quintanilla Thinks Bitcoin Will Not Replace Bitcoin",
            "url": "https://www.reddit.com/r/btc/comments/uvhx7l/carl_quintanilla_thinks_bitcoin_will_not_replace/",
            "author": "Jaylah765",
            "created_utc": 1653246888.0,
            "score": 0,
            "num_comments": 1,
            "subreddit": "btc",
            "selftext": "“Crypto sought to replace the financial system altogether with one that was faster, cheaper, less under the thumb of government and more accessible to the poor. It has had 13 years to make that case, and failed.” Carl a renowned American journalist and co-anchor of Squawk on the Street and Squawk Alley, morning programs on CNBC said in a tweet recently. \nWell, I tend to agree with him partly.\n\n If Fiat is truly awful, why do people continue to use it to assess the value of Bitcoin? Why not sever ties and cease exchanging Bitcoin for the pernicious Fiat? Possibly because without the ability to convert it to Fiat value, it is not worth the electricity it consumes.\n\nOf course, you can support BTC and other cryptocurrencies without hating Fiat, but most people do, as their goal is to use cryptocurrencies to acquire more Fiat... But insisting that Fiat is evil or unworthy and that you despise it is absurd. Also, prices and values of fiat currencies are typically more stable than those of cryptocurrencies.\n\nHowever, cryptocurrency is still new, and its uses continue to grow.  For example, many Ukrainians turned to cryptocurrency after fleeing the Russian invasion in 2022. Without cryptocurrency, many might not have had the money to survive.\n\nAlso,  crypto tokens like FundRequest are used for funding and rewarding open source development where contributors are paid for their work. Another example is tea, a blockchain that will reward contributors and participants in the open-source community through Tea tokens.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9lllih",
                    "author": "Adrian-X",
                    "score": 1,
                    "created_utc": 1653248508.0,
                    "response": "I agree with the principle, with a caveat.\n\nBitcoin like other money doesn't have any value. The value in any money network is contributed by the network of participants who contribute by exchanging value in the network.  Value is created when two parties voluntarily exchange something they value less for something they each value more. \n\nEffectively their time is impacted by specialization and the division of labour. The net result is the whole is greater than the sum of the parts **and value creation.** A \"store of value\" is investing in the productivity, integrity and ingenuity of the other network participants. \n\nThese money networks are then subject to trusted 3rd parties to function and middlemen who arbitrage between networks exchanging one currency for another. Money networks are in competition for productive participants. The winner in the money network is the global currency used by everyone.\n\nOne would hope people chose the best one to avoid exchange arbitrage and manipulation.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uvhpoj",
            "title": "The Final Call: Bitcoin, AAPL, TSLA & XLI",
            "url": "https://www.cnbc.com/video/2022/05/20/the-final-call-bitcoin-aapl-tsla-xli.html",
            "author": "Total_Resolution_443",
            "created_utc": 1653246285.0,
            "score": 0,
            "num_comments": 2,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uvhygc",
            "title": "PayTaca: This wallet is awesome! Why is this Flipstarter not getting more attention?",
            "url": "https://www.reddit.com/r/btc/comments/uvhygc/paytaca_this_wallet_is_awesome_why_is_this/",
            "author": "chainxor",
            "created_utc": 1653246991.0,
            "score": 21,
            "num_comments": 11,
            "subreddit": "btc",
            "selftext": "[https://flipstarter.paytaca.com/en](https://flipstarter.paytaca.com/en)   \n\n\nOnly 4 days left.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9lun7l",
                    "author": "doramas89",
                    "score": 14,
                    "created_utc": 1653252660.0,
                    "response": "IMO the interface, the current UX, is not very intuitive. We understand the wallet because we already understand wallets. You gotta have something unique to drive people away from the bitcoincom wallet, and I haven't found it. If they integrated gift cards like Bitpay wallet, plus had the bitcoincom merchant map, plus smartbch... Sure, I would stop using bitcoincom and metamask and others",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9lwyid",
                    "author": "Remora_101",
                    "score": 13,
                    "created_utc": 1653253717.0,
                    "response": "They make less noise than other flipstarters.  I'm also less entusiastic about new wallets than about marketing atm. I don't know if this is good or bad :D\n\nI chipped in anyway.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}