{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "upl33o",
            "title": "Buying On Amazon With Crypto from Purse.IO We bought Gingerhead a cat tree with BCH! Full Video on Nick Chase YouTube - Link In Comments",
            "url": "https://v.redd.it/a82jxvc3zgz81",
            "author": "NickLibertarian",
            "created_utc": 1652546438.0,
            "score": 25,
            "num_comments": 32,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8ln453",
                    "author": "Mafalzon",
                    "score": 4,
                    "created_utc": 1652550960.0,
                    "response": "Awesome Nick!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8lyv4g",
                            "author": "NickLibertarian",
                            "score": 2,
                            "created_utc": 1652556377.0,
                            "response": "Thank you Marc my bro! 👍",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8otqq9",
                                    "author": "vgnz690",
                                    "score": 2,
                                    "created_utc": 1652618242.0,
                                    "response": "Keep doing the awesome work and You'll keep getting the pets on the back from the community I guess.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8qnrx9",
                                            "author": "NickLibertarian",
                                            "score": 1,
                                            "created_utc": 1652648410.0,
                                            "response": "Thank you 👍",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8w2i2e",
                            "author": "janooms",
                            "score": 1,
                            "created_utc": 1652748414.0,
                            "response": "Dude is doing awesome job, deserves a pet on the back that's for sure man.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8ldtja",
                    "author": "Remora_101",
                    "score": 3,
                    "created_utc": 1652546728.0,
                    "response": "Well this is peak influencer 🤣 Not my cup of tea but I am probably not in the group of people he wants to address 😅",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8ldwa1",
                            "author": "NickLibertarian",
                            "score": 3,
                            "created_utc": 1652546763.0,
                            "response": "Peak influencer haha I like that",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8olmhf",
                                    "author": "boedi070885",
                                    "score": 1,
                                    "created_utc": 1652612699.0,
                                    "response": "I mean that's  the most influencer You're gonna get, not gonna get more tham that I guess.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8w2g23",
                            "author": "mahenzis",
                            "score": 1,
                            "created_utc": 1652748386.0,
                            "response": "Why do you think that? Why you're not in that list? I think I'm in that list tho.\n\nI think I'm in that category and I need to get addressed there. Weird fantasy I know lol.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8n2x88",
                    "author": "1s44c",
                    "score": 0,
                    "created_utc": 1652575285.0,
                    "response": "Purse.io works because there are people with Amazon gift cards who want to cash them out at far below face value. Now let's have a think about where those gift cards come from. Indian call centers scamming old people seems to be the answer.\n\nThis is not something I wish to support.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8oalkn",
                            "author": "simon-v",
                            "score": 1,
                            "created_utc": 1652603304.0,
                            "response": "Purse.io works because there are people who want to buy Bitcoin Cash with their credit card peer to peer while at the same time giving people who want to spend Bitcoin Cash a way to do so. Everybody wins, the Bitcoin Cash economy grows. What's there not to like?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8opmug",
                                    "author": "NickLibertarian",
                                    "score": 1,
                                    "created_utc": 1652615637.0,
                                    "response": "Agreed. 👏",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8w268p",
                                    "author": "mashtu1960",
                                    "score": 1,
                                    "created_utc": 1652748249.0,
                                    "response": "There's everything to like there and yet people don't seem to like that much.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8pmz1s",
                                    "author": "1s44c",
                                    "score": 0,
                                    "created_utc": 1652632276.0,
                                    "response": "People buy things on Amazon on their credit card then sell them at a discount instead of just buying BTC directly? No. The people buying and shipping are using this as a way to cash out gift cards obtained by fraud.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8poddq",
                                            "author": "simon-v",
                                            "score": 1,
                                            "created_utc": 1652632878.0,
                                            "response": "Have you ever used it? Scratch that, have you even read the \"how it works\" page? You should try that sometime, you know. Because i'm familiar with the service, and it's nothing like what you're describing.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8q1asv",
                                                    "author": "1s44c",
                                                    "score": 1,
                                                    "created_utc": 1652638489.0,
                                                    "response": "Yes, I read it. People are buying things with gift cards and having those things sent to third parties. Those people are getting far less than face value for these gift cards.\n\nWhere do you think those gift cards are coming from? Bezos sending thousands to his friends?\n\n\nEdit: fixed autocorrect madness.\n\nEdit2: see Scammer Payback on YouTube. What do you think the scammers are doing with the gift cards they scam from their victims? They are not using US gift cards in India.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8snatw",
                                                            "author": "simon-v",
                                                            "score": 1,
                                                            "created_utc": 1652687500.0,
                                                            "response": "This \"face value\" thing of yours confuses me. You know, there are regions in the world, where getting Bitcoin Cash at a 10% or even a 15% premium is considered a bargain, because no better options exist. Other than that, you're upset at *Purse* because \"some people\" are paying to *Amazon* with stolen gift cards, did i get it right?",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8v8n35",
                                                                    "author": "1s44c",
                                                                    "score": 1,
                                                                    "created_utc": 1652734583.0,
                                                                    "response": "\"Some people\" is a multi-billion dollar industry of scammers ripping off the elderly. It is crime, and is it immoral by western standards.\n\nThere are videos of three inside of the call centers that scan these gift cards from the vulnerable. You can't claim it doesn't happen.\n\nIf you are ok with that just because of a video with a girl showing some cleavage then you really lack backbone.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8qfwv3",
                            "author": "surprise-pikachu",
                            "score": 1,
                            "created_utc": 1652644989.0,
                            "response": "I would have though so, however once I actually started using purse.io, I found that many spoke spanish and appeared to be from South America.  There does not appear to be a significant number of users from India.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8qi8kf",
                                    "author": "1s44c",
                                    "score": 1,
                                    "created_utc": 1652646015.0,
                                    "response": "The Indian scammers don't cash out the cards themselves, they sell them at a steep discount. It's just like the stolen credit card market. The Indian scammers are probably selling the gift cards on to people near the US but just outside the area where US police can get them, i.e. Mexico and Latin America.\n\nAll of this is professionally run organized crime. These scammers are not a few guys operating from their bedrooms, but whole floors of office buildings in modern looking business parks.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8qk2y5",
                                            "author": "surprise-pikachu",
                                            "score": 1,
                                            "created_utc": 1652646824.0,
                                            "response": "There are also a bunch of people trying to cash out $5 and $10 cards.  Those almost certainly did not come from the type of scams you describe.\n\nThe actual source appears to be [this](https://www.reddit.com/r/beermoney/comments/adkhsk/sites_and_apps_that_pay_you_to_play_games/), which is mostly done to generate fake appstore reviews.  While that is a kinda shitty thing to do, it's not nearly as bad as what you implied.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8qmu7i",
                                                    "author": "1s44c",
                                                    "score": 1,
                                                    "created_utc": 1652648002.0,
                                                    "response": "I'm not saying all earners are scammers, but that probably the majority are. The number of genuine people with gift cards they want to cash out is insignificant compared to the $3 billion a year scammed out of the US elderly. The $3 billion is an FBI estimate.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8w2asu",
                            "author": "junjun888",
                            "score": 1,
                            "created_utc": 1652748313.0,
                            "response": "Man those scammers lol, they're fucking famous everywhere I guess. Everyone knows about them here.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8qtkoi",
                    "author": "NickLibertarian",
                    "score": 1,
                    "created_utc": 1652650934.0,
                    "response": "New link to full video on Nick Chase YouTube channel:\n\nhttps://youtu.be/YfoJbcji7gc",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8w2g81",
                    "author": "deliriousintent",
                    "score": 1,
                    "created_utc": 1652748388.0,
                    "response": "Good job dude, you guys are making this community so Proud. I'm a fan of you guys here dudes.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "upmhxz",
            "title": "Are you in Cryptocurrency for the RIGHT Reasons?",
            "url": "https://v.redd.it/ssp8i2xnbhz81",
            "author": "Mafalzon",
            "created_utc": 1652550575.0,
            "score": 95,
            "num_comments": 45,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8noxuk",
                    "author": "Sugarbird676",
                    "score": 3,
                    "created_utc": 1652587161.0,
                    "response": "On one hand, I get extremely frustrated with friends who ask for my advice on crypto when all they see is a number going up or down, with no idea what these networks actually are. No curiosity. It’s ugly.\nOn the other hand, I definitely want to get rich off my crypto knowledge. I hate feeling scolded because I care about the US dollar value of my wealth. It sounds like some kind of purity test, one I am happy to fail.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8w8syn",
                            "author": "qk188",
                            "score": 3,
                            "created_utc": 1652751573.0,
                            "response": "I've been buying for 8 years and it keeps going up, no matter what is said and no matter How volatile it is. \n\n8 years of that alone is proof enough for me that crypto isn't going anywhere.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8ogh70",
                            "author": "Alexdcreator",
                            "score": 1,
                            "created_utc": 1652608377.0,
                            "response": "Likewise.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8lmk9s",
                    "author": "Mafalzon",
                    "score": 14,
                    "created_utc": 1652550708.0,
                    "response": "The way I see it, there are 2 types of people in crypto.\n\n1. People who want to make as much money as possible.\n2. People who want to take power away from people who shouldn't have power to begin with.\n\nI'm in crypto to remove power from governments -- to stop predatory inflation -- to allow people all over the world to use a new borderless currency.\n\nWithout the need for permission, custodians, or the wealth required to \"fund liquidity channels.\" I support currencies like BitcoinCash that just work.\n\nWhat about you?\n\nWatch [my full video here on the Luna disaster,](https://youtu.be/AgJCaVQgF9I) and what we can learn from it.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8mccaa",
                            "author": "Bad_Chicken_2",
                            "score": 13,
                            "created_utc": 1652562617.0,
                            "response": "I don't see those as mutually exclusive. I want peer-to-peer money that everyone can use and that can't be centrally controlled, *and* I want to make as much money as I can.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8mhvrk",
                                    "author": "Mafalzon",
                                    "score": 7,
                                    "created_utc": 1652565182.0,
                                    "response": "That’s fair!",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8w9fev",
                                            "author": "amirpiltan",
                                            "score": 1,
                                            "created_utc": 1652751888.0,
                                            "response": "I am a programmer. I see a LOT of new potential use cases that just aren't possible without crypto.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i8w99yt",
                                    "author": "jsqcool",
                                    "score": 4,
                                    "created_utc": 1652751811.0,
                                    "response": "This will get downvoted but anyway. I bought crypto just to surf on hype retard wave. I do not beleieve crypto to be long term investment and think vast majority people are there just for quick gains as well.\n\nHowever it is nice idea to have decentralized currency one day imho.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8qdua6",
                                    "author": "JustMyTwoSatoshis",
                                    "score": 0,
                                    "created_utc": 1652644071.0,
                                    "response": "> and that can't be centrally controlled,\n\nThen BCH is not for you:\n\nhttps://twitter.com/rogerkver/status/1063123138081370112",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8t6o3i",
                                            "author": "Collaborationeur",
                                            "score": 0,
                                            "created_utc": 1652702980.0,
                                            "response": "\\^This. \n\nI love BCH but central control happens to be an indelible part of its history. \n\nDare to happily(!) stay clear-eyed, don't parrot mantras...",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8oa1qh",
                            "author": "huewutm8",
                            "score": 5,
                            "created_utc": 1652602830.0,
                            "response": "But why not both? I got into crypto in 2017 because fuck the banks,  corporations and governments... also because I'd like to retire before my body gives out.  my career is heavy manual labor and my body isn't going to last forever,  at this rate... I'm in need of surgery on both shoulders,  my knees... and my back is royally fucked.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8lupsf",
                            "author": "LovelyDayHere",
                            "score": 10,
                            "created_utc": 1652554431.0,
                            "response": "While I think we can agree that there are people who should rather not have power, the Bitcoin whitepaper doesn't define this.\n\nBut it does say that Bitcoin is a system of electronic cash that removes the need for trust (using cryptography) and so it can solve a number of problems which arise when we need to rely on (trusted) intermediaries to the extent many people are currently forced to...\n\nBeyond that, as long as the members of the first group are made aware not to invest more into crypto than they can afford to lose, we should welcome them too, no? They include the entrepreneur types, the pragmatists who don't care so much about how it works but rather that it delivers on its promises.\n\nSelf-empowerment might be a bit more appealing way of marketing #2 rather than removing government power, even if ultimately, more power in the hands of the people means less centralized power and maybe that can be equated with \"remove power from governments\".\n\nBut let's keep in mind that people are frequently attached to their government, esp. if the previous government was worse. Ok, so governments right now aren't doing too well _on average_. We need to point out that it's money that often buys a ticket to freedom when government turns oppressive. And when the state or its subservient institutions (like central banks and their regulated downstream commercial banks) start to enforce state ideology, then suddenly the citizen's access to money can become precarious. We saw this in the case of Canada where big banks jumped in to play censors against the truckers who protested against violations of the peoples' rights, freezing peoples' accounts and handing over account details of suspected dissidents to government. This can easily happen anywhere, and cryptocurrencies help protect people against such \"emergency\" situations just as much as they can help in improving regular transacting (if governments / banks weren't putting regulation obstacles in the way all the time).",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8o6wpy",
                                    "author": "ziyoub3",
                                    "score": 2,
                                    "created_utc": 1652600150.0,
                                    "response": "Even thought I am an engineer in profession, I only recently started reading about blockchains and crypto.\n\n I had mainly focused on stocks so far.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8w9fg9",
                            "author": "titelibo",
                            "score": 3,
                            "created_utc": 1652751889.0,
                            "response": "I think it remains to be seen whether there's any lasting demand for crypto as a currency or store of value.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8mioge",
                            "author": "JapGOEShigH",
                            "score": 6,
                            "created_utc": 1652565556.0,
                            "response": "I'm in crypto, especially BCH, because it's money.\n\nIt's easy to use, fast, reliable and fair. Accessible to anyone with \"radio\" signal.\n\nLittle harder to handle as printed or stamped private keys. Still viable imo. \n\nAnd BCH has proven itself over and over to be resilient and here to stay.\n\nIt just works.\n\nu/chaintip",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8mivd8",
                                    "author": "chaintip",
                                    "score": 2,
                                    "created_utc": 1652565643.0,
                                    "response": "***\nu/Mafalzon, you've [been sent](https://www.blockchain.com/bch/address/bitcoincash:qrelay2s0lj6n7z25ar05r5r345utgutncs4keejnc) `0.00216492 BCH` | `~0.50 USD` by u/JapGOEShigH\nvia [chaintip](http://www.chaintip.org).\n***",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8n7uu4",
                            "author": "AI_Derp_Learning",
                            "score": 1,
                            "created_utc": 1652577839.0,
                            "response": "While I totally agree with the sentiment I have to point out:\n\nYes, BTC/BCH *works* as cash-like transactions are accurately reflected in an immutable ledger without the need for 3rd party verification. That’s cool when the parties involved are already trusted and known. Buying dinner or concert tickets or sending money to a friend. \n\nAt some point, further crypto adoption is going to require infrastructure for more sophisticated types of financial transactions. Loans, Credit, escrow, assurance, custodial services are not going away just because of a currency blockchain. Those services exist because there is some inherent need, risk, or flaw with a counterparty in the transaction that is totally agnostic to the form of payment. Right or wrong large financial institutions have dominated the market for those service. Hence the disproportionate power you mention. But is a scattered network of De-Fi companies tasked with building that infrastructure (complete with their own profit incentives and need for self sustainment) really that much superior to what we have now?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8o3xxb",
                                    "author": "LovelyDayHere",
                                    "score": 2,
                                    "created_utc": 1652597692.0,
                                    "response": ">Loans, Credit, escrow, assurance, custodial services are not going away just because of a currency blockchain\n\nCorrect, there are needs for these and therefore they will not vanish\n\n>  is a scattered network of De-Fi companies tasked with building that infrastructure (complete with their own profit incentives and need for self sustainment) really that much superior to what we have now?\n\nYes.\n\nCouple of reasons:\n\n1. More open access to these services for all. No more a few people picking winners and losers. Increased competition, more choices, and that is good for services and products in this sector.\n\n2. More decentralization means lower risk of the system failing catastrophically like the crises of the current one.\n\n3. Less reliance on trust and more reliance on transparent contracts and open math holds potential for better separation of the good services from the scammy or bad quality ones. This could go some way towards restoring the reputation of the financial sector, which has suffered in the public's estimation because of incessant scams, extortionate practices, intransparency, and causing financial crises bringing hardship predominantly on the middle and lower classes. \n\n4. The technology holds the potential for completely new financial applications and forms of organization that were impractical before programmable money & smart contracts. 'DAO' comes to mind, but really even multi signature contracts which do not rely on trust, but math, are innovative. Being able to exchange value trustlessly through atomic swaps and non-custodial escrow is another.\n\nEDIT: strange, user u/AI_Derp_Learning seems to have removed its account?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8qdcx5",
                            "author": "JustMyTwoSatoshis",
                            "score": -3,
                            "created_utc": 1652643853.0,
                            "response": "> People who want to take power away from people who shouldn't have power to begin with.\n\nThis statement is loaded with subjectivity.\n\n\"people who shouldn't have power to begin with.\"\n\nYou identify those people differently from I do. And others disagree with both of us.\n\nI am in crypto for this reason:\n\nI want to take power away from all centralized entities. That is the entire purpose of decentralization.\n\nAnd that is why I support BTC and battle the misconceptions in this subreddit daily.\n\nAll that happened with BCH is that you gave complete power to another centralized entity: /u/memorydealers\n\nhttps://twitter.com/rogerkver/status/1063123138081370112\n\nAnd that is exactly why people who really understood this goal did not want a contentious hardfork for bigger blocks to occur. Once that pandora's box is open, where we let miners have complete control of the network, it can never be reversed. It would mean that no consensus rule in Bitcoin, including the 21m cap, would ever be a certainty.\n\nRoger Ver proudly bragged about being able to force that contentious hardfork with his pool, without any approval from the people pointing their hashrate at BTC in his pool. Instead, he just pointed their BTC hashrate at BCH and paid those miners the difference in the money they would lose by mining BCH for that duration instead of BTC.\n\nWas that november 15 2028 hardfork good or bad? Again, this is subjective, and no single entity should have the power to force a subjective change. \n\nMost users of this sub like to pretend that price is irrelevant, and since hashrate follows price, that hashrate is also therefore irrelevant. \n\nWell, hashrate distribution and % share is literally what keeps bitcoin decentralized. Without BCH's terribly low price and sha-256 hashrate % at that time, Roger would not have been able to force that hardfork by simply flipping a switch on his mining pool.\n\nAnd he had the audacity to brag about doing so....\n\nThe \"people who shouldn't have power to begin with\" that you reference would more easily be able to take complete control of BCH for that same exact reason.\n\nSide point:\n\n>People who want to make as much money as possible.\n\nMoney/capital is literally the path to freedom from control of others in this capitalist world.\n\nMoney is also literally what funded you doing this video. Are you gonna pretend you don't like money?\n\nEdit:\n\nOh and you guys are still bragging about your centralized hardforks: \n\nhttps://www.reddit.com/r/btc/comments/uq794u/meme_for_bch_network_upgrade_day/?utm_source=share&utm_medium=ios_app&utm_name=iossmf",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8mfmdf",
                    "author": "nikola-crypto",
                    "score": 7,
                    "created_utc": 1652564130.0,
                    "response": "People who think crypto is an “investment” or “asset” need to watch this. Also those who value crypto using its fiat trade value when the objective of crypto is to replace fiat itself lol",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8w91gf",
                            "author": "ppdemeijer",
                            "score": 1,
                            "created_utc": 1652751691.0,
                            "response": "I decided to start investing also in crypto after spending weeks of reading about projects. \n\nOf course there is a lot of hype right now, but I believe that the technology used in crypto projects will be widely used in the future.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8mizhj",
                    "author": "mtrycz",
                    "score": 2,
                    "created_utc": 1652565696.0,
                    "response": "Yes!\n\nThis hits exactly the right spot!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8mzp6m",
                    "author": "Techutante",
                    "score": 1,
                    "created_utc": 1652573661.0,
                    "response": "No True Scotsman",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8w97m9",
                            "author": "matthiasvdw",
                            "score": 4,
                            "created_utc": 1652751778.0,
                            "response": "TBH I buy it because I believe in the hype, not in crypto .\n\n Crypto itself, couldn't care less.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9072jy",
                                    "author": "Techutante",
                                    "score": 1,
                                    "created_utc": 1652827612.0,
                                    "response": "Yup, opportunity knocks",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8n9apy",
                    "author": "dkentl",
                    "score": 1,
                    "created_utc": 1652578604.0,
                    "response": "Probably not",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8o4nam",
                            "author": "morange81",
                            "score": 1,
                            "created_utc": 1652598260.0,
                            "response": "There will always be fools that will pay me more than I paid for it; assuming I still have the keys and there is no fraud involved. /s",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8ogk9a",
                    "author": "Alexdcreator",
                    "score": 1,
                    "created_utc": 1652608452.0,
                    "response": "This hits home, the whole concept of crypto",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8oh346",
                    "author": "Next-Sheepherder-751",
                    "score": 1,
                    "created_utc": 1652608905.0,
                    "response": "But how long will it be before the same happens with crypto?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ourlr",
                    "author": "Ok_Concept_859",
                    "score": 1,
                    "created_utc": 1652618846.0,
                    "response": "I’m in it to make money. Is that not a worthy enough reason? Mouths to feed?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8t80up",
                    "author": "Collaborationeur",
                    "score": 1,
                    "created_utc": 1652703783.0,
                    "response": "'RIGHT Reasons' is a horrible phrase: it suggests that in the eyes of some crypto is not allowable for all...",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8w8q4o",
                    "author": "hitu4cash",
                    "score": 1,
                    "created_utc": 1652751533.0,
                    "response": "It‘s just gambling for me. Throw in 100 € in a memecoin with a low market cap. \n\nEither you get 10x+ returns or you get rugged to 0.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8w9d0a",
                    "author": "jewboy66",
                    "score": 1,
                    "created_utc": 1652751853.0,
                    "response": "No currency can be used for long-term investment. The intrinsic value is 0, indeed.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "upol2x",
            "title": "Over $1.2 billion in bitcoin reserves remains unaccounted for by Luna Foundation Guard",
            "url": "https://www.theblockcrypto.com/post/146840/luna-foundation-guard-lfg-bitcoin-reserves-unaccounted?fbclid=IwAR1PwZA_lKBxoFSEsFcoOKqoOcOk-zS1jcXlRlXMaIcgKkOuLB7AwsbtaKA",
            "author": "Egon_1",
            "created_utc": 1652556796.0,
            "score": 27,
            "num_comments": 16,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8m048x",
                    "author": "TripleReward",
                    "score": 7,
                    "created_utc": 1652556964.0,
                    "response": "oops.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8w3te2",
                            "author": "Valio_milk",
                            "score": 1,
                            "created_utc": 1652749073.0,
                            "response": "That's a oops moment, the lfg is making fool out of everyone. That's how they are.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8o3sy4",
                    "author": "jessquit",
                    "score": 6,
                    "created_utc": 1652597578.0,
                    "response": "Bitcoiners who already lived through mtgox: *yawn* toldyaso",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8w3rig",
                            "author": "zhaoyunkute",
                            "score": 1,
                            "created_utc": 1652749047.0,
                            "response": "I mean ain't no big deal lol, they've gone through a lot already dude.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8oeeiy",
                    "author": "Remora_101",
                    "score": 3,
                    "created_utc": 1652606572.0,
                    "response": "🤔",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8p1idg",
                    "author": "FallonLundquist36",
                    "score": 1,
                    "created_utc": 1652622516.0,
                    "response": "thats a lot of BTC to casually displace just sayin",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8w3rpw",
                    "author": "kganse",
                    "score": 1,
                    "created_utc": 1652749050.0,
                    "response": "Didn't they sold those? J thought they sold that man.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uplmue",
            "title": "Bitcoin maxis are partially to blame for this entire #LUNA #UST debacle. Many of them endorsed it only because it pumped their #BTC bags. If it was another coin they wouldn’t have said anything, but b/c it was BTC they all gladly supported it while noobs got rekt. Shame!",
            "url": "https://twitter.com/davidshares/status/1525493768178245638",
            "author": "btcxio",
            "created_utc": 1652548012.0,
            "score": 31,
            "num_comments": 21,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8nzazk",
                    "author": "AIcohoLiX",
                    "score": 5,
                    "created_utc": 1652594043.0,
                    "response": "> Pomp\n> MMCrypto\n\nBiTcOiNmAxIs 😂",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8lkl8r",
                    "author": "shillstro",
                    "score": 12,
                    "created_utc": 1652549815.0,
                    "response": "BTC \"bitcoin\" is a community of ponzi and scammer members.\n\nTo clarify: /r/bitcoin: ponzi, scammers and bots.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8w3tjv",
                            "author": "rosynka",
                            "score": 1,
                            "created_utc": 1652749075.0,
                            "response": "Yes it is, and so is the every other crypto community so there's that.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8m8u36",
                    "author": "nexted",
                    "score": 0,
                    "created_utc": 1652560998.0,
                    "response": "Is there anything y'all won't blame on your chosen bogeyman?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8w3jy9",
                            "author": "hyppjxb",
                            "score": 2,
                            "created_utc": 1652748941.0,
                            "response": "Yeah lol, this is wrong. You can't blame btc for this shit.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8om56n",
                    "author": "Redhead_Empire",
                    "score": -4,
                    "created_utc": 1652613103.0,
                    "response": "This sub sucks nowadays",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8p3xxw",
                            "author": "btcxio",
                            "score": 3,
                            "created_utc": 1652623706.0,
                            "response": "⬆️ who da fook is dis guy",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8oae7f",
                    "author": "randomWIGHT9000",
                    "score": -1,
                    "created_utc": 1652603131.0,
                    "response": "no u",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8w3il1",
                            "author": "junebeats16",
                            "score": 1,
                            "created_utc": 1652748922.0,
                            "response": "No one is here to blame other than the luna foundation.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8psr8a",
                    "author": "Ok_Aerie3546",
                    "score": 0,
                    "created_utc": 1652634781.0,
                    "response": "When pomp said that, his audience most likely bought more bitcoin and not luna.\n\nHe actually never talked about luna in a good way. Just that they were buying bitcoin. Same with microstrategy.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8w3mbb",
                    "author": "barmenyo",
                    "score": 0,
                    "created_utc": 1652748974.0,
                    "response": "This is the first I'm seeing this take and Idk how to feel.\n\nI love bch to death, but some people here always find to blame the btc. Which isnt good dude.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}