{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uyho5b",
            "title": "Miami’s Mayor Continues to Receive His Salary in Bitcoin. Could Bitcoin become an Integral part of Business Operations?",
            "url": "https://www.reddit.com/r/btc/comments/uyho5b/miamis_mayor_continues_to_receive_his_salary_in/",
            "author": "Bigcokki",
            "created_utc": 1653599551.0,
            "score": 1,
            "num_comments": 1,
            "subreddit": "btc",
            "selftext": "In the last several weeks, the cryptocurrency market has plummeted. Bitcoin, for example, is currently struggling to stay above $30,000 and is still much behind its all-time high from last year.\n\nDespite the bad trend, Miami's mayor has maintained his stance on the asset. He stated at a panel discussion at the World Economic Forum in Switzerland that he still receives his income in BTC. The Republican, on the other hand, stressed that he only gets one of his paychecks this way:\n\n\"For the record, that is not my sole source of income.\" It's a different decision than if a person decided to take their wage in Bitcoin as their sole source of income.\"\n\nSuarez addressed the Terra debacle, stating that the LUNA/UST price crash has had no impact on his BTC goal. Investing in crypto or tech stocks, in his opinion, can be risky owing to the increased volatility of the assets, but one cannot earn without taking risks:\n\n\"Government has a tendency to attempt to shield people from losses over time, and you can't protect people from losses.\" That is the American way of doing things. That is what distinguishes investing. That, too, is part of the risk of victory.\"\n\n\nIn my opinion I think that bitcoin is innovative and will become an integral part of the business world. As more people adopt the use of the cryptocurrency  and it's value increases overtime it will become part of day to day business operations and receiving salary paid in Bitcoin will be the norm. \nBitcoin is scarce due to it's market cap, it is decentralized and way more secure compared to fiat, easily transferable globally all this gives it an edge. \nAlso Bitcoin paved the way for a thriving blockchain ecosystem which has created a self sustaining market for Bitcoin and it's alternatives. \n\nBlockchain ecosystem has grown by capitalizating  on the creation of innovative projects that could change how diverse industries and even how society itself operates. Innovative projects such as  Algorand  an open-source, decentralized blockchain network that leverages a two-tiered structure and a unique variation of the Proof-of-Stake (PoS) consensus mechanism to increase transaction speeds and achieve finality,   Decentraland  an online world that allows users to create their own avatars and purchase plots of virtual land, Concordium Platform which has been described as better than Solana  is designed to be fast, secure and cost-effective while also providing on-chain identity, compliance-centric transactions and enhanced privacy for users, PancakeSwap a decentralized  exchange allows users to buy and sell digital tokens without going through a third party. These projects are innovative to the extent that they could potentially change how the finance, the entertainment, gaming , real estate industries operate. \n\nI think that as blockchain technology becomes more mainstream that Bitcoin's value and also its role in the global financial system would increase significantly. \n\n\nhttps://cryptopotato.com/miamis-mayor-continues-to-receive-his-salary-in-bitcoin/",
            "stickied": false,
            "comments": [
                {
                    "id": "ia4672a",
                    "author": "LovelyDayHere",
                    "score": 1,
                    "created_utc": 1653599909.0,
                    "response": "Question for you, OP.\n\nHow many people can have their salary paid in Bitcoin (full or in part) each month before this \"settlement system\" is maxed out (assume current parameters and assume people expect to receive their salary on chain)?\n\nI did the math, and I find that it would help you to do the same. You might even answer half your title question.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}