{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uvq477",
            "title": "So much more can be done with NFT tech than dumb NFT art pictures of apes, memes and other stupidities.",
            "url": "https://www.reddit.com/r/btc/comments/uvq477/so_much_more_can_be_done_with_nft_tech_than_dumb/",
            "author": "Becneldjh",
            "created_utc": 1653272772.0,
            "score": 16,
            "num_comments": 28,
            "subreddit": "btc",
            "selftext": " \n\nYeah  although I completely understand that this is a legitimate way to make  money there is so much more potential in blockchain and NFT technology  than creating stupid 'artwork' ( usually pictures of apes ) and I don't  even understand why so much hype is being created over it ? Do you ?\n\nI  mean some of these things sell for millions of dollars and after you  purchase them they could be worth zero. I understand that it feels like a   very attractive proposition to the 'artist' making them because he  could potentially earn a lot from very little work but come on.\n\nDo you know what else blockchain can do ?  \nFor instance there is a project MS Recovery that utilizes blockchain to make a healthcare insurance system,  \nMicrosoft  is utilizing it to make Digital ID, there is a company called World  Mobile Token that utilizes blockchain to make a network that could in  the future connect the entire African continent, there are limitless  things that can be done and limitless choices where you can invest your  money why on earth would you use it buy dumb shit ?\n\nI understand that I might be harsh but do you agree that there are much smarter investments than NFTart ?",
            "stickied": false,
            "comments": [
                {
                    "id": "i9n02xe",
                    "author": "Late_To_Parties",
                    "score": 9,
                    "created_utc": 1653273495.0,
                    "response": "This is why i told everyone that asked \"dont buy an nft unless it actually does something, meaning concert tickets, digital albums, or anything that promises a royalty on earnings from real world sales'",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9n4vqd",
                            "author": "ShadowOrson",
                            "score": 2,
                            "created_utc": 1653276037.0,
                            "response": "> unless it actually does something, meaning concert tickets,\n\nWhich is better done by the central authority selling the tickets\n\n> unless it actually does something, ..., digital albums,\n\nalbums of what? If the album can be infinitely reproduces (copied) it is better done/controlled by the entity selling the product.\n\n> unless it actually does something, ... , or anything that promises a royalty on earnings from real world sales'\n\nWhich won't mean shit unless there is an actual, real life, legal contract associated and part of the nft.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9n5ytt",
                                    "author": "ATHSE",
                                    "score": 4,
                                    "created_utc": 1653276636.0,
                                    "response": "It's going to be interesting when someone who doesn't own the copyrights to some artwork re-issues existing stuff as NFTs on another chain. From the technological standpoint, it's the same thing, and the issuer gets the credit. The original author would then have to assert in court that his property was infringed, but there's the problem of proving the thing you digitized and \"sold\" is still yours to control, and second there's the problem of jurisdiction. Things could get very messy.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9n6n9t",
                                            "author": "ShadowOrson",
                                            "score": 1,
                                            "created_utc": 1653277020.0,
                                            "response": "Yep. Have you watched [Legal Eagle's take on NFTs](https://www.youtube.com/watch?v=C6aeL83z_9Y)? He's a practicing attorney in the District of Columbia.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9nrh2c",
                                                    "author": "ATHSE",
                                                    "score": 1,
                                                    "created_utc": 1653292192.0,
                                                    "response": "No I haven't, but I'll give it a spin.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i9n9pd6",
                                    "author": "Late_To_Parties",
                                    "score": 2,
                                    "created_utc": 1653278830.0,
                                    "response": "Then you're going to have a tough time finding an application for NFTs, all of it includes things off-chain. Its not decentralization, its lubrication for proof ot title, like property ownership.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9na1ou",
                                            "author": "ShadowOrson",
                                            "score": 3,
                                            "created_utc": 1653279043.0,
                                            "response": "(BTW, if my first comment seemed aggressive, sorry. The aggression is towards you, it's towards the current NFT paradigm) Yep, that is my understanding. The peg (reference) on the public blockchain points to something off the public blockchain. If the thing being stored off the public blockchain (like BCH) is on a public, but centrally controlled, blockchain, then the reference can always disappear when the maintainer of the central blockchain (really just a database) decides they no longer wish to maintain the database.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9n885c",
                    "author": "ShadowOrson",
                    "score": 7,
                    "created_utc": 1653277929.0,
                    "response": "> MS Recovery that utilizes blockchain to make a healthcare insurance system\n\n<SMH> Just because someone or some company uses the word \"blockchain\" does not make the thing they are proposing to do is intelligent. \"Make an insurance system on a blockchain\"... what the fuck does that even mean? If it is a centralized blockcain then it's just a fucking database. If it's blockchain that can be viewed by anyone... seriously??? Who, in their right minds, would want their medical insurance information on a public blockchain?\n\n> Microsoft is utilizing it to make Digital ID\n\nNeat... same issues as above... centralized... database... public... who would want their ID viewable and tracked by anyone???\n\n\n> there is a company called World Mobile Token that utilizes blockchain to make a network that could in the future connect the entire African continent,\n\nThis sentence makes no damn sense. \"Make a network\"? The internet? That already exists.\n\n\"connect the entire African continent\"? To what? The internet already exists.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9nve3x",
                            "author": "trakums",
                            "score": 1,
                            "created_utc": 1653295887.0,
                            "response": "Is there anything that prevents the NFT author from changing those \"Artworks\" to dickpics?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9oz3u6",
                                    "author": "ShadowOrson",
                                    "score": 1,
                                    "created_utc": 1653319846.0,
                                    "response": "I don't know.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9nnz79",
                    "author": "bitcoincashautist",
                    "score": 2,
                    "created_utc": 1653289121.0,
                    "response": "They have a real use in contracts where they can authenticate spending from some pot of money locked in a contract but allow for easy key rotation without having to change the contract.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9n5k7n",
                    "author": "ATHSE",
                    "score": 1,
                    "created_utc": 1653276406.0,
                    "response": "Is it really a legit way to make money though? I mean literally anyone can possess the thing you paid for, and the only distinction is there's some code floating around the internet that says it's yours. You might as well be selling the first page out of a photocopier.\n\nI think, despite the hype, and the obviousness of some people earning money, it is a dangerous game to play with the public, and could backfire immensely. If people realize there's nothing behind it, you really have Tulip Mania 2.0... which could set back crypto as a whole a few more years, allowing central banks to step in with replacements. Remember part of crypto's success has been (so far) moving faster than the laws and incumbants.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9n6zlr",
                            "author": "SomeAncap2020",
                            "score": 2,
                            "created_utc": 1653277211.0,
                            "response": "Wow, good job on not reading the post at all. The literal entire point is that the system behind NFTs can and should be applied to real usecases rather than scamming people with shitty overpriced drawings.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9nrfe5",
                                    "author": "ATHSE",
                                    "score": 2,
                                    "created_utc": 1653292148.0,
                                    "response": "Thanks for not reading my reply.\n\nHowever, feel free to explain to me why using NFTs for distributing tickets or coupons is somehow fundamentally different to emailing a QR code to a person? You still need to sign up and give your contact info, still have to presumably pay, and they still have to generate and send it... hell even a txt msg would do, no need for a blockchain at all.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9qjm6c",
                                            "author": "SomeAncap2020",
                                            "score": 1,
                                            "created_utc": 1653344209.0,
                                            "response": "It's cryptographic proof of ownership- no risk of counterfeit. Also it can't be destroyed (ie in a fire) like a piece of paper can. And why do we have to stop at tickets or coupons? Literally anything that you wish to prove ownership of which a) can be digitized and b) is not a fungible currency can theoretically be adapted into an NFT in some format. Certificates, tickets as you mentioned, deeds, etc are simple examples. We likely don't even know the full scope of what this could potentially be applied to yet. It would be like trying to predict what the internet, or computers in general, hell even electricity, would be used for when they were first being developed.\n\n>hell even a txt msg would do\n\nI find it funny that you're using this example, because text messaging is quite insecure. This is why any reasonably competent company will recommend against using SMS for 2FA. I get what you're trying to say, but bad example.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9nvvot",
                                    "author": "trakums",
                                    "score": 1,
                                    "created_utc": 1653296340.0,
                                    "response": "Please give an example of NFT that would be 100% decentralized and represented a real value measurable in millions or more.\n\nAnd I will try to show you how that will not work.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9qgp1z",
                                            "author": "SomeAncap2020",
                                            "score": 1,
                                            "created_utc": 1653342833.0,
                                            "response": "> real value measurable in millions or more\n\nWhy is this relevant? But sure I suppose you could say that there are likely only a few possibilities for tickets (as an example) to be worth several million USD. I'm sure what this proves though.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9s91ap",
                                                    "author": "trakums",
                                                    "score": 1,
                                                    "created_utc": 1653380268.0,
                                                    "response": "I mean market-cap",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9n0l9w",
                    "author": "kerlin219",
                    "score": 1,
                    "created_utc": 1653273753.0,
                    "response": "Yes buddy it is the future,the tech can do so much more than monkey jpegs",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9n969r",
                    "author": "Twoehy",
                    "score": 1,
                    "created_utc": 1653278505.0,
                    "response": "We'll get there. A lot of you probably don't remember the dotcom boom and crash of the nineties. Dumb money flowed into EVERYTHING. But in particular, it flowed to the SIMPLEST, easiest to explain ideas.\n\nIf you were a kickass salesman you could literally get millions of dollars in VC funding by just saying \"It's a pet store, but on the internet.\"\n\nIt took Ryan Cohen like 30 years to make that into a workable idea.\n\nPoint is, while all of these incredibly stupid people were throwing money at \"the internet\" just hoping something would stick the actual developers were churning through ideas and code and some stuff worked and some didn't, but oftentimes even those failed ventures produced dividends in the form of interesting technology that could be applied elsewhere in a manner that was actually useful.\n\nAll we can see is the foam on top of the waves, but underneath the water real work is being done. It'll be a few years before we see the fruits of that labor though. I sort of view this as an inevitable churn in the development cycle of a disruptive technology. If humans knew a better way of getting where we want to go we'd do it, but nobody has a crystal ball and the best most people can do is throw money at a project and hope they are as good as their word.\n\nThis too shall pass. NFT is an incredibly powerful technology, and jpegs are certainly the Dumbest Timeline, but it's easier to swallow if you view this as an unavoidable traffic jam on the road to real progress.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ojr97",
                    "author": "Knorssman",
                    "score": 1,
                    "created_utc": 1653312888.0,
                    "response": "What I would like to see is a company creating a digital trading card game with possession of the nft gives you access to the card in the card game client. In order for the nft system to add value to users then the company has to promise to always use the nft blockchain in its digital card game and also I think its important that even if the company doesn't like you it can't prevent you from using your cards in the card game. But I'm struggling with the potential of the company sanctioning specific cards that they think belong to someone and then even if the cards are traded to another person they are still sanctioned/worthless",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9p9zg3",
                    "author": "Puddingbuks26",
                    "score": 1,
                    "created_utc": 1653324406.0,
                    "response": "It’s already in the making: Gamestop/Loopring",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uvqasu",
            "title": "😂😂😂",
            "url": "https://i.redd.it/tabo2gd615191.jpg",
            "author": "SnakeDoc25",
            "created_utc": 1653273420.0,
            "score": 11,
            "num_comments": 25,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9n09nt",
                    "author": "Late_To_Parties",
                    "score": 6,
                    "created_utc": 1653273592.0,
                    "response": "\"of course it doesn't go as fast, its a store of momentum!\"",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9s7g92",
                            "author": "jessquit",
                            "score": 2,
                            "created_utc": 1653378802.0,
                            "response": "You know it's the Real Automobile because it's compatible with the original parts and runs on kerosene.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9nk8uu",
                    "author": "zxcjkltzxc",
                    "score": 0,
                    "created_utc": 1653286116.0,
                    "response": "to be fair, bch would be the same as btc but with a bigger engine",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ra1u7",
                            "author": "RowanSkie",
                            "score": 3,
                            "created_utc": 1653357086.0,
                            "response": "In 2017, maybe. But a lot of upgrades have been there since then.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9rruwm",
                                    "author": "zxcjkltzxc",
                                    "score": 1,
                                    "created_utc": 1653366621.0,
                                    "response": "like what?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9s7k2d",
                                            "author": "jessquit",
                                            "score": 2,
                                            "created_utc": 1653378902.0,
                                            "response": "Cashfusion, doublespend proofs, ETH-compatible sidechain just for starters.\n\nAny one of those is pretty big TBH.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9sg76n",
                                                    "author": "RowanSkie",
                                                    "score": 1,
                                                    "created_utc": 1653386899.0,
                                                    "response": "Pretty sure the only thing that is unique for us in those examples is just double-spend proofs. But then last May 2022 upgrade did give us introspection and 64-bit maths.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9t8fqi",
                                                            "author": "zxcjkltzxc",
                                                            "score": 1,
                                                            "created_utc": 1653403153.0,
                                                            "response": "how can be used those new features?",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9tatig",
                                                                    "author": "jessquit",
                                                                    "score": 1,
                                                                    "created_utc": 1653404170.0,
                                                                    "response": "Those features will theoretically enable the completion of a trustless bridge between the BCH and sBCH layers.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9tcgdt",
                                                                            "author": "zxcjkltzxc",
                                                                            "score": 1,
                                                                            "created_utc": 1653404858.0,
                                                                            "response": "wasnt SHA-Gate enough for trustless bridge?",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i9tdhlu",
                                                                                    "author": "jessquit",
                                                                                    "score": 2,
                                                                                    "created_utc": 1653405297.0,
                                                                                    "response": "SHA-gate is the trustless bridge & required these upgrades",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i9t8d3m",
                                                    "author": "zxcjkltzxc",
                                                    "score": 1,
                                                    "created_utc": 1653403121.0,
                                                    "response": "seems cashfusion and sidechains are not bitcoin cash core features. am I right? I couldn't found much about doublespend proofs",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9tao9z",
                                                            "author": "jessquit",
                                                            "score": 1,
                                                            "created_utc": 1653404109.0,
                                                            "response": "Not sure exactly what you mean by core features but, sure, I guess you're right if you want to refer specifically to the core protocol, very little has needed to be changed. In some cases small changes needed to be made (ie native introspection to support a trustless sBCH bridge).\n\nWe've also developed UTXO commitments, but that has not been made part of the standard protocol, yet.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9tbqeh",
                                                                    "author": "zxcjkltzxc",
                                                                    "score": 1,
                                                                    "created_utc": 1653404554.0,
                                                                    "response": "yes I mean btc has mixers and eth-compatible sidechains too",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9tdncy",
                                                                            "author": "jessquit",
                                                                            "score": 1,
                                                                            "created_utc": 1653405364.0,
                                                                            "response": "Well cashfusion is a far better mixer than coinjoin but sure, whatever. I was just pointing out that BCH isn't just BTC with a bigger limit, we've built our own infrastructure too.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i9yfeba",
                                                                                    "author": "zxcjkltzxc",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653497662.0,
                                                                                    "response": "fair enough, but that difference in infrastructure has nothing to do with bch having bigger blocks",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i9yfvv7",
                                                                                            "author": "jessquit",
                                                                                            "score": 1,
                                                                                            "created_utc": 1653497849.0,
                                                                                            "response": "I think you forgot what your point was. You've gone in a circle.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "id": "i9ugkck",
                                                                    "author": "bitsconnected",
                                                                    "score": 1,
                                                                    "created_utc": 1653421501.0,
                                                                    "response": "Is there already a trustless SmartBCH bridge?",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}