{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uw4vbv",
            "title": "Buttcoiner inadvertently makes solid argument for BCH / peer-to-peer cash",
            "url": "https://www.reddit.com/r/btc/comments/ub0ogd/who_killed_bitcoin_documentary/i9p40et/",
            "author": "jessquit",
            "created_utc": 1653325210.0,
            "score": 8,
            "num_comments": 9,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9pcmpa",
                    "author": "jessquit",
                    "score": 9,
                    "created_utc": 1653325509.0,
                    "response": "/u/AmericanScream wrote:\n\n> Remember this universal truth: Not your fiat, not your value\n>\n> The moment you traded fiat for crypto, your fiat is gone. **Since you like to measure value in fiat,** this is inaccurate. You no longer have any fiat. You only hold digital tokens you hope can be redeemed for fiat. That \"published price\" of crypto selling for fiat at the centralized exchanges -- that's OTHER PEOPLE'S value. Not yours. You only get to find out what the value of your tokens are when/if you can cash them out.\n\nThe thing that really spoke to me here was the bolded text.\n\nIf what you care about is the *fiat entry / exit value* of your coins, then \n\n* you tacitly acknowledge that the coins have no real purpose other than speculating on a greater fool coming to buy them from you\n\n* you don't believe in a \"crypto future\" where the world runs on crypto -- you believe in a \"fiat future\" where nothing really changes\n\n... but if crypto doesn't really change anything, why is it worth anything ...\n\nI really resonated with this comment.  Thanks /u/americanscream",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ptztu",
                            "author": "AmericanScream",
                            "score": 2,
                            "created_utc": 1653332896.0,
                            "response": "Thanks for the kind words. \n\nHere's something else to consider...\n\nIf you're measuring the value of crypto in fiat,\nAND at the same time complaining about fiat being ever-inflationary....\n\nHow can you differentiate between crypto's value going up as something other than inflation?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9pzdxk",
                                    "author": "wtfCraigwtf",
                                    "score": 1,
                                    "created_utc": 1653335194.0,
                                    "response": "what difference does it make?  And maybe you are confusing price with *value*?\n\n\"Inflation is always and everywhere a monetary phenomenon\" - Milton Friedman.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9pzoi1",
                                    "author": "jessquit",
                                    "score": 1,
                                    "created_utc": 1653335319.0,
                                    "response": "TBH I really don't care what the value of my BCH is. Many years ago I made a small investment in what I thought could be a revolutionary new form of money. Years later it appeared to have been hijacked and was clearly not meeting what I considered to be my expectations wrt direction. By then it was worth orders of magnitude more than it was when I started (as measured in fiat). So I took what any rational person would consider to be an amazing profit in fiat, and truthfully don't care if the remnants go to zero.\n\nNote, however: my exit was not predicated on Bitcoin hitting a magic fiat exit number, but based on it failing to meet my expectations re: development. I never expected to exit at all to fiat, and now that I've recouped my initial investment plus plenty more, its p2p cash or bust with the rest. I do not have high expectations.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9pjyot",
                    "author": "Remora_101",
                    "score": 7,
                    "created_utc": 1653328596.0,
                    "response": "The Crypto space and its image has been thoroughly poisoned by the number go up FIAT maxis.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9pghh8",
                    "author": "big--if-true",
                    "score": 2,
                    "created_utc": 1653327133.0,
                    "response": "BCH has a cost of creation (mining hardware cost + electricity cost), which should provide a minimum cost basis. At current prices the FIAT price is far below most peoples' cost basis. So if people decide to sell their BCH they will subsidizing new buyers/investors.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9q0kmj",
                            "author": "emergent_reasons",
                            "score": 1,
                            "created_utc": 1653335697.0,
                            "response": "Cost of production doesn't determine a price floor, at least not in the long term where the producer or consumer has better options. Have to ensure BCH is helping people on its own terms and better than any competition, especially the permissioned legacy competition.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}