{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "utsjj2",
            "title": "Spending bch and taxes",
            "url": "https://www.reddit.com/r/btc/comments/utsjj2/spending_bch_and_taxes/",
            "author": "indirecteffect",
            "created_utc": 1653045853.0,
            "score": 6,
            "num_comments": 19,
            "subreddit": "btc",
            "selftext": "I'm interested in bch because you can actually transact in it. However, transacting in bch in the US is considered a taxable event. For those of you in the US who spend bch, how do you handle it? Dutifully track and pay your taxes? Ignore it? I was thinking about trying to find a no kyc exchange and using a new wallet. But I dunno.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9bev5x",
                    "author": "Bagmasterflash",
                    "score": 11,
                    "created_utc": 1653047012.0,
                    "response": "Generally the IRS ignores anything less that 10k yearly. Over that and you have decisions to make.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9d2xbw",
                    "author": "Knorssman",
                    "score": 3,
                    "created_utc": 1653072898.0,
                    "response": "When you get your BCH I recommend using cashfusion to improve your privacy",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9d3d8f",
                            "author": "indirecteffect",
                            "score": 1,
                            "created_utc": 1653073108.0,
                            "response": "How do I do this?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9da9mx",
                                    "author": "Bagmasterflash",
                                    "score": 1,
                                    "created_utc": 1653076256.0,
                                    "response": "Use electrum cash as your wallet. You’ll find a switch in there to turn it on.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9dfv77",
                                    "author": "Knorssman",
                                    "score": 1,
                                    "created_utc": 1653078781.0,
                                    "response": "here is some more info on cashfusion https://cashfusion.org/faqs/\n\ni should add, i don't think the US government has made it illegal yet but i've heard proposals that would ban coin mixing",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9br9ih",
                    "author": "coinflip1211",
                    "score": 2,
                    "created_utc": 1653053142.0,
                    "response": "\\>  transacting in bch in the US is considered a taxable event.\n\nJust for BCH or other crypto as well? Is it including transactions of low value ($10)? Which type of tax you have to pay, is it VAT or something different?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9c9eqq",
                            "author": "indirecteffect",
                            "score": 2,
                            "created_utc": 1653060615.0,
                            "response": "Any crypto. It counts as selling it.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9edv3u",
                            "author": "Aggravated-Bread489",
                            "score": 1,
                            "created_utc": 1653095592.0,
                            "response": "It is considered capital gains tax in the US",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9ejcvr",
                    "author": "StiltonG",
                    "score": 2,
                    "created_utc": 1653098437.0,
                    "response": "Spending it is treated as if you're selling it for the equivalent amount of dollars to buy the goods.  However, it is only taxable if you made a gain by selling it. If you sell for a loss, you owe no taxes on that (you may want to track it for your own sake as you should be able to use those losses against other capital gains you made, however that's your choice.  The IRS is not going to come after you because you failed to report capital losses.  It's your choice not to report losses).\n\nI bring this up because BCH is now down to around USD 190.  That's almost its lowest point ever, and in its history since the HF 8/1/2017 it has only been lower than this for a matter of weeks (out of 5 years), meaning that more likely than not any BCH you spend now you are selling at a loss.  So no, IIUC the IRS does not care if you do not keep track of your BCH spending if you are not making any actual capital gains.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9cwv8k",
                    "author": "ActionParticular7697",
                    "score": 1,
                    "created_utc": 1653070074.0,
                    "response": "The taxation of cryptocurrency seems strange. But taxes on crypto are something that is going to happen when there's so much money out there.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}