{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uygudt",
            "title": "Bank of England's Andrew Bailey Warns Bitcoin Has No Intrinsic Value, Not a Practical Means of Payment. Is Bitcoin Really Not an Effective Means of payment?",
            "url": "https://www.reddit.com/r/btc/comments/uygudt/bank_of_englands_andrew_bailey_warns_bitcoin_has/",
            "author": "Beltondkj",
            "created_utc": 1653597248.0,
            "score": 0,
            "num_comments": 0,
            "subreddit": "btc",
            "selftext": "On Monday's Jobs of the Future podcast, Bank of England Governor Andrew Bailey issued a warning regarding bitcoin and cryptocurrency.\n\nHis warning came after the cryptocurrency market dropped by over $500 billion this month. Bitcoin, the most popular cryptocurrency, has lost more than 25% of its value in the last 30 days.\nWhile acknowledging the importance of blockchain, the underlying technology of cryptocurrencies, Bailey remains skeptical of bitcoin as a payment method. He also stated that the Bank of England is considering creating its own digital money.\n\nHe proceeded, saying:\nIn terms of payments, I don't believe it will be crypto in the same sense as bitcoin. That does not strike me as a feasible method of payment.\n\n\"What I think needs to be determined is, if we are much more likely to be living in a world of digital currency than old fashioned sort of payment ways, just what form of digital currency, digital use, becomes the recognized norm,\" the central bank governor said.\n\nBailey confirmed that he did not own any cryptocurrency, saying:\nBecause I have stated that bitcoin has no fundamental value, I am likely to be disliked by bitcoin supporters.\n\n\"It can have extrinsic value in the sense that people want to acquire it — people collect all kinds of things,\" he explained, \"but it does not have intrinsic value.\"\n\n\nIn my opinion Bitcoin can become an effective means of payment, Bitcoin is durable, it is easily divisible ,easily transactable, it is scarce as it has a market cap of 21 million among other features which makes it a great currency option. However Bitcoin's price volatility and scalability might be stumbling blocks. I think that the lighting network helps solves Bitcoin's lightning network and other scaling option while I do believe that price would stabilize as more people adopt the use of the currency. \n\nAlso as the world becomes digitally advance and as the blockchain ecosystem develops by facilitating innovative projects within it's ecosystem such as Decentraland  an online world that allows users to create their own avatars and purchase plots of virtual land, Shiryo is a P2E Card trading game in the metaverse that allows users to hold their cards as NFTs also based on the Ethereum network, Brave web browser that it gives its users the option to view ads or not , if users choose to view them, they will be rewarded with Basic Attention Tokens (BAT), PancakeSwap a decentralized  exchange allows users to buy and sell digital tokens without going through a third party that could potentially disrupt how  the industries that are in operate. \n\nI think that when blockchain technology becomes more mainstream in these industries that the value of cryptocurrencies wound increase significantly and that they would be more accepted as a means of payment. \n\nNews source: \nhttps://news.bitcoin.com/bank-of-englands-andrew-bailey-warns-bitcoin-has-no-intrinsic-value-not-a-practical-means-of-payment/",
            "stickied": false,
            "comments": []
        }
    ]
}