{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uusvnf",
            "title": "Some Proposals By Saylor & Saifedean are Worrying",
            "url": "/r/Bitcoin/comments/uust4m/some_proposals_by_saylor_saifedean_are_worrying/",
            "author": "samdane7777",
            "created_utc": 1653157331.0,
            "score": 3,
            "num_comments": 15,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9hb4by",
                    "author": "MobTwo",
                    "score": 10,
                    "created_utc": 1653159792.0,
                    "response": "I no longer worry about those silly things because I am in Bitcoin Cash and we are all about liberty and freedom. We constantly innovate. The low price is an opportunity.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9hsgbf",
                    "author": "jessquit",
                    "score": 5,
                    "created_utc": 1653168401.0,
                    "response": "Here's the thing. Almost everyone in this sub saw this coming five years ago. That's why we split. It's been evident for years that BTC has been hijacked by the very institutions that it was intended to replace. So yeah it's worrying but totally unsurprising at this point.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9hpadc",
                    "author": "LovelyDayHere",
                    "score": 4,
                    "created_utc": 1653166790.0,
                    "response": "> If Saylor and Saifedean are aiding and abetting the SEC out of political spite, and cooperating with US Financial Surveillance laws and ultimately promoting and defending EU and US and even other G20 States,\n\nWhat do you mean, \"If\" ?\n\nSince you're asking over in the censored sub, I expect the answer to be 'Hamilton' (or some other US Fed CBDC project).\n\n---\n\np.s. Readers: if you're a subscriber of this sub, take care when following links such as above without (np) in front. If you comment or vote on rBitcoin topics, their mods have been known to construe this as brigading and ban people for it as away of keeping away those who do not subscribe to their echo chamber narrative.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ksfd5",
                            "author": "samdane7777",
                            "score": 2,
                            "created_utc": 1653235805.0,
                            "response": "r/bitcoin hasn't done this to me yet, but this is exactly what r/cryptocurrency did to me.\n\nCrypto twitter doesn't have this problem, but r/bitcoin and r/cryptocurrency are totally captured by nannystate venture capital US law/US wallstreet institutionalists",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9hxr0a",
                    "author": "Remora_101",
                    "score": 3,
                    "created_utc": 1653171146.0,
                    "response": "Someone has a case of cognitive dissonance. Hopefully he pulls trough it and comes out at the other end with a better understanding.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9i2dhy",
                    "author": "Br0kenRabbitTV",
                    "score": 3,
                    "created_utc": 1653173548.0,
                    "response": "I wish I had as much cocaine as Michael Saylor.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9iay09",
                    "author": "-ism-isa-con",
                    "score": 2,
                    "created_utc": 1653178190.0,
                    "response": "Haven't found their ideas very interesting.  There was an interview once with Tom Woods where bch was mentioned and he did not get a very tolerant response from Ammous.  I'm not an academic economist and even I find competition among private currencies a remarkable new reality.  The differences between the various implementations, and the implications of those differences, are fascinating to me.  So at that time I didn't think his views very sophisticated and I never bought his book.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ibkz7",
                            "author": "AmbitiousPhilosopher",
                            "score": 2,
                            "created_utc": 1653178542.0,
                            "response": "His book has some really good history of money content, and a bunch of maxi idiocy mixed in.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9kkifk",
                                    "author": "knowbodynows",
                                    "score": 2,
                                    "created_utc": 1653232343.0,
                                    "response": "Maxídiocy",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9ksns0",
                                            "author": "samdane7777",
                                            "score": 2,
                                            "created_utc": 1653235907.0,
                                            "response": "ammous and tom woods are statist and Hoppean pseudo-libertarians who want theocratic monarchism and other dumb nonsense to enforce their world views. They aren't cypherpunk and don't believe in universal free speech, their ops to channel society back into Bush era neoconservatism.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9ku091",
                    "author": "weepingswords",
                    "score": 2,
                    "created_utc": 1653236487.0,
                    "response": ">Lol. Bitcoin is fine just the way it is.\nIt doesn’t need any “new” features. \n\nThis is the most ridiculously obvious nonsense I’ve ever heard. And people are upvoting his comment? There is no way small-blocks isn’t state sabotage of Bitcoin.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}