{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "r9sjja",
            "title": "Tether only still exists because its collapse will be the main excuse to regulate crypto to death.",
            "url": "https://i.redd.it/5z2z8f776t381.png",
            "author": "ChaosElephant",
            "created_utc": 1638746859.0,
            "score": 82,
            "num_comments": 134,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "hnefsjp",
                    "author": "DRKMSTR",
                    "score": 18,
                    "created_utc": 1638752959.0,
                    "response": "Tether is already performing the way the FED does. \n\n&#x200B;\n\nStep 1: PRINT MONEY\n\nStep 2: \"Lend\" Money to banks to lend to the stock market\n\nStep 3: Stock market booms\n\nStep 4: Slowly sell off before people get wise\n\nStep 5: Crash the market\n\nStep 6: Print more money \"quantitative easing\"\n\nStep 7:  \"Lend\" money to banks to lend to the stock market\n\nStep 8: Stock Market Booms\n\n&#x200B;\n\n&#x200B;\n\nExcept with tether it's:\n\nStep 1: Leverage and print a ton of USDT\n\nStep 2: Crash the market\n\nStep 3: Everyone trades their crypto for USDT\n\nStep 4: Print more USDT to meet demand\n\nStep 5: Everyone trades their USDT for Crypto\n\nStep 6: Market price rises across the board (market is inflated with new USDT)\n\nStep 7: Crash the market\n\nStep 8: Everyone trades their crypto for USDT\n\nStep 9: Print more USDT....",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hnfrdw0",
                            "author": "Ronoh",
                            "score": 7,
                            "created_utc": 1638779095.0,
                            "response": "The difference is the transparency  and certain accountability.  And we decide, indirectly, who takes the job.\n\nPeople at the central banks need to follow certain checks and balances. Tether is a dark box. \n\nAlso, tether gives usdt to the clients in exchange of BTC as collateral, then the clients start buying BTC, signalling a bull run that is confirme by all the smaller investors buying in. Then the clients sell, cash in, and get their BTC back from tether. The losses hit the smaller investors.\n\nThe level of manipulation in crypto is scary because it is in much fewer hands.\n\nInstead of threatening the banks we have now a wild west of speculation, with no real life application almost.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hngv0dy",
                                    "author": "Egon_1",
                                    "score": 3,
                                    "created_utc": 1638804607.0,
                                    "response": "> People at the central banks need to follow certain checks and balances. **Tether is a dark box**.\n\nThis!",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hnhawmv",
                                            "author": "opcode_network",
                                            "score": 2,
                                            "created_utc": 1638810965.0,
                                            "response": "a dark box of corruption and evil.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "hnj2bhv",
                                    "author": "Lucianofain",
                                    "score": 1,
                                    "created_utc": 1638836354.0,
                                    "response": "Banks procedures are lengthy and time consuming though!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hnedm8u",
                    "author": "i_have_chosen_a_name",
                    "score": 12,
                    "created_utc": 1638751980.0,
                    "response": "Tether will be the instrument that goverments use for the ultimate ruggpull and since now suddenly /r/bitcoin and /r/CryptoCurrency  allow people to talk about it, it will happen soon and fast.\n\nThey will let the market drop 97% and then regulators will say \"see, it was a scam, we have to regulate and protect against scams\" and most likely they will try to make every crypto illegal but Bitcoin (since that one can easily be controlled by fucking with the mempool)\n\nThis WILL happen. There is effectively barely real money in the ecosystem.  Most real money liquidity has been eaten already.\n\nThe exit is not even 25 billion dollars.\n\nGood luck with YOUR rush to the exist.\n\nUnless you can just stock up on BCH and then wait .. and wait and wait till the world needs BCH ...  then it will organically get a value.\n\nBut only rich people will be afford to stack up on 50 dollar BCH and then not need it for years.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hnegsh1",
                            "author": "ChaosElephant",
                            "score": 5,
                            "created_utc": 1638753402.0,
                            "response": "r/CryptoCurrency labelled [this post](https://np.reddit.com/r/CryptoCurrency/comments/r9fni8/tether_usdt_created_1500000000_worth_of_usdt_out/?sort=confidence) as \"misleading\"...",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hneimin",
                                    "author": "user4morethan2mins",
                                    "score": 7,
                                    "created_utc": 1638754201.0,
                                    "response": "The pinned comment by a mod claimed that an audit has been conducted. Tether has NEVER completed an audit.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hnj23hq",
                                            "author": "SupeRCa4oK1982",
                                            "score": 1,
                                            "created_utc": 1638836253.0,
                                            "response": "Did the mod just pinned up the wrong comment? or what so?",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "hngc634",
                                    "author": "miloy8",
                                    "score": 1,
                                    "created_utc": 1638795417.0,
                                    "response": "Actually though they should have cross checked once they have verified.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "hneyopp",
                            "author": "knowbodynows",
                            "score": 2,
                            "created_utc": 1638761420.0,
                            "response": "> Tether will be the instrument that goverments use for the ultimate ruggpull \n\nAgreed.\n\n> and since now suddenly /r/bitcoin and /r/CryptoCurrency allow people to talk about it, it will happen soon and fast.\n\nNot that you're wrong but I don't see how that follows.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hnf2y9g",
                                    "author": "i_have_chosen_a_name",
                                    "score": 6,
                                    "created_utc": 1638763393.0,
                                    "response": "Those subs are controlled by Maxi's.\n\nMaxis are controlled by blockstream\n\nBlockstream/Tether/Bitfinex are controlled by Digital Currency Group that is controlled by the VC's that funded Mastercard and Visa.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hnhqs92",
                                            "author": "39396a",
                                            "score": 2,
                                            "created_utc": 1638817160.0,
                                            "response": "True though Blockstream/Tether/Bitfinex are controlled by Digital currency Group.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "hnhca9d",
                                    "author": "kipkaev",
                                    "score": 0,
                                    "created_utc": 1638811502.0,
                                    "response": "I guess I could agree more enough to it! But could agree to the first line!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "hnfbswt",
                            "author": "trakums",
                            "score": 1,
                            "created_utc": 1638768144.0,
                            "response": ">most likely they will try to make every crypto illegal but Bitcoin\n\nThat would explode the BTC price and heavily increase the chance for it to become the world reserve currency. After that BCH will compete not with Bitcoin but with hundreds of Bitcoin side chains where some of them will be more decentrallized, faster and with cheaper transactions then BCH.   \n\nNow please tell me more about BCH getting value organically.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hnhw1hj",
                                    "author": "suanger2",
                                    "score": 3,
                                    "created_utc": 1638819233.0,
                                    "response": "Bitcoin isn't crypto after all. Bitcoin is Bitcoin! Let's see what happens!",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hnkidxl",
                                            "author": "trakums",
                                            "score": 1,
                                            "created_utc": 1638863033.0,
                                            "response": "You are getting up-votes. That means you must be right.    \nPlease give me an example or definition of crypto.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hnktn54",
                                                    "author": "ChaosElephant",
                                                    "score": 1,
                                                    "created_utc": 1638872600.0,
                                                    "response": "There are different kinds of crypto for different purposes. But P2P Electronic Cash replacing fiat is the only goal crypto**currency** should strive for.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "hnkwjyu",
                                                            "author": "trakums",
                                                            "score": 1,
                                                            "created_utc": 1638875039.0,
                                                            "response": "One other guy said that the main goal is to become the world reserve currency.  \nYou can build everything on top of that. For example fast decentralized side-chains like SmartBCH with a very cheap transactions and smart contracts. \n\nIf you fail the goal then you have a cryptocurrency not the cryptocurrency.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "hnfjr5t",
                                    "author": "ShadowOfHarbringer",
                                    "score": 2,
                                    "created_utc": 1638773227.0,
                                    "response": "> heavily increase the chance for it to become the world reserve currency\n\nBTC cannot ever be a world reserve currency because it is too expensive and unreliable.\n\nYou cannot even send it without problem.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hniifpn",
                                            "author": "demkanika",
                                            "score": 3,
                                            "created_utc": 1638827902.0,
                                            "response": "If that becomes a world reserve currency USD value would get down.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "hnfwdgu",
                                            "author": "trakums",
                                            "score": -1,
                                            "created_utc": 1638783369.0,
                                            "response": ">You cannot even send it without problem\n\nI can. This makes your sentence false. I have done it many times without a single problem. Once I had to bump a fee, but I don't see that as a problem. I will not buy coffee with Bitcoin block-chain transaction in the future. There will be a side-chain that fits my needs (my daily needs will be \"fast\", \"with cheap transactions\" and \"with attached VISA debit card\"). I think there will be a side-chain that fits your needs too. There will be many: decentralized, smart, anonymous... \n\nI do believe in side-chains. I even believe that SmartBCH will become decentralized.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hng16xv",
                                                    "author": "ShadowOfHarbringer",
                                                    "score": 2,
                                                    "created_utc": 1638787559.0,
                                                    "response": "> I can. This makes your sentence false. \n\nIf $50-$200 fee from time to time is not \"a problem\" for you, then OK, this is not a problem, subjectively.\n\nI am not poor, and it is a serious problem.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "hngkved",
                                                            "author": "trakums",
                                                            "score": 0,
                                                            "created_utc": 1638800054.0,
                                                            "response": "I am poor, but the average fee has never been a problem for me. When I bumped that fee (from 2$ to 5$) the average fee was about 50$. It was confirmed in the next block. And when my cold wallet will be on some decentralized side-chain I will not care about L1 transaction costs. I will be able to do a direct cheap cross-chain swap to my hot wallet VISA side-chain. All 100% verifiably (Like SmartBCH) backed by Bitcoin or I am not touching it. Imagine a cross-chain swap from SmartBCH to VISABCH without touching BCH.  \n\nImpossible? \n\nP.S.  \nAre you down-voting me? May I know why?",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "hni2bnr",
                            "author": "bfbntrnes",
                            "score": 1,
                            "created_utc": 1638821697.0,
                            "response": "The governments first instrument is it's citizens itself change my mind!",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hnepy8x",
                            "author": "Choice-Business44",
                            "score": 1,
                            "created_utc": 1638757482.0,
                            "response": "Isn’t this worse for bch adoption given that crypto becoming widely popular and accepted makes a flippening more easy once crypto is actually used for more transactions vs this which means longer for companies to accept crypto especially bch",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hnevo0g",
                                    "author": "i_have_chosen_a_name",
                                    "score": 1,
                                    "created_utc": 1638760057.0,
                                    "response": "No, not worse",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hngtbwz",
                                            "author": "Raakaar",
                                            "score": 1,
                                            "created_utc": 1638803899.0,
                                            "response": "Yet the worse is left unseen still. More to go just a beginning.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "hnijobf",
                                    "author": "belfastsilver",
                                    "score": 0,
                                    "created_utc": 1638828403.0,
                                    "response": "Shits are going down what's just happening around! Can't figure that out!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "hnfiek6",
                            "author": "supergrega",
                            "score": 1,
                            "created_utc": 1638772303.0,
                            "response": "Why BCH?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hnfjt6g",
                                    "author": "ShadowOfHarbringer",
                                    "score": 5,
                                    "created_utc": 1638773268.0,
                                    "response": "Because BCH is BTC that just works like Satoshi intended.\n\nBCH is Bitcoin since 2009.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hnfkckf",
                                            "author": "supergrega",
                                            "score": 2,
                                            "created_utc": 1638773653.0,
                                            "response": "That's a really vague answer. What about hundreds of other projects? Absolutely none of them fit the bill?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hnfkjiv",
                                                    "author": "ShadowOfHarbringer",
                                                    "score": 3,
                                                    "created_utc": 1638773791.0,
                                                    "response": ">  Absolutely none of them fit the bill?\n\n- 99.9% of crypto projects, except like 3-5 is either joke, failure or a scam\n- None of these projects are Bitcoin\n- BCH is the most technoogically advanced form of money. No other PoW coin has such technological advancements and no other PoW coin has proven on-chain scaling.\n\nSo yeah, absolutely none of them fit the bill. Crypto has became a get-rich-quick joke. The TOP#20 is occupied **exclusively** by broken coins, speculation coins, joke coins and scam coins.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "hnfz2tt",
                                                            "author": "smgabf",
                                                            "score": 3,
                                                            "created_utc": 1638785747.0,
                                                            "response": "True though just was trying to find such type of answer. Great!",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "hnfksdu",
                                                            "author": "supergrega",
                                                            "score": 1,
                                                            "created_utc": 1638773969.0,
                                                            "response": "What are those technological advancements compared to others?\n\nAlso, op said govs are going to ban everything but BTC so wouldn't XMR be a better workaround? How are we going to use BCH or any other non-privacy coin if it's banned?",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "hnfltxj",
                                                                    "author": "ShadowOfHarbringer",
                                                                    "score": 3,
                                                                    "created_utc": 1638774732.0,
                                                                    "response": "> What are those technological advancements compared to others?\n\nDamn, there is so many of them I am going to forget some for sure, but let's try:\n\n- 256MB blocks on testnet right now, on a damn **Raspberry Pi**\n- Non-custodial, on-chain escrows built-in (OP_CHECKDATASIG)\n- Working 0-conf, instant transactions + upgrade: Double Spend Proofs. Safe accepting of payments for merchants.\n- Adjustable difficulty adjustement (EDA) which smoothes out difficulty spikes causing confirmations to be more effective\n- CashFusion, near monero-level privacy for your money\n- Superior decentralization: 5+ developer groups, 5+ independent full nodes \n- < $0.01 fees for transactions\n- SmartBCH: BCH Sidechain that brings a highly-scalable clone of Ethereum (fully compatible) to BCH and allows for 1:1 smart contracts on BCH\n\nAlso, in progress:\n\n- GROUP tokens (2022): Native, scalable, fast tokens on-chain built on BCH\n- Native Introspection (2022 ?): Powerful smart contract tool on-chain on BCH\n- Zero Confirmation Escrows (2022-2023): Brings totally secure instant 0-conf transactions on BCH network via clever \"self-contained\" escrow of sort. Absolutely **ingenious** invention, previously thought to be completely impossible to do.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "hnk68dk",
                                                                            "author": "fek41mm",
                                                                            "score": 3,
                                                                            "created_utc": 1638854725.0,
                                                                            "response": "Waoo man.. greatly  listed out i suppose many will get some amount of help from the one you listed down.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        },
                                                                        {
                                                                            "id": "hnfmj1w",
                                                                            "author": "supergrega",
                                                                            "score": 3,
                                                                            "created_utc": 1638775257.0,
                                                                            "response": "Damn, thanks for the writup man. I'll do a deep dive and compare to some of my other holdings.\n\nOne last question if I may: what does \"near monero level of privacy\" mean? It's either private or it isn't, I'm not taking any chances if govs start breathing down my neck.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "hnfn025",
                                                                                    "author": "ShadowOfHarbringer",
                                                                                    "score": 3,
                                                                                    "created_utc": 1638775620.0,
                                                                                    "response": ">  It's either private or it isn't\n\nIt is private if you kind of know what you are doing. It is not a total-black-box privacy like in Monero. You need to take some care.\n\nFor example, \n\n- You cannot mix fused and unfused coins\n- You cannot send fused coins from multiple fused addresses into a single address, especially a doxxed one. \n- You cannot use fused coins to pay for things where you put in your real name into some form, because obviously coins in your wallet will be then tied to you\n\nIf you don't know what you are doing, buying drugs will probably be safer with Monero.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "hnkem5u",
                                                                                            "author": "gmzfabien",
                                                                                            "score": 6,
                                                                                            "created_utc": 1638860166.0,
                                                                                            "response": "Correct buddy in this field of trading and currencies we all need to take steps carefully.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        },
                                                                                        {
                                                                                            "id": "hnfpf0a",
                                                                                            "author": "supergrega",
                                                                                            "score": 2,
                                                                                            "created_utc": 1638777496.0,
                                                                                            "response": "Interesting, though not nearly private enough for your mainstream user then. I know people who struggle creating their own wallet.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "id": "hnkgc6i",
                                                                                    "author": "12usbeorn12",
                                                                                    "score": 2,
                                                                                    "created_utc": 1638861446.0,
                                                                                    "response": "Seriously finding the writeup i was also thankful at least someone took the initiative to highlight.",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "id": "hnhxruk",
                                                                    "author": "hranur",
                                                                    "score": 1,
                                                                    "created_utc": 1638819912.0,
                                                                    "response": "This is what actually people want advancement in technology! The faster it works the more the user's gets attracted.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "hnfm07c",
                                                            "author": "ftball21",
                                                            "score": 1,
                                                            "created_utc": 1638774862.0,
                                                            "response": "Can you name a few promising projects on bch?\n\nI’m pretty deep in crypto and bch seems to be a niche techie blockchain. Might be what satoshi *intended* but that doesn’t mean it’s what the world needs.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "hnfmdh3",
                                                                    "author": "ShadowOfHarbringer",
                                                                    "score": 3,
                                                                    "created_utc": 1638775139.0,
                                                                    "response": "> Can you name a few promising projects on bch?\n\nI am not sure what do you mean by \"promising\" exactly, but these should qualify, probably:\n\n- [SmartBCH](https://smartbch.org/) Ecosystem: ETH smart contracts & tokens on BCH\n- [Viegage](https://viegage.cash/): House mortgage system working on BCH\n\nThere are like tens more of course, I don't know them all.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "hnkarae",
                                                                            "author": "cjoffsca",
                                                                            "score": 3,
                                                                            "created_utc": 1638857499.0,
                                                                            "response": "Rightly suggested yes no one is promising in this market but yes there are certain companies or sites you can lay your trust and investment into.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "id": "hnhu7vg",
                                                                    "author": "delsolvx",
                                                                    "score": 1,
                                                                    "created_utc": 1638818516.0,
                                                                    "response": "In this market you may not find anyone who is not promising but one the other hand it also need to be remember that while getting into to investing fund you need to cross check as many times so that you don't fall in fake talks.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "hnjpvs1",
                                                    "author": "wuxiaoxue",
                                                    "score": 3,
                                                    "created_utc": 1638846694.0,
                                                    "response": "Yes none of them fit into the bill and with time you see crypto is in such hike.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "hng1shz",
                                    "author": "scmdvr",
                                    "score": 1,
                                    "created_utc": 1638788060.0,
                                    "response": "Many reason for why people are just up with BCH, majority though.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "hnfrkzc",
                            "author": "Ronoh",
                            "score": 1,
                            "created_utc": 1638779262.0,
                            "response": "Governments? Where do you see the hand of the governments behind Tether?\n\nAny proof?\n\nWhat we have proof is that it is Bitfinex who is behind and that the whales are getting fatter. Also BTC is crippled, LN is not taking off, and fees are way too high. \n\nThe way forward is with decentralised exchanges.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hsu8k6s",
                            "author": "mygurl100",
                            "score": 1,
                            "created_utc": 1642294508.0,
                            "response": "Why BCH and not BTC?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hnfw1pd",
                    "author": "rusmir_123",
                    "score": 3,
                    "created_utc": 1638783088.0,
                    "response": "Looks like Bitcoin is going to crash deadly in the coming days!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hnhasa6",
                    "author": "opcode_network",
                    "score": 3,
                    "created_utc": 1638810918.0,
                    "response": "They will attempt it but they can't regulate p2p money to \"death\".\n\nmost of the current projects will fade into irrelevance, that's certain.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hniiqgg",
                    "author": "hrterfvbds",
                    "score": 3,
                    "created_utc": 1638828025.0,
                    "response": "You guys act like this is new. Tether fud has been around longer than china fud.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hnfiect",
                    "author": "schweertob",
                    "score": 6,
                    "created_utc": 1638772299.0,
                    "response": "Can’t believe so many ignore Tether as a monumental risk ?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hne1fo8",
                    "author": "ChaosElephant",
                    "score": 2,
                    "created_utc": 1638746870.0,
                    "response": "https://becash.website/realthreat#realthreat",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hne7fto",
                            "author": "1BitcoinWebsite",
                            "score": 2,
                            "created_utc": 1638749350.0,
                            "response": "Hi!\n\n\rCan you put my website on it?\n\nhttps://www.1bitcoincash.com/",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hne8wy9",
                                    "author": "ChaosElephant",
                                    "score": 3,
                                    "created_utc": 1638749980.0,
                                    "response": "Done. (order of resources is random each page load)",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hne28ye",
                    "author": "darkbluebrilliance",
                    "score": 2,
                    "created_utc": 1638747204.0,
                    "response": "Is that your website?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hne6ctw",
                            "author": "ChaosElephant",
                            "score": 6,
                            "created_utc": 1638748896.0,
                            "response": "It is. Check out [bchman!](https://becash.website/bchman) (work in progress)\n\nSuggestions are very welcome.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hneisap",
                                    "author": "user4morethan2mins",
                                    "score": 3,
                                    "created_utc": 1638754273.0,
                                    "response": "u/chaintip",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hnej4pw",
                                            "author": "chaintip",
                                            "score": 3,
                                            "created_utc": 1638754428.0,
                                            "response": "***\nu/ChaosElephant, you've [been sent](https://www.blockchain.com/bch/address/bitcoincash:qrelay2j5r0rpawpkgx296huf9xystuaw5xlddy80q) `0.00628828 BCH` | `~2.81 USD` by u/user4morethan2mins\nvia [chaintip](http://www.chaintip.org).\n***",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "hnejh7y",
                                            "author": "ChaosElephant",
                                            "score": 2,
                                            "created_utc": 1638754581.0,
                                            "response": "Thank you! I'll tip it forward 🙏",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "hnfyw6u",
                                    "author": "ThomasZander",
                                    "score": 2,
                                    "created_utc": 1638785587.0,
                                    "response": "Spent some time browsing the website, I love it. Its very engaging.\n\nJust one suggestion, would you be able to add the flowee.org website in the resources section?\n\nThanks for the website!",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hnhy8ly",
                                            "author": "ChaosElephant",
                                            "score": 1,
                                            "created_utc": 1638820097.0,
                                            "response": "Thank you! That means a lot for me coming from you. flowee.org has been on it from the beginning (the order gets randomised each page refresh though). If you'd like me to use a different logo, please let me know.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hnky60c",
                                                    "author": "ThomasZander",
                                                    "score": 2,
                                                    "created_utc": 1638876289.0,
                                                    "response": "Oh, I just found it. It looks awesome, thank you!\n\n\nhttps://twitter.com/FloweeTheHub/status/1468179563201110019",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hnfk3t2",
                    "author": "legrabb90",
                    "score": 2,
                    "created_utc": 1638773480.0,
                    "response": "It's always been this way, creating money out of thin air, and it won't change, but the miracle of bitcoin to the rescue 🤣 If you only knew how politics works then your eyes might see clearer, but best being ignorant , not aimed at the author 🤣.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hng29pw",
                    "author": "rusik72",
                    "score": 2,
                    "created_utc": 1638788453.0,
                    "response": "i mean since it’s backed by nothing may as well keep printing y’know? let’s ride the gravy train! it’ll be all the same when the party ends.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hnggw07",
                    "author": "Zealousideal_Year551",
                    "score": 2,
                    "created_utc": 1638798040.0,
                    "response": "US gov condones Tether. They know this shit exists and love the idea its literally got the entire crypto movement in its grip",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hnhavox",
                    "author": "coyotemachines",
                    "score": 2,
                    "created_utc": 1638810954.0,
                    "response": "BREAKING: 1 Billion USDT was just printed out of thin air by Tether to artificially prop up the markets.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hnfrvpo",
                    "author": "L_Tryptophan",
                    "score": 2,
                    "created_utc": 1638779519.0,
                    "response": "You guys act like this is new. Tether fud has been around longer than china fud. It's priced in already and most people afraid of tether already sold. It is comical at this point.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hnjyzbk",
                            "author": "Vadim189",
                            "score": 3,
                            "created_utc": 1638850807.0,
                            "response": "I am just doubtful how the market is going to turn up.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hngh18o",
                            "author": "Zealousideal_Year551",
                            "score": 2,
                            "created_utc": 1638798117.0,
                            "response": "Priced in lmao. Tether decides the price",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hne5e7r",
                    "author": "Zealousideal_Year551",
                    "score": 2,
                    "created_utc": 1638748489.0,
                    "response": "Buying BTC is buying an inflated useless shitcoin. Why the fuck would you pay $50k for something useless that some scumbag at Tether corp printed 10k USDT for free to get. You’re giving Tether corp your hard-earned money by buying BTC.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hnfuplm",
                    "author": "Herbalist2323",
                    "score": 1,
                    "created_utc": 1638781928.0,
                    "response": "Hi, u/ChaosElephant there's a 1 million bounty for Tether info, you seem very smart and well researched in Tether, as your expertly crafted quote shows, you should claim it: [https://hindenburgresearch.com/tether/](https://hindenburgresearch.com/tether/) \n\nImagine what a great Bitcoin Cash website you could make. Or move out of your parents basement.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hnesc35",
                    "author": "4565457846",
                    "score": 1,
                    "created_utc": 1638758549.0,
                    "response": "So what happens when Tether crashes the market? What inevitably rises out of the ashes? Government controlled stable coins? Bitcoin Cash actually being recognized as Bitcoin again?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hnf1xs1",
                    "author": "Napalm_rus",
                    "score": 1,
                    "created_utc": 1638762904.0,
                    "response": "US Govt : « We can print money whenever needed »\n\nTether : Hold my beer.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hnf7cm7",
                    "author": "kilik821",
                    "score": 1,
                    "created_utc": 1638765650.0,
                    "response": "Tether is useful to receive a salary fixed to USD then immediately sell for real USD (to interact with legacy things) or other cryptos. I cannot imagine any reason to hold Tether.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hnfozjf",
                    "author": "iniwuqe",
                    "score": 1,
                    "created_utc": 1638777154.0,
                    "response": "Tether will break the Hyperbolic bubble of BTC. Out of thin air they reproduce some tether.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hnfz7qf",
                    "author": "kingofthejaffacakes",
                    "score": 1,
                    "created_utc": 1638785862.0,
                    "response": "I'm no fan of tether, but do you seriously think tether's collapse will result in BCH price going up measured in BTC?\n\nI've still not really understood the logic for tether collapse doing anything but increasing the price of everything else. There will be a run from tether to anything perceived as valuable.  That will include BTC and BCH.\n\nI don't trust tether. I would never hold it in any trade.  The more people who do the same, the better.\n\nThe people who are gonna get burned are the lunatics who hold USDT, and anyone who lent tether money.  So don't do either of those things.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hng0azw",
                            "author": "ChaosElephant",
                            "score": 1,
                            "created_utc": 1638786799.0,
                            "response": ">I'm no fan of tether, but do you seriously think tether's collapse will result in BCH price going up measured in BTC?\n\nno.\n\n>I've still not really understood the logic for tether collapse doing anything but increasing the price of everything else. There will be a run from tether to anything perceived as valuable. That will include BTC and BCH. \n\nIt'll probably all crash.\n\n>I don't trust tether. I would never hold it in any trade. The more people who do the same, the better.\n>The people who are gonna get burned are the lunatics who hold USDT, and anyone who lent tether money. So don't do either of those things.\n\nDon't use exchanges except when absolutely necessary.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hng6q27",
                    "author": "265",
                    "score": 1,
                    "created_utc": 1638791885.0,
                    "response": "I still don't believe tether collapse = crypto collapse. USDC is >50% of USDT. UST and DAI are about to flip BCH, and you guys are constantly scaring BCH holders with tether everyday. I wonder why BCH is losing market share.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hngpcfk",
                    "author": "alanthinker",
                    "score": 1,
                    "created_utc": 1638802148.0,
                    "response": "We the people give money it’s value. If we value Tether, then we f-ing value Tether. iT’s NoT bAcKeD bY aNyThInG. As opposed to what? The dollar? The peso? The euro? It’s all fake dude. We make money what we want to make money.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hngy6d7",
                    "author": "autoahven",
                    "score": 1,
                    "created_utc": 1638805912.0,
                    "response": "Can someone enlighten me why I can't just create my own token, pick a price (match to stable coin) and pump whatever I want? Boom, I'm a whale now. Game completed?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hnhlqzj",
                    "author": "promise8787",
                    "score": 1,
                    "created_utc": 1638815193.0,
                    "response": "Serious question. How do you know what they just printed isn't backed by real money?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hnhvb0s",
                    "author": "teamo238",
                    "score": 1,
                    "created_utc": 1638818943.0,
                    "response": "It's priced in already and most people afraid of tether already sold. It is comical at this point.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hniir01",
                    "author": "Standard-Ad-7750",
                    "score": 1,
                    "created_utc": 1638828032.0,
                    "response": "🥲",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uwcgyj",
            "title": "I think it’s about more than just Store of Value and Means of Exchange",
            "url": "https://www.reddit.com/r/btc/comments/uwcgyj/i_think_its_about_more_than_just_store_of_value/",
            "author": "Sugarbird676",
            "created_utc": 1653345863.0,
            "score": 13,
            "num_comments": 27,
            "subreddit": "btc",
            "selftext": "You will often see the debate about bitcoin being a store of value or a means of exchange, and which of those needs to come first, or which is more fundamental. But MoE and SoV are just qualities that sound money needs to have. They do not address competition between currencies.\n\nI think the fallacy is the idea that you can successfully compete with the dollar by being “better” than the dollar in some way. But fiat currencies don’t compete on value or quality. Fiat currencies have value because citizens are forced to pay taxes with fiat, and this incentivized (forces) them to trade things of value for fiat dollars.\n\nSo IMO, any crypto has to have a use case that cannot be performed with fiat online. (I think for BCH, this is tipping.) \n\nIf you try to compete by being better than fiat on its own turf, you run into the “bad money drives good money off the market” problem.\n\nOne more thing- people often make the argument, “Why would you spend bitcoin when it could 10x next year?” But in the next breath, they say, “..and why would someone accept it when it might plunge?” I think the issue is basically that volatility adds an element of speculation to normal buying and selling. I actually don’t see that as a real problem- people will choose whatever is optimal for them, and the trade can still happen.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9qub9c",
                    "author": "phro",
                    "score": 10,
                    "created_utc": 1653349404.0,
                    "response": "No such thing as store of value without real demand. Nobody is storing future buyers. Value is only what someone else is willing to exchange for it. Even USD doesn't have store of value. Your dollars are worth less every single year.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9v1h3m",
                            "author": "kijhnedc",
                            "score": 1,
                            "created_utc": 1653430474.0,
                            "response": "In my opinion value is something which is directly correlated with the utility somthing has so There's that.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9wxaun",
                                    "author": "ShadowOrson",
                                    "score": 2,
                                    "created_utc": 1653469623.0,
                                    "response": "hey u/MobTwo ,the comment I am replying to I suspect is bot/ai.\n\nAlso within this post are:\n\nu/chega33\n&\nu/pedro_56fr",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9wy68y",
                                            "author": "MobTwo",
                                            "score": 2,
                                            "created_utc": 1653470422.0,
                                            "response": "Thanks, all reported bots removed.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9s7259",
                    "author": "jessquit",
                    "score": 4,
                    "created_utc": 1653378445.0,
                    "response": ">So IMO, any crypto has to have a use case that cannot be performed with fiat online.\n\n**Only because you're approaching this with a first world perspective as someone with access to stable modern banking and a top-tier fiat system.**\n\nMaybe a billion people lack access to the kind of banking that allows them to use fiat online -- or of they have access, the fiat that is available in their country is heavily inflationary or subject to confiscation.\n\nGuys it's been ten years plus why are we still not grasping the fact that first world adoption is not where it's at?\n\n>If you try to compete by being better than fiat on its own turf, you run into the “bad money drives good money off the market” problem.\n\nGresham's law is not applicable in this case. Gresham's law deals specifically with the case of  two forms of money with the same fiat value, say, if you made a $1 coin out of gold, and another equal weight $1 coin, but out of silver. Everyone would spend the silver dollar and hoard the gold dollar.\n\nThat's how Gresham's law works. It is not applicable in the case of, for example, a $1 coin vs a 1€ coin where the two face values are not the same.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9u4z72",
                            "author": "Sugarbird676",
                            "score": 0,
                            "created_utc": 1653416619.0,
                            "response": "These are interesting points. I think you’re wrong about Gresham’s law not applying to crypto. Five dollars can be represented with x number of crypto coin. But I know you don’t regard crypto currencies as “foreign” currencies, so maybe that’s the heart of that disagreement? The silver coin vs debased coins are no different than a crypto vs fiat electronic payment. The point is, when you have a choice, you will tend to spend the one most people value less.\n\nThe unbanked idea is interesting to me, but I see two problems with that:\n1) Am I to exclude myself from BCH, just because I already have a “top tier banking system” which is currently debasing my money and trying to spy on me.\n\n2) I think focusing on the unbanked still proves my point. Your “new money” has to be able to do something existing money can’t do. If fiat is not accommodating people in Africa, then bitcoin can complete, because it can be spread peer to peer in a way otherwise not accessible.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9r23t7",
                    "author": "mk112ning",
                    "score": 2,
                    "created_utc": 1653353266.0,
                    "response": "I think the US dollar is more than just a name or a number, but a system, in that sense, BCH is a very good add-on part to it. It opens up new investment choices, bring more power to individual and increases efficiency(and security perhaps) in almost every way.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9t7olq",
                            "author": "chega33",
                            "score": 2,
                            "created_utc": 1653402823.0,
                            "response": "Bch is just amazing and it adds a lot of value to the society. That's the best thing about it man.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9rhhic",
                    "author": "knowbodynows",
                    "score": 2,
                    "created_utc": 1653360727.0,
                    "response": "That last thought is interesting. I'm sure there are currently functioning examples of this in many places especially if you include commodities. But just as the simplest example, any border region especially between three countries- they usually accept multiple currencies, hand to hand forex from week to week.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9tvdqj",
                            "author": "lazman10",
                            "score": 1,
                            "created_utc": 1653412646.0,
                            "response": "All you gotta do is to look around you and you'll see the use cases that it has man.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9rj4vs",
                    "author": "knowbodynows",
                    "score": 2,
                    "created_utc": 1653361556.0,
                    "response": "> So IMO, any crypto has to have a use case that cannot be performed with fiat online. (I think for BCH, this is tipping.)\n\nI agree. And there are plenty more extra-fiat use cases beyond tipping.\n\n- microtransactions - charge in satoshis per kb or sats/kb/sec or sats/ml, mg, mw, km, etc, even off grid.\n- trustless prize awards \n- timestamping\n- **using your keys for frictionless transparent logins**. I'm mystified why this isn't a thing yet, even before 2009.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9u5cn9",
                            "author": "Sugarbird676",
                            "score": 1,
                            "created_utc": 1653416775.0,
                            "response": "Moving funds between different countries with different currencies is another prime use case which seems like it has room to grow",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9qujjz",
                    "author": "ShadowOrson",
                    "score": 1,
                    "created_utc": 1653349519.0,
                    "response": "What are you hoping to accomplish with this post?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9r183p",
                            "author": "Sugarbird676",
                            "score": 3,
                            "created_utc": 1653352842.0,
                            "response": "A conversion about the nature of money and what makes a currency competitive with another.\n\nWhat are you hoping to add with your comment?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9r1qkh",
                                    "author": "ShadowOrson",
                                    "score": -1,
                                    "created_utc": 1653353090.0,
                                    "response": "> What are you hoping to add with your comment?\n\nAn understanding of what you hoped to accomplish by your post, since you failed to provide that information in your post.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9r8tia",
                                            "author": "Sugarbird676",
                                            "score": 3,
                                            "created_utc": 1653356498.0,
                                            "response": "Sorry about my snark. I was actually thinking about the differences between Monero, BCH, and BTC. I think BTC is not useful for exchange, but BCH is not valued by most people. I think people use Monero for the same reason they pay taxes in dollars- necessity.\n\nI don’t think having a million merchants add BitPay actually increases demand for BCH. If each purchase gets immediately converted to dollars, it’s basically just more sell pressure.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9rz6iu",
                                                    "author": "ShadowOrson",
                                                    "score": 2,
                                                    "created_utc": 1653371809.0,
                                                    "response": "You're ok being snarky. I know that my question had included portions of honest inquiry and sarcasm.\n\nI agree, to some extent, that merchants using Bitpay does not really equate to increase in demand for BCH. But, I am also aware that it better than nothing. I chose not to use Bitpay though. I feel a bit hypocritical when I purchase giftcards with my various cryptocurrencies instead of being able to use my cryptocurrencies directly at merchants. Bitpay is effectively just a bank, converting one currency to another.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9shrgz",
                    "author": "BewareOfShills",
                    "score": 1,
                    "created_utc": 1653388194.0,
                    "response": "How about:\n\n- not inflatable\n- not controlled by small group of powerful people\n- immutable \n- always available\n- full control of your money\n- no KYC\n- no stupid bank I have to deal with or Paypal freezing my account.\n\nAnd for early adopter\n\n- nice gains\n\nI think these are more than enough features that make me wanna use it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9t0uen",
                    "author": "pedro_56fr",
                    "score": 1,
                    "created_utc": 1653399720.0,
                    "response": "We don't even know yet for what things btc can be used, don't know all of them.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}