{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uyl6qv",
            "title": "Does store of value need utility?",
            "url": "https://www.reddit.com/r/btc/comments/uyl6qv/does_store_of_value_need_utility/",
            "author": "Ok_Aerie3546",
            "created_utc": 1653609761.0,
            "score": 13,
            "num_comments": 67,
            "subreddit": "btc",
            "selftext": "I had fun last time I posted a bitcoin maxi ama. The people here actually gave good points, were understanding and just a good experience overall.\n\nSo I want to discuss the title with you guys today. Other communities are very closed minded or just end up making snide remarks.\n\nIll set up the discussion as I understand it, feel free to give me your points.\n\nLets pick a few non sovereign store of values that have held their value for long periods of time (so not counting bubbles like beanie babies, tulips and nfts).\n\nGold, silver, diamonds, pearls, corals, rolexes, vintage cars, memorabilia, pokemon cards.\n\nNow out of these only gold and silver became money and the rest just became store of values and some even stopped being that.\n\nIll give examples\n\n- Silver, during industrial revolution had shot up in demand. A lot of applications needed silver. Much more than gold. This caused industries to invest heavily in silver mining and considerably reduced the scarcity of silver. Since then silver has been devaluing against gold.\n\n- Diamonds and pearls lost their scarcity when humans figured out how to manufacture/ culture them. The diamond industry formed a cartel to maintain scarcity of real and artificial diamonds. This let diamonds to stay expensive and the cartel to profit. Pearls have been falling in demand and price this whole time.\n\n- rolexes, vintage cards, art and pokemon cards are the most \"security like\". They need to be verified by a third party and are neither accessible nor do they have a liquid market. But still they go up in price just for their scarcity.\n\nGold has continued to be the sov of choice due to its global supply, fungibility, liquidity, etc.\n\nNow as I see it there are two types of buyers in these markets:\n\n- Industrial buyers: These people buy gold to use it in their products. The gold in these products rarely ever comes back on the market. This includes electronics, lab equipment, chemical industries, decorative things like gold foil.\n\n- Exchanges: These are the people who buy gold only to sell to other people. They can make the gold into jewelry, coins, bars only to sell them at different premiums. They also buy peoples jewelry, coins and bars at different discounts from people. These are the coinbases of the gold world.\n\nNow out of all the gold that exists in the world,\n\n- 10 percent gold is in all our devices. Inside these devices the gold is worth more than regular gold. Example: even if an iphone has gold in it, you are better off selling the iphone than extracting the gold to sell.\n\n- 90 percent. This is what I call the hoarders. They buy gold in various forms and then hoarde it for life. They hold this to either display their wealth or to protect themselves from a doomsday scenario. We also have central banks in this group as they only use it for settlements and nothing productive. The regular population are purely hoarders and never sell this gold for more than what its worth in gold.\n\nThe industrial buyers are essentially short gold, as if they are able to source gold cheap, it would increase their profit margins. Example: an iphones price doesnt change because gold got cheaper, so just the profit margins improve.\n\nThe other buyers and hoarders are essentially long gold. Jewelers charge a percentage of gold value as \"making charges\" and the hoarders gain when gold price goes up.\n\nSo now my question is which faction of buyers make gold a good sov. Id argue its the holders and not the industries. Sure industries would give gold a price floor. But the holders make the number go up.\n\nSo now my conclusion is for a sov to be a sov and its number to go up, you just need a constant group of hoarders that keep addiing more and more gold to their stash. \n\nIn other words sovs dont need utility to stay sovs.\n\nBig post I know. Let me know your thoughts.",
            "stickied": false,
            "comments": [
                {
                    "id": "ia4tahf",
                    "author": "the_mighty_chewbacca",
                    "score": 7,
                    "created_utc": 1653610654.0,
                    "response": ">The people here actually gave good points, were understanding and just a good experience overall.\n\n>So I want to discuss the title with you guys today. Other communities are very closed minded or just end up making snide remarks.\n\nYou'll find, 100%, this sub is comprised of the most open minded and intelligent crypto people willing to discuss ideas.\n\nTwitter is a cesspool of toxicity and tribalism. YouTube is similar full of shilling. Other corners of the net are similarly biased.\n\nI once believed all the anti-BCH rhetoric but uncovered the harsh truths of what happened in the developer wars once I stumbled here and experienced how thoughtful people here are.\n\nI myself am not a BCH hype man or a BTC Maxi... I'm not interested in labels at all. I poke fun at the Bcashers gently but lurk these parts for the best discussion about crypto theory period. \n\nAs for your SOV question... the surprising answer is the paper gold investors access is the real market manipulator. If there were ever a run on gold or exit liquidity of the paper gold, the actual price would increase.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia52nrr",
                            "author": "Ok_Aerie3546",
                            "score": 5,
                            "created_utc": 1653615243.0,
                            "response": "Yep its enjoyable to post here. You can write longform posts, have \"actual\" conversations. \n\nr/Bitcoin has too many new people, who just want to get rich quick and r/Buttcoin lack any ability to think for themselves. \n\nr/btc are not maximalists. They just pay with bch. I watched a lot of Roger vers debates. I dont agree with him. But this whole community is like his disciples who dont shout and curse at others and feel that the right thing will win at the end.\n\nYes as for my sov question, no doubt there is manipulation. Gold will go up again. My point is that gold goes up because the hoarders buy more and more and not because industries buy more to use it.\n\nSo in a way hoarders and not utilitarians give gold its sov \"ngu\" properties.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia5ovx2",
                    "author": "Remora_101",
                    "score": 5,
                    "created_utc": 1653626968.0,
                    "response": "Without an underlying use case that gives you confidence that someone will buy it from you later at least at a bottom price defined by the use case a SoV is nothing more than a greater fool game.\n\nThe last one holding the item gets fucked.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia5ruvp",
                            "author": "Ok_Aerie3546",
                            "score": 1,
                            "created_utc": 1653628956.0,
                            "response": "So if gold went down 90 percent from 2000 dollars to 200 dollars because all the people who were buying for the sov use case sold their gold, and now the only people buying it are the industries, what confidence is left in the sov use case then.\n\nThe confidence in the sov use case only comes from the increasing demand for the same sov use case. The industrial use would only set a price floor. But a good sov would never come even remotely close to its price floor. Otherwise its not an sov anymore.\n\nAnd to mimic the same price floor mechanics in bitcoin, you just need people who constantly buy no matter the price. And theres a large bunch of those.\n\nYes its a greater fool game. But theres no last person to buy bitcoin. (As long as their is no hack or change in issuance schedule)\n\nIn bch, this is what I feel. The ability to move it cheaply isnt a use case in the first place. If you could make bch into something of greater value than bch itself, that would be a use case. Otherwise their is no difference in bch and btc. The people moving gold around the world arent employing any use case of gold. Thats just settlement.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia5sdm4",
                                    "author": "Remora_101",
                                    "score": 3,
                                    "created_utc": 1653629322.0,
                                    "response": "> The industrial use would only set a price floor. \n\nRemove the only and you are on the way to understanding the problem.\n\nBetween zero and something lies infinity.\n\n\n\n> The ability to move it cheaply isnt a use case in the first place. \n\nOk then..... Driving from A to B isn't a use case.\n\n\n\n>But theres no last person to buy bitcoin.\n\nThat's just your believe.\n\n\n\nEdit: And to add\n\n>The ability to move it cheaply isnt a use case in the first place. \n\nBitcoin built its SoV narrative on the MoE usecase. That was the goal before bockstream changed the narrative to SoV",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia5vihs",
                                            "author": "Ok_Aerie3546",
                                            "score": 0,
                                            "created_utc": 1653631560.0,
                                            "response": "Removing the only makes no difference. The price floor im talking about there is something like 200 dollars for 1 oz of gold. Gold has never been at that kind of price floor and all the things that go to that price floor go even lower because the industrial guys benefit if it goes lower.\n\nWhats the driving got to do with a store of value?\n\nOk Ill make a clearer point. A use case is something you would use the thing for even if its price was zero. The people making electronics would still use gold if it was free. Thats the use case. \n\nIf bch, btc, or any crypto was at zero whats the point of moving it. Thats the difference. People who want to pay in bch arent buyers of last resort. People who wanna use gold in their products are though.\n\nThe ability to move something is only valuable if what you are moving is consistently being worth more than before. Thats why bad fiat currencies eventually die even if they can be moved for free.\n\nFinally the only thing that matters in a sov is that more and more people are willing to exchange their time to get the sov. Humanities time is unlimited (when optimistic) and thats why I said there is no last buyer. I myself buy after myself and so do many others after themselves.\n\nYou talk as if we have a fixed population with fixed net worths. No, everyone works and earns more. Your time and energy is the real currency that you pay with and that doesnt end as long as humanity propers.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia5yhhu",
                                                    "author": "jessquit",
                                                    "score": 6,
                                                    "created_utc": 1653633825.0,
                                                    "response": ">Removing the only makes no difference. The price floor im talking about there is something like 200 dollars for 1 oz of gold. \n\nBut there is a floor. The presence of a floor establishes a worst-case value upon which confidence can be built. In the absence of a floor, the bottom is zero.\n\nI don't know where the $200 floor came from but let's say you're right. Current gold prices can drop from their current $2000 to $200 and that would represent a 90% drop. \n\nBut investors know about the floor. As the price drops, somewhere around $300 or $400 investors realize that worst case it drops 50% but there's tons of upside. The price gets supported well above $200.\n\nNow remove the floor. At $300 there's still the potential to lose everything. Where's the bottom? Price drops to $200. If the floor existed that would represent a nearly 100% chance of gains. But there's no floor. Price can still go down another 90%. Where is the floor and who catches the knife?\n\nSo the price drops to $20. People who bought the dip at $200 are now down 90%. Is this the floor? No. Price can STILL go down 90%.\n\nEtc....\n\nThe presence of a price floor doesn't imply the price will smash all the way to the floor. It implies strong resistance the closer you get to it. Without that sense of price floor, there is no bottom. It's purely a psychological experiment at that point.\n\n(I'll add that gold is a substance that's been valued almost as long as there has been civilization, it's literally woven into humanity's most ancient stories and myths. Crypto has existed for comparative seconds. Gold will also survive until after the collapse of civilization, crypto, not so much. We have to use a big grain of salt when we compare the two.)",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "ia610ou",
                                                            "author": "Ok_Aerie3546",
                                                            "score": -1,
                                                            "created_utc": 1653635926.0,
                                                            "response": "The presence of a floor has no effect on sovs. For any sov in all human history, the price never reaches this price floor except for the one scenario where people have stopped thinking of it as an sov. (Usually when scarcity is lost). This happened with pearls, corals, alot of gemstones, silver. \n\nI determined the price floor of 200 based on the consumption of gold. 10 percent of all gold produced is used for industrial purposes. So if the 90 percent cohort stop thinking of gold as an sov, only then will this price floor be met. This can only happen if we somehow lose the scarcity of gold. Maybe we figure out how to get an unlimited amount of gold from other metals through a cheap process. Something like this.\n\nUsually if a price floor is met, where the only buyers are industries, trust cant be built again. The industries control it then and they want it to be cheaper and cheaper.\n\nYes what you explained is exactly what happens in a store of value. The price always gets supported above the industrial floor. And this price is set by investors and not industries. As long as you have investors, price never reaches the floor. Thats my whole point, even if the bottom is 0, as long as there are investors who think its a store of value, the price gets supported above 0.\n\nIn any asset there is always potential to lose everything. Always. Industries dont buy because they want to make you rich. They would short the market and try to get it as cheap as possible. Look at any commodity other than monetary metals. They only go down with time, because industries want it for cheaper and cheaper.\n\nStores of value always stay in a bubble as long as the scarcity is not disturbed. If scarcity is disturbed, people move over to the next store of value.\n\nWhat im calling the industrial floor is 200 today and it can be 20 next year and 2 next. A commodity good thats not a store of value has no price floor. It only gets cheaper over time. \n\nThe stronger resistance lives and dies by the confidence of the holders thinking its a sov. Silver is a classic example of this. Industrial demand has been going up for years, but price has been going down the whole time. Silver is an altcoin to gold. People only buy it expecting a pump. But the longer you hold it the more you are better off holding gold instead.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "ia8f821",
                                                                    "author": "Remora_101",
                                                                    "score": 1,
                                                                    "created_utc": 1653681900.0,
                                                                    "response": ">The presence of a floor has no effect on sovs.\n\nFrantically defending your baseless believe. Just because it is a shared  delusion doesn't mean it isn't a delusion. Mean while real world SoVs and basically anything of value has a use case and had a use case before it became SoV.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "ia8gl4y",
                                                                            "author": "Ok_Aerie3546",
                                                                            "score": 1,
                                                                            "created_utc": 1653682522.0,
                                                                            "response": "Not really. A use case is something you would use the thing for even if it was priced at zero by the market. Like I would use free paper, free steel, free cotton, free coffee, free oil. When we found gold and made it into money, we had no use cases for it. Jewelry, statues all these were only made because gold kept its value.\n\nIf gold becomes abundant and its price drops very low, no one would wear gold jewelry. No one actually likes the appearance of gold, coz if thats all that mattered to them they would wear fake gold. People only wear gold to signal that they have gold. Thats not a use case. Thats like me buying bitcoin and showing it to others only to prove I have bitcoin.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "ia8hepw",
                                                                                    "author": "Remora_101",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653682895.0,
                                                                                    "response": "> When we found gold and made it into money, we had no use cases for it.\n\nWrong\n\n>Jewelry, statues all these were only made because gold kept its value.\n\nLol I sometimes wonder how people come to such awfully stupid conclusions?\n\n\nAs I read somewhere else, do you think the first person picking up a nugget of gold thought: \"Oh gosh darn, that is a nice piece of a Store of Value!\"\n\n\n>If gold becomes abundant and its price drops very low, no one would wear gold jewelry. No one actually likes the appearance of gold, coz if thats all that mattered to them they would wear fake gold. People only wear gold to signal that they have gold. Thats not a use case. Thats like me buying bitcoin and showing it to others only to prove I have bitcoin.\n\nBragging is actually a use case. And is done with all things expensive SoV or not. Sometimes it even means destroying something expensive meaning it cannot be seen as a SoV at all.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "ia8jgpy",
                                                                                            "author": "Ok_Aerie3546",
                                                                                            "score": 1,
                                                                                            "created_utc": 1653683836.0,
                                                                                            "response": "Oh I can tell you why I came to that conclusion. In my grandmother's time people used to wear necklaces with corals in them. They used to be expensive back then.\n\nThen people started making fake corals and there was no way to distinguish between the fake and the real ones. This made the price of corals go down significantly. And now in my generation no one even knows that corals used to be used in jewelry.\n\nThe exact same thing happened with pearls when we figured out cultured pearls. And now my generation buys real gold and wears fake pearls.\n\nThis has always been a pattern. If these things had never lost their scarcity they would still be expensive and still be used as jewelry. \n\nBragging is done with all things expensive, but with sovs people hoarde them even when they dont want to brag about them.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "ia5ywga",
                                                    "author": "jessquit",
                                                    "score": 5,
                                                    "created_utc": 1653634160.0,
                                                    "response": ">The ability to move something is only valuable if what you are moving is consistently being worth more than before.\n\nIf we can use the \"market has spoken\" language, then you're wrong. The world uses fiat to move money.  Even if we just single out USD, the SWIFT system moves 1000X more value than BTC every day. Now add in all the other ways USD is moved. Now add in the euro and renminbi and all the other fiat. It dwarfs the entire crypto market like the Earth to an ant.\n\nSo we need to refine your statement. You hit it below:\n\n> Thats why bad fiat currencies eventually die even if they can be moved for free.\n\nThe market is willing to accept constantly declining value if the decline is sufficiently stable.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "ia6l3jq",
                            "author": "localether",
                            "score": 1,
                            "created_utc": 1653652368.0,
                            "response": "May I suggest r/buttcoin as that seems more your speed.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia8ektq",
                                    "author": "Remora_101",
                                    "score": 2,
                                    "created_utc": 1653681614.0,
                                    "response": "Lol XD localether getting salty",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia8kjvk",
                                            "author": "localether",
                                            "score": 1,
                                            "created_utc": 1653684340.0,
                                            "response": "I’ll take “Things buttcoiners say” for $1000.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia8l60i",
                                                    "author": "Remora_101",
                                                    "score": 1,
                                                    "created_utc": 1653684627.0,
                                                    "response": "I love my sound p2p cash coin, why would you shove me to the buttcoiner? Just because I tell it how it is, your SoV coin is a stupid  idea and will fail.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "ia8m0an",
                                                            "author": "localether",
                                                            "score": 1,
                                                            "created_utc": 1653685025.0,
                                                            "response": "When?\n\nhttps://m.youtube.com/watch?v=39-natKpnkA\n\nBCH at $175. That is so painful... it’s a good p2p coin, but a terrible SOV.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "ia8otal",
                                                                    "author": "Remora_101",
                                                                    "score": 1,
                                                                    "created_utc": 1653686357.0,
                                                                    "response": "Enjoy it while it lasts.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "ia8u1nr",
                                                                            "author": "localether",
                                                                            "score": 1,
                                                                            "created_utc": 1653688869.0,
                                                                            "response": "$175? Yea... two digit range soon.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "ia93zvf",
                                                                                    "author": "Remora_101",
                                                                                    "score": 2,
                                                                                    "created_utc": 1653693804.0,
                                                                                    "response": "🤷‍♂️ doesn't phase me. What do BTC maxis say? Buy the dip?",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "ia95rdv",
                                                                                            "author": "localether",
                                                                                            "score": 1,
                                                                                            "created_utc": 1653694706.0,
                                                                                            "response": "BTFD or HFSP.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia58q6z",
                    "author": "mk112ning",
                    "score": 7,
                    "created_utc": 1653618180.0,
                    "response": "First of all I think by the term \"value\" you refer to monetary value.\n\nIf that is the case, monetary value is assigned, not stored. \n\nFor example, the value of 1oz gold is assigned by whatever the price mechasim we have right now, and then you can purchase a gold bar and store it in a vault. In that process you store the gold bar but you don't store the value, the value still out there changing by the price mechasim. \n\nYou can promote gold by presenting people how wonderful(or useful) gold is, and if enough people think that you have a point, they may want to purchase your gold at a higher price, in that process you created a demand for gold, and it is still to be transfered into monetary value by assigning a higher price and confirming that price by making the sale. And there is no \"store of value\" involved anywhere in that process.   \n\nIf we really want to discuss this issue we better be precise about the term. The term store of value is a made up concept by some marketing team to somewhat justify the argument \"something can be so valuable in monetary term but without the same level of value in absolute term\" It can happen in short term but there is hardly any example that stand up in time.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia5xr00",
                            "author": "jessquit",
                            "score": 6,
                            "created_utc": 1653633245.0,
                            "response": "Holy shit this is brilliant. Please create a new top level post where you say this exact same thing. You can copy/paste if you want. It needs far greater visibility. Try posting also in rcryptocurrency. This should be on a billboard.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia5z3jp",
                                    "author": "mk112ning",
                                    "score": 3,
                                    "created_utc": 1653634320.0,
                                    "response": "Thank you friend for the kind word. If you think this is a good point then the idea is yours, you can post anywhere you see necessary.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "ia5a1q3",
                            "author": "Ok_Aerie3546",
                            "score": 2,
                            "created_utc": 1653618834.0,
                            "response": "By value I mean, all the goods and services that you can get by giving up ownership of the \"valuable thing\".\n\nA store of value would be something that lets you buy more and more goods and services in the future if you store it.\n\nNow with our current fiat system, where the dollar gets you less and less goods and services in the future, a good store of value would let you get more and more dollars in the future.\n\nI dont get what you mean by value cant be stored, only assigned?\n\nOf course value is imaginary to begin with. But we can qualitatively talk about it in terms of goods and services or dollars.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia5bylp",
                                    "author": "mk112ning",
                                    "score": 2,
                                    "created_utc": 1653619795.0,
                                    "response": "I think what you refer to is a kind of investment that increases purchasing power over time. That sets up back to the old question of what it takes to be a good investment, which is a question worth debating. \n\n \"does store of value need utility\" however is a question that lead us no where.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia5dwup",
                                            "author": "Ok_Aerie3546",
                                            "score": 1,
                                            "created_utc": 1653620787.0,
                                            "response": "Not an investment in the general sense. Apple stock doesnt qualify here. Something that doesnt depend on the efforts of a few people. Something that can be considered private property and not a security.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "ia68h7z",
                                    "author": "bitmeister",
                                    "score": 2,
                                    "created_utc": 1653642603.0,
                                    "response": "> A store of value would be something that lets you buy more and more goods and services in the future if you store it.\n\nThis sounds more like an investment. A true SoV would let you trade it for the exact same assets in the future. Can I buy the exact same amount of groceries 10 years later for the same amount of gold? \n\nIf in 10 years time you can buy more groceries for the same amount gold, you still are left the question as to why. Is it getting harder to mine gold? Has there been a fall off in demand for groceries?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia6maxp",
                                            "author": "Ok_Aerie3546",
                                            "score": 1,
                                            "created_utc": 1653653101.0,
                                            "response": "Yeah exact or more. Considering advancements in technology can increase supply of other things over time.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "ia5zlpo",
                            "author": "BewareOfShills",
                            "score": 2,
                            "created_utc": 1653634734.0,
                            "response": "👍👍👍\n\nMay I copy this?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia603mi",
                                    "author": "mk112ning",
                                    "score": 1,
                                    "created_utc": 1653635142.0,
                                    "response": "Absolutely.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia609ie",
                                            "author": "BewareOfShills",
                                            "score": 1,
                                            "created_utc": 1653635281.0,
                                            "response": "Thanks",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "ia6kv70",
                            "author": "localether",
                            "score": 1,
                            "created_utc": 1653652222.0,
                            "response": "The SOV concept is quite different from what you described. With gold, the idea is that 200 years ago you could buy a nice suit with an ounce of gold. Fast forward to today and can buy a nice suit with one ounce of gold. The value is not strictly monetary... it is more about value than price.\n\nAlso, Bitcoin does in fact have utility. It can be used for P2P transactions, as well, it serves as a primary trade pair in the large crypto sector, and all crypto are priced in either USD or Satoshis. Other more subtle use cases too.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "ia6ta0f",
                            "author": "tl121",
                            "score": 1,
                            "created_utc": 1653656917.0,
                            "response": "A brief reading list:\n\nhttps://www.aier.org/article/all-value-is-subjective-and-thats-a-good-thing/\n\nhttps://www.investopedia.com/terms/s/subjective-theory-of-value.asp\n\nhttps://fee.org/articles/subjective-value/\n\nhttps://mises.org/library/subjective-value-theory",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia61bum",
                    "author": "mtrycz",
                    "score": 2,
                    "created_utc": 1653636190.0,
                    "response": "I wish to challange your premises.\n\n1. There is no such thing as \"store of value\"  per se. Just people agreeing on something to hold. No single asset or currency has stayed *constant* for longer periods of time. Everything fluctuates. Including upwards, mind you, but fluctuates nonetheless. Implication: the \"store of value\" debate is a 1st world problem.\n2. Bitcoin was never meant to be a \"store of value\". If it was, the whitepaper's title would have been \"Bitcoin: an electronic peer to peer store of value\", which is not. The defining characteristic of Bitcoin is being able to *transact*. There is no mechanism in Bitcoin for it to \"store value\" for long amounts of time - nor there can be.\n\n> So now my conclusion is for a sov to be a sov and its number to go up, you just need a constant group of hoarders that keep addiing more and more X to their stash. \n\nSorry to be blunt, but sounds like a ponzi.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia62j7z",
                            "author": "Ok_Aerie3546",
                            "score": 1,
                            "created_utc": 1653637262.0,
                            "response": "1. Yes people just agree on something to store the fruits of their time and labor in. They settle on these things based on how much effort/ time is needed to create more of that thing when demand is greater than supply over time. Thats scarcity. Call it store of value or dont. Call it store of time and energy spent. Sovs only need to be sovs over a long term. Because storing is a long term activity.\n\n2. Gold was never meant to be  \"store of value\". People found it and made it into one due to its scarcity. The defining characteristic of bitcoin is being able to achieve consensus in a distributed way. Solving byzantines general problem. And through that we figured out a way to enforce perfect scarcity in a globally distributed way. Right now even if adam back said lets keep the max limit as 22 million, hed be bashed and thrown out. Thats what we achieved with bitcoin even if it was not meant to be that way. We always had ways to transact. We never had ways to enforce scarcity.\n\nNo it doesnt sound like a ponzi, it sounds like a bubble. Money always sounds like its in a bubble. Ponzis promise returns and pay early investors with new investors money. In bitcoin no one promises returns. There is no expectation of profit from someone when I buy bitcoin. If it makes a profit, it makes a profit and if it doesnt, it doesnt.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia67g81",
                                    "author": "mtrycz",
                                    "score": 2,
                                    "created_utc": 1653641664.0,
                                    "response": "> The defining characteristic of bitcoin is being able to achieve consensus in a distributed way.\n\nWhen Satoshi solved the bizantyne generals problem, it was a great breakthrough. Still, it is only functional/instrumental to the true defining characteristic of Bitcoin, which is not \"Bitcoin: a peer to peer decentralized consensus mechanism\". Its defining characteristic is being peer to peer money and the ability to transact freely.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia653be",
                    "author": "skapaneas",
                    "score": 1,
                    "created_utc": 1653639542.0,
                    "response": "0.006 something",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia65ai1",
                            "author": "Ok_Aerie3546",
                            "score": 2,
                            "created_utc": 1653639718.0,
                            "response": "??",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia6pljx",
                    "author": "bitmeister",
                    "score": 1,
                    "created_utc": 1653654996.0,
                    "response": "> So now my question is which faction of buyers make gold a good sov. Id argue its the holders and not the industries. Sure industries would give gold a price floor. But the holders make the number go up.\n\n> So now my conclusion is for a sov to be a sov and its number to go up, you just need a constant group of hoarders that keep addiing more and more gold to their stash.\n \nI think you have a lot of moving parts conflated here. Such as what makes a good SoV with some sort of a price floor (an intrinsic or alternate use case). This is mixed with how many coins are static (horded) versus liquidity used in exchange.\n\nI see an issue in your conclusion...\n\n>  ...for a sov to be a sov and its number to go up, you just need a constant group of hoarders...\n\nAn ideal SoV, the number (value) doesn't go up and up. The SoV means that an Oz of gold should buy the same number of groceries now and 10 years from now. So it isn't a SoV that causes numbers to go up, it's really the other inflating fiat that's going down.\n\nBut you you continue with scarcity...\n\n> ... a constant group of hoarders that keep addiing more and more gold to their stash.\n\nThis is the other dimension of an ideal SoV, a fixed supply. And yes, more participants clamoring for fewer coins will cause an increase in value. But the value of the coins isn't a measure of how many are held, it's a measure of the liquid, the traded portion.\n\nAs the liquid portion shrinks, approaching zero, the prices rise exponentially. But are people willing to continue trading other real world assets for an exponentially high price. At some point the marketplace weighs the conditions and rejects the trade and an equilibrium forms. A balance forms, but it will never be stable enough to declare a SoV.\n\nLet's say there is a fixed supply and it is split between two factions; hoarders and traders. But the only distinction between a hoarder and trader is a fickle mental state. One wants to hold their stake and one is ready to sell. Effectively both are sellers, only the hoarder's price is somewhere higher than a trader's. *And because either can quickly and easily change their disposition, there is no such thing as a SoV*. \n\nNot even gold is immune. Not even if gold has other intrinsic uses that cushion its perceived asset value in the marketplace, it could become near worthless. [Case in point, what happens to gold SoV when they start mining asteroid 16 Psyche?](https://theprint.in/opinion/giant-asteroid-has-gold-worth-700-quintillion-but-it-wont-make-us-richer/260482/) There is no floor.\n\nThe question is then how much would a mining craft have to bring back to earth to cover the cost of the mission and make a profit whilst not simultaneously collapsing the market value of gold?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia6qvcu",
                            "author": "Ok_Aerie3546",
                            "score": 2,
                            "created_utc": 1653655686.0,
                            "response": "Hoarders dont sell based on a price, they only sell if they are in a bad financial situation. I still have the gold my grandmother bought for herself.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia84aow",
                                    "author": "bitmeister",
                                    "score": 1,
                                    "created_utc": 1653677016.0,
                                    "response": "Very true about hoarders. Sadly, my mother was one and it only got worse with age. I wanted to use the word hodl'er, but I used OP's term hoarder for continuity.\n\nI don't think OP meant literal hoarders, as a digital wallet with virtual assets doesn't really satisfy their addiction quite like physical gold, silver...or Christmas decorations, QVC costume jewelry, empty takeout boxes, etc.\n\n**PSA. If you ever clean up a hoarder's mess, *you must look closely through everything *!** Cleaning up my mother's place, my brother was tossing everything from the bathroom medicine cabinet. About to toss the box of Band-Aids, he gives it a second look because he likes their new dispenser box. Looks inside, sees band-aids and some wadded tissue, pulls it out, and discovers a $5K ring.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia872e6",
                                            "author": "Ok_Aerie3546",
                                            "score": 1,
                                            "created_utc": 1653678239.0,
                                            "response": "Im not talking about hoarders in general. Im talking about hoarders of a single asset, gold. They dont see it as jewelry or something beautiful. They just see it as wealth. If you go on the r/Gold sub, youll see its strikingly similar to r/Bitcoin. \n\nNothing is meant to be used as a currency. But some things are meant to be the best things to represent a person time and energy spent. Humans pick the best of these items to use as a currency, no matter its downfalls.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia8940o",
                                                    "author": "bitmeister",
                                                    "score": 1,
                                                    "created_utc": 1653679153.0,
                                                    "response": "Got it. People that are married to a single investment, sell-after-I-die types.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia6ujxn",
                    "author": "mrtest001",
                    "score": 1,
                    "created_utc": 1653657544.0,
                    "response": "In a world where nobody drives, a car that runs at 3 mpg or has flat tires can happily sit in your garage and look pretty and you hope it will be a store of value.\n\nAs soon as the world starts driving, I dont see how a useless car can have value.\n\nAs long as a 4-7 tps coin like BTC is in the top 10 coins - you can be pretty sure cryptocurrency is in its infancy.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia6uyfc",
                            "author": "Ok_Aerie3546",
                            "score": 1,
                            "created_utc": 1653657733.0,
                            "response": "Cars arent stores of value even in a world where everyone drives.\n\nVintage cars are and they usually sit in a garage and they still store value even while not being functional.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia6xrj7",
                                    "author": "mrtest001",
                                    "score": 1,
                                    "created_utc": 1653659073.0,
                                    "response": "Great example.\n\nMy point is focusing on an object whose purpose is to be a SOV - having basically no other function.\n\nVintage cars are a tiny tiny subset of cars.\nVintage cars might be analogous to the BTC coins from the 1st or 2nd mined block might be \"Vintage\" - their functional use being completely besides the point.\n\nBTC is like a car with 3mpg range - and a world where such a car is the #1 selling car might be an indicator as to the importance of driving in such a society.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia6yum6",
                                            "author": "Ok_Aerie3546",
                                            "score": 1,
                                            "created_utc": 1653659577.0,
                                            "response": "Btc isnt like a car. Cars get cheaper to make over time and have no sense of scarcity.\n\nBtc is more like gold, where even though gold is slower to move than dollars, it is still considered a store of value. Same with bitcoin. Even though it is slower to move than other cryptocurrencies, it is still considered a store of value.\n\nA broken rolex is a better store of value than a random watch.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia7a4kg",
                                                    "author": "mrtest001",
                                                    "score": 1,
                                                    "created_utc": 1653664435.0,
                                                    "response": "A broken rolex absolutely is more valuable than a random watch.\n\nBut this is not the analogy with BTC and BCH - BCH is not a random coin.\n\nIts like the rolex company decided that a rolex watch is better at SOV than being functional so they *purposefully* take out the gears that turn the hands - so now it ONLY tells you what date it is.\n\nRolexCash splits from rolex - same factory, same blue-prints, same material - identical in *every way* - except they put the gears back.\n\nSo now you have a Rolex that only tells dates and a RolexCash that works as original Rolex.\n\n(edit: in case there are NO Rolex models that tell dates, just shows I have never used a Rolex watch)",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "ia7f5wm",
                                                            "author": "Ok_Aerie3546",
                                                            "score": 1,
                                                            "created_utc": 1653666495.0,
                                                            "response": "Not same factory and workers. Same everything else. Factory and workers is like the miners.\n\nThe bch people always talk like bitcoin cant be moved at all. Even in this example. \n\nLets use rolexes again. Say there is one rolex company in the beginning. They make watches that \"show time\" and every time you transfer ownership of your rolex, they charge the sender a big fee that only keeps growing over time and give that fee to their workers.\n\nAt this point rolexes are somewhat expensive, but they show the time and the fees arent too bad.\n\nNow rolex was founded by these two brothers. Both knew everything about these companies, blueprints etc.\n\nOne of them said \"if we keep charging more and more fees a lot of people will stop using rolexes and use other things instead. So lets change our business model a little, well charge as little fees as possible to transfer ownership.\" They had an argument and split off.\n\nThis brother created rolexcash and both the brothers said to their workers, \"you can work at any company you want.\" Alot of them decided to stay at rolex and a few went to rolexcash. The rolex watches still stayed popular and gained value. While the rolexcash watches did not get popular enough. Still good watches though.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "ia8fcch",
                                                                    "author": "mrtest001",
                                                                    "score": 1,
                                                                    "created_utc": 1653681953.0,
                                                                    "response": "> Not same factory and workers. Same everything else. Factory and workers is like the miners.\n\nBTC and BCH miners can switch between chains on a dime.  Although I didn't literally mean same nuts and bolts.  I meant as in BitcoinCash is not a new coin - its \"Bitcoin\".  but with a social contract that it always wants to be low fees.\n\n> The bch people always talk like bitcoin cant be moved at all. Even in this example.\n\nWhen a coin can be moved only 7 times per second and a 100,000 people want to move it - for vast majority, the coin *effectively* cannot be moved.  Being able to move a coin means you can move it 24/365 and cheaply and always and for everyone.  \n\nInteresting twist on the example.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "ia8i5ab",
                                                                            "author": "Ok_Aerie3546",
                                                                            "score": 1,
                                                                            "created_utc": 1653683231.0,
                                                                            "response": "In the world a lot more value is stored in the form of stocks, bonds, cds, gold, art, real estate, etc.\n\nThan value being spent in the form of transactions.\n\nThere is a higher want for value to be stored than to be moved. This value is willing to pay higher fees to move itself.\n\nBut the value that wants to be spent at a lower fee is way smaller than the other cohort. And it already has other options to do so with even lower fees.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia6xhti",
                    "author": "TinosNitso",
                    "score": 1,
                    "created_utc": 1653658948.0,
                    "response": "Perhaps gold would increase its value if [GoldCash](https://ebay.com/itm/164961330561) were widely supported as currency (e.g. in El Salvador). However giving gold utility as cash could even backfire, if gov'ts decided to sell off their hoards (it only *has* value to them if it's centralized!). It makes me wonder why gold bugs never seem to support GoldCash (decentralized gold standard). They all prefer a centralized standard instead. I guess one issue is the gold-cash forces users to tip to the nearest mg (6c, or even 10mg) of gold.\n\nBitcoin, like gold, can become a centralized **S**tore **O**f **V**alue, if the block-size is too small. However both versions can co-exist, imo. Without a high enough txn volume on BCH, there's not necessarily a proof a BTC block-size increase is necessary.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia9ztmo",
                    "author": "LucSr",
                    "score": 1,
                    "created_utc": 1653710858.0,
                    "response": "Both words \"value\" and \"utility\" need clear definition for clear discussion.\n\nMy kid's graffiti might be \"value\" to me but not to others.  So, we shall agree here \"value\" means something objective not subjective preference.  As the axiom of purchasing power of ideal money that one shall boil water at the same amount of money even hundred years later, we shall agree \"value\" here is isomorphic to energy.  So, the store of value is to store energy.  Sometime the ideal money could be eatable and inherently a store of value. But when money is not eatable, it is like the token of energy quota or energy accounting.  To match the economy size, its volume shall increase or decrease if its unit purchasing power is constant, or its unit price in term of energy shall appreciate or depreciate if its volume is constant.\n\n\"utility\" could be, in your words, industry utility and I agree that money does not need to have any industry utility as I don't think ancient people knew about electricity and I know a king had a golden armor which is obviously heavy for fighting so its existence must be symbolic and signaled something (as your grandma story).  But \"utility\" could also mean some usage that is important to people. In topic about money, the obvious \"utility\" is to exchange the goods/service with other people.  Then you could recall the story of USA 1933 and the following decade that people initially hold/hide their gold but then gave in to the government at a bad price because gold is not divisible and accordingly could only handle high value transaction while people were eager to exchange bread or anything cheap-but-important for living.\n\nWhen a store-of-value cannot handle many cheap-but-important stuff, it dies or becomes an investment which is not possible to exchange to lower-value money then to exchange the desired goods/service in hostile context.\n\nI think we all agree the fiats are hostile to bitcoin.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaa2gmw",
                            "author": "Ok_Aerie3546",
                            "score": 1,
                            "created_utc": 1653712600.0,
                            "response": "I agree alot to your points. A persons time and energy is the actual currency he spends to get stuff. A sov would store a persons time and energy. If you buy an sov today, it will be redeemable in the future for the same amount of another person's time and energy. And with how technology and society advances, a future person's time and energy should give you more goods and services than todays person's time and energy.\n\nYes this is is very qualitative. But feels grounded in logic.\n\nA point about gold. People did not give their gold in return for fiat currencies. People gave their gold in return for gold backed currency. The govt also made it illegal to hold monetary gold.\n\nIf people knew that 50 years later, they would lose the redeemability of the dollar for gold, they wouldve never given their gold. But there was no precedent for fiat currencies, so they got tricked essentially.\n\nPoint of bitcoin is that it happened once, people wont let it happen again. The physicality of gold was its drawback. Peoples houses could be searched for gold. The same cant happen with bitcoin. It will be very expensive for govts this time to take it from the people.\n\nI keep my spending money in dollars and my savings money in bitcoin. I think you can compartmentalize these things easily. I dont think I would ever need to spend my bitcoin. Someone in my future generations will use it in a life or death situation or if they want to take a plunge in an exciting venture.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iaa8h9n",
                                    "author": "LucSr",
                                    "score": 1,
                                    "created_utc": 1653716983.0,
                                    "response": "> with how technology and society advances, a future person's time and energy should give you more goods and services than todays person's time and energy.\n\nThe energy will always do the same energy work.  What you say is actually the so-called energy gain factor in the energy industry where more energy is collected with the same energy input thanks to tech advance.  However one could always think \"dollar\" as another energy unit that \"one dollar\" means \"1 Twh\" without bothering the tech advance.\n\n> If people knew that 50 years later, they would lose the redeemability of the dollar for gold, they wouldve never given their gold.\n\nI guess not because they were hungry \"today\".  Don't you see \"Someone in my future generations will use it in a life or death situation\" means he/she gives up the coin at a bad price to a bad-but-usable fiat money because hunger is \"a life or death situation\"?\n\n> Point of bitcoin is that it happened once, people wont let it happen again.\n\nAre you saying you don't think governments are hostile?  or are you saying you have a deal with the governments that \"you let me be the new wealthy elite to replace the old Buffett and I agree bitcoin cannot be the money to compete against your fiat money\"?\n\nAnyway, I guess \"people wont let it happen again\" is false and I think core chain will go the same route again because core chain intentionally allows only high value transaction.  Also, the block size limit is a non-issue because block size shall be the economic result not an artificial limit. See http://np.reddit.com/r/btc/comments/tfqz5i/bitcoin_cash_transaction_capacity_should_be_a_thousand_times_larger_than_bi/i14hf0i?context=3",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iaaamkt",
                                            "author": "Ok_Aerie3546",
                                            "score": 1,
                                            "created_utc": 1653718693.0,
                                            "response": "I think you are confusing persons energy with electrical energy. A persons energy can be used along with all technological advancements of the future to do more work.\n\nCompare a farmers 1 day work in 1900 to a farmers 1 day work in 2022. Obviously the second one produces more goods and services.\n\nWhy would my future generations sell at a bad price, its too much in the future and it will be a better price than what I bought it for. Life and death situations arent hunger. We already have this behaviour with gold in our culture. Selling your mothers gold is considered a sin. If you have nothing left, only then can you sell your gold.\n\nGovts will be hostile, but people wont be tricked again to hand over their store of value. If govts call it illegal, people en masse can say they lost it in a boating accident. Its much more expensive for govts to ban and enforce bitcoin than to do the same with gold. Govts cant even take away peoples guns now. Bitcoin isnt even physical for the govt to search.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia6grfe",
                    "author": "bitmeister",
                    "score": 0,
                    "created_utc": 1653649463.0,
                    "response": "This is just a critique on the title. Take it with a grain of salt, but I thought it worth pointing out. The body of your question seems more about *SoV over time* and the attributes of a good store of value, rather than questioning for the need for utility, but the title on it's own is worth a look.\n\n> Does store of value need utility?\n\nThe title question is akin to asking, *Does potential energy need kinetic energy?* Both involve energy and measurements, but they are completely different states.\n\nLike potential energy, store of value is only measured relative to some other thing. Whereas utility is a momentary measurement, or an implied measurement, like kinetic energy. Here too, both are about value and each has a measurement, but they are distinctly different forms.\n\nThis interplay between storage and utility, because both involve a state of value, often confuse discussions on value.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uyky9r",
            "title": "Someone asked about \"USDT-SLP swap to something else\" help. can't find the post. Look here...",
            "url": "https://www.reddit.com/r/btc/comments/uyky9r/someone_asked_about_usdtslp_swap_to_something/",
            "author": "chainxor",
            "created_utc": 1653609045.0,
            "score": 13,
            "num_comments": 15,
            "subreddit": "btc",
            "selftext": "Hi someone asked about \"USDT-SLP swap to something else\" help.   \n\n\nI have just dappled with a mobile BCH wallet called ZapIt - a BCH native wallet that supports both SLP and SmartBCH. Its also has a built-in swap tool between BCH and SLP stablecoin tokens (FlexUSD, USDT and USDH).   \n\n\nAnyway, my point is - you can swap USDT-SLP to BCH or FlexUSD (SLP) in ZapIt wallet!",
            "stickied": false,
            "comments": [
                {
                    "id": "ia4s5ot",
                    "author": "MobTwo",
                    "score": 6,
                    "created_utc": 1653610100.0,
                    "response": "/u/keshav_thebest",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}