{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "upbpzn",
            "title": "For or Against: Bitcoin Cash has a better scaling strategy by gradually increasing the L1 block size as demand increases.",
            "url": "https://www.reddit.com/r/btc/comments/upbpzn/for_or_against_bitcoin_cash_has_a_better_scaling/",
            "author": "post_mortar",
            "created_utc": 1652511904.0,
            "score": 6,
            "num_comments": 108,
            "subreddit": "btc",
            "selftext": "**The Claim**\n\nFor or Against: Bitcoin Cash has a better scaling strategy by gradually increasing the L1 (layer 1) block size as demand increases. When each block is produced, a limited number of transactions will be allowed by the network. By increasing the block size along with demand, the network can guarantee that its users will have low fees, high confidence of their transaction being accepted without waiting for a block to include it, and a strong foundation to build the infrastructure of programmable money.\n\n---\n\n**The Ask**\n\nAs an experiment for myself and as a resource for others, I'd like for r/btc to support or rebuke the title statement using facts, research, and data to support your claim. All aspects of \"better\" may be considered as long as your position can be substantiated with source data, evidence, and/or research. \n\nNOTE: This is specific ONLY to the claim above (scaling BCH, not BTC or LN or anything else). If this is productive, we'll explore and document many more claims in the same fashion.\n\nI know a lot has already been said on the matter but I often see repeat questions w the same copypasta. I wonder if there's a better way to do this... (particularly to speed along a troll argument with a link). Please share all the sources, links, and interesting data you've got. I am organizing the strongest arguments for and against this statement into this public resource. Once I've finished reviewing and compiling it all down, I'll share what it looks like for opinions.\n\n(edit: also welcoming suggestions on improving the claim if it's flimsy or could be made stronger)",
            "stickied": false,
            "comments": [
                {
                    "id": "i8jz58h",
                    "author": "jessquit",
                    "score": 18,
                    "created_utc": 1652515463.0,
                    "response": "The question proceeds from a false premise, which is that there exists a true substitute to an onchain transaction.\n\nAll the scaling in the world is completely irrelevant if it requires you to sacrifice the very thing that gives Bitcoin its value in the first place.\n\nIn fact, the onchain transaction is fundamental to Bitcoin's value proposition: only an onchain transaction allows you sovereignty over your funds! \n\nOnly an onchain transaction allows you to hold a coin in a wallet whose keys you exclusively control.  Only an onchain transaction allows you to move those funds to whomever you want, whenever you want, with no need of a funds-routing intermediary - the very thing Bitcoin was invented to disintermediate.\n\nSo by definition BCH's scaling plan is \"better\" than any scaling plan that purports to \"scale\" the coin using anything other than an onchain transaction for casual payments.\n\nI reiterate: **All the scaling in the world is completely irrelevant if it requires you to sacrifice the very thing that gives Bitcoin its value in the first place: the ability to transact in hard money between any two participants with no need of a funds-routing intermediary.**\n\nOnce you understand this, you recognize that BCH's scaling strategy isn't just \"better\" it's actually the *only* strategy that actually makes any sense at all.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8k6dy5",
                    "author": "bitcoincashautist",
                    "score": 9,
                    "created_utc": 1652521978.0,
                    "response": "I liked [Mr. Toomim's](/u/jtoomim) arguments about increasing the cap to match *supply*, not the demand. Supply ought to be ahead of the demand and this will keep transactions as cheap as possible and our headroom big.\n\n>I believe that the block size limit should be based on supply, not demand. That is, the limit should be based on what the software and hardware can handle, not based on how much of the block is being used. If the actual hard/software capacity is 100 MB, and usage/demand is only 1 MB, then the limit should be 100 MB. If the hard/software capacity is 100 MB, and there’s usage/demand for 300 MB, then the limit should be 100 MB.\n\n>I understand that there’s the desire to make this no longer a constant in the code in order to prevent 2015 from happening again, but I think there are better (and simpler) ways to do that. BIP101, for example, seems like a pretty good default trajectory: it should be enough to handle exponential growth in demand, while also reflecting exponential growth in hardware capacity.\n\nhttps://bitcoincashresearch.org/t/asymmetric-moving-maxblocksize-based-on-median/197/4",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8jx4sj",
                    "author": "Pablo_Picasho",
                    "score": 3,
                    "created_utc": 1652513714.0,
                    "response": "The subreddit link in your post is wrong.\n\nBut I have a general comment about your request.\n\nYou're asking for evidence or arguments that BCH scaling is \"better\".\n\n\"Better\" is always comparative, but then you exclude comparison against \"BTC or LN or anything else\"). That doesn't make any sense.\n\nIf you want to drop all comparison, then you simply need to ask if BCH scaling strategy is sufficient to meet its goals.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uptwll",
            "title": "So what’s everyone’s opinion for this crazy ride?",
            "url": "https://www.reddit.com/r/btc/comments/uptwll/so_whats_everyones_opinion_for_this_crazy_ride/",
            "author": "Nemo-504",
            "created_utc": 1652573703.0,
            "score": 8,
            "num_comments": 20,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8natkk",
                    "author": "SomeoneElse899",
                    "score": 13,
                    "created_utc": 1652579399.0,
                    "response": "First time?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8nbvf7",
                            "author": "Nemo-504",
                            "score": 3,
                            "created_utc": 1652579925.0,
                            "response": "Hell no was just wondering everyone’s thought but the dip or wait and see I’m buying little small amounts at a time",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8mzwmy",
                    "author": "OrangeHODLr",
                    "score": 7,
                    "created_utc": 1652573768.0,
                    "response": "Buy the ticket take the ride!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8mzycy",
                            "author": "Nemo-504",
                            "score": 3,
                            "created_utc": 1652573793.0,
                            "response": "All aboard!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8n9fym",
                    "author": "CurvyGorilla202",
                    "score": 6,
                    "created_utc": 1652578683.0,
                    "response": "The next few months will continue to dip. BTC flaws exposed. Central Bank Coins issued. Mass adoption. \n\nWhen the mass then really studies the BS we’ve been fed to control the money supply even more than currently, IMO that is when we will see true P2Ps money systems gain traction.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8nuh5s",
                    "author": "EmergentCoding",
                    "score": 3,
                    "created_utc": 1652590608.0,
                    "response": "What's it matter. Go onboard another merchant to Bitcoin Cash.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8o88c3",
                    "author": "1s44c",
                    "score": 2,
                    "created_utc": 1652601281.0,
                    "response": "Business as usual.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8n099n",
                    "author": "MikeFreeland",
                    "score": 1,
                    "created_utc": 1652573948.0,
                    "response": "It’s like sleeping with your woman…don’t pull out",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ojtbm",
                    "author": "SCstacker",
                    "score": 1,
                    "created_utc": 1652611231.0,
                    "response": "Bon Ton Roulette",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}