{
    "subreddit": "btc",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "utdvo8",
            "title": "Be careful of investing in 15% or higher interest investments. Many simply invested in UST and kept the excess interest for themselves. Now they are bankrupt eg. a US company called \"Stablegains\".",
            "url": "https://old.reddit.com/r/CryptoCurrency/comments/ut4esc/stablegains_a_registered_company_in_us_was_taking/",
            "author": "big--if-true",
            "created_utc": 1652996653.0,
            "score": 21,
            "num_comments": 15,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9a2kkh",
                    "author": "Narfhole",
                    "score": 5,
                    "created_utc": 1653013261.0,
                    "response": "Like a high interest bond, the higher the %, the higher the default rate.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9acttl",
                            "author": "pyalot",
                            "score": 5,
                            "created_utc": 1653018686.0,
                            "response": "Crypto can revolutionize money. Unfortunately it cant change human nature.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i994uat",
                    "author": "big--if-true",
                    "score": 5,
                    "created_utc": 1652996669.0,
                    "response": "Source: https://old.reddit.com/r/CryptoCurrency/comments/ut4esc/stablegains_a_registered_company_in_us_was_taking/\n\nIf it sounds too good to be true , it probably is. Invest only in solid projects but DYOR and make sure you do due diligence , and make sure that it actually makes business sense.\n\nEdit if you wondered where Celsius and others like NEXO get their interest rates from, it seems it was also UST plus investing in Ethereum, so crypto exposure for your USD : https://www.theblockcrypto.com/post/146752/celsius-pulled-half-a-billion-dollars-out-of-anchor-protocol-amid-terra-chaos?utm_source=feedly&utm_medium=rss\n\nCelsius invested everyones money into Ethereum and also UST without their knowledge. ETH and UST did go down, so they likely lost a lot of the money and may be running on fractional reserves now.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9966z3",
                    "author": "Stockleezy",
                    "score": 3,
                    "created_utc": 1652997282.0,
                    "response": "Flexusd offers interest, but it's based on a whole business model that generates profits.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i99epc9",
                            "author": "ShadowOrson",
                            "score": 0,
                            "created_utc": 1653001336.0,
                            "response": "> Does “yield on yield” work for only flexUSD?\n\n> [It works for all kinds of FLEX wrapped assets, from flexBTC, flexETH, flexFLEX to any coins that CoinFLEX has repo markets in like flexLINK.](https://coinflex.com/support/4-1-1-flexusd-yield-on-yield/)\n\n\nYa, but can I wrap my flexFlex into FlexedflexFlex, tripling my interest rate?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9a61g9",
                                    "author": "dcblazin",
                                    "score": 1,
                                    "created_utc": 1653014996.0,
                                    "response": "I think you’re thinking of VeFlexFlex",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9a9jck",
                                            "author": "ShadowOrson",
                                            "score": 1,
                                            "created_utc": 1653016846.0,
                                            "response": "No.. I am obviously inquiring as to whether I can wrap my flexFlex, creating a FlexedflexFlex. Am I only allowed to wrap Flex once? Why not twice, or thrice, or more???",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "id": "ute6k4",
            "title": "“The fact that bluewallet defaults to a custodial lightning wallet has always made me hesitant to recommend it, currently users with funds in the default lightning wallet have not been able to send or receive since yesterday.” 🤦🏻‍♂️🤦🏻‍♂️",
            "url": "https://twitter.com/odell/status/1527277101413548032",
            "author": "btcxio",
            "created_utc": 1652997525.0,
            "score": 37,
            "num_comments": 62,
            "subreddit": "btc",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i99by3h",
                    "author": "Remora_101",
                    "score": 14,
                    "created_utc": 1652999985.0,
                    "response": "Nice find, Blue wallet was still a question mark on my list of (mostly) custodial LN wallets.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i99cc12",
                            "author": "Remora_101",
                            "score": 12,
                            "created_utc": 1653000171.0,
                            "response": "|+|A|B|\n|:-|:-|:-|\n|1|Wallet|Status|\n|2|Blue|custodial|\n|3|Breeze|non custodial?|\n|4|C-lightning| |\n|5|Chivo|custodial|\n|6|E-clair| |\n|7|Munn|non custodial|\n|8|myNodeBTC| |\n|9|Paxful|custodial|\n|10|Phoenix|custodial?|\n|11|RaspiBlitz| |\n|12|Simple Bitcoin Wallet| |\n|13|Strike|custodial|\n|14|Umbrel| |\n|15|Wallet of Satoshi|custodial|\n|16|Zap| |\n|17|Zeus| |\n\n^Table ^formatting ^brought ^to ^you ^by ^[ExcelToReddit](https://xl2reddit.github.io/)",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i99nmv4",
                                    "author": "hero462",
                                    "score": 6,
                                    "created_utc": 1653005883.0,
                                    "response": "MUUM defaults to custodial as well.  The first option to backup a wallet is with an email address.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9a8j85",
                                            "author": "_risho_",
                                            "score": 1,
                                            "created_utc": 1653016299.0,
                                            "response": ">MUUM defaults to custodial as well.\n\ncitation needed.\n\n>The first option to backup a wallet is with an email address.\n\nthe fuck does that have to do with it being custodial or not? also that is a either an intentional bad faith representation of what they actually do or you just have no idea what you are talking about.\n\n>Your private keys are securely encrypted with your Recovery Code. This makes your Emergency Kit harmless by itself: you can keep multiple copies, and you can even store it safely on the cloud.\n\ntaken directly from their website. there emergency kit doesn't do anything by itself.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9asrs4",
                                                    "author": "jessquit",
                                                    "score": 7,
                                                    "created_utc": 1653029799.0,
                                                    "response": "I'm absolutely not an expert on the various LN wallets but isn't muun one of those wallets that doesn't require you to have any funds in your channel? Like you can open a channel with basically nothing and still receive money? How does that magic work? You can see why people might think it's custodial.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9avczw",
                                                            "author": "YeOldDoc",
                                                            "score": 1,
                                                            "created_utc": 1653032011.0,
                                                            "response": "In order for you to receive funds via a LN channel, the other channel party needs to have funds on **their** side of the channel, not **you on your side**.\n\nThis is called inbound liquidity. There are couple options to get it.\n\n1. You open a channel with equal balance on each side (thus both parties benefit from inbound and outbound liquidity).\n2. You open a channel with higher balance on your side (providing inbound liquidity for the other party and outbound liquidity for you) and start spending on the LN via the other party (thus moving the balance and creating inbound liquidity).\n3. You open a channel with higher balance on the other side (providing inbound liquidity to you). Some provide such inbound-heavy channels for free (likely smaller channels) although you will likely pay a fee for larger ones (~0.5% of total balance).\n4. You transfer funds from your LN channel via a submarine swap to your on-chain wallet.\n\nAnother option is the LN wallet provider will cover the costs upfront and use a fee/portion of later transactions to be reimbursed (*Edit: I assume this is what muun uses for faster on-boarding, but u/dariosne should know*).",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9ax36d",
                                                                    "author": "jessquit",
                                                                    "score": 4,
                                                                    "created_utc": 1653033563.0,
                                                                    "response": "You managed to take up a lot of space not answering the question as to whether Muun is fully custodial, partly custodial, or uses a come-on approach (gives you a tiny amount of free Bitcoin in exchange for locking in high fees). Which is it? Any idea? Thanks!",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9azd38",
                                                                            "author": "aaaaaaaarrrrrgh",
                                                                            "score": 3,
                                                                            "created_utc": 1653035619.0,
                                                                            "response": ">uses a come-on approach (gives you a tiny amount of free Bitcoin\n\nThis. They don't show it, but they basically give you a small amount so you can start transacting, then deduct that when you receive money. For the user it's great, for the wallet provider potentially costly or abuse prone.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i9b4mzf",
                                                                                    "author": "jessquit",
                                                                                    "score": 5,
                                                                                    "created_utc": 1653039926.0,
                                                                                    "response": "It had never really occurred to me that on LN *both the sender and the receiver* of the funds can require a fee.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i9daf5k",
                                                                                            "author": "galagar12",
                                                                                            "score": 0,
                                                                                            "created_utc": 1653076323.0,
                                                                                            "response": "Yep, they require the fee, a very little set of people think about it man, and that's not good thing to think about dude.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "id": "i9dg9r3",
                                                                                    "author": "evirik",
                                                                                    "score": -1,
                                                                                    "created_utc": 1653078963.0,
                                                                                    "response": "Yep, it's good for the people who are looking to accept the payments.\n\nFor general people it doesn't seem like a good idea to me. It just seems like a bad idea to me man. I don't know about it.",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "id": "i9bejy2",
                                                                            "author": "YeOldDoc",
                                                                            "score": 1,
                                                                            "created_utc": 1653046837.0,
                                                                            "response": "muun is non-custodial and if I interpret u/dariosne comments correctly, they upfront the channel opening costs. Until these costs are recovered the user will pay slightly higher fees in future payments.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i9bkq2k",
                                                                                    "author": "jessquit",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653050081.0,
                                                                                    "response": "how do you have a trustless non-custodial LN wallet without running a node?",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i9bqsh1",
                                                                                            "author": "_risho_",
                                                                                            "score": 2,
                                                                                            "created_utc": 1653052935.0,
                                                                                            "response": "They have this thing called turbo channels which is an opt in convenience feature which makes them temporarily very trusted but only until the transaction confirms on chain.  Aside from that it has all of the potential risks and drawbacks that you would get from any other ln wallet.  If they are your source of truth for the state of your channels then it would probably be trivial for them to broadcast an old state. That said that isn’t a muun problem that’s just an ln problem. As far as lightning wallets go, assuming you are willing to take on the inherent risks of using ln in the first place, muun is probably one of the wallets that makes the best series of tradeoffs between trustlessness ux and convenience",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        },
                                                                                        {
                                                                                            "id": "i9bqeei",
                                                                                            "author": "YeOldDoc",
                                                                                            "score": 1,
                                                                                            "created_utc": 1653052763.0,
                                                                                            "response": "Either by integrating the node inside the wallet and/or using trustless submarine swaps as a bridge between on-chain and LN funds.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "id": "i9cieg2",
                                                                            "author": "pet_2g",
                                                                            "score": 0,
                                                                            "created_utc": 1653064153.0,
                                                                            "response": "I mean don't have any idea about it as of now, this is going to be good.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "id": "i9bq1dn",
                                                                    "author": "bartz_daniel",
                                                                    "score": 1,
                                                                    "created_utc": 1653052600.0,
                                                                    "response": "That's a good comment dude, really can help a lot of people out there.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "i9df0y8",
                                                            "author": "Katrotat",
                                                            "score": 0,
                                                            "created_utc": 1653078396.0,
                                                            "response": "Yeah You've got a point here, this is a really good point here dude.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i9bdkqd",
                                                    "author": "hero462",
                                                    "score": 2,
                                                    "created_utc": 1653046278.0,
                                                    "response": "The citation is my own experience.\n\nHow can a hierachically deterministic wallet can be retrieved with an email address?  It cannot.  Which means Muun would have to access your wallet for you.  Custodial.  \n\nThe default/first option is for email backup.  I did not say there were no other options.  Learn to read.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i9eaj4g",
                                                    "author": "borotev",
                                                    "score": 1,
                                                    "created_utc": 1653093793.0,
                                                    "response": "They're all custodian and they're all against the ethos of btc.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9auizr",
                                            "author": "YeOldDoc",
                                            "score": 1,
                                            "created_utc": 1653031278.0,
                                            "response": "> MUUM defaults to custodial as well.\n\nThat is not correct. muun is non-custodial.\n\n> The first option to backup a wallet is with an email address.\n\nThis is optional to make the restoration process easier, no keys are sent to them or your email, you still need to provide (and write down) your own mnemonic. This is also explained when you click on the \"How will Muun use my email?\" info when entering your email.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9becd6",
                                                    "author": "hero462",
                                                    "score": 2,
                                                    "created_utc": 1653046718.0,
                                                    "response": "1.  BACK UP YOUR WALLET  Use your email and a password to recover your wallet\n2. (the option I selected)  YOU CREATED AN ALTERNATIVE BACKUP  You can use the code you wrote down to recover your wallet",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i9befaq",
                                                    "author": "hero462",
                                                    "score": 2,
                                                    "created_utc": 1653046766.0,
                                                    "response": "Thanks for the reply.  If what you say is accurate the wording in the wallet sure is strange.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9d6l2o",
                                            "author": "bosscui",
                                            "score": 0,
                                            "created_utc": 1653074613.0,
                                            "response": "Yeah, that's the first option that You're going to get. And a good option.\n\nBut the problem is it's a custodial wallet and how long that's  going to last?",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9base3",
                                    "author": "Shibinator",
                                    "score": 4,
                                    "created_utc": 1653044569.0,
                                    "response": "Breez is [\"\"\"non-custodial\"\"\"***](https://twitter.com/TheBCHPodcast/status/1517116405824507904).\n\nIf you're willing to stretch the definition of non-custodial a long way.\n\nIt requires:\n\n- Constant internet access, or backups will go out of date\n- Backup to either Google Drive, or your own remote server.  If your own server, obviously you need to be responsible for configuring and running that yourself\n- Has a proprietary \"seed phrase\" type of thing, which can only be restored in Breez, hence you also need copies of their repositories and the technical skill to manage one of those restores yourself\n- You gotta be able to figure this out with minimal or no help, because their documentation is out of date / incorrect",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9d3ubi",
                                            "author": "Remora_101",
                                            "score": 3,
                                            "created_utc": 1653073334.0,
                                            "response": "👍",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i9bstz5",
                                            "author": "YeOldDoc",
                                            "score": 1,
                                            "created_utc": 1653053831.0,
                                            "response": "Those are valid annoyances (in particular when there are other LN wallets that do better), but they don't give them custody over your funds.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9bxuwi",
                                                    "author": "Shibinator",
                                                    "score": 3,
                                                    "created_utc": 1653055973.0,
                                                    "response": "*** Provided you follow all those steps.  If you don't follow those steps, it is custodial, and the majority of users will fall into that category.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9bzjau",
                                                            "author": "YeOldDoc",
                                                            "score": 1,
                                                            "created_utc": 1653056661.0,
                                                            "response": "How can they be custodial if they don't have your keys?",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i9a9bor",
                                    "author": "knowbodynows",
                                    "score": 3,
                                    "created_utc": 1653016733.0,
                                    "response": "I would love a BCH Mycelium wallet.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9dfgs0",
                                            "author": "janooms",
                                            "score": 3,
                                            "created_utc": 1653078596.0,
                                            "response": "Does that support the LN? I mean if it does I'd like to use that man.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9aviv3",
                                    "author": "YeOldDoc",
                                    "score": 2,
                                    "created_utc": 1653032152.0,
                                    "response": "https://walletscrutiny.com is a useful list/overview of wallets with regard to security/custody parameters.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9bg6jy",
                                            "author": "miloy8",
                                            "score": 0,
                                            "created_utc": 1653047734.0,
                                            "response": "Thanks for the link man, this is good. This list will help a lot of people out.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9ddmdm",
                                    "author": "bitsanctuary",
                                    "score": 1,
                                    "created_utc": 1653077763.0,
                                    "response": "Thanks for this, I'm sure this will be helpful to many people.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9atpvz",
                            "author": "YeOldDoc",
                            "score": 2,
                            "created_utc": 1653030583.0,
                            "response": "BlueWallet is indeed not very transparent on this issue:\n\n- On-chain is non-custodial\n- Lightning Network is custodial by default (channels are maintained by their servers) but you can connect to your own server (non-custodial)\n\nhttps://walletscrutiny.com/ gives a good overview if you like to compare your own findings.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9d3xko",
                                    "author": "Remora_101",
                                    "score": 1,
                                    "created_utc": 1653073376.0,
                                    "response": "👍",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9bqdbd",
                            "author": "4a01e43fa4e98",
                            "score": 0,
                            "created_utc": 1653052749.0,
                            "response": "And now it's not, it should just be out of the list fir you.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9bwzv7",
                    "author": "ZaDrOnT",
                    "score": 2,
                    "created_utc": 1653055613.0,
                    "response": "That's not a good thing, it's against the one thing that bitcoiners preach.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}