{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "utv70l",
            "title": "Issues with receiving/sending Litecoin (LTC)",
            "url": "https://www.reddit.com/r/CoinBase/comments/utv70l/issues_with_receivingsending_litecoin_ltc/",
            "author": "keeeve",
            "created_utc": 1653051792.0,
            "score": 3,
            "num_comments": 53,
            "subreddit": "CoinBase",
            "selftext": "so i sent about 2000$ of ltc to my coinbase wallet from exodus and the transaction is listed as complete with 6+confirmations but nothing is showing up in my wallet. I called coinbase support and they said its a known issue and they are trying to fix but when i check the coinbase status page, it says all systems are working. anyone else having issues with LTC/",
            "stickied": false,
            "comments": [
                {
                    "id": "i9c4vgh",
                    "author": "RamXid",
                    "score": 2,
                    "created_utc": 1653058807.0,
                    "response": "Sent some litecoin to another account (not-coinbase) about 2+ hours ago and the transaction is still marked as \"pending\".\n\nSomething is definitely up with the transactions.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9c6xqj",
                            "author": "Sayokadi",
                            "score": 1,
                            "created_utc": 1653059634.0,
                            "response": "Same here, I even sent a smaller 'test' transaction to see if maybe the 1st one was delayed outside of it being 'ltc'.   \n\n\nI'm going to guess the issue isn't resolved or there is quite a backlog from earlier.  \n\n\nIn case support is watching here: Case# 11927594",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9c7pcr",
                                    "author": "coinbasesupport",
                                    "score": 1,
                                    "created_utc": 1653059941.0,
                                    "response": "Thanks for running a small test and submitting a ticket.  We're seeing a few reports come in, so it's possible the delays from earlier this morning may be recurring.  We've let interested parties know!",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9c83p3",
                                            "author": "Sayokadi",
                                            "score": 1,
                                            "created_utc": 1653060096.0,
                                            "response": "Thank you. Much appreciated. This delay has definitely put a stump on my plans for the day.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9c7kch",
                            "author": "coinbasesupport",
                            "score": 1,
                            "created_utc": 1653059886.0,
                            "response": "We saw delays earlier that was resolved, but it sounds like it could be happening again.  We've let our crypto teams know so they can take another look.  Thank you all for the reports!",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9cf14j",
                                    "author": "RamXid",
                                    "score": 1,
                                    "created_utc": 1653062832.0,
                                    "response": "~~I would contact the on-site support for this but that would be very difficult since my transaction is missing its transaction id and its not logged on any block explorers either.~~\n\n~~Can we get a rough ETA on when we could expect this to get fixed? I really wouldn't want my transaction to be pending for the next 72 hours.~~\n\nEDIT: nvm just as i posted this comment my transaction was started and now i can track it as well",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9cg1qo",
                                            "author": "coinbasesupport",
                                            "score": 1,
                                            "created_utc": 1653063233.0,
                                            "response": "We're getting word that it's recovering now.  If you are still having issues please submit a ticket, and in the hash text field you can put 0s.  \n\nhttps://help.coinbase.com/en/contact-us\n\nThank you!",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9cggnj",
                                                    "author": "Sayokadi",
                                                    "score": 1,
                                                    "created_utc": 1653063397.0,
                                                    "response": "Still waiting on mine to start and I'm near 10 bucks down :(",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9chdc8",
                                                            "author": "coinbasesupport",
                                                            "score": 1,
                                                            "created_utc": 1653063751.0,
                                                            "response": "We're sorry you are still dealing with this u/Sayokadi, however our team is aware of this incident, and we are working hard to quickly resolve this. We appreciate your patience.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9cjq2a",
                                                                    "author": "Sayokadi",
                                                                    "score": 1,
                                                                    "created_utc": 1653064667.0,
                                                                    "response": "Looks like the 1st one went through. the test one is still stuck but at least things are moving now. Thank you.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9ckqgj",
                                                                            "author": "coinbasesupport",
                                                                            "score": 1,
                                                                            "created_utc": 1653065060.0,
                                                                            "response": "Appreciate the update on your LTC transactions. Glad to hear they are moving through.\nWe will update your newly created case, but should you run into any other issues, please get back with us u/Sayokadi !\nHappy to help.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9cgahx",
                                            "author": "Sayokadi",
                                            "score": 1,
                                            "created_utc": 1653063330.0,
                                            "response": "When this happens, just put in 64 0's :)",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9bo9qh",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653051792.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9djp86",
                            "author": "Spinfoam07",
                            "score": 2,
                            "created_utc": 1653080520.0,
                            "response": "Seems like a recurring problem with Coinbase I have a case with them cannot load funds they have been reviewing for a month and a half and left me hanging. \nNo way to get to talk to Anybody.  Yes they have a first line of gate keepers who knows squat all and just tells you we have to wait for the review to finish.   I have lost trust in this company and just want my funds back but guess can’t do that either",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9dkbpl",
                                    "author": "coinbasesupport",
                                    "score": 1,
                                    "created_utc": 1653080807.0,
                                    "response": "Hi u/Spinfoam07, we're really sorry to hear you had this issue, we want to reassure you this is not the experience we want you to have. Can you please share with us your case number, and we'd be happy to look into this for you.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9dmvxz",
                                            "author": "Spinfoam07",
                                            "score": 1,
                                            "created_utc": 1653081999.0,
                                            "response": "I was on the tall app with Coinbase for a solution but I lost the link",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i9dn1gz",
                                            "author": "Spinfoam07",
                                            "score": 1,
                                            "created_utc": 1653082071.0,
                                            "response": "I was just talking with someone",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9dnipy",
                                                    "author": "coinbasesupport",
                                                    "score": 1,
                                                    "created_utc": 1653082296.0,
                                                    "response": "We understand. If you haven't received a case number for your issue in your emails, please move forward with creating a case for your issue with our team here: https://help.coinbase.com/en/contact-us/. Once completed, please share your case number with us here and we can continue to follow up on your case as needed.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9do227",
                                                            "author": "Spinfoam07",
                                                            "score": 1,
                                                            "created_utc": 1653082545.0,
                                                            "response": "I have a case number 11902781",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9dqu9k",
                                                                    "author": "coinbasesupport",
                                                                    "score": 1,
                                                                    "created_utc": 1653083839.0,
                                                                    "response": "Thank you for sharing your case with us. After reviewing your case it looks like our team is still reviewing at the time, and we cannot expedite this process. Rest assured our team is working as hard as they can to quickly resolve your case. We appreciate your patience.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9boppj",
                    "author": "coinbasesupport",
                    "score": 1,
                    "created_utc": 1653051997.0,
                    "response": "Hi, thanks for your message!\n\nWe'd like to follow up on this, please send our support team a message here: https://help.coinbase.com/en/contact-us they will investigate this further.\n\nThanks!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9bppvh",
                            "author": "keeeve",
                            "score": 1,
                            "created_utc": 1653052455.0,
                            "response": "Please check case#11926993 it keeps telling me I give the wrong information but everything is right… this is so frustrating",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9brvp5",
                                    "author": "coinbasesupport",
                                    "score": 1,
                                    "created_utc": 1653053415.0,
                                    "response": "Thank you so much for providing that number! It is evident that this issue was resolved a number of hours ago. Sometimes it may take a certain amount of time for a fix to become evident on the application. Your patience is greatly appreciated.\n\nWe also reviewed your case number. A member of the specialized team will be in touch as soon as they can. Please keep an eye on the email address associated with your account for updates. Thanks!\n^FJ",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9bsp06",
                                            "author": "keeeve",
                                            "score": 1,
                                            "created_utc": 1653053771.0,
                                            "response": "So the funds will just pop in my account when it clears ? Is there an ETAv",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9btqts",
                                                    "author": "coinbasesupport",
                                                    "score": 1,
                                                    "created_utc": 1653054228.0,
                                                    "response": "Thank you for your response!. Unfortunately, we cannot provide an exact time. We would kindly advise that you keep an eye on the email address associated with your case for further communication from the specialized team. Thanks!",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9byp2g",
                                                            "author": "Proud-Love3607",
                                                            "score": 2,
                                                            "created_utc": 1653056320.0,
                                                            "response": "Im having the same issue. Waiting for almost 2 hours now for my deposit. The Issue was resolved 2 hours ago according to \"coinbase\". I guess someone fcked up lol",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9bz8l0",
                                                                    "author": "coinbasesupport",
                                                                    "score": 1,
                                                                    "created_utc": 1653056541.0,
                                                                    "response": "Hey u/Proud-Love3607, thank you for commenting. We're sorry to hear you are experiencing deposit issues, can you please move forward with creating a case with our team so that we can take a look into this? You can get started here: https://help.coinbase.com/en/contact-us/.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i9c86ru",
                                    "author": "koecerion",
                                    "score": 1,
                                    "created_utc": 1653060129.0,
                                    "response": "I'm experiencing the same issue as you. The TX hash, amount, and e-mail are all correct but the form keeps e-mailing me that information is wrong.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9c8vjn",
                                            "author": "coinbasesupport",
                                            "score": 1,
                                            "created_utc": 1653060406.0,
                                            "response": "That's weird, is it specifying what piece is wrong?  Do want to confirm that our teams are looking into the Litecoin delays now, though.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9cce83",
                                                    "author": "koecerion",
                                                    "score": 1,
                                                    "created_utc": 1653061796.0,
                                                    "response": "No - it just gives the list of Hash, Amount, and e-mail address.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9cddnk",
                                                            "author": "coinbasesupport",
                                                            "score": 1,
                                                            "created_utc": 1653062184.0,
                                                            "response": "If the issue is with the Hash field you can put all 0s.  Otherwise, try disabling extensions or trying to fill out the form on another browser.  Let us know if that works for you.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9cjapc",
                                                                    "author": "koecerion",
                                                                    "score": 1,
                                                                    "created_utc": 1653064500.0,
                                                                    "response": "Just received my LTC.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9ckb48",
                                                                            "author": "coinbasesupport",
                                                                            "score": 1,
                                                                            "created_utc": 1653064894.0,
                                                                            "response": "Great!  Thanks for the update, we're happy to hear things are recovering now.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9cdugl",
                    "author": "Internetologist",
                    "score": 1,
                    "created_utc": 1653062368.0,
                    "response": "Yes, I usually am able to send LTC but for the last few days it's not allowing me, even after updating the app. I think I'll try a different coin",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ej5j8",
                    "author": "cmdrshepherd1993",
                    "score": 1,
                    "created_utc": 1653098336.0,
                    "response": "You need more than 6 confirmations, just wait lmao it’s not instant. It’ll get there.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9f0y58",
                    "author": "Nervous_Program_2609",
                    "score": 1,
                    "created_utc": 1653108624.0,
                    "response": "Something serious is happening with coinbase . I sent $2800 to MetaFi yielders through coinbase on May 2, 2022. The funds have not shown in my account at MetaFi. I spoke with 8 different customer service reps at coinbase and they all gave different stories. Finally, I was told the fund were reported sent and I should contact the receiving company. I tried emailing MetaFi 7 different times without one response. I guess I just have to kiss the $2800 goodbye because I don’t know where else to turn.\nThanks Coinbase.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9f1hnn",
                            "author": "coinbasesupport",
                            "score": 1,
                            "created_utc": 1653109009.0,
                            "response": "Hey u/Nervous_Program_2609, help's here! Can you let us know your most recent support case number, so we can have a look as well? We'll keep an eye out. Thanks!",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9f1vyo",
                                    "author": "Nervous_Program_2609",
                                    "score": 1,
                                    "created_utc": 1653109287.0,
                                    "response": "Case# 11814215\n\nThanks",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9f3dto",
                                            "author": "coinbasesupport",
                                            "score": 1,
                                            "created_utc": 1653110339.0,
                                            "response": "Got it, thanks! We've escalated your case to the relevant team and informed them of what happened. You should receive an update from them via the same email thread. Please make sure to address all your questions on the same thread as well so they can look into it right away. We truly appreciate your patience on getting this fixed!",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9gf7aw",
                    "author": "Asleep_Win_8650",
                    "score": 1,
                    "created_utc": 1653145002.0,
                    "response": "🌝Baby Luna Inu🌝 $BLI\n\nBaby Luna Inu is a Deflationary ERC-20 token on the Ethereum Blockchain that offers frictionless rewards to its holders.\n\nLiquidity locked for 30 Days\n\nTokenomics:\n*Buy Tax: 1% marketing\nSell Tax: 2% LP\n3% Marketing On sell\nTotal Supply: 1,000,000,000,000,000,000\n\nWebsite:\nhttp://babyluna-inu.com\n\nTwitter:\nhttps://twitter.com/babylunainuerc?s=21&t=6dU8GYx7x0cZJFZsDpFe1Q\n\nTelegram:\nhttps://t.me/BabyLunaInuErc\n\nhttps://www.dextools.io/app/ether/pair-explorer/0x92d1663712ab3449d194af913a66c3a6abf342cd",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9h5sfr",
                    "author": "lllooopppypp",
                    "score": 1,
                    "created_utc": 1653157218.0,
                    "response": "Am fully ready for #BULLRUN \nStacked up my bags filled with DeppDoge \n\nHeading to the moon 🚀🚀🚀\n#BSC\nhttps://t.me/deppdoge",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9cwzq3",
                    "author": "SouthSeaCo1012",
                    "score": 0,
                    "created_utc": 1653070131.0,
                    "response": "Trust no one. Short memory?",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}