{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uqz66l",
            "title": "WLuna transfer!!",
            "url": "https://www.reddit.com/r/CoinBase/comments/uqz66l/wluna_transfer/",
            "author": "CatTop7924",
            "created_utc": 1652716635.0,
            "score": 7,
            "num_comments": 64,
            "subreddit": "CoinBase",
            "selftext": "I was wondering since we won't be able to buy WLuna anymore after May 27th. Can we transfer WLuna to Crypto.com and will it become Luna or do I have to get Luna separate?",
            "stickied": false,
            "comments": [
                {
                    "id": "i8ua1uk",
                    "author": "Blgxx",
                    "score": 7,
                    "created_utc": 1652720610.0,
                    "response": "You need to either send it to somewhere where WLuna (Eth) is supported or use terra bridge to convert it into Luna (Terra).  Don't send WLuna to somewhere like Binance without converting it first.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8urq37",
                            "author": "CatTop7924",
                            "score": 3,
                            "created_utc": 1652727664.0,
                            "response": "Thank you. That's very helpful.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8v4vnt",
                    "author": "anon977577",
                    "score": 2,
                    "created_utc": 1652733054.0,
                    "response": "If Coinbase lets WLUNA and its prior 15 billion dollars worth of past purchasing power to disappear into a puff of smoke, like the tulip bulb mania that it was, where the thing being traded is ultimately shown to have zero value, with hardly any ceremony except a shrug to the community and a pointer to the eula where it says: \"Be prepared to lose 100% of your investment\" then that is going to seriously damage the entire thesis of Coinbase all together as a negative-value add middle-man between the individual who wants to store labor in crypto, and keeping their wallet key serverside so the feds climbing up their butts can get government to regain their divine right to create debt in the name of others, thus gifting purchasing power to religious ingroup clique as taxation without representation.\n\nIf you let WLUNA drop off adoption just because the price has gone way down, then it puts all the other shitty altcoins you're adopting into the same risk group of \"Tulip bulp manias $50 million dollars per bulb will reset to $0.000000001 at intervals where code chaos meets majure events and randomness.\n\nBy letting wluna drop off, isn't there a perverse incentive to pump and dump?  Scooop a position, adopt the altcoin, sell it to users for post-adoption price, de-adopt the altcoin, price goes back to zero.  That's pump and dump and extremely illegal for stock exchanges.\n\nYou asshats just turned 15 billion dollars into 0 dollars in a few days and there isn't so much as a peep coming from you guys.  That's not cool.  The fact that your earnings are up even after you've destroyed 15 billion dollars of other people's money is something you can ignore and dismiss.  But makes you look bad.\n\nYou're destroying the original thesis of cryptocurrency altogether by handing the government its ability to create cryptocurrency and issue it to itself, and then you're raking transaction fees.  I guess coinbase is just a game of roulette at the Casino?  The ball and the slot aren't money, it's just a game of musical chairs where 10 people put in a dollar, a rake is taken, then 1 person gets $8?\n\nGovernment is going to smile and wave at you, since your customer's losses makes them smile from ear to ear.  Don't spend my money all in one place you crooks who found a sweetheart deal into the sovereign's ability to issue self money in the name of out group.  File it under betrayal, the ancient and timeless definition, a grey area between outright theft and confidence-man swindler.  Word of mouth do its thing please as a goes around comes around correction mechanism.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8wr4kq",
                            "author": "druglover17",
                            "score": 2,
                            "created_utc": 1652761641.0,
                            "response": "Lol, sounds like you lost money to luna dying😅",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8xpiyr",
                                    "author": "anon977577",
                                    "score": 0,
                                    "created_utc": 1652788883.0,
                                    "response": "[https://www.youtube.com/watch?v=\\_b8w8pDSOUs](https://www.youtube.com/watch?v=_b8w8pDSOUs)\n\nWLUNA will come back to $120.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i92gse3",
                                            "author": "druglover17",
                                            "score": 1,
                                            "created_utc": 1652878683.0,
                                            "response": "Lmfao. No it wont.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8ww3d0",
                            "author": "cmdrshepherd1993",
                            "score": 1,
                            "created_utc": 1652764994.0,
                            "response": "Did you forget that government makes laws? They will always have more power than the exchange. Coinbase cannot tell the government to “f off” that just makes zero sense.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8u02zl",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1652716636.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8u5eoo",
                    "author": "on2197",
                    "score": 1,
                    "created_utc": 1652718786.0,
                    "response": "Will wluna have any value after if they have revived Luna?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8u5omk",
                            "author": "Agent_Kobayashi",
                            "score": 2,
                            "created_utc": 1652718894.0,
                            "response": "Doubt it. It will be V2 Luna or a different token all together.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8vwyqs",
                    "author": "Tall_Run_2814",
                    "score": 1,
                    "created_utc": 1652745639.0,
                    "response": "WLUNA and LUNA are not the same.  Hence the reason for adding the W.  The W stands for wrapped.  The Luna on Coinbase is wrapped so it can run on the Ethereum network.\n\nAll coins must have the same name and be sent on the same network or they will be lost.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8yr58b",
                            "author": "CatTop7924",
                            "score": 1,
                            "created_utc": 1652805930.0,
                            "response": "I understand that but if I transfer my Wluna to crypto.com will I get Luna or something else?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8yser8",
                                    "author": "coinbasesupport",
                                    "score": 1,
                                    "created_utc": 1652806438.0,
                                    "response": "u/CatTop7924, if you transfer your WLUNA to any other wallet, on an exchange or non-custodial wallet, it will arrive as WLUNA on the Ethereum Mainnet. It will not be unwrapped in the process. Please make sure that the location you are sending the WLUNA to supports the asset!",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9bx2zw",
                                    "author": "Tall_Run_2814",
                                    "score": 1,
                                    "created_utc": 1653055649.0,
                                    "response": "You don't understand.  Coins do not magically become other coins.  If you send WLUNA to an exchange that does not have WLUNA your coins will be lost forever!  \n\nThe exact coin must be sent to and fro or it will be lost.\n\nCoins must be sent on the same network or they will be lost. \n\nFor the love of God, always send a test amount to verify before sending your entire bag or you will risk losing it all over a simple misunderstanding",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8wd113",
                    "author": "ndreamer",
                    "score": 1,
                    "created_utc": 1652753692.0,
                    "response": "Didn’t crypto.com delist it ? You may find you will need to swap on a dex",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8yqyqf",
                            "author": "CatTop7924",
                            "score": 1,
                            "created_utc": 1652805857.0,
                            "response": "They listed again.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9h7lek",
                    "author": "balamsapero",
                    "score": 1,
                    "created_utc": 1653158085.0,
                    "response": "Am fully ready for #BULLRUN \nStacked up my bags filled with DeppDoge \n\nHeading to the moon 🚀🚀🚀\n#BSC\nhttps://t.me/deppdoge",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}