{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uwlsm4",
            "title": "Coinbase Took Away My Funds",
            "url": "https://www.reddit.com/r/CoinBase/comments/uwlsm4/coinbase_took_away_my_funds/",
            "author": "constantine_fry",
            "created_utc": 1653379766.0,
            "score": 3,
            "num_comments": 27,
            "subreddit": "CoinBase",
            "selftext": "I have received a \"**Your photo ID has been verified**\" email, then I received  \"**Your Coinbase account has been successfully deleted**\", few seconds later I got \"**NOTICE OF ACCOUNT CLOSURE**\" from [no-reply@coinbase.com](mailto:no-reply@coinbase.com).\n\nI can't login to Coinbase, as the account is deleted. My funds are not available to me. How do I get my money back from your platform?",
            "stickied": false,
            "comments": [
                {
                    "id": "i9s9217",
                    "author": "coinbasesupport",
                    "score": 2,
                    "created_utc": 1653380288.0,
                    "response": "Hi, thanks for your message.\n\nWe'd like to follow up on this issue, please send our support team a message here as soon as you can: https://help.coinbase.com/en/contact-us they will investigate this further. \n\nThanks!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9s9o83",
                            "author": "constantine_fry",
                            "score": 1,
                            "created_utc": 1653380861.0,
                            "response": "I send multiple support tickets. No help there. The support team tells me to login and withdraw the money. **But I'm not able to login.**",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9sa0zb",
                                    "author": "coinbasesupport",
                                    "score": 2,
                                    "created_utc": 1653381205.0,
                                    "response": "Thank you for your response. Please feel free to provide your case number here so that we can review this matter further. Thanks!",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9sa4rt",
                                            "author": "constantine_fry",
                                            "score": 0,
                                            "created_utc": 1653381301.0,
                                            "response": "11965885",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9saw2u",
                                                    "author": "coinbasesupport",
                                                    "score": 2,
                                                    "created_utc": 1653382023.0,
                                                    "response": "Thank you so much for providing that number! We have reviewed and can confirm that this is currently with the correct team. We would kindly advise that you keep an eye on the email address associated with your account for further communication.Thanks!",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9sdszq",
                                                            "author": "constantine_fry",
                                                            "score": 4,
                                                            "created_utc": 1653384746.0,
                                                            "response": "&#x200B;\n\n>We regret to inform you that we can no longer support your Coinbase account.  \nAs a regulated Money Services Business under FinCEN, our primary goal is to make our platform safe and secure for our customers. A variety of factors have been weighed in your case, and for security reasons we are unable to elaborate on our internal decision process.  \nWhile we can no longer continue our banking relationship, we have not blocked your access to the current balance in your Coinbase account. You may still send your balance offsite to an external address.  \nPlease know that we do not make these decisions lightly and we regret losing you as a customer.\n\nThe support team doesn't read the message carefully. They  sent me a template reply insisting that I can login. But that's not the case, the account has been deleted!",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9sen47",
                                                                    "author": "coinbasesupport",
                                                                    "score": 2,
                                                                    "created_utc": 1653385509.0,
                                                                    "response": "Thank you so much for your response. We truly appreciate you providing the screenshots. Please keep an eye your email as the team will be reviewing further. Thanks again for reaching out!",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9sg0ot",
                                                                            "author": "constantine_fry",
                                                                            "score": -1,
                                                                            "created_utc": 1653386742.0,
                                                                            "response": ">Due to security measures, we are unable to elaborate on our internal decision process. This decision remains final and we are unable to remove the restriction from your account.  \nYou still have access to the balance currently in your Coinbase account. While we can no longer process brokerage orders via our banking relationship, you may still send your balance to an external address and withdraw any remaining fiat from your fiat wallet to an active linked bank account.\n\nThis is what I received. Can you stop telling me that I have access. I sent you a screenshot proving that I no longer have access to the Coinbase balance. Please help me to login to coinbase account.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i9sgs76",
                                                                                    "author": "coinbasesupport",
                                                                                    "score": 2,
                                                                                    "created_utc": 1653387396.0,
                                                                                    "response": "We're happy to follow up on this. Upon reviewing your case, we can confirm that we have received your response. Rest assured that our support team will get back to you with an update as soon as possible. Thanks for your understanding.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i9szam4",
                                                                                            "author": "constantine_fry",
                                                                                            "score": 4,
                                                                                            "created_utc": 1653398969.0,
                                                                                            "response": "Can you please ask the support team to escalate the request? The company literally stoled my money and behaves like a bully.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i9uz4ha",
                                    "author": "lina_wang",
                                    "score": 1,
                                    "created_utc": 1653429439.0,
                                    "response": "This happened to a friend of mine, but nothing has been resolved yet",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9s93v5",
                    "author": "elaboratejuncture27",
                    "score": 3,
                    "created_utc": 1653380332.0,
                    "response": "So sad",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9scez3",
                    "author": "Accomplished-Way7608",
                    "score": 0,
                    "created_utc": 1653383453.0,
                    "response": "Welcome to cryptoland! Lessons learned..",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9s8i7b",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653379766.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9tvvep",
                    "author": "Natoexe",
                    "score": 1,
                    "created_utc": 1653412849.0,
                    "response": "What does it say when you try to log in?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ukzx3",
                    "author": "Connect-Ad-1088",
                    "score": 1,
                    "created_utc": 1653423366.0,
                    "response": "a hardware wallet fixes this....just saying......if you had all your crypto under your control you would not have to rely on cb to fix the mess.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9u71ac",
                    "author": "fu2re",
                    "score": 0,
                    "created_utc": 1653417488.0,
                    "response": "Same story. Happened to me today. Support is useless",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}