{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ux2br3",
            "title": "I regret staking eth 2.0 on Coinbase",
            "url": "https://www.reddit.com/r/CoinBase/comments/ux2br3/i_regret_staking_eth_20_on_coinbase/",
            "author": "Marzero",
            "created_utc": 1653429855.0,
            "score": 4,
            "num_comments": 14,
            "subreddit": "CoinBase",
            "selftext": "Just wanna know if other people regret it.\n\n[View Poll](https://www.reddit.com/poll/ux2br3)",
            "stickied": false,
            "comments": [
                {
                    "id": "i9veuud",
                    "author": "Tall_Run_2814",
                    "score": 4,
                    "created_utc": 1653436686.0,
                    "response": "All you dumb mofos don't know how to read the fine print. \n\nBesides, there are literally hundreds of places you can stake your crypto without losing complete control, rookie mistake.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9x8eqq",
                            "author": "Beepbeep1976",
                            "score": 1,
                            "created_utc": 1653478374.0,
                            "response": "Actually, I did read the ToS and knew what I was doing. However, at the time CB was also stating that liquidity would be enabled by December 2021. They went back on that promise.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9vl2vz",
                    "author": "wattumofficial",
                    "score": 2,
                    "created_utc": 1653439672.0,
                    "response": "If you staked ETH, then you might have protected from buying Luna with your ETH.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9vf8zj",
                    "author": "Kiwip0rn",
                    "score": 2,
                    "created_utc": 1653436871.0,
                    "response": "Why would anyone regret it? \n\nI know a few people here that regret not reading the ToS. 🤷‍♂️ or for having the total lack of comprehension.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9x4ctz",
                            "author": "Beepbeep1976",
                            "score": 1,
                            "created_utc": 1653475575.0,
                            "response": "I regret trusting them when their ToS stated they would enable liquidity by December 2021. Shortly after staking with CB I discovered Haru where APY is 6.1% with no locking or 7.1-14% with anywhere from 15 days to 365 days of locking. That's lending though, not staking, so it doesn't go to validating the network.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9v0nf3",
                    "author": "househubbz",
                    "score": 1,
                    "created_utc": 1653430106.0,
                    "response": "Should I convert my old eth to 2.0?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9v2s59",
                            "author": "Marzero",
                            "score": 0,
                            "created_utc": 1653431055.0,
                            "response": "Maybe not on Coinbase.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9x4swl",
                            "author": "Beepbeep1976",
                            "score": 1,
                            "created_utc": 1653475910.0,
                            "response": "Lend on Haru instead. Will get 6.1% APY with no locking up or 7.1%-14% for anywhere between 15 days and 365 days of locking up at a time. Lending isn't the same as staking though so it doesn't help validate the network. Also, you don't need to convert to ETH2 for the merge. After merge ETH2 goes back to just ETH, it's all the same asset",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9v5cdb",
                    "author": "pob125",
                    "score": 1,
                    "created_utc": 1653432221.0,
                    "response": "I staked my first 2 eth on coinbase,then decided to store the rest in my own wallet simply for the reason of security...if anything happens with coinbase then I don't lose it all but also if I fuck up my own wallet I also don't lose it all...its all about spreading the risk.i fully trust coinbase with my staked ETH",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9v030h",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653429856.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9wouba",
                    "author": "Timberwo",
                    "score": 1,
                    "created_utc": 1653462125.0,
                    "response": "I regret it because I was still super super new at staking on different platforms, BUT I am not upset and I have learned from my past mistakes. CEX normally suck anyways.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9x2h8d",
                    "author": "Ambitious-Trade9721",
                    "score": 1,
                    "created_utc": 1653474112.0,
                    "response": "All u have to is buy the same amount of crypto $ value, then remove all the money out ur bank account. In 2 weeks they will take ur eth 2 balance and u have the new crypto u bought . I did this with like 4,500 dollars of eth",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9x4316",
                    "author": "Beepbeep1976",
                    "score": 1,
                    "created_utc": 1653475367.0,
                    "response": "I knew what I was doing and that it would be locked up so I don't exactly regret it. I regret not looking into other places more first. Kraken takes a slightly smaller commission (15% vs CB's 25%) so you get slightly higher APY. Better yet, lending on Haru gets you 6.1%APY with no locking or 7.1-14% with anywhere from 15 to 365 days of locking. But when I put most of my ETH on CB they were stating that they were going to enable liquidity of staked ETH by December 2021 which they have since quietly pulled back on. So in that sense they suck. Cheer up though, the merge is likely by August and an EIP allowing staking withdrawals will follow a couple months later so hopefully by October or November things will be liquid again. Either way staking/lending in general is awesome, nothing beats earning free asset and after the merge staking APY is expected to increase to around 12-15%!!",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}