{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "v0w6fw",
            "title": "Can't buy Crypto. Getting error message \"Buys Currently Disabled \"",
            "url": "https://www.reddit.com/r/CoinBase/comments/v0w6fw/cant_buy_crypto_getting_error_message_buys/",
            "author": "JustinSlickremix",
            "created_utc": 1653902039.0,
            "score": 5,
            "num_comments": 25,
            "subreddit": "CoinBase",
            "selftext": "**\"Buys Currently Disabled**\"\n\nBuys are currently disabled for your account. We apologize for the inconvenience.\n\n I have made many purchases through CB on mobile and website. This is the first time in all of these years i have had an issue.\n\nI have submitted a ticket but i am getting an email response that the ticket is closed for  \n\nCase #12016867\n\nI would love to be able to correct any issue if necessary. I still have access to my account and pro account.\n\nI have NOT had any chargebacks and I have been using CB since 2017. My bank info hasn't changed and all of my information is up to date and verified. \n\nI haven't seen any suspicious activity either. I don't understand why my buying/selling is currently disabled. Can a support member please help me?\n\nHas anyone else recently experienced this out of nowhere?  \n\n\nThanks for taking the time to respond and help me with my case.",
            "stickied": false,
            "comments": [
                {
                    "id": "iajs897",
                    "author": "tahanks4",
                    "score": 2,
                    "created_utc": 1653921766.0,
                    "response": "This happened top me a while back with coinbase. I checked my email and there was some kind of verification that needed updating. Once I did it was fine e no problem since. Just be careful. Links will get you fucked up.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iajgwv8",
                    "author": "Apprehensive_Zone281",
                    "score": 2,
                    "created_utc": 1653915970.0,
                    "response": "Worst company ever.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaiyyg7",
                    "author": "coinbasesupport",
                    "score": 1,
                    "created_utc": 1653902568.0,
                    "response": "Hi u/JustinSlickremix, thanks for reaching out about your account issue. \n\nWe've located your support case, and have gone ahead and escalated your case to the relevant team for a follow up. Once our team have an update, they'll reach out via your support case. Many thanks.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaj84ui",
                            "author": "y90210",
                            "score": 3,
                            "created_utc": 1653910361.0,
                            "response": "He already had a ticket. Why would he need escalation? Shouldn't you guys just work all tickets in a reasonable time?",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iaiz493",
                            "author": "JustinSlickremix",
                            "score": 1,
                            "created_utc": 1653902715.0,
                            "response": "Thank you!  🙌",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iajn06g",
                                    "author": "greendevil77",
                                    "score": 3,
                                    "created_utc": 1653919230.0,
                                    "response": "Lol they said this exact thing to me, that it had been escalated etc. Turns out they put a hold on my account without telling me. Had to call them to figure out what was going on, and even then they had to transfer me a few times on the phone. Customer service is shit.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iamulff",
                                            "author": "JustinSlickremix",
                                            "score": 1,
                                            "created_utc": 1653978345.0,
                                            "response": "I am going to call them tomorrow. I am wondering if it has to do with my bank merging with another bank because it showed the old bank name ect. I relinked the accounts. Going to hopefully get ahold of them tomorrow!",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iaiydao",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653902039.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iamm7x2",
                    "author": "Accomplished-Way7608",
                    "score": 1,
                    "created_utc": 1653972200.0,
                    "response": "How much $$$ did Coinbase steal from you? They need your funds to pay off the whales who are cashing out.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}