{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uzm267",
            "title": "BNB STOLEN",
            "url": "https://www.reddit.com/r/CoinBase/comments/uzm267/bnb_stolen/",
            "author": "OfficialSupport04",
            "created_utc": 1653739962.0,
            "score": 0,
            "num_comments": 3,
            "subreddit": "CoinBase",
            "selftext": "This is just a story that happened about 20 hours ago\nas of writing, I've used metamask since around\nJanuary, and I have used it mostly to dip my toes in the\nworld of crytpo, now I checked in today my wallet\nbalance after login in on my metamask wallet and\nnoticed that my BNB balance was 0, I proceded to\ncheck on bscan in case it was just a bug or a glitch..\nit\nwasn't turns out my BNB was transferred to another\nwallet\n(0x3a1b182b9EA644E393578955C061AA383a9302C\n7).\n20 hours ago I was at work so I know there was no way\nof me doing this by accident hence the reason why\nsaid it was stolen. While the amount stolen was mostly\ninsignificant, about 9usd worth, it is still an annoyance\nhaving a balance of O since that makes me unable to\npay fees until I buy more.\nIs there a lesson to learn from this? besides buying a\nhardware wallet… TXN hash is\n0×83f8bbdf3c5bbcd7f8fc5e29796d5112b49a8221be2\n1ca63ff661311421828da in case someone wants to see\nit, not sure if this would help anyone in anyway but yeh,\njust wanted to share o/",
            "stickied": false,
            "comments": [
                {
                    "id": "iab0ope",
                    "author": "xicor",
                    "score": 3,
                    "created_utc": 1653740607.0,
                    "response": "I dont know the particulars of how it got stolen... but depending on the chain it could have been you using a fake walletconnect or contract... or it could have been a phish of your keys.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaazp76",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653739962.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iab3cw0",
                    "author": "Kiwip0rn",
                    "score": 1,
                    "created_utc": 1653742242.0,
                    "response": "Buying a hardware wallet doesn't keep you from putting your 12 word on stupid websites as you stated on the Lunna page. \n\nHardware wallets do not store your coins. They just disconnects your keys from the internet. The coins are still on the ledger.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}