{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "upvlge",
            "title": "I’ve needed my coins transferred for 12 hours, support won’t fill their WLuna Hot Wallet",
            "url": "https://www.reddit.com/r/CoinBase/comments/upvlge/ive_needed_my_coins_transferred_for_12_hours/",
            "author": "Responsible_Future27",
            "created_utc": 1652579533.0,
            "score": 8,
            "num_comments": 10,
            "subreddit": "CoinBase",
            "selftext": "I’ve called support multiple times and at length have explained that they need to escalate my issue to someone higher up that can actually fill their WLuna hot wallets and they have apologized but have done nothing to fix it. Is this a form of illegal price suppression because they refuse to buy WLuna on the open market to fill their Wallet?",
            "stickied": false,
            "comments": []
        },
        {
            "id": "upv7ge",
            "title": "Sell WLUNA on Coinbase",
            "url": "https://www.reddit.com/r/CoinBase/comments/upv7ge/sell_wluna_on_coinbase/",
            "author": "vegasdelphia",
            "created_utc": 1652578173.0,
            "score": 12,
            "num_comments": 41,
            "subreddit": "CoinBase",
            "selftext": "If you purchase WLUNA on Coinbase, will you be able to sell it on Coinbase after May 27th?",
            "stickied": false,
            "comments": [
                {
                    "id": "i8no768",
                    "author": "Lord-Hootie",
                    "score": 6,
                    "created_utc": 1652586713.0,
                    "response": "I’m just going to hold and ride it out, not like I have much in it to begin with so what the harm 🤷🏻‍♂️",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8nc57n",
                    "author": "TheDoge420",
                    "score": 4,
                    "created_utc": 1652580063.0,
                    "response": "[https://help.coinbase.com/en/coinbase/getting-started/crypto-education/wrappedluna](https://help.coinbase.com/en/coinbase/getting-started/crypto-education/wrappedluna)\n\ninfo about the 27th regarding WLUNA",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8naada",
                    "author": "Comfortable-Ad-1415",
                    "score": 3,
                    "created_utc": 1652579131.0,
                    "response": "What's the significance of May 27?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8nbu90",
                            "author": "TheDoge420",
                            "score": 3,
                            "created_utc": 1652579908.0,
                            "response": "coinbase said they are going to suspend transactions of WLUNA and UST after that date, i believe its subject to change, but thats the latest news, i believe you can move it to a wallet but you can't buy/sell it after the 27th",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "uptfez",
            "title": "Are my funds safe on the exchange ?? Somebody said coinbase is tanking",
            "url": "https://www.reddit.com/r/CoinBase/comments/uptfez/are_my_funds_safe_on_the_exchange_somebody_said/",
            "author": "Busy-Bonus3010",
            "created_utc": 1652572124.0,
            "score": 0,
            "num_comments": 43,
            "subreddit": "CoinBase",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8mzsk4",
                    "author": "Arzharkhel",
                    "score": 20,
                    "created_utc": 1652573709.0,
                    "response": "Omfg with these questions.  PEOPLE! Coinbase is not going bankrupt any time soon.  The news disclosed had nothing to do with them going bankrupt.  Also; their \"revenue\" disclosures is only due to the market being down.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8n1wtu",
                            "author": "Busy-Bonus3010",
                            "score": 5,
                            "created_utc": 1652574786.0,
                            "response": "That’s what I was thinking … bunch of bs going around I just have hella money in there",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8o9pxg",
                                    "author": "Emptylnslde",
                                    "score": 4,
                                    "created_utc": 1652602551.0,
                                    "response": "If you have a lot of money in crypto, you should really buy a hardware wallet like a Ledger Nano S",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8n5bbm",
                                    "author": "Arzharkhel",
                                    "score": 5,
                                    "created_utc": 1652576514.0,
                                    "response": "You should be fine for a while, but obviously there's going to be some risk involved in keeping all your money in an exchange.  My point essentially is that people are being driven by hysteria and not analyzing the news properly.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8ojiyu",
                                    "author": "mickeywickey1105",
                                    "score": 1,
                                    "created_utc": 1652610990.0,
                                    "response": "Dont listen to influencers , when you lose hella funds those same people will say, d.y.o.r \" bro\". You would be surprised how many \"redditors\" are on these conpanies payroll.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8pp9zl",
                                            "author": "Arzharkhel",
                                            "score": 1,
                                            "created_utc": 1652633271.0,
                                            "response": "You're hardly doing any better than these so called \"influencers\" that you're talking about.  You're simply adding to the \"omg Coinbase is going bankrupt\" hysteria that came from a misread news post.\n\nAre there risks to keeping money on exchanges? That's a definitive yes, but don't spread bullshit.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i8nnzci",
                                    "author": "XxNukeMutantxX",
                                    "score": -2,
                                    "created_utc": 1652586589.0,
                                    "response": "Rip your money",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8n4myl",
                            "author": "NumberOneButta",
                            "score": -4,
                            "created_utc": 1652576163.0,
                            "response": "*Omfg with these questions.   PEOPLE! Enron is not going bankrupt any time soon.  The news disclosed had nothing to do with them going bankrupt.  Also; their \"revenue\" disclosures is only due to the market being down.*",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8n4w3t",
                                    "author": "Arzharkhel",
                                    "score": 4,
                                    "created_utc": 1652576296.0,
                                    "response": "It took Enron 16 years to go bankrupt.  \n\nYou've effectively made a non-point.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8orqbg",
                                    "author": "Nathan-Stubblefield",
                                    "score": 0,
                                    "created_utc": 1652616996.0,
                                    "response": "Reminds me of  Bernie L. Madoff Investment Securities. Everything is great until customers try to get their securities transferred out. https://en.m.wikipedia.org/wiki/Bernie_Madoff",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8nv7b4",
                            "author": "More_Interruptier",
                            "score": -2,
                            "created_utc": 1652591100.0,
                            "response": "Enron",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8nwc7h",
                                    "author": "Arzharkhel",
                                    "score": 2,
                                    "created_utc": 1652591890.0,
                                    "response": "Trying to feed into the hysteria, are we?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8ngfyz",
                    "author": "LayingWaste",
                    "score": 3,
                    "created_utc": 1652582330.0,
                    "response": "Coinbase is the least likely exchange to lose your funds imo",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8nv8x1",
                            "author": "More_Interruptier",
                            "score": 0,
                            "created_utc": 1652591127.0,
                            "response": "Compared to Gemini?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8mx7dq",
                    "author": "DingFTMFW",
                    "score": 5,
                    "created_utc": 1652572401.0,
                    "response": "No. /thread.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8og4bb",
                    "author": "TheCrustyCurmudgeon",
                    "score": 2,
                    "created_utc": 1652608067.0,
                    "response": "Stop the madness. CoinBase is very reliable and safe, as far as exchanges go. That said, I never keep a dime on an exchange for longer than I have to. Non-custodial wallet is the only way to go. The only one you can trust in the crypto world is yourself.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8naern",
                    "author": "Warleg",
                    "score": 1,
                    "created_utc": 1652579194.0,
                    "response": "Remove that shit and get off Coinbase ASAP.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8otq2v",
                            "author": "coinbasesupport",
                            "score": 1,
                            "created_utc": 1652618232.0,
                            "response": "Hi u/Warleg, thanks for getting in touch.\n\nWe're happy to follow up on your case. Can you get back to us with your case number, so we can locate it please? \n\nWe'll check this out for you.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8pzys1",
                                    "author": "Warleg",
                                    "score": 1,
                                    "created_utc": 1652637907.0,
                                    "response": "I've spent 12+ hours on the phone and in message chat, I've had so many different \"reasons\" given for it being held pending that I know every one of your CS agents are paid, liars. Here are a few reasons given:\n\n\"The blockchain is sometimes slow\" - Umm.. no the transaction doesn't even have a hashID, it's not out on the blockchain yet, there's no transactionID - it's in Coinbase que as pending.\n\n\"It's a bug on our end\" Ok I can buy that, agent said he has no idea when it will be fixed.\n\n\"Our system has multiple phone accounts with your phone number and the system doesn't know which to send it to\" Really? So when I asked 10+ times to investigate the other account as it is a fraud, your agents never said anything about opening an investigation. Weird right? I can send you 3 PDF's of chat where you can see them ignoring my request to investigate the supposed duplicate phone number.\n\n\"Clear your history and cookies\" Mind you this was told to me, the receiver who sees NOTHING about any transaction pending or being delayed. What do cookies have to do with it? I cleared them anyway, no change. Laughable.\n\n\"Just cancel the transaction, sometimes this happens\" ....\n\nTO BE CLEAR.. this pending transaction would've been worth $900+ USD as I would've received it, cashed it into USD and that was the current value. If I cancel it now, it would be worth $500, ya owe me $400 due to your error.\n\nThis was a COINBASE to COINBASE customer transaction. Both accounts KYC'd. Sender sent it to my phone number... transactions are supposed to be instant. Fix your issue, also... fix your customer service agents.\n\n&#x200B;\n\nDo your best: \n\nCase# 11853432\n\nCase# 11853815\n\nCase#11680663\n\nand 10+ other calls that we didn't get the case #'s to",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8q14ij",
                                            "author": "coinbasesupport",
                                            "score": 1,
                                            "created_utc": 1652638411.0,
                                            "response": "Hey, apologies, but there are so many cases you tried opening consecutively, it is confusing to see what case is not a duplicate of the other.  I see 11851884 is escalated, and we will focus on that case.  We will get you an update after our initial investigation.\n\nIf there is an issue with this case, please do not open another about the same issue. Reach out to us here, so we can see what is going on with your case.  Thank you for your patience!",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8q22s7",
                                                    "author": "Warleg",
                                                    "score": 1,
                                                    "created_utc": 1652638825.0,
                                                    "response": "Yep.. we opened up \"so many\" because the first one was supposed to be escalated, we hung up and 30mins later got an email that it was closed. It was on at that point. Each and every agent thereafter was more unhelpful than the next and we no longer trusted anything they (you) said. I was going to keep calling until this was resolved, you see how that ended up - nowhere.\n\n&#x200B;\n\nDo what you can, I imagine your resolution will be to \"cancel the pending transaction\" it'll be nothing about fixing your issue. Prove me wrong, I would love to trust your company, but not when it will cost me money due to your fault. Deposit the difference in my account and I will gladly cancel the transaction.\n\nMy patience ran out 9 days ago.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8q34qj",
                                                            "author": "coinbasesupport",
                                                            "score": 1,
                                                            "created_utc": 1652639294.0,
                                                            "response": "Really apologize for the experience, but the action causes more issues to arise and internal confusion for any support team.  We just ask that we keep the focus on case 11851884 and if anything comes up.  We can evaluate what is going on or clear up any confusion with the resolution provided. We are updating your case notes, and we will update you after we completed our investigation.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8q8dy6",
                                                                    "author": "Warleg",
                                                                    "score": 1,
                                                                    "created_utc": 1652641631.0,
                                                                    "response": "I will only follow case# 11851884 and here is your email, in that case, we received moments ago:\n\n&#x200B;\n\n\\---------------------------\n\nHello ,\r  \n\r  \nThanks for contacting us.\r  \n\r  \nWe’ve gathered some tips below to help you clear a pending transaction.\r  \n\r  \nTo clear the pending transaction displayed in Coinbase Wallet (but no hash):\r  \n\\- Manually backup your seed/recovery phrase found in the Coinbase Wallet settings\r  \n\\- Log out of your account and then log back in (this will refresh your session)\n\nIn some cases, a transaction is broadcast to the network with low gas fee resulting in stuck transactions on-chain.\r  \n\r  \nIf a transaction is pending on-chain for an extended period of time (has hash), you can either speed up, cancel the transaction, or wait for network fees to drop or replace the transaction.\r  \n\r  \nTo speed up the pending transaction:\r  \n\\- Select the pending transaction\r  \n\\- Select the blue lightning button\r  \n\\- Select a speed option from the screen that appears\r  \n\r  \nThis will re-submit the transaction with a higher gas fee that should allow the transaction to be processed faster.\r  \n\r  \nTo cancel the pending transaction:\r  \n\\- Select the pending transaction\r  \n\\- Select the X button\r  \n\\- Confirm the cancellation on the screen that appears\r  \n\r  \nYou can also cancel a stuck transaction manually by following these steps:\r  \n\\- Open the stuck transaction details in Etherscan and note the nonce\r  \n\\- Go back to Wallet and send at least $0.01 of ETH to any valid address\r  \n\\- Select normal or fast as the miner fee options\r  \n\\- Replace the nonce in the custom section with the stuck transaction’s nonce\n\n==============================\n\nWe dont use \"Coinbase Wallet\", there is no seed phrase. Logging out and in? Yes we do this everytime. We keep our coin in Ledger. This transaction is ON COINBASE nowhere else.\n\nThe transaction HAS NO HASH. Etherscan shows nothing.. PS - It's not even an ETH transaction.\n\nWe will NOT cancel the transaction, you owe us money due to your error. I swear you all aren't even READING!\n\n\r\n\nThere is NO BLUE LIGHTNING BUTTON.\n\nNext?",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i8q8kyb",
                                                                            "author": "Warleg",
                                                                            "score": 1,
                                                                            "created_utc": 1652641719.0,
                                                                            "response": "Deposit $400 in our account and I will cancel the transaction. That's the money you have cost us. I'll wait.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i8qklzp",
                                                                                    "author": "Warleg",
                                                                                    "score": 1,
                                                                                    "created_utc": 1652647053.0,
                                                                                    "response": "So the generic script response didn't work, now what Coinbase?",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8mz53f",
                    "author": "Kiwip0rn",
                    "score": 1,
                    "created_utc": 1652573371.0,
                    "response": "Don't be ridiculous 🙄",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ojs42",
                    "author": "mickeywickey1105",
                    "score": 1,
                    "created_utc": 1652611206.0,
                    "response": "Coinbase pays people to go on reddit and blow them🙄",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8mxnp4",
                    "author": "DisgruntledSalt",
                    "score": 0,
                    "created_utc": 1652572627.0,
                    "response": "No they’re not my wallet magically locked me out and yes I have seed phrase. Thankfully it was a small amount. I have 34 LRC I can’t move or sell on Coinbase pro they steal your shit",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8my46j",
                            "author": "MikeFreeland",
                            "score": 1,
                            "created_utc": 1652572857.0,
                            "response": "You seem disgruntled.\nCouldn’t help myself",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8myb4u",
                                    "author": "DisgruntledSalt",
                                    "score": 1,
                                    "created_utc": 1652572955.0,
                                    "response": "Lmao yeah the name doesn’t help",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8oxwzn",
                                            "author": "Putrid-Plant6723",
                                            "score": 1,
                                            "created_utc": 1652620626.0,
                                            "response": "Don't forget salty.. very salty too 🙃",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8mwne6",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1652572127.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8n4kxl",
                    "author": "Euphoriffic",
                    "score": 1,
                    "created_utc": 1652576133.0,
                    "response": "I don’t think do.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8nj9c7",
                    "author": "SnooBananas7377",
                    "score": 1,
                    "created_utc": 1652583873.0,
                    "response": "I am ready for another learn and earn after seeing account go down 25 percent this week",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8pohw7",
                    "author": "Tall_Run_2814",
                    "score": 1,
                    "created_utc": 1652632932.0,
                    "response": "“Not your keys, not your crypto”",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8mwuv0",
                    "author": "PlatinumSwords",
                    "score": -1,
                    "created_utc": 1652572226.0,
                    "response": "If they go bankrupt then no, and with everything going wrong in their system now, good luck trying to pull anything out. Some people have transactions pending for up to 5 hours now.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8or8ix",
                    "author": "Nathan-Stubblefield",
                    "score": 0,
                    "created_utc": 1652616673.0,
                    "response": "Several transfer requests in the last 2 days did not go through, although Coinbase sent email acknowledgements. Coinbase customer service said they could not see that the requests had been made. For the ones which did go through, it was within a few minutes. Apparently, if it does not transfer after some period, Coinbase just shrugs and forgets about it, without keeping any record if the failure. This is not businesslike. There should be an acknowledgement by email when a transfer fails because of network congestion or whatever. Customer service should be able to see requests, and there should be an accessible listing on Coinbase of successful and unsuccessful requests.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}