{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "tc3vbm",
            "title": "Are they trying to phase out Coinbase Pro?",
            "url": "https://www.reddit.com/r/CoinBase/comments/tc3vbm/are_they_trying_to_phase_out_coinbase_pro/",
            "author": "JollyJury",
            "created_utc": 1647043728.0,
            "score": 36,
            "num_comments": 80,
            "subreddit": "CoinBase",
            "selftext": "It seems like Coinbase is trying sell me on Advanced Trading whenever I open up Coinbase Pro, which essentially makes regular Coinbase operate more like the Pro version but with new improvements. So what will be the purpose of Pro once Advanced gets rolled out to every Coinbase user?",
            "stickied": false,
            "comments": [
                {
                    "id": "i0bc7ub",
                    "author": "ryuujinusa",
                    "score": 25,
                    "created_utc": 1647047195.0,
                    "response": "So long as they phase out the CB fees.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i0bcl2k",
                    "author": "mindoflines",
                    "score": 10,
                    "created_utc": 1647047380.0,
                    "response": "They already said they are.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i0dtw0n",
                            "author": "MostExperienced",
                            "score": 1,
                            "created_utc": 1647102740.0,
                            "response": "Link pls. Worried about if I should move my coins to CB before they do it automatically with gas fees....",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i0b9bx3",
                    "author": "BWallis17",
                    "score": 20,
                    "created_utc": 1647045762.0,
                    "response": "Just a hunch, but I get the feeling they will discontinue CB Pro in the next year given CB will support all the same features. It would not make any sense for them to continue with two separate trading platforms.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i0bbxw1",
                            "author": "wisdomsharerv2",
                            "score": 28,
                            "created_utc": 1647047059.0,
                            "response": "I wish the fees from CB Pro will be the same on regular Coinbase",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i0f3hzi",
                            "author": "Justsayingsometimes",
                            "score": 5,
                            "created_utc": 1647121775.0,
                            "response": "If they do that and not keep the same fee structure of pro they will have a mass exit. Would not be smart",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i0cs204",
                            "author": "chrisc8869",
                            "score": 1,
                            "created_utc": 1647080452.0,
                            "response": "or maybe they'll do what gemini does with their active trader and have one app with the \"pro\" trading",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i0bfsdu",
                    "author": "Shinjirojin",
                    "score": 8,
                    "created_utc": 1647048975.0,
                    "response": "If they discontinue it I hope they transfer everyone's dust to them and not steal it",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i0cg016",
                            "author": "AlDente00",
                            "score": 3,
                            "created_utc": 1647070412.0,
                            "response": "I’m slightly optimistic there only because they are publicly traded and have an obligation to shareholders (and the IRS) to keep accurate records of all financial transactions and holdings. I believe the cumulative sums of CB pro wallet dust would be recorded as liabilities on their balance sheet. If they suddenly disappear or move to another classification on the balance sheet without proper explanation, they would be opening themselves up to accusations of misrepresentation of financials at the very least. I’m sure there’s some sketchy attorney somewhere with a loophole or shaky interpretation of precedent to essentially allow CB confiscate the dust, but they’d have to want to take that risk. As with most companies, their risk officer will probably analyze and present the C-suite with a cost benefit analysis of some options. They may decide that stealing the cumulative amount of dust outweighs the possible fines and effects on shareholder confidence. Might seem insignificant to some at first, but with millions of users, the total value could be tempting to them if in a pinch. We shall see…",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i0cfn2c",
                    "author": "OkTraining8579",
                    "score": 3,
                    "created_utc": 1647070129.0,
                    "response": "Didn’t coinbase buy coinbase pro? Before it was pro it was called something else if I’m not mistaken. They took a page from Zuckerberg and instead of invent new just buy them out.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i0ckzl9",
                            "author": "ohmysnoo",
                            "score": 6,
                            "created_utc": 1647074428.0,
                            "response": "GDAX",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i0bccx0",
                    "author": "tek3k",
                    "score": 2,
                    "created_utc": 1647047267.0,
                    "response": "Once they have all the bugs worked out of Advanced they will likely retire Pro. However, that process could take years.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i0c4lk1",
                            "author": "azzurri2017",
                            "score": 0,
                            "created_utc": 1647062372.0,
                            "response": "Years??  CB Pro is already obsolete now that CP limit trading is available.  Do I have any need to go to CB Pro now even?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i0c51oe",
                                    "author": "tek3k",
                                    "score": 3,
                                    "created_utc": 1647062651.0,
                                    "response": "Obsolete? Not really. I think AT has only been running for a few months and I don't know if it is available to everyone or by invitation. Nevertheless, there are three options to choose from. At some point in the future Pro will be shutdown or sold to someone else.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i0c8lgs",
                                            "author": "azzurri2017",
                                            "score": 1,
                                            "created_utc": 1647064952.0,
                                            "response": "Oh, I thought AT was new and rolled out to everyone (I just received my notice today).  What is the third option?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i0c9eon",
                                                    "author": "blue3y3_devil",
                                                    "score": 2,
                                                    "created_utc": 1647065512.0,
                                                    "response": "I don't have AT. I still use CB Pro.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i0cpp5g",
                                                    "author": "tek3k",
                                                    "score": 2,
                                                    "created_utc": 1647078414.0,
                                                    "response": "Coinbase, Coinbase Pro, Coinbase Advanced Trading",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i0bzokn",
                    "author": "Akgirl1998",
                    "score": 2,
                    "created_utc": 1647059432.0,
                    "response": "Hopefully they get the wallets fixed so they stop holding peoples funds for weeks while the investigate if they are upgrading.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i0chrmj",
                            "author": "pob125",
                            "score": 1,
                            "created_utc": 1647071793.0,
                            "response": "Dont use their wallets, its no different from storing your funds on coinbase",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i0cmjcb",
                                    "author": "Akgirl1998",
                                    "score": 1,
                                    "created_utc": 1647075736.0,
                                    "response": "That’s the issue the Coinbase part, I sent 3 deposits from another wallet to Coinbase 2 they let hit my account the one in the middle of the two which was a little larger they are holding for some odd reason but can see it processed on the stellar network you can even see it’s in the Coinbase account as it’s labeled that on the stellar network page but they are refusing to give me my funds and it’s been over 3 days and now they have to investigate it. However at first they were asking me to send yet a 4 deposit to verify it was mine. I seriously sent one before this one and one right after and they gave me those with no issue. I’m kind of upset as In the process the coin price went down so I have lost over 300$ just waiting on them to do what just hold my money.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i0bbzt6",
                    "author": "tjdiv",
                    "score": 1,
                    "created_utc": 1647047086.0,
                    "response": "I am 95% off CB Pro and back to CB.  I expect app / feature consolidation.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i0c54s2",
                            "author": "Pale_Ad_4032",
                            "score": 3,
                            "created_utc": 1647062706.0,
                            "response": "But the fees on Pro are so much cheaper? Why go back to regular CB?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i0c7g0n",
                                    "author": "stayyfr0styy",
                                    "score": 3,
                                    "created_utc": 1647064184.0,
                                    "response": "Coinbase One. No fees, and you can just use limit orders on it to avoid market fill rates if you think they are slimming you on a spread.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i0cnays",
                                            "author": "Nottobebothered02",
                                            "score": 2,
                                            "created_utc": 1647076382.0,
                                            "response": "Where you picked as a beta tester? I hope they release it soon.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i0bb3na",
                    "author": "anonj123",
                    "score": 1,
                    "created_utc": 1647046640.0,
                    "response": "The answer to your question is yes.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i0dm7py",
                    "author": "Ambitious_Pirate_584",
                    "score": 1,
                    "created_utc": 1647099390.0,
                    "response": "Not good news.  Only reason I still somewhat invest in crypto on a semi regular basis (once a month on a dip) is due to the insanely low fees CB PRO offers as well as there ease of use to anyone with half a brain. The only way without huge amounts of luck that a person like myself who maybe puts in 10 to 50 dollars at a time and il break that 50 into 4 or 5 limit orders sometimes on the same coin this would not be a feasible strategy any longer, if I had put all my money I to just a few orders becuz of the fees I can guarantee I'd have much higher DCA or orders not filled at all.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i0f1qne",
                    "author": "Justsayingsometimes",
                    "score": 1,
                    "created_utc": 1647120982.0,
                    "response": "The fees on reg coinbase still much higher.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i0hf33b",
                    "author": "prtaz30",
                    "score": 1,
                    "created_utc": 1647172985.0,
                    "response": "I was new to coinbase and decided to get just coinbase, I thought coinbase pro was beyond my level. I got hacked and the hacker traded my life savings to eth then traded it to a coinbase pro wallet. I contacted coinbase to find out who's coinbase pro wallet they sent it to and was first told customer service didn't deal with cb pro and only emails worked for it. Then I was shocked to find out days later the pro account belonged to me. I informed them I never signed up for the pro  And they inform me by signing in with the same credentials you automatically get the pro which I found to be ridiculous Since it's a whole different thing Coinbase will not take responsibility and Cannot explain to me why they gave me a pro account that I never wanted with the same credentials And they're very big on telling you make sure you keep your credential safe. why would someone have the same credentials for 2 different accounts which is what they tell you not to do. Does anyone know why a hacker would have to send it to the pro account?  I find it funny that coinbase basically helps them steal from  their customers By giving them a pro account with the same credentials, so if  one gets hacked both get hacked. I wonder if they're trying to phase it out because many people are getting robbed this way. Probably not because they don't care cause they did not try to help me or explain to me why they gave me a pro account With the same credentials",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i0nuepv",
                    "author": "ATXNate72",
                    "score": 1,
                    "created_utc": 1647289549.0,
                    "response": "Coinbase only offers API for developers in Coinbase Pro so I doubt it will get phased out.  Coinbase now has advanced Trading but I think the fees still apply vs Coin Base Pro they don't.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i0rl4t2",
                    "author": "Train-Embarrassed",
                    "score": 1,
                    "created_utc": 1647361328.0,
                    "response": "Anyone who’s with Coinbase, better watch your funds at least every hour.\n\nThey have a prepared list of excuses that’s truly sad from such an institution.  The only people benefiting from Coinbase are those on the inside who put your money in their pockets while blaming you and your entire internet existence.\n\nSomething stinks more and more at “The ‘Base” and the Feds are on them like flies on a rib-roast.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i0bmjib",
                    "author": "EmanEwl",
                    "score": -1,
                    "created_utc": 1647052391.0,
                    "response": "They should is dumb.  Gemini doesnt have you download 2 separate apps. You simply use the website version and you get a discount",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i0c4k0e",
                            "author": "Kiwip0rn",
                            "score": 3,
                            "created_utc": 1647062345.0,
                            "response": "You don't need the Pro App to play on Pro with your mobile device (in fact I don't ever recommend the Pro App) the phone's browser works just fine.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i0bwucy",
                    "author": "blscratch",
                    "score": -1,
                    "created_utc": 1647057861.0,
                    "response": "Didn't I see advanced trading had a monthly fee?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i0b54yq",
                    "author": "AutoModerator",
                    "score": 0,
                    "created_utc": 1647043728.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}