{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "utwpch",
            "title": "Litecoin (LTC) deposit missing??",
            "url": "https://www.reddit.com/r/CoinBase/comments/utwpch/litecoin_ltc_deposit_missing/",
            "author": "dnotel",
            "created_utc": 1653054979.0,
            "score": 1,
            "num_comments": 24,
            "subreddit": "CoinBase",
            "selftext": "A deposit with 14 confirmations is not even showing up in my coinbase account. The status page says everything is working fine - what's going on?",
            "stickied": false,
            "comments": [
                {
                    "id": "i9bw2ws",
                    "author": "Kiwip0rn",
                    "score": 3,
                    "created_utc": 1653055228.0,
                    "response": "🙄 did you even glance over the posts to see that your question was already asked, or are you more special than the others asking?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9bw6rp",
                            "author": "dnotel",
                            "score": -1,
                            "created_utc": 1653055273.0,
                            "response": "no, but you seem special",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9bwt4h",
                                    "author": "coinbasesupport",
                                    "score": 0,
                                    "created_utc": 1653055534.0,
                                    "response": "Hi there. We'd be happy to look into this for you. If you have a case number, could you please share it with us? If you don't have one, you can obtain it by submitting a support ticket here: https://help.coinbase.com/en/contact-us and our support team will follow up with you. Thanks.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9bvhvd",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653054979.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9bvyhp",
                    "author": "coinbasesupport",
                    "score": 1,
                    "created_utc": 1653055176.0,
                    "response": "Hi there, thanks for reaching out about this. Have you created a case about this issue? If so, can you please share with us your case number? If not, no worries, you can create a case here: https://help.coinbase.com/en/contact-us/ so that we can investigate this issue for you. Thank you!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9c9vg1",
                            "author": "dnotel",
                            "score": 1,
                            "created_utc": 1653060799.0,
                            "response": "I've messaged you my case ID",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9cagbw",
                                    "author": "coinbasesupport",
                                    "score": 1,
                                    "created_utc": 1653061027.0,
                                    "response": "Sorry dnotel, at this time we are not providing message support on Reddit, can you please share with us your case number here, and we'll take a look into it with you. We appreciate your understanding.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9c1naq",
                    "author": "widechunk",
                    "score": 1,
                    "created_utc": 1653057518.0,
                    "response": "I'm experiecing the same thing, my transaction already has 24 confirmations and my wallet is still missing the LTC. It seems everyone is experiencing problems with LTC deposit, I've sent a ticket to support.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9c295y",
                            "author": "coinbasesupport",
                            "score": 1,
                            "created_utc": 1653057759.0,
                            "response": "We saw some delays with Litecoin a few hours ago, but we understand it was resolved.  We'll keep an eye out if the delays may be occurring again, and will let our teams know.  If you are getting confirmations it means your transaction is still processing, and you may not see your deposit until the confirmations are fully completed.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9c38io",
                                    "author": "widechunk",
                                    "score": 1,
                                    "created_utc": 1653058150.0,
                                    "response": "Alright but shouldn't the transaction show on the Wallet tab with \"Pending\", that's missing. Also, the LTC address that shows on coinbase page is different from what I used to deposit to, the new address doesn't even show on Settings > Crypto addresses.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9c4w28",
                                            "author": "coinbasesupport",
                                            "score": 1,
                                            "created_utc": 1653058814.0,
                                            "response": "It should show there, and if confirmations haven't started yet you may still be able to cancel it.  Is this is on app or web browser after refreshing?  If you have a moment, please check both devices if possible and let us know if it's the same.  We'll get this info over to our teams to look into potential delays.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9c5lf7",
                                                    "author": "widechunk",
                                                    "score": 1,
                                                    "created_utc": 1653059097.0,
                                                    "response": "It doesn't show both on Desktop and Android. The transaction already has 42 Confirmations it can not be canceled.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9c6qfs",
                                                            "author": "coinbasesupport",
                                                            "score": 1,
                                                            "created_utc": 1653059552.0,
                                                            "response": "Appreciate you providing this info, we'll pass it on.  You mentioned having a ticket open as well, please share this with your specialist by replying to your email thread in case they need to dig deeper.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9c7nwn",
                                                                    "author": "widechunk",
                                                                    "score": 1,
                                                                    "created_utc": 1653059926.0,
                                                                    "response": "Alright. I've sent all the information. I hope the issue can be resolved and everyone receive their crypto.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                },
                                                                {
                                                                    "id": "i9c7o9f",
                                                                    "author": "exclAIM1337",
                                                                    "score": 1,
                                                                    "created_utc": 1653059929.0,
                                                                    "response": "Can you get someone to take a look at Case# 11928357?\nIt's been almost 3 hours since I sent some LTC and your platform claims it has 2266242 confirmations, yet it's still pending and I can't find it on the block explorer?",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9c8pk1",
                                                                            "author": "Thickdisco",
                                                                            "score": 1,
                                                                            "created_utc": 1653060339.0,
                                                                            "response": "Dont worry I am in the same position as you so I don't presume it's just you and me experience the same issues just have to be patient",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i9c9h0j",
                                                                                    "author": "exclAIM1337",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653060640.0,
                                                                                    "response": "Sucks you're having the same issue, but at least I'm not alone, just hoping this gets sorted soon.",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "id": "i9c9bs1",
                                                                            "author": "coinbasesupport",
                                                                            "score": 1,
                                                                            "created_utc": 1653060583.0,
                                                                            "response": "Hi u/exclaim1337, thank you for sharing that with us. We're very sorry to hear you've been experiencing this issue, unfortunately we were unable to find a case with the number you provided, could you please double-check and see if that is the correct case number? We'd like to look into this for you.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "id": "i9cd44g",
                                                                    "author": "widechunk",
                                                                    "score": 1,
                                                                    "created_utc": 1653062079.0,
                                                                    "response": "I can confirm that I've received my LTC, right now. Thank you for the support.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9cduvc",
                                                                            "author": "coinbasesupport",
                                                                            "score": 1,
                                                                            "created_utc": 1653062372.0,
                                                                            "response": "Glad to hear it, thanks for the update!",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "id": "utwma1",
            "title": "Question About KYC",
            "url": "https://www.reddit.com/r/CoinBase/comments/utwma1/question_about_kyc/",
            "author": "deaddoll_x",
            "created_utc": 1653054802.0,
            "score": 3,
            "num_comments": 14,
            "subreddit": "CoinBase",
            "selftext": "Do I have to confirm my identity again, re-send any documents, or deal with customer support in any way if I change my phone but retain the same number? Asking for CB and CB Pro.\n\nThanks!",
            "stickied": false,
            "comments": [
                {
                    "id": "i9bvix4",
                    "author": "Kiwip0rn",
                    "score": 2,
                    "created_utc": 1653054991.0,
                    "response": "Generally not, if you keep the same phone number.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9bwc9s",
                            "author": "deaddoll_x",
                            "score": 1,
                            "created_utc": 1653055339.0,
                            "response": "Okay thans! Literally dropped my phone this morning and I think it's dying 😭. I was due for an upgrade anyways.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9bx0v7",
                                    "author": "Kiwip0rn",
                                    "score": 2,
                                    "created_utc": 1653055625.0,
                                    "response": "I get a new phone every other year, so I have changed phones 3 or 4 times. It has never triggered anything with KYC.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9bxbe1",
                                    "author": "coinbasesupport",
                                    "score": 2,
                                    "created_utc": 1653055748.0,
                                    "response": "Hi u/deaddoll_x, sorry to hear about your phone! You may have to perform a device confirmation regardless if you have the same phone number. Coinbase uses Device Verification, a security feature that requires all devices (mobile and computer) and IP addresses to be authorized before accessing your account. This process should only need to be completed once for each device or location. You can read more here: https://help.coinbase.com/en/coinbase/getting-started/verify-my-account/device-confirmation-troubleshooting Hope this helps!",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9bxjhz",
                                            "author": "deaddoll_x",
                                            "score": 1,
                                            "created_utc": 1653055842.0,
                                            "response": "Helpful Coinbase customer support? 🤨 I don't believe it...",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9by7gm",
                                                    "author": "coinbasesupport",
                                                    "score": 2,
                                                    "created_utc": 1653056118.0,
                                                    "response": "😊 We're always happy to help, u/deaddoll_x! If you run into any issues, please let us know.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9bv2us",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653054802.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "utwhxq",
            "title": "Tezos Staking Update from Coinbase?",
            "url": "https://www.reddit.com/r/CoinBase/comments/utwhxq/tezos_staking_update_from_coinbase/",
            "author": "dakaroo1127",
            "created_utc": 1653054544.0,
            "score": 2,
            "num_comments": 37,
            "subreddit": "CoinBase",
            "selftext": "Late March is the last time I received staking rewards for XTZ. Received an email about the issue two weeks into it but still no official word?",
            "stickied": false,
            "comments": [
                {
                    "id": "i9bvz1y",
                    "author": "coinbasesupport",
                    "score": 2,
                    "created_utc": 1653055183.0,
                    "response": "Appreciate the follow up here u/dakaroo1127.\n\nIf you have raised any missing XTZ staking rewards with us, would you kindly share your email case number?  Happy to follow this up for you!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9bw8em",
                            "author": "dakaroo1127",
                            "score": 1,
                            "created_utc": 1653055292.0,
                            "response": "I haven't made a formal email complaint, was more so seeing if it's just a select few accounts at this point or still a known issue.\n\nThanks",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9vuncf",
                                    "author": "Phuzzed",
                                    "score": 1,
                                    "created_utc": 1653444192.0,
                                    "response": "Why does this account even bother to reply? Lol come on Coinbase get a clue",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9vt584",
                            "author": "Phuzzed",
                            "score": 1,
                            "created_utc": 1653443487.0,
                            "response": "Why even reply to this thread and not look back? We can tell the “official” Coinbase Reddit account is just for show. \n\nIf the account had been following anything or was at least partially aware they would know: Coinbase hasn’t paid Tezos staking SINCE MARCH 30 to ALL Coinbase customers.  Since the last tezos chain upgrade. \n\nThis is not some “let me help you by following up on your ticket” bullshit. Coinbase has replied to several customers and there have been several posts about this. “Coinbase knows there an issue and will pay you for all interest owed. We are keeping track”\nHonestly if Coinbase doesn’t have the technical team to fix this minor issue in two months, I’m not sure I want them ti be my exchange. They could have any reason: too busy, hiring, securing  funding for crypto winter, whatever. It doesn’t matter, I fail to understand how they cannot fix this. The rest of the tezos ecosphere is unaffected and paying staking rewards.  Why pay Coinbase their high staking fees, if they can’t even fix a problem in two months? \n\nCome on Coinbase. Do better.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9bvt2f",
                    "author": "Kiwip0rn",
                    "score": 1,
                    "created_utc": 1653055111.0,
                    "response": "🙄 I would think the email of \"we are working on it\" would be official enough for you 🤷‍♂️",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9bwk6g",
                            "author": "dakaroo1127",
                            "score": 0,
                            "created_utc": 1653055432.0,
                            "response": "An email a month ago for a staking reward that's supposed to occur every ~3 days isn't sufficient",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9bxgcl",
                                    "author": "Kiwip0rn",
                                    "score": 1,
                                    "created_utc": 1653055805.0,
                                    "response": "Perhaps you can swing-by the offices and fix it faster? It doesn't matter, you will get the intrest when it is fixed like everyone else.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9by9s2",
                                            "author": "dakaroo1127",
                                            "score": 0,
                                            "created_utc": 1653056145.0,
                                            "response": "Interest*\n\nI think it matters because I assumed it had restarted sometime after that email and it never was. I know staking is still working for Tezos so it's clearly a platform issue and some clarification would be appreciated. Go back to losing Luna.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9bz2bh",
                                                    "author": "Kiwip0rn",
                                                    "score": 2,
                                                    "created_utc": 1653056469.0,
                                                    "response": "Swing-by the offices and fix it 🤷‍♂️ the only clarification you need is \"It is not working right now, it will work when the problem is corrected\".",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9buheg",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653054545.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}