{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uwn5f8",
            "title": "Account deleted for no reason, can't create a new one",
            "url": "https://www.reddit.com/r/CoinBase/comments/uwn5f8/account_deleted_for_no_reason_cant_create_a_new/",
            "author": "alextsandekidis",
            "created_utc": 1653385997.0,
            "score": 1,
            "num_comments": 7,
            "subreddit": "CoinBase",
            "selftext": "I was trying to set up an account but couldn't finish it as the system had been asking me to verify my permanent address and I don't have one at the moment, and then all of a sudden I got an email saying that my account is deleted due to violation of rules. I've tried creating a new one with different other emails of mine but they all got deleted almost instantly. I've never traded any crypto on the platform and have never done anything illegal related to Coinbase. I would appreciate your help in restoring my account or creating a new one.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9sf6aa",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653385998.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9sfkic",
                    "author": "coinbasesupport",
                    "score": 1,
                    "created_utc": 1653386358.0,
                    "response": "Hi u/alextsandekidis.\n\nThanks for letting us know. If you don't have a permanent address that you can verify, you won't have full access to the app. You can find more info [here](https://help.coinbase.com/en/coinbase/managing-my-account/verify-my-identity/eu-verification-levels-faq)\n\nIf you would like to speak to support you can also send them a message [here](https://help.coinbase.com/en/contact-us)\n\nLet us know if you need anything else.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9sfoxm",
                            "author": "alextsandekidis",
                            "score": 1,
                            "created_utc": 1653386464.0,
                            "response": "Yep I got that, but why has my account been deleted because of that? And as I see there's no more opportunity for me to create a new one, how's that so?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9sg219",
                                    "author": "coinbasesupport",
                                    "score": 1,
                                    "created_utc": 1653386774.0,
                                    "response": "Thanks for getting back to us, u/alextsandekidis.\n\nWe'd need to review your account to see what ha happened. Can you send our support team a message using the link given previously?\n\nOnce you have a case number, you can get back to us here, and we can follow up.\n\nThanks for your cooperation.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9sg791",
                                            "author": "alextsandekidis",
                                            "score": 1,
                                            "created_utc": 1653386900.0,
                                            "response": "I've already contacted your support team, my case number is #11965392.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9sga7y",
                                                    "author": "coinbasesupport",
                                                    "score": 1,
                                                    "created_utc": 1653386973.0,
                                                    "response": "Thanks for the info, u/alextsandekidis.\n\nWe're going to research your case, no need to reply, we'll be right back to you.\n\nWe appreciate your patience.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i9sgw84",
                                                    "author": "coinbasesupport",
                                                    "score": 1,
                                                    "created_utc": 1653387487.0,
                                                    "response": "Thanks for waiting while we reviewed your case, u/alextsandekidis.\n\nWe can see that a member of our specialist team replied to you 20 minutes ago by email with an update. Please reply to their email if you need any further help as there are no further actions we can take here on social media.\n\nWe appreciate your cooperation.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "id": "uwn9ag",
            "title": "Coinbase is garbage when you actually need support.",
            "url": "https://www.reddit.com/r/CoinBase/comments/uwn9ag/coinbase_is_garbage_when_you_actually_need_support/",
            "author": "Hungry_Investment_32",
            "created_utc": 1653386451.0,
            "score": 32,
            "num_comments": 59,
            "subreddit": "CoinBase",
            "selftext": "Having issues with the app not displaying the portfolios and they want me to try another phone. Apparently whatever turd world country they're from gives out free smart phones like dog ticks. Other big issue is the stupid ACH limits. What supposed additional security is it to keep changing my daily ACH Limit yet keeping my withdrawal limit at 250k. They can't seem to even comprehend 2nd grade English. What part of ACH deposit has anything to do with me needing you to send me a link about crypto currency transfers on ACH holds? Man I've seen some dumb ass shit but Coinbase is legit fucking retarded. Had a rep on the phone, transferred 3 times to \"another dept that will handle that\" only to have the supposed expert say \" that's not my specialty\" WTF is? So far every question I've asked has been answered with another dept will handle that or that's not my speciality. Brian Armstrong can suck ten dix.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9tjezy",
                    "author": "jhanon76",
                    "score": 10,
                    "created_utc": 1653407765.0,
                    "response": "Lemme guess you lost your life savings?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9uvoo7",
                            "author": "1HappyGuy1",
                            "score": 2,
                            "created_utc": 1653427936.0,
                            "response": "It should be a lesson, using your life’s saving on highly volatile crypto is very foolish.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9v72up",
                            "author": "krimkryz",
                            "score": 1,
                            "created_utc": 1653433029.0,
                            "response": "Coinbase is absolute shit. Might be easier to swallow losing your life savings on any other platform",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9tw4sj",
                    "author": "Connect-Ad-1088",
                    "score": 3,
                    "created_utc": 1653412955.0,
                    "response": "i have never had a problem on cb.  could i someday?  sure.  would i put my life savings on coinbase?  ah no.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9twic4",
                            "author": "Hungry_Investment_32",
                            "score": 0,
                            "created_utc": 1653413109.0,
                            "response": "I haven't either until now. I've been trading there since inception. Agreed as well not trying to trust any company with my life savings all in one basket.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9uf36q",
                                    "author": "highboulevard",
                                    "score": 1,
                                    "created_utc": 1653420881.0,
                                    "response": "Bruh. Life savings in Coinbase? Get a ledger. I move what I need to Coinbase and use it, but my main portfolio is in a ledger.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9umie0",
                                            "author": "Hungry_Investment_32",
                                            "score": -1,
                                            "created_utc": 1653424002.0,
                                            "response": "I think most people here are agreeing that nobody ever said they put their life savings in coinbase in this thread. As far as ledgers and wallets yeah we all understand how to hold coins offline. I am however a scalper and that takes realtime active got large amounts to make my return goals daily and on. So it's a bit different and not that simple.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9tzt9k",
                    "author": "Kiwip0rn",
                    "score": 3,
                    "created_utc": 1653414474.0,
                    "response": "🙄 You have the same complaint about Uphold and Kucoin last week, now it is Coinbase? \n\nHow many exchanges, that do the exact same things, before you realize that it is the standard and not exceptional, that the problem might be YOU and not every exchange ever in existence?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9uo0km",
                            "author": "Hungry_Investment_32",
                            "score": -1,
                            "created_utc": 1653424634.0,
                            "response": "Like I said comprehension is key. Not one thing I've mentioned from Amy of those is the same process. So no the problem is them offering services to people like YOU pointing fingers at people like Me for having an actual worthwhile opinion. That's some funny shit right there.  99% of the issues posted here are from people like you that made mistakes from lack of knowledge and self education, this is not the same. Good luck in life.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9urusv",
                                    "author": "Kiwip0rn",
                                    "score": 2,
                                    "created_utc": 1653426270.0,
                                    "response": "99% of the issues are from people like me? 🤔🤣🤣😂😅\n\nMember of Coinbase since 2014, never had a single serious issue ever with Coinbase. Every contact with Coinbase Custody Customer Support (? 4 or 5 times ever?) has been a positive experience, and even once they fix an issue in my favor (a Stop/Sell failed as a coin continued to climb, instead of forcing the sale at the Stop/Sell price they gave me my coins and cleared the Stop/Sell). Something they didn't have to do for me, and wasn't expected, all I said was \"just clear the order, and return the coins\" and they did... we both knew my Net was going to be higher.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9uwued",
                                            "author": "Hungry_Investment_32",
                                            "score": 0,
                                            "created_utc": 1653428443.0,
                                            "response": "Nice emojis neckbeard lol, kids these days.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9uzdpq",
                                                    "author": "Kiwip0rn",
                                                    "score": 2,
                                                    "created_utc": 1653429550.0,
                                                    "response": "Thanks! I like to stay up to date with what is cool 😎 with the kids, now that I am almost 50, because they are leading use into the future.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i9usotl",
                                    "author": "Kiwip0rn",
                                    "score": 1,
                                    "created_utc": 1653426629.0,
                                    "response": "And your \"opinion\" isn't worth anything to anyone. You have the exact same \"opinion\" of Uphold and others as Coinbase while they are doing the same things \"to you\". If everyone else is doing something you don't like, perhaps it is your \"opinion\" is faulty (or just bad for business). \n\nWhy is EVERY Crypto Exchange doing the same things \"to you\"? Perhaps you don't know what YOU are doing? 🙄",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9uv88k",
                                            "author": "Hungry_Investment_32",
                                            "score": 0,
                                            "created_utc": 1653427734.0,
                                            "response": "Again, read. That's all I ask. Quote me and show where I said the same thing about these exchanges. If my opinion is so far off then why are you the only one here shilling how great your experience has been? Most of the time people like you spout of nonsense it's really a projection of their own issues and they're too dense to see that. So get your mirror out and do some self reflection. 65 day holds on ACH deposits is a scam for them to hold you hostage and make returns off your cash for their benefit. Period. Lack of support from Coinbase is the largest issue as agreed by most posts here. Disagree? Then show me the stats. I'm okay with someone disagreeing but you aren't even stating anything of fact. Just trying to argue opinions where my case is factual reasoning. Get a life. You're clearly off balance. Good luck in life.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9uz0kg",
                                                    "author": "Kiwip0rn",
                                                    "score": 2,
                                                    "created_utc": 1653429392.0,
                                                    "response": "I looked through your page, you said the exact same thing on the Uphold page.🤷‍♂️ it is almost a Copy/Paste with Uphold changed to Coinbase.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9uy3uj",
                                            "author": "Hungry_Investment_32",
                                            "score": 0,
                                            "created_utc": 1653429000.0,
                                            "response": "If you're done here spouting off at the mouth I've got real shit to do like watch my portfolio fill up and play Roblox with my kid.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9uyqaj",
                                                    "author": "Kiwip0rn",
                                                    "score": 2,
                                                    "created_utc": 1653429269.0,
                                                    "response": "No",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9uo21t",
                            "author": "Hungry_Investment_32",
                            "score": 0,
                            "created_utc": 1653424652.0,
                            "response": "Like I said comprehension is key. Not one thing I've mentioned from Amy of those is the same process. So no the problem is them offering services to people like YOU pointing fingers at people like Me for having an actual worthwhile opinion. That's some funny shit right there.  99% of the issues posted here are from people like you that made mistakes from lack of knowledge and self education, this is not the same. Good luck in life.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9uo3jd",
                            "author": "Hungry_Investment_32",
                            "score": 0,
                            "created_utc": 1653424669.0,
                            "response": "Like I said comprehension is key. Not one thing I've mentioned from Amy of those is the same process. So no the problem is them offering services to people like YOU pointing fingers at people like Me for having an actual worthwhile opinion. That's some funny shit right there.  99% of the issues posted here are from people like you that made mistakes from lack of knowledge and self education, this is not the same. Good luck in life.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9sg4rb",
                    "author": "coinbasesupport",
                    "score": 1,
                    "created_utc": 1653386840.0,
                    "response": "Hi there! We are sorry to hear about your experience. Kindly share your case number with us, so we can take a look into it. If you don’t have a case number, please submit a ticket here: https://help.coinbase.com/en/contact-us our support team will follow up with you. Thanks.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9sgny3",
                            "author": "Hungry_Investment_32",
                            "score": 7,
                            "created_utc": 1653387295.0,
                            "response": "Which case number do you want, you've closed every one without any follow up or resolution, hence the phone call. More boosheet",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9u5x7x",
                    "author": "Thecovesboss",
                    "score": 1,
                    "created_utc": 1653417019.0,
                    "response": "Yup. Pull everything out.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ujyvy",
                            "author": "webghosthunter",
                            "score": -1,
                            "created_utc": 1653422928.0,
                            "response": "Exactly what I did. My coinbase balance is 0.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9u80m5",
                            "author": "Hungry_Investment_32",
                            "score": 0,
                            "created_utc": 1653417900.0,
                            "response": "Honestly I think I might. I have been using them for a while with zero issues but came to realize when I needed support they are lacking in a huge way. I guess it's the American way now. Build something that could possibly be great, even inspired by a global economic movement outside of government confines, construct, and manipulation. Yet destroy it from within with poorly optimized processes and inadequate workers.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9u9zzf",
                    "author": "OneWorldMouse",
                    "score": 1,
                    "created_utc": 1653418737.0,
                    "response": "Yep coinbase is a bullshit company. How they can get away with being a public company is beyond me. I thought they'd be shutdown or sued out of existence by now. I'm on my 2nd bag of popcorn.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9sl8k8",
                    "author": "detunedmike",
                    "score": 0,
                    "created_utc": 1653390838.0,
                    "response": "Apparently the fact they have shit support and will quite literally tell you to fuck off when in dire need of support is baked in to their Terms and Conditions. \n\nI was surprised to read there are internal SLAs surrounding how quickly they are required to ignore and dismiss customers in need of support. I should have read them earlier.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9twl4z",
                            "author": "Connect-Ad-1088",
                            "score": -1,
                            "created_utc": 1653413140.0,
                            "response": "want no support?  try voyager, one has to dm the ceo on twitter to get anything done at voyager.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9v43xh",
                    "author": "t00rshell",
                    "score": 1,
                    "created_utc": 1653431660.0,
                    "response": "Heh I used coinbase for a few years, it took one experience with their customer service dept for me to close out and get every last dollar I had off that platform.\n\nNot regulated like a bank has its downsides, you get fucking morons over of all things email with a 24 hour delay baked in.\n\nit's pure garbage.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9v4udd",
                            "author": "Hungry_Investment_32",
                            "score": 0,
                            "created_utc": 1653431995.0,
                            "response": "Where are you trading now? Pros and cons. If you don't mind the time.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9suxbq",
                    "author": "zionmatrixx",
                    "score": -1,
                    "created_utc": 1653396749.0,
                    "response": "They are garbage even when you don't need support. Shady tactics on their exchanges, shady business practices. Everyone knows this.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9sgk66",
                    "author": "xicor",
                    "score": 0,
                    "created_utc": 1653387207.0,
                    "response": "is it sad that I know exactly which copy and paste blurb about ach hold you are talking about? last time I felt with support I got that pasted like 10 times because I was explaining that they had locked my funds significantly longer than the normal hold time (almost 3x).\n\nby the end of it I was threatening to sue.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9sgtgl",
                            "author": "Hungry_Investment_32",
                            "score": 0,
                            "created_utc": 1653387425.0,
                            "response": "It's insane the amount of money they make off of fees and we get zero real support.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9twfy2",
                                    "author": "Connect-Ad-1088",
                                    "score": 2,
                                    "created_utc": 1653413082.0,
                                    "response": "exchanges make money via fees, i have not found any trading mechanism that is not fee based.  what free exchange are you using?  throw us all a bone.  oh they all charge fees?  WTF?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9tx7yk",
                                            "author": "Hungry_Investment_32",
                                            "score": 1,
                                            "created_utc": 1653413404.0,
                                            "response": "I assume this is the guy with his shiny new free account following me around to get me back for telling him to quit crying about his miner stuck in Russia. Lol get a life sister. Bigger and better ways to make money and I promise you, you don't want to fuck around. Did granny let you boot up AOL again and start your business? Get back in the basement and fold her clothes and leave the rest to the us. We got it.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i9tyoxg",
                                            "author": "Sabast-",
                                            "score": -2,
                                            "created_utc": 1653414012.0,
                                            "response": "Don't be naive. The amount of money they make on fees is a drop in the bucket. They literally could offer free trades and make just as much, but that would advertise their real business model: Using *your* money to front-run your own (and others) orders. They coins they show you that you have? Those are IOUs. Until you cash them out, your money is working for *them*.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9u0pk6",
                                                    "author": "Hungry_Investment_32",
                                                    "score": 1,
                                                    "created_utc": 1653414841.0,
                                                    "response": "How am I being naive? I didn't say a word about other ways they do or don't make money. I simply stated they make a fortune off of fees alone and put it into perspective on a small scale. Not sure how that makes me naive. I kept it basic. You should try that before trying to seem superior. If 9 billion on a low ball daily is a drop in the bucket then you need to either publish your trade process papers to share with us plebs or get a mental evaluation. Have a great day.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9u4j34",
                                                            "author": "Sabast-",
                                                            "score": 0,
                                                            "created_utc": 1653416435.0,
                                                            "response": "That's a common phrase with, I believe, a commonly understood shorthand meaning of, \"I found that statement to seem naive\". Not, \"*you total n00b, why you fall off turnip cart yesterday*\". I didn't mean to offend you personally.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9u5pd5",
                                                                    "author": "Hungry_Investment_32",
                                                                    "score": 2,
                                                                    "created_utc": 1653416927.0,
                                                                    "response": "Fair enough. Where I'm from it is a passive aggressive insult inferring that a person is less than or intellectually inferior. Generally it's the other way around because the person doesn't understand the words or phrases they are using. Which I suppose makes them naive. Weird.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9uclit",
                                                                            "author": "Sabast-",
                                                                            "score": 0,
                                                                            "created_utc": 1653419838.0,
                                                                            "response": "Well I could be wrong as well.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9twt4e",
                                            "author": "Hungry_Investment_32",
                                            "score": 0,
                                            "created_utc": 1653413232.0,
                                            "response": "It's not about if one does or doesn't charge fees. If they earn one dollar from each customer per day that's like 9 billions dollars. The point is you'd think a company earning money off of trades with a decent platform would offer great support for said platform. I don't know if you're trying to pick a fight or just dense but it won't go over well. Have a good day lady.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9tafn4",
                    "author": "Holyballs92",
                    "score": -1,
                    "created_utc": 1653404007.0,
                    "response": "Yes they may shut down your ability to buy and send crypto if they see you moved your coins off the exchange \n\nThat's my issue with them currently I got some eth I wanna move to my cold wallet and I'm not allowed to",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9uj3os",
                    "author": "lazysmartdude",
                    "score": 0,
                    "created_utc": 1653422559.0,
                    "response": "tell me about it. I bought dogfood with my debit card and first attempt was declined despite 2x necessary funds. 2nd attempt worked fine but when i looked in my app i had been charged twice despite card reader saying declined in store. \n\nThe debit department said i should get the funds back right away but i didn't so they sent me to the account specialist dept who said well shows that transaction as completed so that's that but that rep transferred me to their superior who told me the basically the same thing and then said i can speak with debit card department. but as you will have read i already did that. \n\nAnyway i called the store they told me nope only 1 purchase of dog food associated with your phone number. now i am waiting for a reply to my email from this morning which is a reply to them asking me for more details.... \n\ntl;dr not worth the 2% rewards, will die on the hill of $75.85 and as soon as i get it back close the debit card. \n\n@coinbasesupport don't even ask me for my ticket number in a reply. would probably only muddy the water further on your end. will continue to communicate via email and phone",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9uklnl",
                            "author": "Hungry_Investment_32",
                            "score": 1,
                            "created_utc": 1653423198.0,
                            "response": "Man that's crazy. It's issues such as this that set the crypto community behind. How can we justify the coins and purpose without a way to utilize it every day without issues like this? Ball dropped. How many ball drops does it take before people stop watching and wondering?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9umfwn",
                                    "author": "lazysmartdude",
                                    "score": 0,
                                    "created_utc": 1653423973.0,
                                    "response": "for real.  I'm obviously not placing multiple calls and sending multiple emails to do a scam for 75 bucks",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9uohua",
                                            "author": "Hungry_Investment_32",
                                            "score": 0,
                                            "created_utc": 1653424838.0,
                                            "response": "Amen.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9ubiw5",
                    "author": "spadedallover",
                    "score": 1,
                    "created_utc": 1653419384.0,
                    "response": "The only experience i have with them is with my friend. His account got compromised so he locked it. Within a couple days he changed his password and got access back.\n\nI see a lot of people have problems when they withdraw but I took most of mine out and onto a ledger and had no problems",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ummkw",
                    "author": "Hungry_Investment_32",
                    "score": 1,
                    "created_utc": 1653424051.0,
                    "response": "No it's probably a regional language thing. It's all good.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9unfmq",
                    "author": "Hungry_Investment_32",
                    "score": 1,
                    "created_utc": 1653424390.0,
                    "response": "Did I? Did you read in it's entirety?  I think you'll find that I didn't. Go back and read slowly and get back to me. Comprehension is key. Also, if exchanges have certain issues that make it harder for clients to actually trade when they're in the business of offering a trade platform that they should support, how would it be the users fault for pointing it out so others may sidestep? I can have all the opinions I want. My money, my life, my time.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9utn59",
                    "author": "Hungry_Investment_32",
                    "score": 1,
                    "created_utc": 1653427047.0,
                    "response": "That's all well and good but your attitude of coming in here and pushing your bullshit off on me and even going as far as to check my other posts which you clearly did not read makes me feel as though you are a shill and none of what you said matters or can be verified. So yea, people like you. Assholes who assume everything and say silly shit just because they see themselves as better than someone else and only read what they want to see. So that explains your poorly executed self-described trade issues. Back to comprehension. I've not had one trade fail to any degree lol. So...",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9v0n0x",
                    "author": "Hungry_Investment_32",
                    "score": 0,
                    "created_utc": 1653430101.0,
                    "response": "Oh I see. Now it all makes sense. Angry never has been willing to be lead by never will be's. That's cool. To each his own. Lead us into what by the way? A future of whining about the cost of homes all the while paying 5.00 per cup of designer coffee? Or the future of online ninja with zero real world experience that can't cope so they either shoot up a church, mall or school? Or maybe cope by taking drugs for the rest of their life for lack of actual coping mechanisms? Yeah you go all in buddy.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9v18ur",
                    "author": "Hungry_Investment_32",
                    "score": 0,
                    "created_utc": 1653430372.0,
                    "response": "You're so full of shit and just wow. Yes the opinion is the same they both suck donkey, but the reasoning, the facts. That's the entire purpose of the posts. One has 65 day hold on ACH deposits. One has shit terrible support. FACTS. They both suck because of it. How do you not see that? Your ignorance is like growing out each time  you repeat that gibberish. Let me ask this. Do you HODL or trade for profit?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9v97vb",
                    "author": "Serious_Stage",
                    "score": 1,
                    "created_utc": 1653434026.0,
                    "response": "Well said",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ufzdf",
                    "author": "Aword13",
                    "score": -1,
                    "created_utc": 1653421257.0,
                    "response": "Absolutely. I've been on the subreddit for a long time and I've always been the first one to stand up for Coinbase when people would complain about making a dumb mistake or getting blatantly scammed. But when I reached out to their customer support a while ago as a Coinbase One member I was greeted with the worst fucking customer support of my entire life. Same exact experience as you where they just had no comprehension of English and I felt like I was talking to a brick wall.  I decided to stop using Coinbase after such a bad experience and moved to Binance.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ulxru",
                            "author": "Hungry_Investment_32",
                            "score": 1,
                            "created_utc": 1653423762.0,
                            "response": "That's exactly where I am. Unfortunately there seems to be some type of hang up everywhere LOL. Kraken looked promising but their stance on ACH is killing it for me. I'm not trying to sit and make 100-500 dollar visa purchases ya know. No offense to anyone that is rather towards these companies, why are you fighting someone trying to send you 50-100k? You make money, I make money. Then on top of that, support the damn thing. It's just like wait wut?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9sfoec",
                    "author": "AutoModerator",
                    "score": 0,
                    "created_utc": 1653386451.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9tu8i4",
                    "author": "Hungry_Investment_32",
                    "score": 0,
                    "created_utc": 1653412175.0,
                    "response": "Of course I didn't lose my life savings. Just pointing out a bad process that will probably be the reason they go bankrupt. We are about to possibly see some really tough times for the next 8-18 months and if they can't even handle their app not being able to display all portfolios correctly or basic questions with actual basic answers then people are going to lose their shit when they do lose their life savings because Coinbase is ran by people's who's only expertise is transferring you and copy/pasting links to things that either have nothing to do with your problem or you've already read.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9uac37",
                    "author": "Hungry_Investment_32",
                    "score": 0,
                    "created_utc": 1653418877.0,
                    "response": "That is exactly how I feel. It's like a car crash, terrible but you just gotta look.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9v8o4f",
                    "author": "saltyload",
                    "score": 0,
                    "created_utc": 1653433768.0,
                    "response": "Support is garbage until you actually need coinbase",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}