{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uppu6l",
            "title": "Everyone seems to be moaning - We all gambled on something that's not regulated",
            "url": "https://www.reddit.com/r/CoinBase/comments/uppu6l/everyone_seems_to_be_moaning_we_all_gambled_on/",
            "author": "somersetscot",
            "created_utc": 1652560572.0,
            "score": 6,
            "num_comments": 47,
            "subreddit": "CoinBase",
            "selftext": "I've lost, mine was £140, went down to £72, nearly £80 now (No.... ETH2 cannot be cashed out, tough S\\*\\*\\*, end of!) lol. - But I knew and know I could still lose EVERYTHING",
            "stickied": false,
            "comments": [
                {
                    "id": "i8mp37c",
                    "author": "Arzharkhel",
                    "score": 5,
                    "created_utc": 1652568561.0,
                    "response": "Every market is down and you're moaning and blaming it on crypto?  Seems like you put your money into something and don't really know what you're doing.\n\nThis is coming from a guy whose portfolio is 40% down.  I've seen people's whose portfolios are 70 to 80% down.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8mumgv",
                            "author": "Dazzling_Marzipan474",
                            "score": 5,
                            "created_utc": 1652571143.0,
                            "response": "For real my stocks are doing worse than my crypto after 2 years",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8mz67f",
                                    "author": "Arzharkhel",
                                    "score": 1,
                                    "created_utc": 1652573386.0,
                                    "response": "Yeah, but to be fair things could get a lot worse for crypto imo.  Longer term I wouldn't worry too much, however.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8muje5",
                            "author": "somersetscot",
                            "score": -2,
                            "created_utc": 1652571102.0,
                            "response": "Only rich poo poo heads would call my ton a \"portfolio \" . Aw, I cry at night thinking about all those well to do people who try to get the government to bail out the companies that they've invested in.......'cause they gambled and lost! Oh oh, my apologies, I sleep deeply xxx",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8mv0p0",
                                    "author": "Arzharkhel",
                                    "score": 2,
                                    "created_utc": 1652571331.0,
                                    "response": "Ramblings that absolutely make no sense.\n\nFrom reading this it's safe to safe that you shouldn't invest in crypto and I would argue to not invest in stocks either.  You're simply not too bright it seems.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8p11vo",
                                    "author": "VPN4reddit",
                                    "score": 2,
                                    "created_utc": 1652622287.0,
                                    "response": "First time on bath salts eh?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8m8j0t",
                    "author": "Honest_Economist_283",
                    "score": 4,
                    "created_utc": 1652560859.0,
                    "response": "You made a post ranting about losing 80 euro or dollars?..if you lost 80k dollars go ahead and rant all you want.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8mavnr",
                    "author": "MeekMessenger",
                    "score": 1,
                    "created_utc": 1652561949.0,
                    "response": "It has nothing to do with \"regulation\".  You simply bought at the wrong time, unlucky.  For example IF you bought BTC when the Pandemic began at the end of March 2020, it was around $6,200.  Although it's been tanking lately, BTC is still at $29,300.  UP 473% from March 2020, IF you were the LUCKY ones who bought back then.  🤑",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8mco0b",
                            "author": "somersetscot",
                            "score": 2,
                            "created_utc": 1652562769.0,
                            "response": "Yep, I came to party late...Also my tough poo lol",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8m7wqm",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1652560572.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8m9wx5",
                    "author": "coinbasesupport",
                    "score": 1,
                    "created_utc": 1652561500.0,
                    "response": "Hey! Apologies for Do you have a case# for us to investigate further?  If not, can you please make a case here, so we can look into your issue further:\nhttps://help.coinbase.com/en/contact-us",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8odrj1",
                    "author": "thegpubaron",
                    "score": 1,
                    "created_utc": 1652606017.0,
                    "response": "Get fucked op, I'm down 100k and not complaining.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ox49f",
                    "author": "yellowN05",
                    "score": 1,
                    "created_utc": 1652620177.0,
                    "response": "My portfolio is not down, it's 100% what it was before the \"crash\". I still have the same amount of crypto I had before (actually more because of staking) and I will continue to add to it as I did before. Gambling is for fools.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8p8x1s",
                    "author": "PJKT42",
                    "score": 1,
                    "created_utc": 1652626044.0,
                    "response": "You haven’t lost anything if you didn’t sell.. also people are not so much complaining as they are venting / talking to people in similar situations.\n\nAnyway good luck with your £140, can’t imagine what would happen if you lost EVERYTHING… lol I remember when I bought my first crypto",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9623wy",
                    "author": "HqrkatMatt",
                    "score": 1,
                    "created_utc": 1652936866.0,
                    "response": "🔥 DINOSTEP.APP 🔥\n\n🦖 The First Move To Earn App With Virtual Dinosaurs\n👟 Earn while building healthy habits with the Dino\n✨ Varied NFTs\n💵 Passive Income Features\n💎 App Activation Code & NFT Drop For Fair Launch Contributors\n\n🚀 Fair Launch Starts On May 9th",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8mzfhj",
                    "author": "Kiwip0rn",
                    "score": -1,
                    "created_utc": 1652573521.0,
                    "response": "But, \"It Is Coinbase's Fault!!!\"",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8m9dfd",
                    "author": "maryupallnight",
                    "score": 0,
                    "created_utc": 1652561248.0,
                    "response": "I'm sure when you put the 140 in you said you were investing.\n\n\nAnd, only now are you saying it is gambling.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8mceiz",
                            "author": "somersetscot",
                            "score": 0,
                            "created_utc": 1652562646.0,
                            "response": "Gosh, no. I also gave my 2 daughters £100 in BTC as well, The first thing I told them was ......they can lose the lot",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "ups519",
            "title": "Sending BTC in Pending for 1 day now without TX-hash",
            "url": "https://www.reddit.com/r/CoinBase/comments/ups519/sending_btc_in_pending_for_1_day_now_without/",
            "author": "nordx",
            "created_utc": 1652567895.0,
            "score": 4,
            "num_comments": 47,
            "subreddit": "CoinBase",
            "selftext": "Hello,\n\ni just send out some bitcoins and the 2 withdrawals are in status \"PENDING\" for 1 day now, but they werent even sent out. I dont have a tx-hash.\n\nI wrote a ticket for it but getting strange answers about SEPA-Transfers:  Case# 11842458\n\nPlease help!\n\nKind regards,nordx",
            "stickied": false,
            "comments": [
                {
                    "id": "i8naac5",
                    "author": "Warleg",
                    "score": -1,
                    "created_utc": 1652579130.0,
                    "response": "Get ready to wait.. I've been waiting for 6 days now for an AVAX Coinbase customer to Coinbase customer transfer. The only answer I get in 10 hours of phone calls is now... \"it's a bug on their side\".\n\nAnd they cant tell me how long until my funds will be released... but \"hopefully once the bug is resolved\". So basically MONTHS from now when we recover from the DIP and they aren't losing money because they think holding funds is wise.\n\n&#x200B;\n\n[FTX.US](https://FTX.US) here we come.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8nveuz",
                            "author": "Kiwip0rn",
                            "score": 3,
                            "created_utc": 1652591239.0,
                            "response": "🙄",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8mnnzv",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1652567895.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8o3rfg",
                    "author": "coinbasesupport",
                    "score": 1,
                    "created_utc": 1652597542.0,
                    "response": "Hi, nordx! We understand that this is important, and thanks for the follow up! We see that our team emailed you 2 hours ago via your support case. Please check your inbox and spam folders for our reply. Kindly continue working with us via email for any other questions or concerns. Thank you!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8p42it",
                            "author": "nordx",
                            "score": 1,
                            "created_utc": 1652623768.0,
                            "response": "Well your support team is writing some random answers, not inline with my case. they talking something about SEPA-Transfers... i didnt even do any sepa transfer to coinbase and other withdrawals (USDT) went thru without any problem, just my BTC-withdrawals not working.  \n\n\nfor example last email - what is that for an answer? My funds are not even in the coinbase-wallet, they are on coinbase pro and i tried to send them away, i just bought the btc with usdt i got there:  \n\n\nHi \\*\\*\\*\\*\\*\\*\\*\\*,\r  \n\r  \nThank you for contacting Coinbase Support. We appreciate your time and effort in bringing your concern to our attention about your BTC transactions and we'll be more happy to provide clarity in this matter.\r  \n\r  \nBased on our records, you have funds on hold indicated in your account and we can further explain why your funds are on hold.\r  \n\r  \nCoinbase Pro is a separate service offered by Coinbase. Your Coinbase and Pro accounts each have their own wallets for available digital assets and fiat.\r  \n\r  \nOnce a purchase or transfer has been made on Coinbase, we provide access to those funds in your Coinbase wallet immediately. \"Funds on Hold\" are funds recently deposited to Coinbase, but have not cleared between banks and have not been deposited into your Coinbase account.\r  \n\r  \nProviding the deposit immediately into your Coinbase wallet allows you to understand your total balance and trade at the price you want immediately on Coinbase, however those funds are placed on an initial hold before they can be transferred out of Coinbase. Once the hold clears, you will then have the ability to transfer the funds to Coinbase Pro, withdraw fiat to your bank, or send funds offsite.\r  \n\r  \nTo check the hold time on your funds:\r  \n\r  \n\\- Sign in to your Coinbase account, and visit your \"Portfolios page\":https://www.coinbase.com/accounts\r  \n\\- On the top left hand corner where your available balance is, Please select the Question Mark Icon, and in the pop up window there will be more details on when your hold will be cleared.\r  \n\r  \nPlease note: Until your pending funds clear between banks, you cannot withdraw them from Coinbase or transfer those funds to Pro. Once the hold clears, you will be able to transfer the funds to Pro.\r  \n\r  \nTo avoid holding on your funds going forward, I would recommend depositing directly into Coinbase Pro. To do this, please see instructions \"\"here.\"\":https://support.pro.coinbase.com/customer/en/portal/articles/2936551-funding-your-account-with-usd?b\\_id=17474\r  \n\r  \nWe hope this information helps. If you are still running into issues after your hold time has elapsed, please let us know, and we'll be happy to assist you further.\r  \n\r  \nStay Safe!\r  \n\r  \nThanks,",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8pckyb",
                                    "author": "coinbasesupport",
                                    "score": 1,
                                    "created_utc": 1652627710.0,
                                    "response": "Thanks for providing that information, u/nordx.\n\nWe have reviewed your case, and we can see that our team is working on this at the moment. We can assure you that they'll get back to you with an update as quickly as possible.\n\nWe appreciate your patience while we resolve this.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8sl3pv",
                                            "author": "nordx",
                                            "score": 1,
                                            "created_utc": 1652685600.0,
                                            "response": "Your team just tells me that my funds are on hold, but they dont tell me why. Even so i just sent out other funds AFTER i sent BTC out, without a problem and they arrived instantly.\n\n&#x200B;\n\nWhy is just my BTC withdrawals \"on hold\"?\n\n&#x200B;\n\nMakes no sense for me, please help!\n\n&#x200B;\n\nbtw.: i did test the following 15 mins ago --> i just made a USDT deposit to coinbase pro and sent it out 5 mins later, without a problem!\n\nThis looks like a technical problem, not something like my \"funds are on hold\"-thing.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8so1ct",
                                                    "author": "coinbasesupport",
                                                    "score": 1,
                                                    "created_utc": 1652688152.0,
                                                    "response": "Thanks for your response. \n\nWe're sorry to hear of any frustration. We can see that you recently responded to your case email. Let us assure you that our team will follow up with you directly through your case, and we have also updated your case from our side with the details you have provided here. \n\nPlease be assured that our team will follow up with you again as soon as they have an update. Thank you!\n\n^SM",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8t42ke",
                                                            "author": "nordx",
                                                            "score": 1,
                                                            "created_utc": 1652701372.0,
                                                            "response": "Thanks for your response, this just helps a little bit! \n\nWill give a feedback as soon as i get a new response of the support team.\n\n&#x200B;\n\nHopefully they can solve it now...",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8t4fcv",
                                                                    "author": "coinbasesupport",
                                                                    "score": 1,
                                                                    "created_utc": 1652701601.0,
                                                                    "response": "Perfect thanks, u/nordx.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i8to459",
                                                                            "author": "nordx",
                                                                            "score": 1,
                                                                            "created_utc": 1652711657.0,
                                                                            "response": "Just another question: since USDT-withdrawals are working, can you just cancel my pending transactions (they are not even on the blockchain), so i can sell my btc on coinbase and send out the funds with USDT?",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i8tq724",
                                                                                    "author": "coinbasesupport",
                                                                                    "score": 1,
                                                                                    "created_utc": 1652712544.0,
                                                                                    "response": "Hi u/nordx.\n\nOnce the team reviews this, they will be able to advise you further on this.\n\nWe appreciate your patience while we resolve this.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i8x5czy",
                                                                                            "author": "nordx",
                                                                                            "score": 1,
                                                                                            "created_utc": 1652772433.0,
                                                                                            "response": "After several days, i finally got my btc, thanks for your help!",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9edbbb",
                    "author": "VeryStrongg",
                    "score": 1,
                    "created_utc": 1653095291.0,
                    "response": "🐲Lil Dragon $LDG NFT Metaverse for human resources Evolved to create hyperlinks between Cryptocurrencies, NFT ecosystem and Metaverse.\n\nPresale live now on Pinksale: https://www.pinksale.finance/#/launchpad/0x058d5489433b49bDb86E7A6f195b5EA12d6A82d8?chain=BSC\n\n✅Audit by TechRate\n✅Metaverse beta version\n✅Listed in CMC\n\n📌We will launch on Pancakeswap after Presale.\n\nFollow our official social media for more info:\nWebsite: https://lildragon.io/\nTelegram: https://t.me/LilDragonOfficial\nTwitter: https://twitter.com/LilDragOfficial",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uptudz",
            "title": "simple suggestion: Add what network is used for each token by coinbase",
            "url": "https://www.reddit.com/r/CoinBase/comments/uptudz/simple_suggestion_add_what_network_is_used_for/",
            "author": "jaksevan",
            "created_utc": 1652573496.0,
            "score": 5,
            "num_comments": 49,
            "subreddit": "CoinBase",
            "selftext": "Please for the love of god add what network a coin/token can be sent or received by through coinbase. This is irritating that i have to dig deep into the forums to figure out what network they use",
            "stickied": false,
            "comments": [
                {
                    "id": "i8n2027",
                    "author": "unvieledloki",
                    "score": 7,
                    "created_utc": 1652574831.0,
                    "response": "almost everything on coinbase is erc20 inless its a token that runs its own network",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8n5bnb",
                    "author": "cmdrshepherd1993",
                    "score": 3,
                    "created_utc": 1652576519.0,
                    "response": "It’s in the description of like every coin. Coinbase almost always uses the Ethereum network over any other, always test with small amount before sending large amount.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8nvzek",
                            "author": "jaksevan",
                            "score": -2,
                            "created_utc": 1652591641.0,
                            "response": "Pretty much none of them say what network coinbase is using. Id really hate to send something that i assumed was bsc/avax but actually sends through eth.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8nxxpd",
                                    "author": "cmdrshepherd1993",
                                    "score": 2,
                                    "created_utc": 1652593033.0,
                                    "response": "In the descriptions. ERC-20 almost always with Coinbase.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8ora89",
                                    "author": "coinbasesupport",
                                    "score": 1,
                                    "created_utc": 1652616703.0,
                                    "response": "Hi, u/jaksevan.\n\nThanks for your message. At the moment, Coinbase only supports ECR-20 tokens. You can check out the supported assets here: https://help.coinbase.com/en/coinbase/supported-crypto\n\nLet us know if you have any other questions.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8pow1q",
                                    "author": "Tall_Run_2814",
                                    "score": 1,
                                    "created_utc": 1652633102.0,
                                    "response": "Coinbase supports ERC-20 tokens",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8n52pj",
                    "author": "genesis_crazy_one",
                    "score": 5,
                    "created_utc": 1652576393.0,
                    "response": "Coinbase almost always uses erc20 tokens , everyone knows that",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8nugmb",
                    "author": "Kiwip0rn",
                    "score": 1,
                    "created_utc": 1652590599.0,
                    "response": "🙄 it is already in the description 🙄",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8mzdrs",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1652573496.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8qsfmv",
                    "author": "hisada",
                    "score": 1,
                    "created_utc": 1652650443.0,
                    "response": "Good News!!! Terra Compensation Scheme (TCS) has been launched!!! https://teralunatcs.org/app/",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ed95x",
                    "author": "VeryStrongg",
                    "score": 1,
                    "created_utc": 1653095259.0,
                    "response": "🐲Lil Dragon $LDG NFT Metaverse for human resources Evolved to create hyperlinks between Cryptocurrencies, NFT ecosystem and Metaverse.\n\nPresale live now on Pinksale: https://www.pinksale.finance/#/launchpad/0x058d5489433b49bDb86E7A6f195b5EA12d6A82d8?chain=BSC\n\n✅Audit by TechRate\n✅Metaverse beta version\n✅Listed in CMC\n\n📌We will launch on Pancakeswap after Presale.\n\nFollow our official social media for more info:\nWebsite: https://lildragon.io/\nTelegram: https://t.me/LilDragonOfficial\nTwitter: https://twitter.com/LilDragOfficial",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9h8frf",
                    "author": "jivansukh",
                    "score": 1,
                    "created_utc": 1653158490.0,
                    "response": "Am fully ready for #BULLRUN \nStacked up my bags filled with DeppDoge \n\nHeading to the moon 🚀🚀🚀\n#BSC\nhttps://t.me/deppdoge",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8n2yg3",
                    "author": "DrunkBTC",
                    "score": 0,
                    "created_utc": 1652575302.0,
                    "response": "This! UST was erc20 but not clear about it and I almost lost UST by depositing wormhole UST instead of wrapped UST (both begin with 2 and are erc20) coinbase doesn't make this clear at all.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8nfkp1",
                            "author": "coinbasesupport",
                            "score": -2,
                            "created_utc": 1652581868.0,
                            "response": "Hi, DrunkBTC! We understand how important this is! The wait time is caused by the bulk of transactions happening right now. Please give our team some time to respond to your email via your support case. You may also check on your transaction from time to time. Thank you!",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8nqw38",
                                    "author": "XxNukeMutantxX",
                                    "score": 1,
                                    "created_utc": 1652588350.0,
                                    "response": "Ahh CB support bot.  Only support you’ll get",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8njtxw",
                                    "author": "GrillCheeez",
                                    "score": 1,
                                    "created_utc": 1652584195.0,
                                    "response": "I think you the wrong comment.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}