{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uplr7e",
            "title": "Sending Failed",
            "url": "https://www.reddit.com/r/CoinBase/comments/uplr7e/sending_failed/",
            "author": "blurry_face-",
            "created_utc": 1652548367.0,
            "score": 7,
            "num_comments": 8,
            "subreddit": "CoinBase",
            "selftext": "I am trying to send BTC to an address which I have sent to before bit I get the error \"Your send failed. You are currently unable to send to this address\"\n\nNo idea why I am unable to send to the address, I have before. I am using 2FA and reset my password in order to see if that was the issue.  I have received any emails or communications from CoinBase to say there is an issue with my account.\n\nAny support for this?",
            "stickied": false,
            "comments": [
                {
                    "id": "i8li3ip",
                    "author": "coinbasesupport",
                    "score": 3,
                    "created_utc": 1652548680.0,
                    "response": "Hey!  Do you have a case# for us to investigate further?  If not, can you please make a case here, so we can look into your issue further:\nhttps://help.coinbase.com/en/contact-us\n\nPlease and Thank you!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8ljecg",
                            "author": "blurry_face-",
                            "score": 3,
                            "created_utc": 1652549271.0,
                            "response": "Thanks for the quick response, Case# 1184767",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8lz95a",
                    "author": "blurry_face-",
                    "score": 3,
                    "created_utc": 1652556562.0,
                    "response": "All fixed! \n\n&#x200B;\n\nThanks to everyone in the community that helped me out, really appreciate it!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8m17is",
                            "author": "coinbasesupport",
                            "score": 3,
                            "created_utc": 1652557478.0,
                            "response": "Glad to hear and thank you for letting us know, and do not hesitate to reach out to us at any time!!!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "upocu9",
            "title": "Coinbase Canada wallet issue",
            "url": "https://www.reddit.com/r/CoinBase/comments/upocu9/coinbase_canada_wallet_issue/",
            "author": "AnthonyBTC",
            "created_utc": 1652556125.0,
            "score": 3,
            "num_comments": 2,
            "subreddit": "CoinBase",
            "selftext": "Hello I'm trying to send Paxos Standard (USDP) to my own wallet outside of Coinbase but I cannot do so because *\"Coinbase Wallet doesn't support the asset you have selected.* [*Here’s a list of supported assets*](https://help.coinbase.com/en/wallet/getting-started/what-types-of-crypto-does-wallet-support)*\".* Coinbase Wallet supports all ERC-20 currencies including USDP so I have no idea why it's not allowing me to send it to myself.",
            "stickied": false,
            "comments": []
        },
        {
            "id": "upertn",
            "title": "coinbase blocks accounts for no reason and does not allow to recover the balance",
            "url": "https://www.reddit.com/r/CoinBase/comments/upertn/coinbase_blocks_accounts_for_no_reason_and_does/",
            "author": "marcoslopezv",
            "created_utc": 1652525579.0,
            "score": 8,
            "num_comments": 13,
            "subreddit": "CoinBase",
            "selftext": "I have been a user for a long time without problems but since December I cannot operate with my account. I have been verified, I have uploaded my documents but I cannot buy, sell or withdraw my funds and the customer service does not answer me (They ignore my emails). I can't do anything and my funds are sequestered.\n\nThis is the coinbase web message:\n\nWe are reviewing your account\n\nYour account has recently been flagged for manual review. You will not be able to buy or sell cryptocurrencies until the review is complete. There is nothing to be alarmed about and if you have funds on Coinbase, they are safe. Considering the high volume of requests, please be patient while we conduct this review.\n\nBe careful with coinbase because any day you can lose your funds!! I have 6 months with no answer.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8kdlxe",
                    "author": "fx9TMK",
                    "score": 5,
                    "created_utc": 1652527887.0,
                    "response": "You sure you’re not in a country or place that has strict crypto laws",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8kfhdi",
                    "author": "Kiwip0rn",
                    "score": 5,
                    "created_utc": 1652529216.0,
                    "response": "🙄 blocked for months and yet 1 Karma post and 0 days on Reddit.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "upco7z",
            "title": "Sketchy stuff",
            "url": "https://www.reddit.com/r/CoinBase/comments/upco7z/sketchy_stuff/",
            "author": "DankeyKahn",
            "created_utc": 1652516100.0,
            "score": 3,
            "num_comments": 11,
            "subreddit": "CoinBase",
            "selftext": "Recently a friend tried making a coinbase account. Found out they already had one, and when they went to reset the password- it just brought them back to the original screen. Thing is... they never made an account. This was weeks ago, and they had to call an agent to get the issue resolved. They had to reset his account somehow. Now after just having tried myself- I'm getting the same problem. Haven't been able to call yet, but I'm wondering if anyone else has experienced this",
            "stickied": false,
            "comments": []
        },
        {
            "id": "updkwe",
            "title": "Coinbase?? So weird!",
            "url": "https://www.reddit.com/r/CoinBase/comments/updkwe/coinbase_so_weird/",
            "author": "Longjumping-End9527",
            "created_utc": 1652520259.0,
            "score": 3,
            "num_comments": 26,
            "subreddit": "CoinBase",
            "selftext": "I bought some Avax last night. 837$ worth of it. and never received any of it. i cant sell avax and i cant trade with the 800 plus dollars. So messed up, has gone down now so im loosing money, i cant control. This is not a good look for me using coinbase long term. talked to support last night for an hour after and couldnt figure it out. says i got 100% filled but got nothing but my charts are moving like i have it and my usd for that trade is gone. Cant SELL or anything. extremely frustrating. gonna post some screenshot here in a min and get this form updated.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8kqgwf",
                    "author": "jhanon76",
                    "score": 8,
                    "created_utc": 1652535768.0,
                    "response": "Classic...I bought crypto but it lost value before I could sell it.  Now I'm mad at the exchange.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uo5i45",
            "title": "took my deposit, won't let me cash out. AVOID",
            "url": "https://www.reddit.com/r/CoinBase/comments/uo5i45/took_my_deposit_wont_let_me_cash_out_avoid/",
            "author": "dans0n",
            "created_utc": 1652374226.0,
            "score": 3,
            "num_comments": 28,
            "subreddit": "CoinBase",
            "selftext": "I deposited some $$ from bank account to make a purchase, the same as I've used done dozens of times before. Now they are restricting all outgoing transfers for no reason and customer service can't give answers. Something is horribly wrong at coinbase. Luckily I'm only going to get scammed for a few hundred. DO NOT USE.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8cda53",
                    "author": "dark_eyez7314",
                    "score": 5,
                    "created_utc": 1652376469.0,
                    "response": "Having the same problem getting my cash out of Coinbase.  they won't let me do it... says \"error\".  just trying to get it back to my bank account (which is supposed to provide instant access).  Customer Service is non-existent.  I'm so glad this is only a few hundred dollars, but this is a terrible product.  I can only imagine how many withdrawal requests Coinbase is getting...\n\nI will just keep trying everyday until my cash magically unfreezes.  And then never go back to this fraudulent service again.  There is no logic to it.  I feel like they are stealing.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8d3rdg",
                    "author": "cmdrshepherd1993",
                    "score": 3,
                    "created_utc": 1652386875.0,
                    "response": "Did you ACH this money into Coinbase within the last 3-7 days? If so, the money has not arrived from your bank to Coinbase yet so of course they will not let you sell until it is there. They let you trade and wait for your funds to arrive.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "upp5cu",
            "title": "Card rewards",
            "url": "https://www.reddit.com/r/CoinBase/comments/upp5cu/card_rewards/",
            "author": "Infamous_Ad_4648",
            "created_utc": 1652558453.0,
            "score": 10,
            "num_comments": 3,
            "subreddit": "CoinBase",
            "selftext": "Not sure if anyone has noticed but new card rewards are now available. Cosmos is the only new one I noticed at 2%. Bitcoin is going to 2%. Looks like everything else stayed the same.",
            "stickied": false,
            "comments": []
        }
    ]
}