{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "utsevu",
            "title": "Coinbase stopped paying APY for over a month, opened up multiple tickets. They don’t care and won’t fix it ….. this platform is garbage",
            "url": "https://www.reddit.com/r/CoinBase/comments/utsevu/coinbase_stopped_paying_apy_for_over_a_month/",
            "author": "FastVeterinarian9766",
            "created_utc": 1653045538.0,
            "score": 68,
            "num_comments": 101,
            "subreddit": "CoinBase",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9c4jmq",
                    "author": "Ankthar_LeMarre",
                    "score": 9,
                    "created_utc": 1653058674.0,
                    "response": "Is this for Tezos? I haven't gotten paid either, and Coinbase support just says it may eventually get fixed, they have no ETA.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9f0k07",
                            "author": "Birdeka",
                            "score": 1,
                            "created_utc": 1653108349.0,
                            "response": "same, tezos apy broke for me",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9con6x",
                    "author": "Rude_Operation6701",
                    "score": 9,
                    "created_utc": 1653066610.0,
                    "response": "I left Coinbase after the gyen bs and have never looked back. I see nothing good about Coinbase these days it’s all people getting screwed. They are hemorrhaging money and taking peoples money to pay for it.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9dpbh9",
                            "author": "Accomplished-Way7608",
                            "score": 6,
                            "created_utc": 1653083129.0,
                            "response": "They outsourced everything to India. That's where the hacks/thefts from customers comes from.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9fqj9y",
                                    "author": "darknetboob",
                                    "score": 1,
                                    "created_utc": 1653130516.0,
                                    "response": "oh wow really. do u think thats what happened to me? i got email saying ID VERIFIED. which i didn't do then got an email saying i broke terms and  they forced me to shut my account bet it was their own employees then if they indian.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9f1ekw",
                            "author": "anon977577",
                            "score": 1,
                            "created_utc": 1653108947.0,
                            "response": "The GYEN fiasco proved stablecoins aren't stable and the bugs aren't fixed yet.  Tether, Coinbase's UST and anything along those lines are subject to total loss and return to zero value like WLUNA at any point in the future.\n\nStablecoins have nothing to do with Satoshi/CIA's masterpiece in Bitcoin blockchain.  Stablecoins boil down to \"arbitrage feedback loop to another instrument\".  So your stablecoin is only as stable as the other instrument which is also itself a ponzie.  So the Stable in stablecoin is a function of the value of another cryptocurrency.  It's stable as long as the ponzie keeps growing with the number of people who keep money in stablecoin.  Which can't be.  stablecoins are ponzies.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9ci973",
                    "author": "Thin-Commission1298",
                    "score": 10,
                    "created_utc": 1653064098.0,
                    "response": "They haven’t paid me either",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ciq8z",
                            "author": "coinbasesupport",
                            "score": 1,
                            "created_utc": 1653064280.0,
                            "response": "Hi there, thank you for your message. We'd be happy to look into this for you. If you have a case number, could you please share it with us? If you don't have one, you can obtain it by submitting a support ticket here: https://help.coinbase.com/en/contact-us and our support team will follow up with you. Thanks.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9cjv7x",
                                    "author": "Thin-Commission1298",
                                    "score": -12,
                                    "created_utc": 1653064724.0,
                                    "response": "Why would I waste my time raising an issue…?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9bf5a4",
                    "author": "thestevenbeauty",
                    "score": 46,
                    "created_utc": 1653047168.0,
                    "response": "Most of the time when people have issues on Coinbase they are doing shady shit. I’ve had it for 3 years and literally never had a problem",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9d2rrj",
                            "author": "UnionCounty22",
                            "score": 4,
                            "created_utc": 1653072825.0,
                            "response": "You mean Coinbase is doing shady shit when there is an issue..",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9c4d28",
                            "author": "PickleofStink",
                            "score": 13,
                            "created_utc": 1653058601.0,
                            "response": "This is almost always the reason for posts like these.  Don’t do shady shit and Coinbase tends to work just fine.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9c9ukx",
                                    "author": "thestevenbeauty",
                                    "score": 2,
                                    "created_utc": 1653060789.0,
                                    "response": "Totally!!!",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9dub5k",
                                    "author": "FastVeterinarian9766",
                                    "score": -8,
                                    "created_utc": 1653085491.0,
                                    "response": "So holding assets on an exchange to earn the advertised APY is shady ???? What a fucking tool you are.  Usually people that leave comments like yours are $20 bag holders with Jack shit invested ….. piss off fuck head",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9fu34c",
                                            "author": "thestevenbeauty",
                                            "score": 1,
                                            "created_utc": 1653133271.0,
                                            "response": "Lol bye",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9ep1gj",
                            "author": "radiofriendly123",
                            "score": 4,
                            "created_utc": 1653101503.0,
                            "response": "That's exactly what i thought until a few weeks ago. Used it for 5 years with no problems.  \n\nOut 6 figures now due to a mistake and their bizarre unwillingness to help. \n\nF coinbase.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9ftww4",
                                    "author": "thestevenbeauty",
                                    "score": 1,
                                    "created_utc": 1653133148.0,
                                    "response": "What mistake? Your own?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9fwg0y",
                                            "author": "radiofriendly123",
                                            "score": 2,
                                            "created_utc": 1653134910.0,
                                            "response": "Yes. \n\nI had been following a standard process for months that worked great and now need coinbase's help bc of a change made unbeknownst to me.\n\nAnchor -> terra bridge -> metamask -> coinbase -> cash in my bank was my process. \n\nFollowed this process something like 50 times in the past few months - never a problem. \n\nSaw the ust depeg occurring and went to move it all to coinbase following the exact process i did every time before.\n\nThis time, the terra bridge converted my ust to something called ust (wormhole), a different erc20 version of the coin than every time before. \n\nI sent it to coinbase but the funds aren't accessible bc coinbase doesn't \"support\" this version of ust (even though it's just another erc20). There was no warning of this at the time. There is now a warning for this bc so many users did this exact thing. \n\nCoinbase controls the private key to the wallet that these funds sit in and could easily send the funds right back to the wallet from which they came. They choose not to bc of a remarkably shitty policy that every other exchange would typically help their users with. It would take them about 5 minutes to send my 240k coins back to me. \n\nI've never once gotten past their entry level support team. I've never gotten anything other than a shitty, canned answer. \n\nTerrible policies. Useless customer service. Awful experience. A shit sandwich like I've never tasted before.\n\nFortune favors the banked.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9g3den",
                                                    "author": "thestevenbeauty",
                                                    "score": 1,
                                                    "created_utc": 1653139123.0,
                                                    "response": "I mean, you could see how Coinbase would think what you’re doing was fishy right? You’re moving hundreds of thousands of dollars through 5 different platforms, depositing it on Coinbase, and then cashing out to your bank account. I’m not surprised they flagged you.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9g4mqh",
                                                            "author": "radiofriendly123",
                                                            "score": 1,
                                                            "created_utc": 1653139814.0,
                                                            "response": "What's fishy? \n\nThere's nothing fishy about it. I had ust in anchor and needed to convert it to erc20 to get to coinbase.\n\nIf that's fishy then crypto is \"fishy\".\n\nThe only thing fishy is that coinbase won't help users that sent erc20 tokens to their platform to wallets they don't support, especially since there are multiple versions of every fn coin now. \n\nThey must have millions in erc20 tokens just sitting in wallets that could be generated in 10 seconds on something like metamask. It's unreal.\n\nThat's the only thing i find fishy... their lack of support and inability to fix a simple issue that every other exchange assists their users with.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9g4tk3",
                                                                    "author": "thestevenbeauty",
                                                                    "score": 1,
                                                                    "created_utc": 1653139918.0,
                                                                    "response": "A lot of hackers take funds from other platforms and deposit them on Coinbase to cash out immediately. What you’re doing could look like that to a Coinbase employee. So they are taking precautions. Whether or not you’re being fishy, doing a bunch of transactions and then depositing 250k and cashing it out into your bank immediately could look fishy. Not saying that you are being fishy, it just looks questionable. Sucks that this happened to you, but like I said I’m not surprised",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i9gkt2b",
                                                    "author": "SunnyState20",
                                                    "score": 1,
                                                    "created_utc": 1653147593.0,
                                                    "response": ">I've never once gotten past their entry level support team. I've never gotten anything other than a shitty, canned answer.  \n>  \n>Terrible policies. Useless customer service. Awful experience. A shit sandwich like I've never tasted before.  \n>  \n>Fortune favors the banked.\n\nNot only that, but they also accessed my account using private keys and stole all the funds for about 1000 ETH less in 10 minutes. I'm suing Coinbase, and guess what, they bribed the district court and the appellate court to grant their motion to compel arbitration, despite the fact that my claim \"grand theft\" out of arbitration agreement. They know that I have all the evidence (50 pages) against the theft in Coinbase and are trying to stop my every move.\n\nYou should know that Coinbase is stealing user funds, not a hacker. I did a deep investigation and submitted to the court. But what did the court do? She stated in the Order, that my claim is allegedly only about violation of the contract and that's it. Not a word about theft. The appeal also granted Coinbase's motion and illegally dismissed my case. Now I'm taking serious action.\n\nIt is very easy to guess who has private keys in Coinbase. Not your keys, not your coins, it's true. Coinbase is a scam company that constantly steals user funds. If Coinbase didn't steal your money, you're lucky, but you are in line. They steal from thousands of users, but they have millions of users.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9cgan9",
                            "author": "joeytcomplex",
                            "score": 6,
                            "created_utc": 1653063331.0,
                            "response": "Same, why I moved my coins",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9fnc0w",
                                    "author": "ddlJunky",
                                    "score": 3,
                                    "created_utc": 1653127694.0,
                                    "response": "Same. Fully at kraken now.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9efwze",
                                    "author": "MichaelK70",
                                    "score": 4,
                                    "created_utc": 1653096683.0,
                                    "response": "I did too...moved all but two shit coins, Spell Token and SHPING, to Crypto.com.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9bf8m5",
                            "author": "FastVeterinarian9766",
                            "score": 12,
                            "created_utc": 1653047220.0,
                            "response": "How is buying and holding assets to earn APY shady ?????? Smart ass.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9bfbc1",
                                    "author": "thestevenbeauty",
                                    "score": 11,
                                    "created_utc": 1653047261.0,
                                    "response": "I didn’t say that was shady, I’m just saying most of the time there’s a reason why it’s not working for you",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9bok2w",
                                            "author": "Kronossan",
                                            "score": 9,
                                            "created_utc": 1653051925.0,
                                            "response": "Why shouldn't it be working for him if he's just had it sit there?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9bw0jc",
                                                    "author": "thestevenbeauty",
                                                    "score": 8,
                                                    "created_utc": 1653055200.0,
                                                    "response": "I find that most people complaining like this aren’t just letting it sit there haha and that’s why they are having problems",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9dp6j2",
                                            "author": "Accomplished-Way7608",
                                            "score": 1,
                                            "created_utc": 1653083066.0,
                                            "response": "Coinbase are the shady ones!!!",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9d0q34",
                                    "author": "bigaznDDDDDragon",
                                    "score": 4,
                                    "created_utc": 1653071862.0,
                                    "response": "Those fuckers are coinbase fan boys or employees. They usually like to defend coinbase shit all day long.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9fqmnj",
                                            "author": "pazsworld",
                                            "score": 1,
                                            "created_utc": 1653130594.0,
                                            "response": "Agreed, f-n shills.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i9fu25y",
                                            "author": "thestevenbeauty",
                                            "score": 0,
                                            "created_utc": 1653133252.0,
                                            "response": "I’m not a fan boy, I just know how to use exchanges and protect my accounts without having issues. But that’s because I don’t do shady shit on it",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9cotwb",
                            "author": "bob99900090",
                            "score": 0,
                            "created_utc": 1653066685.0,
                            "response": "Same",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9cpseq",
                                    "author": "coinbasesupport",
                                    "score": 1,
                                    "created_utc": 1653067072.0,
                                    "response": "Hi there, thank you for your message. We'd be happy to look into this for you. If you have a case number, could you please share it with us? If you don't have one, you can obtain it by submitting a support ticket here: https://help.coinbase.com/en/contact-us and our support team will follow up with you. Thanks.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9cry3r",
                                            "author": "bob99900090",
                                            "score": 2,
                                            "created_utc": 1653067950.0,
                                            "response": "🧐",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9fqd23",
                            "author": "darknetboob",
                            "score": 1,
                            "created_utc": 1653130368.0,
                            "response": "had my CB account since 3+ years only used it to trade btc.  i agreed with you until 2 days ago!  now they forced me to close account saying a breached their terms!  first got email saying  ID Verified THEN an email saying I have to close my account!  Go look at the thread(s)  there are more than 1 here on reddit!  I won't use them again I now hold my coin in MY ledger which I control!!! be careful.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9fqrnz",
                                    "author": "coinbasesupport",
                                    "score": 1,
                                    "created_utc": 1653130711.0,
                                    "response": "Hi , thanks for your message.\n\nWe'd like to follow up on this, please send our support team a message here: https://help.coinbase.com/en/contact-us they will investigate this further.\n\nThanks!",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9fsqc5",
                                            "author": "darknetboob",
                                            "score": 1,
                                            "created_utc": 1653132255.0,
                                            "response": "well i closed my account now like you made me, even though I did nothing wrong.  Now my worry is even if you sorted this what if I lose my money on there?  See the thing is when you don't have confidence in a business why would you then put your money with them???  It only concerns me that first i got emails saying ID VERIFIED.  I verified my ID 3 years ago so clearly something is very wrong.  Thank God I got all my money out.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9ftcop",
                                                    "author": "coinbasesupport",
                                                    "score": 1,
                                                    "created_utc": 1653132731.0,
                                                    "response": "Hi u/darknetboob\n\nWe can follow up on this. If you'd like us to review this, feel free to get back to us with your case number.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9ftky8",
                                                            "author": "darknetboob",
                                                            "score": 1,
                                                            "created_utc": 1653132901.0,
                                                            "response": "i dont have a case number because I closed my account like I was forced to do I am worried for other users though because if you go through other posts you will see this has happened to others aswell.  I am concerned as when i opened my account i used my passport. The email I got from you stated ID VERIFIED.  it worries me. Did someone try to hack my account?  I don't know? I wasn't even logged in since about a month ago.  HERE IS THE COPY PASTE OF THE EMAIL I GOT FIRST:\n\nYour photo ID has been verified\n\nYou're one step closer to investing in crypto with Coinbase. Sign in to check prices, add a payment method, finish setting up your account, and more.\n\n&#x200B;\n\n2ND EMAIL HERE -\n\n&#x200B;\n\nHello,\r  \n\r  \nThank you for your interest in Coinbase. Our primary goal is to make digital currency safe and secure for our customers. Coinbase is a regulated Money Services Business under FinCEN (FinCEN.gov), and as part of achieving this goal, we are legally obligated to implement regulatory compliance mechanisms.\r  \n\r  \nUpon careful review, we believe your account has engaged in prohibited use in violation of our Terms of Service and we regret to inform you that we can no longer provide you with access to our service. We respectfully request that you follow the on-screen instructions presented when you sign in to your Coinbase account to send any remaining balance offsite to an external address.\r  \n\r  \nIf you are currently enrolled in USD Coin rewards, you may want to wait up to 40 days before withdrawing funds to ensure you have received all eligible reward payouts. You will not be able to access these funds after account closure.\r  \n\r  \nShould you have any questions or need assistance, please let us know and we'll be happy to help.\r  \n\r  \n\r  \n\r  \nRespectfully,\r  \n\r  \nCoinbase Customer Support",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9d1hft",
                            "author": "Nimoy2313",
                            "score": 0,
                            "created_utc": 1653072214.0,
                            "response": "Same, but only 2 years.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9fkvb0",
                    "author": "lake638",
                    "score": 3,
                    "created_utc": 1653125401.0,
                    "response": "CONBASE !",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9fqrej",
                            "author": "darknetboob",
                            "score": 2,
                            "created_utc": 1653130705.0,
                            "response": "MCGA - make coinbase great again!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9dtyqz",
                    "author": "GetDeleted",
                    "score": 5,
                    "created_utc": 1653085321.0,
                    "response": "They *literally* have the worst customer support team I've ever dealt with. I 100% mean that. Every single time I reach out to them, they ignore my question and copy and paste bullshit from their FAQ. It's actually infuriating. I've since moved all of my assets into my own wallets. Fuck them.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9du36h",
                            "author": "FastVeterinarian9766",
                            "score": 5,
                            "created_utc": 1653085382.0,
                            "response": "That’s been my exact same experience ….. copy and paste while solving nothing",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9dudgt",
                                    "author": "GetDeleted",
                                    "score": 5,
                                    "created_utc": 1653085523.0,
                                    "response": "Yeah, isn't it actually insane? Like, I can't possibly imagine a worse customer support team. Even when they say that they will have to submit a ticket to have a higher level get back to you, they do the exact same bullshit.\n\nAnd to top it all off, now that you've posted in their subreddit, you will be spammed with messages of scammers impersonating staff.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9cvtmq",
                    "author": "robidaan",
                    "score": 3,
                    "created_utc": 1653069603.0,
                    "response": "You are aware they changed a lot of the payout date frames right. To reduce transactions, and increase flow control and stability. Algorand went from daily to every 3 months. Same goes for most others. This will make sure that the system stays reliable and more future proof and protected.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9elmyg",
                            "author": "EmanEwl",
                            "score": 3,
                            "created_utc": 1653099648.0,
                            "response": "Why couldn't they answer him this ?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9fpum8",
                                    "author": "robidaan",
                                    "score": 1,
                                    "created_utc": 1653129938.0,
                                    "response": "Because their communication skills can be improved quite a bit. but also in the time that change happened, they showed it in large on the website and got multiple notifications on the app and sent like  3 or 4 emails about it. So even though I can imagine it sucks to not know about it. it was well introduced to the community. but I fully agree that their custumer service can be improved. even though sending multiple tickets for the same issue does not speed up the process.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9cl6pc",
                    "author": "pacoelflaco21",
                    "score": 2,
                    "created_utc": 1653065235.0,
                    "response": "Thank you for waiting, upon checking on your case, we can confirm that our platform is garbage of the worst kind",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9dm4z7",
                    "author": "Wizdel",
                    "score": 2,
                    "created_utc": 1653081652.0,
                    "response": "They are the worst",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9eov3g",
                    "author": "radiofriendly123",
                    "score": 2,
                    "created_utc": 1653101407.0,
                    "response": "Never use coinbase again. Find any other means.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9fkel6",
                    "author": "Glum-Bandicoot8346",
                    "score": 2,
                    "created_utc": 1653124961.0,
                    "response": "Worst experience doing business on that platform. Won’t use it nor will I recommend it for transactions of any sort",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9c8iqt",
                    "author": "Questionkid24",
                    "score": -2,
                    "created_utc": 1653060262.0,
                    "response": "Revenue was under -225% last month people",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9dhh3e",
                            "author": "AWilfred11",
                            "score": 4,
                            "created_utc": 1653079507.0,
                            "response": "How can revenue fall by more than 100%?",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9cijgm",
                            "author": "Ankthar_LeMarre",
                            "score": 4,
                            "created_utc": 1653064207.0,
                            "response": "I’m not sure how that’s relevant?",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9dwhnx",
                            "author": "iTz_Swine",
                            "score": 1,
                            "created_utc": 1653086554.0,
                            "response": "Fake news",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9bcrtw",
                    "author": "coinbasesupport",
                    "score": -2,
                    "created_utc": 1653045794.0,
                    "response": "Hi there, thanks for reaching out about this. Kindly share your case number, and we will gladly take a closer look into this for you. Thanks.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9do39k",
                            "author": "Effective_Meal1348",
                            "score": 4,
                            "created_utc": 1653082559.0,
                            "response": "Did you just say \"Kindly\"..? 🚩🚩🚩",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9bdufx",
                            "author": "FastVeterinarian9766",
                            "score": -11,
                            "created_utc": 1653046434.0,
                            "response": "So you can refer me to an article that has no relevance …… no thanks …… I’ve been with this exchange since 2016 and now I’m done with Coinbase …. Assets being moved off today …… have a good one ✌️",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9bi5lf",
                                    "author": "VPN4reddit",
                                    "score": 15,
                                    "created_utc": 1653048776.0,
                                    "response": "Cool story. No one give a fuck. Bye felica!",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9bwbd9",
                                            "author": "trevor58",
                                            "score": -5,
                                            "created_utc": 1653055328.0,
                                            "response": "You cared enough to open this post and read down to this comment, and then comment.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9brk56",
                                    "author": "JuniperTwig",
                                    "score": 0,
                                    "created_utc": 1653053275.0,
                                    "response": "Crypto Karen",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9bf0cd",
                                    "author": "Prestigious_Ear505",
                                    "score": 1,
                                    "created_utc": 1653047093.0,
                                    "response": "Good move...safer to stake from cold wallet anyways.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9bkhou",
                                            "author": "zionmatrixx",
                                            "score": 0,
                                            "created_utc": 1653049966.0,
                                            "response": "Yah, ask how staking is going for the LUNA hodlers. Lol",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9bm8bh",
                                                    "author": "Prestigious_Ear505",
                                                    "score": 6,
                                                    "created_utc": 1653050814.0,
                                                    "response": "Rotten cherry picking....my ADA staking has had no issues. And don't bring up price as all the markets are shit right now.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9efomq",
                            "author": "saad4nsari",
                            "score": 1,
                            "created_utc": 1653096556.0,
                            "response": "Please look into this ticket\n\n11518268\n\nMy account has been locked out for 2 months. \n\nSuch bull shit customer service",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9eh7ub",
                                    "author": "coinbasesupport",
                                    "score": 1,
                                    "created_utc": 1653097356.0,
                                    "response": "Hey there, u/saad4nsari. Thanks for the follow-up on your support case. We have escalated your case to the concerned team so please expect for an email update anytime soon. We also sent a separate follow-up to make sure they are up to date with the status of your support case. Thanks!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9bilp6",
                    "author": "Kiwip0rn",
                    "score": -4,
                    "created_utc": 1653049010.0,
                    "response": "🙄 boo hoo... they will fix it, I am not worried about it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9bcc6w",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653045538.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9cif9t",
                    "author": "One8s7n",
                    "score": 1,
                    "created_utc": 1653064162.0,
                    "response": "Did you buy sell trade any of coin earning apy? Or is the coin ada?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9cjd1v",
                            "author": "FastVeterinarian9766",
                            "score": 6,
                            "created_utc": 1653064526.0,
                            "response": "Haven’t traded any, just a reoccurring weekly buy for ADA and Tezos for over 2 months …. Never received any rewards and also my pending rewards counter on all assets ETH2, Cosmos, Algorand has stopped showing.  I’ve already been transferring out…. When you contact customer service they don’t do anything to solve the issue, they just post articles about how the APY works and then act as though they have settled your issue without actually doing anything or fixing any issues….. waste of time",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9ckq8g",
                                    "author": "One8s7n",
                                    "score": 3,
                                    "created_utc": 1653065058.0,
                                    "response": "My last tezos was March 30 as well",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9ckiv1",
                                    "author": "One8s7n",
                                    "score": 2,
                                    "created_utc": 1653064978.0,
                                    "response": "Yeah ada is still collecting just not showing.  Sometimes if I buy it takes longer to show up but when it does deposit apy it's more than normal",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9d0574",
                    "author": "Balldeep247",
                    "score": 1,
                    "created_utc": 1653071593.0,
                    "response": "Yup",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9dtl48",
                    "author": "BabyCheap7259",
                    "score": 1,
                    "created_utc": 1653085143.0,
                    "response": "I read somewhere they where going to do it quarterly",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9f6jm5",
                    "author": "ABREEZYYYYY",
                    "score": 1,
                    "created_utc": 1653112703.0,
                    "response": "Couldn’t agree more. Was having an issue where I couldn’t verify my identity to earn APY because my name, SSN, or address was “incorrect”. It told me to double check and make sure it was spelled correctly which it obviously was. I reached out to support and they gave me the same copy and pasted error message from before. Called them and emailed them for over a week and finally the issue got resolved but it still says for me to verify my identity. I’m still earning though from what it says so I’m not sure what’s happening 🤦‍♂️",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9few4l",
                    "author": "Cannon_Rush_DT",
                    "score": 1,
                    "created_utc": 1653119856.0,
                    "response": "You might want to consider Humbl who are paying up to 7% in their wallet. They customer service are also quite responsive. Check out [https://www.humbl.com/](https://www.humbl.com/)  and download their app which contains their digital wallet.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9fmgy4",
                    "author": "ScottPatience",
                    "score": 1,
                    "created_utc": 1653126912.0,
                    "response": "thank me later🙏❤️ https://www.youtube.com/watch?v=tDZtBzqow6Q",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9fq727",
                    "author": "darknetboob",
                    "score": 1,
                    "created_utc": 1653130230.0,
                    "response": "yep they forced me to close my account for no reason didn't even log in for ages got an email that i am forced to close my account!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9fqsje",
                    "author": "darknetboob",
                    "score": 1,
                    "created_utc": 1653130732.0,
                    "response": "\\#MCGA - new campaign - MAKE COINBASE GREAT AGAIN! (it's gone horribly bad)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9fvoef",
                    "author": "Beepbeep1976",
                    "score": 1,
                    "created_utc": 1653134402.0,
                    "response": "When I first started staking my ETH with @coinbase there was a glitch with the accrual counter that made it reset every time I logged in. I contacted support and the issue was fixed within a day and the proper accrual was restored. That said, it has been irritating that when they initiated the ETH staking program they said there would be a liquidity workaround enabled by the end of 2021 but apparently they quietly decided to nix that plan with no public announcement. Been wanting to move some of my holdings to another platform where the APY is almost 4x higher.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9g9d8p",
                    "author": "almyles3000",
                    "score": 1,
                    "created_utc": 1653142254.0,
                    "response": "I concur with you and the majority here, and will add more if the conbase trolls slither out.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9gea20",
                    "author": "Asleep_Win_8650",
                    "score": 1,
                    "created_utc": 1653144578.0,
                    "response": "🌝Baby Luna Inu🌝 $BLI\n\nBaby Luna Inu is a Deflationary ERC-20 token on the Ethereum Blockchain that offers frictionless rewards to its holders.\n\nLiquidity locked for 30 Days\n\nTokenomics:\n*Buy Tax: 1% marketing\nSell Tax: 2% LP\n3% Marketing On sell\nTotal Supply: 1,000,000,000,000,000,000\n\nWebsite:\nhttp://babyluna-inu.com\n\nTwitter:\nhttps://twitter.com/babylunainuerc?s=21&t=6dU8GYx7x0cZJFZsDpFe1Q\n\nTelegram:\nhttps://t.me/BabyLunaInuErc\n\nhttps://www.dextools.io/app/ether/pair-explorer/0x92d1663712ab3449d194af913a66c3a6abf342cd",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9glnwf",
                    "author": "SunnyState20",
                    "score": 1,
                    "created_utc": 1653147989.0,
                    "response": "Coinbase accessed my account using private keys and stole all the funds for about 1000 ETH less in 10 minutes. I'm suing Coinbase, and guess what, they bribed the district court and the appellate court to grant their motion to compel arbitration, despite the fact that my claim \"grand theft\" out of arbitration agreement. They know that I have all the evidence (50 pages) against the theft in Coinbase and are trying to stop my every move.\r  \nYou should know that Coinbase is stealing user funds, not a hacker. I did a deep investigation and submitted to the court. But what did the court do? She stated in the Order, that my claim is allegedly only about violation of the contract and that's it. Not a word about theft. The appeal also granted Coinbase's motion and illegally dismissed my case. Now I'm taking serious action.\r  \nIt is very easy to guess who has private keys in Coinbase. Not your keys, not your coins, it's true. Coinbase is a scam company that constantly steals user funds. If Coinbase didn't steal your money, you're lucky, but you are in line. They steal from thousands of users, but they have millions of users.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}