{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "urqetj",
            "title": "What Are DAOs and How Do They Work?",
            "url": "https://investaltoira.com/DAO",
            "author": "blixale",
            "created_utc": 1652805266.0,
            "score": 36,
            "num_comments": 8,
            "subreddit": "CoinBase",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8yt4g3",
                    "author": "vZenyte1",
                    "score": 3,
                    "created_utc": 1652806724.0,
                    "response": "Truth is, from my experience on solana, daos don't really work. It's just something ez to setup and claim you have, so every project and their mother sets up a dao",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8zyrtw",
                            "author": "rouripreomyzd",
                            "score": 1,
                            "created_utc": 1652823861.0,
                            "response": "DAOs are practically organizations on the blockchain. Some projects just add them to look more appealing lol. I'd rather create mine with aragon or xdao and do what I really want with it.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8z932t",
                    "author": "anon977577",
                    "score": 1,
                    "created_utc": 1652813170.0,
                    "response": "You're all thinking too hard I can answer you with a parable.\n\nDAOS are a man who goes to the beach and comes home and when doing laundry, finds a fistfull of sand in his swim trunks, so rather than throwing it into the trash or on the lawn, he decides to call up everyone in the world and sell every grain of sand for $18.  And instead of shipping them the grain of sand, sends them a confirmation of ownership.  Exchanges like coinbase help the man in exchange for a rake on transactions.\n\nReplace 'grains of sand' with \"A bunch of Contracts, Software code, ledgers, tethers, debts, and obligations\" that only someone who could create such a thing could understand, and you've got yourself a DAO.\n\nYou wanna buy one?  Mine doubled in price today.  Naturally the government is extremely uncomfortable about these things existing as well as the exchanges who let you trade them.  But since the Government hates crypto because it muscles in on their divine right to issue other people debt and spend the value created without consent of the indebted, it gives some leeway to scoundrels since it teaches you right for wanting an alternative store of your labor that they can't debase.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i90u3xu",
                            "author": "Additional-Cap-7110",
                            "score": 1,
                            "created_utc": 1652838543.0,
                            "response": "😂",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8yphhn",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1652805266.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8z1hpv",
                    "author": "bss03",
                    "score": 1,
                    "created_utc": 1652810074.0,
                    "response": "DAO = Decentralized Autonomous Organizations\n\nIt's a fancy name for one or more \"smart contracts\" that \"work together\".  They are decentralized due to existing anywhere the blockchain does, and they are autonomous because all the interaction rules are in the smart contracts.\n\nI'm not sure one actually exists yet.\n\nIt much more commonly abused as a buzzword for \"our project to do something involving a blockchain\".\n\n\"Smart contracts\" are bits of code attached to a wallet that contains verification rules for what transactions are acceptable.  The contract code is \"run\" as part of mining; if a contract address is part of a transaction, the verifier must pass for the transaction to be included in (any / the next) block.  The contract address is derived from the code of the contract, so the same verifier is being run on every miner.\n\nThe closest thing we have to DAOs are Uniswap and derived works, but if you look too deeply into most (if not all) of those, you'll still find some non-autonomous bits are that also generally not very distributed.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i90lrms",
                    "author": "o3accordv6spac",
                    "score": 0,
                    "created_utc": 1652834625.0,
                    "response": "thank me later🙏❤️ https://www.youtube.com/watch?v=tDZtBzqow6Q",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}