{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "v197vf",
            "title": "Haven't received my money back after cancelling post only order",
            "url": "https://www.reddit.com/r/CoinBase/comments/v197vf/havent_received_my_money_back_after_cancelling/",
            "author": "Reeferchief",
            "created_utc": 1653942860.0,
            "score": 1,
            "num_comments": 2,
            "subreddit": "CoinBase",
            "selftext": "Hey all,  \n\n\nYesterday I was trying to make a purchase in advanced Coinbase, I think it's usually just easier as I don't have to keep sending the BTC back and forth. What I typically do is DCA every month, been doing so since 40k. I'm not too concerned about getting in at the best possible price as for me it's more of a long term investment than immediate gains.   \n\n\nSo I put in my order and it wasn't going through so I cancelled a few times and I believe on the third cancellation I didn't get the money back in my account. I called support and they said they were having network issues and that if I just wait it out it should resolve itself, however, I've waited all of today and it appears the issue is still persisting.  \n\n\nHas anyone else run into this issue? Not sure what I'm supposed to do.",
            "stickied": false,
            "comments": [
                {
                    "id": "ial3dpu",
                    "author": "coinbasesupport",
                    "score": 1,
                    "created_utc": 1653943256.0,
                    "response": "Hi there, thank you for thoroughly explaining your issue within this post, it helps for us to better understand your situation!\n\nIf you are still awaiting this order cancellation to propagate in your account, we recommend reaching out to our support team, however, it sounds like you might have already taken this step.\n\nIf this is correct, please respond with your case number so that we may check into the status of your case, otherwise, please reach out to our support team via email by visiting this link:  https://help.coinbase.com/en/contact-us/ - hope to hear back from you regarding this soon, thanks!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ial2jfr",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653942860.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}