{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uy55h7",
            "title": "Coinbase restricted account",
            "url": "https://www.reddit.com/r/CoinBase/comments/uy55h7/coinbase_restricted_account/",
            "author": "dbyoung00",
            "created_utc": 1653563366.0,
            "score": 1,
            "num_comments": 19,
            "subreddit": "CoinBase",
            "selftext": "My account was restricted for no reason at all, then I decided to sell and try cash out since that was the only thing I could do. No one said what’s the reason for locking my account.\nI’ve been on phone with useless support 4 times, what a headache this is.\nCase #11990476\nCase #11684428\nCase #11278255\nReally just want to cash out! \nLast phone call they’ve said my account is under a review and I’d be able to add a bank account and withdraw the money",
            "stickied": false,
            "comments": [
                {
                    "id": "ia2gg41",
                    "author": "Holyballs92",
                    "score": 8,
                    "created_utc": 1653574690.0,
                    "response": "They told me my account restriction would be lifted by today well with the market right now they damn sure aren't letting me take out my coins of the exchange. Almost like they knew what was gonna happen.\n\nOnce I get the rest of my coins out I'm done with coinbase",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia2go3p",
                            "author": "dbyoung00",
                            "score": 2,
                            "created_utc": 1653574781.0,
                            "response": "Exactly I don’t know why they take control over our personal funds and accounts it’s just Frustrating!",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia2w5uz",
                                    "author": "TheOzarkWizard",
                                    "score": 5,
                                    "created_utc": 1653581089.0,
                                    "response": "Not your keys, not your coins",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "ia2gyia",
                                    "author": "Holyballs92",
                                    "score": 0,
                                    "created_utc": 1653574900.0,
                                    "response": "Keep bothering them. Let out your inner Karen. 😆 🤣 😂",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "ia33hem",
                            "author": "coinbasesupport",
                            "score": 1,
                            "created_utc": 1653583952.0,
                            "response": "Hey there, happy to check on this for you.  Can you confirm the ticket number regarding this statement so we can take a look?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia393m6",
                                    "author": "Holyballs92",
                                    "score": 1,
                                    "created_utc": 1653586171.0,
                                    "response": "Already did yall closed the case without resolving the issue",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia3b9qs",
                                            "author": "coinbasesupport",
                                            "score": 1,
                                            "created_utc": 1653587040.0,
                                            "response": "Sorry for the confusion, we located your case numbers. We just took a look at your cases and have reopened and escalated the case you replied to on May 18th for further review. To help clarify your issue at this time, we ask that you reply to that email thread again making your current question very clear for the specialty team that has been working with you. Also, please watch for any email update from them. We hope to get this issue clarified for you. Thanks for reaching out.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia2apc6",
                    "author": "LostMeBoot",
                    "score": 7,
                    "created_utc": 1653572188.0,
                    "response": "IMO, they're trying to stop the bleeding by playing stupid.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia2e4v8",
                            "author": "dbyoung00",
                            "score": 2,
                            "created_utc": 1653573699.0,
                            "response": "They loop me though their investigations, no one is actually helping ! I’ve ever had a problem like this with any other wallet.. Coinbase is such a joke !",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia2pbbf",
                                    "author": "1HappyGuy1",
                                    "score": 1,
                                    "created_utc": 1653578350.0,
                                    "response": "I mean if you tried, to say, sell and cash everything it would probably cause a red flag and that is why they froze your account.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "ia2qy5v",
                                    "author": "coinbasesupport",
                                    "score": 1,
                                    "created_utc": 1653579007.0,
                                    "response": "We understand this is frustrating, but per your case, the investigation will take up to six calendar days from today. If you've not received an update by next Friday, then please reach out on the following Monday for further assistance.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia2w2fu",
                    "author": "TheOzarkWizard",
                    "score": 2,
                    "created_utc": 1653581053.0,
                    "response": "They did this to me back in 2018 and didn't give a reason. Looking though this sub it's all I see. I now consider coinbase dangerous and no longer recommended it to others. It's a crying shame, because they had a decent interface.\n\nCoinbase is the youtube of crypto. Used to be good, clearly fucking up, and tells everyone that contacts support sorry! Can't give you a reason unless you contact us on a specific platform",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia45119",
                    "author": "FishHunter490",
                    "score": 2,
                    "created_utc": 1653599394.0,
                    "response": "Ya I have been using coinbase since like 2015. Just this week they lock my account for no reason. Now im trying to get the coins out. good thing I only had 150$ in there. I think coinbase is just doing this to a bunch of accounts cuz everybody is trying to cash out.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia1uuc6",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653563366.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia1vqu1",
                    "author": "coinbasesupport",
                    "score": 1,
                    "created_utc": 1653563987.0,
                    "response": "Thanks for the message, u/dbyoung00. \n\nWe’re going to do some additional research into this for you. We’ll follow up with you here, when we have more information on your case. Many thanks.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia2dbwi",
                    "author": "Connect-Ad-1088",
                    "score": 1,
                    "created_utc": 1653573352.0,
                    "response": "all the more reason to store your crypto on a hardware wallet?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia1vz1r",
                    "author": "dbyoung00",
                    "score": -3,
                    "created_utc": 1653564135.0,
                    "response": "Such a headache, just to have my money back 🤦‍♂️",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia1wo6k",
                            "author": "coinbasesupport",
                            "score": 1,
                            "created_utc": 1653564595.0,
                            "response": "Thanks for your patience. We've checked your support case #11990476, and we can see that a member of our specialist team replied to you 30 minutes ago. Please be sure to follow the instructions provided in the email. Many thanks for your understanding.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "uy56dc",
            "title": "Coinbase support sucks. Case #11977865",
            "url": "https://www.reddit.com/r/CoinBase/comments/uy56dc/coinbase_support_sucks_case_11977865/",
            "author": "Purplemoose30",
            "created_utc": 1653563461.0,
            "score": 0,
            "num_comments": 56,
            "subreddit": "CoinBase",
            "selftext": "Spent the past 2 days going back and forth with Coinbase Support about getting access to my account. It has been super frustrating. Here's my situation, and I hope anyone reading this and thinking of moving to a new country to keep your account up to date before you move! That was my mistake.\n\nI recently moved to Japan and now I have a Japanese phone number. Tried the 2-step verification but the two options given don't work.\n\nOption A. The verification asks for your current primary phone number but the country code is grayed out so I can't even input my new (Japanese) phone number. So I can't move forward to the next step of verifying my I.D and photo.\n\nOption B. They asked me to create a temporary new account and verify the new phone number. The problem with this option is that creating a new account in Japan requires a Japanese driver's license, which I don't have. \n\nThe Coinbase Support suggestions just say the same thing every email, going in circles, not really providing an alternative insight for other options. Utterly useless.\n\nAm I missing something? Perhaps others can provide suggestions?",
            "stickied": false,
            "comments": [
                {
                    "id": "ia1uzcv",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653563461.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia2d6uf",
                    "author": "Connect-Ad-1088",
                    "score": 1,
                    "created_utc": 1653573290.0,
                    "response": "coinbase sux because i went to japan, got it.....",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia5wklt",
                            "author": "Purplemoose30",
                            "score": 1,
                            "created_utc": 1653632354.0,
                            "response": "You’re welcome!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia4ng2p",
                    "author": "ConfidentKangaroo453",
                    "score": 1,
                    "created_utc": 1653607806.0,
                    "response": "Not only just Coinbase Support, Coinbase itself sucks, period",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia5wsqd",
                            "author": "Purplemoose30",
                            "score": 2,
                            "created_utc": 1653632521.0,
                            "response": "The support has been terrible. Haven’t had a chance to use Coinbase much so I can’t comment on the other aspect",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia5yjuo",
                                    "author": "coinbasesupport",
                                    "score": 1,
                                    "created_utc": 1653633877.0,
                                    "response": "Thanks for the follow-up, u/Purplemoose30. Can you confirm if you have received an email response sent earlier today? If yes, please read through the email and complete the instructions as shared by the specialist. If not, can you please confirm what the most recent email you received? Thank you!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia661kv",
                    "author": "TCEcrypto",
                    "score": 1,
                    "created_utc": 1653640397.0,
                    "response": "Very similar issue:\n\nI tried to login into my account but could not due to me not having access to my google authenticator. I saw a message that I needed to identify my Identity or else my account would be limited to withdrawals if I did not respond by July 17, 2022. I then contacted Coinbase and they told me to create a temporary account using a different email which I did so they can update my phone number. They then asked me to upload my Identity document and take a selfie which I did. I was then told to provide 3 months of bank statements which I did and answer 3 other questions which I did. I would like access to my original account as I have complied with all of the legal documentation and answers. \r  \n\n\nCase #11990106",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia6c8sj",
                            "author": "Purplemoose30",
                            "score": 1,
                            "created_utc": 1653645950.0,
                            "response": "I tried creating a temporary account with a new email. The problem is that since I am in a new country, it's asking for the foreign country driver's license, which I do not have. \n\nCoinbase support responds fast but they give the same 2 advice over and over again that they're useless. They don't actually read the issue and hope it goes away. Good luck resolving your issue.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia6itil",
                                    "author": "TCEcrypto",
                                    "score": 2,
                                    "created_utc": 1653650898.0,
                                    "response": "I am so frustrated as you are. I hope it works out for you.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "ia6cvcw",
                                    "author": "coinbasesupport",
                                    "score": 1,
                                    "created_utc": 1653646483.0,
                                    "response": "Thanks for getting back to us, u/Purplemoose30.\n\nWe can see that you have responded to your support case recently. Rest assured our team is working on this and will get back to you once hey have an update.\n\nWe appreciate your patience while we look into this issue for you.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iailk2g",
                    "author": "Purplemoose30",
                    "score": 1,
                    "created_utc": 1653891000.0,
                    "response": "UPDATE: Been 1 week of emailing back and forth with them. The Coinbase support team only suggests the same 2 answers in every email. At this point, Coinbase does not care, and would rather lock up your funds than give you access to them.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaimixh",
                            "author": "coinbasesupport",
                            "score": 1,
                            "created_utc": 1653891754.0,
                            "response": "Hi, u/Purplemoose30! We understand that this is important, and thanks for your feedback. We made sure that  your case is noted with your feedback here. Please give our team some time to reply to your email. Thank you!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia1vo1i",
                    "author": "coinbasesupport",
                    "score": 0,
                    "created_utc": 1653563935.0,
                    "response": "Thanks for reaching out to us, u/Purplemoose30. We’re going to do some additional research into this. We’ll follow up with you here, when we have more information.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia1wzmt",
                    "author": "coinbasesupport",
                    "score": 0,
                    "created_utc": 1653564803.0,
                    "response": "Hi u/Purplemoose30, thanks for providing that information.\n\nWe have reviewed your case, and we can see that our team is working on this at the moment for you. Rest assured, the team will get back to you with an update as quickly as possible.\n\nWe appreciate your patience while we work on this for you.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia5woxh",
                            "author": "Purplemoose30",
                            "score": 2,
                            "created_utc": 1653632443.0,
                            "response": "Your team sent another copy and paste response with no real solution.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}