{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "utj89k",
            "title": "Spin the wheel help!",
            "url": "https://www.reddit.com/r/CoinBase/comments/utj89k/spin_the_wheel_help/",
            "author": "Lightoneup420",
            "created_utc": 1653013522.0,
            "score": 2,
            "num_comments": 16,
            "subreddit": "CoinBase",
            "selftext": "So I recently joined coin base, and it told me if i set up a account and purchase crypto and verify etc etc… it would give me the chance to win $3-$200 in bitcoin. \n\nAfter completing these steps, it currently says “verifying your trade. 4/4” and its been like that for a couple hours. Did coinbase just scam me to make me purchase crypto? What exactly am i doing wrong? Help would greatly be appreciated, thanks!",
            "stickied": false,
            "comments": [
                {
                    "id": "i9a3ms1",
                    "author": "Aintgotnocandy4u",
                    "score": 2,
                    "created_utc": 1653013790.0,
                    "response": "Welcome to crypto. If you believe someone is going to just give you $200 dollars you’re going to lose a lot of money",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9a44qh",
                            "author": "Lightoneup420",
                            "score": 2,
                            "created_utc": 1653014040.0,
                            "response": "It was on the app…. It said as a new user, after i purchase crypto and verify my account, it would be available. Its not just a random person lmao. Its literally integrated in the app itself. Thanks for the help bud",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9a5yn3",
                            "author": "Aintgotnocandy4u",
                            "score": 0,
                            "created_utc": 1653014958.0,
                            "response": "You’re welcome. Just trying to help. If something is too good to be true just keep it in mind. Coinbase didn’t get to the point where it is by giving $200 dollars away to everyone who downloaded their service. \n\nMy advice 100 hours plus of research before investment depending on amount and then \nNext steps- Coinbase wallet then ledger \nWelcome and good luck!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9a33oq",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653013522.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9a45d0",
                    "author": "coinbasesupport",
                    "score": 1,
                    "created_utc": 1653014049.0,
                    "response": "Hey u/Lightoneup420! Looks like this isn't one of our offers. To check legitimate promotions from us, check out our help article here: https://help.coinbase.com/en/coinbase/getting-started/other/coinbase-sweepstakes. If you have further questions, don't hesitate to send us a support case by going to https://help.coinbase.com/en/contact-us Thanks!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9a4dbh",
                            "author": "Lightoneup420",
                            "score": 0,
                            "created_utc": 1653014156.0,
                            "response": "Yes it is, I downloaded the app, it said if i register now, and verify, and after i purchase crypto, it will gove me the chance to spin the wheel. Its still on the app right now. Its currently waiting to berify my trade still…",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9adc23",
                                    "author": "druglover17",
                                    "score": 1,
                                    "created_utc": 1653018988.0,
                                    "response": "Bro... if coinbase themselves have said this isn't a promotion they do. Then they obviously dont do it...",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9adji6",
                                            "author": "Lightoneup420",
                                            "score": 1,
                                            "created_utc": 1653019113.0,
                                            "response": "Bro i have screenshots of me in the app, completing the 4 steps. As of right now its still verifying, i was just seeing if it was a glitch. Search it up… it is a real thing lmao. Search up “coinbase wheel spin” and it should be the first result labeled “New User Incentive”. So you are wrong.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9adox3",
                                                    "author": "druglover17",
                                                    "score": 1,
                                                    "created_utc": 1653019202.0,
                                                    "response": "Could I see the screenshot? Post a link or however ppl on reddit do it.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9adquj",
                                                            "author": "Lightoneup420",
                                                            "score": 1,
                                                            "created_utc": 1653019233.0,
                                                            "response": "Go to your dms",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9a8ybg",
                    "author": "Kiwip0rn",
                    "score": 1,
                    "created_utc": 1653016529.0,
                    "response": "Most likely the funds have not cleared yet.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9a98ul",
                            "author": "Lightoneup420",
                            "score": 1,
                            "created_utc": 1653016689.0,
                            "response": "Finally, the first person that isnt dming me trying to scam me. I do want to say that the funds appeared in my litecoin wallet that i have purchased. But it still hasnt gave me the wheel spin like it has promised. Man…. Coinbase is very annoying so far",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}