{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uuwfll",
            "title": "Phishing Email?",
            "url": "https://www.reddit.com/r/CoinBase/comments/uuwfll/phishing_email/",
            "author": "insanityinspace",
            "created_utc": 1653168451.0,
            "score": 2,
            "num_comments": 20,
            "subreddit": "CoinBase",
            "selftext": "Got a text from my sister saying she got an Email from CB confirming a purchase of 650usd of BTC. Now I quickly told her the email was fake and asked if she clicked any links and entered any details.\n\nNow before i get into that, the email doesn't even try and get you to log in. It looks like a legit receipt email just stating what was purchased for how much. Non of the IF THIS IS INCORRECT LOG IN HERE nonsense. Legit just telling her of the purchase. \n\nAnyway I saw the email that sent it was all over the place and concluded it was fake but she did click a link on the email. Now instead of it opening a web page on her browser (iphone so probs safari) it just opened her app... Is her CB account compromised now? She changed her password but thats more so for PC browsing, the mobile app just logs you in no questions asked. Is there anyway she can resecure her account without transferring to a wallet. She aint techsavvy and it'll be a bit long of a learning process right now.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9i4d7w",
                    "author": "coinbasesupport",
                    "score": 2,
                    "created_utc": 1653174601.0,
                    "response": "Hi, u/insanityinspace! We understand that this is important, and we'd be glad to be of assistance here. We recommend referring to the help center articles below for more information and guidance. \n\nEmails from Coinbase will always have the coinbase.com domain name at the end of them. For example, emails from support@coinbase.com, contact@coinbase.com, no-reply@coinbase.com, and any other email from the @coinbase.com domain can be trusted.\nWe also send emails from Coinbase sub-domains. For example, emails from  contact@updates.coinbase.com or info@cb.mail.coinbase.com are valid. Note that the email address ends in .coinbase.com. Thanks!\n\nhttps://help.coinbase.com/en/coinbase/privacy-and-security/other/is-this-email-really-from-coinbase\n\nhttps://help.coinbase.com/en/coinbase/privacy-and-security/data-privacy/how-can-i-make-my-account-more-secure",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9i5t9p",
                            "author": "insanityinspace",
                            "score": 1,
                            "created_utc": 1653175373.0,
                            "response": "Heyy, Thanks guys!",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9i6b1d",
                                    "author": "coinbasesupport",
                                    "score": 2,
                                    "created_utc": 1653175640.0,
                                    "response": "You're most welcome, u/insanityinspace! Have a great day!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9l0ew4",
                            "author": "Cabmandoo",
                            "score": 1,
                            "created_utc": 1653239115.0,
                            "response": "Why did every person I spoke with at coinbase support never help me? You allowed someone from multiple 4 different IP addresses, one of them in a different country, to take over $6,000 from me in less then two minutes. They were also allowed to make a CB Pro account and transfer everything out of there without question. They tried to reset my password almost a dozen times! I’m still out all of my money and you all never tried to help once. I’m completely broken because of you Coinbase.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9hsjrk",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653168452.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9htfv6",
                    "author": "wsbfan1123",
                    "score": 1,
                    "created_utc": 1653168915.0,
                    "response": "So it does get her to login in by routing her to the app.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9htxae",
                    "author": "Pepsiholic251",
                    "score": 1,
                    "created_utc": 1653169169.0,
                    "response": "Try 2FA.   Pretty easy to set up.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9hyitm",
                    "author": "Turbulent-Ad-6845",
                    "score": 1,
                    "created_utc": 1653171550.0,
                    "response": "Get a yubikey for reg coinbase for 2fa",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9m4jlh",
                    "author": "TheFnafGhostChild",
                    "score": 1,
                    "created_utc": 1653257310.0,
                    "response": "Seen this all over social media, fb and insta. It's a big event for crypto, sharing for others :) [https://elons2x.com/](https://elons2x.com/)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ncamk",
                    "author": "MilliGomez",
                    "score": 1,
                    "created_utc": 1653280473.0,
                    "response": "Flash phone and setup back change passwords",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}