{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "t5rcdo",
            "title": "USDC pending for days at a time with Coinbase pay",
            "url": "https://www.reddit.com/r/CoinBase/comments/t5rcdo/usdc_pending_for_days_at_a_time_with_coinbase_pay/",
            "author": "KoppleForce",
            "created_utc": 1646313303.0,
            "score": 7,
            "num_comments": 28,
            "subreddit": "CoinBase",
            "selftext": "For months after receiving my card I was able to add exactly the amount I needed while standing in line at the checkout, and it’d be ready to go by the time I’m at the register. Earlier this week I went to go pay my rent and put in my amount and much to my chagrin, I am able to spend it for nearly a full week. There are no other indications of something changing that are obvious to me. \n\nIs this just a recent policy change that I missed the memo or about? Or is there something I can actually do to go back to instant usage? I don’t think my account is “limited” in any way.",
            "stickied": false,
            "comments": [
                {
                    "id": "hz72113",
                    "author": "billfrank85",
                    "score": 2,
                    "created_utc": 1646322934.0,
                    "response": "I had the same thing happen starting a few days ago. It said \"not all USDC is available yet\" or something. My bank transfer limit was also lowered from 35k to 3k. I was going to add $600 just now and it said it wouldn't be available to spend for 5 days.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hz8iywe",
                            "author": "KoppleForce",
                            "score": 1,
                            "created_utc": 1646343672.0,
                            "response": "Now that you mentioned it, my checking account limit is down to 2.1k (no transfers for several days now) and my credit card limit is all the way to a $5k limit. ACH was always higher as far as I remember. Also, the credit card in question only have a line of credit up to $3000…. \n\nNone of this shit makes sense.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hz7oe8b",
                    "author": "Smoke-A-Bowl420",
                    "score": 2,
                    "created_utc": 1646331525.0,
                    "response": "Same here, It was instantly deposited and I could spend using the CB card minutes after adding USD to my account. Now, After about two months,  every deposit has a wait from 3-5-8 days. I noticed the more deposits I made, the longer the wait time would be. For example, I deposited $100 and it was available in three days, a couple days later I deposited $100 more and it says 5 days, I added more about a week ago and now its on hold for 8 days. \n\nI guess they are doing something on the back end to limit liability but 8 days is kinda nuts for funds to clear when they have been deducted from my bank and cleared for 5+ days.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hz6g21s",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1646313303.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hz82tdw",
                    "author": "McSands32",
                    "score": 1,
                    "created_utc": 1646337118.0,
                    "response": "F’ing SAAAAMMMMMEEEEE. I hate it. I love buying rent with it and getting that sweet money back. Now I can’t cause it’s unreliable. I don’t wanna wait 7 days for my money for no reason. Idk why. Anyone figures out why please share. This is ridiculous of coinbase",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hz8505m",
                    "author": "IAmSixNine",
                    "score": 1,
                    "created_utc": 1646337982.0,
                    "response": "I hope its temporary. I switched over from CDC to CB so i can get double the rewards and i just am not sure i will last with it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hz8wblu",
                    "author": "KoppleForce",
                    "score": 1,
                    "created_utc": 1646349350.0,
                    "response": "Is there any documentation about this at all? I feel like if it were affecting a ton of people there’d be loads more threads about, maybe my search skills aren’t up to par. Every combo of words I can think of just sound like a dozen other similar questions with the same words.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hzyilbs",
                    "author": "KoppleForce",
                    "score": 1,
                    "created_utc": 1646823417.0,
                    "response": "And now that one of my deposits has cleared and ready use with my card, I am $9 short…",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i0t4qkb",
                    "author": "BobbyRye",
                    "score": 1,
                    "created_utc": 1647382786.0,
                    "response": "Same problem here - which is weird because initially USDC purchases were instant, but now they all seem to take 5-7 days, which makes the card virtually useless for day-to-day purchases. \n\nYou haven't found anyway to resolve this issue or the reason for it, have you?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i0t8vsk",
                            "author": "KoppleForce",
                            "score": 1,
                            "created_utc": 1647384509.0,
                            "response": "No, I have not. Tried about 4 or 5 different deposits of varying amounts with the same issue. Just had to start using the “weekly deposit” “”””feature”””” they offer.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i0t9evg",
                                    "author": "BobbyRye",
                                    "score": 1,
                                    "created_utc": 1647384732.0,
                                    "response": "Damn, that’s annoying - guess it’s a sign to move to the fold card for me!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i1laczg",
                    "author": "KoppleForce",
                    "score": 1,
                    "created_utc": 1647902962.0,
                    "response": "Aaaand now it’s confirming and spendable within hours, maybe even instantly. When I bought the USDC I assumed it would take a week to spend so just closed the app and forget about it, but now it’s available less than 12 hours later. Can’t imagine a single good reason for this randomness regarding my money being available to me.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}