{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uz5ln1",
            "title": "Pipe dream: CB returns my staked ETH bc I need it lol",
            "url": "https://www.reddit.com/r/CoinBase/comments/uz5ln1/pipe_dream_cb_returns_my_staked_eth_bc_i_need_it/",
            "author": "InterestingTakeGene",
            "created_utc": 1653679102.0,
            "score": 2,
            "num_comments": 33,
            "subreddit": "CoinBase",
            "selftext": "Disclaimer: I’m a total crypto rookie. \n\nI staked .17 ETH on Coinbase one year ago. I have read the user agreement pertaining to staked ETH, I understand I “pledged” it to them. They will not allow me to withdraw it bc it’s locked until 1.5 rolls out. My issue is, when my connected fiat account didn’t have any more funds, they pull out the owed balance from those “locked” funds. I cannot unlock and withdraw them though. It’s a losing battle I guess, but it is not right. Any suggestions for me? \n\nAlso, I was contacted by two different law firms about class action suits against them. I did not sign, but I was told I was probably eligible? \n\nI’m looking for any information anyone has about the staked ETH thing and what these class action suits were about? \n\nI’m probably out of luck, but I figured I would post and see what everyone has to say. Most likely it will be something like, “sucks dude” but idk worth a shot to learn more I guess? Thanks in advance.",
            "stickied": false,
            "comments": [
                {
                    "id": "ia95dnc",
                    "author": "Kiwip0rn",
                    "score": 2,
                    "created_utc": 1653694509.0,
                    "response": "You are out of luck, they will remain locked until August or September (or September/October I can't remember now).\n\nAnd none of the Class Action law suits have gone anywhere... one manages to win a ruling about semantics in the Terms earlier, but nothing of monitary winnings.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia96m9f",
                            "author": "InterestingTakeGene",
                            "score": 2,
                            "created_utc": 1653695145.0,
                            "response": "Thanks for info. I appreciate it. Shot in the dark on my end to be posting here. \nAnyway, how much money is in crypto scams?! I’ve had 10 fake Coinbase support Reddit account reach out to help 😂 logo is off in most. I explained to one thanks to him they gave me my money back and some bc they felt bad for me! 😂",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iaa4brr",
                            "author": "NewConsideration3210",
                            "score": 1,
                            "created_utc": 1653713903.0,
                            "response": "Actually, six months after the merge.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia8yq8f",
                    "author": "gold4829",
                    "score": 0,
                    "created_utc": 1653691162.0,
                    "response": "My issue is, when my connected fiat account didn’t have any more funds, they pull out the owed balance from those “locked” funds.\n\nWow thats some BS.  No wonder their is a class action lawsuit going on there",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia90gq5",
                            "author": "InterestingTakeGene",
                            "score": 0,
                            "created_utc": 1653692018.0,
                            "response": "I think it’s all probably legal but just shady. If I purchase crypto on CB, Fiat account overdrafts and they don’t get their money, they’ll create a pointer or IOU essentially from me to them with my “locked” funds. \n\nMy next thought concerns timing of this bc if they pull it a week later after not receiving, then the amount could be different since ETH fluctuates. Normal banks don’t take inflation into account in these scenarios either; so, I doubt I have a case lol. It’s interesting though. Oh welllllllll I’ll just wait. \n\nSo used to seeing fancy big corporation have me sign something I just didn’t read it but when it comes to crypto……….. even if it’s the biggest name in the game……. READ EVERYTHING!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia88zye",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653679103.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaj9hl3",
                    "author": "SmgymaAy",
                    "score": 1,
                    "created_utc": 1653911336.0,
                    "response": "Check out #AstroBirdz. Big things happening with this project with release of marketplace and N.E.S.T. (NFT Energizing Space Terminal). Load up now or #FOMO in later. Your choice!\n\n @astro_birdz #birdzarmy \n #luna #BTC #web3 #gem\n #NFT #NFTCommunity \n https://t.me/AstroBirdzOfficial",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaj9l8w",
                    "author": "lodalelemeratu",
                    "score": 1,
                    "created_utc": 1653911405.0,
                    "response": "Check out #AstroBirdz. Big things happening with this project with release of marketplace and N.E.S.T. (NFT Energizing Space Terminal). Load up now or #FOMO in later. Your choice!\n\n @astro_birdz #birdzarmy \n #luna #BTC #web3 #gem\n #NFT #NFTCommunity \n https://t.me/AstroBirdzOfficial",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}