{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "reic6i",
            "title": "Coinbase Fraud",
            "url": "https://www.reddit.com/r/CoinBase/comments/reic6i/coinbase_fraud/",
            "author": "Electronic_Degree705",
            "created_utc": 1639288195.0,
            "score": 0,
            "num_comments": 8,
            "subreddit": "CoinBase",
            "selftext": "I talked to 2 customer service agents  after waiting for 2 hours. The 1st one claimed he was not  in a department to help me so he  ask to transfer my call, before he did that I make sure he verify my Identity which he did after he transfer the lady ask for me to identify myself and I gave her the same information and she claimed that she can’t verify my account and drop the phone.\n You are playing with peoples money and patience \n\nI am still waiting to hear from  coinbase how long it will take to fix the  problem with the number of Gyen coin I bought between 16th to 19th of November amount  at 0.0232 / 0.0672 amounting 13,884,418.487321 Gyen tokens but coinbase change the number of Gyen to 138844.184873. As per #congress hearings coinbase C.F.O Ms Alecia Haas told the hearing than coinbase will honor the amount on computer the client bought the tokens . It looks like it is not what coinbase is doing instead they cooked new figures on investors receipts",
            "stickied": false,
            "comments": [
                {
                    "id": "ho7s57j",
                    "author": "AutoModerator",
                    "score": 2,
                    "created_utc": 1639288195.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ho7t8f5",
                            "author": "Electronic_Degree705",
                            "score": -2,
                            "created_utc": 1639288833.0,
                            "response": "Worse customer service is on coinbase ,1st the freeze accounts 2nd they close open case without fixing the issue 3rd the change number of coin bought and took half of investment 4th they lied to Congress 5th customer service is there to frustrate its investors and nothing got resolved",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hu95cm4",
                    "author": "MaddenMan21",
                    "score": 2,
                    "created_utc": 1643171493.0,
                    "response": "Coinbase shares your personal info with other companies like crypto.com and Gemini.  They claim to keep your private info private but that is a lie.  If your account is suspended on one platform the other companies won’t allow you to use their sites.  Is that sinister or what?",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}