{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uzooyg",
            "title": "Is My Wallet Straight Broken?",
            "url": "https://www.reddit.com/r/CoinBase/comments/uzooyg/is_my_wallet_straight_broken/",
            "author": "Big_Meta",
            "created_utc": 1653748835.0,
            "score": 2,
            "num_comments": 36,
            "subreddit": "CoinBase",
            "selftext": "I recently received some USDT as materials budget for a project.  It landed in my Coinbase Wallet and then I sought to cash out.  Trying to transfer from CB wallet to CB .com kept giving the \"unable to determine network fee\" message.  I transferred a couple hundo ETH from CB to wallet to make sure I had Gas.  Then I messed up.  I assumed that maybe the Wallet needed to swap the USDT to USD to transfer. (CB.com started requiring the USD swap to cash out awhile back).  Wallet's 1st suggested coin transfer was a big black D, said Dollar...USD.  Iswapped all the USDT for what I thought was cash.  Turns out it was a one way transfer to \"Dollar Coin\" USDx...not Kava USDX, not the other USDXs.  The Dollar Coin isn't supported by CB, won't transfer, apparently can't be changed back, is supported on very few other exchanges (many look too sus for me to use)  I'm trying to interface w UniSwap to sell at a massive loss.  All I'm getting from any action in CB Wallet is \"unable to determine network fee\". Trying to connect Wallet to UNiswap shows my assets, but stays on a \"connecting\" wheel during it's swap initializing.\n\n\\-is something broken or blocked on my CB wallet that I'm not getting notification about?\n\n\\-did I buy a one way ticket into an unsaleable \"dollar coin\"  what is this stuff?\n\n   I appreciate the PMs with hyperlinks to extensions that will solve my problems, but I have to assume that legitimate feedback would come in the public comments and not PM",
            "stickied": false,
            "comments": [
                {
                    "id": "iabglug",
                    "author": "Royal-Author-669",
                    "score": 4,
                    "created_utc": 1653749287.0,
                    "response": "Ignore all DMs, i actually turned my DMs off. NEVER EVER, EVER EVER click links",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iacybgz",
                    "author": "Big_Meta",
                    "score": 3,
                    "created_utc": 1653774726.0,
                    "response": "For posterity...if any other crypto novice find themselves frozen on \"unable to determine network fee\" in the android app.  It's that you're gas prices are set low and the miners are all taking \"bribes\" to favor other transactions.  I don't think there's a way to adjust in the android app.  In the chrome extension you can open transaction history, see stalled transactions, and hit a lightning bolt icon next to them to \"speed them up\"...by paying a bit more.  That was the key to moving my unsupported \"dollar coins\" to uniswap and finally unloading em!!!  \nStay well Fam!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iacxgty",
                    "author": "BiochemBeer",
                    "score": 2,
                    "created_utc": 1653774342.0,
                    "response": "You can try importing your seed phrase into trustwallet or MetaMask. Then use that to do your swap. \n\nUltimately you need to send the funds to the coinbase web exchange to cash out.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaczu8k",
                            "author": "BiochemBeer",
                            "score": 3,
                            "created_utc": 1653775443.0,
                            "response": "I just looked on uniswap and the token I think you used should allow you to swap back to tether (or better yet Eth) you will need to pay the gas fee.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iadk7p6",
                                    "author": "Big_Meta",
                                    "score": 1,
                                    "created_utc": 1653786076.0,
                                    "response": "Yes, I'm having success with uniswap.  Seemed like the most legit exchange to recognize the coin (even it warns it's an imported coin not supported or something.)  Still lost a couple grand in the last 2 days on depreciation...but this stuff don't seeme like a smart hodl!!!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iacjfea",
                    "author": "cryptotraderinwork",
                    "score": 1,
                    "created_utc": 1653767684.0,
                    "response": "Just stop using coinbase, they are the worst. When you send an unsupported ERC-20 token or use the wrong network, coinbase doesn't help. Other exchanges do help in these cases. Coinbase has the worst support I ever experienced.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iacuxvn",
                            "author": "Big_Meta",
                            "score": 1,
                            "created_utc": 1653773207.0,
                            "response": "Honestly...this feels like sound advice.  I think I started w them years ago because they where a big well known company. I figured that would translate to reliable interface, reasonable fees and good customer service.  Not so sure about that assumption now.  \n\n\nGot any Recommendations for favorite alternatives?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iad4q0g",
                                    "author": "Kiwip0rn",
                                    "score": 1,
                                    "created_utc": 1653777821.0,
                                    "response": "There is no true alternative to the Safety and Security offered by the Coinbase Custody platform.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iaeezf2",
                                            "author": "cryptotraderinwork",
                                            "score": 1,
                                            "created_utc": 1653805776.0,
                                            "response": ">Yeah, it is so safe that when Coinbase goes bankrupt, you don't get your money back. Also, they don't even have support for retrieving unsupported ERC-20 tokens, while other exchanges do have support in these cases.   \n>  \n>  \n>  \n>You should go to Binance.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iabfogu",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653748835.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaf34t4",
                    "author": "Creepy-Importance-13",
                    "score": 1,
                    "created_utc": 1653826356.0,
                    "response": "Get out while you can",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iabkn9w",
                    "author": "coinbasesupport",
                    "score": 0,
                    "created_utc": 1653751194.0,
                    "response": "Appreciate the details on the difficulty you've experienced using your CB Wallet. If you have already tried some of the troubleshooting steps here: https://help.coinbase.com/en/wallet/other-topics/troubleshooting-and-tips\nand are still having the issue, please let us take a closer look into this for you. \n\nYou can get started right here: https://help.coinbase.com/en/contact-us?product=coinbase-wallet\nprovide the details, and we will be able to investigate further.\n\nThank you kindly!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iacxbqh",
                            "author": "Big_Meta",
                            "score": 1,
                            "created_utc": 1653774281.0,
                            "response": "I am beginning to figure it out.  I'll explain the process in comments below.  The  android wallet app is sparse and issues are better solved in chrome extension.  \nMistaking \"Dollar Coin\" for the US Dollars in the app (or any other stable coin)  Was my mistake.  It cost me thousands.  Crypto is a dangerous and volatile place.  The USDx was one of the first auto generated swaps for my USDT in the wallet.  It is not supported by coinbase, and it looks like it can't be swapped or sold in the CB wallet.  Only bought.  As you develop your product, I wonder if you can work towards a tiered system or warning for coin purchases that are irreversible one way streets.  I can see how a wallet may offer more buy options than swappable or saleable coins,  but some descriptive info would be nice for us Luddites!   \nThank you, Good day!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}