{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ui9jzt",
            "title": "Is anyone not able to buy or sell?",
            "url": "https://www.reddit.com/r/CoinBase/comments/ui9jzt/is_anyone_not_able_to_buy_or_sell/",
            "author": "Snowbunnies44",
            "created_utc": 1651679134.0,
            "score": 9,
            "num_comments": 41,
            "subreddit": "CoinBase",
            "selftext": "The buy/sell button leads me to a Connectivity Issue. \n\nThis seems to be ongoing or maybe I'm just terrible at timing?\n\nAnyone else currently experiencing this issue?",
            "stickied": false,
            "comments": [
                {
                    "id": "i7cfww3",
                    "author": "cronktonkula",
                    "score": 4,
                    "created_utc": 1651699722.0,
                    "response": "Yeah same here, they’re not acknowledging anything is wrong though. I’m pulling my money out the second I can and going to a different platform.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uidi20",
            "title": "Coinbase froze my account due to their own \"technical difficulties\" processing ACH transfer",
            "url": "https://www.reddit.com/r/CoinBase/comments/uidi20/coinbase_froze_my_account_due_to_their_own/",
            "author": "okspam",
            "created_utc": 1651689843.0,
            "score": 17,
            "num_comments": 107,
            "subreddit": "CoinBase",
            "selftext": "I initiated a regular ACH transfer from my bank checking account yesterday. I immediately used the USD funds to make a couple trades. Coinbase soon informed me that the ACH transaction was canceled by my bank, my Coinbase account has been disabled and I needed to repay the USD funds. I immediately called my bank and they informed me they see no record of an ACH request from Coinbase and they did NOT cancel or reject any funds request. Indeed, this is the same bank I have been using for many years to fund Coinbase with no problems. So I immediately clicked \"Resolve\" inside my CB account and initiated a second USD transfer from that same bank. Those funds were successfully approved and ACH transfer started.\n\nLater I received an email from Coinbase admitting the problem was technical difficulties on their end:\n\n>\"We are reaching out to you regarding a recent ACH transaction on your account, where you attempted to buy or deposit funds into your Coinbase account using your bank account.  \n>  \n>On May 3rd, 2022, Coinbase experienced technical difficulties processing transactions from US bank accounts via ACH. As a result, while your Coinbase account was credited and you were able to purchase crypto on our platform, Coinbase did not actually receive any funds from your bank.   \n>  \n>When this happens, Coinbase is required to recover the USD value of the original buy/deposit you attempted to make to your account.  If your Coinbase account balance was insufficient to enable us to do so, you will not be able to trade, purchase, or withdraw until the resulting negative balance has been resolved.\"\n\nNow even though I already initiated a successful second ACH transfer, Coinbase has still LOCKED my account for any crypto withdrawals or trading. I called customer support and they informed me they understand it was not my fault but their policy requires my account stay locked for 5 business days until the latest ACH transfer to complete.\n\nThis makes no sense, since the error seems to be entirely on Coinbase’s end, but yet my account is frozen and funds held hostage as if I am a criminal!?\n\n======================================\n\nCLOSURE UPDATE ON MAY 5:\n\nLooks like Coinbase came through and expedited a fix, unfreezing many accounts without making us wait 5 days as originally messaged. The problem was initially reported by CB on [https://status.coinbase.com/](https://status.coinbase.com/) page as a glitch with US bank ACH transfers that was resolved within 30 minutes. However, the freezing of affected accounts was not resolved until approximately 48 hours later, at least in my case. THANKS COINBASE for doing the right thing here and expediting the fix! ",
            "stickied": false,
            "comments": [
                {
                    "id": "i7fiwod",
                    "author": "Scooty_doge",
                    "score": 7,
                    "created_utc": 1651761631.0,
                    "response": "I'm getting tired of CB and their BS.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7bx0zt",
                    "author": "OpticallyMosache",
                    "score": 7,
                    "created_utc": 1651692365.0,
                    "response": "I'm experiencing the same issue but with Wells Fargo Support told me the same thing. I re-linked my bank account and deposited $100 on the normal Coinbase (not Pro). USD shows a balance of $100 but I'm still disabled. Told to wait 5 days. Annoying.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7c3v2a",
                            "author": "Tecumsehs_Revenge",
                            "score": 5,
                            "created_utc": 1651695013.0,
                            "response": "I had the same issue. Support told me to wait a few days for bank to clear. Said I had 5 days. They liquidated my btc today with no warning even tho they could have taken the usdc instead. Robinhood levels of shady",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7c4aqs",
                                    "author": "OpticallyMosache",
                                    "score": 5,
                                    "created_utc": 1651695186.0,
                                    "response": "I'm really hoping they don't liquidate my BTC. It's their system issue and not the users. Seems widespread right now. Probably managing volume and supply in a shady way.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i7clsof",
                                    "author": "okspam",
                                    "score": 3,
                                    "created_utc": 1651702038.0,
                                    "response": "Agree. I would be so pissed if they liquidate BTC before USDC!?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i7cztc7",
                                            "author": "theguyfromrushhour",
                                            "score": 3,
                                            "created_utc": 1651708191.0,
                                            "response": "Worse, they liquidated my Bitcoin before **USD** for the same ACH issue as everyone else had yesterday.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i7gsj3u",
                                                    "author": "mroid1",
                                                    "score": 3,
                                                    "created_utc": 1651780114.0,
                                                    "response": "same here",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i7fs3lz",
                            "author": "Brilliant_Exam_1323",
                            "score": 3,
                            "created_utc": 1651765302.0,
                            "response": "Same here",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7g3xu6",
                                    "author": "OpticallyMosache",
                                    "score": 3,
                                    "created_utc": 1651770270.0,
                                    "response": "Annoying",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i7co6jg",
                    "author": "Bog-EA",
                    "score": 5,
                    "created_utc": 1651703020.0,
                    "response": "Same issue here happened April 29.  I haven't tried using the debit card to see if it works but everything else seems to be locked up.  I may have to rethink using their debit card.  For all the negativity you here about banks.  Some of these crypto exchanges are much worse than anything in the banking world.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7d4kj9",
                            "author": "Mcmjlm3",
                            "score": 6,
                            "created_utc": 1651710312.0,
                            "response": "My CB debit card doesn’t work, just to help answer your question.. ridiculous to the 10th power",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7dkjwy",
                    "author": "Rolandooo",
                    "score": 5,
                    "created_utc": 1651717499.0,
                    "response": "Same boat. This happened to me yesterday evening. Hope they own up to this being their error and don't restrict our accounts in anyway.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7gc6tk",
                            "author": "Brilliant_Exam_1323",
                            "score": 3,
                            "created_utc": 1651773534.0,
                            "response": "same",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7bxwmq",
                    "author": "AlChapoDiamonds",
                    "score": 3,
                    "created_utc": 1651692712.0,
                    "response": "Same.. bought a little ZRX… got the crypto.. they never got the cash… I have since repaid what I bought, but now I CANT move/buy because it says they still haven’t received the money even though it came out of my account.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7cmfqu",
                            "author": "okspam",
                            "score": 3,
                            "created_utc": 1651702303.0,
                            "response": "Sounds like we did same steps and in same boat now. Please, Coinbase, make it right and unfreeze all these accounts!",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7e1729",
                                    "author": "greendevil77",
                                    "score": 3,
                                    "created_utc": 1651726261.0,
                                    "response": "Lol they froze my account and refuse to even tell me why.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i7c5oh2",
                    "author": "grymattr",
                    "score": 3,
                    "created_utc": 1651695725.0,
                    "response": "I had the same thing happen yesterday when I wanted to buy Shib when it bottomed out so I did a quick ACH transfer.  They errantly told me my back rejected it when it turns out they had an internal issue so I missed the buy at the price I wanted.  It was resolved this morning but now I'll use another site to do my purchases.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7cr9sj",
                    "author": "Spankymcdoodles",
                    "score": 3,
                    "created_utc": 1651704347.0,
                    "response": "Same problem yesterday. Card being declined still today. Didn't read where I had to wait 5 days. Moneys in there.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7d4c1z",
                    "author": "Mcmjlm3",
                    "score": 3,
                    "created_utc": 1651710207.0,
                    "response": "I got the same thing.. so relieved it wasn’t just me.. why can’t multi billion dollar companies just build stuff that works??!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7devju",
                    "author": "7ailwind",
                    "score": 3,
                    "created_utc": 1651714897.0,
                    "response": "Wow, this just happened to me but my account wasn’t locked. After I made a few trades and transferred coins out, they actually took the same amount of money I transferred out of my ETH2 which I’m not even sure if they can do that since ETH2 is supposed to be staked?? Was on the phone with support for an hour and they couldn’t tell me anything. I’ve been using them for awhile and this was my first issue and needing to deal with customer service. I know understand the pain of people that I see posting here. Was a horrible experience and I’m happy I only keep my ETH2 on there. If I could trade I would take that off as well.\n\nEdit: Using Bank Of America but seems like other banks are also “canceling” transactions",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7f2prf",
                            "author": "Holbrecht",
                            "score": 5,
                            "created_utc": 1651754318.0,
                            "response": "This is a Coinbase issue NOT your bank.\n\nThey're liquidating people's crypto claiming you \"owe them money\" when you're don't.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7gaofc",
                    "author": "Impress_Valuable",
                    "score": 3,
                    "created_utc": 1651772939.0,
                    "response": "I lost my entire btc. Balance through CoinBase. I had trouble logging in at first. When I finally got in, my balance was zero. 2700$ diapered. \nDon’t trust CoinBase. They won’t help you ether. There customer service doesn’t even know what’s going on.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7gd4rf",
                    "author": "earo1674",
                    "score": 3,
                    "created_utc": 1651773912.0,
                    "response": "SAME HERE\n\nMAKE 'EM HEAR IT\n\nTHIS IS UNACCEPTABLE",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7ghc1v",
                    "author": "Gary-Investments",
                    "score": 3,
                    "created_utc": 1651775633.0,
                    "response": "The same thing just happened to me on May 3 after I completed a $20,000 USD  \"successful deposit\" from my Wells Fargo account. Coinbase admitted this was due to an ACH error on their end,  but they still placed a 5 Day Restriction on my account which Phone Support said cannot be removed under any circumstances, even though it is Coinbase's admitted error.\n\n>*Thanks for reaching out to us. Our team is aware of this issue and is working on getting everything back to normal as soon as possible.*  \n>  \n>*Unfortunately this issue is still unresolved. Rest assured, we are working hard to rectify this situation as soon as possible. Thank you for your continued patience, and sorry for any inconvenience caused.*\n\nAnother interesting fact is I have $30,000 USD cash in my account, plus $10,000 SELL and $17,000 BUY orders that were entered **before my account was frozen** that were not allowed to execute on May 4 during the market pump, which has now cost me $5000 in losses due to the market drop today. My suspicion is this account freeze was \"intentional\" to prevent losses on their end. I am not a conspiracy theorist, but the timing of this is highly suspect, especially since it has happened to so many customers on May 3.\n\nHere are my written communications with Coinbase Support.\n\n**\\*\\*\\* COINBASE SUPPORT EMAILS,  TIMELINE \\*\\*\\***\n\n**Message #1 - May 3**  (2:00pm)\n\n>***We've cancelled your transaction***.  \n>  \n>On May 3, 2022, you deposited $20,000.00 via your bank account.Unfortunately, this transaction was canceled by your bank\\*.\\* If you wish to make another deposit, please try again or add a new payment method. If the transaction continues to be canceled, please visit our Help Center for support.We apologize for any inconvenience!  \n>  \n>Regards,  \n>  \n>Coinbase Support\n\n*I immediately called Wells Fargo and they said that Wells Fargo did not cancel the Coinbase transaction.  Coinbase clearly lied and blamed the issue on my bank.*\n\n&#x200B;\n\n**Message #2 - May 3**  (9:00pm)\n\n>***We've fixed the issue.***  \n>  \n>We are reaching out to you regarding a recent ACH transaction on your account, where you attempted to buy or deposit funds into your Coinbase account using your bank account.  \n>  \n>On May 3rd, 2022, Coinbase experienced technical difficulties processing transactions from US bank accounts via ACH. As a result, while your Coinbase account was credited and you were able to purchase crypto on our platform, Coinbase did not actually receive any funds from your bank.  \n>  \n>When this happens, Coinbase is required to recover the USD value of the original buy/deposit you attempted to make to your account.  If your Coinbase account balance was insufficient to enable us to do so, you will not be able to trade, purchase, or withdraw until the resulting negative balance has been resolved.  To make a payment to resolve this balance, please visit:  \n>  \n>[https://www.coinbase.com/payment\\_required](https://www.coinbase.com/payment_required)  \n>  \n>We sincerely apologize for any confusion caused by this issue. If you have any additional questions or concerns regarding your Coinbase account, please don’t hesitate to contact us.  \n>  \n>Regards,Coinbase Support\n\n&#x200B;\n\n**Message #3 - May 3.** (9:03pm)\n\n>***Funds recovery complete***  \n>  \n>We have successfully collected the funds from your recent failed transfer. However, there may still be restrictions on your account.  \n>  \n>Regards,  \n>  \n>Coinbase Support\n\n&#x200B;\n\n**Message #4 - May 3**  (10:30pm)\n\n>***Thanks for reaching out to us.***  \n>  \n>Our team is aware of this issue and is working on getting everything back to normal as soon as possible.Our team may not be able to provide timely updates via email. While we don't have an estimated time to resolution, you may use a debit card or PayPal account to make direct buys on your account should you wish.We appreciate your patience as we continue to resolve this issue.  \n>  \n>Regards,  \n>  \n>Coinbase Support\n\n&#x200B;\n\n**Message #5 - May 4**  (11:30am)\n\n>***Thank you for reaching back out about this issue.***  \n>  \n>Unfortunately this issue is still unresolved. Rest assured, we are working hard to rectify this situation as soon as possible.Thank you for your continued patience, and sorry for any inconvenience caused.  \n>  \n>Regards,  \n>  \n>Coinbase Support\n\n&#x200B;\n\n**Support Call - May 4**  (12:00-2:00pm)\n\n>***The 5 Day Restriction cannot be removed under any circumstance***  \n>  \n>I spent 2 hours on the phone with a Coinbase Support Specialist reviewing every detail. At the end of the call he was very apologetic, but stated that there was nothing anyone at Coinbase could do to remove the 5 Day account restriction once it has been applied due to Coinbase \"security\", even though the restriction was added due to Coinbase's error.  \n>  \n>I then requested a Supervisor to review with me but he stated that Supervisors are not available to speak with customers by phone.  He then stated that he would \"escalate\" my case and *Coinbase Pro Support* would be in touch with me via email to provide a more detailed response.\n\n&#x200B;\n\n**May 5**\n\n>I emailed Support 3 times requesting information regarding their policy and Terms and Conditions. I received no response.\n\n&#x200B;\n\n**May 6  (8:00am)**\n\n>I just logged in and the account restrictions have been fully removed. I received no written notice.\n\n&#x200B;\n\nYou are allowed to sue Coinbase via Small Claims Court or Arbitration for any documented losses you have incurred due to their error, but you will need to file a Coinbase Complaint first in order for any legal action to be successful. Here are the links:\n\n**HOW TO SUE COINBASE:** [https://www.peopleclerk.com/post/how-to-sue-coinbase](https://www.peopleclerk.com/post/how-to-sue-coinbase)\n\n**SUBMIT COMPLAINT:** [https://help.coinbase.com/en/contact-us/submit-a-complaint](https://help.coinbase.com/en/contact-us/submit-a-complaint)\n\nBest of luck to everyone, and just make sure to document everything!\n\n*\\~G*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7gs8zr",
                    "author": "mroid1",
                    "score": 3,
                    "created_utc": 1651780001.0,
                    "response": "I am in the same exact boat as you, and on the same day.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7cbc8u",
                    "author": "ChrisR109",
                    "score": 9,
                    "created_utc": 1651697921.0,
                    "response": "Wait for it.  Even tho CB admits it was on their end, the local know-it-alls will chime in and say it was still you that fucked up.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7e06jw",
                    "author": "greendevil77",
                    "score": 3,
                    "created_utc": 1651725631.0,
                    "response": "Their customer support is absolute trash",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uicgh5",
            "title": "Trading disabled/ Deposit failed due to TD bank and Coinbase disabled my account since this morning. Customer support not helpful. I can’t use it. Hope my money is secure and will not be lost",
            "url": "https://www.reddit.com/r/CoinBase/comments/uicgh5/trading_disabled_deposit_failed_due_to_td_bank/",
            "author": "Realistic-Pea-9280",
            "created_utc": 1651686986.0,
            "score": 30,
            "num_comments": 90,
            "subreddit": "CoinBase",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i7bnxbu",
                    "author": "okspam",
                    "score": 12,
                    "created_utc": 1651688795.0,
                    "response": "I had exactly same thing happen to me yesterday. Coinbase claims my bank rejected ACH transfer. But when I called my bank they said they did not (and I've been using this same bank to fund CB for years). Now my CB account is LOCKED for trading and withdrawals. Spent time with customer support yesterday. They know the issue and say it must be locked now until 5 days elapse for a new ACH transfer to complete. This is BS.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7ccxui",
                            "author": "mastershnizz",
                            "score": 8,
                            "created_utc": 1651698536.0,
                            "response": "Exact same issue with me yesterday and I immediately called and submitted complaints and called several times again today with the same response. My bank account has been debited as of this morning (and yesterday I checked and they did not cancel anything from coinbase) but I am here with 0 access to my funds and my ability to trade or withdraw. My original trade seemingly went through but I now have to wait 5 days to use my own money or to see whether or not CB feels doing anything about it?? Absolutely unacceptable and infuriating.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7cl6nh",
                                    "author": "okspam",
                                    "score": 7,
                                    "created_utc": 1651701795.0,
                                    "response": "100% agree! I'm in same situation. No access to my funds through no fault of my own. Ugh!",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i7cti1m",
                                            "author": "mastershnizz",
                                            "score": 5,
                                            "created_utc": 1651705331.0,
                                            "response": "I already have funds in my account from before this supposed “failed ACH transfer” on their end which I am also locked out of using.\n\nThis would be like a bank saying- you have no access to your savings account because an ACH direct deposit transaction from your employer is not going through. Also with no ability to provide timely updates. \n\nCoinbase’s user agreement is also shoddy in that you waive your ability to pursue legal action if you file a formal complaint in how they handled your issues.\n\nI hope my money is there, and if I ever get access to it again I will be moving elsewhere. Unacceptable.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i7bqpwl",
                            "author": "Realistic-Pea-9280",
                            "score": 5,
                            "created_utc": 1651689892.0,
                            "response": "Yes they keep saying same thing. My friend recommended me to use CB instead of Binance, I am so stupid. Even customer support agents say this is weird but they have to follow their policy. I just want to resolve my issue. Shouldn’t be that difficult to solve",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7bz0i5",
                                    "author": "Realistic-Pea-9280",
                                    "score": 5,
                                    "created_utc": 1651693132.0,
                                    "response": "Weird thing is I have resolve button but when I click it, nothing there can solve my issue.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i7cl18k",
                                            "author": "okspam",
                                            "score": 6,
                                            "created_utc": 1651701734.0,
                                            "response": "Same. I resolved already by depositing the amount of original failed ACH. But it still shows the locked warning message with \"Resolve\" link, which is confusing and makes me concerned that they haven't fully processed my repayment or that they still consider my account to be in breach.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i7cpu05",
                                                    "author": "Realistic-Pea-9280",
                                                    "score": 3,
                                                    "created_utc": 1651703725.0,
                                                    "response": "It didn’t work for me. I deposited same amount by myself and it also locked 🙂 getting worse",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i7btam9",
                                    "author": "Pristine-Cicada-220",
                                    "score": 6,
                                    "created_utc": 1651690899.0,
                                    "response": "I’ve been using CB and CB Pro for about 4 years, and this is the first time I’ve had issues issue of this scale. As long as you aren’t keeping everything in CB, I genuinely think this was a one-off glitch. Seems to have affected lots of people. I guess this is a good time to remind people “not your keys, not your coin”",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i7bxbcx",
                                            "author": "OpticallyMosache",
                                            "score": 7,
                                            "created_utc": 1651692479.0,
                                            "response": "Same thing with me. I re-linked my bank account and deposited the ACH amount into the USD wallet. It shows I can cover the BTC purchase but my account is disabled.\n\nFirst time experiencing this in the last five years using CB.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i7c24df",
                                                    "author": "Pristine-Cicada-220",
                                                    "score": 3,
                                                    "created_utc": 1651694337.0,
                                                    "response": "Be careful linking and unlinking. You can only do link 2 banks per 7 days, so if you’re troubleshooting and try to unlink a second time, you won’t be able to link another for even longer than this issue is supposed to take",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i7c4p9u",
                                                            "author": "OpticallyMosache",
                                                            "score": 5,
                                                            "created_utc": 1651695343.0,
                                                            "response": "Thanks for the warning. I was successful the first relink and have the necessary funds in USD to cover my purchase. I hope they take that instead of liquidating my BTC.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i7dqz41",
                            "author": "brucel59",
                            "score": 5,
                            "created_utc": 1651720608.0,
                            "response": "I can’t even talk to customer support",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7dyop1",
                                    "author": "okspam",
                                    "score": 3,
                                    "created_utc": 1651724730.0,
                                    "response": "Did you call their phone number and no pickup or eternal hold or ?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i7bu4qc",
                            "author": "WPCarey85",
                            "score": 4,
                            "created_utc": 1651691233.0,
                            "response": "I had the same thing happen to me.  This is such bs. Never had an issue before and now customer service is no where to be found",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7cejsf",
                    "author": "ReddvFive",
                    "score": 8,
                    "created_utc": 1651699179.0,
                    "response": "Same thing happened to me too yesterday with TD. I paid again with my checking account and it seems to have worked the 2nd time.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7clezu",
                            "author": "okspam",
                            "score": 3,
                            "created_utc": 1651701884.0,
                            "response": "Yes, but did that unlock your account for trades and withdrawals? Others of us likewise paid again, but still locked out.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7extef",
                                    "author": "Creepy-Importance-13",
                                    "score": 3,
                                    "created_utc": 1651751578.0,
                                    "response": "Get out while you can",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i7cgddj",
                            "author": "Realistic-Pea-9280",
                            "score": 3,
                            "created_utc": 1651699908.0,
                            "response": "You are lucky. I dodn’t have that option to try again. I asked them to help me but they said I have to wait.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7cyedm",
                    "author": "Balldeep247",
                    "score": 6,
                    "created_utc": 1651707561.0,
                    "response": "Coinbase is trash",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7cfdp2",
                    "author": "Roaring_Tiddy",
                    "score": 4,
                    "created_utc": 1651699509.0,
                    "response": "Similar thing happened to me so there must have been some system wide outage/bug/ issue.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7ff1zt",
                            "author": "Brilliant_Exam_1323",
                            "score": 3,
                            "created_utc": 1651760045.0,
                            "response": "Me too",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7dfypc",
                    "author": "DoanStorm",
                    "score": 4,
                    "created_utc": 1651715386.0,
                    "response": "Coinbase sucks people. Use Gemini or crypto or even Cashapp. Take it from someone who they took 127btc from.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7ctqh9",
                    "author": "Ok-Mine6428",
                    "score": 3,
                    "created_utc": 1651705435.0,
                    "response": "Coinbase client support is horrid. Good luck",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7bysgy",
                    "author": "2OneZebra",
                    "score": 4,
                    "created_utc": 1651693047.0,
                    "response": "This is getting to be a broken record.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uibniv",
            "title": "What's the Use of Trading View Charts if You Don't Give Us All the Tools?",
            "url": "https://www.reddit.com/r/CoinBase/comments/uibniv/whats_the_use_of_trading_view_charts_if_you_dont/",
            "author": "zionmatrixx",
            "created_utc": 1651684768.0,
            "score": 3,
            "num_comments": 33,
            "subreddit": "CoinBase",
            "selftext": "Using Advanced Trading. You built a nice system (FINALLY!) and charts are \"Powered by Trading View\".\n\nGreat job, except you basically removed every useful tool from TradingView, making the charting area worthless.  Are you trying to get people to NOT spend all day on your website. Brilliant marketing strategy.\n\nLook at Binance, Binance US, Kucoin and any other major exchange that uses charts powered by Trading View. They offer almost all Trading View tools. Why does Coinbase continue to lag behind in features compared to other exchanges?",
            "stickied": false,
            "comments": []
        },
        {
            "id": "ui6vbw",
            "title": "Locked out of card for over a month and all tickets closed?",
            "url": "https://www.reddit.com/r/CoinBase/comments/ui6vbw/locked_out_of_card_for_over_a_month_and_all/",
            "author": "scoopdiddlypoop",
            "created_utc": 1651671723.0,
            "score": 5,
            "num_comments": 38,
            "subreddit": "CoinBase",
            "selftext": "I was wondering if anyone has had a similar issue as me and knows how to fix. I was locked out of my card for a “suspicious activity”, that being a $5 purchase I made myself. When calling customer service, the card department line said they are unable to help because it is “an account issue”, and they forward me to the account department. I speak with them and they tell me it’s “a issue with your card” and forward back to other department. This continues in an infinite loop. Why is it so hard to just unlock my card for a purchase I made? Is there any other way to unlock my card? I would appreciate any help or tips on how to resolve the issue.",
            "stickied": false,
            "comments": [
                {
                    "id": "i7b1xb5",
                    "author": "Chello02",
                    "score": 3,
                    "created_utc": 1651680143.0,
                    "response": "I had the same issue.  I got it solved by posting hear and tagging the official coinbase support account.  My card was activated again within a day or so of posting.  They still couldn't tell me what the suspicious activity was \"per company policy\" which is dumb as fuck.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}