{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ujocdt",
            "title": "Goodbye Coinbase",
            "url": "https://www.reddit.com/r/CoinBase/comments/ujocdt/goodbye_coinbase/",
            "author": "Visual-Two-9747",
            "created_utc": 1651846244.0,
            "score": 41,
            "num_comments": 115,
            "subreddit": "CoinBase",
            "selftext": "I am at my wits end! I can't get customer service to respond (6+ months) and I have lost more money trying to use the app and wallet than I have investing in any of the services. Keep the money Coinbase; I have closed out and deleted everything attached to you.",
            "stickied": false,
            "comments": [
                {
                    "id": "i7ktngx",
                    "author": "MysticLimak",
                    "score": 64,
                    "created_utc": 1651857655.0,
                    "response": "5 years of using CB not one issue…",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7lj0c4",
                            "author": "RTV_Xapic",
                            "score": 25,
                            "created_utc": 1651869050.0,
                            "response": "Yeah same, and i always read these stories and think about if i should move to another site, but then i read some similar things on sites like kraken and i really dont know what to do. But maybe its just people getting hacked? Or scammed?",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i7mu2qi",
                            "author": "heiney_luvr",
                            "score": 4,
                            "created_utc": 1651891938.0,
                            "response": "Same until this past week. They sent me an email saying they apologized for an issue they had when I try to deposit money. On transaction history it shows the deposits are cancelled. They provide a link to fix it and all it does is go to my dashboard. Support has been utterly trash. Withdrew everything I could today. It's only about $400. Opened account on Binance.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i7mj1tf",
                            "author": "Etherzz24",
                            "score": 3,
                            "created_utc": 1651886326.0,
                            "response": "It's a great platform and company.. until it's not, for you.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i7mvler",
                            "author": "brucel59",
                            "score": 3,
                            "created_utc": 1651892750.0,
                            "response": "I didn’t have a problem with CB until I got hacked it’s been 60 days and they still won’t let me back into my original account to get my records",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i7mnt1z",
                            "author": "knokkkor",
                            "score": 3,
                            "created_utc": 1651888696.0,
                            "response": "I've been using Coinbase for 7-8 years and haven't had a single issue with them. Never had my account locked or well.. any issue.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7memmi",
                    "author": "Itsonlyfare",
                    "score": 7,
                    "created_utc": 1651884136.0,
                    "response": "My transaction of $700 was lost and they kept copying and pasting canned responses. I’m done with Coinbase too.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7m5w6w",
                    "author": "fUc_kyourhat",
                    "score": 4,
                    "created_utc": 1651879799.0,
                    "response": "Coinbase is garbage and you're better off without them. You are overcharged for the asset, plus an exorbitant fee, plus half the time it doesn't work and they hold your funds. Notice: if the price of ether is 2725 dollars, and you press buy ether, the price you pay will be AT LEAST  2795 dollars. This is ontop of the sometimes 10-15 dollar fee charges they do for every transaction.  They sell SOL, but 85 percent of the time you can't withdrawl your sol from their platform.  They refuse to integrate with layer 2s, so you can't withdrawl to matic or lrc or anything else except onto the ethereum blockchain, where it costs something crazy to move it again.  Their staking services are garbage and pay you less than a quarter of what the actual token staked value is: for instance- if you stake atom through noncustodial wallet with a real validator- you receive between 16-18 percent apy. When you stake atom through coinbase they give you five percent. I stopped using coinbase for the most part a little over 8 months ago and I am SO happy I did.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7k3cb6",
                    "author": "Visual-Two-9747",
                    "score": 19,
                    "created_utc": 1651847027.0,
                    "response": "Coinbase is literally messaging me now - after repeated emails, chats, messages, inquiries - to discuss my issue. My money has already been moved from their platform and they they can piss right off.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7lwyip",
                            "author": "blairbear555",
                            "score": 7,
                            "created_utc": 1651875526.0,
                            "response": "I thought you said they can keep the money…",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i7l5sw1",
                            "author": "zionmatrixx",
                            "score": 8,
                            "created_utc": 1651862955.0,
                            "response": "Good for you. If we could get more people to leave this shady company, the crypto world would be a better place.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7k4vwh",
                    "author": "Daikon_Dramatic",
                    "score": 11,
                    "created_utc": 1651847670.0,
                    "response": "Me too. Never again.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7mjwcv",
                    "author": "DiverCool4853",
                    "score": 3,
                    "created_utc": 1651886751.0,
                    "response": "Tbh with the terrible customer service I've had with banks I'm happy with coinbase app and coinbase pro I hate the coinbase wallet I got $200 stuck in there its costing me $450 to take it out 🙃 and there customer service was fire 🔥 for me responded real quick and took care of my issue over the phone real professionally just saying my experience",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7k25kv",
                    "author": "Bog-EA",
                    "score": 6,
                    "created_utc": 1651846526.0,
                    "response": "I'm trying to get my money out first, but then I'm right behind you.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7k2ga4",
                            "author": "Visual-Two-9747",
                            "score": 12,
                            "created_utc": 1651846653.0,
                            "response": "I just did. Converted everything to one coin and cashed right out. Happily paid another fee to instantly deposit back into my checking account. Good riddance.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7k7t8e",
                    "author": "joejitsu_crypto",
                    "score": 14,
                    "created_utc": 1651848870.0,
                    "response": "God I hate this nonstop stream of FUD posts. We get it, you either suck with technology enough to lose money somehow with a very user friendly interface or are paid to post in an attempt to keep people away from crypto as long as possible. I have no idea why the mods have allowed this sub to become this. It's ridiculous.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7kfcd2",
                            "author": "_stoned_chipmunk_",
                            "score": 4,
                            "created_utc": 1651851903.0,
                            "response": "CB is down for lots of people. I'm a CB Pro user and the issue is on their end, as they have admitted. Don't blame people for being upset about CB not working like it is supposed to. This isn't a user error issue at all.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7ku3mm",
                                    "author": "Nothingbutsocks",
                                    "score": 7,
                                    "created_utc": 1651857845.0,
                                    "response": "CB being down isnt the issue, exchanges go down yes. He means the never eneding posts of \"They won't answer\", \"They stole my money\", \"My money is stuck\". THOSE are user error most of the time.\n\nThey fall for phishing scams, they post the wrong address while transferring or they even send coins that aren't supported by CB then they expect CB to fix it.\n\nTons of user error posts blaming CB for it, its only fair to get annoyed.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i7kutsv",
                                            "author": "_stoned_chipmunk_",
                                            "score": 6,
                                            "created_utc": 1651858154.0,
                                            "response": "But you don't know if that is always the case. I talked to support who admitted they gave a connectivity issue (related to the rewards changes) and they said they would email me this morning. That was 7 hours ago. No response. They have bad customer service. I feel you, there are definitely tons of people complaining about stupid things but CB customer service is God awful and they are not responsive. I haven't been able to buy/sell for two days now.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i7liilh",
                                                    "author": "Ok-Cryptographer5481",
                                                    "score": 4,
                                                    "created_utc": 1651868819.0,
                                                    "response": "Same here.  I have not been unable to buy/sell also for 2 days.  They can't even pony up an explanation.  JHC, at least stick something on the site and tell us what the hell is going on.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i7lj5k8",
                                                            "author": "_stoned_chipmunk_",
                                                            "score": 4,
                                                            "created_utc": 1651869117.0,
                                                            "response": "It's the dishonesty that makes me even more angry. Like you said, own up to the situation and be honest with customers. Lying about it only exposes how shady they are.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i7o1quk",
                    "author": "Creepy-Importance-13",
                    "score": 3,
                    "created_utc": 1651924444.0,
                    "response": "Get. Out. While. You. Can!",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uk29tg",
            "title": "USER UNABLE TO BUY OR SELL SOLUTION!",
            "url": "https://www.reddit.com/r/CoinBase/comments/uk29tg/user_unable_to_buy_or_sell_solution/",
            "author": "Capital_Chair2745",
            "created_utc": 1651886362.0,
            "score": 4,
            "num_comments": 31,
            "subreddit": "CoinBase",
            "selftext": "For two days I have had problem buying or selling crypto during prime times. I've called support and they suggested using the web on the phone instead. After trying this method it didn't work. I've tried all their trouble shooting tips EXCEPT updating my phone to the latest version. After I've done this I've had no problems buying or selling.\n\nI'm not sure if it is just coincidence that it happened to work but with the rediculous fees and poor technical support I'll be looking to move on from this exchange in time due to not being reliable at key moments.\n\nPlease only use money your willing to lose on this exchange because of the unreliability.\n\nEDIT: I also tried verifying my identity at coinbase.com/verify-document",
            "stickied": false,
            "comments": [
                {
                    "id": "i7naz59",
                    "author": "wallc7777",
                    "score": 3,
                    "created_utc": 1651902269.0,
                    "response": "🤦‍♂️",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "ukd1jb",
            "title": "DAI yield",
            "url": "https://www.reddit.com/r/CoinBase/comments/ukd1jb/dai_yield/",
            "author": "Massive-Vacation-672",
            "created_utc": 1651929209.0,
            "score": 7,
            "num_comments": 24,
            "subreddit": "CoinBase",
            "selftext": "Hey! I just bought with 60€ DAI. And right after I put it to earn yield for me. But when i look at it it says that it’s only earning on 2.81€ of assets? why not the full 60€?",
            "stickied": false,
            "comments": [
                {
                    "id": "i7plyoh",
                    "author": "Kiwip0rn",
                    "score": 3,
                    "created_utc": 1651951352.0,
                    "response": "The money hasn't cleared yet. You had the collateral for 2.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "ujphvn",
            "title": "Connection Trouble",
            "url": "https://www.reddit.com/r/CoinBase/comments/ujphvn/connection_trouble/",
            "author": "Artistic-Wave-2455",
            "created_utc": 1651849479.0,
            "score": 10,
            "num_comments": 36,
            "subreddit": "CoinBase",
            "selftext": "I face some problem that I can't buy/sell crypto rn\n\nIt's show that Connection Trouble\n\nHow to fix it? I'm urgent now thanks",
            "stickied": false,
            "comments": []
        },
        {
            "id": "ujabid",
            "title": "5K of XLM deposited to Coinbase Pro One Week ago and it's still missing",
            "url": "https://www.reddit.com/r/CoinBase/comments/ujabid/5k_of_xlm_deposited_to_coinbase_pro_one_week_ago/",
            "author": "bitcoinman987",
            "created_utc": 1651793613.0,
            "score": 3,
            "num_comments": 45,
            "subreddit": "CoinBase",
            "selftext": "I deposited 5K of XLM into Coinbase one week ago and it's still missing. I've tried filing a case and reaching out to Coinbase Support on Twitter, but no one has helped me. Has anyone tried something that worked?\n\nThanks for your help! I need this money to buy food and pay rent",
            "stickied": false,
            "comments": [
                {
                    "id": "i7ho93o",
                    "author": "maryupallnight",
                    "score": 11,
                    "created_utc": 1651793737.0,
                    "response": "Did you send it with a memo?\n\nIf not you must contact support for them to find it and put in your account might take 60 days.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7huzzl",
                    "author": "SergMOrg",
                    "score": 4,
                    "created_utc": 1651797017.0,
                    "response": "You should not lose your coins. From where did you send your coins (wallet, exchange?). \n\nNormally, CB will ask you to send a specific amount from the same wallet  you missed  to put the memo field. Be sure this time you include the memo provided by Coinbase when you create the receive address.\n\nThey will verify the amount and return your tokens.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "ujit8m",
            "title": "Delete BRD App after migration to Coinbase App",
            "url": "https://www.reddit.com/r/CoinBase/comments/ujit8m/delete_brd_app_after_migration_to_coinbase_app/",
            "author": "MaximumBlast",
            "created_utc": 1651825805.0,
            "score": 3,
            "num_comments": 32,
            "subreddit": "CoinBase",
            "selftext": "Can i safely delete the BRD app after migration?",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uk87lz",
            "title": "Can’t Send to BTC Address From CB App?",
            "url": "https://www.reddit.com/r/CoinBase/comments/uk87lz/cant_send_to_btc_address_from_cb_app/",
            "author": "GoodN0se",
            "created_utc": 1651909046.0,
            "score": 2,
            "num_comments": 26,
            "subreddit": "CoinBase",
            "selftext": "I wanted to send my accumulated rewards to a cold wallet. I see that using the phone app, I can only send to contacts by emails, phone numbers and name. When I enter the actual wallet address it says ‘please enter a valid phone number.’ Am I missing anything?\n(I’ve been using CBP for trades & transfer, thought to try to transfer rewards directly from CB this time.)",
            "stickied": false,
            "comments": [
                {
                    "id": "i7s29me",
                    "author": "coinbasesupport",
                    "score": 1,
                    "created_utc": 1652001789.0,
                    "response": "Thanks for letting us know about this issue sending BTC. \n\nYou can find out more information about transferring cryptocurrency out of your Coinbase account [here](https://help.coinbase.com/en/coinbase/other-topics/other/how-to-transfer-your-cryptocurrency-out-of-your-coinbase-account). \n\nIf you are still having an issue after following these steps, please open a support case with our team via our [Contact us page](https://help.coinbase.com/en/contact-us), and we'll follow up. Many thanks.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7njf4i",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1651909046.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7pvthq",
                    "author": "Raj_UK",
                    "score": 1,
                    "created_utc": 1651955850.0,
                    "response": "My CB app says phone, email or address when I go to send BTC\n\nPost a screenshot of your options for sending ?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7pxgo7",
                            "author": "GoodN0se",
                            "score": 1,
                            "created_utc": 1651956563.0,
                            "response": "I see the same options as you, but then the app doesn’t accept the address, says invalid. I’ve been moving crypto around. This is a first.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7pys3k",
                                    "author": "Raj_UK",
                                    "score": 1,
                                    "created_utc": 1651957154.0,
                                    "response": "Double check the address",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i7xbt6a",
                    "author": "hhjhjhbh",
                    "score": 1,
                    "created_utc": 1652107733.0,
                    "response": "🔥 Upcoming DeFiMon AMA!\n\n✅ Event: DeFiMon voice AMA\n✅ Where: http://t.me/pinkecosystem\n✅ When: 9th May 20:00PM UTC\n✅ Prize: $300 split between 6 winners\n\n👉 TG: t.me/Defimon_Official_Group\n\n👉 Web: https://defimon.io",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "ujnt9w",
            "title": "mobile.coinbasexs.com This exchange is a scam",
            "url": "https://www.reddit.com/r/CoinBase/comments/ujnt9w/mobilecoinbasexscom_this_exchange_is_a_scam/",
            "author": "Kingsly-007",
            "created_utc": 1651844696.0,
            "score": 6,
            "num_comments": 37,
            "subreddit": "CoinBase",
            "selftext": "Stay away from this site, it's a scam; they will blackmail you into paying an exit tax with outside funding before you can move any assets of that exchange; they will ask for more and more and more and won't stop. Don't fall for their tricks; you know this site is not legit when the customer service speaks in terribly  broken English",
            "stickied": false,
            "comments": [
                {
                    "id": "i7kl11q",
                    "author": "coinbasesupport",
                    "score": 1,
                    "created_utc": 1651854156.0,
                    "response": "Thanks for letting us know about this, u/Kingsly-007.\n\nYou can report phishing sites to our security team [here](https://help.coinbase.com/en/coinbase/privacy-and-security/avoiding-phishing-and-scams/reporting-phishing-sites). For further information on receiving emails from Coinbase, please check out this helpful [article](https://help.coinbase.com/en/coinbase/privacy-and-security/other/is-this-email-really-from-coinbase).\n\nHope this helps. Let us know if we can do anything else to assist.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7k1cmi",
                    "author": "TheBronx172",
                    "score": 10,
                    "created_utc": 1651846177.0,
                    "response": "The name should of been a dead give away “Coinbasexs” I think we all need to take things a little slower and read things through.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7m83je",
                    "author": "Kiwip0rn",
                    "score": 2,
                    "created_utc": 1651880882.0,
                    "response": "No kidding 🙄🙄🙄🤦‍♂️",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7lxj1x",
                    "author": "Tall_Run_2814",
                    "score": 2,
                    "created_utc": 1651875793.0,
                    "response": "Its called [coinbasexs.com](https://coinbasexs.com) ...I don't need any other proof to know its a scam",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8kfadu",
                            "author": "neoman21",
                            "score": 1,
                            "created_utc": 1652529081.0,
                            "response": "I need help to get my money oiy. Up 50%,in 45 days\nSays freeze, on my transfer out",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8kuipz",
                                    "author": "coinbasesupport",
                                    "score": 1,
                                    "created_utc": 1652537820.0,
                                    "response": "Hi u/neoman21, thanks for letting us know about this.\n\nWe can investigate this further, please send our support team a message here: https://help.coinbase.com/en/contact-us they will follow up with you as soon as possible.\n\nIf you already have a case number, you can get back to us here with it, so we can check it out.\n\nThanks.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8kz50c",
                                            "author": "neoman21",
                                            "score": 1,
                                            "created_utc": 1652540056.0,
                                            "response": "It's not a coinbase site. Already talked with coinbase wallet. The website, www.mobile.coinbasexs.com,\nNeeds to be taken down by Anonymous, after they get peoples money back. I have only 7.2k locked up, but it's too much to just let it go",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8lcrlj",
                                                    "author": "Tall_Run_2814",
                                                    "score": 1,
                                                    "created_utc": 1652546260.0,
                                                    "response": "It's gone man!  For future reference...any company or site thats using a modified name of an already successful company is a scam.  \n\nFor instance if you're shopping for a Tesla and come across a company called Teslax...that's a scam.  \n\nIf you come across a coin in crypto and its called Bitcoinia or EtherShibDoge those are also scams.  \n\nExpensive learning lesson, but never trust any of these sites that claim \"if you give us your money\" will make you rich.  Just think about it...what guarantee is there that you'll get your money back?  What can you do, if they don't give you your money back?  The answer = nothing.  \n\nThis is no different than those sites that say \"send me 1 ETH and I'll send you 2\".  No one on this planet is trying to make you rich or give you money for no reason.  Why would they?\n\nTake this as an expensive learning lesson and never trust projects like this again.  Find a reputable exchange, a secure wallet, buy and hold, that is how ppl get rich thru investing over the long term.  \n\nI'm sorry but that money was gone as soon as you deposited it.  You need to delete whatever wallet you have connected to that site as it is compromised.  \n\nSorry you had to learn this expensive lesson but if it sounds too good to be true it is.  Best of luck",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8ljl6g",
                                                            "author": "neoman21",
                                                            "score": 1,
                                                            "created_utc": 1652549358.0,
                                                            "response": "This started differently than that\nI still should have done my research\nI started off with only 90 dollars\nWith a mentor 😂😂, I meet online\nShe recommended the site. Took 90 and 4k,to 7.3k\nBinary Options. She was trying to get me to inject 100k, thank God I didn't\nI started to get suspicious\nMoney shows still there, froze, it says.\nI have little hope, but I will not give up. Have a U.S. Senator informed about this.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8ps1dc",
                                                                    "author": "Tall_Run_2814",
                                                                    "score": 1,
                                                                    "created_utc": 1652634466.0,
                                                                    "response": "Don't ever invest with a \"mentor\" especially a woman you met online.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i8qs993",
                                                                            "author": "neoman21",
                                                                            "score": 1,
                                                                            "created_utc": 1652650369.0,
                                                                            "response": "I know, now. Thanks",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i7jxyly",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1651844696.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "ujzsje",
            "title": "2FA failing on my phone.",
            "url": "https://www.reddit.com/r/CoinBase/comments/ujzsje/2fa_failing_on_my_phone/",
            "author": "MarcusMan6",
            "created_utc": 1651878292.0,
            "score": 12,
            "num_comments": 55,
            "subreddit": "CoinBase",
            "selftext": "Got a new phone, same number yesterday.\n\nAttempting to log into the CB Pro App and every time I enter the code they text me it says the code is incorrect. I'm still logged in on my browser but unable to log-in via the app which is quite annoying.\n\nI'm assuming it's maybe related to the \"connectivity issue\" they say they're experiencing when you call support but who knows.\n\nAny one else in the same boat?\n\n&#x200B;\n\nEdit: Holy mother of low life scammers. It's been less than 15 minutes and I have FOUR DM requests from people claiming to be support lmao. Anywhere I can put them on a list for the sake of trying to keep the sub safe?\n\n&#x200B;\n\nEdit #2 / Update: I gave it a few days before trying again and it worked easily. Now I'm on the path of exploring different 2FA apps thanks to the dozen comments encouraging me to do so. ",
            "stickied": false,
            "comments": [
                {
                    "id": "i7nkfey",
                    "author": "coinbasesupport",
                    "score": 1,
                    "created_utc": 1651909919.0,
                    "response": "Hi u/MarcusMan6, thanks for your post.\n\nAs you're using a new device to log in, you may just need to follow the steps listed [here](https://help.coinbase.com/en/coinbase/getting-started/verify-my-account/device-confirmation-troubleshooting) to authorize it for your account. Beyond this, if you're still having issues using your account, please write to our main support team [here](https://help.coinbase.com/en/contact-us), so they can take a closer look.\n\nHope this helps!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7madxb",
                    "author": "Tall_Run_2814",
                    "score": 10,
                    "created_utc": 1651882010.0,
                    "response": "2fa with cell is easy to compromise.  Implore you to switch with 2FA with an authenticator app.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7mzm0a",
                    "author": "Turbulent-Ad-6845",
                    "score": 3,
                    "created_utc": 1651894977.0,
                    "response": "When do get back on regular coinbase switch to a Yubikey for your 2FA , No hacky hacks then",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7n5etg",
                    "author": "BiochemBeer",
                    "score": 3,
                    "created_utc": 1651898486.0,
                    "response": "Once you get this fixed, get an Authenticator app (Google or MS) or even better a Yubikey.\n\nLook at 30% of the posts here as it's people who used SMS for their 2FA and had their account compromised.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7nhe88",
                    "author": "ndreamer",
                    "score": 2,
                    "created_utc": 1651907305.0,
                    "response": "don't use txt authentication it will only end in tears",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7m3jun",
                    "author": "Kiwip0rn",
                    "score": 0,
                    "created_utc": 1651878656.0,
                    "response": "Fix the time on your phone to automatic.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7m48db",
                            "author": "MarcusMan6",
                            "score": 3,
                            "created_utc": 1651878990.0,
                            "response": "Just tried (it was already on) and same problem.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7m5iqz",
                                    "author": "Kiwip0rn",
                                    "score": -4,
                                    "created_utc": 1651879614.0,
                                    "response": "Oh you are using the \"Pro App\"... don't. Use your phone's browser to access Pro.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i7m61z4",
                                            "author": "MarcusMan6",
                                            "score": 3,
                                            "created_utc": 1651879879.0,
                                            "response": "May I ask why you're against it?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i7m6eld",
                                                    "author": "Kiwip0rn",
                                                    "score": -1,
                                                    "created_utc": 1651880050.0,
                                                    "response": "The CB App, I have never liked. The Phone's browser looks like Pro on a regular Computer and I know where everything is doing 95% trading off of a computer.\n\nPlus the Pro app has been buggy for about 6 months.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i7n16my",
                                                            "author": "KyFly1",
                                                            "score": 2,
                                                            "created_utc": 1651895890.0,
                                                            "response": "I agree. Browser is better.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i7m2ssp",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1651878292.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7m917k",
                    "author": "Toshi_Monster",
                    "score": 1,
                    "created_utc": 1651881347.0,
                    "response": "You can't just change your phone with 2fa, even if you keep the same number. U probably will have to recover your account.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7mwc7n",
                    "author": "ZombiGrn",
                    "score": 1,
                    "created_utc": 1651893156.0,
                    "response": "I had the same issue before. Waited about two days without trying and it eventually let me log in. It was very frustrating.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7vbub4",
                            "author": "MarcusMan6",
                            "score": 1,
                            "created_utc": 1652061185.0,
                            "response": "Hey mate appreciate your heads up. I've tried it again and we're all good!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7o7777",
                    "author": "Lucky-Ad1008",
                    "score": 1,
                    "created_utc": 1651927806.0,
                    "response": "Don’t use your phone for 2FA use google authenticator or Authy app. I used text for 2FA and someone sim swapped my phone and I lost access to my number for an hour and they stole from my coinbase app and transferred most of my money to coinbase pro and then to some wallet. r/CoinBase has not responded to me about the hack or my stolen funds so don’t be me…",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7pwzq5",
                    "author": "NotOmakase",
                    "score": 1,
                    "created_utc": 1651956358.0,
                    "response": "Yubikey ftw",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7oxh2q",
                    "author": "Balldeep247",
                    "score": -2,
                    "created_utc": 1651940439.0,
                    "response": "Wow people still use coinbase 💀",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7p73e8",
                            "author": "MarcusMan6",
                            "score": 5,
                            "created_utc": 1651944677.0,
                            "response": "Homeboy is literally on the coinbase subreddit lmao when did trolls get so low effort",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i7q888w",
                            "author": "MudMysterious1033",
                            "score": 0,
                            "created_utc": 1651961570.0,
                            "response": "Yo mama is still used, so…",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7q8kpr",
                                    "author": "Balldeep247",
                                    "score": 1,
                                    "created_utc": 1651961732.0,
                                    "response": "? Must be a retarded. Lmfao mama jokes its okay retard that your mama still used. They gotta replace you somehow🤡🤡",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i7q9wxi",
                                            "author": "MudMysterious1033",
                                            "score": 0,
                                            "created_utc": 1651962359.0,
                                            "response": "Got you triggered with minimal effort. 😂😂😂",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i7q9z0h",
                                    "author": "Balldeep247",
                                    "score": 1,
                                    "created_utc": 1651962387.0,
                                    "response": "Lol must be american 💀",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i7qa8ro",
                                            "author": "MudMysterious1033",
                                            "score": 1,
                                            "created_utc": 1651962517.0,
                                            "response": "Try again while I get you some butthurt salve.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i7qac6t",
                                                    "author": "Balldeep247",
                                                    "score": 1,
                                                    "created_utc": 1651962563.0,
                                                    "response": "Naw over talking to a retard 🤡",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i7qaoal",
                                                            "author": "MudMysterious1033",
                                                            "score": 1,
                                                            "created_utc": 1651962726.0,
                                                            "response": "Then stop looking at the basement mirror. 🖖🏻",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i7qaw4g",
                                                                    "author": "Balldeep247",
                                                                    "score": 1,
                                                                    "created_utc": 1651962832.0,
                                                                    "response": "U gotta get out of the basement retard, time to move on out. Oh wait u cant cuz u use coinbase😂😂",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i7qb26u",
                                                                            "author": "MudMysterious1033",
                                                                            "score": 1,
                                                                            "created_utc": 1651962912.0,
                                                                            "response": "Projection issues much? 😂😂💀🪦",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i7qb5zo",
                                                                                    "author": "Balldeep247",
                                                                                    "score": 1,
                                                                                    "created_utc": 1651962963.0,
                                                                                    "response": "Well u clearly are talking abt yourself so dont worry retard the secret safe on reddit",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "id": "ujmq1t",
            "title": "Large amount of money transferred into coin base that I did not authorize.",
            "url": "https://www.reddit.com/r/CoinBase/comments/ujmq1t/large_amount_of_money_transferred_into_coin_base/",
            "author": "KirkCuhsins",
            "created_utc": 1651841372.0,
            "score": 13,
            "num_comments": 64,
            "subreddit": "CoinBase",
            "selftext": "I have not used my coin base account in months. On Wednesday I got a text saying that there will be a transfer of (a large) amount of money into coin base.  The next text wanted me to confirm, which I said I did not authorize it.  They texted that the transaction would be cancelled and that my account was secure.  A couple days later, the money has still left my bank account (says pending) and I cannot find it in my coin base.  \n\n&#x200B;\n\nDid I just get hacked and that money is gone forever?  Or does it really take this long to process something/cancel it and the money should be back in my account soon?",
            "stickied": false,
            "comments": [
                {
                    "id": "i7ki9os",
                    "author": "coinbasesupport",
                    "score": 1,
                    "created_utc": 1651853055.0,
                    "response": "Thanks for reaching out about this experience, u/KirkCuhsins.\n\nPlease share your support case number with us, and we will look into this for you. \n\nIf don't have a support ticket yet, you can open one with our team [here](https://help.coinbase.com/en/contact-us). Thank you.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7jrvo7",
                    "author": "Commercial-Jacket-33",
                    "score": 4,
                    "created_utc": 1651841841.0,
                    "response": "Yes and Yes.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7jstvi",
                    "author": "jsinclair12",
                    "score": 11,
                    "created_utc": 1651842307.0,
                    "response": "Probably hacked, unfortunately",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7jtqku",
                    "author": "2OneZebra",
                    "score": 11,
                    "created_utc": 1651842748.0,
                    "response": "I would say yes. Yes you have been hacked. Consider all your accounts hacked and change all passwords. \n\nEnable 2fa on everything. \n\nNotify the bank immediately. \nCancel all your cards and get new ones.\n\nPull a credit report on yourself. Check for fraudulent  transactions in the report and with your bank and any other accounts.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7l7o7f",
                            "author": "booi",
                            "score": 1,
                            "created_utc": 1651863802.0,
                            "response": "Banks and 2fa is hilariously bad. At best it’s still SMS based which is insecure at best. Use a password manager and everything u/2OneZebra said.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7lcvni",
                                    "author": "cmdrshepherd1993",
                                    "score": 2,
                                    "created_utc": 1651866198.0,
                                    "response": "You can change it from SMS to Authenticator app or YubiKey in the security settings in the app. You might be slow if you never knew this.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i7js3iw",
                    "author": "iLiKeEgGzZzZ",
                    "score": 20,
                    "created_utc": 1651841951.0,
                    "response": "Call your bank. Coinbase won't do shit for you.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7k8c1c",
                    "author": "sayknee",
                    "score": 3,
                    "created_utc": 1651849080.0,
                    "response": "Coinbase has never texted me when I do an ACH bank deposit. Did you enter any personal info when you dealt with the second text?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7k8cx6",
                    "author": "BabydollPenny",
                    "score": 7,
                    "created_utc": 1651849090.0,
                    "response": "CB doesn't TEXT you..you got scammed. Ouch. Sorry. Damn people suck.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7k9x36",
                            "author": "KirkCuhsins",
                            "score": 3,
                            "created_utc": 1651849723.0,
                            "response": "It was the automatic coin base fraud prevention system.  Basically two factor authentication.  Are you saying coin base doesn't even do THAT?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7kada7",
                                    "author": "BabydollPenny",
                                    "score": 3,
                                    "created_utc": 1651849909.0,
                                    "response": "Oh damn ,idk about that ..but I guess it does use text for the 2fa. Sorry. I wasn't aware it was a 2fa text(sorry I'm a bit tarded this morning..and didn't put text =2fa.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i7lfpa3",
                                    "author": "XxNukeMutantxX",
                                    "score": 4,
                                    "created_utc": 1651867510.0,
                                    "response": "Coinbase wouldn’t send you a text with links in them.  Only thing they text is confirmation codes .  I get emails and texts from all my online accounts not just coinbase.  Gitgud",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i7k0uzq",
                    "author": "DaWrightOne901",
                    "score": 2,
                    "created_utc": 1651845967.0,
                    "response": "The email might be from scammers",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7kimm3",
                    "author": "Kosun1581",
                    "score": 2,
                    "created_utc": 1651853201.0,
                    "response": "I got told this morning that there is a glitch from their system upgrades that they’re doing.  I saw a large transfer too, but was told it wasn’t showing on their records and won’t be pulled from my bank.  Get ahold of your bank and stop that transaction",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7jsthr",
                    "author": "ChrisR109",
                    "score": 1,
                    "created_utc": 1651842302.0,
                    "response": "CB sends texts?  I haven't used them in a while so I do not remember.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7k88uo",
                            "author": "BabydollPenny",
                            "score": 1,
                            "created_utc": 1651849044.0,
                            "response": "Not that I'm aware of...🤔",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7m0gml",
                    "author": "Character-Outcome-10",
                    "score": 1,
                    "created_utc": 1651877178.0,
                    "response": "Don’t trust them inside jobs",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7s74pj",
                            "author": "Character-Outcome-10",
                            "score": 1,
                            "created_utc": 1652006124.0,
                            "response": "Stolen",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7jqxqu",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1651841372.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7kdkwa",
                    "author": "420JustBlazeBro",
                    "score": 1,
                    "created_utc": 1651851200.0,
                    "response": "When you got this text did it have a link in it to sign in to your Coinbase account?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7kg42c",
                            "author": "KirkCuhsins",
                            "score": 1,
                            "created_utc": 1651852201.0,
                            "response": "No, it was an automatic message from the coin base fraud prevention system.  I just had to reply “Y” or “N” for if I authorized the transaction.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7ketc2",
                    "author": "Ashesza",
                    "score": 1,
                    "created_utc": 1651851697.0,
                    "response": "I get scam Coinbase emails all the time.  Check the sender's address before clicking any links.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7kognf",
                    "author": "BiochemBeer",
                    "score": 1,
                    "created_utc": 1651855514.0,
                    "response": "Did you get Hacked? Maybe.\n\n1. Inform your bank there has been a fraudulent charge.\n2. Assume your e-mail is compromised - change the password. Check for any rules that might be forwarding or deleting e-mails.\n3. Can you still log into your Coinbase Account?  If so, change the password.\n4. If you cannot get into your account, it has been compromised.  Call the Coinbase number to lock your account.\n5. If you still have access to your account set up a real 2FA - cell phone SMS is not secure. At a minimum use Google or MS Authenticator, even better use hardware like YubiKey\n6. You can also setup address whitelisting in coinbase pro, which can slow down scammers/hackers.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7lcrx4",
                    "author": "cmdrshepherd1993",
                    "score": 1,
                    "created_utc": 1651866149.0,
                    "response": "Talk to your bank to dispute the transaction.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7lfg1z",
                    "author": "XxNukeMutantxX",
                    "score": 1,
                    "created_utc": 1651867390.0,
                    "response": "Sounds like hacked.  That’s how the scams work",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7llsm4",
                    "author": "TheRealAstic",
                    "score": 1,
                    "created_utc": 1651870344.0,
                    "response": "That email wasn’t from Coinbase lol.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7v8uab",
                            "author": "KirkCuhsins",
                            "score": 1,
                            "created_utc": 1652059708.0,
                            "response": "Wasn’t en email. Was a text message from coinbase fraud prevention system.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7lu28c",
                    "author": "Money-Driver-7534",
                    "score": 1,
                    "created_utc": 1651874173.0,
                    "response": "Move all cryp to cold store - and then it seems it would be a great safety measure on these exchanges where you could disable the account of you yourself aren’t using the app. It would remain unhackable if you aren’t using it (and hopefully when you’re using it)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7m8op2",
                    "author": "Kiwip0rn",
                    "score": 0,
                    "created_utc": 1651881174.0,
                    "response": "You allowed the scammers in, when you clicked on whatever to reply \"did not authorize\".\n\nNEVER click on anything, in an email or SMS message! If Coinbase wants something it will be within the Coinbase Custody app itself.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7v8pwo",
                            "author": "KirkCuhsins",
                            "score": 1,
                            "created_utc": 1652059648.0,
                            "response": "I didn’t “click” on anything. I responded “N” to the Coinbase Fraud Prevention system message. If that’s what sets the hackers in motion then that’s crazy.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7vi4eb",
                                    "author": "Kiwip0rn",
                                    "score": 1,
                                    "created_utc": 1652064344.0,
                                    "response": "It is, there is no \"Coinbase Fraud Prevention\" group messaging you; it was fake, a phishing message or email made to look authentic. Clicking \"N\" told them they indeed have someone with a Coinbase account to do whatever they do to steal the coins/money.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i7wqz1b",
                                            "author": "KirkCuhsins",
                                            "score": 1,
                                            "created_utc": 1652097640.0,
                                            "response": "Again, I didn't \"click\" on anything.  just typed N into text.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i7xstbl",
                                                    "author": "Kiwip0rn",
                                                    "score": 1,
                                                    "created_utc": 1652114569.0,
                                                    "response": "Clicking \"N\" or typing \"N\" is irrelevant. You announced to them \"Yes I have a Coinbase account with Crypto probability unsecured because I replied to a random message about them\".",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "id": "ujtz79",
            "title": "Accidentially sent money from wrong bank account (SEPA)",
            "url": "https://www.reddit.com/r/CoinBase/comments/ujtz79/accidentially_sent_money_from_wrong_bank_account/",
            "author": "kalleslayer",
            "created_utc": 1651861852.0,
            "score": 3,
            "num_comments": 29,
            "subreddit": "CoinBase",
            "selftext": "Will I get my funds or do I have to contact support?",
            "stickied": false,
            "comments": [
                {
                    "id": "i7l3caz",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1651861852.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7lzqsn",
                    "author": "coinbasesupport",
                    "score": 1,
                    "created_utc": 1651876837.0,
                    "response": "Hey Kalleslayer, Do you have a case# for us to investigate further?  If not, can you please make a case here, so we can look into your issue further:  \n[https://help.coinbase.com/en/contact-us](https://help.coinbase.com/en/contact-us)\n\n  \nPlease and Thank you!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i82o7bt",
                            "author": "kalleslayer",
                            "score": 1,
                            "created_utc": 1652202830.0,
                            "response": "case number #11764755",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i7nhxyk",
                            "author": "Environmental-Teach2",
                            "score": 0,
                            "created_utc": 1651907780.0,
                            "response": "Your customer service is garbage. I've been trying for months to verify my account to regain access to the money I have In my account and I keep getting shutdown. \nThis is how you do business? Robbing people?!",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7nkoge",
                                    "author": "coinbasesupport",
                                    "score": 2,
                                    "created_utc": 1651910139.0,
                                    "response": "Hi u/Environmental-Teach2, thanks for your comment.\n\nWe're sorry to hear you're dissatisfied with your support experience to-date. \n\nPlease know that our verification processes, particularly if it is a KYC (Know Your Customer) review, can take varying periods of time. As review times can vary, we cannot confirm an estimate for this. So long as you provide the requested info and/or documents (e.g. updating expired IDs), our team will review and get back to you as soon as they can.\n\nWe hope this helps to clarify!",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i7nkzmb",
                                            "author": "Environmental-Teach2",
                                            "score": 0,
                                            "created_utc": 1651910414.0,
                                            "response": "I provided everything that was asked. I was told my case would be escalated to a team to help me resolve it and the next communication I got was that my case was closed, With  no answers, no resolution and my money still not available to me.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "id": "ujr8xe",
            "title": "Manual review...how long?",
            "url": "https://www.reddit.com/r/CoinBase/comments/ujr8xe/manual_reviewhow_long/",
            "author": "icecool82",
            "created_utc": 1651854323.0,
            "score": 3,
            "num_comments": 27,
            "subreddit": "CoinBase",
            "selftext": "Hello guys\n\nCase number 07853241\n\nI have my account on \"manual review\" from a long time.\n\nI have provided all the papers you were asking for and uploaded on sendsafely but still no one picking it up.\n\nIf you could be so kind to use it again i really will appreciate it.\n\nThanks",
            "stickied": false,
            "comments": [
                {
                    "id": "i7m3hqy",
                    "author": "coinbasesupport",
                    "score": 1,
                    "created_utc": 1651878628.0,
                    "response": "Hey IceCool82, We are reviewing case 07853241 and we will get you an update after our initial investigation!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7nhwjp",
                    "author": "Environmental-Teach2",
                    "score": 1,
                    "created_utc": 1651907746.0,
                    "response": "Your customer service is garbage. I've been trying for months to verify my account to regain access to the money I have In my account and I keep getting shutdown. \nThis is how you do business? Robbing people?!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7klgc3",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1651854323.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7klk14",
                            "author": "icecool82",
                            "score": 0,
                            "created_utc": 1651854364.0,
                            "response": "07853241",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7sfrbe",
                    "author": "KoiiToHaiu",
                    "score": 1,
                    "created_utc": 1652012579.0,
                    "response": "🐺The Wolf Pack🐺\n\nDaily APR BUSD Miner with mechanics made for sustainability,\n\n🐺 8% Daily ~ 2920% APR ✅\n🐺5% Development ✅\n🐺 8% Referral Bonus ✅\nwolfpackminer.com 🔥",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "ujp61k",
            "title": "Coinbase question? (Please, read below. Thank you!).",
            "url": "https://www.reddit.com/r/CoinBase/comments/ujp61k/coinbase_question_please_read_below_thank_you/",
            "author": "susygomezd",
            "created_utc": 1651848583.0,
            "score": 4,
            "num_comments": 29,
            "subreddit": "CoinBase",
            "selftext": "Hello guys! Hope you are all doing very well!\n\nIf you allow me to ask, please:\n\n1. If I wish to change from Coinbase to antother company, which exchange would be better?\n\n2. How may you transfer funds from Coinbase to such NEW & Different Exchange?\n\n\n3. Would you advise such transition?\n\n\n(To give you a very brief summary of context… I have about 7 Crypto Coins on my humble Coinbase Portfolio which is COMPLETELY BLOCKED from either Buying or Selling as both my Nationality and Geographical Location are from a Country in South America. \n\nNo matter if you use a VPN or whatever… I’m basically stuck since last year due my “legal paperwork” as most South American countries are literally blocked from buying/selling… all I’m allowed to do is send, receive, and hold my Crypto. \n\nNow, I’m completely aware that other Platforms will most likely block me from buying/selling just as Coinbase. \n\nNevertheless, I want the peace of mind that my assets are in the safest, most secure, and fair platform + a company that may have a better, more positive Customer Service).\n\nRespectfully to everyone. Thank you all!",
            "stickied": false,
            "comments": [
                {
                    "id": "i7kfihi",
                    "author": "Gigatheshow",
                    "score": 0,
                    "created_utc": 1651851969.0,
                    "response": "thank me later🙏❤️ https://www.youtube.com/watch?v=G7sZTRsuOXw",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7k73td",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1651848583.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7m7l7n",
                    "author": "Kiwip0rn",
                    "score": 1,
                    "created_utc": 1651880633.0,
                    "response": "1) There is no \"better exchange\" only Coinbase wannabes.\n\n2) Transfer everything as ALGO or XLM to avoid fees.\n\n3) NEVER!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i96d75x",
                    "author": "Eyytffss",
                    "score": 1,
                    "created_utc": 1652945444.0,
                    "response": "🔥 DINOSTEP.APP 🔥\n\n🦖 The First Move To Earn App With Virtual Dinosaurs\n👟 Earn while building healthy habits with the Dino\n✨ Varied NFTs\n💵 Passive Income Features\n💎 App Activation Code & NFT Drop For Fair Launch Contributors\n\n🚀 Fair Launch Starts On May 9th",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}