{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "utn2mr",
            "title": "Beginners Question…",
            "url": "https://www.reddit.com/r/CoinBase/comments/utn2mr/beginners_question/",
            "author": "SoggyApricot100",
            "created_utc": 1653028079.0,
            "score": 2,
            "num_comments": 6,
            "subreddit": "CoinBase",
            "selftext": "Hello and apologies in advance as this may be a rather dumb question…\n\nI have JUST downloaded the Coinbase IOS app and made my first very small crypto investment. Needless to say, I am pretty new and ignorant to this so there are many things I’m still figuring out; including the general workings of the app and the interface. \n\nI have invested some of my local currency (GBP) into Eutherium which I can see listed on my assets screen, but underneath them I can also see Euros listed as €0. \n\nAs my currency is set to GBP and I haven’t got any existing assets in Euro, I’m wondering why this is on my list at all? Is there anything I can do to take it off so that I’m not looking at an empty listing?\n\nThanks!",
            "stickied": false,
            "comments": [
                {
                    "id": "i9aqmo5",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653028080.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}