{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ut7qjm",
            "title": "Confused by CS re: unauthorized account",
            "url": "https://www.reddit.com/r/CoinBase/comments/ut7qjm/confused_by_cs_re_unauthorized_account/",
            "author": "quibbleisms",
            "created_utc": 1652979120.0,
            "score": 2,
            "num_comments": 44,
            "subreddit": "CoinBase",
            "selftext": "Hello!\n\nI learned about CoinBase when someone tried to create an account with my throwaway email. I got the verification email, but it wasn't open, which made me think they may have failed to create an account at all. Still, I emailed CoinBase using their contact form on the website regarding this issue. I asked them if anyone had successfully created the account and if so what kind information had been input so I could know if I needed to look into any of my bank accounts, for example. I also asked them to close the account if it had been made. I attempted to call them as well, but because I didn't know if they had made an account with my email and what phone number would be connected to it, I couldn't speak to a human. The machine just hung up on me.\n\nI got an email back a week ago that I just saw. It was mislabeled (it said Hello Jhon despite that definitely not being my name, not even close) and said that IF an account exists with my name it will be closed. It gave me a list of things to contact (bank, law enforcement) and said, \"We will not be able to provide any additional information through our support emails.\" A few days later they closed the case.\n\nI feel like I don't have any answers and I don't know what to do or who to speak to. They've pretty much said they won't tell me anything over email and I don't know how to get someone on the phone. I don't even know if someone managed to open an account with my email or not. I can't imagine contacting law enforcement saying, \"Well, someone may or may not have stolen my email, but I don't know how to tell if they were successful.\" The email address itself doesn't seem to be compromised.\n\nDoes anyone here have any suggestions on how to speak to CoinBase and determine if someone had created an unauthorized account with my email? I want to do my due diligence but I need more information to do so.",
            "stickied": false,
            "comments": [
                {
                    "id": "i98145g",
                    "author": "unvieledloki",
                    "score": 3,
                    "created_utc": 1652979459.0,
                    "response": "why not try to log in and use forget password to have reset link sent to your email?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i98291i",
                            "author": "quibbleisms",
                            "score": 1,
                            "created_utc": 1652979914.0,
                            "response": "You're brilliant.\n\nSo I did this, and did get an account password reset email. It was to this Jhon person they had mentioned in the email, with a false surname, I imagine.\n\nI changed the password, tried to log in, and got:\n\n\"For your security, your account is disabled. You may have requested this, or we might have done it automatically. Please submit a support ticket at https://help.coinbase.com/en/contact-us\"\n\nThis highly suggests that they did create the account, but doesn't tell me what information they had connected to it, such as bank information. The name is, again, nothing close to my real name. I did request they close the unauthorized account, so I know that was me.\n\nWhat's the next step? For all I know they tried to create the account but couldn't verify it and so didn't connect it to anything. The name used as the account name doesn't match my legal name.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i98e2sk",
                    "author": "MrMike0029",
                    "score": 2,
                    "created_utc": 1652984698.0,
                    "response": "Scammers buy lists of emails, then use a bot to see which ones already have CB accounts to make them targets of various attacks like SIM swap. You didn't have an account with that email, so it created an account. If you did have an account it would've said an account already exists with the email and would've made you a target to hack.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i991hvs",
                            "author": "quibbleisms",
                            "score": 1,
                            "created_utc": 1652995146.0,
                            "response": "If this is what happened to me, then would they have just made an empty account and left it alone? I'm not sure if empty is the way to phrase it, but I mean an account with no connections to any banks or credit cards.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9809rt",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1652979120.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i98230x",
                    "author": "coinbasesupport",
                    "score": 1,
                    "created_utc": 1652979848.0,
                    "response": "Hi quibbleisms, we're sorry to hear of the difficulty you've had with our support. We understand the confusion around closing the account and using the wrong name to address you. If you could provide the case number you received when you first created the support ticket we will investigate further. Thank you for your patience, we're hoping to get this resolved as soon as possible.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i982hl2",
                            "author": "quibbleisms",
                            "score": 1,
                            "created_utc": 1652980009.0,
                            "response": "Hello, the case number is # 11781456",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i985oq9",
                                    "author": "coinbasesupport",
                                    "score": 1,
                                    "created_utc": 1652981292.0,
                                    "response": "Thanks for providing your case number. We have just reopened and internally escalated your case for further review. While we cannot share information pertaining to specifics of your account on social media, hopefully the email support team will be able to more directly address your concerns. If you would like, you can reply to our most recent email sent to you with any other specific questions you may have at this time. Thank you",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i98f79t",
                    "author": "almyles3000",
                    "score": 1,
                    "created_utc": 1652985160.0,
                    "response": "This sounds extremely suspicious, in particularity that you state \"The email address itself doesn't seem to be compromised.\"",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i993m17",
                    "author": "MrMike0029",
                    "score": 1,
                    "created_utc": 1652996110.0,
                    "response": "Yup, that would be my guess. Now there is just a ghost account tied to that email.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}