{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uukxg7",
            "title": "How do I transfer Doge from my CoinBase Wallet to my external wallet?",
            "url": "https://www.reddit.com/r/CoinBase/comments/uukxg7/how_do_i_transfer_doge_from_my_coinbase_wallet_to/",
            "author": "VloooolV",
            "created_utc": 1653131445.0,
            "score": 14,
            "num_comments": 93,
            "subreddit": "CoinBase",
            "selftext": "I’m having trouble transferring my doge out of CoinBase Wallet. It says I don’t have enough for network fees. \n\nI have about 20$ of eth. Is the gas fee much higher?",
            "stickied": false,
            "comments": [
                {
                    "id": "i9gfy5d",
                    "author": "peachypreserves",
                    "score": 4,
                    "created_utc": 1653145343.0,
                    "response": "At this exact moment the gas fee is 15 Gwei.  The gas fees fluctuate all the time.  In general, gas fees go down at night, go way down on weekends, etc.  Certain days of the week (midweek) have sky high fees.   So check to see the current gas fee before moving coin.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9h4nrs",
                            "author": "NastyDwarf74",
                            "score": -1,
                            "created_utc": 1653156680.0,
                            "response": "The fact that this is a \"thing\" is another reason why people stay away.  Time of the day, when the stars align, etc shouldnt matter this ETH changing coming up better help with the fees or i dont see a bright future for them.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9l1ghx",
                                    "author": "kiefferbp",
                                    "score": 1,
                                    "created_utc": 1653239552.0,
                                    "response": "People don't go there anymore. It's too crowded!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9fsium",
                    "author": "NastyDwarf74",
                    "score": 11,
                    "created_utc": 1653132097.0,
                    "response": "Welcome to the land of fees.  If u have a lot of crypto and want to move it to ur hard wallet be prepared to have to buy eth.  If u want to move it back go buy more eth , u will prob spend more on the gas fees then what crypto is actually worth.  It's a brilliant money making scheme",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9hsqa6",
                            "author": "Run-and-Escape",
                            "score": 6,
                            "created_utc": 1653168548.0,
                            "response": "What does Doge have to do with Eth fee prices?? Doge is its own chain. He should be using the Doge blockchain to make transfers. He's selecting the wrong transfer chain. Maybe pay 0.1 doge in fees. Max 1 doge.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9fswr6",
                            "author": "VloooolV",
                            "score": -1,
                            "created_utc": 1653132389.0,
                            "response": "I accidentally sent it to the coinbase wallet instead of my personal wallet 🤦🏾‍♂️\n\nIs there a way to send it back to coinbase? Or would that cost gas fees as well?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9ftcq1",
                                    "author": "NastyDwarf74",
                                    "score": 9,
                                    "created_utc": 1653132732.0,
                                    "response": "Just more fees unfortunately.  Welcome to the shady crypto space lol.  They bleed u dry with fees on top of fees",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9ftksb",
                                            "author": "VloooolV",
                                            "score": 2,
                                            "created_utc": 1653132897.0,
                                            "response": "Damn.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9ftw6j",
                                                    "author": "NastyDwarf74",
                                                    "score": 3,
                                                    "created_utc": 1653133134.0,
                                                    "response": "I was testing this out just to see how bad the fees were.  I moved some amp to my ledger and it cost me a few bucks.  I wanted to move it back and I have no ETH on my ledger so I can't move it back.  I now have to buy We ETH from my ledger to spend 20 to move it back.  It's a money racket lol by the time I'm done testing I will have spent more on the fees then what that amount of amp is worth lok",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9fujd2",
                                            "author": "Block0922",
                                            "score": 0,
                                            "created_utc": 1653133597.0,
                                            "response": "ERC20 tokens will die off, same with ETH if they can't fix their fees. Never had an issue with BTC and fees. Plus with the RBF ability in BTC if it's to slow you can throw a bit more at it and push it along.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9g5rnj",
                                                    "author": "Tall_Run_2814",
                                                    "score": 6,
                                                    "created_utc": 1653140419.0,
                                                    "response": "All of the tokens sold on Coinbase were built on the Ethereum network and all of the coins run on the Ethereum Virtual Machine.  \n\nEthereum invented smart contracts and is worth more than its closest 10 competitors combined.  Ethereum is for institutions and those that got in early.  It’s not going anywhere anytime soon",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9ggrat",
                                                            "author": "Block0922",
                                                            "score": 8,
                                                            "created_utc": 1653145715.0,
                                                            "response": "Yes I understand that the listed tokens on Coinbase are all erc20. Coinbase on the other hand doesn't control the gas fees on the Eth network. Not a Coinbase problem, more of an ETH problem.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9gov7h",
                                                                    "author": "Tall_Run_2814",
                                                                    "score": 4,
                                                                    "created_utc": 1653149447.0,
                                                                    "response": "Ethereum doesn't control the gas fees either.  The users do.  If I'm sending 10k in Eth on the network and the gas fee says $100.  I up mine to $105, $110 to front-run everyone else to ensure my transaction.  This is standard operation for those that have been in crypto for a while.  It's an open and competitive market place with high demand hence higher fees.  The price is driven by the market just like everything else.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9gqjvh",
                                                                            "author": "Block0922",
                                                                            "score": 1,
                                                                            "created_utc": 1653150222.0,
                                                                            "response": "It's being ETH problem meaning scaling and tx ps. I do the same type of thing as you do for any tx I'm trying to do. Pad the tx fee a bit.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "i9h50bq",
                                                            "author": "Ice_pandas",
                                                            "score": 0,
                                                            "created_utc": 1653156843.0,
                                                            "response": "Says the eth bag holder. Eth will die",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9i8ipc",
                                                                    "author": "Tall_Run_2814",
                                                                    "score": -1,
                                                                    "created_utc": 1653176854.0,
                                                                    "response": "\"Truth is not what you want it to be, it is what it is, and you must bend to its power or live a lie.\" - Miyamoto Musashi\n\nHere is the truth if you can handle it: [https://defillama.com/chains](https://defillama.com/chains)",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i9ilsts",
                                                    "author": "SmokeMyDong",
                                                    "score": 1,
                                                    "created_utc": 1653184067.0,
                                                    "response": ">ERC20 tokens will die off, same with ETH if they can't fix their fees\n\nIsn't that literally the goal of ETH 2.0 and the PoS model?",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9fz584",
                                            "author": "Money-Driver-7534",
                                            "score": -1,
                                            "created_utc": 1653136661.0,
                                            "response": "Right. That’s the worst aspect of trading in crypto. The fees on exchange to purchase is one thing, but to charge all these fees to move around your coins is borderline scammish. If there’s no solution & reasonable fee rate to move and transact crypto, it’s going to be stuck in a rut permanently.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9fzwqk",
                                                    "author": "NastyDwarf74",
                                                    "score": 1,
                                                    "created_utc": 1653137124.0,
                                                    "response": "Totally agree and that's why so many people are afraid to enter this space because of the scammish feel behind it.  There are nothing but warnings on making sure u don't leave ur crypto on exchanges, fear of losing ur password, key phrases, hard wallet, or news of exchanges going belly up etc etc and then u tack on the endless fees and it's definitely not a friendly atmosphere to encourage new traders/buyers.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9ggjam",
                                                            "author": "Block0922",
                                                            "score": 1,
                                                            "created_utc": 1653145612.0,
                                                            "response": "Y'all realize that Coinbase doesn't set the gas fees right?? That's my point, ETH needs to get their own fees under control. Moving any ERC token is a pain solely because of the network fees.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9imsi8",
                                                                    "author": "whatnowdog",
                                                                    "score": 1,
                                                                    "created_utc": 1653184604.0,
                                                                    "response": "Also the fees are not set and go up and down depending on the demand at the time. I may be wrong but normally ETH fees are less at night on the weekends.  Fell free to correct what I said.  I am one of those people that have not really traded crypto because of how complicated it can feel to trade or stake your crypto. And when you add gas fees and taxes it seems everybody makes money except the owner of the coins unless you have a lot of coins.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9fsnvi",
                    "author": "coinbasesupport",
                    "score": 3,
                    "created_utc": 1653132204.0,
                    "response": "Hi u/VloooolV.\n\nGas fees depend on a number of factors including the time, size, network of the transaction. You can find more info here: https://help.coinbase.com/en/coinbase/getting-started/crypto-education/glossary/gas-fee\n\nLet us know if you have any questions.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9g7jc1",
                    "author": "cmdrshepherd1993",
                    "score": 3,
                    "created_utc": 1653141337.0,
                    "response": "I never buy anything Ethereum. (Except classic cause low fees) if you dislike fees stay away from Ethereum network coins. Buy BTC, BCH, LTC, XLM, AVAX, ETC, to store in the wallet but I stay away from Ethereum until the upgrade which should lower fees. You probably need like $30-$40 ETH to do your transaction lol",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9froqh",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653131445.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9g3rvc",
                    "author": "BiochemBeer",
                    "score": 1,
                    "created_utc": 1653139342.0,
                    "response": "Doge should be cheap to send unless it's wrapped Doge. \n\nIt should only be 2-3 Doge for most transactions. You aren't sending this on the Ethereum network where gas is expensive.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9g47nb",
                            "author": "BiochemBeer",
                            "score": 1,
                            "created_utc": 1653139586.0,
                            "response": "If you are having trouble it might be because to pay the transaction fee you need to have extra Doge to pay the fee. Not sure how it's setup in Coinbase Wallet",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9g4ayp",
                            "author": "VloooolV",
                            "score": 1,
                            "created_utc": 1653139637.0,
                            "response": "How do I switch to doge network?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9g501j",
                                    "author": "BiochemBeer",
                                    "score": 1,
                                    "created_utc": 1653140015.0,
                                    "response": "You shouldn't have to when you send out, just like Bitcoin. It should be on the Doge Network unless you have wrapped Doge.\n\nJust try sending a small amount and see what happens.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9g7rty",
                                            "author": "cmdrshepherd1993",
                                            "score": -1,
                                            "created_utc": 1653141457.0,
                                            "response": "Coinbase only has DOGE on the Ethereum network.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9geqns",
                                                    "author": "BiochemBeer",
                                                    "score": 1,
                                                    "created_utc": 1653144789.0,
                                                    "response": "The address is in Doge format. Wouldn't work on ethereum",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9gdp2x",
                    "author": "Yeomandaffodil7",
                    "score": 1,
                    "created_utc": 1653144310.0,
                    "response": "Dogecoin shouldn’t cost ETH is this a different doge?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia1waqn",
                    "author": "Professional-Toe-942",
                    "score": 1,
                    "created_utc": 1653564348.0,
                    "response": "APE IN BEFORE WE MOON 🚀 🚀\n\n     👑 👑 QUINT TOKEN 👑 👑\n\nCONNECTING METAVERSE TO REAL WORLD 🌎 \n \n💰-SUPER-STAKING PLATFORM ( WITH REAL WORLD PRIZES)\n🔥LIVE NFT MARKETPLACE\nQUINT MERCHANDISE ON QUINT SHOP SOON 🤯\nMULTI CHAIN SOON 🦅\nQUINT WALLET SOON💥\nCERTIK AUDIT COMPLETED ✅\n\nMORE UTILITIES INBOUND 👀👀\n\n  REAL WORLD TITANS IN CORE TEAM 💣🦅 \n \n📲Telegram: https://t.me/projectquint\n🌍 : http://quint.io",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iabgiij",
                    "author": "dilsedibr",
                    "score": 1,
                    "created_utc": 1653749242.0,
                    "response": "✅Babymuuinu swap live\n🤑4% rewards in Muu Inu🐮\n🔥0% Buy taxes and 13% sell taxes\n🤩Obito already called us out! 📢 First coin to be listed on #MuuInuSwap 🤩\n⛲️🔒Liquidity locked for 200 years😱😱\n💰🤑Current Mc-$100K\n$10M soon\n\nhttps://t.me/BabyMuuInuCoin",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iafszd8",
                    "author": "uusserrnnamee",
                    "score": 1,
                    "created_utc": 1653839492.0,
                    "response": "✅Babymuuinu swap live\n🤑4% rewards in Muu Inu🐮\n🔥0% Buy taxes and 13% sell taxes\n🤩Obito already called us out! 📢 First coin to be listed on #MuuInuSwap 🤩\n⛲️🔒Liquidity locked for 200 years😱😱\n💰🤑Current Mc-$100K\n$10M soon\n\nhttps://t.me/BabyMuuInuCoin",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}