{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "nhab73",
            "title": "How long are funds on hold at Coinbase before you can transfer to Coinbase Pro?",
            "url": "https://www.reddit.com/r/CoinBase/comments/nhab73/how_long_are_funds_on_hold_at_coinbase_before_you/",
            "author": "ihaveasuperhighiq",
            "created_utc": 1621541700.0,
            "score": 10,
            "num_comments": 20,
            "subreddit": "CoinBase",
            "selftext": "I can't find anything on the website FAQ that tells when they'll be available. I want to start buying crypto but didn't realize I should have put it into coinbase pro. Now I have all my USD stuck in coinbase and it says they aren't available to transfer yet.",
            "stickied": false,
            "comments": [
                {
                    "id": "gyv7w5n",
                    "author": "Nikomaru14",
                    "score": 5,
                    "created_utc": 1621543133.0,
                    "response": "Ok you have to wait for Coinbase to receive the money from your bank. It can take between 1-5 days starting from when you first transferred the money. \n\nYou could just spend the money on Coinbase if you are in a hurry to buy or something. The difference in fees between coinbase and pro is about 1% if you have the money already deposited there (meaning you aren't buying with a debit card). So for example if you wanted to buy $500 worth of crypto:\n\nOn Coinbase you would pay about $7.50 in fees.\n\nAnd on Coinbase pro you would pay like $2.50 in fees.\n\nSo based on that you can make a decision whether or not you want to wait or just buy now on Coinbase.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gyw5uqi",
                    "author": "5H1T48RA1N5",
                    "score": 1,
                    "created_utc": 1621559775.0,
                    "response": "Why do you feel coinbase pro is better?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "gyx7siv",
                            "author": "BitingChaos",
                            "score": 2,
                            "created_utc": 1621585591.0,
                            "response": "The fees are WAY lower. \n\nBuy $100 worth of crypto on Coinbase, they charge $3 or 3.00%. \n\nBuy $100 worth of crypto on Coinbase Pro, they charge 35¢ or 0.35%. \n\nAlso, Coinbase just does Market orders. \nWhile Coinbase Pro can do Market, Limit, or Stop orders. \n\nBuy / Sell on Coinbase Pro, and then move it to Coinbase to earn APY on some crypto or to stake ETH. \n\nI wouldn't recommend buying/selling on regular Coinbase. At all.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "gyy4fmd",
                                    "author": "5H1T48RA1N5",
                                    "score": 1,
                                    "created_utc": 1621607757.0,
                                    "response": "Thanks for the advice. How do you move your crypto over tho. Would I be sending it via the long addresses or does coinbase offer an easier transition?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "gyyi1v7",
                                            "author": "BitingChaos",
                                            "score": 2,
                                            "created_utc": 1621613841.0,
                                            "response": "Luckily, it's free & instant to move back and forth between Coinbase and Coinbase Pro. \n\nIn the Coinbase Pro app, tell it to Deposit. You can select your Coinbase app as the source, and transfer as much or little as you want. \n\nIt works the same for withdrawal. Instead of sending to another wallet, you can select your Coinbase account. \n\nThe regular Coinbase account doesn't show anything related to Coinbase Pro. \n\nBut the separate Coinbase Pro app will show Coinbase stuff.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "gyyt84b",
                                    "author": "madmancryptokilla",
                                    "score": 1,
                                    "created_utc": 1621618800.0,
                                    "response": "Wow thsts a huge difference...i have been using coinbsse since 2018...im scared to move dtuff around...but everytime i make a deposit it is available instantly to buy coins....i think it might be your bank delaying things",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "gyv4m6t",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1621541700.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gyvhaf2",
                    "author": "TChanaH",
                    "score": 1,
                    "created_utc": 1621547329.0,
                    "response": "You can see how long your purchased crypto is on hold through the email Coinbase send you after the purchase. It's right there on top as:\n\n>You can trade your X immediately on Coinbase. You can send your X off of Coinbase starting on <Date>\n\n  \nThis was a response from a Coinbase mod as well. But can't verify as I'm on the exact date it's given here and got an email one of my transaction is now clear, but Coinbase Pro still says my funds are on hold.\n\nEdit: Was able to transfer at the end of given date.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "gyw4so0",
                            "author": "ihaveasuperhighiq",
                            "score": 2,
                            "created_utc": 1621559213.0,
                            "response": "This is helpful. Thanks!",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "gyw95zh",
                                    "author": "TChanaH",
                                    "score": 1,
                                    "created_utc": 1621561522.0,
                                    "response": "My pleasure. FYI I just trnafered to Pro. Right on the day.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "hherih7",
                            "author": "RuPhat",
                            "score": 1,
                            "created_utc": 1634763234.0,
                            "response": "Perfect answer",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "gz20qph",
                    "author": "Pril2Tril",
                    "score": 1,
                    "created_utc": 1621691968.0,
                    "response": "This is a total scam by CoinBase. I kept getting e-mails saying my funds were available to withdraw, but when using my laptop to try to make the transfers over to CoinBase Pro to save on fees, it said the funds were on hold.\n\nAfter Googling it, it looks like a lot of people are having this problem.  One person advised that they were able to do the transfers in the mobile app. When I tried that, it worked. Next thing you know, I'm also able to transfer my funds from the website, using my laptop, after it was just telling me the funds were on hold.\n\nACH transfers from your bank are supposed to be on hold for 3-5 business days, wires are subject to a 1-3 day hold, and debit card purchases are supposed to be available immediately ([https://help.coinbase.com/en/coinbase/getting-started/add-a-payment-method/payment-methods-for-us-customers](https://help.coinbase.com/en/coinbase/getting-started/add-a-payment-method/payment-methods-for-us-customers)).\n\nSome redditors were saying their funds were still on hold after 4 months!! I smell a class action brewing if there isn't already one filed. Document, document, document, and see if it won't  allow you to deposit to CoinBase Pro from the website, but will from the mobile app.\n\nLooks like a total scam to keep people on CoinBase so that they can continue to charge higher fees for trades. Beware and try transferring from your mobile app.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "gz2c0d6",
                            "author": "ihaveasuperhighiq",
                            "score": 1,
                            "created_utc": 1621697945.0,
                            "response": "Unbelievable. It let me withdraw on the mobile app. That's so crazy. I knew it had been long enough. They want people stuck on Coinbase so they are paying the crazy fees. Thanks for the comment. My wife is going to be happy to have money back in our checking account. :)",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "h17ewci",
                                    "author": "Pril2Tril",
                                    "score": 1,
                                    "created_utc": 1623274621.0,
                                    "response": "You're welcome! I hope more people see this and it helps them too. Between this and [Binance.US](https://Binance.US) constantly telling you your password is wrong when it isn't, we need all of the help we can get. Redonkulous!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "h7j9t2e",
                    "author": "Tbags4all",
                    "score": 1,
                    "created_utc": 1627984023.0,
                    "response": "They seem to have no rhyme or reason. Most of the rtime i can buy and send right away. Until i rEALLY NEED TO then its on a hold. Moneys outa my bank acct. Npo warning. I lost out on 10 TGHOUSAND dollars on a trade i was setting up because of iit, Im done. No more. Soon as my stuffs clear, out it comes and closexd it is. Will NEVER use the,m again....",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "h7jabh4",
                    "author": "Tbags4all",
                    "score": 1,
                    "created_utc": 1627984462.0,
                    "response": "Im out 10 THOUSAND DOLLARS due to Coinbase holding my funds. Im done, This is the LAST TIME. IM makin videos, posts, anything i can do to stop this crap and help others to not loose their money. Support? Yea. a computer named  Dewiie Cheetum..Thats your support there. CLOSE YOUR ACCOUNT!!!! YOU WILL BE SORRY IF YA DONT",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "h7jahue",
                    "author": "Tbags4all",
                    "score": 1,
                    "created_utc": 1627984611.0,
                    "response": "As long as they want, whenever they want. THATS your answer. The moneys outa my acct. Ive been able to send right away most of the time. Until they feel like screwin someone. usually me when i have an important trade...like last week....Dont risk it!!!! YOULL LOOSE",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hekiy0k",
                    "author": "Foamform",
                    "score": 1,
                    "created_utc": 1632814078.0,
                    "response": "I didn't get the email mentioned by TchanaH but I did receive an email after contacting support telling me the hold would be released tomorrow late-afternoon, making it just over 6.5 days. I found out that the hold time is listed when you purchase the coin though (I missed it initially) which should have been \"up to 6 days\", and like I said it looks like that's not going to turn out to be quite true. \n\nI saw a different post (from 3 years ago) where someone said it took them 4 months. Most of the posts seemed to average around 2 weeks, but another said something outlandish like 8 months or something like that as well. I'd hope they've improved well beyond that since 3 years ago though. \n\nThe weird part about my case is they let me withdraw a few bucks but not my full $200. And yesterday it said I could withdraw like 2 cents but today it said zero.\n\nI'm actively looking for a better solution but I'm not sure if any others are any better. Anyone have a good experience with Gemini? Or COTI?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8ajr4m",
                            "author": "Rorcerer24",
                            "score": 1,
                            "created_utc": 1652342063.0,
                            "response": "8 months on and I'm having the same issue. It's frustrating because none of this is listed on the website. If anyone's curious, I gave them a call. The reason it's taking two weeks is because they want to prevent \"fraudulent transactions\" (complete bullshit).   \n\n\nI tried it on my phone like it was suggested above. I was still unable to transfer to another wallet though. Looks like I'm stuck waiting the two weeks.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}