{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uyt7fz",
            "title": "Account Issues",
            "url": "https://www.reddit.com/r/CoinBase/comments/uyt7fz/account_issues/",
            "author": "TCEcrypto",
            "created_utc": 1653638353.0,
            "score": 2,
            "num_comments": 36,
            "subreddit": "CoinBase",
            "selftext": " \n\nI tried to login into my account but could not due to me not having access to my google authenticator. I saw a message that I needed to identify my Identity or else my account would be limited to withdrawals if I did not respond by July 17, 2022. I then contacted Coinbase and they told me to create a temporary account using a different email which I did so they can update my phone number. They then asked me to upload my Identity document and take a selfie which I did. I was then told to provide 3 months of bank statements which I did and answer 3 other questions which I did. I would like access to my original account as I have complied with all of the legal documentation and answers. A OP's message is making me realize that maybe he's 100% right and there are liquidity problems. If they've trickled down to my account then that's scary because I'm a small fish. I feel like former Bitcoin dev Gavin Andresen: [https://protos.com/coinbase-bank-statements-chief-armstrong-sorry-andresen/](https://protos.com/coinbase-bank-statements-chief-armstrong-sorry-andresen/)\n\nPlease help me\n\nCase #11990106\n\nThank you.",
            "stickied": false,
            "comments": [
                {
                    "id": "ia63r38",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653638353.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia64bjm",
                            "author": "TCEcrypto",
                            "score": 1,
                            "created_utc": 1653638843.0,
                            "response": "There was a message that Coinbase just wrote but I do not have access to it now on this thread. I have not received an email.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia65tfg",
                                    "author": "coinbasesupport",
                                    "score": 1,
                                    "created_utc": 1653640189.0,
                                    "response": "Thanks for getting back to us, u/TCEcrypto.\n\nWe're sorry to hear you're having issues receiving our specialists' responses regarding case 11990106. They are reaching out to you via the email address associated with your account. \n\nIf you cannot locate their replies, please follow the steps here: https://help.coinbase.com/en/coinbase/other-topics/troubleshooting-and-tips/troubleshooting-coinbase-emails. \n\nAlternatively, you can re-submit your query via our Contact Us form here: https://help.coinbase.com/en/contact-us, but multiple cases can lead to confusion so we'd ask that you please avoid this option if at all possible and respond to your open case instead.\n\nThanks!",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia66826",
                                            "author": "TCEcrypto",
                                            "score": 1,
                                            "created_utc": 1653640557.0,
                                            "response": "I have received their responses and have complied with everything that was asked of me but i have not gained access to my original account.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia67n2u",
                                                    "author": "coinbasesupport",
                                                    "score": 1,
                                                    "created_utc": 1653641840.0,
                                                    "response": "Thanks for your reply.\n\nWe ask that you please direct your questions and feedback to the case directly as our colleagues cannot view any info or feedback provided here. We can only offer updates on your case here, which we have already done.\n\nRest assured our team are eager to reach a resolution for you, so we appreciate your cooperation as they work to do so.\n\nThanks!",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}