{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uvdlgg",
            "title": "coinbase locked my account for many days and no response.",
            "url": "https://www.reddit.com/r/CoinBase/comments/uvdlgg/coinbase_locked_my_account_for_many_days_and_no/",
            "author": "Ancient_Cup_4267",
            "created_utc": 1653234373.0,
            "score": 1,
            "num_comments": 20,
            "subreddit": "CoinBase",
            "selftext": " **Case# 11936885** \n\nCoinbase locked my account for many days even though initial promise was 2 days lock.\n\nPlease unlock my account and I need to communicate with coinbase.\n\nThank you.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9kp3t0",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653234373.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9kqz3o",
                            "author": "Ancient_Cup_4267",
                            "score": 0,
                            "created_utc": 1653235179.0,
                            "response": "my case number is Case# 11936885.\n\nMy account has been locked. And the coinbase customer service is not responding to me via my email. I am very frustrated. Please let them respond to my email or please unlock my account. thank you",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9ksh9s",
                                    "author": "coinbasesupport",
                                    "score": 1,
                                    "created_utc": 1653235829.0,
                                    "response": "Hi there, thank you for reaching out and sharing your case number. Upon review, we have transferred your case here to our specialist team. They will reach out to you via your case number as soon as they have an update.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9m47zu",
                    "author": "TheFnafGhostChild",
                    "score": -1,
                    "created_utc": 1653257156.0,
                    "response": "Edit: Lmao, some dumbass hacked me but i was still logged in so he did jack, sorry for that guys",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9m9g1y",
                    "author": "mkgDC",
                    "score": 0,
                    "created_utc": 1653259752.0,
                    "response": "This happened to me, and while it took a few months to clear it all up, my account was eventually unlocked.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9o7dkq",
                            "author": "bentonboomslang",
                            "score": 2,
                            "created_utc": 1653305808.0,
                            "response": "Hi, Was there anything you did before it was unlocked or did you just have to wait? Did they give any explanation of what happened?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9ptd2w",
                                    "author": "mkgDC",
                                    "score": 1,
                                    "created_utc": 1653332623.0,
                                    "response": "In terms of what I did, I had to email their customer service A LOT! \n\nI did have to authenticate all over again which was annoying.\n\nI don’t really know what happened though. It sounded like they didn’t have enough customer service people to handle all of the issues. I’m not sure if they went though technical issues on their end, or if the VPN I was using was causing them to doubt my identity. I never got answers about the why. But they emailed and said it would take x number of weeks to resolve it, then they emailed again and said they needed 6 more weeks. I was mad, but decided to be patient, and it all got sorted out. I was freaking because I wasn’t sure my account would still be there, etc.\n\nI can tell you one thing I have learned. I no longer use their app on my phone. I only log in from my laptop.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9pcc35",
                    "author": "LionEmpire",
                    "score": 0,
                    "created_utc": 1653325387.0,
                    "response": "Viral event going on right now, for  btc/eth hodlers, check it out :) [https://x2emusk.org](https://x2emusk.org)",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}