{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "v1ha6d",
            "title": "Seeking tips for tracking things",
            "url": "https://www.reddit.com/r/CoinBase/comments/v1ha6d/seeking_tips_for_tracking_things/",
            "author": "AnotherDevArchSecOps",
            "created_utc": 1653968438.0,
            "score": 1,
            "num_comments": 5,
            "subreddit": "CoinBase",
            "selftext": "So, when something gets filled (I use pro), I have to typically do some work to figure out **what** was filled. Sometimes, this takes a very long time. One easy way \\*might\\* be to open up app, go to orders and try to scroll down to filled orders section - IF it works. If these load. Often this requires force-killing the app (in iOS) and restarting the app. If the app does not crash, give an error and want to reload these, I might be in luck. Then I might be able to figure out what was filled. If the app is acting up, the next time I'm on a computer, I try to look at filled tab there and hope I can piece it together.  \n\n&#x200B;\n\nAnyone else have a better way to handle all this? I would also love to get notifications about any fills - partial or otherwise - and I know the answer is \"script it yourself\", but does everyone literally script this themselves? Do people use particular project(s) on github? Are there are other dashboards using coinbase's API that don't make all this so difficult?",
            "stickied": false,
            "comments": [
                {
                    "id": "iamgcmb",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653968438.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ian0cz2",
                    "author": "Hungry_Investment_32",
                    "score": 1,
                    "created_utc": 1653983301.0,
                    "response": "I set my order prices buy/sell in cb pro and then in tradingview set alerts for that same price so I know when the target price is hit.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iand8dh",
                    "author": "WECANalsoWe",
                    "score": 1,
                    "created_utc": 1653994594.0,
                    "response": "🔗 Welcome to $IBT ⛓\n\n🚨IBT Token Official Contract is here. When the launch day and time arrives, trading will begin.\n⚡️IBT CA: 0x9D3d5C13a4CcE652ef7bFAEE3378d2cd59fD37B3\n📅 UPCOMING LAUNCH DATE: June 3, 18:00 UTC 📅\n\n🟠 Join the TG : t.me/IBTProject\n\n⚙️ $IBT Smart Tokenomics ⚙️\n\n⛓ Total Supply: 1,000,000 $IBT\n⛓ 50% Burned Tokens\n⛓ 7% Staking\n⛓ 5% Comps & Giveaways\n⛓ 32% LP Listing\n⛓ 6% GameFi Development\n\n🕸SOCIAL NETWORKS 🕸\n🌍 Website 🗯 Telegram 🕊 Twitter  📣 Channel",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}