{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ur2rh4",
            "title": "is \"you are closing too many accounts\" error related to 24-hour limitation on sending crypto following account recovery? Case# listed in post.",
            "url": "https://www.reddit.com/r/CoinBase/comments/ur2rh4/is_you_are_closing_too_many_accounts_error/",
            "author": "RIKKIS_LOST_NUMBER",
            "created_utc": 1652726209.0,
            "score": 1,
            "num_comments": 4,
            "subreddit": "CoinBase",
            "selftext": "I have successfully recovered an account of mine that was tied to my previous phone number; this involved two \"account recovery\" procedures: the first one completed Saturday afternoon (2 days ago) and the email notification indicated that sending crypto would be disabled for 24 hours. Upon signing in on Saturday following recovery, it prompted me to do another \"account recovery\" including uploading identity verification photos, etc.  This second account recovery process completed successfully yesterday afternoon, and I was and am able to login to the account and reset the password.  The notification email that said \"recovery successful\" did not mention any 24 hour hold like the previous one did.\n\nThis is an account that is pending closure, requiring me to empty the balances by sending the remaining crypto to an external address.  When I attempt to do this I receive the error \"You are closing too many accounts. Please try again later\".   \n\nDue to the wording of the error, and the fact that the most recent \"recovery successful\" email did not specify a 24-hour hold on sends, and due to search results I find for this specific error message on this subreddit, I feel that there is reason to believe that I need someone at coinbase support to look into this so that I may move my crypto out and the account closure can proceed.\n\nI have a Case number: #11861575 from my initial phone call yesterday. \n\nI cannot use the web support because when signing in via the support page or the support chat applet, it immediately redirects me to the \"account closure pending\" page, so that's the only page I can access when logged in.\nThanks",
            "stickied": false,
            "comments": [
                {
                    "id": "i8uo5du",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1652726210.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8uo8k7",
                            "author": "RIKKIS_LOST_NUMBER",
                            "score": 1,
                            "created_utc": 1652726246.0,
                            "response": "Case #11861575",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}