{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "umusib",
            "title": "Coinbase won’t send me SMS verification",
            "url": "https://www.reddit.com/r/CoinBase/comments/umusib/coinbase_wont_send_me_sms_verification/",
            "author": "mooresy20",
            "created_utc": 1652222265.0,
            "score": 5,
            "num_comments": 12,
            "subreddit": "CoinBase",
            "selftext": "I try to buy BTC and get to the point where it send me an SMS to verify my purchase. But I do not receive the SMS. I contacted my bank and they assure me this is on coinbases end. I’m receiving all sms otherwise. Any help?",
            "stickied": false,
            "comments": [
                {
                    "id": "i84c3k6",
                    "author": "ThePassionOfReptar",
                    "score": 5,
                    "created_utc": 1652227751.0,
                    "response": "Good.\n\nStop using SMS",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i84f8gn",
                            "author": "Kiwip0rn",
                            "score": 3,
                            "created_utc": 1652229166.0,
                            "response": "^^ 100% this.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i84h92n",
                    "author": "fx9TMK",
                    "score": 5,
                    "created_utc": 1652230084.0,
                    "response": "What does your bank have to do with you receiving a SMS code from coinbase?",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "um61cq",
            "title": "Account stuck being \"Under Review\" for 3 weeks",
            "url": "https://www.reddit.com/r/CoinBase/comments/um61cq/account_stuck_being_under_review_for_3_weeks/",
            "author": "AndrewCarter04",
            "created_utc": 1652143795.0,
            "score": 4,
            "num_comments": 12,
            "subreddit": "CoinBase",
            "selftext": "Created an account 3 weeks ago now, and it still says it is \"under review\" and \"generally takes a few days\".\n\nContacted support about this several times, and every time I have just got a response saying \" We appreciate your patience. Our team is working diligently to review your account. \" but it has been 3 weeks. Like come on. Made a Binance account on the same day and they managed to verify my ID in about 5 minutes.\n\nI'm out of options really, so thats why I turned to reddit in the hope of finally being able to use my account.",
            "stickied": false,
            "comments": []
        },
        {
            "id": "un8vae",
            "title": "Coinbase earnings were bad. Worse still, the crypto exchange is now warning that bankruptcy could wipe out user funds",
            "url": "https://fortune.com/2022/05/11/coinbase-bankruptcy-crypto-assets-safe-private-key-earnings-stock/",
            "author": "bluetidepro",
            "created_utc": 1652272631.0,
            "score": 164,
            "num_comments": 209,
            "subreddit": "CoinBase",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i86hcui",
                    "author": "Badgerisbest",
                    "score": 109,
                    "created_utc": 1652274501.0,
                    "response": "Revenue is down at every crypto exchange, just like any bear market.\n\nI don't see how lawyer speak disclosure is terrifying. If you are sweating CB use a private wallet. If you dive deep and dirty on any terms of service you are going to find some terrifying sounding shit. No one reads them though, until it gets passed around on Twitter like it's the Watergate source.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i87yjey",
                            "author": "realjimcramer",
                            "score": 6,
                            "created_utc": 1652295774.0,
                            "response": "Point is, if Coinbase decides to declare bankruptcy then it's no different than keeping your crypto in Robinhood. They basically are just admitting that if they declare bankruptcy they will liquidate YOUR assets to soften the blow to themselves, aka, fuck the customer.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8847jn",
                            "author": "harshdozer",
                            "score": 3,
                            "created_utc": 1652297985.0,
                            "response": "Definitely use a private wallet. Even if you ain’t sweating.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i86iexe",
                            "author": "fv7061",
                            "score": 28,
                            "created_utc": 1652274987.0,
                            "response": "Lawyer Speak = Coinbase has stated they are burning through cash at a very high rate.  When that happens there is a risk of bankruptcy.  If Coinbase declares bankruptcy, the crypto users bought is unsecured debt, which means that you will literally get pennies on the dollar for your crypto held in Coinbase.  Plus it will take years in bankruptcy court to see those pennies.\n\nSo in non-lawyer speak: if Coinbase declarers bankruptcy and you own $20,000 in cypto through Coinbase at the time of their filing, your Coinbase holdings will suddenly become inaccessible to you and will probably get $200-$500 dollars for your $20,000 in crypto 1-2 years after their bankruptcy filing.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i86ke2p",
                                    "author": "Badgerisbest",
                                    "score": 24,
                                    "created_utc": 1652275875.0,
                                    "response": "You are talking about coinbase literally not making payroll for their employees for this to happen. Now this would be after aggressive layoffs, which anyone can monitor as well, as a public company massive CB layoffs would be reported within days. \n\nLawyer speak conditions are literally written for doomsday scenarios, not everyday operations, or the average crypto bear market.\n\nIf I'm Brian Armstrong and the crypto bear market turns into a long hard as hell winter, do the grim task of laying off 50% of the employees (I would rather hold on to them for the next crypto bull market explosion if possible) but that would cut costs by an insane amount. If anyone's crypto holdings got touched before they laid off maybe down to 200 employees, the entire company is dead. They have 5000 employees, as as someone who has tried to work with crypto exchanges in partnerships, almost all of the employees are burnt the fuck out and don't have enough support.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i86lsco",
                                            "author": "fv7061",
                                            "score": 7,
                                            "created_utc": 1652276497.0,
                                            "response": "Yes, which is what happens when companies declare bankruptcy.  Coinbase burned through $1.5 billion dollars of cash during the first quarter alone.  I'm old enough to remember the dot-com bubble bursting.  There were all of these trendy tech companies that were unprofitable and were burning through cash at a very high rate, but had huge valuations based on \"growth\".  Then the economy downturned, the fed raised interest rates several times and large percentage of these companies stopped paying their employees and went bankrupt.\n\n[https://en.wikipedia.org/wiki/Dot-com\\_bubble](https://en.wikipedia.org/wiki/Dot-com_bubble)\n\n>If I'm Brian Armstrong and the crypto bear market turns into a long hard as hell winter, do the grim task of laying off 50% of the employees (I would rather hold on to them for the next crypto bull market explosion if possible) but that would cut costs by an insane amount. If anyone's crypto holdings got touched before they laid off maybe down to 200 employees, the entire company is dead. They have 5000 employees, as as someone who has tried to work with crypto exchanges in partnerships, almost all of the employees are burnt the fuck out and don't have enough support.\n\nLet's say they lay of 2,500 employees and each of those employees is earning $200k.  That saves them $500 million dollars.  What about the other $1 billion dollars they burned through in Q1?\n\nAnd yes, layoffs would happen before a bankruptcy, they always do.  But layoffs won't fix their cash burn problem.  Also, Coinbase wouldn't \"touch\" cypto holdings.  That is not how bankruptcy works. The courts would handle it and those who held unsecured debt, which Coinbase has stated all of their crypto holdings are, would get almost nothing.\n\nYou are correct, that this is a worse case scenario.  But bankruptcies happen.  No one knows how long this bear market will last.  But the fact that Coinbase's crypto holding are unsecured should absolutely worry anyone who has their crypto in Coinbase.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i87wv96",
                                                    "author": "Glazier1273",
                                                    "score": 3,
                                                    "created_utc": 1652295114.0,
                                                    "response": "Exactly, they burn so much cash that they can declare bankruptcy anytime. Brian made his money, board made their money, employees made their money... what do any of them care if the company folds and investors get screwed?",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i8734ae",
                                                    "author": "meeok2",
                                                    "score": 5,
                                                    "created_utc": 1652283513.0,
                                                    "response": "Wait... Coinbase has employees???",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i86o4y7",
                                                    "author": "Jeffscrazy",
                                                    "score": 7,
                                                    "created_utc": 1652277499.0,
                                                    "response": "This is not the dot-com bubble. Coinbase has been through 2 bear markets and knows how to handle another",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i86ouo2",
                                                            "author": "fv7061",
                                                            "score": 4,
                                                            "created_utc": 1652277800.0,
                                                            "response": "They went public in April 2021.  Also, they were founded in 2012. When I say “bear market” I don’t mean “crypto bear market” I mean overall stock market “bear market”. Because as long as interest rates are low and the general economy is fine, Coinbase and other exchanges will have no problem securing VC funding. However, when interest rates go up and the S&P goes down, securing VC funding becomes much harder.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i878q7o",
                                                                    "author": "Mace_TheAce_Windu",
                                                                    "score": 4,
                                                                    "created_utc": 1652285696.0,
                                                                    "response": "Also they don’t own coins for every coin purchased. They may maintain a pool but users just get an iou. If a shit ton of users pull their coins and drain the pool, cb has to go out and purchase more of those coins to refill the pool. \n\nThey’re losing a shit ton of money fast and that would increase that amount a lot",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                },
                                                                {
                                                                    "id": "i86q53q",
                                                                    "author": "Jeffscrazy",
                                                                    "score": 3,
                                                                    "created_utc": 1652278345.0,
                                                                    "response": "Yeah, I realise what you’re saying and you’re right, there’s a big crash coming for the entire financial market. But the fact that Coinbase only went public in 2021 at the peak of the bull market is what explains the drop in share price. If Coinbase investors expected their investment to keep going up year, after year, after year, without considering bear markets, then they deserve to lose money. Investing money in to Coinbase is really only gonna pay off by the next bull run.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i87bxxv",
                                                    "author": "FlaggyAZ",
                                                    "score": 5,
                                                    "created_utc": 1652286931.0,
                                                    "response": "Instead of arguing why don’t you just withdraw your crypto to a wallet?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i895qy8",
                                                            "author": "nerdtard1515",
                                                            "score": 4,
                                                            "created_utc": 1652313870.0,
                                                            "response": "Will Coinbase wallet be operational if they go bankrupt?",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i86nim0",
                    "author": "snoop_Nogg",
                    "score": 11,
                    "created_utc": 1652277237.0,
                    "response": "I've already lost most of my money, anyway",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i86kaju",
                    "author": "josephcfrost",
                    "score": 6,
                    "created_utc": 1652275830.0,
                    "response": "If I have Coinbase wallet and use their cold storage , If  Coinbase declares bankruptcy what does that mean for Coinbase wallet, that wallet is always there despite Coinbase going bankrupt and the  centralized exchanges suffering?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i86wyrl",
                            "author": "failf0rward",
                            "score": 7,
                            "created_utc": 1652281096.0,
                            "response": "You own the keys for Coinbase wallet, so you own the coins.  Coinbase doesn’t even have access to do anything with your stuff there, and it would not be included in any kind of Coinbase bankruptcy.  CB wallet is just a nice GUI wallet for your coins.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i87dfii",
                                    "author": "ReDeaMer87",
                                    "score": 3,
                                    "created_utc": 1652287501.0,
                                    "response": "This is nice to hear. I'm paying out my last 10k on cb card then getting my 4% rewards moved out quick",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i88f4uj",
                                            "author": "ZirJohn",
                                            "score": 3,
                                            "created_utc": 1652302265.0,
                                            "response": "Coinbase isn't going anywhere. The title is just scary sounding clickbait.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i877m2p",
                    "author": "456080107",
                    "score": 8,
                    "created_utc": 1652285260.0,
                    "response": "Anyone else regret locking your ETH in coinbase for ETH2? We’re fucked",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i86tbs3",
                    "author": "J-Rocks-baby-mama",
                    "score": 3,
                    "created_utc": 1652279637.0,
                    "response": "This was just standard language required by the SEC.  Any publicly traded exchange would need to report this statement.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i88eafg",
                    "author": "Scary_Introduction40",
                    "score": 3,
                    "created_utc": 1652301929.0,
                    "response": "So is the move to transfer everything to meta mask wallet?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i86u9xa",
                    "author": "asstyrant",
                    "score": 16,
                    "created_utc": 1652280022.0,
                    "response": "The amount of doomsaying over what amounts to a typical legalese statement that anyone with a simple understanding of bankruptcy proceedings already knew is quite comical.  Just goes to show that the crypto space is overpopulated by moonbois who don't bother reading any of the shit they're signing up for. \n\nOh, and if CB's abysmal support drones are watching, this is the *exact* situation that I described in my open letter to you (since blocked publicly, and ignored privately) as to why you need an active mod-team, rather than whatever this piss-poor excuse for moderation is.  You had the opportunity to get out in front of this wave of negativity before it became a tsunami of misinformation, but instead your \"mods\" sat in the corner short-stroking it to pictures of Bored Apes.  Whomever you're paying to do this should be shot and pissed on.\n\nFor the idiots who take this as a sign that CB is going to go belly up: move your coins off the exchange.  Simple.  However, each and every exchange has the same potential fatal flaw whether they declare it or not -- not your keys, not your crypto.  If this is bothersome to you, then move your coins to your own wallet and be done with it.  Otherwise, there's always a risk that you'll get caught up in MtGox 2.0.\n\nCan't move your ETH off because you locked stake into 2.0?  Tough shit.  That was part and parcel of the agreement you signed (or check-boxed) when committing to the stake.  Don't like it?  Maybe you should have read the agreements and disclosures, eh?  Shit sucks, but maybe you'll learn from the experience and think twice before doing it again. \n\nSick and fucking tired of noisy fucking idiots.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i872dxt",
                            "author": "_Schizo_",
                            "score": 5,
                            "created_utc": 1652283226.0,
                            "response": "> Sick and fucking tired of noisy fucking idiots",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i86tulk",
                    "author": "dacoo1",
                    "score": 6,
                    "created_utc": 1652279850.0,
                    "response": "It’s time to sell coinbase stock and move your crypto holdings off",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i86gakb",
                    "author": "InDEThER",
                    "score": 18,
                    "created_utc": 1652274009.0,
                    "response": "If you want to save safely, put your money in an FDIC insured bank. If you want to invest safely, put your money in a SIPC insured brokerage. \n\nIf you want to invest recklessly, put your money in a Las Vegas casino or buy cryptocurrency. \n\nEven if Coinbase has no intention of going bankrupt, there is a non-zero chance of that happening. In the unlikely event of bankrupty, it should be disclosed to customers and investors that deposits are not insured on any way and they will lose everything. \n\nThe inconvenient truth is that this is true for EVERY crypto exchange. But only Coinbase, as a publicly traded company, is required by law to disclose risks to customers. No other crypto exchange does this.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i86hxfh",
                            "author": "stonecats",
                            "score": 9,
                            "created_utc": 1652274765.0,
                            "response": "> only Coinbase, as a publicly traded company,   \nis required by law to disclose risks to customers.\n\nthanks, this puts today's statement into proper context.  \n\nmy question is... i own 1 BTC in my own secure wallet    \nwhat difference does it make if coinbase disappears?    \ni have the wallet address, all the security words, etc.  \ni still have that exclusive virtual blockchain, don't i ?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i86i641",
                                    "author": "Deeman0",
                                    "score": 7,
                                    "created_utc": 1652274875.0,
                                    "response": "Yes, yes you do.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i86p4ak",
                                    "author": "livens",
                                    "score": 7,
                                    "created_utc": 1652277909.0,
                                    "response": "That's a good point, and I think most Coinbase users don't understand it.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i88etil",
                                    "author": "ZirJohn",
                                    "score": 3,
                                    "created_utc": 1652302140.0,
                                    "response": "Why do you own a whole bitcoin when you don't know the answer to your question???",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i86qlcj",
                    "author": "TheCureprank",
                    "score": 5,
                    "created_utc": 1652278531.0,
                    "response": "Fucking criminals are running every facet of both markets",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i86g6fj",
                    "author": "Manateeboi",
                    "score": 4,
                    "created_utc": 1652273956.0,
                    "response": "Well shit,. Is it possible to unstake my eth?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i86kukx",
                            "author": "27thStreet",
                            "score": 8,
                            "created_utc": 1652276082.0,
                            "response": "No, and you likely knew that when you staked withy CB.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i86rnxu",
                                    "author": "gingerballs45",
                                    "score": 3,
                                    "created_utc": 1652278967.0,
                                    "response": "Doesn’t matter if they staked with CB or not. CB is not controlling the ability for you to remove your ETH from the locked merge contract. There is literally no way to unstake until the merge is completed.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i86r9d8",
                                    "author": "satinkzo",
                                    "score": 4,
                                    "created_utc": 1652278804.0,
                                    "response": "Well they did state they'd allow trading and never did.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i86f04j",
                    "author": "JPC1001",
                    "score": 3,
                    "created_utc": 1652273395.0,
                    "response": "Would this also include Coinbase Pro?",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "un9s9l",
            "title": "Guys any issue with coin base not allowing to use cash already deposited to make a purchase?",
            "url": "https://www.reddit.com/r/CoinBase/comments/un9s9l/guys_any_issue_with_coin_base_not_allowing_to_use/",
            "author": "Confident_Fly_2565",
            "created_utc": 1652275499.0,
            "score": 9,
            "num_comments": 34,
            "subreddit": "CoinBase",
            "selftext": "My bad, My transfer is pending, that's why I can't purchase, it says it's available but somewhere else it says my transfer to coinbase is still pending. I don't know but this site app is not as intuitive as it should be.",
            "stickied": false,
            "comments": [
                {
                    "id": "i87347x",
                    "author": "orindragonfly",
                    "score": 3,
                    "created_utc": 1652283512.0,
                    "response": "Not that but it’s asking me for a ID to send my ALGOS I just bought never did this before Guess I will have to drop them and go to Binance",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "un2t41",
            "title": "Brian Armstrong: \"There is some noise about a disclosure we made in our 10Q today about how we hold crypto assets. Tl;dr: Your funds are safe at Coinbase, just as they’ve always been. \"",
            "url": "https://twitter.com/brian_armstrong/status/1524233480040710144",
            "author": "EZLIFE420",
            "created_utc": 1652248568.0,
            "score": 16,
            "num_comments": 19,
            "subreddit": "CoinBase",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "umwnpm",
            "title": "Cory Klippsten on Twitter.",
            "url": "https://twitter.com/coryklippsten/status/1524158099229003777?s=21&t=Q8uwEyV-tz804fMvsLjZag",
            "author": "ZiltoidM56",
            "created_utc": 1652227747.0,
            "score": 23,
            "num_comments": 23,
            "subreddit": "CoinBase",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i84f3z5",
                    "author": "GraveyardZombie",
                    "score": 5,
                    "created_utc": 1652229110.0,
                    "response": "NYKNYC",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "un13pg",
            "title": "Coinbase Customer Support is the worst ever.",
            "url": "https://www.reddit.com/r/CoinBase/comments/un13pg/coinbase_customer_support_is_the_worst_ever/",
            "author": "Kezotron",
            "created_utc": 1652242139.0,
            "score": 11,
            "num_comments": 15,
            "subreddit": "CoinBase",
            "selftext": "If you reach customer support in the Philippines, hang up and keep dialing until you reach someone in the US.  There are really good customer support people in the Philippines.   Coinbase does not hire them.   The people on the phone in the Philippines lie to you, put you on hold for no reason for long periods of time and laugh at you,  It is frustrating not being able to access your funds.   When customer support finds that amusing it is a total nightmare.",
            "stickied": false,
            "comments": [
                {
                    "id": "i857vvk",
                    "author": "Kiwip0rn",
                    "score": 3,
                    "created_utc": 1652242872.0,
                    "response": "7th low Karma complainer today... yeah... 🙄",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "umugsf",
            "title": "Wormhole LUNA/UST on coinbase",
            "url": "https://www.reddit.com/r/CoinBase/comments/umugsf/wormhole_lunaust_on_coinbase/",
            "author": "InevitableMotor7891",
            "created_utc": 1652221362.0,
            "score": 16,
            "num_comments": 47,
            "subreddit": "CoinBase",
            "selftext": "Hello.\n\nLUNA is looking to deprecate the \"shuttle\" for wrapped ust/luna. \n\nThe main terra bridge page defaults to wormhole luna and I stupidly sent a LOT of LUNA to my coinbase account. It ridicules me that coinbase will not help only saying that it does not support wormhole luna and only supports wrapped luna/ UST. \n\nThis makes no sense because the receiving address is an ERC-20 wallet (coinbase's wallet) and now has my wormhole LUNA. My LUNA just didnt disappear, it simply went to their wallet. Terra will be depricating the old wrapped version but they have so many issues on their own.\n\nI just hope coinbase can recover my funds with a small fee (binance does that) or add wormhole UST/Luna. I'm sure there's millions lost in transaction with this wormhole.\n\nCan people help me by upvoting or comment below if you have similar issues. Please help!",
            "stickied": false,
            "comments": [
                {
                    "id": "i85bc8f",
                    "author": "radiofriendly123",
                    "score": 3,
                    "created_utc": 1652244935.0,
                    "response": "Bump\n\nPlease everyone - continue to contact coinbase and pursue a resolution. Other exchanges fix these issues for their customers. Coinbase should too.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "umzi04",
            "title": "what does usdc use?",
            "url": "https://www.reddit.com/r/CoinBase/comments/umzi04/what_does_usdc_use/",
            "author": "halo9909",
            "created_utc": 1652236712.0,
            "score": 3,
            "num_comments": 15,
            "subreddit": "CoinBase",
            "selftext": "trying to send out but my receiving said asks if it uses eth or polygon chain and i can’t see any info on coinbase to choose which one",
            "stickied": false,
            "comments": [
                {
                    "id": "i84wjkj",
                    "author": "Tall_Run_2814",
                    "score": 8,
                    "created_utc": 1652237076.0,
                    "response": "Ethereum",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "umr5zj",
            "title": "Unable to sell any crypto on Coinbase",
            "url": "https://www.reddit.com/r/CoinBase/comments/umr5zj/unable_to_sell_any_crypto_on_coinbase/",
            "author": "SamTheChosenOnee",
            "created_utc": 1652212445.0,
            "score": 4,
            "num_comments": 16,
            "subreddit": "CoinBase",
            "selftext": "Changed my card the other week to a different one, and now for some odd reason i am unable to sell any cryptos on my coinbase. I still can buy but selling option just say's \" Add a Payment Method\"\n\nWhen I go to add a card to my account nothing happens. Any ideas? already sent 2 emails to coinbase support and they haven't helped at all\n\n Case# 11724994",
            "stickied": false,
            "comments": [
                {
                    "id": "i83ditf",
                    "author": "Kiwip0rn",
                    "score": 5,
                    "created_utc": 1652213020.0,
                    "response": "Okays 🙄 1 Karma account.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "um7ioc",
            "title": "\"Unable to verify address\"",
            "url": "https://www.reddit.com/r/CoinBase/comments/um7ioc/unable_to_verify_address/",
            "author": "s_mekras",
            "created_utc": 1652148241.0,
            "score": 3,
            "num_comments": 17,
            "subreddit": "CoinBase",
            "selftext": "Probably not the first one here that has this happened to them, but for months now my account has been in restricted mode because Coinbase cannot verify my address.  \n\n\nI've attempted to do so with a phone bill multiple times, both in PDF and JPG formats, to no avail. I've also contacted support about it twice, getting no response whatsoever.  \n\n\nAnyone has any ideas as to what I can do?",
            "stickied": false,
            "comments": []
        },
        {
            "id": "um7vf4",
            "title": "COINBASE PLEASE ADD SUPPORT FOR WORMHOLE UST",
            "url": "https://www.reddit.com/r/CoinBase/comments/um7vf4/coinbase_please_add_support_for_wormhole_ust/",
            "author": "Suhabibi",
            "created_utc": 1652149287.0,
            "score": 7,
            "num_comments": 32,
            "subreddit": "CoinBase",
            "selftext": "I accidentally sent a lot of money through my TeraStation wallet using a wormhole instead through a shuttle. After hours of talking to customer representatives and agents regarding the issue, all the answers defaulted that they were unable to do anything unless support was added. So in the dire moment with nothing else to hope for I hope this post gathers enough attention so that the asset compatibility can be added to coinbase.\n\nRIP UST",
            "stickied": false,
            "comments": []
        }
    ]
}