{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ukuwk7",
            "title": "Why does Coinbase Top Movers seem to consistently omit Algorand?",
            "url": "https://www.reddit.com/r/CoinBase/comments/ukuwk7/why_does_coinbase_top_movers_seem_to_consistently/",
            "author": "GhostOfMcAfee",
            "created_utc": 1651987566.0,
            "score": 83,
            "num_comments": 252,
            "subreddit": "CoinBase",
            "selftext": "This is not a fluke. It has happened multiple times in the past month.  As of writing, $ALGO is up 5.37%, yet Coinbase lists the \"Top Mover\" as some random coin called $SUKU at 2.25%. Earlier today, $ALGO was up even higher, way more than others were either up or down. Yesterday was the same. Last week when the $ALGO deal with FIFA was announced, it was up 13% while others were down, and the percentages for the top movers (both up and down) were in the low single digits. I recall a similar instance back in February where $ALGO pumped hard against the market, yet, despite clearly having the highest movement against tradable coins on Coinbase, it was nowhere to be found in the Top Movers list.\n\nI don't trade or make decisions based on the Top Mover list, nor do I think anyone else should. But, I find it deeply concerning that Coinbase seems to be putting their fingers on the scales here. I have many gripes with Coinbase that are even more concerning (\\*ahem\\* apparent insider trading on coins that are about to be listed \\*ahem\\*), but this is also another one.\n\nBut, seriously Coinbase, how is it that the top moving tradable coin doesn't actually show up as a Top Mover? Are you bad at maths and don't realize 13% > 4%? Is your algorithm busted? Or are you, unbeknownst to your customers, trying to pick winners and losers and move the market to your benefit?",
            "stickied": false,
            "comments": [
                {
                    "id": "i7s0l6i",
                    "author": "coinbasesupport",
                    "score": 1,
                    "created_utc": 1652000288.0,
                    "response": "Thanks for letting us know about this. We have gone ahead and flagged this with our team to look into further. You can also check the [Top Gainers](https://www.coinbase.com/price/s/top-gainers) section of [Coinbase.com](https://Coinbase.com) for more stats and information. Many thanks.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7rubpr",
                    "author": "SPCE_VIRGIN",
                    "score": 11,
                    "created_utc": 1651994895.0,
                    "response": "Happens too often to be by chance. Malicious and i wouldnt be surprised if Coinbase gets sued",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7rr547",
                    "author": "daveydog24",
                    "score": 11,
                    "created_utc": 1651992299.0,
                    "response": "I didn’t see any news about the developer grants or the FIFA deal either",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7rriwv",
                            "author": "GhostOfMcAfee",
                            "score": 7,
                            "created_utc": 1651992601.0,
                            "response": "That was sus. It seems like a partnership with the biggest sports league in the world would at least get mentioned. But, at least with that, I can understand that there is a bit of editorial license. The Top Mover thing is baffling though. It's just maths (or at least if you are being honest, it should be). Maths is cold and uncaring. It just is what it is. When I start seeing people and companies try to play games with and hide it, my alarm bells go off.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7rx2nv",
                    "author": "No-Cash-7970",
                    "score": 30,
                    "created_utc": 1651997208.0,
                    "response": "I think the Top Movers list is curated somehow. If it is curated, CoinBase should disclose that fact or chose a name for the list, like \"Chosen Top Movers\" or \"Movers Spotlight\",  that makes it more apparent that the list is curated.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7rxnog",
                            "author": "GhostOfMcAfee",
                            "score": 16,
                            "created_utc": 1651997723.0,
                            "response": "Exactly my thoughts. My problem is that they are portraying this as a simple maths thing, when, it seems to be a wholly curated one. It's like Bloomberg telling you \"wow, the biggest gainer on NYSE was some random small cap stock which jumped 4%\" when in reality a big cap stock like Apple jumped 13%.\n\nI like maths. It is cold and uncaring. It doesn't care about your feelings. It just exists. Don't pretend to do maths when you are really engaging in editorialism. It is untrustworthy and deceptive.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7sgdks",
                                    "author": "ChrisR109",
                                    "score": 3,
                                    "created_utc": 1652012977.0,
                                    "response": "Are they using common core math?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i7shlvu",
                                            "author": "unknownemoji",
                                            "score": 1,
                                            "created_utc": 1652013743.0,
                                            "response": "Nobody is doing any math here; this is crypto!",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i7tvlmf",
                                                    "author": "ChrisR109",
                                                    "score": 1,
                                                    "created_utc": 1652036785.0,
                                                    "response": "That is true.  Where one buys at ath, coin goes down 10%, and you still end up with zero  (At least on Coinbase).",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i7tyjkr",
                                                            "author": "unknownemoji",
                                                            "score": 1,
                                                            "created_utc": 1652038063.0,
                                                            "response": "As long as the fundamentals of the investment don't change, smart investors go in on a downturn and out on an upturn. It's the Buffet method. I call it reverse FOMO.\n\nOtherwise, you risk buying the top and selling the bottom.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i7wvjut",
                                                                    "author": "ChrisR109",
                                                                    "score": 1,
                                                                    "created_utc": 1652100265.0,
                                                                    "response": "I thought the buffett method was not even spending 25 bucks on btc.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i7zbc3t",
                                                                            "author": "unknownemoji",
                                                                            "score": 1,
                                                                            "created_utc": 1652137269.0,
                                                                            "response": "\"If you offered me all the Bitcoin in the world for $25, I wouldn't take it. I wouldn't have anyone to sell it to.\"\n\nBitcoin as a currency represents a store of value. It only has value if people will accept it as payment for other things. If you, or I, or any one other person had all the Bitcoin, nobody else could use it, so it would be unusable and worthless.\n\nThe \"Buffet Method\" is an investment strategy that applies to any investment in any market. \"Be fearful (sell) when others are greedy; be greedy (buy) when others are fearful.\"\n\nNotice the word 'market,' above. If you have all of something that is designed as a store of value and a medium of exchange, there's no market.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i7urhsg",
                                                    "author": "RicardoHickel",
                                                    "score": 1,
                                                    "created_utc": 1652051085.0,
                                                    "response": "Meth",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i7szsbn",
                            "author": "Brilliant_Exam_1323",
                            "score": 2,
                            "created_utc": 1652022874.0,
                            "response": "It should say \"Here's what coins we're Holding, Buy These not Those\"",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i7vin3k",
                            "author": "FormerCoinbaseEng",
                            "score": 1,
                            "created_utc": 1652064613.0,
                            "response": "Hijacking top comment - former Coinbase engineer.\n\nThis is almost assuredly just a bug, no grand conspiracy here.\n\nCoinbase doesn't have a conspiracy against Algo (or any other crypto), note how others have reported this happening with their favored chain too? Also, notice how Coinbase supports Algorand staking, and not other chains (yet)? Coinbase wants Algorand and all others to succeed. There's just no benefit for CB to try to play favorites, they're heavily regulated, why would they risk their licenses and their entire business on something so silly?\n\nSo, just a bug. I'm confident they'll get it fixed, don't fret.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7w20yo",
                                    "author": "No-Cash-7970",
                                    "score": 1,
                                    "created_utc": 1652077124.0,
                                    "response": "I don't have an issue with CoinBase playing favorites about which of the coins to feature in the Top Movers list. We see curated lists and sponsored content all the time, so that's not a problem.\n\nThe issue is that of transparency. CoinBase presents the Top Movers list as some unbiased math-based list, when it's obvious it's not. CoinBase should either make the Top Movers list the unbiased math-based list it pretends to be or somehow disclose or make it obvious that the list is curated.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i7x9qw3",
                                            "author": "FormerCoinbaseEng",
                                            "score": 1,
                                            "created_utc": 1652106871.0,
                                            "response": "As mentioned, it's a bug so it's not typical behavior. It should be an unbiased list as far as I know",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i7rvw2a",
                    "author": "unknownstranger2",
                    "score": 7,
                    "created_utc": 1651996192.0,
                    "response": "I've noticed this as well.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7rycrd",
                    "author": "PullUpSkuurt",
                    "score": 7,
                    "created_utc": 1651998332.0,
                    "response": "How is this possible? Work on it Coinbase",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7s23w2",
                    "author": "GhostOfMcAfee",
                    "score": 4,
                    "created_utc": 1652001647.0,
                    "response": "dear u/coinbasesupport, why are you not answering? [https://imgur.com/a/e4PFm9i](https://imgur.com/a/e4PFm9i)\n\nlol\n\nPlease do your best to ban u/CustomerSupport-46 and their associated IP. When done, please focus on fixing your busted algorithm that doesn't know how to do simple maths.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7ryqvv",
                    "author": "Hot-Consideration469",
                    "score": 8,
                    "created_utc": 1651998682.0,
                    "response": "Coinbase knows what they are doing. They are a biased entity doing favour to some coins at the expense of the others. That's FRAUDULENT",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7screl",
                            "author": "puddlesofmustard",
                            "score": 3,
                            "created_utc": 1652010566.0,
                            "response": "I hear those ADA folk are salty af.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7rlkun",
                    "author": "GhostOfMcAfee",
                    "score": 8,
                    "created_utc": 1651988080.0,
                    "response": "Also a similar time happened in early January.  I'm sure there are other instances. I'm just going based on my recollection. The point is, this is not a fluke. And, the maths is undeniable. Something is wrong here.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7s0gsa",
                    "author": "GhostOfMcAfee",
                    "score": 7,
                    "created_utc": 1652000182.0,
                    "response": "FYI. Folks from other chains should read and think before downvoting. This has transformed from a post about an Algo guy wondering why Algo gets omitted to a question about why many other chains apparently suffer the same thing. This is no longer a chain specific issue. It is a question of why Coinbase cannot be expected to do basic arithmetic for any chain. All L1s should be interested in this issue.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7sz5xv",
                    "author": "ncef",
                    "score": 2,
                    "created_utc": 1652022594.0,
                    "response": "It's really weird,but Q3 comings:)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7szpox",
                    "author": "Brilliant_Exam_1323",
                    "score": 2,
                    "created_utc": 1652022841.0,
                    "response": "Rule of thumb just use CoinMarketCap to see true numbers over anything Coinbase says.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7rman1",
                    "author": "Kiwip0rn",
                    "score": 3,
                    "created_utc": 1651988591.0,
                    "response": "It is an irrelevant feature that should be removed.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7rmfkz",
                            "author": "GhostOfMcAfee",
                            "score": 4,
                            "created_utc": 1651988690.0,
                            "response": "I agree with you. But, clearly they don't. And, so long as it is there, it should at least be honest and based on facts.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7rlkee",
                    "author": "TheRealAstic",
                    "score": 1,
                    "created_utc": 1651988071.0,
                    "response": "it's just plain broken, it only shows me the coins that moved the LEAST as in the coins closest to 0% movement.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7rmb4n",
                            "author": "GhostOfMcAfee",
                            "score": 5,
                            "created_utc": 1651988601.0,
                            "response": "I'm interested in whether this is a deal where chains that aren't ERC 20 have been similarly pushed aside. I'm admittedly an Algo diehard, so I'm mostly noticing when u/coinbase seems to conveniently omit them. But, I would love to know from people who are fans of other tradable L1 chains if they have seen similar things happen with their chosen coin. I'm especially interested if other chains who weren't EVM compatible from the jump have seen this happen.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7rmgu2",
                                    "author": "TheRealAstic",
                                    "score": 3,
                                    "created_utc": 1651988715.0,
                                    "response": "Yeah avax was up 15% a few days ago and didn't show, but as I said it just shows me the least moving coins. \n\nAvax is EVM compatible but obviously an L1 on its own.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i7rojt7",
                                            "author": "GhostOfMcAfee",
                                            "score": 3,
                                            "created_utc": 1651990268.0,
                                            "response": "As u/No-Cash-7970 points out, they even seem to be omitting moves by BTC and ETH. It makes me suspect this isn't about picking one chain or another, but rather about pushing trading to new coins, especially low market cap ones. Disappointing and shady AF if you ask me.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i7rpkxt",
                                                    "author": "TheRealAstic",
                                                    "score": 0,
                                                    "created_utc": 1651991078.0,
                                                    "response": "Nah, no conspiracy, they’re just idiots. \n\nThey make the same amount of money either way.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i7rpsi3",
                                                            "author": "GhostOfMcAfee",
                                                            "score": 3,
                                                            "created_utc": 1651991241.0,
                                                            "response": "I'm generally a proponent of \"cockup over conspiracy\", but maths is maths. And I cannot believe that Coinbase can't do basic arithmetic. They have to be doing it for a reason.",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "i7rqcz1",
                                                            "author": "GhostOfMcAfee",
                                                            "score": 2,
                                                            "created_utc": 1651991684.0,
                                                            "response": "I will say that I'm glad it seems they aren't targeting a particular chain. The fact (assuming no bad motive) though that apparently they don't know how to do 1st grade math  . . . that's a different story. Maybe they need to graduate from doing math in crayons to something more reliable.",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "i7v7137",
                                                            "author": "Satans_finest_",
                                                            "score": 1,
                                                            "created_utc": 1652058802.0,
                                                            "response": "Idk how truly conspiratorial it would be, as it likely wouldn’t be an arrangement between various parties to act in league with one another, but it certainly wouldn’t be the first company to behave shadily in order to benefit itself. Not saying that’s what it is, but it hardly seems implausible, whereas conspiracies are virtually always far fetched. \nFurthermore, it’s not necessarily true that they make the same amount of money either way. There are absolutely some coins that are held as investments more than traded and vice versa and Coinbase makes money per transaction.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i7rmtkp",
                                            "author": "GhostOfMcAfee",
                                            "score": 2,
                                            "created_utc": 1651988966.0,
                                            "response": "Thanks. I actually was thinking of AVAX when I made the comment because I think I had noticed the discrepancy more than once before with them too. It kind of confirms my suspicions that there is favoritism going on with ERC 20 tokens. I won't speculate here as to why that may be, but it at least seems to be a trend.\n\nWould love to hear if other L1s have noticed this too.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i7rnb8l",
                                                    "author": "No-Cash-7970",
                                                    "score": 1,
                                                    "created_utc": 1651989324.0,
                                                    "response": "Based on what I see now, both Bitcoin and Ethereum have dropped more within the past 24 hours than most of the coins listed in the Top Movers list.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i7rnm36",
                                                            "author": "GhostOfMcAfee",
                                                            "score": 2,
                                                            "created_utc": 1651989550.0,
                                                            "response": "Good point. ETH -4.96%. BTC -4.09%. Yet, (as of now) Top Movers shows  two other coins at -4.51% and -3.30%.\n\nEither Coinbase can't math or they are deliberately suppressing information.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i7rkujn",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1651987566.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7senzv",
                    "author": "Putrid-Plant6723",
                    "score": 1,
                    "created_utc": 1652011871.0,
                    "response": "Top movers are the ones that are selling the most volume on CB.  Now go into your trade tab.  Slide it over to gainers. That would be the one you're looking for, but make sure you click on the see all tab so it shows them correctly.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7sfzsf",
                            "author": "No-Cash-7970",
                            "score": 3,
                            "created_utc": 1652012731.0,
                            "response": ">Top movers are the ones that are selling the most volume on CB.\n\nOk, that's fine. However, the name \"Top Movers\" is misleading. CoinBase should say its according to volume somewhere, maybe in the title. Perhaps they should even include the volume of each coin featured in the Top Movers list.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7sigyx",
                                    "author": "Putrid-Plant6723",
                                    "score": 0,
                                    "created_utc": 1652014259.0,
                                    "response": "I use coinmarketcap.com that way o can see all volumes across all platforms",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i7t46fb",
                            "author": "GhostOfMcAfee",
                            "score": 1,
                            "created_utc": 1652024815.0,
                            "response": "That seems unlikely. BTC is always the most traded coin by volume by a long long way.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7u6qjs",
                    "author": "Coin1man",
                    "score": 1,
                    "created_utc": 1652041700.0,
                    "response": "They have been doing it the entire time . This exchanges are the biggest crooks.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7utszc",
                    "author": "Pinksquirlninja",
                    "score": 1,
                    "created_utc": 1652052206.0,
                    "response": "Could have to do with 24 hr volume as well, or coinbase lets ppl pay them to favor. Idk",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7uxkwv",
                    "author": "chrisgwynne",
                    "score": 1,
                    "created_utc": 1652054095.0,
                    "response": "They shill whatever coin one of them has invested in.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7vijs1",
                    "author": "FormerCoinbaseEng",
                    "score": 1,
                    "created_utc": 1652064565.0,
                    "response": "Former Coinbase engineer here. \n\nThis is almost assuredly just a bug, no grand conspiracy here. \n\nCoinbase doesn't have a conspiracy against Algo (or any other crypto), note how others have reported this happening with their favored chain too? Also, notice how Coinbase supports Algorand staking, and not other chains (yet)? Coinbase wants Algorand and all others to succeed. There's just no benefit for CB to try to play favorites, they're _heavily_ regulated, why would they risk their licenses and their entire business on something so silly? \n\nSo, just a bug. I'm confident they'll get it fixed, don't fret.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7vzu26",
                            "author": "GhostOfMcAfee",
                            "score": 2,
                            "created_utc": 1652075382.0,
                            "response": "Did you create your profile just to comment here? Your profile is barely 1 day old and your only comments are in this thread.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7x9tpd",
                                    "author": "FormerCoinbaseEng",
                                    "score": 1,
                                    "created_utc": 1652106904.0,
                                    "response": "Yes. But I'll comment on a lot of other FUD I see in the future too",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i7vkjz8",
                    "author": "sellingwithLP",
                    "score": 1,
                    "created_utc": 1652065648.0,
                    "response": "Lol Coinbase is sus",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7wqnid",
                    "author": "Creepy-Importance-13",
                    "score": 1,
                    "created_utc": 1652097445.0,
                    "response": "Get out while you can",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7szjhu",
                    "author": "therealist11",
                    "score": 0,
                    "created_utc": 1652022765.0,
                    "response": "Go to any crypto sub Reddit and this same question is asked about every coin lol. Please, just stop. Coinbase is not working against you.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "ul2n27",
            "title": "Notes field shows my email address in a transaction",
            "url": "https://www.reddit.com/r/CoinBase/comments/ul2n27/notes_field_shows_my_email_address_in_a/",
            "author": "Fluffy_Pitch3812",
            "created_utc": 1652019328.0,
            "score": 5,
            "num_comments": 50,
            "subreddit": "CoinBase",
            "selftext": "Yesterday I sent crypto to someone's wallet using the recipient's wallet address using the coinbase app (not wallet). But the notes field has my coinable email address in it after I submitted the transaction. But I remember the field was complete empty since I did not insert any information there. but now if I go back and check the transactions history, I can't find the note with that information.\n\nAnyone has the same issue since I don't want my recipient knows my email address?",
            "stickied": false,
            "comments": [
                {
                    "id": "i7svgif",
                    "author": "RedactedRedditery",
                    "score": 2,
                    "created_utc": 1652020904.0,
                    "response": "Which coin was it? That doesn't happen with Algo",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7svmrr",
                            "author": "Fluffy_Pitch3812",
                            "score": 1,
                            "created_utc": 1652020985.0,
                            "response": "just BTC, I am quite confused",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7sw933",
                                    "author": "RedactedRedditery",
                                    "score": 1,
                                    "created_utc": 1652021271.0,
                                    "response": "Yeah that's no good",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i7tag9i",
                    "author": "cmdrshepherd1993",
                    "score": 2,
                    "created_utc": 1652027563.0,
                    "response": "Just give the wallet address then instead of your email. Problem solved. Don’t put a note, no weird stuff. You messed up.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7th8rs",
                            "author": "Fluffy_Pitch3812",
                            "score": 1,
                            "created_utc": 1652030489.0,
                            "response": "I didnt even put my email, and I left my note field empty before I made the transaction",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7thucd",
                                    "author": "cmdrshepherd1993",
                                    "score": 1,
                                    "created_utc": 1652030741.0,
                                    "response": "Well if it will ease your mind, they cannot send themselves crypto by knowing your email so it’s likely fine.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i7tiasw",
                                            "author": "Fluffy_Pitch3812",
                                            "score": 2,
                                            "created_utc": 1652030935.0,
                                            "response": "so all I did is just to send someone BTC using their wallet address without putting any other info in the coinbase app. once I made the transaction, the notes field show my coinbase email in the transaction summary. so my question is: will my receiver see the notes that showing my email address?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i7tj48d",
                                                    "author": "cmdrshepherd1993",
                                                    "score": 1,
                                                    "created_utc": 1652031288.0,
                                                    "response": "Probably not. But they’ll get the funds. Ask them if they received it. (It may show that as a reference tool to you on your side) your email confirmation is gonna have more detail usually.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i7tjh9t",
                                                            "author": "Fluffy_Pitch3812",
                                                            "score": 1,
                                                            "created_utc": 1652031447.0,
                                                            "response": "btw, he's not using coinbase app to receive the fund. so I was wondering if the notes field is just for those transactions between two coinbase accounts?",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i7tmdto",
                                                                    "author": "cmdrshepherd1993",
                                                                    "score": 2,
                                                                    "created_utc": 1652032713.0,
                                                                    "response": "Some cryptocurrencies like XLM may require a generated note tag for certain transactions to receive. Usually it won’t put anything there but sometimes it shows your email if on Coinbase as a reference. But I never had it shown to my sender unless I am sending it from email to email which can be done if it is a Coinbase to Coinbase transaction.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i7tx4jt",
                                                                            "author": "Fluffy_Pitch3812",
                                                                            "score": 1,
                                                                            "created_utc": 1652037447.0,
                                                                            "response": "so can I say it should be alright because I was using the receiver's wallet address and he's not using coinbase app to receive the fund either?",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i7tzuv4",
                                                                                    "author": "cmdrshepherd1993",
                                                                                    "score": 1,
                                                                                    "created_utc": 1652038648.0,
                                                                                    "response": "Yeah it should be okay",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i7ss47q",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1652019328.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaa61m1",
                    "author": "AsliHaiAsli",
                    "score": 1,
                    "created_utc": 1653715149.0,
                    "response": "FanStream-a decentralized livestreaming platform.Connects crypyo users together in the live streaming world and the Metaverse space.\nFeature:\n-Live to earn&See to earn\n-Create your own NFT\n-Game Center\n*Have many Big partnerships🔥🔥\nTg:https://t.me/FanStream_Official\nTw:@Fanstream_Meta",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}