{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "usuoqt",
            "title": "Coinbase Doesn't Accept VOIP Phone Numbers",
            "url": "https://www.reddit.com/r/CoinBase/comments/usuoqt/coinbase_doesnt_accept_voip_phone_numbers/",
            "author": "jbgarrison72",
            "created_utc": 1652932369.0,
            "score": 0,
            "num_comments": 73,
            "subreddit": "CoinBase",
            "selftext": "I set up my Coinbase account normally with a regular phone number, but now I don't want to keep that phone account and would rather switch to a VOIP phone number (trying to save on costs), but, trying to update my new VOIP phone number on my Coinbase Account, I am notified that VOIP #'s (like Google Voice) are not accepted.  \n\n\nSo, I'm going to have to keep paying for my very expensive phone service in order to be able to continue accessing my Coinbase account? Can we REMOVE the NECESSITY for having a phone number associated with the Coinbase account altogether? I'm not a huge fan of \"mandatory\" safety for my own good. Why don't you folks allow me the privilege of deciding how safely and securely I'd like to operate?",
            "stickied": false,
            "comments": [
                {
                    "id": "i96lpmz",
                    "author": "chillaxjj",
                    "score": 6,
                    "created_utc": 1652953185.0,
                    "response": "There are lots of financial services including many banks that won't accept VOIP numbers for security reasons. I'm not sure why you think CB should make an exception.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i97nrmq",
                            "author": "jbgarrison72",
                            "score": 1,
                            "created_utc": 1652974089.0,
                            "response": "I think all financial services should make an exception as well. That said, they are all companies, and I don't have to do business with them just like they don't have to cater to my desire for them not to \"protect me\" from my own risk tolerance.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9fb4wr",
                                    "author": "chillaxjj",
                                    "score": 1,
                                    "created_utc": 1653116530.0,
                                    "response": "I get what you are saying but like I said I'm pretty sure it's for security reasons. On the other hand there are some pretty silly things I've signed up for that wouldn't accept VOIP numbers.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9fbepe",
                                            "author": "jbgarrison72",
                                            "score": 1,
                                            "created_utc": 1653116754.0,
                                            "response": "I think 2FA is sufficient if their excuse/reason is \"security.\" I think the main reason they want \"regulated\" phone numbers is so the government (and tax authorities) can maintain control (which I didn't consent to, and neither did the US \"founding fathers\"). All the major exchanges probably live in terror that the SEC will start gunning for them if they don't proactively appease big brother.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i96l2lu",
                    "author": "fx9TMK",
                    "score": 3,
                    "created_utc": 1652952609.0,
                    "response": "How much is a phone plane where you are??",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i97ntxy",
                            "author": "jbgarrison72",
                            "score": 1,
                            "created_utc": 1652974116.0,
                            "response": "$70/month for the lowest tier service.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i97qyw4",
                                    "author": "fx9TMK",
                                    "score": 1,
                                    "created_utc": 1652975383.0,
                                    "response": "Dang. Where do you live??? That sounds like a lot for a basic plan",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i97sffl",
                                            "author": "jbgarrison72",
                                            "score": 1,
                                            "created_utc": 1652975974.0,
                                            "response": "Not really the best forum to give that info out on... too easy for the billions of scammer bots scraping this forum for Coinbase account info.\n\nBut, I was under the assumption that was a fairly common price for a single line. Most carriers only start reducing costs if you \"add lines.\"",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i97ti17",
                                                    "author": "fx9TMK",
                                                    "score": 3,
                                                    "created_utc": 1652976403.0,
                                                    "response": "My bad, didn’t mean to get too personal. Seriously sorry. I ask because if your in the USA you can get some plans as low as like 15 bucks. It’s just basic calls and barely any Internet but if it’s just to have for a number to use for CB and other things that would be worth it",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i97z4fm",
                                                            "author": "jbgarrison72",
                                                            "score": 1,
                                                            "created_utc": 1652978663.0,
                                                            "response": "Thanks, yeah, I'm looking into options for adding a line to a relative's service and then just paying them... could end up being as low as $10 that way.\n\nMy chief issue is that I feel like 2FA is enough security and I suspect that \"phone number\" requirement is simply to satisfy \"the state's\" need to track identity.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i98284i",
                                                                    "author": "literallygoated",
                                                                    "score": 1,
                                                                    "created_utc": 1652979904.0,
                                                                    "response": "Bruh they have all our info man who cares",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9853z7",
                                                                            "author": "jbgarrison72",
                                                                            "score": 1,
                                                                            "created_utc": 1652981060.0,
                                                                            "response": "I know that, but the point is one of principle. I care, and so should you. If no one cares there will be no change. If just a few people care, the impact can be significant.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i95ux79",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1652932369.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i95ve8l",
                    "author": "coinbasesupport",
                    "score": 1,
                    "created_utc": 1652932639.0,
                    "response": "Hi, there! Thank you for reaching out to us here. Can you open up a support case so that we can look into this further for you? Many thanks!\nhttps://help.coinbase.com/en/contact-us",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i95vpjh",
                            "author": "jbgarrison72",
                            "score": -3,
                            "created_utc": 1652932820.0,
                            "response": "It's a not a support issue, Coinbase doesn't allow VOIP phone numbers (like Google Voice) associated with Coinbase user accounts.  \n\n\nThis is a complaint about the policy... I'd like it changed. Requiring REGULAR phone numbers associated with Coinbase user accounts is a \"hardship\" for people who cannot afford to maintain regular phone service.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i97ivie",
                    "author": "Rad_Herring",
                    "score": 1,
                    "created_utc": 1652972051.0,
                    "response": "Scammy",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i97nvyd",
                            "author": "jbgarrison72",
                            "score": 1,
                            "created_utc": 1652974139.0,
                            "response": "What's scammy?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i986kga",
                                    "author": "Rad_Herring",
                                    "score": 1,
                                    "created_utc": 1652981649.0,
                                    "response": "Because VOIP is commonly used by criminal gangs and scammers who don't want to sign up to a fixed line contract or a cell contract. In addition to that they can number spoof and geo spoof. Your active phone number is part of identifying you as being from a particular country or region.\n\nThe more you make a fuss about it and not just do what normal people do and get a government regulated phone number attached to your name, the more of a scammer you look to everyone else, hence the massive backlash against you here.\n\n99.999% of people would simply add a cell number or fixed line number. If you claim not to have one, have access to one, and refuse to use one, and having been told by coinbase that you need one, then there's fuck all you can do here by throwing a temper tantrum like an angsty teen who's doing shady things behind his parent's backs.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i989xm9",
                                            "author": "jbgarrison72",
                                            "score": 0,
                                            "created_utc": 1652982997.0,
                                            "response": "\"Do what normal people do\"\n\nWhat, roll over for corrupt governments (the REAL criminals) that abuse their overstepped authority to restrict, limit and surveil populations for the benefit of their global-banking-cabal beneficiaries?\n\nsmh  \n\n\nEDIT: you edited your post, so, you think I am throwing a temper tantrum? You misread tone ...badly. I'm over 40 and happy to have people respond with nonsense like yours to boost this concern.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i98a1vz",
                                                    "author": "Rad_Herring",
                                                    "score": 1,
                                                    "created_utc": 1652983045.0,
                                                    "response": "You asked and I told you why.\n\nOff you fuck.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i98acud",
                                                            "author": "jbgarrison72",
                                                            "score": 1,
                                                            "created_utc": 1652983170.0,
                                                            "response": "Is this what you do on Reddit all day?",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iaj9041",
                    "author": "vhogciguc",
                    "score": 1,
                    "created_utc": 1653910989.0,
                    "response": "Check out #AstroBirdz. Big things happening with this project with release of marketplace and N.E.S.T. (NFT Energizing Space Terminal). Load up now or #FOMO in later. Your choice!\n\n @astro_birdz #birdzarmy \n #luna #BTC #web3 #gem\n #NFT #NFTCommunity \n https://t.me/AstroBirdzOfficial",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}