{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ushx6w",
            "title": "IDEX COIN PROFITABLE IN CRYPTO CRASH",
            "url": "https://youtu.be/BePoXpK8V8A",
            "author": "cryptosardarg",
            "created_utc": 1652894336.0,
            "score": 0,
            "num_comments": 1,
            "subreddit": "CoinBase",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i93hf2p",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1652894336.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "ushxc1",
            "title": "Seeking advice for CB vs CB Wallet...",
            "url": "https://www.reddit.com/r/CoinBase/comments/ushxc1/seeking_advice_for_cb_vs_cb_wallet/",
            "author": "MutterderKartoffel",
            "created_utc": 1652894347.0,
            "score": 0,
            "num_comments": 11,
            "subreddit": "CoinBase",
            "selftext": "So I'm new to this and had a horrendous time trying to figure things out. If you need or want the details, you can ask. But needless to say, I have USDT in my CB Wallet. I need it to be ETH. I don't have much wiggle room financially, so I need the cheapest way to swap currencies. \n\nShould I swap inside the wallet or move it to CB to trade? \n\nI know it will cost something to move to CB (so not cool!), but does it cost less to trade on CB than to swap in wallet? (Enough to make it worth it)",
            "stickied": false,
            "comments": [
                {
                    "id": "i94c381",
                    "author": "Kiwip0rn",
                    "score": 2,
                    "created_utc": 1652906790.0,
                    "response": "If you are new... DON'T use the CB Wallet; ever, until you have some experience in Crypto, and have some need to play in DeFi\n\nI have had my regular Coinbase Custody account since 2014 and have the CB Wallet with a couple bucks in it from signing up for it and never used it again and too lazy to delete it off my phone.\n\nLeave your stuff in Coinbase Custody until you have an uncomfortable amount (value) in it (or above the Fake FDIC insurance). Only then consider Hot Wallets and Cold Wallets (or better yet open a Coinbase account in spouses name then you have another 250K).\n\nIf you feel a need to play in DeFi, get a Algorand Wallet and play in their DeFI to learn it (or ADA, Cosmos/ATOM) something far less expensive to learn DeFi before playing in Ethereum's Ecosystem.\n\nAll I can say is Send the ETH over for the Gas to remove the coins, or just leave the coins until ETH2.0 in hoping that the fees become better.\n\nDO NOT get caught up in the \"Not Your Keys, Not Your Crypto\" BS; or the new stupid \"Coinbase is going bankrupt\" BS. Leave your coins on the regular Coinbase Custody app. If you \"need\" a Wallet for some reason, perticularly for longer term storage or to maintain your account below the insurance amount buy a Ledger Wallet.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i94ybin",
                            "author": "marvinrabbit",
                            "score": 1,
                            "created_utc": 1652916564.0,
                            "response": "Just as an aside, there is zero FDIC insurance on anything besides USD. Not even USDC. Not on anything crypto. For crypto, Coinbase says there is private \"insurance\" against certain situations.\n\nEdit: down voting doesn't mean that it IS covered. \"Cryptocurrency, (including but not limited to tokens such as bitcoin, litecoin and ethereum, and stablecoins such as USDC), is not subject to Federal Deposit Insurance Corporation (“FDIC”)\"  -- https://help.coinbase.com/en/coinbase/other-topics/legal-policies/how-is-coinbase-insured",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i94hsno",
                            "author": "MutterderKartoffel",
                            "score": 1,
                            "created_utc": 1652909191.0,
                            "response": "Thank you! Does that mean it really is that expensive comparatively to swap inside the wallet?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i94jtz4",
                                    "author": "Kiwip0rn",
                                    "score": 1,
                                    "created_utc": 1652910066.0,
                                    "response": "Yes... but it is perspective, you cannot get some coins on Coinbase Pro and/or Coinbase Custody. The wallet you can swap for any Ethereum based token/Shitcoin.\n\nBut look at the complaints on this Reddit page and other Redit pages. Most are wallet scams, they clicked on something stupid and had their Hot Wallet drained. I even had my Atomic Wallet taken by a scammer and I watched it get drained of ~$6,000 in real time. The scammers can be very convincing and there is NOTHING you can do afterwards.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i93hg2e",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1652894347.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i94yyq4",
                    "author": "RubyFriday666",
                    "score": 0,
                    "created_utc": 1652916866.0,
                    "response": "I would not bother with Coinbase at all. The only reliable and consistent quality they possess is the fact that they're rarely reliable and consistent. If you like giving your money to a corporation who uses it to make billions while making tons of excuses as to why they can't let you have access to it, then Coinbase is for sure the way to go. If that's not the case, there are literally a dozen more trustworthy exchanges with better fee structures and explicit policies that don't change with the wind.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i952ti1",
                            "author": "MutterderKartoffel",
                            "score": 1,
                            "created_utc": 1652918700.0,
                            "response": "That's good to know. I wasn't trying to get into crypto at all, but I've had to by necessity. I tried to find the best platform and coinbase came up on multiple reviews as being good except for their customer service. Can you tell me what some good ones are? (I can't do Binance because I can't verify my ID using Jumio because it refuses to take a clear picture).",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}