{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uy73ih",
            "title": "Two week hold",
            "url": "https://www.reddit.com/r/CoinBase/comments/uy73ih/two_week_hold/",
            "author": "JRP__1994__Random",
            "created_utc": 1653570033.0,
            "score": 2,
            "num_comments": 3,
            "subreddit": "CoinBase",
            "selftext": "Spoke to support today. I only make small transactions on a very limited basis. This is not my first time trading or purchasing crypto with an attached bank account. The funds have cleared from my bank and now I have a hold on the eth I purchased until 5/31/22. This really seems odd to me as the support rep stated that hold times are factored in for possible bank reversals (which i have never processed) and the \"riskiness\" of the account (I've made maybe 10 transactions in the past year). Last time it took three days for the money to clear and i had access to move my crypto to my wallet. With the way eth just dumped it seems suspect to hold a persons crypto for two weeks before allowing moving it off exchange and or swapping it.",
            "stickied": false,
            "comments": [
                {
                    "id": "ia266l1",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653570033.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia27kf9",
                    "author": "gold4829",
                    "score": 1,
                    "created_utc": 1653570710.0,
                    "response": "I agree, these clowns putting these long holds are killing themselfs.  I personally have a 10 day hold for only 1k just to use for thier coinbase debit card.  And heres the kicker, I have more than that sitting on the exchange as collateral.  \n\nI have see these clowns go as high as 14 day hold.  \n\nHeres a tip, you can actually see the hold time before hitting the submit button.  If you dont like the time, you can not go through with it.  I had no choice as 10 days was the best I could get.   \n\nI swear these jokers have a liquidity problem and the reason for such long hold times.   The interest they are making on the float should be illegal.  Every time I do a transfer, these coinbase jokers pull the money from my bank within hours or that evening at the latest.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia28g4a",
                            "author": "JRP__1994__Random",
                            "score": 1,
                            "created_utc": 1653571134.0,
                            "response": "I'm also confused about support, as soon as i posted this 3 coinbase \"support users\" popped up in my messages. Could i trust that.....no..... one stated that they already had my account information....no you dont......so possible spam attacks as well?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}