{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uztxwx",
            "title": "I'm starting to become very leery trading on this platform.",
            "url": "https://www.reddit.com/r/CoinBase/comments/uztxwx/im_starting_to_become_very_leery_trading_on_this/",
            "author": "conker816",
            "created_utc": 1653764807.0,
            "score": 1,
            "num_comments": 11,
            "subreddit": "CoinBase",
            "selftext": "So I've been trading for a little over a year now. I've used several exchanges such as voyager, coinbase and coinbase pro, kraken, and such. My issue is that with each passing month this platform is becoming increasingly unstable and unreliable. There are several errors that happen on a weekly and sometimes daily basis. My bigger issue is that they are a publicly traded company, and yet management has not improved. My long standing issue is the iotx erc 20 and no answer on that either. I have a feeling that if things don't massively improve soon I will be leaving the platform. I had high hopes but this isn't looking good. I understand we are in a bear market. I understand this is new technology. But this is also getting a bit ridiculous.",
            "stickied": false,
            "comments": [
                {
                    "id": "iacddyc",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653764807.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iacdw29",
                    "author": "darkness7315",
                    "score": 1,
                    "created_utc": 1653765046.0,
                    "response": "Don’t go to Crypto.com they’re even worse",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iacefy5",
                    "author": "coinbasesupport",
                    "score": 1,
                    "created_utc": 1653765306.0,
                    "response": "Hey Conker, Apologies for your IOTX issue. Do you have a case# for us to investigate further?  If not, can you please make a case here, so we can look into your issue further:\n\nhttps://help.coinbase.com/en/contact-us",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iachdac",
                            "author": "cryptotraderinwork",
                            "score": 1,
                            "created_utc": 1653766668.0,
                            "response": "You don't help when a user sends an unsupported erc-20 token or uses the wrong network, while other exchanges DO help. Your support is horrible and the worst I ever experienced. Good luck reaching mass adaption",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iacf3qb",
                            "author": "conker816",
                            "score": 0,
                            "created_utc": 1653765618.0,
                            "response": "I already talked to your staff. They have no answer.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iachb70",
                                    "author": "coinbasesupport",
                                    "score": 1,
                                    "created_utc": 1653766641.0,
                                    "response": "Happy to follow up on any IOTX issue you have raised in the past. Please do let us know if we can provide some additional information or support with any of those cases.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "iacizcl",
                                    "author": "veyron1775",
                                    "score": 1,
                                    "created_utc": 1653767459.0,
                                    "response": "Choosing not to get as much support as you can get if they’re willing to help doesn’t help your case",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iacgpjp",
                    "author": "thatisquality",
                    "score": 1,
                    "created_utc": 1653766357.0,
                    "response": "Personally Kraken for me has been 100% smooth sailing. That being  said I buy and hold for the long term, no day trading. There is more to them than being an exchange, I believe they also stress test hardware and software for security purposes and help develop fixes... cant remember where I read it, but that was one of the reasons I trust them.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaci8p6",
                            "author": "cryptotraderinwork",
                            "score": 1,
                            "created_utc": 1653767094.0,
                            "response": ">Don't use coinbase, they will not help you when you send an unsupported erc-20 token or use the wrong network. Other exchanges do help you in these cases.\n\nWell done, well done. Don't use coinbase, never.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iach8ao",
                    "author": "cryptotraderinwork",
                    "score": 1,
                    "created_utc": 1653766602.0,
                    "response": "Don't use coinbase, they will not help you when you send an unsupported erc-20 token or use the wrong network. Other exchanges do help you in these cases.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}