{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uyj8lc",
            "title": "No news on compliance review",
            "url": "https://www.reddit.com/r/CoinBase/comments/uyj8lc/no_news_on_compliance_review/",
            "author": "Max35111",
            "created_utc": 1653603992.0,
            "score": 2,
            "num_comments": 43,
            "subreddit": "CoinBase",
            "selftext": "Hello,\n\nMy account got flagged for compliance review and I provided all the necessary documents 3 weeks ago.\n\nI haven't heard anything despite many emails asking. I called the help desk yesterday, got put on hold for 20 minutes to be told I will receive an email with the status. Email that I of course haven't received\n\nWhat is the the timeline for these compliance check? I had one with révolut and it was sorted literraly within 24 hours.\n\nThanks\n\nref:_00D6A2G0qc._5003sZG5VD:ref\nI think case number 10919268",
            "stickied": false,
            "comments": [
                {
                    "id": "ia4njvb",
                    "author": "MtMtMt97",
                    "score": 2,
                    "created_utc": 1653607855.0,
                    "response": "Good luck buddy. My account was flagged and frozen since january even although I provided requested information. They don't even answer.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia4p157",
                            "author": "coinbasesupport",
                            "score": 1,
                            "created_utc": 1653608560.0,
                            "response": "Hi u/MtMtMt97, we are very sorry to hear about your negative experience and would like to help. If you would share your case number with us, that will allow us to investigate why you didn't hear back from us after providing the requested information. Thank you",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia4pcw3",
                                    "author": "MtMtMt97",
                                    "score": 1,
                                    "created_utc": 1653608719.0,
                                    "response": "Case number is #07961877",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia4qo9i",
                                            "author": "coinbasesupport",
                                            "score": 1,
                                            "created_utc": 1653609366.0,
                                            "response": "Thanks for the follow-up to you case! We have sent a follow-up to the concerned team to check on the status of your account. Please expect an email update from the team soon. Appreciate your patience as always.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia4fdty",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653603992.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia4g72q",
                    "author": "coinbasesupport",
                    "score": 1,
                    "created_utc": 1653604372.0,
                    "response": "Hey Max! Looks like you just had an update from the specialists in relation to case 10919268.  Can you review your inbox and respond to the email, please?  Thank you!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia5vygt",
                            "author": "Max35111",
                            "score": 1,
                            "created_utc": 1653631891.0,
                            "response": "Thanks for the feedback.\nThat said I have received the exact same email and already sent all the documents you request in the email sent today. It would be useful to understand why you need to see my payslips again, and my source of funds again. Or if you need anything different from what I already sent\nThanks",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia5y24a",
                                    "author": "coinbasesupport",
                                    "score": 1,
                                    "created_utc": 1653633486.0,
                                    "response": "Please know that our compliance team may require information from you based on its relevance to the verification of your account. It is best that you also direct your follow-ups if you are not able to provide the information they requested. Thank you!",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia65ujn",
                                            "author": "Max35111",
                                            "score": 1,
                                            "created_utc": 1653640217.0,
                                            "response": "What do you mean by: \"it is best that you also direct your follow ups if you are not able to provide the info requested\"\n\nI did provide everything already. Is it possible to talk on the phone with someone ?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia67vkc",
                                                    "author": "coinbasesupport",
                                                    "score": 1,
                                                    "created_utc": 1653642056.0,
                                                    "response": "Thanks for getting back to us, u/Max35111.\n\nSorry for any confusion here! To clarify, we mean that if you have any questions about your ongoing case, it's best you direct these to your case by replying to the support email. Once you do so, our team will be able to view your questions/feedback and any other info you provide, and get back to you on that.\n\nHope this helps to clear things up!",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iabxw2u",
                                                            "author": "Max35111",
                                                            "score": 1,
                                                            "created_utc": 1653757379.0,
                                                            "response": "Hello, i just answered the email and sent back the documents.   \nPlease can you push for a quick answer as my account has been blocked for months now.\n\nthanks!",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "iac14k0",
                                                                    "author": "coinbasesupport",
                                                                    "score": 1,
                                                                    "created_utc": 1653758897.0,
                                                                    "response": "Thank you, we have received your email response. While we cannot push for an accelerated reply, our specialists will be in touch as soon as possible. Thank you for your understanding.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}