{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uvqhkj",
            "title": "New to crypto, pls help",
            "url": "https://www.reddit.com/r/CoinBase/comments/uvqhkj/new_to_crypto_pls_help/",
            "author": "ebbbandflow",
            "created_utc": 1653274082.0,
            "score": 2,
            "num_comments": 37,
            "subreddit": "CoinBase",
            "selftext": "I have never been into crypto until I had to use Skrill to receive money, I was only allowed to withdraw my money into a crypto wallet so I made a Coinbase account. If there’s anyone who can help me, idk what I’m doing AT ALL. I just bought $10 worth of bitcoin and have $27 worth of ethereum. If anyone has any helpful resources/general tips pls let me know thanks!!!!",
            "stickied": false,
            "comments": [
                {
                    "id": "i9n3muz",
                    "author": "Royal-Author-669",
                    "score": 19,
                    "created_utc": 1653275371.0,
                    "response": "Don't click on any links and ignore all DM's claiming they can help. or asking if you need help. They are most likely but probably most definitely scammers.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9n42dm",
                            "author": "1HappyGuy1",
                            "score": 9,
                            "created_utc": 1653275612.0,
                            "response": "This ^",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9ndim2",
                    "author": "MadThad762",
                    "score": 4,
                    "created_utc": 1653281287.0,
                    "response": "If you plan on buying more, use the coinbase pro app or the advanced trading section of the coinbase website. You will save a small fortune in fees. And like someone else said, never talk to people who message you. It’s always a scam.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9n2ch7",
                    "author": "superfooly",
                    "score": 7,
                    "created_utc": 1653274682.0,
                    "response": "Only buy bitcoin and ethereum. Don’t listen to anyone, do your own research etc",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9n1dnz",
                    "author": "maryupallnight",
                    "score": 2,
                    "created_utc": 1653274169.0,
                    "response": "Is that a lot of money for you?\n\nIf you lost it would it hurt?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9pdyiw",
                            "author": "TradingwithGreg",
                            "score": 2,
                            "created_utc": 1653326074.0,
                            "response": "$37.00!!? 😆  😂",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9qmzlz",
                                    "author": "One8s7n",
                                    "score": -1,
                                    "created_utc": 1653345816.0,
                                    "response": "37 is a week or 2 worth of food for some people. Or the gas for work for the week! Or the Roxy 30 for fun",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9n1t07",
                            "author": "ebbbandflow",
                            "score": 1,
                            "created_utc": 1653274392.0,
                            "response": "It doesn’t hurt, I just don’t know anything about how to increase that amount",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9n49qb",
                                    "author": "Royal-Author-669",
                                    "score": 3,
                                    "created_utc": 1653275725.0,
                                    "response": "Look into Dollar Cost Average (DCA)\nAlso you may want to look into buying from exchanges and then transferring into your wallet.\nI use Coinbase and Gemini, but do your own research (DYOR). I'm leaning away from coinbase because I'm liking Gemini better. You may also want to check out Binance.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9n1yzs",
                    "author": "coinbasesupport",
                    "score": 2,
                    "created_utc": 1653274482.0,
                    "response": "Hi, u/ebbbandflow! Help is here! You'll be able to find several resources from the link below that you may read through. You may also click on \"help\" at the top left of the page for you to go back to the main screen of the help page. Hope this helps! \n\nhttps://help.coinbase.com/en/coinbase/trading-and-funding#buying-selling-or-converting-crypto",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9n9cv5",
                    "author": "Beepbeep1976",
                    "score": 3,
                    "created_utc": 1653278616.0,
                    "response": "Either stake your ETH with Coinbase or transfer it to Haru Invest. You'll earn additonal ETH from interest (3.68% on Coinbase or up to 14% on Haru). Can also put your BTC on Haru. But like others have said, stick to ETH and BTC only, dollar cost average if you plan on continuing to buy and plan on holding for a few years no matter what. Don't buy the FUD BS the media pushes, stay strong during these big drops and honestly, Binance has way lower fees for buying/selling. Always turn on 2FA for all your accounts and never click links or believe airdrop phishing scams",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9n17kx",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653274082.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9n2lre",
                    "author": "deekayyyyy",
                    "score": 1,
                    "created_utc": 1653274818.0,
                    "response": "If you want to withdraw: You would have to add a payment method or bank account to your coinbase account. Then sell the bitcoin and Eth which converts it to US dollars, which you can then cash out to your bank account. \nIf you want to keep adding/investing: Do your research on a coin/project you believe in, and then buy!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9n8sl5",
                    "author": "sirp1nky",
                    "score": 1,
                    "created_utc": 1653278275.0,
                    "response": "If you plan to hold long term their value will go up. You might wanna find some app that you can stake these coins and earn interest and just don’t touch them for a while.\n\nIf you are asking for advice on investing more - can’t help you there and anyone one who claim they can - I wouldn’t trust. People recommend coins they invest in in the hope to create a buzz and increase their value. Do your own research is the only advice.\n\nGood luck.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9no6g1",
                    "author": "WembleyTunz",
                    "score": 1,
                    "created_utc": 1653289288.0,
                    "response": "As a newbie, there's no need to rush into anything, you can visit Bitay platform, they've got an academy where you can learn about trading and crypto in general and start earning convininently on thier platform. They have got NFT stream ongoing now and it's an amazing one actually.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9o0fuv",
                    "author": "guywithmochi",
                    "score": 1,
                    "created_utc": 1653300488.0,
                    "response": "Before even purchasing crypto you should do some research. I suggest researching cold storage, wallets, seed phrases and crypto itself followed by crypto scams. It will not take long, take half a day and just research. Don't answer any Dms. Only invest what you can afford to lose. Good luck.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9otsdm",
                    "author": "BiochemBeer",
                    "score": 1,
                    "created_utc": 1653317531.0,
                    "response": "Just leave it be (aka HODL) for a few years - watch it go up and down several times. It's a long game.  Cash out when you need to.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9p52hf",
                    "author": "FunSand1063",
                    "score": 1,
                    "created_utc": 1653322361.0,
                    "response": "hello everyone, need an advice for short term trading. I was approched by 3 different people on an online chat room where they have offered help in learning scalping and they asked me to trade along with them. They said, its about helping me in understanding concepts by doing live trade and invest small amount. I am aware that these people could be scammer. But then, there was one person who credited into my account x number of usdt to start with short term trading. I did traded with the person and made 4x profit. It appears lucrative to me when a person lend me money and multiply Profits at a high number. My question here is, how scammer work their way out? when they help and maybe in future they scam!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9nuqvi",
                    "author": "RawDick",
                    "score": -1,
                    "created_utc": 1653295283.0,
                    "response": "First rule of crypto: fuck coinbase.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}