{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ukuwk7",
            "title": "Why does Coinbase Top Movers seem to consistently omit Algorand?",
            "url": "https://www.reddit.com/r/CoinBase/comments/ukuwk7/why_does_coinbase_top_movers_seem_to_consistently/",
            "author": "GhostOfMcAfee",
            "created_utc": 1651987566.0,
            "score": 82,
            "num_comments": 73,
            "subreddit": "CoinBase",
            "selftext": "This is not a fluke. It has happened multiple times in the past month.  As of writing, $ALGO is up 5.37%, yet Coinbase lists the \"Top Mover\" as some random coin called $SUKU at 2.25%. Earlier today, $ALGO was up even higher, way more than others were either up or down. Yesterday was the same. Last week when the $ALGO deal with FIFA was announced, it was up 13% while others were down, and the percentages for the top movers (both up and down) were in the low single digits. I recall a similar instance back in February where $ALGO pumped hard against the market, yet, despite clearly having the highest movement against tradable coins on Coinbase, it was nowhere to be found in the Top Movers list.\n\nI don't trade or make decisions based on the Top Mover list, nor do I think anyone else should. But, I find it deeply concerning that Coinbase seems to be putting their fingers on the scales here. I have many gripes with Coinbase that are even more concerning (\\*ahem\\* apparent insider trading on coins that are about to be listed \\*ahem\\*), but this is also another one.\n\nBut, seriously Coinbase, how is it that the top moving tradable coin doesn't actually show up as a Top Mover? Are you bad at maths and don't realize 13% > 4%? Is your algorithm busted? Or are you, unbeknownst to your customers, trying to pick winners and losers and move the market to your benefit?",
            "stickied": false,
            "comments": [
                {
                    "id": "i7rubpr",
                    "author": "SPCE_VIRGIN",
                    "score": 11,
                    "created_utc": 1651994895.0,
                    "response": "Happens too often to be by chance. Malicious and i wouldnt be surprised if Coinbase gets sued",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7rr547",
                    "author": "daveydog24",
                    "score": 11,
                    "created_utc": 1651992299.0,
                    "response": "I didn’t see any news about the developer grants or the FIFA deal either",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7rriwv",
                            "author": "GhostOfMcAfee",
                            "score": 9,
                            "created_utc": 1651992601.0,
                            "response": "That was sus. It seems like a partnership with the biggest sports league in the world would at least get mentioned. But, at least with that, I can understand that there is a bit of editorial license. The Top Mover thing is baffling though. It's just maths (or at least if you are being honest, it should be). Maths is cold and uncaring. It just is what it is. When I start seeing people and companies try to play games with and hide it, my alarm bells go off.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7rx2nv",
                    "author": "No-Cash-7970",
                    "score": 28,
                    "created_utc": 1651997208.0,
                    "response": "I think the Top Movers list is curated somehow. If it is curated, CoinBase should disclose that fact or chose a name for the list, like \"Chosen Top Movers\" or \"Movers Spotlight\",  that makes it more apparent that the list is curated.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7rxnog",
                            "author": "GhostOfMcAfee",
                            "score": 15,
                            "created_utc": 1651997723.0,
                            "response": "Exactly my thoughts. My problem is that they are portraying this as a simple maths thing, when, it seems to be a wholly curated one. It's like Bloomberg telling you \"wow, the biggest gainer on NYSE was some random small cap stock which jumped 4%\" when in reality a big cap stock like Apple jumped 13%.\n\nI like maths. It is cold and uncaring. It doesn't care about your feelings. It just exists. Don't pretend to do maths when you are really engaging in editorialism. It is untrustworthy and deceptive.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7sgdks",
                                    "author": "ChrisR109",
                                    "score": 4,
                                    "created_utc": 1652012977.0,
                                    "response": "Are they using common core math?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i7rvw2a",
                    "author": "unknownstranger2",
                    "score": 7,
                    "created_utc": 1651996192.0,
                    "response": "I've noticed this as well.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7rycrd",
                    "author": "PullUpSkuurt",
                    "score": 7,
                    "created_utc": 1651998332.0,
                    "response": "How is this possible? Work on it Coinbase",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7s23w2",
                    "author": "GhostOfMcAfee",
                    "score": 6,
                    "created_utc": 1652001647.0,
                    "response": "dear u/coinbasesupport, why are you not answering? [https://imgur.com/a/e4PFm9i](https://imgur.com/a/e4PFm9i)\n\nlol\n\nPlease do your best to ban u/CustomerSupport-46 and their associated IP. When done, please focus on fixing your busted algorithm that doesn't know how to do simple maths.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7ryqvv",
                    "author": "Hot-Consideration469",
                    "score": 8,
                    "created_utc": 1651998682.0,
                    "response": "Coinbase knows what they are doing. They are a biased entity doing favour to some coins at the expense of the others. That's FRAUDULENT",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7screl",
                            "author": "puddlesofmustard",
                            "score": 3,
                            "created_utc": 1652010566.0,
                            "response": "I hear those ADA folk are salty af.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7rlkun",
                    "author": "GhostOfMcAfee",
                    "score": 6,
                    "created_utc": 1651988080.0,
                    "response": "Also a similar time happened in early January.  I'm sure there are other instances. I'm just going based on my recollection. The point is, this is not a fluke. And, the maths is undeniable. Something is wrong here.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7s0gsa",
                    "author": "GhostOfMcAfee",
                    "score": 7,
                    "created_utc": 1652000182.0,
                    "response": "FYI. Folks from other chains should read and think before downvoting. This has transformed from a post about an Algo guy wondering why Algo gets omitted to a question about why many other chains apparently suffer the same thing. This is no longer a chain specific issue. It is a question of why Coinbase cannot be expected to do basic arithmetic for any chain. All L1s should be interested in this issue.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7rman1",
                    "author": "Kiwip0rn",
                    "score": 3,
                    "created_utc": 1651988591.0,
                    "response": "It is an irrelevant feature that should be removed.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7rmfkz",
                            "author": "GhostOfMcAfee",
                            "score": 3,
                            "created_utc": 1651988690.0,
                            "response": "I agree with you. But, clearly they don't. And, so long as it is there, it should at least be honest and based on facts.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "ul2n27",
            "title": "Notes field shows my email address in a transaction",
            "url": "https://www.reddit.com/r/CoinBase/comments/ul2n27/notes_field_shows_my_email_address_in_a/",
            "author": "Fluffy_Pitch3812",
            "created_utc": 1652019328.0,
            "score": 5,
            "num_comments": 29,
            "subreddit": "CoinBase",
            "selftext": "Yesterday I sent crypto to someone's wallet using the recipient's wallet address using the coinbase app (not wallet). But the notes field has my coinable email address in it after I submitted the transaction. But I remember the field was complete empty since I did not insert any information there. but now if I go back and check the transactions history, I can't find the note with that information.\n\nAnyone has the same issue since I don't want my recipient knows my email address?",
            "stickied": false,
            "comments": []
        }
    ]
}