{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "80rrm4",
            "title": "Check your bank statements carefully for refunds",
            "url": "https://www.reddit.com/r/CoinBase/comments/80rrm4/check_your_bank_statements_carefully_for_refunds/",
            "author": "Mr_Evil_Guy",
            "created_utc": 1519778548.0,
            "score": 1,
            "num_comments": 1,
            "subreddit": "CoinBase",
            "selftext": "Hi, I've seen a lot of posts about the Coinbase double-charging issue, and thought I would add my two cents.  \n\nLast week I deposited $150 to my Coinbase account over several days, but today I noticed an extra $50 charge that seemed to come out of nowhere.  My first thought was that I was the newest victim of the Coinbase \"glitch\" (more like temporarily borrowing people's money without permission, still shady as hell) and I would need to beg for a refund. \n\nI contacted my bank who informed me that Coinbase actually did refund the money the same day it was withdrawn, but they didn't use an account with Coinbase in the name.  The erroneous charge went to an account called **Coinbase Trav Fu Cheapside** but I was refunded by **ATM Adjustment Credit** or something like that.  My bank confirmed that this was a refund from Coinbase (apparently USAA has a file on Coinbase due to the number of complaints lol).\n\nMy points is, if you see double charges from Coinbase make sure you look for refunds from NON-COINBASE accounts.       ",
            "stickied": false,
            "comments": [
                {
                    "id": "duxp5kb",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1519778549.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum. If you’re experiencing an issue with your Coinbase account, please [contact us](https://support.coinbase.com/) directly. If your post is about a specific issue, please be sure to include your support ticket's case number.\n\nYou should only trust [verified Coinbase staff](https://support.coinbase.com/customer/en/portal/articles/1766604). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}