{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ux2px2",
            "title": "I think I got scammed And I can’t move my funds",
            "url": "https://www.reddit.com/r/CoinBase/comments/ux2px2/i_think_i_got_scammed_and_i_cant_move_my_funds/",
            "author": "JoeyJ008",
            "created_utc": 1653430986.0,
            "score": 1,
            "num_comments": 21,
            "subreddit": "CoinBase",
            "selftext": "Hello \nHere’s what happened.  I invested in a crypto mining company and when it was time to pay my profits, I was forced to sign up for Coinbase Wallet and the profits were deposited into my wallet.  When I tried to send ETH to my regular crypto wallet the transaction is only pending and will not move from my coinbase wallet.  Then I received a message from someone telling me I needed to $5000 for a 16 digit pin (private key) in order to have access to my funds. I know my wallet already comes with a private key. But I do not have access to my funds without paying this person thousands of dollars who claims the work for coinbase.  Can you help me please ?",
            "stickied": false,
            "comments": [
                {
                    "id": "i9vdqj1",
                    "author": "Tall_Run_2814",
                    "score": 7,
                    "created_utc": 1653436153.0,
                    "response": "You got scammed.  Consider what you paid lost.  If you pay them the 5k you still won't get your money back. \n\nFor future note...\"crypto mining companies\" are BS.  If you want to mine crypto you buy a machine and plug it into a wall.  \n\nAlso, don't ever give anyone your seed phrase or send money to a wallet whose seed phrase you do not control.  Whoever has the seed to the account is the owner of the account.  \n\nYou got scammed, learn from your mistake, cut your losses and move on.  Anyone claiming they can assist is just another con artist attempting to scam you further",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9v44zl",
                    "author": "YuriyNigmatylinvkh",
                    "score": 2,
                    "created_utc": 1653431673.0,
                    "response": "Scam",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9v57nb",
                            "author": "JoeyJ008",
                            "score": 0,
                            "created_utc": 1653432161.0,
                            "response": "Even if it is showing a balance in my coinbase wallet ?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9v5mwd",
                                    "author": "YuriyNigmatylinvkh",
                                    "score": 2,
                                    "created_utc": 1653432356.0,
                                    "response": "Clear cache and refresh",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9v7zha",
                                            "author": "JoeyJ008",
                                            "score": 0,
                                            "created_utc": 1653433447.0,
                                            "response": "I don’t understand",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9w0vfb",
                                                    "author": "YuriyNigmatylinvkh",
                                                    "score": 2,
                                                    "created_utc": 1653447147.0,
                                                    "response": "Resolved now?",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9vartd",
                    "author": "FoamyTransmission",
                    "score": 2,
                    "created_utc": 1653434759.0,
                    "response": "It’s fake eth mate. It won’t move and don’t try sending money to anyone",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9vb3vh",
                            "author": "JoeyJ008",
                            "score": 0,
                            "created_utc": 1653434919.0,
                            "response": "It’s Called Ropsten Etherium? \nSo they just deposited fake coins into my wallet to make it look like I made a profit ?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9w418o",
                                    "author": "Kiwip0rn",
                                    "score": 1,
                                    "created_utc": 1653448732.0,
                                    "response": "Yep",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9v2mkx",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653430986.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9v3wgz",
                    "author": "coinbasesupport",
                    "score": 1,
                    "created_utc": 1653431563.0,
                    "response": "This is a scam, as far as we can tell from what is written. Do not share your private key or login details with anyone, and please disengage any contact with them. Also, please see our article on how to avoid such scams in the future here - https://help.coinbase.com/en/coinbase/privacy-and-security/avoiding-phishing-and-scams/avoiding-cryptocurrency-scams. We are saddened to hear what's occurred and stress to not engage further with said user.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9v4zau",
                            "author": "JoeyJ008",
                            "score": 1,
                            "created_utc": 1653432057.0,
                            "response": "I never shared my 12 phrases with them.  I’m not trying to be nieve, but how is it showing that the funds are in my coinbase wallet?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9v8wy6",
                                    "author": "lunar_tardigrade",
                                    "score": 1,
                                    "created_utc": 1653433882.0,
                                    "response": "Sounds like you legit got some coin in your wallet, and someone trying to scam you.  The holdup is probably unrelated.. like not enough gas or something.... that scammer just notice you having a holdup and trying to come up.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9vafdb",
                                            "author": "JoeyJ008",
                                            "score": 1,
                                            "created_utc": 1653434598.0,
                                            "response": "Oh no way …..so how does that work …..because it seems like there’s enough ETH in my coinbase wallet to cover transactions",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9vbg3e",
                                                    "author": "coinbasesupport",
                                                    "score": 1,
                                                    "created_utc": 1653435076.0,
                                                    "response": "Hi, u/JoeyJ008! You've mentioned from the start that your transfer/transaction is still showing, right? We understand that someone is asking you to pay some amount for you to get access to your account which is straight scam. We'd like to take a closer look at your account and the transaction you were referring to as pending. Please raise a support ticket with us from the below link, and an agent will be able to assist you! Thanks!\n\nhttps://help.coinbase.com/en/contact-us",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9vehhg",
                                                            "author": "JoeyJ008",
                                                            "score": 1,
                                                            "created_utc": 1653436509.0,
                                                            "response": "Ok I filled out the ticket.  How is it possible that I create a wallet with coinbase, and it appears that someone sends me funds to the wallet, but then I can move them out of the wallet ……I’m the only one that has access to the private key and phrases of the wallet",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9veipm",
                                                                    "author": "JoeyJ008",
                                                                    "score": 1,
                                                                    "created_utc": 1653436525.0,
                                                                    "response": "Can’t",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                },
                                                                {
                                                                    "id": "i9vf6lq",
                                                                    "author": "coinbasesupport",
                                                                    "score": 1,
                                                                    "created_utc": 1653436840.0,
                                                                    "response": "Let's have our team take a closer look at this for now, and give them some time to respond. We recommend that you stop communicating with the person asking you for some money. Thanks!",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9w4a5i",
                    "author": "Kiwip0rn",
                    "score": 1,
                    "created_utc": 1653448853.0,
                    "response": "🙄 they don't work for Coinbase 🙄",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}