{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "sd9z3k",
            "title": "Unsupported Crypto Recovery",
            "url": "https://www.reddit.com/r/CoinBase/comments/sd9z3k/unsupported_crypto_recovery/",
            "author": "tedmann12",
            "created_utc": 1643214684.0,
            "score": 23,
            "num_comments": 98,
            "subreddit": "CoinBase",
            "selftext": "I accidentally sent unsupported ERC20s to coinbase. My fault, I know. Other exchanges will recover these for you. Whenever I ask coinbase about this I receive this automated response: \" \n\n*\"If you sent unsupported cryptocurrency to Coinbase or sent cryptocurrency to a wallet that isn’t specifically for that cryptocurrency, we may soon be able to recover your funds.* \n\n*We're developing a service to help recover some of these cryptocurrencies, which should roll out later this year.\"*\n\nI last received this response 2 weeks ago, and the first time was about 9 months ago. Whenever I ask for information about this service, I just get more automated responses. Can we please get an update on this? Howcome binance, kraken, kucoin are all able to easily send you back your unsupported erc20's but coinbase claims it is impossible? This is not right.",
            "stickied": false,
            "comments": [
                {
                    "id": "hufpfb1",
                    "author": "coinbasesupport",
                    "score": 1,
                    "created_utc": 1643290229.0,
                    "response": "Hi there, thanks for your post.\n\nWe're sorry to hear about the issues you're experiencing regarding this send of unsupported crypto. \n\nWhile we understand your perspective on this, we would strongly encourage you to check out this article: [https://help.coinbase.com/en/coinbase/trading-and-funding/sending-or-receiving-cryptocurrency/unsupported-crypto-recovery](https://help.coinbase.com/en/coinbase/trading-and-funding/sending-or-receiving-cryptocurrency/unsupported-crypto-recovery). \n\nWe believe this article best explains the topic and answers any questions you may have relating to this experience. \n\nMany thanks!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "huemymf",
                    "author": "yeahprobablyokay",
                    "score": 5,
                    "created_utc": 1643263613.0,
                    "response": "Yeah, im trying to recover some unsupported tokens from Coinbase and it’s just a back and forth with the automated response.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hubvfz9",
                    "author": "trixkixu",
                    "score": 9,
                    "created_utc": 1643222828.0,
                    "response": "Coinbase support is shit, they will never solve any problem, move on Binance",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "huditkn",
                            "author": "Apprehensive_Zone281",
                            "score": 2,
                            "created_utc": 1643245144.0,
                            "response": "Exactly. Don’t give them any more of your money.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hue4epq",
                            "author": "TexasDX2131",
                            "score": 2,
                            "created_utc": 1643254185.0,
                            "response": ">2\n\nThey really are that bad!",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8lswpa",
                            "author": "Illustrious_Net_6448",
                            "score": 1,
                            "created_utc": 1652553604.0,
                            "response": "Yes!!! Your money is their now. It is the way of making people sign contracts to a death end. It your money they should at least give their customers a break. Is not that customer come to ask them for money. Customer money should give back to them. If coinbase don’t use other network find a way return back customer money. I am really sure that if coinbase give customer a choice to cancel the account and give them the money that stuck.  All customer will do.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hucg6up",
                    "author": "bdjc_ink",
                    "score": 3,
                    "created_utc": 1643230181.0,
                    "response": "Me too, wETH - not supported😣.  I got a feeling coinbase has a lot of assets on their balance sheet because of this stuff- right?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hufvgui",
                            "author": "CuteLawfulness1392",
                            "score": 2,
                            "created_utc": 1643293008.0,
                            "response": "I got 10.33 of Weth sitting in CB myself.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hug7ln7",
                                    "author": "bdjc_ink",
                                    "score": 5,
                                    "created_utc": 1643297937.0,
                                    "response": "Honestly - I’m ready to call my congressman- this is bad business practices!",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hyl82ts",
                                            "author": "tedmann12",
                                            "score": 2,
                                            "created_utc": 1645925810.0,
                                            "response": "Do it man. I’ve filed complaints with SEC FTC CFPB, they need to be bombarded with complaints this shit is unreal.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "hugnyua",
                                            "author": "CuteLawfulness1392",
                                            "score": 1,
                                            "created_utc": 1643303928.0,
                                            "response": "I agree",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hugo4eq",
                    "author": "BitPhoneNet",
                    "score": 3,
                    "created_utc": 1643303981.0,
                    "response": "I sent 70,000 MATIC tokens to my coinbase ERC-20 wallet years ago.  The coins sat there happily (but inaccessible) for several years.\n\nDays before coinbase \"officially supported MATIC\" - the coins were transferred out of my wallet, obv not by me as I never had access.\n\nNow MATIC is officially supported but my 70,000 Matic tokens ($165,000 USD) are gone.  Coinbase won't respond to numerous requests, they just make excuses, etc..\n\nI would really like my MATIC tokens back in my wallet where I put them!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8ltccz",
                            "author": "Illustrious_Net_6448",
                            "score": 1,
                            "created_utc": 1652553799.0,
                            "response": "That sound like they scam u.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8lwecn",
                                    "author": "Illustrious_Net_6448",
                                    "score": 1,
                                    "created_utc": 1652555214.0,
                                    "response": "I wonder if you have to pay tax or not if that $50 k half of it is a profit?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hvutz2v",
                    "author": "H4h4i1",
                    "score": 2,
                    "created_utc": 1644179989.0,
                    "response": "I am so sorry, the same happened to me last year 2021, went CETH from COINBASE wallet to COINBASE exchange. They could care less about your or your losses. Hopefully a lawsuit or regulation will change this.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hubauvq",
                    "author": "IRResponsible-Ernie",
                    "score": 2,
                    "created_utc": 1643215550.0,
                    "response": "Just happened to me, sent via polygon blockchain and it’s in limbo. Same canned response",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hubb57q",
                            "author": "tedmann12",
                            "score": 4,
                            "created_utc": 1643215652.0,
                            "response": "been dealing with this for many months now. They just don't give a shit its messed up. They clearly have the ability to. I filed complaints with the CFBP, SEC, FTC. After 2 months I go an official response from their legal team from the CFBP basically saying that no one in coinbase can access the private keys to the wallet because if they had access it represents a security loop hole or some bs. Total bs cause every other major exchange does this no problem. The fact is they do have the keys, that's all the matters. SOMEONE has access to the keys",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hueyhxg",
                                    "author": "Individual-Peach-394",
                                    "score": 3,
                                    "created_utc": 1643271522.0,
                                    "response": "What makes me the most upset is that we are not allowed to make mistakes.   But when coinbase makes a mistake. Like pays me 14,000,000 for one token. And it’s on the ledger.  They are allowed to create a trade that removes that money from my account.  For example. Buying 14,000,000 in negative amounts of etherium.  All the while manipulating the market.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hugd207",
                                            "author": "tedmann12",
                                            "score": 2,
                                            "created_utc": 1643299987.0,
                                            "response": "Lmao so true",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "hvuu9kt",
                                            "author": "H4h4i1",
                                            "score": 2,
                                            "created_utc": 1644180103.0,
                                            "response": "Why cannot there be a programmatic check to prevent this ?",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "hubbjxa",
                                    "author": "IRResponsible-Ernie",
                                    "score": 4,
                                    "created_utc": 1643215795.0,
                                    "response": "You would think it’s millions of dollars that could be in their account paying selling fees, buying fees etc…makes no sense.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "hubiazd",
                                    "author": "dakaroo1127",
                                    "score": 2,
                                    "created_utc": 1643218178.0,
                                    "response": ">They clearly have the ability to.\n\nWell actually...\n\n>because if they had access it represents a security loop hole or some bs\n\n...yeah... that's...that's how wallet security works....can you open your neighbors door with your key?\n\n>The fact is they do have the keys\n\n...oh...so this...this is a fact now...got it\n\n>SOMEONE has access to the keys\n\n..oh...so *someone* has it.... and that *someone* that owns a random wallet is undeniably Coinbase...\n\nImagine that you gave your employer a random routing/account number and then demanded they cut you a second check after the first was sent to the random account.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hujhkoq",
                                            "author": "Seidr13",
                                            "score": 3,
                                            "created_utc": 1643344187.0,
                                            "response": "If the random account that my money was sent to happened to belong to my employer, you better believe I would be angry and demanding my money back. Coinbase has these lost funds, they also have the ability to refund them but they pretend like it’s a black hole that magically stole the funds. It’s ridiculous is what it is, everything is traceable today.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "hubkvoj",
                                            "author": "tedmann12",
                                            "score": 5,
                                            "created_utc": 1643219080.0,
                                            "response": "are you trying to say coinbase doesn’t have access to the keys they use to send crypto? If that was the case they could never send any crypto. Not sure what you are saying here",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "huble3z",
                                            "author": "tedmann12",
                                            "score": 0,
                                            "created_utc": 1643219258.0,
                                            "response": "The crypto was sent to MY wallet on coinbase. You can check the transaction hash. I’m saying they own the private keys to my wallet which would allow the crypto to be sent out.\n\nI think you are confused",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hubm98u",
                                                    "author": "dakaroo1127",
                                                    "score": 1,
                                                    "created_utc": 1643219556.0,
                                                    "response": ">The crypto was sent to MY wallet on coinbase.\n\n...your wallet...which cannot support ERC20s...got it",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "hubpzze",
                                                            "author": "tedmann12",
                                                            "score": 3,
                                                            "created_utc": 1643220880.0,
                                                            "response": "It’s an ERC20 wallet. Any ERC20 wallet can support any ERC20 as long as you use the private key. Coinbase has the private key, which can reverse the transaction. That’s the entire point of my post. \n\nYou are confused sir",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "i3ph30x",
                                                            "author": "Riledup2020",
                                                            "score": 0,
                                                            "created_utc": 1649295218.0,
                                                            "response": "you are a dumbass and have no idea what you are talking about, the same fucking address is the same fucking address on the other network idiot.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i3pgsi4",
                                    "author": "Riledup2020",
                                    "score": 1,
                                    "created_utc": 1649295085.0,
                                    "response": "It's complete fucking bullshit.  They are straight lying to everyone, I don't know why a class action hasn't been started yet, they are literally sitting on billions of dollars of funds they have stolen from people.  They don't randomly create addresses on fly and tie them to accounts without the private keys. Not only that, if the have access to the wallet on ETH, they FUCKING HAVE ACCESS TO IT ON POLY!.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hucfxce",
                    "author": "Solid-Mess",
                    "score": 0,
                    "created_utc": 1643230088.0,
                    "response": "Lol I dunno what update your looking for.. they told you it’s gone. Isn’t that an update? The only way you would get it back is if they support the ERC20 or chain it was sent on. Which could be possible in the future.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hugd63q",
                            "author": "tedmann12",
                            "score": 3,
                            "created_utc": 1643300027.0,
                            "response": "No they said they are rolling out a service to help recover these funds. It was supposed to roll out last year. That’s the update I’m looking for. Are you able to read?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "huyx7nb",
                                    "author": "_theEcstatic",
                                    "score": 3,
                                    "created_utc": 1643616532.0,
                                    "response": "Also I talked to some high level people at CB and tried to raise the issue of our stuck GUSD to their “Voice of the Customer” team. Trying to get an update on that now to see if they are investigating. That team apparently builds cases around big customer issues and presents internally to relevant parties to address. I tried to emphasize that quite a few of us are in this exact same predicament and that the amounts are substantial. \n\nI can update you if I get any news on that. \n\nI also did just try to see if I could get some confirmation on whether the ERC-20 Recovery Service is still a thing or if support is incorrectly still talking about it. \n\nHopefully I get something on that to share as well.\n\nThey are now rolling out assets much more aggressively — so I really hope Gemini has put $GUSD forth for review in their asset review process.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "huzpusw",
                                            "author": "tedmann12",
                                            "score": 2,
                                            "created_utc": 1643636581.0,
                                            "response": "Awesome. How did you manage to speak to these people? I never get anywhere when trying to talk to higher ups. I even got a premium linked in account and messaged a bunch of people lol.\n\nYes, please keep me updated if you hear anything else! We all gotta band together with this BS, there are so many of us in the same situation.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "hvwjqu9",
                                            "author": "ComprehensiveJuice32",
                                            "score": 1,
                                            "created_utc": 1644207414.0,
                                            "response": "I’ve also had a large amount of GUSD (6 figured) stuck at Coinbase since Q1 of 2021. The lack of help from Coinbase is flat out incomprehensible! I’ve been waiting for 9+ months for an update on the “Unsupported Crypto Recovery Team” rollout. Starting to feel like they’re just dragging us here. Their overall Customer Support is about as Piss Poor as it gets. Hard to be encouraged, because they don’t appear to give a flying f@ck about helping their customers.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hvwlpww",
                                                    "author": "_theEcstatic",
                                                    "score": 2,
                                                    "created_utc": 1644208426.0,
                                                    "response": "We have to hope that on a long enough timeline they’ll have added it. They’ve stated they’d like to add send/receive/hold for most assets (even those not tradable).\n\nDoesn’t make the situation any less aggravating.\n\nAt this point until I see something back on their website mentioning the service - my assumption is that it got cancelled or significantly delayed. \n\nI would think they would utilize the existing feature where customers can link their self custody coinbase wallet app to their CB exchange account. Seems like it would be simple to transfer over the unsupported erc-20 that way given it’s one ETH wallet address and they can “verify” it’s being transferred to the owner of the coinbase account via the link.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "hyl9puz",
                                            "author": "tedmann12",
                                            "score": 1,
                                            "created_utc": 1645926570.0,
                                            "response": "I’m assuming you have heard nothing back? How did you even get in touch with this “Voice of the Customer” team?\n\nI file a new support ticket like once a week. Also have done some CFPB complaints, their legal team wrote back just with all sorts of bs about how they are not liable for lost crypto due to unsupported crypto sent to them, blah blah.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hylh642",
                                                    "author": "_theEcstatic",
                                                    "score": 1,
                                                    "created_utc": 1645930156.0,
                                                    "response": "I haven’t been able to get any follow up comment on whether that team is assessing the case or not. \n\nStill trying to chase that down and will update you if I get any news.\n\nThey reaffirmed on their earnings call this last week that they are “trying to add every legal asset” so it still seems like our best hope is that we see GUSD on the list one of these days… it should certainly meet their criteria",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "hyn28l2",
                                                            "author": "tedmann12",
                                                            "score": 2,
                                                            "created_utc": 1645967619.0,
                                                            "response": "Ok thanks.\n\nThe dream would be to get this money back while bitcoin is still in the 30s 😂. I refinanced my blockfi loan at like 60k, it would be hilarious if this turned into a positive overall. That’s what I keep clinging into lol.\n\nThanks for the update man. I regularly bombard them with support tickets, Twitter complains, reaching out to executives via linked in. Definitely won’t stop anytime soon.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i4cedpl",
                                                                    "author": "_theEcstatic",
                                                                    "score": 2,
                                                                    "created_utc": 1649711994.0,
                                                                    "response": "Dude! You see this?! \n\nWe’re on the list!\n\nhttps://blog.coinbase.com/increasing-transparency-for-new-asset-listings-on-coinbase-e06f2edb095e",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i4ci5f9",
                                                                            "author": "tedmann12",
                                                                            "score": 1,
                                                                            "created_utc": 1649713485.0,
                                                                            "response": "Ommgggg!!! Thanks for sharing wow I don’t even know what to think. Hilarious if I end up with way more bitcoin than I would have because of this!\n\nMaybe they got sick of my weekly support tickets lmao",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i4cng57",
                                                                                    "author": "_theEcstatic",
                                                                                    "score": 2,
                                                                                    "created_utc": 1649715637.0,
                                                                                    "response": "yeah the timing may actually have been a blessing in disguise! fingers crossed that we both have this sorted automatically once it’s added and don’t need to go through any additional steps",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i4db1y7",
                                                                                            "author": "tedmann12",
                                                                                            "score": 1,
                                                                                            "created_utc": 1649725959.0,
                                                                                            "response": "agreed! Good luck man. I am really hoping that when they say \"assets under consideration\" it is their way of saying they are planning on adding these but for whatever reasons can't outright say they ARE. fingers crossed!",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "id": "hynynb0",
                                                                    "author": "_theEcstatic",
                                                                    "score": 1,
                                                                    "created_utc": 1645982132.0,
                                                                    "response": "Yeah let’s definitely keep the pressure on them. Hopefully others in our situation are as well.\n\nYeah I’ve thought about that! If BTC stays around where it’s at now it would actually be a positive for me as well. After the stress we’ve both had to experience that would be a nice ending for sure.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "hzed159",
                                                                            "author": "persechino218",
                                                                            "score": 2,
                                                                            "created_utc": 1646445515.0,
                                                                            "response": "I’m with you guys. Please update if any changes are made… what a 10k slap to the nuts",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hub8fb5",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1643214685.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hudpkd8",
                    "author": "Careless_Inflation72",
                    "score": 1,
                    "created_utc": 1643247921.0,
                    "response": "Don’t worry, you’re good. This process took me nine months to figure out, but similar situation, I sent harmony one to my ERC20 addy within the Coinbase application.  It will never show up on your coinbase.com app.  First, download MetaMask In the App Store or Google play store and then sign up. Retrieve your 12 word recovery phrase from Coinbase and then import to MetaMask. Once finish go to your settings in MetaMask and look for the network that your one, The default network may be Ethereum, however if it’s not just switch it for whatever networking to the Harmony Network. If you can’t figure it out, look at the top right corner, you’ll see an + click that and that’s how you add one. Go onto Google and search step-by-step instructions “how to add Harmony network within MetaMask” and follow that step-by-step, when complete, switch to Harmony network within your MetaMask application and boom your coin will be in your wallet in MetaMask",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i4v9vvf",
                            "author": "WishboneEquivalent49",
                            "score": 1,
                            "created_utc": 1650050402.0,
                            "response": "How were you able to contact someone at coinbase to actually get the private key?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8lunp2",
                                    "author": "Illustrious_Net_6448",
                                    "score": 1,
                                    "created_utc": 1652554403.0,
                                    "response": "A lot of people have try. All is customer service tell u make a ticket talk with auto response. Policy …..I think a law maker should not let bossiness have this kind of right. It old style scam……",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "huedql2",
                    "author": "Lucky_McCracken",
                    "score": 1,
                    "created_utc": 1643258596.0,
                    "response": "Fox tokens are also a scam",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "huey3dd",
                    "author": "Individual-Peach-394",
                    "score": 1,
                    "created_utc": 1643271211.0,
                    "response": "You don’t need an attorney to sue these assholes.   You need about 20 bucks and a formal complaint.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hugbqpi",
                    "author": "CPC_creations",
                    "score": 1,
                    "created_utc": 1643299490.0,
                    "response": "I don’t have Binance, I use Coinbase also.  Question does Binance have as large of a selection as Coinbase when it comes to the number of coins you can buy?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "huyvtwu",
                    "author": "_theEcstatic",
                    "score": 1,
                    "created_utc": 1643615494.0,
                    "response": "@tedmann12 so they are still mentioning that service to you? I really wish we had confirmation on if that was coming. It’s fine if it’s going to take a few more months or whatever but the fact they keep pointing to that website page makes no sense. \n\nI really dislike that they removed mention of the service from the page — makes me think it isn’t happening.. but you’d think it’s a big enough issue that they’d have told their support staff to no longer mention it. So strange…",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "huzq4a0",
                            "author": "tedmann12",
                            "score": 1,
                            "created_utc": 1643636710.0,
                            "response": "Yes the automated messages still mention it. I copy paste it every time on my follow up questions and they literally just ignore it they never even mention it. I directly quoted them and ask if i can receive clarity around this, and then I get messages like “please be sure to check supported assets before making transfers”\n\nI have done this probably 30+ times honestly. Everytime I get the automated response about the service and every time I follow up on it and cannot get any answers. Not even a “no that’s not happening” or “no I have no information about that”\n\nIt’s very strange",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8lv6e6",
                                    "author": "Illustrious_Net_6448",
                                    "score": 1,
                                    "created_utc": 1652554644.0,
                                    "response": "It sound like sorry customer your money is mind now……while most trading platforms will solve it a very fast response. By adding more service.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "hvuuu5r",
                            "author": "H4h4i1",
                            "score": 1,
                            "created_utc": 1644180335.0,
                            "response": "Yes, I remember last year when they said they were going to develop a service to recovery the tokens. They dropped the project.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hvuvkm2",
                    "author": "H4h4i1",
                    "score": 1,
                    "created_utc": 1644180631.0,
                    "response": "I fear some assess they will never support in order to get your money back. For example, I sent CETH to Coinbase exchange from Coinbase wallet. What are the odds they will \"ever\" support CETH. Is it even a traded token ? --- I cannot tell from my research, it seems a wrapped token around Ethereum.\n\nWhat is frustrating, is I sent the CETH from the Coinbase Wallet, where they promoted converting Ethereum to CETH to earn interest. Moving back the CETH back to Coinbase exchange, my fault I thought the CETH would become Ethereum. I mean, if they sell it in one Coinbase application, wouldn't be available in all applications ?? \n\nThey could have prevented this mistake by programmatically preventing this in THEIR wallet.\n\nThey want to shove all responsibility to the user.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hwbgkl2",
                            "author": "persechino218",
                            "score": 1,
                            "created_utc": 1644462552.0,
                            "response": "Same exact situation to the T with me bro. Yes it’s a user error but it’s so easy to do plus there are no prompts or any warning when finalizing the transaction. Idk they will ever support cETH.\nPlus wtf on this recovery tool? Vague isn’t the word to use regarding this situation. \n\nI’m chalking this up to a hard 5k+ lesson learned.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hvv83oc",
                    "author": "Fedner12",
                    "score": 1,
                    "created_utc": 1644185736.0,
                    "response": "I also loss about 50k now stock on Coinbase 9 months ago they don’t even reply to your email it just a bunch automated reply back @coinbase just terrible why held someone asset just very bad experience screw Coinbase this company is a total scam no customer services i hope one day SCC shot them down for holding customers asset truly terrible we should files a lawsuit against Coinbase",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8lvo66",
                            "author": "Illustrious_Net_6448",
                            "score": 1,
                            "created_utc": 1652554874.0,
                            "response": "How anywhere that have one. Someone should make a YouTube show how to.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8lw5k0",
                                    "author": "Illustrious_Net_6448",
                                    "score": 1,
                                    "created_utc": 1652555099.0,
                                    "response": "I wonder if you have to pay tax or not if that $50 k half of it is a profit?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8lw43v",
                            "author": "Illustrious_Net_6448",
                            "score": 1,
                            "created_utc": 1652555080.0,
                            "response": "I wonder if you have to pay tax or not if that $50 k half of it is a profit?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hwbw4d7",
                    "author": "fortnitehero11",
                    "score": 1,
                    "created_utc": 1644469945.0,
                    "response": "Experienced the same bullshit with them I currently have Weth sitting in limbo because they won’t support it or create a process to help smh.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8lw6zc",
                            "author": "Illustrious_Net_6448",
                            "score": 1,
                            "created_utc": 1652555117.0,
                            "response": "I wonder if you have to pay tax or not if that $50 k half of it is a profit?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hz95baq",
                    "author": "keteflips",
                    "score": 1,
                    "created_utc": 1646353278.0,
                    "response": "Same problem here, and now im sure I have lost my money.  \n\n\nhttps://www.reddit.com/r/Metamask/comments/t654nh/help\\_i\\_transfer\\_usdc\\_to\\_coinbase\\_and\\_i\\_think\\_i/hz90juw/?context=3",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hzpsqxv",
                    "author": "iLostMyWeenie",
                    "score": 1,
                    "created_utc": 1646668865.0,
                    "response": "Made the same mistake except transferred USDC on the KCC chain (kucoin) not ERC-20 ://// \n\nHmu if your in a group discord or something, maybe we can get some traction going (big ass complaint, or regularly update one another...)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i87p3hr",
                    "author": "jgbagley",
                    "score": 1,
                    "created_utc": 1652292022.0,
                    "response": "FYI, I've created a new post to get clarity from CoinBase on if they still have plans to launch an Asset/ERC-20 Recovery Service:  \nhttps://www.reddit.com/r/CoinBase/comments/unfc30/need\\_clarity\\_from\\_coinbase\\_on\\_if\\_there\\_are\\_plans/",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8lx25b",
                    "author": "Fedner12",
                    "score": 1,
                    "created_utc": 1652555526.0,
                    "response": "The fed should investigate those unsupported token that Coinbase kept this really like a scam why hold someone asset for years that they works for and sweat for this is just ridiculous @coinbase",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iac919p",
                    "author": "cryptotraderinwork",
                    "score": 1,
                    "created_utc": 1653762704.0,
                    "response": "Monday I converted my $35.000 of $BNB to USD Stablecoin on Gate.io\r  \n\r  \nAfter that, I wanted to convert it to euros on my Coinbase account, so I sent the USD Stablecoin to my Coinbase. I knew I had to look out for the network of course, as the $USDC adress of Coinbase only accepts ERC-20 tokens.\r  \n\r  \nThe unfortunate thing is that when you convert your crypto to USD Stable Coin on gate.io\r, you can withdraw several USD stable coins such as $HUSD, $BUSD, $TUSD and $USDC. I just looked at the network (ERC-20) and thought I withdrawed $USDC. Unfortunately, it turned out later that I had withdrawed the ERC-20 $HUSD. Yes, I know this is my fault and that I should have tried a small transaction first, but I can't change it anymore.\r  \n\r  \nCoinbase has not listed $HUSD and says they cannot return the tokens. The tokens are only credited automatically when Coinbase lists $HUSD on their exchange.\r  \n\r  \nI emailed the Huobi Trust CEO about this, as Huobi is the exchange behind stablecoin $HUSD (just like Binance is the exchange behind stablecoin $BUSD and Coinbase is the exchange behind stablecoin $USDC). He said the following:\r  \n\r  \n'We will continue to work hard to communicate with coinbase. But I can't be sure when $HUSD will be listed. But you do have the right to find coinbase to recover your assets. If any customer mistakenly deposits a token that is not listed on Huobi, Huobi will assist in retrieving it, or even advance payment. In fact, you did deposit your assets into the coinbase address. I believe that as long as you keep looking for them to solve the problem, they will help you. After all, $35,000 is not a small sum. Good luck.'\r  \n\r  \nSee my transaction on etherscan:\r  \nhttps://etherscan.io/tx/0x12a231dc8801724334895452f41dce8cb621d2db584c969bbe3c7fa6b9efa78d",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hudt836",
                    "author": "kek000u1",
                    "score": 0,
                    "created_utc": 1643249438.0,
                    "response": "coinbase steals $SGB songbird token from $FLR flare airdrop… no wonder they are stealing your money too 🤷‍♂️",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}