{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uz7wya",
            "title": "[Help] Your recent purchase of digital assets has failed. In 5 days, we will proactively initiate an automatic recovery. NOT ALLOWED TO ADD PAYMENT METHOD.",
            "url": "https://www.reddit.com/r/CoinBase/comments/uz7wya/help_your_recent_purchase_of_digital_assets_has/",
            "author": "Whole_Scarcity1251",
            "created_utc": 1653685808.0,
            "score": 1,
            "num_comments": 38,
            "subreddit": "CoinBase",
            "selftext": "Man, this is so frustrating. \nCase #11988313. \n\nPayment failed because it tried grabbing from checkings instead of savings. I get an email. No problem, I'll just transfer enough funds to cover.\n\nHowever, coinbase app asks me to relink bank. I try, and it says the account already exists/has been linked. Reached out to customer service and jumped through all the loops. Note: Bank #1 did not receive a withdrawal/deposit request from coinbase for this transaction. Bank #1 also has an iffy history with crypto policies.\n\nSo I try to add bank #2. Says bank can't be added through instant verification nor manual. Also getting error saying this account has been added before (it has, but I unlinked months ago). Note: Bank #2 accepts cryptocurrency exchanges.\n\nTried adding paypal and a debit card. Both do NOT show up in the \"Make payment\" (edit: dropdown menu) that appears on alert modal. \n\nRunning out of ideas. Tried adding bank #3 - cashapp. Now I get an error saying I've made too many bank verification  attempts. Try again in 7 days. \n\nAutomatic recovery happens tomorrow. I'll lose my portfolio. \n\nCan anyone from Coinbase help? \nThis is extremely stressful and has been a terrible experience.\n\nCase #11988313.",
            "stickied": false,
            "comments": [
                {
                    "id": "ia8noa9",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653685809.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia8nyer",
                            "author": "Whole_Scarcity1251",
                            "score": 1,
                            "created_utc": 1653685944.0,
                            "response": "Case #11988313",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia8q1uk",
                                    "author": "coinbasesupport",
                                    "score": 1,
                                    "created_utc": 1653686946.0,
                                    "response": "Hi u/Whole_Scarcity1251, we understand your concern here and want to help to the best of our ability. We can see that you have had an ongoing conversation via email today with the specialty team that is handling your case. Unfortunately, there is nothing that we as social media support can do to escalate your issue at this time as it is already actively being handled by the appropriate team. We understand this must be stressful, but we kindly ask that you wait for their response via email at this time. Thank you for your understanding.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iaabjse",
                                            "author": "Whole_Scarcity1251",
                                            "score": 1,
                                            "created_utc": 1653719448.0,
                                            "response": "Thanks u/Coinbasesupport.\nWe are going in circles that feel like automated replies, so the human-ness of your response is appreciated",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iaac2ch",
                                                    "author": "coinbasesupport",
                                                    "score": 1,
                                                    "created_utc": 1653719871.0,
                                                    "response": "We appreciate that, u/Whole_Scarcity1251. Thank you!",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}