{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uir4tz",
            "title": "Account under review again!!",
            "url": "https://www.reddit.com/r/CoinBase/comments/uir4tz/account_under_review_again/",
            "author": "54ms04",
            "created_utc": 1651731955.0,
            "score": 3,
            "num_comments": 8,
            "subreddit": "CoinBase",
            "selftext": "I added my checking account as a new payment method and all my actions on my Coinbase account is suspended and I received an email that my account is under review. Why my verified account should go under review and my funds should hold hostage?! I hope it doesn't take months like last time. I will join the others that I know they are putting up a lawsuit if it takes more that a couple of days again.",
            "stickied": false,
            "comments": []
        },
        {
            "id": "u2b9h8",
            "title": "Atom move",
            "url": "https://www.reddit.com/r/CoinBase/comments/u2b9h8/atom_move/",
            "author": "acamp46",
            "created_utc": 1649803054.0,
            "score": 3,
            "num_comments": 44,
            "subreddit": "CoinBase",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "ttnwbt",
            "title": "Trust no one: The hunt for the crypto king...",
            "url": "https://www.reddit.com/r/CoinBase/comments/ttnwbt/trust_no_one_the_hunt_for_the_crypto_king/",
            "author": "KakarotoCryptoniano",
            "created_utc": 1648810683.0,
            "score": 3,
            "num_comments": 50,
            "subreddit": "CoinBase",
            "selftext": "After watching this doc. IDk Y, it reminds me so much of Coinbase, poor customer service, always the customers get screw, suddenly changes etc etc...",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uiwoot",
            "title": "Lost a lot of money sending ETH to my coinbase account",
            "url": "https://www.reddit.com/r/CoinBase/comments/uiwoot/lost_a_lot_of_money_sending_eth_to_my_coinbase/",
            "author": "[deleted]",
            "created_utc": 1651754890.0,
            "score": 32,
            "num_comments": 76,
            "subreddit": "CoinBase",
            "selftext": "So this is very weird. I had a large amount of Ethereum stored on my ledger cold storage device. I sent them yesterday evening to my coinbase account. I double-checked the address and the funds. \n\nA day later, still nothing on my coinbase account. I thought initially the transaction takes time because they're doing a security audit or something similar, or that there was an issue, so I waited before contacting CB support. I called them this morning, explaining the situation, after an hour or so they escalated the issue to a manager of some sort. He was able to show me a page with all the ethereum wallets associated to my account. The said wallet to which I had sent the funds wasn't there. There was a different one created at the same time. \n\nIt gets weird, because, 1, I have double checked and triple checked the addres. 2, the transaction appears on etherscan as successful, and was sent from the original receivining address to Coinbase 5. So the money got to coinbase, but this wallet does not appear in my list of wallets. The wallets to which the funds where sent to shows to be created at the same time frame as when I sent the money. Coinbase is not answering, whenver I call I get an automated message saying to refer to the website. I don't know what to. If anyone has any ideas, please let me know. It is a large sum of money, so if it doesn't get solved I'm going to use legal action.",
            "stickied": false,
            "comments": [
                {
                    "id": "i7f661t",
                    "author": "y90210",
                    "score": 22,
                    "created_utc": 1651756039.0,
                    "response": "I don't know if this applies to your situation, but there are malware out there that swap addresses you copy and paste with their own. They generate thousands of addresses, so that when you copy yours, they look up one internally that looks similar (same starting and ending hash values). \n\nI have a dedicated laptop that I don't install anything on and only use for crypto transactions, and I use a ledger with it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7fkkf6",
                    "author": "joekercom",
                    "score": 5,
                    "created_utc": 1651762303.0,
                    "response": "If it was received by an official Coinbase wallet (Coinbase 5) then there's no reason they can't credit you your funds.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7fgv1e",
                    "author": "brandobot89",
                    "score": 5,
                    "created_utc": 1651760793.0,
                    "response": "Can you share the transaction id or the sending wallet public address?\n\nThis can help us figure out if the crypto actually went to coinbase",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7fpvo6",
                    "author": "jhanon76",
                    "score": 9,
                    "created_utc": 1651764427.0,
                    "response": "You tested the process first with some min amount of ETH right?  Before you sent a \"large sum\"?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7g7l1b",
                            "author": "Foreign_Jackfruit_70",
                            "score": 8,
                            "created_utc": 1651771715.0,
                            "response": "This has saved my ass a couple times, but unfortunately not everyone knows this, or they just neglect to do it.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7gdw0s",
                                    "author": "jhanon76",
                                    "score": 5,
                                    "created_utc": 1651774222.0,
                                    "response": "Yeah it takes time, patience, and a little loss (ie gas fees), so transactions based on emotion are not good candidates for this extra step.  Long run though for sure it has saved me $$ too!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i7f5zk2",
                    "author": "mechmind",
                    "score": 17,
                    "created_utc": 1651755950.0,
                    "response": "Sorry you're dying through this. Please upset this thread with any developments",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7f731j",
                            "author": "snash222",
                            "score": 29,
                            "created_utc": 1651756485.0,
                            "response": "Painfully appropriate typo.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7hny2l",
                    "author": "cmdrshepherd1993",
                    "score": 3,
                    "created_utc": 1651793593.0,
                    "response": "Always send a super extremely small amount first to test before sending large sums. I don’t know how many times people have to be told this. Send a dollar (or smallest amount possible) before sending $200,000 (edit is just to add an example.)",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7j9zyx",
                            "author": "zeropuntouno",
                            "score": 3,
                            "created_utc": 1651830305.0,
                            "response": ">Coinbase 5\n\nRight, always good habit",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "uinkt3",
            "title": "Coinbase Froze My Account (Six Figures) Because I Accidentally Burnt The Chicken Casserole.",
            "url": "https://www.reddit.com/r/CoinBase/comments/uinkt3/coinbase_froze_my_account_six_figures_because_i/",
            "author": "DNGRHLVTCA",
            "created_utc": 1651719190.0,
            "score": 2,
            "num_comments": 64,
            "subreddit": "CoinBase",
            "selftext": "If not for the reason specified in the title then it's definitely because I had a body temperature of 98.6F and die if I don't eat or sleep for an indefinite period. \n\nI have the combined sums of my retirement, my wife's retirement and money from my second mortgage now completely frozen with no way to access it. What do I do? Does anyone know the correct words to use while I beg or what name I have to have tattooed on my face before they release my funds?\n\nEdit:\n\nSo you guys that are reading all this stuff, title itself included, that I'm screwed? I have no chance of getting back my 3.6 million USD worth of 420ElonDong coin???\n\nMy life is effectively ruined and all because I didn't read the Coinbase Terms of Service agreement. If only I hadn't burned that chicken casserole I was cooking. I understand that ignorance of the rules isn't an excuse, but guys I genuinely didn't know that burning a chicken casserole was specifically listed as prohibited in the agreement. It's right next to the other prohibited actions, such as using the Coinbase card at a gun store or purchasing a fifteen minute back massage for your wife from the national Massage Envy spa. Massage Envy falls under their rule against using your Coinbase card at massage parlors or prostitutes. Clearly the national chain of massage therapists are the same sucky sucky happy ending establishments downtown.",
            "stickied": false,
            "comments": [
                {
                    "id": "i7fkqyd",
                    "author": "Informal-Parsley1041",
                    "score": 4,
                    "created_utc": 1651762376.0,
                    "response": "Just send them a picture of a properly cooked chicken casserole.  Voila. Unlocked.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7dzc52",
                    "author": "marvinrabbit",
                    "score": 3,
                    "created_utc": 1651725118.0,
                    "response": "If you verify your wallet in this excel spreadsheet I can help you get the chicken casserole back.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7e12h4",
                            "author": "DNGRHLVTCA",
                            "score": -1,
                            "created_utc": 1651726181.0,
                            "response": "It's 3.6 million worth of Ether. It's just sad, the thing that tipped me off to the freeze (no notice from CB FYI) is that I went to swap my entire ether balance to 420ElonDong Inu for the upcoming moonshot and I was met with an in app notice. They could have at least sent an email so my fellow Elon Dong'ers aren't left wondering.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7egn0p",
                                    "author": "cmdrshepherd1993",
                                    "score": 1,
                                    "created_utc": 1651738089.0,
                                    "response": "I genuinely feel awful for you. However, I would say that you should take this advice: put crypto funds in stablecoins & in your offline wallet, not the exchange. You can have some there but not your entire retirement funds. Second, it is best to be extremely cautious with your crypto. Do not leave too much on exchanges. Keep it in your crypto wallet",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i7ejv1l",
                                            "author": "DNGRHLVTCA",
                                            "score": -1,
                                            "created_utc": 1651741015.0,
                                            "response": "Dude, can you read? There's like a metric ton of satire involved in this post. Literally says they froze my account because I burned a casserole dish I was cooking in an oven... This is a satirical post in regards to how Coinbase can just freeze and effectively steal asset for trivial matters as seen here daily.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i7ek9qd",
                                                    "author": "cmdrshepherd1993",
                                                    "score": 5,
                                                    "created_utc": 1651741372.0,
                                                    "response": "Well they never did that to me. So I don’t care about your experience then since you throw it in my face for caring. Eff off",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i7ewaic",
                                    "author": "Connect-Ad-1088",
                                    "score": 1,
                                    "created_utc": 1651750654.0,
                                    "response": "When you sell your eth for dong…..",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i7e62bt",
                                    "author": "Accomplished-Way7608",
                                    "score": 0,
                                    "created_utc": 1651729552.0,
                                    "response": "You got greedy. Crypto is loaded with scams and fraud and yet you moved your retirement funds there?? 🤣🤡🤦‍♂️",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i7ekle2",
                                            "author": "DNGRHLVTCA",
                                            "score": 1,
                                            "created_utc": 1651741658.0,
                                            "response": "I'm the clown but you're commenting on a post that literally says IN THE FREAKING TITLE that the reason they froze my account was for failing to properly cook a chicken casserole in my oven. Once again for the hundredth fucking time apparently this post is satire in reference to Coinbase stealing people's money for completely harmless and arbitrary reasons. Imagine losing your nest egg because you used your Coinbase card to buy a back massage at a Massage Envy location. Yeah that's considered a massage parlor aka happy ending whorehouse to Coinbase. Coinbase steals tons from ppl daily but they judge you for your \"immoral purchases\" like guns or cannabis (with a prescription!) And use it to justify taking your money!!!",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i7dxirk",
                    "author": "Tall_Run_2814",
                    "score": 2,
                    "created_utc": 1651724081.0,
                    "response": "Coinbase is not a bank, its basically eBAY for crypto.  Never leave more than you need to actively trade on any exchange; especially Coinbase.  \n\nInvest in a hardware wallet; I personally prefer Ledger.\n\nIn the meantime I pray to God you're using a 2FA authenticator app with your account or you're pretty much leaving your retirement out there to be hacked by some low life.  \n\nNever forget...crypto was invented by hackers, protect yourself.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7dxu75",
                            "author": "DNGRHLVTCA",
                            "score": 4,
                            "created_utc": 1651724256.0,
                            "response": "Can you tell me if I manage to move it to my Coinbase wallet, would I be able to transfer my satire to cold storage?",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i7dz4rb",
                            "author": "antheezy2013",
                            "score": 1,
                            "created_utc": 1651724997.0,
                            "response": "What are some good 2FA Apps for Coinbase??",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7egezb",
                                    "author": "cmdrshepherd1993",
                                    "score": 1,
                                    "created_utc": 1651737883.0,
                                    "response": "Authy",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i7hu0y3",
                                    "author": "Tall_Run_2814",
                                    "score": 1,
                                    "created_utc": 1651796487.0,
                                    "response": "Google Authenticator and Microsoft Authenticator are standards",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i7e9t14",
                            "author": "prince2lu",
                            "score": 1,
                            "created_utc": 1651732336.0,
                            "response": "Yes but then if you want to cash out in fiat you have no choice but use coinbase",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7gc6ua",
                                    "author": "ApprehensiveFarm1107",
                                    "score": 1,
                                    "created_utc": 1651773534.0,
                                    "response": "Sorry that may not be true. You open an account with another exchange complete KYC and connect to your bank account and transfer it in. Abra, Kraken, Binance (not a  recommendation) and more or their US versions and off-board that way. That should work unless you are on the sanctioned list.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i7hu9l6",
                                    "author": "Tall_Run_2814",
                                    "score": 1,
                                    "created_utc": 1651796617.0,
                                    "response": "I use Binance and Gemini as well.  There are other options as well.  You just need to research...",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i7do4y0",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1651719190.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7dq1tn",
                    "author": "Rey_Mezcalero",
                    "score": 0,
                    "created_utc": 1651720136.0,
                    "response": "This is a solid case and the best one I have heard so far on the infamous “locked out” of my account syndrome. \n\nYou maybe able to get access if you tell CB support you promise to keep a better eye the next time you cook chicken casserole and will ensure proper body temp",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7dqz9q",
                            "author": "DNGRHLVTCA",
                            "score": 0,
                            "created_utc": 1651720611.0,
                            "response": "I'm just so lost. I erected the shrine to their CEO and CFO within the 48 hour window as directed I also made sure to flagellate myself three times daily in front of the shrine while facing north, north east. Clearly I'm cooperating why won't they thaw my account out???",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7dv62m",
                                    "author": "Rey_Mezcalero",
                                    "score": 2,
                                    "created_utc": 1651722801.0,
                                    "response": "You might not be whipping yourself hard enough",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i7e7nyk",
                    "author": "jhanon76",
                    "score": 0,
                    "created_utc": 1651730707.0,
                    "response": "I wanna know how many DMs you've gotten offering to help once you flashed your six(y) figures.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7ekck1",
                            "author": "DNGRHLVTCA",
                            "score": 3,
                            "created_utc": 1651741437.0,
                            "response": "I had no idea reading comprehension was such a rare commodity. Literally the title says Coinbase froze my assets as a punishment for burning a chicken casserole dish in the oven. It's satire because since following this subreddit I see nothing but dozens of frozen account posts on the daily for, usually, completely arbitrary reasons. For example, imagine losing your nest egg because you tried to purchase a massage at a Massage Envy location, only to find out Coinbase considers any massage business a prostitution hub. Guy lost his earlier, a fair amount, because he tried to use his card at a gun store. To legally purchase a firearm, his constitutional right. \n\nI actually have more responses that somehow read past \"CHICKEN CASSEROLE\" and \"I even set up the Coinbase CEO CFO Shrine and flogged myself before it, as listed in the Coinbase terms of service\" they read that shit and still reply to me as it this is genuine.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i7elcv8",
                            "author": "DNGRHLVTCA",
                            "score": 3,
                            "created_utc": 1651742340.0,
                            "response": "One guy replied even after reading that I invested 3.6 million dollars into 420ElonDong coin ahahahaha",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7fdzt1",
                                    "author": "jhanon76",
                                    "score": 1,
                                    "created_utc": 1651759591.0,
                                    "response": "420ElonDong probably a top hit on Google overnight.\n\nI hear ya...I want to keep following r/coinbase but every post is like yours but serious 🤦",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "id": "uio6ki",
            "title": "Letter to customer service - Coinbase froze all my funds for a glitch at Coinbase",
            "url": "https://www.reddit.com/r/CoinBase/comments/uio6ki/letter_to_customer_service_coinbase_froze_all_my/",
            "author": "TopBridge6057",
            "created_utc": 1651721082.0,
            "score": 4,
            "num_comments": 45,
            "subreddit": "CoinBase",
            "selftext": "Coinbase locked my entire account because of a technical glitch whereby instant deposit didnt go through. I tried depositing $400 bucks via instant deposit and somehow it didnt go through. Instead of allowing me to redeposit, they froze my entire account (which is funded beyond $400) and then wont let me withdraw, transfer or use my coinbase card. Per representatives Coinbase needs to manually review the account and then manually unlock it... but why is this okay if if was a glitch? Also, I tried re-funding right away and after a day, the cash was withdrawn from my bank account\n\nIt's quite pathetic since i had my cash locked up at Coinbase, and they are holding my entire account hostage. I feel like this is illegal. I wish I could get in touch with customer service.\n\nPlease let me know what i can do to unfreeze my account. I need the cash to use.",
            "stickied": false,
            "comments": [
                {
                    "id": "i7dsemv",
                    "author": "TopBridge6057",
                    "score": 1,
                    "created_utc": 1651721352.0,
                    "response": "What the f.  They told me I need to wait 5 business days for it to clear. I asked if I could transfer crypto in there so it doesn't need to clear and they still have it locked",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7eldql",
                            "author": "fx9TMK",
                            "score": 5,
                            "created_utc": 1651742361.0,
                            "response": "Ok so now wait",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i7fvvq7",
                            "author": "Holbrecht",
                            "score": 0,
                            "created_utc": 1651766776.0,
                            "response": "They did it to what I suspect is thousands of people. Look on the front page. They did it to me as well. I think I'm just going to file a dispute with the bank.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i7hmis5",
                            "author": "Roaring_Tiddy",
                            "score": 0,
                            "created_utc": 1651792936.0,
                            "response": "Same exact thing here.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7dsaln",
                    "author": "DannyDank508",
                    "score": 1,
                    "created_utc": 1651721292.0,
                    "response": "This happened to me yesterday. I messaged CB and they fixed it in 15 minutes.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7e6dvp",
                            "author": "Accomplished-Way7608",
                            "score": -2,
                            "created_utc": 1651729778.0,
                            "response": "Ok Brian Armstrong.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7drwe5",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1651721082.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7gcz26",
                    "author": "earo1674",
                    "score": 0,
                    "created_utc": 1651773848.0,
                    "response": "SAME THING HAPPENED TO ME!!!\n\nUNACCEPTABLE",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uiomyc",
            "title": "Every time I try to use my coinbase card it gets declined. And every time I try to access support...",
            "url": "https://www.reddit.com/r/CoinBase/comments/uiomyc/every_time_i_try_to_use_my_coinbase_card_it_gets/",
            "author": "OGPresidentDixon",
            "created_utc": 1651722550.0,
            "score": 11,
            "num_comments": 51,
            "subreddit": "CoinBase",
            "selftext": "I get to a screen that asks me to log in (from the mobile app) that never loads. Then I try to contact support and it just crashes. \n\nMy card has $108 and I tried to use it for a $20 purchase and it was declined. I'd just like to use the card. \n\nhttps://imgur.com/a/I3jNKbI",
            "stickied": false,
            "comments": [
                {
                    "id": "i7emvhq",
                    "author": "coinbasesupport",
                    "score": 1,
                    "created_utc": 1651743675.0,
                    "response": "Thanks for reaching out about this Coinbase Card issue, u/OGPresidentDixon. \n\nPlease send our Coinbase Card team a message [here](https://help.coinbase.com/en/contact-us), and we'll follow up on this for you. \n\nOnce you receive a support case number, share it with us here, and we'll take a look. Many thanks.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7hmunk",
                    "author": "Ladymunehisa",
                    "score": 1,
                    "created_utc": 1651793089.0,
                    "response": "COIN BASE IS A RIP OFF",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7dup58",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1651722551.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7e1okz",
                    "author": "Kiwip0rn",
                    "score": 1,
                    "created_utc": 1651726576.0,
                    "response": "Okay... enter Coinbase Custody account through your phone's browser if the app is failing.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7e4gkb",
                    "author": "Sidekik23",
                    "score": 1,
                    "created_utc": 1651728432.0,
                    "response": "Go to the App Store and see if you need to update the app. If not, you can delete and reinstall the app.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7ilffk",
                    "author": "wallc7777",
                    "score": 1,
                    "created_utc": 1651810965.0,
                    "response": "May want to check if it's Cash in your Coinbase OR USDC coin.  If I'm not mistaken, you have to purchase/use or convert USDC, the stable coin, not Cash.  \n\nI made the same mistake originally when I first got the card.   Lovin it since",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}