{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uufi4t",
            "title": "Swiss but live in France… Coinbase deverified me and now ID verification fails each time",
            "url": "https://www.reddit.com/r/CoinBase/comments/uufi4t/swiss_but_live_in_france_coinbase_deverified_me/",
            "author": "ilovetablat",
            "created_utc": 1653106881.0,
            "score": 2,
            "num_comments": 8,
            "subreddit": "CoinBase",
            "selftext": "I’ve been using Coinbase for over a year, without any problems.\n\nA few days ago, I bought $20 of Luna. You never know…\n\nRight after that, my account requested a new ID verification. I submitted my Swiss national ID.\n\nHowever, I live in France, and Coinbase requires ID from the country of residency, not origin.\n\nI do not have a French ID because I am not French. I am Swiss.\n\nI called Coinbase phone support and submitted a support request. Support sent me a link to verify my ID again. I did that, but got exactly the same rejection: “Country of residence does not match country of ID documents submitted.”\n\nI also tried to change the country to Switzerland. But Coinbase requests that I first remove 2€ in my cash balance first. However, because my account is now restricted pending ID verification, I cannot withdraw or use the cash to buy crypto. Catch-22.\n\nThere must be many people who live in a country different from their nationality. But Google and Reddit searches did not turn up any solutions, only a few people who have had the same problem.\n\nAny ideas?",
            "stickied": false,
            "comments": [
                {
                    "id": "i9eycfj",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653106881.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ez6cx",
                    "author": "coinbasesupport",
                    "score": 0,
                    "created_utc": 1653107428.0,
                    "response": "Hello there, u/ilovetablat. Please know that your uploaded ID needed for verification purposes should match the country where you're currently located. This is to ensure that your information match and you are within a country or region that is supported by Coinbase. You may refer to this reference for more information: https://help.coinbase.com/en/coinbase/getting-started/verify-my-account/idv-tips\n\nRegarding the changes as suggested by the specialist, can you please share the case number so we can take a look? Thank you!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9f556p",
                    "author": "littlegretti",
                    "score": 0,
                    "created_utc": 1653111608.0,
                    "response": "Aloha, why can’t I buy? \nSo weird, I even did debt n no luck. \nI pull up to buy and it shows one account \nI have 4 accounts in my info/person \nI’m doing something wrong 😑 \nAll accounts in apple wallet too but it’s a no show. Please help. Thanks",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9f5mjp",
                            "author": "coinbasesupport",
                            "score": 1,
                            "created_utc": 1653111976.0,
                            "response": "Hi u/littlegretti! Please send us a support case here https://help.coinbase.com/en/contact-us Once done, let us know the support case number you'll receive via email, so we can look into your account. Thanks!",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9fa4yv",
                                    "author": "littlegretti",
                                    "score": 1,
                                    "created_utc": 1653115680.0,
                                    "response": "Really just looking for a good answer and a triangular",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}