{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uzcwoq",
            "title": "BW Trading Platform (scam?)",
            "url": "https://www.reddit.com/r/CoinBase/comments/uzcwoq/bw_trading_platform_scam/",
            "author": "karsweet12",
            "created_utc": 1653701697.0,
            "score": 1,
            "num_comments": 4,
            "subreddit": "CoinBase",
            "selftext": "Hello! I am new to trading and such and I’m afraid I might’ve been scammed. Can someone please verify that BW as a trading platform is legit? I made profit this month on the platform and when I tried to withdraw, they told me my account was subject to a 10% tax fee on my earnings of the month. After speaking with my brother who has some knowledge on trading and such, he said he hasn’t heard of this platform and that he found it strange that the “tax” had to be paid separately as they won’t take it automatically from your earnings as coinbase does. I might be getting this all wrong, someone please help, I find little to no info online on the platform but last month I successfully withdrew about 100 bucks to test it. So now I’m not sure if they are simply stalling due to the problems happening with bitcoin currently,or if I’m straight up being scammed.",
            "stickied": false,
            "comments": [
                {
                    "id": "ia9j0mp",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653701697.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia9maks",
                    "author": "atomsmasher66",
                    "score": 1,
                    "created_utc": 1653703425.0,
                    "response": "Never heard of it. How did you find it?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia9n08b",
                            "author": "karsweet12",
                            "score": 1,
                            "created_utc": 1653703808.0,
                            "response": "Well that’s a whole other story haha. Someone I’m getting to know, which raises even sketchier energy lol i learned that the platform is based in Singapore though, but that makes me feel even more uneasy. The platform itself has been smooth sailing until this. But I found it so strange that I withdrew with no issues last month and now all of a sudden there’s a “tax”? But I assumed it’s because my profit was so much larger this month. Idk what to think. I feel stupid for even doing this at all without doing some more research beforehand",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}