{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uxba1d",
            "title": "Having Trouble Selling Assets",
            "url": "https://www.reddit.com/r/CoinBase/comments/uxba1d/having_trouble_selling_assets/",
            "author": "RadicalPratical",
            "created_utc": 1653460498.0,
            "score": 1,
            "num_comments": 2,
            "subreddit": "CoinBase",
            "selftext": "Hi I’m very new to this and the other day I put a little bit of money in, but I noticed that I’m not able to sell any of my assets. I’m having no trouble putting money in to buy more but when I try to sell, I get asked to link my bank account, even though I already have, and when I try to do it again, it says that it’s already paired but still is asking for me to link my account, so I’m not able to sell any of the assets I have. Any help would be appreciated",
            "stickied": false,
            "comments": [
                {
                    "id": "i9wmsix",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653460498.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9wn86y",
                    "author": "coinbasesupport",
                    "score": 1,
                    "created_utc": 1653460837.0,
                    "response": "Hello there, u/RadicalPratical. We're sorry if you're having issues with your account and as a new user, we want to make sure that your experience is seamless. Can you please confirm whether you're using the mobile app in accessing your Coinbase account? If yes, can you please do the following:\n\n- Update the app. \n- Update your phone software. \n- Try signing out.\n- Force quit the app.\n- Uninstall and reinstall the app.\n\nIf neither works for you, please try accessing the website and check whether you're able to sell any of your assets there. Please also check if you're seeing your bank account as a payment method.\n\nIf you're able to access your account seamlessly using the web version, please raise a support case so we can have one of our specialist check whether there is an issue with the app. You can raise one here and share with us the case number after: https://help.coinbase.com/en/contact-us. Thank you!",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}