{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uuv8t3",
            "title": "how long it takes for you to verify account when it's locked",
            "url": "https://www.reddit.com/r/CoinBase/comments/uuv8t3/how_long_it_takes_for_you_to_verify_account_when/",
            "author": "runquiksee",
            "created_utc": 1653164715.0,
            "score": 1,
            "num_comments": 7,
            "subreddit": "CoinBase",
            "selftext": "So my ID is expired but the expiration was extended due to the pandemic. But coinbase id verification system is not designed for these circumstances so whenever i have to send it scan my ID for verification it has to be manually approved and it can take days to a week or more. Now that is frustration and I'm actually waiting again after getting locked for my own security protection haha, and i emailed my selfie they requested and I'm just doing what i can only do is wait wait wait \n\nNow im wondering when you have a current ID is the verification process instant and the lock gets removed after? Like instantly? This process I'm going through takes forever i might go and start working on getting a new ID card and that line itself might be hours but better than waiting a week just to approve a selfie",
            "stickied": false,
            "comments": [
                {
                    "id": "i9hl4ek",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653164716.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9hlmtn",
                    "author": "runquiksee",
                    "score": 1,
                    "created_utc": 1653164976.0,
                    "response": "Oh damn i got like 4 messages after i posted this, those are scammers i know just saying damn. Wish my selfie n verification was this quick.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9hmnxw",
                            "author": "coinbasesupport",
                            "score": 1,
                            "created_utc": 1653165490.0,
                            "response": "Hey u/runquiksee - do beware of scammers acting as support and always be sure to check the link the AutoMod shared above to verify you are speaking with us.\n\nHappy to take a quick look and follow up on any ID issue you have been having. If you were able to reach out to us, and create a case for some assistance, would you kindly share your case # with us?\n\nMany thanks and appreciate your patience through this process.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9hqrb1",
                                    "author": "runquiksee",
                                    "score": 1,
                                    "created_utc": 1653167530.0,
                                    "response": "Case #11909669",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9hsmnc",
                                    "author": "runquiksee",
                                    "score": 1,
                                    "created_utc": 1653168495.0,
                                    "response": "11909669",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9hsnt8",
                    "author": "runquiksee",
                    "score": 1,
                    "created_utc": 1653168513.0,
                    "response": "11909669",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}