{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "urnrv1",
            "title": "High fees trying to move CRO and SHIB out of Coinbase Wallet",
            "url": "https://www.reddit.com/r/CoinBase/comments/urnrv1/high_fees_trying_to_move_cro_and_shib_out_of/",
            "author": "Fejimush",
            "created_utc": 1652797918.0,
            "score": 8,
            "num_comments": 41,
            "subreddit": "CoinBase",
            "selftext": "The fees to move or convert CRO and SHIB in Coinbase Wallet are prohibitively high.  \n\nIs there a technique to avoid this?  Such as a wrapper coin, transfer to a lower fee exchange, or a conversion to a different coin that I missed.\n\nBe well.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8yfq8q",
                    "author": "Sir_Lagz_Alot",
                    "score": 9,
                    "created_utc": 1652801253.0,
                    "response": "OP, no such thing as synchronizing wallets. \n\nThe fees you’re seeing are Ethereum network fees. There’s no way to avoid this unless you use an L2 or side chain. Or a different L1 chain. \n\nBasically, you’re beat and gotta pay the fees. And anyone telling you to synchronize your wallet is a scammer.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8z5h5z",
                    "author": "cmdrshepherd1993",
                    "score": 5,
                    "created_utc": 1652811700.0,
                    "response": "I know a way around Ethereum fees… use Bitcoin, Litecoin, Stellar Lumens, Ethereum Classic, AVAX, Bitcoin Cash, & anything else not on Ethereum lol",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8z00vx",
                    "author": "WinnerChknDinner01",
                    "score": 3,
                    "created_utc": 1652809490.0,
                    "response": "Best you can do is monitor the gwei on a website and transfer at it’s lowest point.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8y7sdr",
                    "author": "AutoModerator",
                    "score": 2,
                    "created_utc": 1652797919.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8zdh3i",
                    "author": "Acojonancio",
                    "score": 2,
                    "created_utc": 1652814965.0,
                    "response": "ETH20 things.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8zkcf8",
                    "author": "No_Interest_5818",
                    "score": 2,
                    "created_utc": 1652817788.0,
                    "response": "Both of these are running on the ERC20 platform, Coinbase doesn't support the native CRO network which is why it has much higher fees.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8zkkfi",
                            "author": "No_Interest_5818",
                            "score": 2,
                            "created_utc": 1652817879.0,
                            "response": "Try Litecoin, or something. A stable coin would work too, but make sure that you send it on the correct network.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i90k90w",
                    "author": "REAL-MEETS-REAL",
                    "score": 2,
                    "created_utc": 1652833907.0,
                    "response": "COINBASE\n IS A STRAIGHT FUCKING SCAM SITE RAN BY HENCHMEN THAT ARE CREATED TO TAKE THE FALL..\n THE UNITED STATES GOVERNMENT HAS TO  SCALP GENERATIONAL WEALTH FROM EVERYONE IN THE WORLD THAT CAN ACCESS THE SITE TO HELP FURTHER CRASH OUR ECONOMY AND THEN IN A \"\" OH SHIT  \"\"( MARKET CRASH SCENARIO ) COLLAPSE COINBASE AND HAVE COINBASE CLAIM  BANKRUPTCY . WHICH IN RETURN TRAPS BILLIONS OF DOLLARS STUCK ON COINBASE . FORCING ARBITRATION FROM I WOULD SAY A GOOD 85% OF PEOPLE THAT DO NOT KNOW HOW TO TRADE ON D-APPS OR STORE THERE CRYPTOCURRENCY IN COLD STORAGE WALLETS.. THEN 5 YEARS DOWN THE ROAD PPL CAN COLLECT PENNIES ON THE DOLLAR.\n\nTHINK ABOUT THIS LAST BULL RUN??? THE MONEY JUST FROM BITCOIN, ETHEREUM , SHIBA INU , AND DOGE COIN THAT FLOWED THROUGH SCAM-BASE? NOT COUNTING THE HUNDREDS , IF NOT THOUSANDS OF OTHER COINS THEY HAVE?? THEN THEY WENT PUBLIC AND GOT LISTED ON STOCK EXCHANGE.. \nCOINBASE HAS MANIPULATED THE MARKET PRICES ON SO MANY CRYPTOCURRENCY'S. THEY HAVE SAID HOW MANY TIMES THEY SUPPOSEDLY CRASHED OR QUOTE - UNQUOTE HAD SYSTEM FAILURES AND YOU THOUGHT YOU WAS BUYING YOUR CRYPTO AT A CERTAIN PRICE AND IT WAS 3 TIMES HIGHER THAT WHAT IT Originally SAID YOU WAS PURCHASING IT AT. OR YOU WAS SELLING AND THE CRASH HAPPENED AND THERE WAS A GAP OF 20 TO 30 CENTS AND YOU LOST OUT THAT WAY??\nI HAVE HAD SEVERAL INSTANCES WHERE I PURCHASE MY CRYPTO THE SCREEN AS AN EXAMPLE WILL SAY,\n.10 CENTS and when it goes thru the Receipt from CB will say .17 CENTS. ??? PLUS YOUR FEES FOR THE PURCHASE??? THEY MAKE MONEY OFF YOU FOR SENDING TO A WALLET OUTSIDE CB AND MONEY FROM YOU TO SEND TO YOUR OWN CRYPTO WALLET THAT YOU CAN USE FROM CB FOR YOUR COLD STORAGE??? THEY HAVE THE HIGHEST FEES OF ALL CRYPTO EXCHANGES... \nTHEN ON COINBASE WALLET YOU HAD SO CALLED SCAMMERS WIPING OUT COMPLETE ACCOUNTS??\nI HAD AN ISSUE ONCE AND AFTER MONTHS OF BEING IGNORED BY THE NON EXISTING  COINBASE CUSTOMER SERVICE FOR MONTHS  I HAD FINALLY GOT SUPPORT TO ANSWER MY TICKET. THEN THEY AUTOMATICALLY CLOSE MY TICKET AND SEND ME A HOW DID WE DO E-MAIL?? WAS YOUR PROBLEM SOLVED?? I WAS LIKE WTF?? MY ISSUE WAS SWEPT UNDER THE RUG. I TRY AGAIN AND WEEKS GO BY I FINALLY REACH CB SUPPORT AND THEY SAY MY ISSUE WAS HANDLED AND BY THE END OF THE DAY NOT TO WORRY THE ISSUE WILL NE RESOLVED??\n30 MIN LATER I RECEIVED AN E-MAIL SAYING MY TICKET WAS BEING TERMINATED.. A FEW HOURS GO BUY AND ANOTHER HOW DID WE DO SURVEY??\nSO STILL TO THIS DAY AND OVER 1 YEAR LATER MY ISSUE STILL EXISTS?? THEN I HAD A ISSUE WITH MY COINBASE CARD. I ASKED THAT WOMAN DO YOU HAVE ANOTHER FORM OF IDENTIFICATION OTHER THAN YOUR NAME SO JUST IN CASE I NEED A REFERENCE # OR YOUR CB Identification # TO SAY I SPOKE WITH YOU ? SHE SAYS NO ONLY OUR NAME. WE DO NOT HAVE BADGE NUMBERS OR EMPLOYEE NUMBERS? I SAID THIS IS MY MONEY WERE TALKING ABOUT AND SHE HANGS UP ON ME. ? WHAT KIND OF CUSTOMER SERVICE IS THIS? WERE TALKING ABOUT THOUSANDS OF DOLLARS AT STAKE AND WTF?\nCOINBASE HAS MADE BILLIONS IF NOT INTO TRILLIONS OF DOLLARS. THEY SURVIVE THE LAST BEAR MARKET AND THEY WAS JUST GETTING STARTED AS A COMPANY? YOUR FUCKING TELLING ME BRIAN ARMSTRONG HAS 1 BAD QUARTER IN THIS BEAR MARKET OF 2022 AFTER COMING OUT OF THE BEST BULL RUN CRYPTOCURRENCY HAS SEEN 2 DATE IN 2021 AND NOT EVEN 5 MONTHS AND HE GOES PUBLIC Talking about Bankruptcy?? If you have your CRYPTO on CB exchange you have a chance to lose it all? Something super funny about all this shit???\nWho are the CRIMINALS HERE??? HUMMM THINK ABOUT IT OUTSIDE THE BOX...",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8yiz55",
                    "author": "Fejimush",
                    "score": 1,
                    "created_utc": 1652802596.0,
                    "response": "Was hoping there might be a wrapped coin or some other trick I missed.   Guess not.  \n\nThe amount of CRO and SHIB stuck in there is less then $200 😂.   When buying higher risk alt coins I only get a small amount to make sure something like this doesn’t happen.  Won’t be purchasing any more CRO or SHIB anytime soon.\n\nAll my large crypto assets are safely held in cold storage.  My private keys, my coins.  \n\nIf anyone lands here and is new to crypto don’t keep crypto on exchanges any longer than you have to.  Get a hardware wallet, such as Ledger or Trezor.  \n\nRide safe!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8yf1jr",
                    "author": "zionmatrixx",
                    "score": -1,
                    "created_utc": 1652800969.0,
                    "response": "It's network fees. Go complain to [Crypto.com](https://Crypto.com) and/or SHIB.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8zj3vs",
                            "author": "ktulu88",
                            "score": 1,
                            "created_utc": 1652817275.0,
                            "response": "What...? They have nothing to do with it...?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8zat0w",
                    "author": "Brilliant_Exam_1323",
                    "score": 1,
                    "created_utc": 1652813877.0,
                    "response": "Gas fees duh.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8zsogk",
                    "author": "Confident_Scallion_9",
                    "score": 1,
                    "created_utc": 1652821254.0,
                    "response": "Convert to xlm and move for pennies",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8yd1no",
                    "author": "Fejimush",
                    "score": -10,
                    "created_utc": 1652800128.0,
                    "response": "Thanks to those who pointed me towards manually synchronizing wallets.  Lots of help in chats.  I will look into that later today.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8ydidn",
                            "author": "MrMike0029",
                            "score": 7,
                            "created_utc": 1652800325.0,
                            "response": "People DMing you are scammers, ignore them.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8yfkeh",
                            "author": "Sir_Lagz_Alot",
                            "score": 8,
                            "created_utc": 1652801185.0,
                            "response": "That’s gonna get you scammed.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8ygiz1",
                            "author": "Trololoumadbro",
                            "score": 5,
                            "created_utc": 1652801588.0,
                            "response": "RIP all of OP’s assets. “I was hacked!” post in 24 hours",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8yhj95",
                                    "author": "Fejimush",
                                    "score": 4,
                                    "created_utc": 1652802003.0,
                                    "response": "It’s all good.  \n\nWas pretty sure it was a scam attempt from the get go, and also after a quick web search.  \n\nYou can read the reply thanking the chatters for all the help with a healthy dose of sarcasm.  \n\nWho would invite someone to a chat instead of a quick reply to the original post?  Then suggest to click a link.  That’s a big red flag. \n\nHopefully this will help prevent someone from getting scammed/hacked.\n\nRide safe out there.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8yhtvl",
                                            "author": "Trololoumadbro",
                                            "score": 3,
                                            "created_utc": 1652802124.0,
                                            "response": "Common sense ain’t so common. Glad to see you’ve got it 👍",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8yy581",
                            "author": "tmgbang1325",
                            "score": 2,
                            "created_utc": 1652808739.0,
                            "response": "Holy crap your up there talking about a trezor then sitting here thanking scammers",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i90ngjw",
                    "author": "Decarz",
                    "score": 0,
                    "created_utc": 1652835423.0,
                    "response": "BRISE Will take care of that soon",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}