{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "v0j434",
            "title": "Error message on instant buy",
            "url": "https://www.reddit.com/r/CoinBase/comments/v0j434/error_message_on_instant_buy/",
            "author": "iwishiwasahipster",
            "created_utc": 1653854474.0,
            "score": 0,
            "num_comments": 21,
            "subreddit": "CoinBase",
            "selftext": "I've been trying to purchase BTC and it keeps giving me an error message please try again.   I have my bank account and credit card linked so instant buys always used to go right through.   Is this because of the holiday?   I purchased just using my bank account and it's on hold for 10 days....that's pretty excessive \n\nWhat gives Coinbase??\n\nWhat's that? Ohhh....I hear other exchanges calling my name.",
            "stickied": false,
            "comments": [
                {
                    "id": "iagpopv",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653854474.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iagque6",
                    "author": "coinbasesupport",
                    "score": 1,
                    "created_utc": 1653855023.0,
                    "response": "Hey there.  The error message could be a technical one.  If this is happening on app please make sure that both your app and device are up to date.  We have some steps that can help fix issues like this both on app or over pc here:\nhttps://help.coinbase.com/en/coinbase/other-topics/troubleshooting-and-tips/app-troubleshooting \n\nTrading on Coinbase is instant but no withdrawals are available until your bank has processed the deposit.  That timeframe can vary depending on your bank, and some other methods like debit can be instant without a hold.  You will find that hold length on the confirmation window of your purchase.  More here on that:\nhttps://help.coinbase.com/en/coinbase/trading-and-funding/sending-or-receiving-cryptocurrency/why-is-my-cryptocurrency-withdrawal-delayed\n\nHopefully, this will get everything all fixed up for you.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iak49ns",
                    "author": "dfk814",
                    "score": 1,
                    "created_utc": 1653927242.0,
                    "response": "Coinbase is terribly inconsistent.  Weak infrastructure and controls makes for a really rich Brian Armstrong, CEO. \n\nMove your money to anything else.  They are terrible.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iahf0of",
                    "author": "Kiwip0rn",
                    "score": 0,
                    "created_utc": 1653867169.0,
                    "response": "🙄 ALL exchanges, the funds must clear before sending them out, 6-10 days.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iak89ot",
                            "author": "iwishiwasahipster",
                            "score": 1,
                            "created_utc": 1653928991.0,
                            "response": "I have debit card linked along with bank info...buys (were) are always close to instantaneous.   I've had an account since 2013 even when I just had my bank linked it would only take 3-5 days.\n\nBut thanks for the comment",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iakbg7n",
                                    "author": "coinbasesupport",
                                    "score": 1,
                                    "created_utc": 1653930394.0,
                                    "response": "Thanks for reaching back out on the BTC error. Were you able to make the purchase via desktop or web browser through your device?\n\nYou are correct about using a debit card to buy any crypto u/iwishiwasahipster and the time frames for various payment methods can be seen here: https://help.coinbase.com/en/coinbase/getting-started/add-a-payment-method/payment-methods-for-us-customers\n\nHappy to look into the specific error showing up for you, if you are still running into the problem today. Please let us know.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}