{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ut7f33",
            "title": "Didn’t they used to let you send off the first $1,000 of your purchase?",
            "url": "https://www.reddit.com/r/CoinBase/comments/ut7f33/didnt_they_used_to_let_you_send_off_the_first/",
            "author": "schostack",
            "created_utc": 1652978241.0,
            "score": 2,
            "num_comments": 50,
            "subreddit": "CoinBase",
            "selftext": "I haven’t bought from Coinbase in a while but definitely remember being able to send a thousand dollars worth of coin when you first make the purchase instead of waiting 9 days 🙃",
            "stickied": false,
            "comments": [
                {
                    "id": "i97z0al",
                    "author": "coinbasesupport",
                    "score": 1,
                    "created_utc": 1652978617.0,
                    "response": "Hey there, this delay period is usually a result of banks still processing a deposit request.  Coinbase allows you to trade instantly, but taking it off the platform is delayed until the transaction is officially complete by your bank.  This time period will vary depending on fast your bank is, but some debit cards are usually instant.  \n\nMore here: https://help.coinbase.com/en/coinbase/trading-and-funding/buying-selling-or-converting-crypto/how-long-does-a-purchase-or-deposit-take-to-complete\n\nLet us know if that helps clear things up or if you're still having issues.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i97y2le",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1652978241.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i982kig",
                    "author": "Climbing375",
                    "score": 1,
                    "created_utc": 1652980041.0,
                    "response": "I was always able to move whatever immediately.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i983vet",
                    "author": "JonWick33",
                    "score": 1,
                    "created_utc": 1652980568.0,
                    "response": "I was always about to buy on Coinbase and use the Crypto instantly, until the last time a couple months ago. I ended up waiting like 20+ days and no I didn't do anything wrong or switch anything up. I haven't bought anything off of Coinbase since so I'm not sure if that's just the new norm or what.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i99iz6z",
                            "author": "schostack",
                            "score": 1,
                            "created_utc": 1653003497.0,
                            "response": "Have you found another platform to buy and move immediately?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9b6xck",
                                    "author": "JonWick33",
                                    "score": 1,
                                    "created_utc": 1653041779.0,
                                    "response": "No, I haven't tried any new ones yet.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i98dw35",
                    "author": "--astral--",
                    "score": 1,
                    "created_utc": 1652984622.0,
                    "response": "I'm encountering something similar. Every purchase I've made up until this week was available for trading right away and I've been on Coinbase for years at this point. My last purchase was on 5/15 and I'm still waiting. This includes the USDC for my debit card so I can't even use it.\n\n&#x200B;\n\nSomething has definitely changed...don't even see the transactions as pending on the bank side. Had I known I wouldn't have made the purchases.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9cmqsj",
                            "author": "OkFlamingo8126",
                            "score": 1,
                            "created_utc": 1653065851.0,
                            "response": "Yes, I was always able to trade and transfer immediately,  they changed it to hold for days, and customer service says they always put funds on hold, they just lie",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}