{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "usauyw",
            "title": "USDC balance not available for spending on my coinbase card?",
            "url": "https://www.reddit.com/r/CoinBase/comments/usauyw/usdc_balance_not_available_for_spending_on_my/",
            "author": "15pmm01",
            "created_utc": 1652874036.0,
            "score": 60,
            "num_comments": 173,
            "subreddit": "CoinBase",
            "selftext": "I just added just under $3,200 to my USDC wallet from my bank account. I then tried to spend $2,000 on my coinbase card, and was annoyed to see the transaction declined. I checked my coinbase card, and it said my balance was $1,658. That's not right - it was already slightly over $100, and I just added nearly $3,200 more! So I went ahead and spent $1,650 on my coinbase card, only to see my available funds drop to $74, not $8 like one would expect. Now, after doing nothing, I'm at $68.88. Every time I pull down to refresh, my card balance changes a few cents to a few dollars, which of course should not be happening with USDC. \n\nWhat is going on? I called support and was told this needs further escalation and investigation. I don't expect them to figure it out soon enough, as I have to pay the second half of my credit card bill tomorrow. This presents an issue, as there's no way to get the money back to my regular bank account fast enough to pay from there instead. My USDC wallet currently shows a balance just over $1,600, but the available USDC funds on the coinbase card do not reflect that.\n\nHas anyone experienced this problem? Any ideas what happened and how quickly it can be resolved? Thanks in advance for any help.\n\nEdit: I called my credit card company and explained my dilemma. They gave me a full month extra time to pay this bill with no late fees or interest charges. I now understand that I only have to wait until the ACH transfer clears. That will take less than a month obviously. All is well!\n\nEdit 2: Scammers galore in my inbox right now. Please stop. I'm not an idiot. Everyone trying to phish is being reported to reddit and blocked.",
            "stickied": false,
            "comments": [
                {
                    "id": "i92ba8c",
                    "author": "InternationalTip7782",
                    "score": 3,
                    "created_utc": 1652875669.0,
                    "response": "I’m not sure about the $1000 instant use mentioned before, but I know your “availability” changes whether you add it through a bank or debit card. It’ll say how long you have to wait before you can withdraw it.\n\nThe reason your available balance changes slightly is that even though you have to wait to withdraw your funds, you can use your holdings as “collateral” so basically if you hold $100 in BTC then you will be approved to withdraw that amount early (and since your crypto holdings fluctuate, your “collateral” fluctuates)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i92esbf",
                    "author": "laaaaance23",
                    "score": 2,
                    "created_utc": 1652877632.0,
                    "response": "Does the card give any benefits or perks?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i92exiw",
                            "author": "15pmm01",
                            "score": 3,
                            "created_utc": 1652877708.0,
                            "response": "Yes, 4% cash back in crypto. That's why I use it to pay my credit card bill rather than direct from my bank account.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i92fga1",
                                    "author": "dpjackal89",
                                    "score": 2,
                                    "created_utc": 1652877988.0,
                                    "response": "Don't abuse that feature too much.  I just had my card unlocked after a week of hassling customer support. They blocked my card for breaking the terms. Just an FYI.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i92fkrf",
                                            "author": "15pmm01",
                                            "score": 3,
                                            "created_utc": 1652878053.0,
                                            "response": "What? I don't understand, I thought the whole point of the card was the cash back, how can they say you are abusing it?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i92yir7",
                                                    "author": "BiochemBeer",
                                                    "score": 8,
                                                    "created_utc": 1652886677.0,
                                                    "response": "Using their credit card to pay off other credit cards is the issue.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i94kntm",
                                                            "author": "15pmm01",
                                                            "score": 1,
                                                            "created_utc": 1652910418.0,
                                                            "response": "Again why would this be an issue? It's a debit card being used to pay a credit card bill, pretty normal stuff.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i94kwl2",
                                                                    "author": "BiochemBeer",
                                                                    "score": 2,
                                                                    "created_utc": 1652910521.0,
                                                                    "response": "It's seen as credit paying credit. That's the issue with the TOS. I mean it may not seem logical to you but the credit card companies see it as double dipping on rewards points.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i94l3q3",
                                                                            "author": "15pmm01",
                                                                            "score": 0,
                                                                            "created_utc": 1652910605.0,
                                                                            "response": "It absolutely is double dipping on reward points, that's the entire point of it. Do they actually have something against this in their TOS?",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i93fvo0",
                                            "author": "___run",
                                            "score": 3,
                                            "created_utc": 1652893711.0,
                                            "response": "My card is blocked permanently for doing it again after first unblock.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i93kjq5",
                                                    "author": "dpjackal89",
                                                    "score": 1,
                                                    "created_utc": 1652895603.0,
                                                    "response": "What exactly were you doing on the card that you think might have set it off?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i93oa3d",
                                                            "author": "___run",
                                                            "score": 1,
                                                            "created_utc": 1652897088.0,
                                                            "response": "Paid off credit card balance using Coinbase debit card.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9671o2",
                                                                    "author": "15pmm01",
                                                                    "score": 1,
                                                                    "created_utc": 1652940413.0,
                                                                    "response": "I can’t fathom why Coinbase would have a problem with this. A debit card payment is a debit card payment…",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i94z8xp",
                                            "author": "brazzersjanitor",
                                            "score": 1,
                                            "created_utc": 1652917000.0,
                                            "response": "How long were you doing it for and via what method? Just wondering…for a friend.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i92fcnf",
                                    "author": "laaaaance23",
                                    "score": 1,
                                    "created_utc": 1652877934.0,
                                    "response": "Whats the catch tho? Do i need to stake or something?\nAnd also pay for the card?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i92fjdu",
                                            "author": "15pmm01",
                                            "score": 3,
                                            "created_utc": 1652878033.0,
                                            "response": "No catch that I'm aware of. You just spend USDC, no fees involved.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i949p3p",
                    "author": "rueben023",
                    "score": 2,
                    "created_utc": 1652905817.0,
                    "response": "It takes about 7 days for your USD to be available for purchases, you can trade instantly tho.\n\nIf you have other exchanges account, consider buying something like Solana or ADA and immediately send it to Coinbase...in about 2-4 hours you can use that to use your Coinbase card.\n\nIts all about the math with the fees and crypto volatility so DYOR before moving money around",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9290cq",
                    "author": "coinbasesupport",
                    "score": 2,
                    "created_utc": 1652874292.0,
                    "response": "Thanks for reaching out about this issue with your Coinbase Card balance, u/15pmm01. \n\nPlease share your support case number with us, and we can take a look at this for you. \n\nIf don't have a support ticket yet, you can open one with our team here: https://help.coinbase.com/en/contact-us. Many thanks.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i92ad0v",
                    "author": "pcm2a",
                    "score": 1,
                    "created_utc": 1652875119.0,
                    "response": "This is because support is a joke and doesn't know their own product.\n\nCoinbase allows $1000 of \"instant\" money per 24 hours. You can spend that $1000 with your card. You can buy crypto with it and withdraw it. It's instantly yours. \n\nThe amount over $1000 will be locked for a number of days. You can buy crypto with it, but you cannot withdraw it or use your card with it.\n\nAfter 24 hours you can send in another $1000 of instant money. The previous overage will still be locked. If you need to spend $3000 then make sure to start adding in $1k a day a few days early.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i92dgbs",
                            "author": "15pmm01",
                            "score": 2,
                            "created_utc": 1652876902.0,
                            "response": "Well shit. That's really unfortunate. Wish I knew, would have been adding it in $1,000 increments day by day ahead of time!",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i92dphr",
                                    "author": "pcm2a",
                                    "score": 1,
                                    "created_utc": 1652877041.0,
                                    "response": "You would think at least their bogus support could know it :(",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i92hu6e",
                    "author": "drafterman",
                    "score": -2,
                    "created_utc": 1652879210.0,
                    "response": "\\> I just added just under $3,200 to my USDC wallet from my bank account.\n\n\\>  I'm not an idiot.\n\nPick one.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i92hyn2",
                            "author": "15pmm01",
                            "score": 5,
                            "created_utc": 1652879272.0,
                            "response": "So funny.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i928lr2",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1652874036.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i92h4lr",
                    "author": "VegasTesla1",
                    "score": 1,
                    "created_utc": 1652878851.0,
                    "response": "I did a ach transfer to usd and it usually is available with in a half hour.  I get a email saying it is ready for withdrawal.   I just transferred $600 to it this morning for my wife to use today and I got the email shortly after.  I at first had the same issue.  I wonder if you transfer to usd instead of usdc and also if you use it more often.  🤷🏻‍♂️",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i92ztle",
                    "author": "Klutzy_Trouble6043",
                    "score": 1,
                    "created_utc": 1652887219.0,
                    "response": "If you log in a computer it lets you know how many days till it settles on your usdc wallet. Sometimes 5 days and it’ll show your balance more accurately",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i937l3c",
                    "author": "Mattcwu",
                    "score": 1,
                    "created_utc": 1652890391.0,
                    "response": "When did you apply for your card? I feel like I've been on the wait-list forever.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i953kxz",
                            "author": "15pmm01",
                            "score": 1,
                            "created_utc": 1652919062.0,
                            "response": "Can't even begin to remember. I've had it for a long time now.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i93eqys",
                    "author": "Lish81",
                    "score": 1,
                    "created_utc": 1652893258.0,
                    "response": "Hmm I have 500,000 that’s luck up by Coinbase.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9444vu",
                    "author": "vvvA3",
                    "score": 1,
                    "created_utc": 1652903543.0,
                    "response": "I’ve faced this issue many times. It happens randomly tbh. One week I can deposit $1k and spend it instantly and the next week I can deposit $100 and have to wait a couple of days before being able to spend it. It’s a big annoyance but, I just tend to load up a lot of cash on the card so I can avoid this issue.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i94zllw",
                    "author": "rammerjammin",
                    "score": 1,
                    "created_utc": 1652917168.0,
                    "response": "For future reference just add $1000 per day. Anything over that will lock your funds for like 7 days.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i95aeaz",
                    "author": "AmericanScream",
                    "score": 1,
                    "created_utc": 1652922267.0,
                    "response": "Most credit card companies prohibit doing transactions with crypto companies on their cards.  I'm surprised they didn't cancel your account.  It's too risky.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i96740u",
                            "author": "15pmm01",
                            "score": 1,
                            "created_utc": 1652940464.0,
                            "response": "How would my credit card company know it’s crypto related? They just see it as a debit card payment as far as I know.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i97hx89",
                                    "author": "AmericanScream",
                                    "score": 1,
                                    "created_utc": 1652971658.0,
                                    "response": "They may or may not know.  Some have \"blacklists\" of companies they won't allow transactions with.  You should read your ToS for your credit card, specifically under \"prohibited transactions\" - Coinbase, for example, will not allow their cards to be used for any gambling or other crypto-related companies either.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i96r828",
                    "author": "vigor3",
                    "score": 1,
                    "created_utc": 1652957672.0,
                    "response": "I have the exact same issue. I've never had any hold when purchasing USDC and spending it immediately with CB card. They changed something with requiring collateral. \n\nI've been using my card for a year now and never once have I ran into this issue. \n\nThe MORE frustrating thing for me is that the money has already cleared my bank account yet is still pending on CB. If it were still pending, I guess that's reasonable but after it's already been processed and taken out of my account there should be no reason for a hold. I think it's an arbitrary amount of time regardless of whether it's been completed or not. \n\nThe amount available to spend fluctuates with portfolio value.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i96ukh0",
                            "author": "coinbasesupport",
                            "score": 1,
                            "created_utc": 1652959968.0,
                            "response": "Thanks for your response. \n\nWe're happy to look into this for you. Can you get back to us with your case number please?\n\nWe'll follow up on this with you.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i97ufvb",
                                    "author": "vigor3",
                                    "score": 1,
                                    "created_utc": 1652976787.0,
                                    "response": "491808",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i97y8mv",
                                            "author": "coinbasesupport",
                                            "score": 1,
                                            "created_utc": 1652978310.0,
                                            "response": "Hey Vigor, We ask that you respond to the case via email as the specialist on that case will have more insight. Reading about your problem directly.  Is this more of an ACH clearing issue, or did you convert your USDC from another crypt?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i97yehe",
                                                    "author": "vigor3",
                                                    "score": 1,
                                                    "created_utc": 1652978376.0,
                                                    "response": "ACH clearing issue. I have not converted one crypto to USDC.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9805zh",
                                                            "author": "coinbasesupport",
                                                            "score": 1,
                                                            "created_utc": 1652979078.0,
                                                            "response": "Ok! So it is standard practice with crypto exchanges to hold an asset if it was bought with an ACH.  You can convert your purchase within the exchange, but will not be able to move it off-platform.\n\nHow long ago did you buy your crypto with your ACH? We also ask if it is okay to message you with the Mod Mail just in case you need to relay any sensitive information we do not want to display publicly.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i980l3i",
                                                                    "author": "vigor3",
                                                                    "score": 1,
                                                                    "created_utc": 1652979247.0,
                                                                    "response": "It was May 15th. Again, I've never had this issue ever in a year of use. Also, the money has already cleared ACH and has been removed from my bank account, so it's not like it's still waiting to settle. Feel free to respond with Mod Mail. Thanks for your assistance!",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i983nf3",
                                                                            "author": "coinbasesupport",
                                                                            "score": 1,
                                                                            "created_utc": 1652980478.0,
                                                                            "response": "We sent you a message via Mod Mail! Please respond there to continue your investigation into your ACH issue.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i96teso",
                    "author": "necbone",
                    "score": 1,
                    "created_utc": 1652959199.0,
                    "response": "This is why these shit exchanges aren't really ready for prime time... my card declines every time I'm ready to do some serious bill paying..",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i96yyq2",
                    "author": "Bdizzle419",
                    "score": 1,
                    "created_utc": 1652962612.0,
                    "response": "They’re fucking with my usdc too man and I’ve had 800$ on my card for over 2 weeks and it just vanished last night at 8pm est",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i971iy2",
                            "author": "coinbasesupport",
                            "score": 1,
                            "created_utc": 1652964041.0,
                            "response": "Hi there, I'm sorry to hear about this unauthorized transaction. Please be sure to report this to cardsupport@coinbase.com or call your local support number from the app by accessing Card Settings > Call Support. If you need further assistance, please let us know.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i977l3g",
                    "author": "Haven_on_earth",
                    "score": 1,
                    "created_utc": 1652967076.0,
                    "response": "I had same problem \nIt takes up to 10 days\nBeware there will be lots of scammers turning to \"help\" never click on any their bogus links\nJust sharing what happened to me when asked same question as you",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i98rigj",
                    "author": "crusoe",
                    "score": 1,
                    "created_utc": 1652990191.0,
                    "response": "Why not use a normal debit card since USDC is just fiat with extra steps and without FDIC insurance?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i98rqbo",
                            "author": "15pmm01",
                            "score": 1,
                            "created_utc": 1652990282.0,
                            "response": "4% crypto back... The only reason anyone would ever use the coinbase card",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i929pdw",
                    "author": "_stoned_chipmunk_",
                    "score": 0,
                    "created_utc": 1652874719.0,
                    "response": "This same thing happened to me. Balance changes every time you look it seems like. When they changed the rewards program they screwed something up. It will take a week or more to resolve itself and CB customer service is a total joke and won't help you at all.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i929x7f",
                            "author": "15pmm01",
                            "score": 1,
                            "created_utc": 1652874852.0,
                            "response": "Oh, how lovely. I guess time to call my credit card company and beg for a zero-interest extention on this month's bill...",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i92xe99",
                                    "author": "odth123456",
                                    "score": 1,
                                    "created_utc": 1652886210.0,
                                    "response": "You’re your own bank, though 😂",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i92a32d",
                                    "author": "_stoned_chipmunk_",
                                    "score": -3,
                                    "created_utc": 1652874951.0,
                                    "response": "CB is completely unprofessional and will lie to you. They are bleeding users and capital. \n\nhttps://www.usatoday.com/story/money/2022/05/11/coinbase-bankruptcy-risk-crypto/9736901002/",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i93jo65",
                    "author": "demystifier",
                    "score": 0,
                    "created_utc": 1652895246.0,
                    "response": "\\>I called my credit card company and explained my dilemma. They gave me a full month extra time to pay this bill with no late fees or interest charges.  \n\n\nWhats that? Traditional financial sector showing itself to be safer and more reliable than crypto spaces again?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i953ixr",
                            "author": "15pmm01",
                            "score": 1,
                            "created_utc": 1652919035.0,
                            "response": "Was this ever in doubt? I have never felt that crypto is safe or reliable. I am just treating it like stocks, investing for hope of return. I only use the coinbase debit card because of the 4% crypto back.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i95s0ot",
                    "author": "Secure_Worldliness55",
                    "score": 0,
                    "created_utc": 1652930779.0,
                    "response": "Shouldn't have waited for the last minute to pay off your cc. Shit happens, cb support isn't the best to resolve in time. Dot your dues and cross your tees.\n\nYou got lucky w your cc company extending the payment by 1mo.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i960men",
                            "author": "15pmm01",
                            "score": 1,
                            "created_utc": 1652935865.0,
                            "response": "I always pay it right before it’s due, so as to maximize the amount of interest I earn in my bank account. Has never been an issue before. Now I know better when using Coinbase card.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i96bmk1",
                    "author": "Crypto_illumination",
                    "score": 0,
                    "created_utc": 1652944091.0,
                    "response": "Wait dude",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i96ijn3",
                    "author": "Ok_Cauliflower_1350",
                    "score": 0,
                    "created_utc": 1652950284.0,
                    "response": "Your money is gone.Welcome to cryptoland!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i97s0pj",
                    "author": "stang99x",
                    "score": 0,
                    "created_utc": 1652975808.0,
                    "response": "I signed up for all the big exchanges before the world of crypto changed.  They all gladly sent you a a debit card back then.  I have 5 or 6 in a drawer somewhere, and have never used one for so much as a penny.  These things aren't banks.  NOTHING crypto is guaranteed, hence that recent failure of the \"stablecoin\" TerraUSD that plummeted in value under 13 cents in a single day, with it's supporting coin losing nearly 100% thereafter.  You're in the waning days of the wild west for crypto and any investment into any of it could go to zero and you'd be screwed.  The loss of 2 trillion in market value since November is telling enough.  I rode that pony right to the slaughterhouse myself and won't make that mistake again.  Words for the wise?  Find another card to use, lest ye like gamblin your personal credit on hopes and dreams like that commercial....I'm a millionaire!.......I'm not a millionaire?.......",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}