{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uytq4e",
            "title": "Email about ID verification for potential Russian costumers",
            "url": "https://www.reddit.com/r/CoinBase/comments/uytq4e/email_about_id_verification_for_potential_russian/",
            "author": "danimfernandes",
            "created_utc": 1653640660.0,
            "score": 8,
            "num_comments": 50,
            "subreddit": "CoinBase",
            "selftext": "Dear Coinbase, u/coinbasesupport,  \nThere is an email going around telling me I need to provide my ID to prove I am not a russian citizen. My account is at maximum level, therefore I have already provided my ID. Is this email a scam, or did you somehow lose my ID verification documents? I couldn't find proper information whether this email is a scam or not. Also, I can't use your in-app support because when I request the confirmation email code to be able to send the message, no email arrives and I've been waiting for over half an hour. Considering that the code is only valid for 15 minutes, that's just a horrible thing to see in the internet in year 2022.",
            "stickied": false,
            "comments": [
                {
                    "id": "ia683lj",
                    "author": "coinbasesupport",
                    "score": 3,
                    "created_utc": 1653642254.0,
                    "response": "Hi u/danimfernandes, thanks for your question!\n\nIf you're ever unsure about whether an email is really from Coinbase, you can check this by comparing the email address to the ones listed in this article: https://help.coinbase.com/en/coinbase/privacy-and-security/other/is-this-email-really-from-coinbase.\n\nAlternatively, you can email security@coinbase.com to check this before replying to the message. Or you can certainly write to us here: https://help.coinbase.com/en/contact-us.\n\nHope this helps!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia7cqlw",
                            "author": "danimfernandes",
                            "score": 2,
                            "created_utc": 1653665499.0,
                            "response": "My supposed case number is #11679934. If the email was really legitimate (which I don't think you have yet been able to confirm to me and to the other person here, even after 9 posts on this thread), you should also know that my account is verified so it makes no sense to have to submit my documents again - and I won't do that via email. If this request shows up in the app, I would likely follow up on it, but not through emails that can easily be scam.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iaafpvy",
                                    "author": "ghitaprn",
                                    "score": 1,
                                    "created_utc": 1653723039.0,
                                    "response": "I don't know about you, but after almost 22h of waiting i liquidated everything from coinbase. Is already ridiculous to wait so long to confirm if an email is spam or not.\nLuckily i have legal insurance, and if they will freeze my account without any base, I will contact my legal firm",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iaafves",
                                            "author": "ghitaprn",
                                            "score": 1,
                                            "created_utc": 1653723176.0,
                                            "response": "Not to mention that because coinbase poor support and shady practices I become target for scamming. I still don't how the scamer got the exact message that I sent in private to coinbase support (it contained some typo the message and this is how I am sure is the same)",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "iacj2xp",
                                            "author": "danimfernandes",
                                            "score": 1,
                                            "created_utc": 1653767510.0,
                                            "response": "Yeah, I ended up doing the same. Had very little stuff there anyway. Just not sure how I feel about a single exchange out there asking for a proof of residency. I'm sure they could have done this very differently (in the end they do have access to quite a bit of information already, for the verified users who transfer fiat to Coinbase).",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia66c66",
                    "author": "AutoModerator",
                    "score": 2,
                    "created_utc": 1653640661.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia69jxd",
                    "author": "Sensitive_Tailor_904",
                    "score": 3,
                    "created_utc": 1653643577.0,
                    "response": "Slava Ukraine! 🇺🇦",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia6nfdl",
                    "author": "Dartagnonymous",
                    "score": 1,
                    "created_utc": 1653653769.0,
                    "response": "Russian costumers are Russians in costumes trying to look like non-Russians? Or are they non-Russians in costumes trying to look like Russians?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia680b8",
                    "author": "ghitaprn",
                    "score": 1,
                    "created_utc": 1653642173.0,
                    "response": "I have the same issue. I received an email stating that my account will be locked and the funds frozen due to anti Russian regulations. The thing is that I am not russian, I never even being to Russia, I never have any russian relatives. \n\nThis is already ridiculous to flag all EU citizens as russians. I will withdraw all my funds from coinbase and never use this scamming company",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia686et",
                            "author": "coinbasesupport",
                            "score": 1,
                            "created_utc": 1653642325.0,
                            "response": "Hi u/ghitaprn, thanks for your message.\n\nWe'd like to follow up on this, please send our support team a message here: https://help.coinbase.com/en/contact-us they will investigate this further.\n\nIf you already have a case number, you can also get back to us here, so we can check it out.\n\nThanks.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia68o19",
                                    "author": "ghitaprn",
                                    "score": 1,
                                    "created_utc": 1653642774.0,
                                    "response": "There is no option for my problem in the web form. I submitted something under data privacy. I have a case number, but I doubt that will be resolved in time. I have no problem verifying my identity, but I have a problem with the fact that I wasn't notified in the coinbase application, just thorough an email that looks very shady, and in app I don't find any way to do this verification. \n\nSo I either risk sharing my personal ID with some unknown party, or risk having my account locked. Is a difficult choice, but the safest is to drop entirely coinbase, as seems to be very risky from a security point a view. Coinbase should have a fast mechanism to verify phishing emails. Paypal has this, if I receive a suspicious email, I sent it to Paypal, and very fast I get a confirmation.\n\nI am also KYC verified.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia696yy",
                                            "author": "coinbasesupport",
                                            "score": 1,
                                            "created_utc": 1653643245.0,
                                            "response": "We're happy to look into this for you u/ghitaprn. \n\nCan you get back to us with your case number please? \n\nWe'll follow up on this with you.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia69dpx",
                                                    "author": "ghitaprn",
                                                    "score": 1,
                                                    "created_utc": 1653643416.0,
                                                    "response": "I sent the case ID's via private message",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "ia6a0d3",
                                                            "author": "coinbasesupport",
                                                            "score": 1,
                                                            "created_utc": 1653644000.0,
                                                            "response": "Thanks for getting back to us, u/ghitaprn.\n\nWe're unable to view this private message, can you post it here on this thread, so we can follow up please?\n\nWe'll keep an eye out for it.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "ia6a3m4",
                                                                    "author": "ghitaprn",
                                                                    "score": 1,
                                                                    "created_utc": 1653644081.0,
                                                                    "response": "Hi, my initial case id is Case #11680240 concerning the fact that I may be russian. I submitted today another case # 12002810",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "ia6ahzd",
                                                                            "author": "coinbasesupport",
                                                                            "score": 1,
                                                                            "created_utc": 1653644442.0,
                                                                            "response": "Great thanks, u/ghitaprn.\n\nWe're going to research your cases, no need to reply, we'll be right back to you.\n\nWe appreciate your patience.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        },
                                                                        {
                                                                            "id": "ia6b1ff",
                                                                            "author": "coinbasesupport",
                                                                            "score": 1,
                                                                            "created_utc": 1653644919.0,
                                                                            "response": "Thanks for waiting while we reviewed your cases, u/ghitaprn.\n\nWe've gone ahead and escalated this to the relevant team for review, they will get back to you as soon as possible when they have an update.\n\nWe appreciate your patience while we resolve this.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "id": "ia71750",
                                                                    "author": "ghitaprn",
                                                                    "score": 1,
                                                                    "created_utc": 1653660640.0,
                                                                    "response": "Hi u/coinbasesupport, can you clarify how my initial private message to you, that you claim you didn't received has arrived at a possible scam account?\n\nCan you clarify if CoinbaseSupport\\_Cs1 is a handle of a coinbase representative?",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "ia740zi",
                                                                            "author": "coinbasesupport",
                                                                            "score": 1,
                                                                            "created_utc": 1653661874.0,
                                                                            "response": "Hi there. Please do not enter any information into this website. This is most likely a scam. Legitimate Coinbase staff will never ask you to download 3rd party sites or give out keys, login credentials or pay in crypto. If you are ever in doubt if you are speaking to a real representative, you can always email security@coinbase.com the link, email, site or a message to double-check. You can see our list of verified accounts on social media platforms here: https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media. Thanks.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "ia6c1zt",
                            "author": "prince2lu",
                            "score": -2,
                            "created_utc": 1653645793.0,
                            "response": "You have a russian accent though. Kinda sus",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "ia6hett",
                            "author": "vernes1978",
                            "score": 0,
                            "created_utc": 1653649923.0,
                            "response": "And? Was the message sent by coinbase?  \nOr by a scammer who just wanted your id documents?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia6jvtk",
                                    "author": "ghitaprn",
                                    "score": 0,
                                    "created_utc": 1653651601.0,
                                    "response": "I still don't have any response. I think the safe game here will be to liquidate everything to BTC and withdraw everything  from coinbase. The fact that there is no way to check if an email is spam or your open support cases is making me lose the trust in the platform. Is a shame, because in my country coinbase was the easiest to use. But, security is more important",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia6kbei",
                                            "author": "vernes1978",
                                            "score": 1,
                                            "created_utc": 1653651875.0,
                                            "response": "> I still don't have any response. I think the safe game here will be to liquidate everything to BTC and withdraw everything from coinbase. The fact that there is no way to check if an email is spam or your open support cases is making me lose the trust in the platform. Is a shame, because in my country coinbase was the easiest to use. But, security is more important\n\n\nIf it turns out to be a scammer, that scammer just talked you into deleting your coinbase account.  \nWould this also work for your insurance?  \nBecause this is a great way for any competition to shake some accounts lose.  \n\"Your insurance policy will be frozen unless you can prove you aren't Russian\"  \nAnd a few days later hit your target again with your own insurance company offer.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia6l88c",
                                                    "author": "ghitaprn",
                                                    "score": 1,
                                                    "created_utc": 1653652449.0,
                                                    "response": "Probably, but in this case I can call my insurance company to verify. \n\nThe problem with coinbase is that they don't offer any tool to verify if an email is spam. They just say to verify the domain. In my case, the domain is correct, [coinbase.com](https://coinbase.com), but this can be faked also. The probably spam email also has a case number, but I can check anywhere my open cases or tickets.\n\nAnd via the official chat, I can't get in touch with an operator.\n\n&#x200B;\n\nSo far, what I know is that the email looks legit, and coming from coinbase. Coinbase sent emails to russian citizens, that from what I see on google, are similar to what I got. \n\n&#x200B;\n\nSo even if a scammer talked me into deleting my coinbase account, is actually coinbase fault that they didn't provide enough security and support. \n\nAnd if the email is truly legit, it makes me wonder if coinbase sent similar emails to all their europeans customers.  I for one, I am residing in western Europe, I was born in an EU country, my original language is not using cyrilic alphabet, I don't have russian name, and I have a verified account, with driving licence and Id on the record.  So, is strange...",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "ia6ngib",
                                                            "author": "vernes1978",
                                                            "score": 0,
                                                            "created_utc": 1653653787.0,
                                                            "response": "> wonder if coinbase sent similar emails to all their europeans\n  \nNot me in any case.  \n  \nAnd you do have a point.  \nCoinbase should have at least have a \"copy\" of the email sent to a account's email, inside the account's profile page or something.  \nLike a notification.  \n/u/coinbasesupport this might fix the question if an email is legit.  \nHave the emails exist as \"message\" on the coinbase website, and send out the email as a copy.  \nThat way people can quickly see the email is legit because it's the same as the message when they log into the website.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "ia6ks13",
                                            "author": "coinbasesupport",
                                            "score": 1,
                                            "created_utc": 1653652168.0,
                                            "response": "Thanks for your reply. Please see [this article](https://help.coinbase.com/en/coinbase/privacy-and-security/other/is-this-email-really-from-coinbase) for more information on receiving emails from Coinbase. \n\nAs noted, your case has been escalated to our team, and they'll reach out via your support case once they have an update to share. Many thanks.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia6mdfa",
                                                    "author": "ghitaprn",
                                                    "score": 1,
                                                    "created_utc": 1653653142.0,
                                                    "response": "According to that article, the email that I received is legit. What I am talking about is that you don't have an online form to report scam emails. Like I said, I received some time ago an email from Paypal, that seemed very legit, but they had online submission forms, and they were able to confirm me in a couple of hours that it was indeed a scam.\n\nSo my account will be locked in 3 days because coinbase considers that I am russian. it may be either because the coinbase employees are poorly payed, or the system is broken, or other things. But the fact that my account and my funds can be freezed without any proof, is concerning to me.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "ia6me3d",
                                                            "author": "Paid-Not-Payed-Bot",
                                                            "score": 1,
                                                            "created_utc": 1653653153.0,
                                                            "response": "> are poorly *paid,* or the\n\nFTFY.\n\nAlthough *payed* exists (the reason why autocorrection didn't help you), it is only correct in:\n\n * Nautical context, when it means to paint a surface, or to cover with something like tar or resin in order to make it waterproof or corrosion-resistant. *The deck is yet to be payed.*\n\n * *Payed out* when letting strings, cables or ropes out, by slacking them. *The rope is payed out! You can pull now.*\n\nUnfortunately, I was unable to find nautical or rope-related words in your comment.\n\n*Beep, boop, I'm a bot*",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "ia6n30h",
                                                            "author": "coinbasesupport",
                                                            "score": 1,
                                                            "created_utc": 1653653565.0,
                                                            "response": "Thanks for your reply. You can report phishing emails and sites to security@coinbase.com. \n\nYou can find out more about reporting phishing [here](https://help.coinbase.com/en/coinbase/privacy-and-security/avoiding-phishing-and-scams/reporting-phishing-sites). \n\nRest assured our team will follow up on your support case once they've reviewed your query. Thanks again.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iab6x98",
                    "author": "Connect-Ad-1088",
                    "score": 1,
                    "created_utc": 1653744286.0,
                    "response": "Russians wearing costumes is never a good thing imo.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iabo42f",
                    "author": "_n_body",
                    "score": 1,
                    "created_utc": 1653752817.0,
                    "response": "This is amazing day for crypto holders, sharing with you guys, hope it helps people. https://2x-em.org/",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia67scl",
                    "author": "DNGRHLVTCA",
                    "score": 0,
                    "created_utc": 1653641977.0,
                    "response": "No comrade, email is legit. Please to be follow instructions in received email message. Have a well day",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}