{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uwennz",
            "title": "Coinbase Account Locked",
            "url": "https://www.reddit.com/r/CoinBase/comments/uwennz/coinbase_account_locked/",
            "author": "knokkkor",
            "created_utc": 1653352777.0,
            "score": 9,
            "num_comments": 82,
            "subreddit": "CoinBase",
            "selftext": "Never happened to me before so this is my first time. I went through the verification process so we'll see how it goes. It says my account should be active no later than \\~24 hours later.\n\nI wasn't doing any abnormal activity.. just bought more BTC/ETH then withdrew to my cold wallet and then suddenly I couldn't deposit money or do anything else and then I was signed out of my account.\n\nWill update y'all tomorrow.\n\n&#x200B;\n\nEdit: My account is verified and has been verified since 2013. I've transacted several hundred thousand through my account.\n\n&#x200B;\n\nEdit: May 24 @ 4:43PM PST Account automatically unlocked as stated in the message saying when it would be unlocked.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9rbmah",
                    "author": "Kiwip0rn",
                    "score": 4,
                    "created_utc": 1653357827.0,
                    "response": "Likely they still had your former ID for verification and it just needed an update because it had expired.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9rpzpm",
                    "author": "Accomplished-Way7608",
                    "score": 1,
                    "created_utc": 1653365464.0,
                    "response": "Coinbase is insolvent and needs your funds to pay off the whales who are cashing out. That's why they lock accounts randomly.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9tlbva",
                            "author": "Particular_Deer8272",
                            "score": 1,
                            "created_utc": 1653408550.0,
                            "response": "Insolvent? I don't use coinbase but do you have a source? I can't find anything on this",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9r134c",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653352777.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9rcf5m",
                    "author": "EvenFlounder1251",
                    "score": 1,
                    "created_utc": 1653358209.0,
                    "response": "1 (888) 908-7930that should  be customer number they might be able to unlock",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9szscg",
                    "author": "ComprehensiveTax4730",
                    "score": 1,
                    "created_utc": 1653399212.0,
                    "response": "I’ll be exiting as soon as possible, did I mention that after having my Coinbase Card stolen abs used, they NEVER refunded my money? Like every other credit card I’ve ever had has ALWAYS refunded fraudulent charges, NOPE not Coinbase, going into a wallet soon as ETH2 staking is released",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9t0dqy",
                            "author": "coinbasesupport",
                            "score": 1,
                            "created_utc": 1653399499.0,
                            "response": "Hi there, thanks for reaching out about this. Kindly share your case number, and we will gladly take a closer look into this for you. Thanks.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9t5jse",
                                    "author": "ComprehensiveTax4730",
                                    "score": 1,
                                    "created_utc": 1653401898.0,
                                    "response": "Lmao, after 7 months and at least 5 attempts, no thanks",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9thhxi",
                            "author": "knokkkor",
                            "score": 1,
                            "created_utc": 1653406972.0,
                            "response": "Because the coinbase card isn’t a credit card. It’s a debit card no?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9tj1u6",
                                    "author": "ComprehensiveTax4730",
                                    "score": 1,
                                    "created_utc": 1653407615.0,
                                    "response": "True. Even so, my bank is the same way, never been an issue with refunding, especially from something like “GlobalBillspay” from half a world away 🤣. You live and learn, I imagine when it comes crashing down I’ll be lucky to only be out a couple hundred bucks",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9u3f82",
                    "author": "Holyballs92",
                    "score": 1,
                    "created_utc": 1653415969.0,
                    "response": "You are experiencing  what I am currently. Seems like shady business  practices on coinbase. Moved all my funds to a cold wallet and now I cant buy or send crypto but I can sure sell it convert it and receive  it \n\nI been trying yo get validated  but it always seems to fail I contacted the support and they just sent me a email on how to get verified but when I told them it didn't work they asked me to call back lol been like this a week so far .  they said my restriction to send crypt should be lifted on the 26th but can't believe  anything they say because they haven't been transparent \n\n\nI did see a article a couple weeks ago about coinbase getting sued \n\nLook up bitcoin coinbase lawsuit you will probably  find some stuff that will connect the dots",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9w4ar5",
                    "author": "3rdchromosome21",
                    "score": 1,
                    "created_utc": 1653448861.0,
                    "response": "I get locked just for using a VPN. Their unintelligent system assumes it's a hacker to protect themselves. I thought most tech firms would understand that an IP address is not even close to an identity. I'm sure 99% of their users don't switch IPs much so they are erring on the side of safety to protect their interests, even though I have an authenticator.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9w59cj",
                            "author": "coinbasesupport",
                            "score": 1,
                            "created_utc": 1653449338.0,
                            "response": "Hi u/3rdchromosome21! Please send us a support case [here](https://help.coinbase.com/en/contact-us). Once done, let us know the support case number you'll receive via email, so we can follow it up. Thanks!",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9w7h64",
                            "author": "knokkkor",
                            "score": 1,
                            "created_utc": 1653450506.0,
                            "response": "A lot of companies use IP as part of an identity and other factors as well. Especially when you're using a VPN, it is obviously used to mask your IP address but when any security framework detects that you accessed your account from.. lets say San Diego and then suddenly there is access from Japan, this is considered to be an \"impossible travel\" so it take the safest precaution which is to lock your account.\n\nWhich authenticator are you using? Authy? Google Authenticator? SMS? Even with these authenticators you can become compromised. If you're using a Yubikey, that is a different story.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9w9f6n",
                    "author": "JordanRPE",
                    "score": 1,
                    "created_utc": 1653451587.0,
                    "response": "I use a yubikey and they locked my account from buying.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9wfhh1",
                            "author": "knokkkor",
                            "score": 1,
                            "created_utc": 1653455284.0,
                            "response": "Well we both just got some bad luck but guess what.. we'll just need to suck it up. It's not like we're going to use any other exchange out there.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia01loz",
                                    "author": "JordanRPE",
                                    "score": 1,
                                    "created_utc": 1653521885.0,
                                    "response": "I moved my coins into a personal wallet away from coinbase.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia08jbu",
                                            "author": "knokkkor",
                                            "score": 1,
                                            "created_utc": 1653525160.0,
                                            "response": "Yeah same here but we’ll continue buying from coinbase",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iaklpym",
                    "author": "AFGFtopAruy",
                    "score": 1,
                    "created_utc": 1653934988.0,
                    "response": "Good news here 💱💱💱💱💱🥂🥂\n$TROPHY Token is now launched into pancakeswap 🥰🏆🏆🏆🏆🏆🏆 BUY MORE $TROPHY NOW AT VERY LOW PRICE🔅🔅🔅🔅🔅\n✅✅✅✅✅✅\nBUY MORE\nhttps://fairlaunch.trphy.io\n✅✅✅✅✅\nSWAP Now\nhttps://pancakeswap.finance/swap?outputCurrency=0xBaAd7173c7eDd91269F52c32c1d98B523e1852e4\n✅✅✅✅✅✅✅✅✅✅✅\n\nTotal Supply: 280,000 $TROPHY\nLiquidity Locked 🔐 : 90,600 $TROPHY\nLet's get $TROPHY Trending.\nLet's buy more into $TROPHY,\n\n$TROPHY 🏆 to the moon\nWebsite: https://trphy.io\nTG: t.me/trophyprotocol\nTw: twitter.com/trophy_app\nhttp://discord.com/invite/EhGCjvMG44",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9r7fp3",
                    "author": "AbbreviationsTime921",
                    "score": 0,
                    "created_utc": 1653355834.0,
                    "response": "u/knokkor you should be able to use your account if you’ve verified your account before, the verification error could be as result of glitch, clear ur cache if possible uninstall and reinstall the app, you should be good to go, hope you found this information helpful",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ra40o",
                    "author": "trashtv",
                    "score": 0,
                    "created_utc": 1653357115.0,
                    "response": "Same here. No idea why.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ra96h",
                    "author": "EvenFlounder1251",
                    "score": 0,
                    "created_utc": 1653357184.0,
                    "response": "Call the 1800 number",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9rc2g8",
                            "author": "knokkkor",
                            "score": 1,
                            "created_utc": 1653358043.0,
                            "response": "I could call the Coinbase One number. I'll do that tomorrow if it's still not unlocked.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}