{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ux2br3",
            "title": "I regret staking eth 2.0 on Coinbase",
            "url": "https://www.reddit.com/r/CoinBase/comments/ux2br3/i_regret_staking_eth_20_on_coinbase/",
            "author": "Marzero",
            "created_utc": 1653429855.0,
            "score": 6,
            "num_comments": 77,
            "subreddit": "CoinBase",
            "selftext": "Just wanna know if other people regret it.\n\n[View Poll](https://www.reddit.com/poll/ux2br3)",
            "stickied": false,
            "comments": [
                {
                    "id": "i9vl2vz",
                    "author": "wattumofficial",
                    "score": 8,
                    "created_utc": 1653439672.0,
                    "response": "If you staked ETH, then you might have protected from buying Luna with your ETH.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9xjiuh",
                    "author": "Emergency_Year_3479",
                    "score": 4,
                    "created_utc": 1653484479.0,
                    "response": "how can  you regret getting a fair percentage and free eth over the months?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9xythu",
                    "author": "jhanon76",
                    "score": 3,
                    "created_utc": 1653491138.0,
                    "response": "Omg everyone did it and the delay sucks but we ALL knew it was possible and CB made it very clear what we were getting into.  If you suffer from buyers remorse then owning or trading crypto is NOT for you.\n\nHell, if eth triples in value by the time it's accessible nobody going to be whining",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9veuud",
                    "author": "Tall_Run_2814",
                    "score": 8,
                    "created_utc": 1653436686.0,
                    "response": "All you dumb mofos don't know how to read the fine print. \n\nBesides, there are literally hundreds of places you can stake your crypto without losing complete control, rookie mistake.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9x8eqq",
                            "author": "Beepbeep1976",
                            "score": 3,
                            "created_utc": 1653478374.0,
                            "response": "Actually, I did read the ToS and knew what I was doing. However, at the time CB was also stating that liquidity would be enabled by December 2021. They went back on that promise.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9xfsuf",
                            "author": "MetsToWS",
                            "score": 0,
                            "created_utc": 1653482615.0,
                            "response": "What platforms do you recommend to lend and not lose complete control?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia4rs14",
                                    "author": "Tall_Run_2814",
                                    "score": 1,
                                    "created_utc": 1653609910.0,
                                    "response": "You need a wallet if you're not already using one.  I use Ledger which I have connected to MetaMask, Phantom and a few other hot wallets.  You can then use DeFi platforms depending on what you're investing/trading on.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia4t3qe",
                                            "author": "MetsToWS",
                                            "score": 1,
                                            "created_utc": 1653610564.0,
                                            "response": "I’m already on ledger + meta mask. Are there any defi platforms you recommend?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia7qf39",
                                                    "author": "Tall_Run_2814",
                                                    "score": 1,
                                                    "created_utc": 1653671086.0,
                                                    "response": "UniSwap, SpiritSwap, TraderJoes, etc.  Really depends on which chain/network you wish to invest in.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9wouba",
                    "author": "Timberwo",
                    "score": 2,
                    "created_utc": 1653462125.0,
                    "response": "I regret it because I was still super super new at staking on different platforms, BUT I am not upset and I have learned from my past mistakes. CEX normally suck anyways.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9v5cdb",
                    "author": "pob125",
                    "score": 4,
                    "created_utc": 1653432221.0,
                    "response": "I staked my first 2 eth on coinbase,then decided to store the rest in my own wallet simply for the reason of security...if anything happens with coinbase then I don't lose it all but also if I fuck up my own wallet I also don't lose it all...its all about spreading the risk.i fully trust coinbase with my staked ETH",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9vf8zj",
                    "author": "Kiwip0rn",
                    "score": 4,
                    "created_utc": 1653436871.0,
                    "response": "Why would anyone regret it? \n\nI know a few people here that regret not reading the ToS. 🤷‍♂️ or for having the total lack of comprehension.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9x4ctz",
                            "author": "Beepbeep1976",
                            "score": 4,
                            "created_utc": 1653475575.0,
                            "response": "I regret trusting them when their ToS stated they would enable liquidity by December 2021. Shortly after staking with CB I discovered Haru where APY is 6.1% with no locking or 7.1-14% with anywhere from 15 days to 365 days of locking. That's lending though, not staking, so it doesn't go to validating the network.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9ysljp",
                                    "author": "Kiwip0rn",
                                    "score": 0,
                                    "created_utc": 1653502818.0,
                                    "response": "Does the term \"Do your own due diligence\" means anything to you?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9yvd0l",
                                            "author": "Beepbeep1976",
                                            "score": 3,
                                            "created_utc": 1653503893.0,
                                            "response": "The fuck are you talking about? How does CB going back on their ToS equate to me not doing due diligence. I was just saying when I initially staked the terms stated liquidity would be enabled by December. Long after I had already staked a portion of my holdings they backed out of that promise. So how is that my fault? I'd say my due diligence has been done since I avoided staking my remaining holdings with CB after they backed out of the liquidity workaround. And I was sharing my due diligence with you by providing info about Haru to help you out if you're interested in earning a way higher APY (lending instead of staking).",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9yxrs8",
                                                    "author": "Kiwip0rn",
                                                    "score": 1,
                                                    "created_utc": 1653504842.0,
                                                    "response": "Coinbase's Terms never promised anything. 🙄\n\nAnd Haru is a scam, or at least has a VERY risky business model with no guarantees/insurance.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9z0gnq",
                                                            "author": "Beepbeep1976",
                                                            "score": 1,
                                                            "created_utc": 1653505921.0,
                                                            "response": "Talk about not doing due diligence. Yes, as of last fall (when I staked) CB's terms stated they planned on enabling liquidity of staked ETH by the end of the year. In late December they quietly deleted the wording with no announcement. And Haru is absolutely not a scam. Been lending with them since November. Here are some links regarding CB's former promise as well as Haru's Trust rating, Mr/Ms Due Diligence.\nhttps://www.trustpilot.com/review/haruinvest.com\nhttps://www.fool.com/investing/2021/12/29/is-coinbase-moving-the-goalposts-on-your-staked-et/\nhttps://blockcon.co/haru-invest-review/\nhttps://www.scam-detector.com/validator/haruinvest-com-review/",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9z1ppk",
                                                                    "author": "Kiwip0rn",
                                                                    "score": 2,
                                                                    "created_utc": 1653506424.0,
                                                                    "response": "There you go... \"they planned\" not \"they promised\". \n\nI know \"planned\" and \"promised\" both start with \"p\" but that is the extent of their similarities. \n\nI \"planned\" on being 7 foot with a 13 inch penis, but I have made due at 6'2\" with a 9\" penis.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9z2swg",
                                                                            "author": "Beepbeep1976",
                                                                            "score": 2,
                                                                            "created_utc": 1653506866.0,
                                                                            "response": "Actually, their exact words were \"we expect\" and, again, were a part of their staking terms which was highly misleading at the very least. Either way, the merge is close and the Shanghai hardfork will follow shortly after so withdrawals will be possible soon enough.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i9z5pot",
                                                                                    "author": "Kiwip0rn",
                                                                                    "score": 2,
                                                                                    "created_utc": 1653508040.0,
                                                                                    "response": "And does \"we expect\" resemble \"promise\" in any way? \n\nI \"expected\" to be a multimillionaire by December 2021 with my crypto investments, but only touched a HNWC twice in late 2021 🤷‍♂️ I am still \"expecting\" in mid2022, it has just been delayed.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i9z8i72",
                                                                                            "author": "Beepbeep1976",
                                                                                            "score": 1,
                                                                                            "created_utc": 1653509156.0,
                                                                                            "response": "Promise may have been the wrong word to use but like I said, they were highly misleading at the least. And at first I didn't much care that their commission was about 65% higher than Kraken's but that also sucks as well (and really the only reason I didn't care was because of the \"expectation\" of liquidity). And if the ATHs of November didn't make you a multimillionaire then 2022 won't either. Highly doubtful any new ATH will be reached this year and even if it does happen it will only be by a smidge.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9v0nf3",
                    "author": "househubbz",
                    "score": 2,
                    "created_utc": 1653430106.0,
                    "response": "Should I convert my old eth to 2.0?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9x4swl",
                            "author": "Beepbeep1976",
                            "score": 1,
                            "created_utc": 1653475910.0,
                            "response": "Lend on Haru instead. Will get 6.1% APY with no locking up or 7.1%-14% for anywhere between 15 days and 365 days of locking up at a time. Lending isn't the same as staking though so it doesn't help validate the network. Also, you don't need to convert to ETH2 for the merge. After merge ETH2 goes back to just ETH, it's all the same asset",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9v2s59",
                            "author": "Marzero",
                            "score": 0,
                            "created_utc": 1653431055.0,
                            "response": "Maybe not on Coinbase.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9yoyiw",
                    "author": "darknetboob",
                    "score": 1,
                    "created_utc": 1653501383.0,
                    "response": "i thought we could be using it by dec 2021?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9x4316",
                    "author": "Beepbeep1976",
                    "score": 1,
                    "created_utc": 1653475367.0,
                    "response": "I knew what I was doing and that it would be locked up so I don't exactly regret it. I regret not looking into other places more first. Kraken takes a slightly smaller commission (15% vs CB's 25%) so you get slightly higher APY. Better yet, lending on Haru gets you 6.1%APY with no locking or 7.1-14% with anywhere from 15 to 365 days of locking. But when I put most of my ETH on CB they were stating that they were going to enable liquidity of staked ETH by December 2021 which they have since quietly pulled back on. So in that sense they suck. Cheer up though, the merge is likely by August and an EIP allowing staking withdrawals will follow a couple months later so hopefully by October or November things will be liquid again. Either way staking/lending in general is awesome, nothing beats earning free asset and after the merge staking APY is expected to increase to around 12-15%!!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia03wa1",
                            "author": "jhanon76",
                            "score": 2,
                            "created_utc": 1653522979.0,
                            "response": "Quietly pulled back??????   Hahahhahaha.  They never said you'd have the eth in Dec 21",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia04kgx",
                                    "author": "Beepbeep1976",
                                    "score": 0,
                                    "created_utc": 1653523296.0,
                                    "response": "So, their staking ToS had stated they \"expect to enable liquidity of staked ETH by the end of the year (2021)\" how is that not saying you'd have access to your ETH? Then in mid-December they simply deleted that sentence from their terms with no public announcement. How is that not \"quietly pulling back\"? An article about the pullback, if you don't believe me\nhttps://www.fool.com/investing/2021/12/29/is-coinbase-moving-the-goalposts-on-your-staked-et/",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia05nd1",
                                            "author": "jhanon76",
                                            "score": 2,
                                            "created_utc": 1653523800.0,
                                            "response": "u/kiwip0rn kindly explained this to you...but you don't listen.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia062tp",
                                                    "author": "Beepbeep1976",
                                                    "score": 0,
                                                    "created_utc": 1653524003.0,
                                                    "response": "Apparently you don't listen, if you're just regurgitating the semantic BS he was spouting. And I don't actually give a fuck if withdrawals can't happen until the post merge hardfork. I have no plans of disposing of any asset, just moving it elsewhere to earn a much higher APY. Just saying, they shouldn't have represented themselves to be offering something other platforms weren't. I already admitted \"promise\" was the wrong word to use but they definitely marketed themselves to be offering liquidity in the near future which is why I went with CB even though Kraken takes a much lower commission.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "ia06bci",
                                                            "author": "jhanon76",
                                                            "score": 2,
                                                            "created_utc": 1653524114.0,
                                                            "response": "Words matter.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "ia06jdo",
                                                                    "author": "Beepbeep1976",
                                                                    "score": -1,
                                                                    "created_utc": 1653524220.0,
                                                                    "response": "I'm aware and already admitted \"promise\" was a misstatement, but it was a representation to draw people in when they could have gone elsewhere with better terms.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "ia06sra",
                                                                            "author": "jhanon76",
                                                                            "score": 2,
                                                                            "created_utc": 1653524344.0,
                                                                            "response": "🙄",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "ia0dyom",
                                                                                    "author": "Kiwip0rn",
                                                                                    "score": 2,
                                                                                    "created_utc": 1653527685.0,
                                                                                    "response": "🤣",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                },
                                                                                {
                                                                                    "id": "ia08z9g",
                                                                                    "author": "Beepbeep1976",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653525370.0,
                                                                                    "response": "I'll also say, at the time I would've staked with CB even if they weren't dangling the possibility of near term liquidity but I wouldn't have staked as much as I did, which was about 70% of my HODLings. Glad I at least withheld the other 30% and eventually found somewhere I could earn 14+%.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "ia1425j",
                                                                                            "author": "jhanon76",
                                                                                            "score": 1,
                                                                                            "created_utc": 1653541457.0,
                                                                                            "response": "You should've Googled ETH2 at the time you chose to lock yours up on cb.  Anyone at the time would have told you Dec 21, while prevailing theory at the time, was optimistic.  Plenty other options already existed at the time you staked on cb.  It was risky especially to stake 70% (!!!), and unfortunately you lost for the time being",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "id": "ia083f3",
                                                                                    "author": "Beepbeep1976",
                                                                                    "score": 0,
                                                                                    "created_utc": 1653524951.0,
                                                                                    "response": "I already said I don't regret staking with CB. I don't actually care that Kraken takes a lower commission or that I could be earning 3-4x the APY elsewhere (I'll be earning it in the near future anyway), but they should follow through with the things they market. In case you didn't notice, the thread started with the question. I didn't start it, I was just giving my perspective (as asked by the OP).",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9x2h8d",
                    "author": "Ambitious-Trade9721",
                    "score": 0,
                    "created_utc": 1653474112.0,
                    "response": "All u have to is buy the same amount of crypto $ value, then remove all the money out ur bank account. In 2 weeks they will take ur eth 2 balance and u have the new crypto u bought . I did this with like 4,500 dollars of eth",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9yp5xe",
                            "author": "darknetboob",
                            "score": 0,
                            "created_utc": 1653501463.0,
                            "response": "on coinbase?  and u mean how?  i have a debit card.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia03sor",
                                    "author": "jhanon76",
                                    "score": 1,
                                    "created_utc": 1653522931.0,
                                    "response": "Dudes full of shit...look at profile posts",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia1s3et",
                                            "author": "Ambitious-Trade9721",
                                            "score": 0,
                                            "created_utc": 1653561356.0,
                                            "response": "lol dude I don’t need to explain shit here is coinbase Reddit bunch of low IQ ppl who keep their coins on an exchange . Just overdraft ur bank by exactly the amount of eth u have staked, transfer the crypto you bought , then when coinbase charges u , move the money out ur bank account . That way they can’t charge you , they will then feeezs ur CB account and say if you don’t pay they will take ur ETH2.  Sure it’s ghetto but I had a lot of eth I wanted to get rid of so I did it and now I’m free of that burden and my CB account was only frozen for 2 weeks . GG noob",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9v030h",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653429856.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ze488",
                    "author": "EseJandro",
                    "score": 1,
                    "created_utc": 1653511442.0,
                    "response": "Set it and forget it son.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9y52qu",
                    "author": "One8s7n",
                    "score": 0,
                    "created_utc": 1653493641.0,
                    "response": "I only staked $350 so it's no biggie for me",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}