{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "umusib",
            "title": "Coinbase won’t send me SMS verification",
            "url": "https://www.reddit.com/r/CoinBase/comments/umusib/coinbase_wont_send_me_sms_verification/",
            "author": "mooresy20",
            "created_utc": 1652222265.0,
            "score": 5,
            "num_comments": 12,
            "subreddit": "CoinBase",
            "selftext": "I try to buy BTC and get to the point where it send me an SMS to verify my purchase. But I do not receive the SMS. I contacted my bank and they assure me this is on coinbases end. I’m receiving all sms otherwise. Any help?",
            "stickied": false,
            "comments": [
                {
                    "id": "i84c3k6",
                    "author": "ThePassionOfReptar",
                    "score": 5,
                    "created_utc": 1652227751.0,
                    "response": "Good.\n\nStop using SMS",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i84f8gn",
                            "author": "Kiwip0rn",
                            "score": 3,
                            "created_utc": 1652229166.0,
                            "response": "^^ 100% this.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i84h92n",
                    "author": "fx9TMK",
                    "score": 5,
                    "created_utc": 1652230084.0,
                    "response": "What does your bank have to do with you receiving a SMS code from coinbase?",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "um61cq",
            "title": "Account stuck being \"Under Review\" for 3 weeks",
            "url": "https://www.reddit.com/r/CoinBase/comments/um61cq/account_stuck_being_under_review_for_3_weeks/",
            "author": "AndrewCarter04",
            "created_utc": 1652143795.0,
            "score": 4,
            "num_comments": 12,
            "subreddit": "CoinBase",
            "selftext": "Created an account 3 weeks ago now, and it still says it is \"under review\" and \"generally takes a few days\".\n\nContacted support about this several times, and every time I have just got a response saying \" We appreciate your patience. Our team is working diligently to review your account. \" but it has been 3 weeks. Like come on. Made a Binance account on the same day and they managed to verify my ID in about 5 minutes.\n\nI'm out of options really, so thats why I turned to reddit in the hope of finally being able to use my account.",
            "stickied": false,
            "comments": []
        },
        {
            "id": "umugsf",
            "title": "Wormhole LUNA/UST on coinbase",
            "url": "https://www.reddit.com/r/CoinBase/comments/umugsf/wormhole_lunaust_on_coinbase/",
            "author": "InevitableMotor7891",
            "created_utc": 1652221362.0,
            "score": 21,
            "num_comments": 62,
            "subreddit": "CoinBase",
            "selftext": "Hello.\n\nLUNA is looking to deprecate the \"shuttle\" for wrapped ust/luna. \n\nThe main terra bridge page defaults to wormhole luna and I stupidly sent a LOT of LUNA to my coinbase account. It ridicules me that coinbase will not help only saying that it does not support wormhole luna and only supports wrapped luna/ UST. \n\nThis makes no sense because the receiving address is an ERC-20 wallet (coinbase's wallet) and now has my wormhole LUNA. My LUNA just didnt disappear, it simply went to their wallet. Terra will be depricating the old wrapped version but they have so many issues on their own.\n\nI just hope coinbase can recover my funds with a small fee (binance does that) or add wormhole UST/Luna. I'm sure there's millions lost in transaction with this wormhole.\n\nCan people help me by upvoting or comment below if you have similar issues. Please help!",
            "stickied": false,
            "comments": [
                {
                    "id": "i85bc8f",
                    "author": "radiofriendly123",
                    "score": 3,
                    "created_utc": 1652244935.0,
                    "response": "Bump\n\nPlease everyone - continue to contact coinbase and pursue a resolution. Other exchanges fix these issues for their customers. Coinbase should too.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i85f9en",
                            "author": "ndreamer",
                            "score": 2,
                            "created_utc": 1652247494.0,
                            "response": "You should honestly go to those exchanges. I did something similar with FTX they credited my account in 24hours minus 5%. They took the loss, coins are still at the address.\n\nCoinbase won't help, support has been useless for years.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i92q6hi",
                                    "author": "s3ngoku88",
                                    "score": 1,
                                    "created_utc": 1652883124.0,
                                    "response": "Hi, you sent wrapped UST to FTX when they only accept wormhole UST? Nice of FTX to credit the balance (-5%) to you.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i875m6u",
                    "author": "jgbagley",
                    "score": 2,
                    "created_utc": 1652284483.0,
                    "response": "Coinbase is telling me that they will not do anything about this and the funds are locked while also claiming that if they happen to list Wormhole LUNA/UST one day, the funds will automatically show up. This makes ZERO sense to me as they are obviously able to remediate the situation, but are choosing not to on their own accord. They also are unwilling to escalate this further. \n\nPLEASE UPVOTE",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i87cnwk",
                            "author": "foxdirect",
                            "score": 1,
                            "created_utc": 1652287208.0,
                            "response": "Same issue with $xxx,xxx of lost funds!!!  CB support is giving me the run-around.  Case #11775043.  They sent a link to https://help.coinbase.com/en/coinbase/getting-started/crypto-education/ust   If you go there it says that CB accepts Ethereum (ERC-20) based UST.   It says NOTHING about only accepting \"wrapped UST\" vs \"wormhole bridge wrapped UST\"! In fact, NOWHERE on their whole site does it say anything about \"wormhole\" vs \"wrapped\" Ethereum (ERC-20) based UST.  How in the world is a user supposed to know when their own support webpage and deposit info page not even mention it?\n\nThey say they take Ethereum (ERC-20) based UST... So  \n\nSend me a DM if you want to band together: https://twitter.com/ShippedCom",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i84i2bg",
                    "author": "Kiwip0rn",
                    "score": 0,
                    "created_utc": 1652230458.0,
                    "response": "🙄\n\n1st; \"Wormholes\" are having a hacking (Back Door) problems all over DeFi. So you can just forget about allowing Wormhole transactions any time soon.\n\n2nd; what Address did you send the Luna? It doesn't make any sense to blame Coinbase for it; because Luna doesn't have an address on Coinbase.\n\nAnd Coinbase wanted to have Luna, but the Luna people didn't want to share the necessary information for Luna like they provided for their UST, to be listed on the exchange. So we got basically the worthless Wrapped version. \n\nThe ball is still in Luna's court to be listed. But even Luna getting listed, you didn't send to a Luna address so you \"should not\" get those coins anyway. Because \"sending non-Wrapped Luna to this address can result in the permanent loss of the coins\".",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i84ukev",
                            "author": "TwentyOneJ",
                            "score": 1,
                            "created_utc": 1652236154.0,
                            "response": "wormhole luna is erc-20. Coinbase's wallet is ERC-20 so it holds the wormhole LUNA. The coins did not disappear and it is sitting on coinbase's erc-20 wallet. please know your details.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i84xw9g",
                                    "author": "Kiwip0rn",
                                    "score": 1,
                                    "created_utc": 1652237705.0,
                                    "response": "100% false.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i84yrv5",
                                            "author": "TwentyOneJ",
                                            "score": 1,
                                            "created_utc": 1652238130.0,
                                            "response": "Knows nothing about crypto and is talking",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8503jc",
                                                    "author": "Kiwip0rn",
                                                    "score": 0,
                                                    "created_utc": 1652238786.0,
                                                    "response": "I will talk slow for you... what -- address -- did -- you -- send -- it -- too?\n\nBecause Coinbase Custody IS NOT like a Self Custody Wallet were you can send everything ERC-20 to your ETH address. 🙄",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i851px0",
                                                    "author": "Kiwip0rn",
                                                    "score": 0,
                                                    "created_utc": 1652239610.0,
                                                    "response": "🙄 you were an sushi swap 4 months ago confused about LUNA vs WLUNA and announcing that you are new...\n\nLet ME introduce myself; Coinbase since March 2014 (8 years) the 2nd or 3rd oldest Coinbase account on this forum. Retired off my Coinbase account.\n\nBut you just sit there and believe you are \"right\" (as you are the one, missing your LUNA 🙄 not me) or that you are going to have some sort of \"victory\" Coinbase even if they can get to your LUNA they will NEVER give it to you and reward your stupidity, even if tomorrow they support LUNA, because it was sent to an (unknown) wallet.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i85943i",
                                                            "author": "TwentyOneJ",
                                                            "score": 1,
                                                            "created_utc": 1652243584.0,
                                                            "response": "i just looked at etherscan. There is my wormhole luna. Wow you are clueless",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i85buav",
                                                                    "author": "Kiwip0rn",
                                                                    "score": 1,
                                                                    "created_utc": 1652245248.0,
                                                                    "response": "🙄",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i859o3h",
                            "author": "radiofriendly123",
                            "score": 1,
                            "created_utc": 1652243915.0,
                            "response": "It was ust, not luna.\n\nMany of us had ust in anchor that we used the terra bridge to convert to erc20 ust. I know I've done it many times as recently as a few weeks ago. \n\nI stored on anchor, used the terra bridge, sent to my metamask wallet, then to an exchange - coinbase in this example. The process always worked beautifully. \n\nI used this process last night, as did many others, and it didn't work bc something changed on the back end of the bridge that suddenly resulted in us unknowingly getting UST (wormhole) out of the bridge rather than the other erc20 UST version supported by coinbase. Honest mistake anyone could make.\n\nCoinbase could assist by supporting the asset or by releasing the funds back to the wallet we sent from. Binance and other exchanges do this for their customers. I don't think expecting support from coinbase is unreasonable here.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i85bla0",
                                    "author": "Kiwip0rn",
                                    "score": 0,
                                    "created_utc": 1652245095.0,
                                    "response": "It doesn't matter anyway, WLUNA, LUNA, and UST is all dying and it will not matter by the end of the week, they will be zero or near zero and delisted.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i85buxo",
                                            "author": "radiofriendly123",
                                            "score": 1,
                                            "created_utc": 1652245259.0,
                                            "response": "All the more reason it matters for us to get access to our funds asap.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i85c1rv",
                                                    "author": "Kiwip0rn",
                                                    "score": 1,
                                                    "created_utc": 1652245376.0,
                                                    "response": "Luna is almost $10.00 then it will liquidate the leverage players and more stop losses. It is dead.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i83yrpo",
                    "author": "InevitableMotor7891",
                    "score": -1,
                    "created_utc": 1652221789.0,
                    "response": "anyone with similar issues?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i858mzj",
                            "author": "radiofriendly123",
                            "score": 2,
                            "created_utc": 1652243301.0,
                            "response": "Lots of us. We must continue to all relentlessly contact coinbase support until we receive help. \n\nPlease do not give up. Contact them through email, chat, Twitter, etc - however you can. We must continue to pursue a resolution to this issue.\n\nI've seen binance resolve these issues for their customers. We must demand coinbase do the same or consider some kind of legal action.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i86sezq",
                                    "author": "jgbagley",
                                    "score": 2,
                                    "created_utc": 1652279272.0,
                                    "response": "I also had the same issue recently. Case #11777641",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8kecge",
                                    "author": "drmed1212",
                                    "score": 2,
                                    "created_utc": 1652528421.0,
                                    "response": "Same boat here. Transferred from holdnaut and they are refusing to give access to my UST. As somebody mentioned this crypto is sitting in a private wallet with them having access to it with private keys that they will withdraw to their own account later. They should be able to return the funds to the original source at least. Coinbase ticket# 11836576",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8khkxw",
                                            "author": "radiofriendly123",
                                            "score": 1,
                                            "created_utc": 1652530629.0,
                                            "response": "Very sorry to hear. Thanks for the ticket number. Please continue to contact coinbase and Wormhole as frequently as possible without driving yourself crazy. The more we contact them the better our odds at ever seeing a resolution. \n\nIf no action is taken perhaps we need to consider our legal options.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8kid60",
                                                    "author": "drmed1212",
                                                    "score": 2,
                                                    "created_utc": 1652531121.0,
                                                    "response": "What can wormhole do? How do I contact them? Is there any reason to contact the sending exchange (or do they have nothing to lose in this game?)",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8kjny7",
                                                            "author": "radiofriendly123",
                                                            "score": 1,
                                                            "created_utc": 1652531933.0,
                                                            "response": "Wormhole can contact coinbase and request to be supported. \n\nThey can be reached here - https://twitter.com/wormholecrypto?t=dmhHwZF0VyQ4MnWJEH9P8A&s=09\n\nBe sure to contact them regularly requesting they work with coinbase to be listed:  https://www.coinbase.com/assethub",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "i8kufpq",
                                                            "author": "coinbasesupport",
                                                            "score": 1,
                                                            "created_utc": 1652537777.0,
                                                            "response": "Hi u/drmed1212, thanks for providing that information.\n\nWe have reviewed your case, and we can see that our team is working on this at the moment, we can assure you that they'll get back to you with an update as quickly as possible.\n\nWe appreciate your patience while we resolve this.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i84uwrm",
                            "author": "Suhabibi",
                            "score": 1,
                            "created_utc": 1652236314.0,
                            "response": "yes retweet this on twitter spread the news\n\nhttps://twitter.com/radiofriendly12/status/1523996592419840006?s=20&t=nv6WsxDSnNs4WtZXuC1hEA",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i87crle",
                            "author": "foxdirect",
                            "score": 1,
                            "created_utc": 1652287246.0,
                            "response": "Same issue with $xxx,xxx of lost funds!!!  CB support is giving me the run-around.  Case #11775043.  They sent a link to https://help.coinbase.com/en/coinbase/getting-started/crypto-education/ust   If you go there it says that CB accepts Ethereum (ERC-20) based UST.   It says NOTHING about only accepting \"wrapped UST\" vs \"wormhole bridge wrapped UST\"! In fact, NOWHERE on their whole site does it say anything about \"wormhole\" vs \"wrapped\" Ethereum (ERC-20) based UST.  How in the world is a user supposed to know when their own support webpage and deposit info page not even mention it?\n\nThey say they take Ethereum (ERC-20) based UST... So  \n\nSend me a DM if you want to band together: https://twitter.com/ShippedCom",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i87rr0a",
                                    "author": "Puzzleheaded_Value94",
                                    "score": 1,
                                    "created_utc": 1652293083.0,
                                    "response": "We most certainly need to band together. There are a number of failings on the part of Coinbase here. \n\n1) Coinbase does not actually support TerraUSD (UST) as it claims. Coinbase supports what is commonly referred to as ‘Wrapped UST’ which is not UST, but rather a separate ERC-20 token that’s designed to track UST’s value. This token is also known as ‘UST (Shuttle)’ and has the official ticker wUST (assigned to it by the issuers of the asset, Terra).\n\n2) In a Medium blog post that was released by Terra on October 19th 2021, it was stated that the Shuttle-bridged versions of UST and LUNA (that are to be phased out) have the tickers wUST and wLUNA and that the Wormhole-bridged versions have the official tickers of USTw and LUNAw. Coinbase has not used these tickers that could have safeguarded their customers against transferring assets which are unsupported. The blog also states that exchanges have been notified, so the fact that Coinbase has not acted to prevent this now widespread issue in the past 7 months is totally unacceptable.\n\n3) Other leading exchanges such as FTX and KuCoin give an explicit warning about which versions of UST on the Ethereum network they support. There is no excuse for coinbase not to have done the same.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8b6jvn",
                                    "author": "Odd_Arrival8053",
                                    "score": 1,
                                    "created_utc": 1652358859.0,
                                    "response": "I did the same as you  w: $70k.\nI keep getting errors when trying to fill out the customer service form.\nWhat did you enter as transaction amount?\nWhich part of hash, did you enter as Receiving address.\n\nCan only hope CS one day comes through. \n[Tx Hash](https://etherscan.io/tx/0xeac508ca7d1d05673c11ab82c9461029a0ddb8644e6d0644b0c62686133ce7e6)",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8e5brg",
                                            "author": "cjc6863",
                                            "score": 1,
                                            "created_utc": 1652403295.0,
                                            "response": "You get an error because in their automated ticket system, that hash looks invalid because it's a token 'they don't support'.  Reply back to the email and engage them.  They won't help, but keep bothering them.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i83xsmz",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1652221362.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i85ed0f",
                    "author": "Crypto_illumination",
                    "score": 1,
                    "created_utc": 1652246884.0,
                    "response": "I’m sorry you did that, that sucks! Why didn’t you check Coinbase to see if Terra Luna is something that is supported? \n\nWhy not do your due diligence first before sending lots of money? always do a test send… have you ever heard that before?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i85f1dg",
                    "author": "ndreamer",
                    "score": 1,
                    "created_utc": 1652247339.0,
                    "response": "It's gone, coinbase will not help recover it.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i86y4ej",
                            "author": "BItcoinFonzie",
                            "score": 1,
                            "created_utc": 1652281551.0,
                            "response": "If they add support for wormhole UST users could access the funds. They don’t even have to add trading, just access to the ERC-20s. They’ve done it for forked coins before (BCH, ETC, BSV), this is just an ERC-20 and that should be technically much easier. Given how many people this impacts, and how much money people have lost in this process, Coinbase could rectify it with the simple step of listing UST wormhole. As it stands they don’t even warn that wormhole UST sent to the address becomes “unrecoverable”",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i89uspm",
                                    "author": "ndreamer",
                                    "score": 1,
                                    "created_utc": 1652325392.0,
                                    "response": "They won't. especially now. I would not be surprised if UST get's delisted.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i86997n",
                    "author": "druglover17",
                    "score": 1,
                    "created_utc": 1652270430.0,
                    "response": "Define alot, in interested how much it was. I'm sorry it's happened to you. Unless they add the token in future the money is lost, I'm pretty sure anyway ☹ you'll have to just pray it gets added in the future.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i86oba5",
                    "author": "Elva_Ginon_69",
                    "score": 1,
                    "created_utc": 1652277574.0,
                    "response": "I just had a problem with them as well. When in real time apps they showed btc in 29.1k and that when ai tried to buy some with Coinbase, coinbase btc prices would oscillate between 29.3k - 29.5k, why they don't show the Real value of BTC? Like bruh...",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i87penj",
                    "author": "jgbagley",
                    "score": 1,
                    "created_utc": 1652292145.0,
                    "response": "FYI, I've created a new post to get clarity from CoinBase on if they still have plans to launch an Asset/ERC-20 Recovery Service:  \nhttps://www.reddit.com/r/CoinBase/comments/unfc30/need\\_clarity\\_from\\_coinbase\\_on\\_if\\_there\\_are\\_plans/",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8b2ggl",
                    "author": "Odd_Arrival8053",
                    "score": 1,
                    "created_utc": 1652356628.0,
                    "response": "Newly appointed dummy",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8l04tp",
                    "author": "dgidyi",
                    "score": 1,
                    "created_utc": 1652540530.0,
                    "response": "🧬 @Foreverise_BSC - revolutionary watch-to-earn protocol allowing holders to earn up to 298 USDT per month\n\n💰 Main utility is \"Forever Earn\" platform on for Android / iOS through which you can watch ads and earn USDT\n\n⭐️Pinksale Presale Live #foreverise \nhttps://www.pinksale.finance/#/launchpad/0xa756324759Ac9a1097b875484596Db815f8fE1Df?chain=BSC",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8q0lm8",
                    "author": "Odd_Arrival8053",
                    "score": 1,
                    "created_utc": 1652638183.0,
                    "response": "Anyone have luck with support?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8tdp1f",
                    "author": "Odd_Arrival8053",
                    "score": 1,
                    "created_utc": 1652706824.0,
                    "response": "Anyone in this account that made a mistake follow the unified twitter front\n\n@justice4_CB_UST\nDM: tix number, amount lost, Tx Hash",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8tewss",
                            "author": "coinbasesupport",
                            "score": 1,
                            "created_utc": 1652707426.0,
                            "response": "Hi u/Odd_Arrival8053, thanks for getting in touch.\n\nHappy to help, can you give us some more info on your issue please? If you have a case number, feel free to get back to us with that too.\n\nWe'll look out for your response.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8tfc24",
                                    "author": "Odd_Arrival8053",
                                    "score": 1,
                                    "created_utc": 1652707635.0,
                                    "response": "^ like talking to a wall CB Support ^",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8440gk",
                    "author": "TwentyOneJ",
                    "score": 0,
                    "created_utc": 1652224101.0,
                    "response": "Same issue please anyone with similar issues: ?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i858p1s",
                            "author": "radiofriendly123",
                            "score": 1,
                            "created_utc": 1652243336.0,
                            "response": "Yes - many of us have been impacted. Please continue to contact support daily until they resolve this issue.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "umr5zj",
            "title": "Unable to sell any crypto on Coinbase",
            "url": "https://www.reddit.com/r/CoinBase/comments/umr5zj/unable_to_sell_any_crypto_on_coinbase/",
            "author": "SamTheChosenOnee",
            "created_utc": 1652212445.0,
            "score": 4,
            "num_comments": 28,
            "subreddit": "CoinBase",
            "selftext": "Changed my card the other week to a different one, and now for some odd reason i am unable to sell any cryptos on my coinbase. I still can buy but selling option just say's \" Add a Payment Method\"\n\nWhen I go to add a card to my account nothing happens. Any ideas? already sent 2 emails to coinbase support and they haven't helped at all\n\n Case# 11724994",
            "stickied": false,
            "comments": [
                {
                    "id": "i862bz0",
                    "author": "coinbasesupport",
                    "score": 1,
                    "created_utc": 1652266096.0,
                    "response": "Thanks for reaching out, u/SamTheChosenOnee\n\nWe have taken a closer look into this case for you, and we can see that this is with our team. We have also updated your case with the details that you shared here. Our team will follow up with you again through your case number as soon as they have an update for you! \n\nThanks for your patience.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i83ditf",
                    "author": "Kiwip0rn",
                    "score": 3,
                    "created_utc": 1652213020.0,
                    "response": "Okays 🙄 1 Karma account.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i83kwil",
                            "author": "SamTheChosenOnee",
                            "score": 0,
                            "created_utc": 1652215949.0,
                            "response": "Yeah don't use reddit that much but didn't know where else i could message about this issue.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i84e23w",
                                    "author": "Kiwip0rn",
                                    "score": 2,
                                    "created_utc": 1652228631.0,
                                    "response": "It is always convenient that only low Karma, low post people are the only ones that ever have issues 🤷\n\nMy apologies if you are actually having an issue, but it doesn't change the facts of low Karma people here.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i84nh9r",
                                            "author": "SamTheChosenOnee",
                                            "score": 2,
                                            "created_utc": 1652232929.0,
                                            "response": "Yep, Understandable. I try to keep of social media, annoying how no one can help me with this situation tho msg support and they haven't got back to me at all.\n\nDont judge people even they have low karma",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i84zc8r",
                                                    "author": "Kiwip0rn",
                                                    "score": 2,
                                                    "created_utc": 1652238403.0,
                                                    "response": "Email to support takes 3 business days, then you will get a \"form\" Email asking for too much. Reply with the same information and any changes, don't worry about what is requested in the email, unless it is reasonable for the issue.\n\nWithin 1 business day a Customer Support person will email you and whatever. They will fix or give you the solution sometimes taking 24 hours.\n\nDon't mass email them, don't bother them on the phone and stuff. Wait the business days, and do the replies.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i83c1s6",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1652212445.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8l0823",
                    "author": "dgidyi",
                    "score": 1,
                    "created_utc": 1652540572.0,
                    "response": "🧬 @Foreverise_BSC - revolutionary watch-to-earn protocol allowing holders to earn up to 298 USDT per month\n\n💰 Main utility is \"Forever Earn\" platform on for Android / iOS through which you can watch ads and earn USDT\n\n⭐️Pinksale Presale Live #foreverise \nhttps://www.pinksale.finance/#/launchpad/0xa756324759Ac9a1097b875484596Db815f8fE1Df?chain=BSC",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9c5wp2",
                    "author": "ghyyuur",
                    "score": 1,
                    "created_utc": 1653059221.0,
                    "response": "🐲Lil Dragon $LDG NFT Metaverse for human resources Evolved to create hyperlinks between Cryptocurrencies, NFT ecosystem and Metaverse.\n\nPresale live now on Pinksale: https://www.pinksale.finance/#/launchpad/0x058d5489433b49bDb86E7A6f195b5EA12d6A82d8?chain=BSC\n\n✅Audit by TechRate\n✅Metaverse beta version\n✅Listed in CMC\n\n📌We will launch on Pancakeswap after Presale.\n\nFollow our official social media for more info:\nWebsite: https://lildragon.io/\nTelegram: https://t.me/LilDragonOfficial\nTwitter: https://twitter.com/LilDragOfficial",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "un2t41",
            "title": "Brian Armstrong: \"There is some noise about a disclosure we made in our 10Q today about how we hold crypto assets. Tl;dr: Your funds are safe at Coinbase, just as they’ve always been. \"",
            "url": "https://twitter.com/brian_armstrong/status/1524233480040710144",
            "author": "EZLIFE420",
            "created_utc": 1652248568.0,
            "score": 16,
            "num_comments": 33,
            "subreddit": "CoinBase",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i87d6us",
                    "author": "meshreplacer",
                    "score": 2,
                    "created_utc": 1652287408.0,
                    "response": "Words mean nothing legally only what is written on paper.  No SIPC or FDIC protection means anything happens you lose it all with no recourse.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i85zsrk",
                    "author": "SurprisedByItAll",
                    "score": 0,
                    "created_utc": 1652264212.0,
                    "response": "The noise was coinbase saying any crypto held in thier custodial wallets will be seized to payoff creditors if a bankruptcy is declared? If true, that's stunning information and reason enough not to use custodial wallets on any exchange. That will impact all exchanges business as the everyday man doesn't want to figure out cold storage solutions. This news sucks and is on top of other sucky news like coinbase seizing assets when customers want to purchase \"forbidden\" items like the guy trying to exercise hia constitutional right to purchase a weapon. Crypto is doomed with shit exchanges tbh. This sucks.\n\nhttps://www.reddit.com/r/ethereum/comments/umv4fl/urgent_coinbase_gives_crypto_investors_grim/?utm_medium=android_app&utm_source=share",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i86m783",
                            "author": "Iamthemaster1000",
                            "score": 0,
                            "created_utc": 1652276676.0,
                            "response": "Seized assets, does that include their external coinbase  wallet also?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i872bhr",
                                    "author": "SurprisedByItAll",
                                    "score": 3,
                                    "created_utc": 1652283200.0,
                                    "response": "No, just the assets kept in their custodial wallet on their exchange. If you use a wallet on your phone or other external wallet then it doesn't apply. They're saying that a judge may rule that because the keys controlling assets are on their platform that they cpupd be seized to pay off creditors. So the ol adage of not your keys not your crypto is painfully clear here sadly. Having to figure out cold storage is terrible for greater adoption. They NEED to protect the consumer here.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i86pujb",
                                    "author": "SwagMcDag",
                                    "score": -1,
                                    "created_utc": 1652278221.0,
                                    "response": "Also looking for the answer to this",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i85n2gm",
                    "author": "Accomplished-Way7608",
                    "score": -4,
                    "created_utc": 1652253326.0,
                    "response": "Coinbase paid someone $600 MILLION DOLLARS to design their shitty NFT product. Let that sink in. SIX 👏🏼 HUNDRED 👏🏼 MILLION 👏🏼 DOLLARS 👏🏼\n\n🤣🤦‍♂️",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i85gsif",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1652248569.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8kzzx5",
                    "author": "dgidyi",
                    "score": 1,
                    "created_utc": 1652540465.0,
                    "response": "🧬 @Foreverise_BSC - revolutionary watch-to-earn protocol allowing holders to earn up to 298 USDT per month\n\n💰 Main utility is \"Forever Earn\" platform on for Android / iOS through which you can watch ads and earn USDT\n\n⭐️Pinksale Presale Live #foreverise \nhttps://www.pinksale.finance/#/launchpad/0xa756324759Ac9a1097b875484596Db815f8fE1Df?chain=BSC",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i85qzze",
                    "author": "Routman",
                    "score": -2,
                    "created_utc": 1652256678.0,
                    "response": "But that super bowl ad was so good /s",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "um7vf4",
            "title": "COINBASE PLEASE ADD SUPPORT FOR WORMHOLE UST",
            "url": "https://www.reddit.com/r/CoinBase/comments/um7vf4/coinbase_please_add_support_for_wormhole_ust/",
            "author": "Suhabibi",
            "created_utc": 1652149287.0,
            "score": 6,
            "num_comments": 42,
            "subreddit": "CoinBase",
            "selftext": "I accidentally sent a lot of money through my TeraStation wallet using a wormhole instead through a shuttle. After hours of talking to customer representatives and agents regarding the issue, all the answers defaulted that they were unable to do anything unless support was added. So in the dire moment with nothing else to hope for I hope this post gathers enough attention so that the asset compatibility can be added to coinbase.\n\nRIP UST",
            "stickied": false,
            "comments": [
                {
                    "id": "i81995y",
                    "author": "fx9TMK",
                    "score": 2,
                    "created_utc": 1652179002.0,
                    "response": "No test transaction huh?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i83sefa",
                            "author": "Suhabibi",
                            "score": 0,
                            "created_utc": 1652219035.0,
                            "response": "I have done it before, but it usually automated me to shuttle which I wasn't paying attentiont too...",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i84n5bg",
                                    "author": "radiofriendly123",
                                    "score": 1,
                                    "created_utc": 1652232777.0,
                                    "response": "Same for me. I've been doing the same process for months, several transactions - enough to be comfortable enough to no longer send test transactions.   \n\nI got screwed too and sent UST (wormhole) to my UST address on coinbase. Same way I've always done it all the way up through about a week or two ago.  \n\nFunds never showed up and they are telling me I'm screwed until they support UST (wormhole), which may never happen.  \n\nThere's a group of us on Twitter as well with this issue that have been contacting Coinbase repetitively until they help. Unfortunately we keep getting stonewalled by entry level support with canned answers. \n\nWe must continue to contact coinbase until they help.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i84u73x",
                                            "author": "Suhabibi",
                                            "score": 1,
                                            "created_utc": 1652235984.0,
                                            "response": "Hey let me join the group Ill try to help, pm ur twitter",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i8b6z3u",
                                            "author": "This_Neighborhood861",
                                            "score": 1,
                                            "created_utc": 1652359074.0,
                                            "response": "Mate add me to the Twitter group. Dm me and I’ll send it to you! Let’s band together and get these guys to take action!\n\nIt should be 100% possible that they route the turns from the receiving UST Coinbase Pro address to a Coinbase Wallet ERC20 address. Coinbase Wallet is ERC20 compatible so Coinbase can 100% do this!!!",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8b8ak4",
                                                    "author": "radiofriendly123",
                                                    "score": 1,
                                                    "created_utc": 1652359729.0,
                                                    "response": "Added you to the reddit group and here's the Twitter thread\n\nhttps://twitter.com/radiofriendly12/status/1524041952685142016?t=3JUW8rQZzSnUFrkxQv5eiA&s=19",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i82evi6",
                    "author": "lifeisopinion",
                    "score": 2,
                    "created_utc": 1652199147.0,
                    "response": "Mate, I did the exact same thing today.\n\nI have withdrawn/deposited UST from coinbase probably a dozen times. I did the same as I always do, not considering the wormhole contract is different.\n\nHopefully it is listed someday, seeing dozens of posts over this.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i83sh65",
                            "author": "Suhabibi",
                            "score": 1,
                            "created_utc": 1652219068.0,
                            "response": "Yeah its kinda unfortunate how they have support on coinbasewallet but not coinbase exchange.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i84n8zo",
                            "author": "radiofriendly123",
                            "score": 1,
                            "created_utc": 1652232824.0,
                            "response": "Please keep contacting Coinbase and making noise until they help. There's a group of us on Twitter doing the same. \n\nWe must keep pressuring them to resolve this. You are not alone.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i80w0o6",
                    "author": "Kiwip0rn",
                    "score": 1,
                    "created_utc": 1652167572.0,
                    "response": "Wormholes have had too many issues (hacks) lately... I hope that it never gets support until the back-doors are fixed.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i801w6y",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1652149289.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i83neq6",
                    "author": "InevitableMotor7891",
                    "score": 1,
                    "created_utc": 1652216971.0,
                    "response": "I did the same thing... how do I get help can someone please help?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i83oph0",
                    "author": "InevitableMotor7891",
                    "score": 1,
                    "created_utc": 1652217504.0,
                    "response": "They have to create a support for this can everyone please upvote...?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i83y8e1",
                    "author": "No-Geologist-885",
                    "score": 1,
                    "created_utc": 1652221555.0,
                    "response": "Same thing happened to me.  Things like this happen from time to time in crypto but it doesn't hurt any less.    I wish Coinbase would create a redemption tool that would allow us to point to a custom coin contract/transaction, pay for gas and send it back to the original wallet.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i83zgdk",
                    "author": "TwentyOneJ",
                    "score": 1,
                    "created_utc": 1652222091.0,
                    "response": "Same thing happened to me... Can we all start asking coinbase or create a group? Binance gives you the coin back but not sure why coinbase chooses not to...\n\nI have sent wormhole luna intead of wrapped luna by accident. FML",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i84nios",
                            "author": "radiofriendly123",
                            "score": 1,
                            "created_utc": 1652232946.0,
                            "response": "Yes, same here. We've got a group of users on Twitter contacting support and pressuring coinbase to help. Please continue to contact support daily pressuring them to resolve this issue. You are not alone - there are many of us dealing with this issue that have lost a lot of money unless coinbase takes a few minutes to help us out.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i89v6ec",
                                    "author": "This_Neighborhood861",
                                    "score": 2,
                                    "created_utc": 1652325586.0,
                                    "response": "This happend to me today. Please add me to the group! DM me and will provide you with my email. I'm currently emailing Coinbase and they've told me that my funds have arrived in my Coinbase and will take some time to show up.  \n\n\nI'm not sure if Coinbase already implemented a change since the date of this post, but the customer rep told me that its in my account and should show up. Let's see if this customer rep was just an idiot and lied to me or if, in fact, Coinbase has taken noticed and resolved this.  \n\n\nI'm happy to provide updates, but please keep getting the group together to continue pushing CB customer support!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i808xdj",
                    "author": "JohnLiv019",
                    "score": 0,
                    "created_utc": 1652152716.0,
                    "response": "They need to bring back their targeted price alerts",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "umwnpm",
            "title": "Cory Klippsten on Twitter.",
            "url": "https://twitter.com/coryklippsten/status/1524158099229003777?s=21&t=Q8uwEyV-tz804fMvsLjZag",
            "author": "ZiltoidM56",
            "created_utc": 1652227747.0,
            "score": 22,
            "num_comments": 40,
            "subreddit": "CoinBase",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i84f3z5",
                    "author": "GraveyardZombie",
                    "score": 5,
                    "created_utc": 1652229110.0,
                    "response": "NYKNYC",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i85fgaq",
                    "author": "ndreamer",
                    "score": 2,
                    "created_utc": 1652247625.0,
                    "response": "Now if all the customers were to withdrawal, would they even have those assets ? I know most exchanges would struggle.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i84iy3b",
                    "author": "Kiwip0rn",
                    "score": 3,
                    "created_utc": 1652230864.0,
                    "response": "🙄 Nothing new or interesting.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i84kyn3",
                            "author": "MrL09",
                            "score": 4,
                            "created_utc": 1652231786.0,
                            "response": "Actually it’s new since it was just filed in their 10Q.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i851qhy",
                                    "author": "Other_Ad528",
                                    "score": 5,
                                    "created_utc": 1652239618.0,
                                    "response": "Just ignore this guy, he has coinbases cock shoved so deep in his ass",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i852ldj",
                                    "author": "Kiwip0rn",
                                    "score": 1,
                                    "created_utc": 1652240058.0,
                                    "response": "They are just clarifying their position for the stock holders for legal reasons. This isn't new information, you signed up and accepted the ToS, and the information was already in the ToS. \n\nThey are not \"hurting\" or thinking about bankruptcy 🙄 they just bought (or buying) another exchange and another hot wallet, along with working directly with Ledger Wallet on a new exchange platform.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i85ta90",
                                    "author": "itsnotlupus",
                                    "score": 1,
                                    "created_utc": 1652258686.0,
                                    "response": "Speaking of brand new things, this is exactly what happened to MtGox customers. Bankruptcy proceedings have been dragging on for 8 years and counting, and customers are still waiting to recoup a portion of their balances.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i85phlq",
                                    "author": "Gallows94",
                                    "score": 0,
                                    "created_utc": 1652255352.0,
                                    "response": "It is not new. This is literally the case for all exchanges. You're treated as an unsecured creditor so in order of who gets paid out from the estate, unsecured creditors are last in line.\n\nCoinbase was just stating that that scenario is a risk to users.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i84m0s4",
                    "author": "BadAtRocks",
                    "score": 2,
                    "created_utc": 1652232262.0,
                    "response": "If they are talking about bankruptcy it's time to get a ledger wallet.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i84nfur",
                            "author": "ZiltoidM56",
                            "score": 2,
                            "created_utc": 1652232910.0,
                            "response": "Trezor or Ledger for sure. But you should only be buying Bitcoin anyway, run you’re own full node.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i84zzms",
                    "author": "slenker99",
                    "score": 3,
                    "created_utc": 1652238731.0,
                    "response": "What’s wrong with a company locking up funds, reducing rates, and warning customers they may never get those funds back??",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i84c37o",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1652227747.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8l0313",
                    "author": "dgidyi",
                    "score": 1,
                    "created_utc": 1652540506.0,
                    "response": "🧬 @Foreverise_BSC - revolutionary watch-to-earn protocol allowing holders to earn up to 298 USDT per month\n\n💰 Main utility is \"Forever Earn\" platform on for Android / iOS through which you can watch ads and earn USDT\n\n⭐️Pinksale Presale Live #foreverise \nhttps://www.pinksale.finance/#/launchpad/0xa756324759Ac9a1097b875484596Db815f8fE1Df?chain=BSC",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i85531k",
                    "author": "lazysmartdude",
                    "score": 0,
                    "created_utc": 1652241346.0,
                    "response": "Ngmi",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "um7ioc",
            "title": "\"Unable to verify address\"",
            "url": "https://www.reddit.com/r/CoinBase/comments/um7ioc/unable_to_verify_address/",
            "author": "s_mekras",
            "created_utc": 1652148241.0,
            "score": 3,
            "num_comments": 30,
            "subreddit": "CoinBase",
            "selftext": "Probably not the first one here that has this happened to them, but for months now my account has been in restricted mode because Coinbase cannot verify my address.  \n\n\nI've attempted to do so with a phone bill multiple times, both in PDF and JPG formats, to no avail. I've also contacted support about it twice, getting no response whatsoever.  \n\n\nAnyone has any ideas as to what I can do?",
            "stickied": false,
            "comments": [
                {
                    "id": "i809rv8",
                    "author": "Yeomandaffodil7",
                    "score": 2,
                    "created_utc": 1652153144.0,
                    "response": "You need ID to verify",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i817do5",
                            "author": "s_mekras",
                            "score": 2,
                            "created_utc": 1652177538.0,
                            "response": "I'm trying to verify the address, not my identity. That step is already done.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i82hspm",
                                    "author": "Yeomandaffodil7",
                                    "score": 2,
                                    "created_utc": 1652200284.0,
                                    "response": "You would verify your address same way your id will have to it address",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8aycdh",
                                            "author": "s_mekras",
                                            "score": 1,
                                            "created_utc": 1652354100.0,
                                            "response": "...what?",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i7zzksx",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1652148241.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "un8vae",
            "title": "Coinbase earnings were bad. Worse still, the crypto exchange is now warning that bankruptcy could wipe out user funds",
            "url": "https://fortune.com/2022/05/11/coinbase-bankruptcy-crypto-assets-safe-private-key-earnings-stock/",
            "author": "bluetidepro",
            "created_utc": 1652272631.0,
            "score": 165,
            "num_comments": 679,
            "subreddit": "CoinBase",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i86hcui",
                    "author": "Badgerisbest",
                    "score": 110,
                    "created_utc": 1652274501.0,
                    "response": "Revenue is down at every crypto exchange, just like any bear market.\n\nI don't see how lawyer speak disclosure is terrifying. If you are sweating CB use a private wallet. If you dive deep and dirty on any terms of service you are going to find some terrifying sounding shit. No one reads them though, until it gets passed around on Twitter like it's the Watergate source.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i87yjey",
                            "author": "realjimcramer",
                            "score": 6,
                            "created_utc": 1652295774.0,
                            "response": "Point is, if Coinbase decides to declare bankruptcy then it's no different than keeping your crypto in Robinhood. They basically are just admitting that if they declare bankruptcy they will liquidate YOUR assets to soften the blow to themselves, aka, fuck the customer.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8847jn",
                            "author": "harshdozer",
                            "score": 4,
                            "created_utc": 1652297985.0,
                            "response": "Definitely use a private wallet. Even if you ain’t sweating.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i88pdrn",
                                    "author": "The_Night-Man_Cometh",
                                    "score": 1,
                                    "created_utc": 1652306431.0,
                                    "response": "How does one do this? I use Coinbase and it's the only platform I've ever used.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i88sf9i",
                                            "author": "godnorazi",
                                            "score": 1,
                                            "created_utc": 1652307747.0,
                                            "response": "Coinbase offers a wallet... just search for it on your smartphone appstore. Transfer whatever you don't need to use in the short term to the wallet.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i895vfk",
                                                    "author": "nerdtard1515",
                                                    "score": 2,
                                                    "created_utc": 1652313927.0,
                                                    "response": "Hey man, quick question. Will coinbase wallet be operational if they go bankrupt?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i89e6bf",
                                                            "author": "crs1904",
                                                            "score": 9,
                                                            "created_utc": 1652317722.0,
                                                            "response": "Found this message on CB today: \n\nA message to our customers\nTLDR: Your funds on Coinbase are protected, secure, and yours.\nYou may have heard some noise recently about who owns your assets and what claims Coinbase creditors may have to them. The reality is that your assets are... your assets. Not ours or anyone else's.\nWe want to reiterate these two important points for anyone who has questions.\nFirst, and most importantly, your funds are safe at Coinbase, and they always will be.\nAs we’ve said for years in our User Agreement with you (Section 2.6.1.) your assets are just that--yours. Not ours or anyone else's. Customer retail funds are and always will be accounted for entirely separately from our corporate accounts. We’ll say it again. Your funds are your own. They have been and always will be accounted entirely separately from our corporate accounts. \nSecond, our business is healthy and we are committed to crypto for the long-haul. \nMarket conditions have changed due to a large number of factors, and their impact extends beyond crypto and tech. Our balance sheet remains healthy and we will continue to invest in the products and ventures that will create better experiences and value for our users. \nCoinbase was founded in 2012 and we’ve emerged from every single cycle to date stronger and more focused on our customers. We will never waver in our commitment to the security of your funds that you’ve entrusted to our platform. We are here for the long-haul. \nNow, back to building the future.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i89x16b",
                                                                    "author": "bassanaut",
                                                                    "score": 4,
                                                                    "created_utc": 1652326531.0,
                                                                    "response": "Thanks, needed to read this. All I’ve seen today is how if coinbase goes bankrupt your crypto goes with it… yes I know I should use a wallet or a ledger but I just want some exposure to the space long term and the app is a breeze.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i89x3hl",
                                                                            "author": "crs1904",
                                                                            "score": 1,
                                                                            "created_utc": 1652326566.0,
                                                                            "response": "Agreed.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "id": "i8a23qr",
                                                                    "author": "I_SUCK__AMA",
                                                                    "score": 1,
                                                                    "created_utc": 1652329340.0,
                                                                    "response": "do they mean your *crypto* is yours, or your *IOU's* are yours?  separate accounting doesn't guarantee you can withdraw after a black swan.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                },
                                                                {
                                                                    "id": "i8cn5m6",
                                                                    "author": "Clever_Monkey666",
                                                                    "score": 1,
                                                                    "created_utc": 1652380426.0,
                                                                    "response": "As opposed to saying they are on the brink of bankrupcy?",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i88z1hi",
                                                    "author": "The_Night-Man_Cometh",
                                                    "score": 1,
                                                    "created_utc": 1652310707.0,
                                                    "response": "Obliged!",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i89v1k3",
                                            "author": "ThenPotato7417",
                                            "score": 1,
                                            "created_utc": 1652325518.0,
                                            "response": "Don’t use the Coinbase wallet, their fees are crazy high",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8b9ze4",
                                                    "author": "Additional-Cap-7110",
                                                    "score": 1,
                                                    "created_utc": 1652360547.0,
                                                    "response": "Isn’t it just a noncustodial front end?",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i86iexe",
                            "author": "fv7061",
                            "score": 26,
                            "created_utc": 1652274987.0,
                            "response": "Lawyer Speak = Coinbase has stated they are burning through cash at a very high rate.  When that happens there is a risk of bankruptcy.  If Coinbase declares bankruptcy, the crypto users bought is unsecured debt, which means that you will literally get pennies on the dollar for your crypto held in Coinbase.  Plus it will take years in bankruptcy court to see those pennies.\n\nSo in non-lawyer speak: if Coinbase declarers bankruptcy and you own $20,000 in cypto through Coinbase at the time of their filing, your Coinbase holdings will suddenly become inaccessible to you and will probably get $200-$500 dollars for your $20,000 in crypto 1-2 years after their bankruptcy filing.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i86ke2p",
                                    "author": "Badgerisbest",
                                    "score": 23,
                                    "created_utc": 1652275875.0,
                                    "response": "You are talking about coinbase literally not making payroll for their employees for this to happen. Now this would be after aggressive layoffs, which anyone can monitor as well, as a public company massive CB layoffs would be reported within days. \n\nLawyer speak conditions are literally written for doomsday scenarios, not everyday operations, or the average crypto bear market.\n\nIf I'm Brian Armstrong and the crypto bear market turns into a long hard as hell winter, do the grim task of laying off 50% of the employees (I would rather hold on to them for the next crypto bull market explosion if possible) but that would cut costs by an insane amount. If anyone's crypto holdings got touched before they laid off maybe down to 200 employees, the entire company is dead. They have 5000 employees, as as someone who has tried to work with crypto exchanges in partnerships, almost all of the employees are burnt the fuck out and don't have enough support.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i86lsco",
                                            "author": "fv7061",
                                            "score": 6,
                                            "created_utc": 1652276497.0,
                                            "response": "Yes, which is what happens when companies declare bankruptcy.  Coinbase burned through $1.5 billion dollars of cash during the first quarter alone.  I'm old enough to remember the dot-com bubble bursting.  There were all of these trendy tech companies that were unprofitable and were burning through cash at a very high rate, but had huge valuations based on \"growth\".  Then the economy downturned, the fed raised interest rates several times and large percentage of these companies stopped paying their employees and went bankrupt.\n\n[https://en.wikipedia.org/wiki/Dot-com\\_bubble](https://en.wikipedia.org/wiki/Dot-com_bubble)\n\n>If I'm Brian Armstrong and the crypto bear market turns into a long hard as hell winter, do the grim task of laying off 50% of the employees (I would rather hold on to them for the next crypto bull market explosion if possible) but that would cut costs by an insane amount. If anyone's crypto holdings got touched before they laid off maybe down to 200 employees, the entire company is dead. They have 5000 employees, as as someone who has tried to work with crypto exchanges in partnerships, almost all of the employees are burnt the fuck out and don't have enough support.\n\nLet's say they lay of 2,500 employees and each of those employees is earning $200k.  That saves them $500 million dollars.  What about the other $1 billion dollars they burned through in Q1?\n\nAnd yes, layoffs would happen before a bankruptcy, they always do.  But layoffs won't fix their cash burn problem.  Also, Coinbase wouldn't \"touch\" cypto holdings.  That is not how bankruptcy works. The courts would handle it and those who held unsecured debt, which Coinbase has stated all of their crypto holdings are, would get almost nothing.\n\nYou are correct, that this is a worse case scenario.  But bankruptcies happen.  No one knows how long this bear market will last.  But the fact that Coinbase's crypto holding are unsecured should absolutely worry anyone who has their crypto in Coinbase.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i87wv96",
                                                    "author": "Glazier1273",
                                                    "score": 3,
                                                    "created_utc": 1652295114.0,
                                                    "response": "Exactly, they burn so much cash that they can declare bankruptcy anytime. Brian made his money, board made their money, employees made their money... what do any of them care if the company folds and investors get screwed?",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i8734ae",
                                                    "author": "meeok2",
                                                    "score": 5,
                                                    "created_utc": 1652283513.0,
                                                    "response": "Wait... Coinbase has employees???",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i89vp5h",
                                                            "author": "maxmcleod",
                                                            "score": 1,
                                                            "created_utc": 1652325844.0,
                                                            "response": "5000 of them",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i86o4y7",
                                                    "author": "Jeffscrazy",
                                                    "score": 7,
                                                    "created_utc": 1652277499.0,
                                                    "response": "This is not the dot-com bubble. Coinbase has been through 2 bear markets and knows how to handle another",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i86ouo2",
                                                            "author": "fv7061",
                                                            "score": 4,
                                                            "created_utc": 1652277800.0,
                                                            "response": "They went public in April 2021.  Also, they were founded in 2012. When I say “bear market” I don’t mean “crypto bear market” I mean overall stock market “bear market”. Because as long as interest rates are low and the general economy is fine, Coinbase and other exchanges will have no problem securing VC funding. However, when interest rates go up and the S&P goes down, securing VC funding becomes much harder.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i878q7o",
                                                                    "author": "Mace_TheAce_Windu",
                                                                    "score": 4,
                                                                    "created_utc": 1652285696.0,
                                                                    "response": "Also they don’t own coins for every coin purchased. They may maintain a pool but users just get an iou. If a shit ton of users pull their coins and drain the pool, cb has to go out and purchase more of those coins to refill the pool. \n\nThey’re losing a shit ton of money fast and that would increase that amount a lot",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                },
                                                                {
                                                                    "id": "i86q53q",
                                                                    "author": "Jeffscrazy",
                                                                    "score": 3,
                                                                    "created_utc": 1652278345.0,
                                                                    "response": "Yeah, I realise what you’re saying and you’re right, there’s a big crash coming for the entire financial market. But the fact that Coinbase only went public in 2021 at the peak of the bull market is what explains the drop in share price. If Coinbase investors expected their investment to keep going up year, after year, after year, without considering bear markets, then they deserve to lose money. Investing money in to Coinbase is really only gonna pay off by the next bull run.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "i89gwfq",
                                                            "author": "Bridge41991",
                                                            "score": 1,
                                                            "created_utc": 1652318937.0,
                                                            "response": "The dot com bubble comment was salient but this was a nice rebuke. Thanks for info.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i87bxxv",
                                                    "author": "FlaggyAZ",
                                                    "score": 3,
                                                    "created_utc": 1652286931.0,
                                                    "response": "Instead of arguing why don’t you just withdraw your crypto to a wallet?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i895qy8",
                                                            "author": "nerdtard1515",
                                                            "score": 3,
                                                            "created_utc": 1652313870.0,
                                                            "response": "Will Coinbase wallet be operational if they go bankrupt?",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8aoqop",
                                                                    "author": "user-removed",
                                                                    "score": 1,
                                                                    "created_utc": 1652346491.0,
                                                                    "response": "I wonder the same",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i8dfabc",
                                                                            "author": "Fetaolive",
                                                                            "score": 1,
                                                                            "created_utc": 1652391555.0,
                                                                            "response": "Is our crypto at risk even if you keep it in a coinbase wallet?",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i873fib",
                                                    "author": "meeok2",
                                                    "score": 2,
                                                    "created_utc": 1652283635.0,
                                                    "response": ">  Let's say they lay off 2,500 employees and each of those employees is earning $200k.\n\nMore like each is earning 2k...",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i86nk0q",
                                                    "author": "Badgerisbest",
                                                    "score": 1,
                                                    "created_utc": 1652277254.0,
                                                    "response": "Coinbase could run on 200 employees if the crisis means it has to.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i86ujnr",
                                                            "author": "Connect-Ad-1088",
                                                            "score": 13,
                                                            "created_utc": 1652280127.0,
                                                            "response": "so lay off everyone but the one person who works in the customer care department?",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i887pdf",
                                                                    "author": "gold4829",
                                                                    "score": 2,
                                                                    "created_utc": 1652299331.0,
                                                                    "response": "I don't know why but thats funny!",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "i89jqs2",
                                                            "author": "Acrobatic_Rate_9377",
                                                            "score": 1,
                                                            "created_utc": 1652320149.0,
                                                            "response": "If they started doing that people would run on their accounts because that would be a huge confidence red flag. and cause a death spiral",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i89v6ss",
                                                                    "author": "Badgerisbest",
                                                                    "score": 1,
                                                                    "created_utc": 1652325591.0,
                                                                    "response": "People are all asking/expecting for a death spiral now?!! Who gives a fuck. I feel like everyone here is on ledges trying to jump off buildings. Jump off if you want to. Just don't act shocked when coinbase doesn't collapse to vapor in 3 months.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i8a0znk",
                                    "author": "I_SUCK__AMA",
                                    "score": 2,
                                    "created_utc": 1652328704.0,
                                    "response": "sad how a crypto company founded in 2012 at sub-$10 BTC could even be thinking about bankruptcy.  they hold 10% of all crypto for their customers, but didn't think to save any on their own balance sheet, dumb ass move.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i87xm3a",
                                    "author": "GoldBow3",
                                    "score": 1,
                                    "created_utc": 1652295411.0,
                                    "response": "You’re just pulling at strings here buddy",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i87xopl",
                                    "author": "GoldBow3",
                                    "score": 1,
                                    "created_utc": 1652295440.0,
                                    "response": "You know you can withdraw your crypto into a wallet right?",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i88d8h8",
                                    "author": "MikeSwizzy",
                                    "score": 1,
                                    "created_utc": 1652301512.0,
                                    "response": "How the fuck do you go bankrupt moving electrons. Yet alone with their huge fees for buying, selling, withdrawing and also there margin cut from executing orders above what u want to pay for.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8b9tk7",
                                            "author": "Additional-Cap-7110",
                                            "score": 1,
                                            "created_utc": 1652360470.0,
                                            "response": "How do you go bankrupt after being in crypto since 2012",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i87sb7y",
                            "author": "bsbbtnh",
                            "score": 2,
                            "created_utc": 1652293301.0,
                            "response": "Not only has coinbase's revenue dropped by over 50%, their expenses have over doubled. Why they decided to spend an extra billion per quarter is beyond me.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i86ou7g",
                            "author": "livens",
                            "score": -4,
                            "created_utc": 1652277794.0,
                            "response": "Yeah everyone thinks crypto is safer than banks/fiat somehow. Your money in a bank is insured by the Federal Government, FDIC, up to $250k on deposits. Your bank goes tits up, your money is safe. And banks rarely go tits up anymore due to government bailouts anyway.\n\nCoinbase, Robinhood and those others who are holding hundreds of (B)illions worth of crypto... It might as well truly be \"fake internet money\".",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i86p3vx",
                                    "author": "Badgerisbest",
                                    "score": 9,
                                    "created_utc": 1652277905.0,
                                    "response": "This thread is dropping FDIC insurance and the dot.com bubble like it's brand new information lmao.\n\nAgain, if you've got the fud bug, there is no shame to withdraw to your private wallet.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i89bep7",
                            "author": "Key-Ad-742",
                            "score": 1,
                            "created_utc": 1652316474.0,
                            "response": "CB fees is unsustainable.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i89illc",
                                    "author": "Badgerisbest",
                                    "score": 2,
                                    "created_utc": 1652319664.0,
                                    "response": "This threat is about BANKRUPTCY. Not \"we had to lower our fees to be more competitive.\" stock and bond brokers did not literally just collapsed. They adjusted their fees and moved on to create more revenue avenues.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i89z9sv",
                            "author": "Chabubu",
                            "score": 1,
                            "created_utc": 1652327743.0,
                            "response": "A bank or investment house does not claim that user funds will become property of the bank or company if they go bankrupt. \n\nThere will be an outflow from coinbase. If people are going to ride out a winter, its safer done off of the exchange.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i86nim0",
                    "author": "snoop_Nogg",
                    "score": 11,
                    "created_utc": 1652277237.0,
                    "response": "I've already lost most of my money, anyway",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i86kaju",
                    "author": "josephcfrost",
                    "score": 7,
                    "created_utc": 1652275830.0,
                    "response": "If I have Coinbase wallet and use their cold storage , If  Coinbase declares bankruptcy what does that mean for Coinbase wallet, that wallet is always there despite Coinbase going bankrupt and the  centralized exchanges suffering?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i86wyrl",
                            "author": "failf0rward",
                            "score": 9,
                            "created_utc": 1652281096.0,
                            "response": "You own the keys for Coinbase wallet, so you own the coins.  Coinbase doesn’t even have access to do anything with your stuff there, and it would not be included in any kind of Coinbase bankruptcy.  CB wallet is just a nice GUI wallet for your coins.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i87dfii",
                                    "author": "ReDeaMer87",
                                    "score": 3,
                                    "created_utc": 1652287501.0,
                                    "response": "This is nice to hear. I'm paying out my last 10k on cb card then getting my 4% rewards moved out quick",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i88f4uj",
                                            "author": "ZirJohn",
                                            "score": 3,
                                            "created_utc": 1652302265.0,
                                            "response": "Coinbase isn't going anywhere. The title is just scary sounding clickbait.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i88f8gx",
                                                    "author": "ReDeaMer87",
                                                    "score": 1,
                                                    "created_utc": 1652302305.0,
                                                    "response": "Probably. But I'll just only put money in that I need for cb card just in case",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i88g29q",
                                            "author": "qAM15KQHwC8",
                                            "score": 1,
                                            "created_utc": 1652302634.0,
                                            "response": "Bingo\n\nI transferred everything to my favorite low gas cost coin and moved it into my private wallet where it can sit for a decade or more \n\nIt may end up being worthless, but at least I control the access to the coins",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i8wd1sh",
                                            "author": "Professional_Chonker",
                                            "score": 1,
                                            "created_utc": 1652753703.0,
                                            "response": "I have a Coinbase card, too. I hold USD which the card draws from.  I do believe that any USD held at Coinbase is FDIC insured up to $250,000.\n\nhttps://www.coinbase.com/legal/insurance\n\nI do think though that it may be worth transferring off the crypto rewards.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i86mzx3",
                            "author": "SwagMcDag",
                            "score": 2,
                            "created_utc": 1652277017.0,
                            "response": "Also curious about if my stuff in CB wallet is safe",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i86sdz2",
                                    "author": "gingerballs45",
                                    "score": 8,
                                    "created_utc": 1652279261.0,
                                    "response": "This fundamentally doesn’t make sense, happy to explain why.\n\nThink about the non-custodial wallet as JUST a user interface, this wallet displays your funds held in a specific key locked by a seed phrase.\n\nEven if the Coinbase wallet app was deleted, you could still access your funds with the seed phrase.\n\nEven if every single wallet provider was deleted and went bankrupt, you could still access your funds.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i86t90g",
                                            "author": "SwagMcDag",
                                            "score": 3,
                                            "created_utc": 1652279606.0,
                                            "response": "thank you for the explanation. I just wasn’t entirely sure if there was some sort of loophole they may have on the wallet since it wears their brand. But the way you have explained it has put me at ease and I appreciate it.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i86tk27",
                                                    "author": "gingerballs45",
                                                    "score": 5,
                                                    "created_utc": 1652279730.0,
                                                    "response": "Absolutely dude, please take some time to learn now about how people will try to scam you of your seed phrase. Guard it with your life, and make sure to be careful when connecting your wallet to any website.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i86uc07",
                                                            "author": "SwagMcDag",
                                                            "score": 3,
                                                            "created_utc": 1652280043.0,
                                                            "response": "For sure. That is one of the few things I do for sure. Someone would have to pry my seed phrase from my cold dead hands!",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i873itm",
                                            "author": "M_Mich",
                                            "score": 3,
                                            "created_utc": 1652283670.0,
                                            "response": "so essentially anything not planned to trade anytime soon should be in the wallet and not coin base trading",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i87422g",
                                            "author": "josephcfrost",
                                            "score": 3,
                                            "created_utc": 1652283879.0,
                                            "response": "Thanks for that.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i88ez6k",
                            "author": "ZirJohn",
                            "score": 1,
                            "created_utc": 1652302202.0,
                            "response": "Doesn't matter, its on the blockchain. The app may stop working, but you can recover with the seed phrase on another wallet.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i877m2p",
                    "author": "456080107",
                    "score": 6,
                    "created_utc": 1652285260.0,
                    "response": "Anyone else regret locking your ETH in coinbase for ETH2? We’re fucked",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i89n51q",
                            "author": "silverwarewolf",
                            "score": 1,
                            "created_utc": 1652321693.0,
                            "response": "I was wondering about this, wtf do we do??!",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8bd47w",
                                    "author": "Additional-Cap-7110",
                                    "score": 1,
                                    "created_utc": 1652362014.0,
                                    "response": "Presumably Coinbase has locked the Eth in the contract as well and can’t access it either, no?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i86tbs3",
                    "author": "J-Rocks-baby-mama",
                    "score": 4,
                    "created_utc": 1652279637.0,
                    "response": "This was just standard language required by the SEC.  Any publicly traded exchange would need to report this statement.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8wd9v5",
                            "author": "Professional_Chonker",
                            "score": 1,
                            "created_utc": 1652753817.0,
                            "response": "Yeah. This sub can be really disappointing. So much FUD and complaining.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i88eafg",
                    "author": "Scary_Introduction40",
                    "score": 3,
                    "created_utc": 1652301929.0,
                    "response": "So is the move to transfer everything to meta mask wallet?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i86u9xa",
                    "author": "asstyrant",
                    "score": 16,
                    "created_utc": 1652280022.0,
                    "response": "The amount of doomsaying over what amounts to a typical legalese statement that anyone with a simple understanding of bankruptcy proceedings already knew is quite comical.  Just goes to show that the crypto space is overpopulated by moonbois who don't bother reading any of the shit they're signing up for. \n\nOh, and if CB's abysmal support drones are watching, this is the *exact* situation that I described in my open letter to you (since blocked publicly, and ignored privately) as to why you need an active mod-team, rather than whatever this piss-poor excuse for moderation is.  You had the opportunity to get out in front of this wave of negativity before it became a tsunami of misinformation, but instead your \"mods\" sat in the corner short-stroking it to pictures of Bored Apes.  Whomever you're paying to do this should be shot and pissed on.\n\nFor the idiots who take this as a sign that CB is going to go belly up: move your coins off the exchange.  Simple.  However, each and every exchange has the same potential fatal flaw whether they declare it or not -- not your keys, not your crypto.  If this is bothersome to you, then move your coins to your own wallet and be done with it.  Otherwise, there's always a risk that you'll get caught up in MtGox 2.0.\n\nCan't move your ETH off because you locked stake into 2.0?  Tough shit.  That was part and parcel of the agreement you signed (or check-boxed) when committing to the stake.  Don't like it?  Maybe you should have read the agreements and disclosures, eh?  Shit sucks, but maybe you'll learn from the experience and think twice before doing it again. \n\nSick and fucking tired of noisy fucking idiots.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i872dxt",
                            "author": "_Schizo_",
                            "score": 4,
                            "created_utc": 1652283226.0,
                            "response": "> Sick and fucking tired of noisy fucking idiots",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i88bn23",
                            "author": "ryankindsethart",
                            "score": 2,
                            "created_utc": 1652300880.0,
                            "response": "Agreed and I have been through a company bankruptcy and lost equity within that company.\n\nBut I will say, there are some serious holes that Coinbase has to workthrough, including our stupid asses that need Unsupported Crypto Recovery. \n\nYour take might be check where you send your assets to….well I didn’t like a moron. BUT that doesn’t mean you don’t build out support to give access to us idiots our crypto even with a fee.\n\nIf Coinbase is going to act like a bank, then Coinbase needs customer service like a bank.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i88eedj",
                                    "author": "asstyrant",
                                    "score": 2,
                                    "created_utc": 1652301973.0,
                                    "response": "No disagreement, CB has some serious shortcomings that need to be addressed if they want to remain ahead of their competitors.\n\nI personally think the 'Unsupported Crypto Recovery' you mention is a bit of a stretch, but it would help save people from themselves a bit.  Personally, I'd just like CB to put some actual effort into client support -- but that appears to be a monumental ask for some reason. \n\nBanks have customer service?  Not in my country, they don’t!",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i88fgo5",
                                            "author": "ryankindsethart",
                                            "score": 2,
                                            "created_utc": 1652302396.0,
                                            "response": "Yeah client support is definitely the biggest flaw if they care about customer retention. Lmao, seems to be a trend with financial institutions",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i86tulk",
                    "author": "dacoo1",
                    "score": 5,
                    "created_utc": 1652279850.0,
                    "response": "It’s time to sell coinbase stock and move your crypto holdings off",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i87ptfv",
                            "author": "ethbullrun",
                            "score": 1,
                            "created_utc": 1652292310.0,
                            "response": "it's funny because i feel as if a lot of the cb employees dumped their stock when it was at like 440$ for half a day on new investors. this shitty stock is sitting at 52.87$ right now is is down 30% in the past 24 hours",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8au30d",
                            "author": "thisonelife83",
                            "score": 1,
                            "created_utc": 1652351029.0,
                            "response": "I’ll be looking to pick up COIN stock if the price drops. They have solid earnings and a PE of less than 4.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i86gakb",
                    "author": "InDEThER",
                    "score": 16,
                    "created_utc": 1652274009.0,
                    "response": "If you want to save safely, put your money in an FDIC insured bank. If you want to invest safely, put your money in a SIPC insured brokerage. \n\nIf you want to invest recklessly, put your money in a Las Vegas casino or buy cryptocurrency. \n\nEven if Coinbase has no intention of going bankrupt, there is a non-zero chance of that happening. In the unlikely event of bankrupty, it should be disclosed to customers and investors that deposits are not insured on any way and they will lose everything. \n\nThe inconvenient truth is that this is true for EVERY crypto exchange. But only Coinbase, as a publicly traded company, is required by law to disclose risks to customers. No other crypto exchange does this.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i86hxfh",
                            "author": "stonecats",
                            "score": 8,
                            "created_utc": 1652274765.0,
                            "response": "> only Coinbase, as a publicly traded company,   \nis required by law to disclose risks to customers.\n\nthanks, this puts today's statement into proper context.  \n\nmy question is... i own 1 BTC in my own secure wallet    \nwhat difference does it make if coinbase disappears?    \ni have the wallet address, all the security words, etc.  \ni still have that exclusive virtual blockchain, don't i ?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i86i641",
                                    "author": "Deeman0",
                                    "score": 8,
                                    "created_utc": 1652274875.0,
                                    "response": "Yes, yes you do.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i86p4ak",
                                    "author": "livens",
                                    "score": 5,
                                    "created_utc": 1652277909.0,
                                    "response": "That's a good point, and I think most Coinbase users don't understand it.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i893vvk",
                                            "author": "jondough23",
                                            "score": 1,
                                            "created_utc": 1652312998.0,
                                            "response": "I’ve been using corn beast for years and I have no clue how it should work I just sent money to the address I’m told",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i88etil",
                                    "author": "ZirJohn",
                                    "score": 3,
                                    "created_utc": 1652302140.0,
                                    "response": "Why do you own a whole bitcoin when you don't know the answer to your question???",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i88hsr6",
                                            "author": "stonecats",
                                            "score": 1,
                                            "created_utc": 1652303321.0,
                                            "response": "https://image.slidesharecdn.com/rhetoricalquestion-091122142302-phpapp02/85/figurative-language-rhetorical-question-2-320.jpg",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i89ifqj",
                                                    "author": "ZirJohn",
                                                    "score": 1,
                                                    "created_utc": 1652319602.0,
                                                    "response": "That wasn't a rhetorical question though. You clearly wanted an answer to your hypothetical, not rhetorical, question. It's not a good hypothetical question either because am I supposed to know you don't actually have 1 btc if you don't indicate it anywhere and I don't know how much money you have? If you're going to ask a hypothetical question like that you need to just add \"if\" to the beginning.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i89qm0c",
                                                    "author": "sweglrd143",
                                                    "score": 1,
                                                    "created_utc": 1652323326.0,
                                                    "response": "You should read your own link buddy",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i87v0qt",
                                    "author": "divinenuker",
                                    "score": 1,
                                    "created_utc": 1652294378.0,
                                    "response": "The difference is that you will have a very hard time exchanging that BTC for USD if Coinbase disappears. Unless you live in El Salvador - you can't buy stuff directly with BTC. Not very easily anyway.\n\nThat would have a catastrophic impact on the crypto market. The reason it saw so much growth the last couple years is people having access to exchanges.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8b3vkn",
                                    "author": "Yorozuya_no_Danna",
                                    "score": 1,
                                    "created_utc": 1652357432.0,
                                    "response": "assuming you're using a non-custodial, reputable and open source wallet, this means you are in full control of your coins, no one can touch it unless you get hacked or something so make sure to practice good security habits to minimize that threat as much as possible.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8ba8br",
                                    "author": "Additional-Cap-7110",
                                    "score": 1,
                                    "created_utc": 1652360664.0,
                                    "response": "If you have bitcoin in your own wallet then it has nothing to do with any outside company going bankrupt.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8b7v8j",
                            "author": "HelenofSparta3",
                            "score": 1,
                            "created_utc": 1652359518.0,
                            "response": "Good point that they are legally required to disclose this, but what people don’t realize about FDIC insured bank accounts is that they have 99 YEARS to return your funds.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i86qlcj",
                    "author": "TheCureprank",
                    "score": 6,
                    "created_utc": 1652278531.0,
                    "response": "Fucking criminals are running every facet of both markets",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i86morz",
                    "author": "bootleg_gucci",
                    "score": 2,
                    "created_utc": 1652276887.0,
                    "response": "If our CB Pro account has cash only, is this subject to the bankruptcy creditors as well?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i86vchh",
                            "author": "CreepyGuyHole",
                            "score": 3,
                            "created_utc": 1652280449.0,
                            "response": "Yes any assets in which they are the custodian.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8wdg0s",
                            "author": "Professional_Chonker",
                            "score": 1,
                            "created_utc": 1652753903.0,
                            "response": "I don't think so, it's FDIC insured. \n\nhttps://www.coinbase.com/legal/insurance",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8xr48o",
                                    "author": "bootleg_gucci",
                                    "score": 1,
                                    "created_utc": 1652789815.0,
                                    "response": "Just to be safe, withdrew cash as well until market stabilizes",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i86rx17",
                    "author": "cmdrshepherd1993",
                    "score": 2,
                    "created_utc": 1652279070.0,
                    "response": "🤔 I use Coinbase so this is definitely something.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i873zdd",
                    "author": "Minnow125",
                    "score": 2,
                    "created_utc": 1652283850.0,
                    "response": "I suspect their users coins are backed up by some type or stablecoin which is completely imploding.   “Poof. It’s gone” 😂",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i87hqdn",
                    "author": "Dantemofo",
                    "score": 2,
                    "created_utc": 1652289165.0,
                    "response": "Would this also affect people who have crypto assets stored in Coinbase Wallet?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i89iu4a",
                    "author": "VillainOK",
                    "score": 2,
                    "created_utc": 1652319760.0,
                    "response": "I posted this elsewhere, but am reposting to hopefully get some thoughtful feedback on my analysis, versus the alarmism that’s happening over a required disclosure for non insured assets:\n\nThey have 6b in free cash, and their assets are 20b versus 14b in liabilities. If they liquidated today and paid all creditors, the company would still have a book value of 6b. Current trading price even after todays action is a 12b market cap. They posted a 430mm q1 loss after posting 800m profits in q4. They could withstand multiple (10-12+) quarters with losses like this and be far from bankruptcy unless they did something absolutely wild like borrow an insane amount of money for bad acquisitions. Given their long standing track record and having to answer to shareholders after a rough quarter, I doubt they would do it.\n\nThey stated in their report that they hold 256 billion for retail customers. 10 billion of that actually shows up as a liability on their balance sheet. I imagine those are the custody customers that would be further ahead in line than the retail folks.  Can someone also give some insight on this ?  Even if the company had more liabilities than assets, and had to draw  from the 256b in retail holdings during a bankruptcy event… wouldn’t they only be able to take a small fraction of that as 256b far exceeds their total value as a company ??",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8agqho",
                    "author": "GumbleBumble2",
                    "score": 2,
                    "created_utc": 1652339539.0,
                    "response": "Yup, that’ll make the market fucking DUMP",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i86g6fj",
                    "author": "Manateeboi",
                    "score": 5,
                    "created_utc": 1652273956.0,
                    "response": "Well shit,. Is it possible to unstake my eth?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i86kukx",
                            "author": "27thStreet",
                            "score": 7,
                            "created_utc": 1652276082.0,
                            "response": "No, and you likely knew that when you staked withy CB.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i86rnxu",
                                    "author": "gingerballs45",
                                    "score": 1,
                                    "created_utc": 1652278967.0,
                                    "response": "Doesn’t matter if they staked with CB or not. CB is not controlling the ability for you to remove your ETH from the locked merge contract. There is literally no way to unstake until the merge is completed.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i86r9d8",
                                    "author": "satinkzo",
                                    "score": 2,
                                    "created_utc": 1652278804.0,
                                    "response": "Well they did state they'd allow trading and never did.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i87apge",
                                            "author": "27thStreet",
                                            "score": 2,
                                            "created_utc": 1652286460.0,
                                            "response": "Yet...and to my knowledge they never claimed that they *definitely* would allow trading before the merge.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i87eo19",
                                                    "author": "satinkzo",
                                                    "score": 0,
                                                    "created_utc": 1652287978.0,
                                                    "response": "They did initially then changed the verbiage after the first few rounds of people opted in.\n\nDon't you remember when they changed the unlock period verbiage\n\nhttps://www.fool.com/investing/2021/12/29/is-coinbase-moving-the-goalposts-on-your-staked-et/",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i88fj86",
                                            "author": "ZirJohn",
                                            "score": 1,
                                            "created_utc": 1652302424.0,
                                            "response": "Yeah sometime after the merge is complete and they can recover the stake, which it's not.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i88h136",
                                                    "author": "satinkzo",
                                                    "score": 1,
                                                    "created_utc": 1652303014.0,
                                                    "response": "That is not what they originally said.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i86f04j",
                    "author": "JPC1001",
                    "score": 2,
                    "created_utc": 1652273395.0,
                    "response": "Would this also include Coinbase Pro?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i86fm4l",
                            "author": "bluetidepro",
                            "score": 3,
                            "created_utc": 1652273688.0,
                            "response": "It would, yeah.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8bd85s",
                            "author": "Additional-Cap-7110",
                            "score": 1,
                            "created_utc": 1652362063.0,
                            "response": "they’re the same I don’t know why they even separate them like they do",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i86i3xr",
                    "author": "Euphoriffic",
                    "score": 3,
                    "created_utc": 1652274848.0,
                    "response": "Scary as fuck.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i876wpl",
                            "author": "vernes1978",
                            "score": 4,
                            "created_utc": 1652284984.0,
                            "response": "If that gets your bladder weak, google \"False Vacuum\".",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8733qf",
                    "author": "CreativeHold7",
                    "score": 4,
                    "created_utc": 1652283507.0,
                    "response": "Saw this coming from a mile away. Speculative but it has all the signs…. They’ve been cooking the books and robbing users under the guise of wallets being hacked for over a year. Currently on the stash the cash plan. It’s obvious when only their users wallets get “hacked” and no other exchanges do. Enjoy the life of looking over your shoulder until the lawyers cometh.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i87ivxa",
                            "author": "-xstatic-",
                            "score": 1,
                            "created_utc": 1652289610.0,
                            "response": "They also skim off the top of transactions and force you to leave .00001 of whatever crypto you’re trying to move",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i86jsku",
                    "author": "RTGold",
                    "score": 2,
                    "created_utc": 1652275607.0,
                    "response": "Please read this comment. https://reddit.com/r/Bitcoin/comments/umujej/_/i84o1u1/?context=1",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i873nqo",
                    "author": "IKnowPancakes",
                    "score": 2,
                    "created_utc": 1652283723.0,
                    "response": "Time to get your coins have exchanges people!\nI'll be doing my last moves today, that's for sure. I don't fully understand how CB could go bankrupt considering they're making money off of every transaction.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8775eu",
                    "author": "MrMike0029",
                    "score": 2,
                    "created_utc": 1652285078.0,
                    "response": "The fact users accounts getting hacked, then using their bank info to purchase coin, and then take them immediately off CB, coupled with most of these users doing charge backs on the fraud charges, means CB is losing crypto without being compensated for it. If these hacks keep happening (they are based on this sub), then there is no way CB can remain solvent forever. Good luck to all, stay safe out there, and GET YOUR COINS OFF CB & REMOVE YOUR BANK INFO!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i893u23",
                            "author": "satchseven",
                            "score": 1,
                            "created_utc": 1652312974.0,
                            "response": "Inside job if all that shit going on",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i86dtxv",
                    "author": "Iamthemaster1000",
                    "score": -1,
                    "created_utc": 1652272828.0,
                    "response": "My Coinbase days are over. For them to mention a bad quarter, bankruptcy and user funds all in the same conversation, no way am I sending my money on the debit card to have it get stuck and maybe wiped out. Maybe I'm too cautious but wasn't a fan of Coinbase anyways \n\nI have most of my coins in a hot wallet so I at least have the keys. Cold wallet would be even better",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i86ir1x",
                            "author": "TimonLeague",
                            "score": 9,
                            "created_utc": 1652275138.0,
                            "response": "You do understand publicly traded companies are required to do what coinbase did right? Id still take my coins off exchanges but coinbase isnt going bankrupt anytime soon",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i87ctpf",
                                    "author": "meshreplacer",
                                    "score": 1,
                                    "created_utc": 1652287269.0,
                                    "response": "Yeah but other folks offer SIPC and FDIC. No way would I put my savings in a money losing company that could abscond with every dime you worked for in a flash because something went wrong and you are an unsecured creditor.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i87djng",
                                            "author": "TimonLeague",
                                            "score": 1,
                                            "created_utc": 1652287546.0,
                                            "response": "I literally said take your coins off exchanges its not like any crypto exchanges are insured",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i86em0y",
                            "author": "TheKlincher",
                            "score": 2,
                            "created_utc": 1652273208.0,
                            "response": "The last one is it.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i87bz0q",
                    "author": "meshreplacer",
                    "score": 1,
                    "created_utc": 1652286942.0,
                    "response": "The warnings are there. Advice not your bitcoin if it’s in coinbase. The smart thing is to take it offline before you lose it all during a bank run etc.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i86i8lp",
                    "author": "Infinite_North6745",
                    "score": -1,
                    "created_utc": 1652274907.0,
                    "response": "Coinbase is a sham company",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i86dfbq",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1652272632.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i86r1tc",
                    "author": "1HappyGuy1",
                    "score": 1,
                    "created_utc": 1652278719.0,
                    "response": "Why can’t I buy on Coinbase?  They don’t want my money?  Ridiculous “connection issues”.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i87e3w2",
                    "author": "Tall_Run_2814",
                    "score": 1,
                    "created_utc": 1652287763.0,
                    "response": "Prices rise, prices fall, Coinbase makes money off every trade regardless.  They'll be just fine. \n\nWouldn't leave my portfolio sitting on the exchange however.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i885pre",
                    "author": "Free-Speech-101",
                    "score": 1,
                    "created_utc": 1652298559.0,
                    "response": "How can they be heading for bankruptcy? I'm glad I moved all my coins away from them a year ago... I'm using Kraken ... hopefully they aren't as reckless",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i86jxne",
                    "author": "Prospector4life",
                    "score": -1,
                    "created_utc": 1652275670.0,
                    "response": "They make money on every transaction and have much less overhead then most companies. HOW IS THIS POSSIBLE? THIS COMPANY IS AND WAS A TOTAL SCAM",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i873z2f",
                    "author": "Ok_Cauliflower_1350",
                    "score": 0,
                    "created_utc": 1652283847.0,
                    "response": "COINBASE = BERNIE MADOFF!!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i86mg97",
                    "author": "at598",
                    "score": 1,
                    "created_utc": 1652276785.0,
                    "response": "Is it safe to transfer from CB to Metamask?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i86sjpq",
                            "author": "gingerballs45",
                            "score": 2,
                            "created_utc": 1652279326.0,
                            "response": "If your funds are in CB wallet, that would be a waste of a gas fee, just import your phrase into MetaMask.\n\nIf your shit is on CB.com, yes it is safu",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i86xh8b",
                                    "author": "at598",
                                    "score": 1,
                                    "created_utc": 1652281298.0,
                                    "response": "Thanks",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i86u8et",
                    "author": "Connect-Ad-1088",
                    "score": 1,
                    "created_utc": 1652280006.0,
                    "response": "got a hardware wallet?  might want to use it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i86vxgq",
                    "author": "mtksurfer",
                    "score": 1,
                    "created_utc": 1652280681.0,
                    "response": "glad I have my loop wallet",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i871gbi",
                    "author": "Feeling_Ad7249",
                    "score": 1,
                    "created_utc": 1652282863.0,
                    "response": "Should I cash out my crypto. I have everything on here and I’m negative big time",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i87473f",
                            "author": "L3artes",
                            "score": 3,
                            "created_utc": 1652283933.0,
                            "response": "Why would you cash out when it is down? Do you need the money urgently?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i877hba",
                                    "author": "Feeling_Ad7249",
                                    "score": 2,
                                    "created_utc": 1652285208.0,
                                    "response": "Nope. Will keep it. Currently holding XYO and Jasmy.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i87uqsq",
                                            "author": "asstyrant",
                                            "score": 2,
                                            "created_utc": 1652294267.0,
                                            "response": "> Currently holding XYO and Jasmy.\n\nWoof.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i8bgd2e",
                                            "author": "Additional-Cap-7110",
                                            "score": 1,
                                            "created_utc": 1652363453.0,
                                            "response": "Oof",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i88fy0f",
                            "author": "ZirJohn",
                            "score": 1,
                            "created_utc": 1652302588.0,
                            "response": "Its fine, stop panicking. Title of this is clickbait and has been known.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i87bpat",
                    "author": "malx4eva",
                    "score": 1,
                    "created_utc": 1652286837.0,
                    "response": "Good thing my shit is valued at like 40% below what I got it for so no sweat off my back",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8bghd7",
                            "author": "Additional-Cap-7110",
                            "score": 1,
                            "created_utc": 1652363503.0,
                            "response": "Depends on how much you had to begin with. 40% down from 100k is still a lot of money",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i87igt8",
                    "author": "-xstatic-",
                    "score": 1,
                    "created_utc": 1652289450.0,
                    "response": "They skim off the top of peoples transactions and they still can’t make any money?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i87jtx9",
                    "author": "olms1988",
                    "score": 1,
                    "created_utc": 1652289977.0,
                    "response": "What is the best private wallet people reccomend? My stuff is on coinbase and I have never used a wallet.  Im ok with dealing with a crypto winter for a long time but now being aware if coinbase goes belly up and they can just take my funds I'd like to move them to a safe wallet.  Now that coinbase has a wallet is that one safe incase coinbase goes belly up? Or should I be looking for a 3rd party wallet?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i87juyc",
                    "author": "Goach_84",
                    "score": 1,
                    "created_utc": 1652289988.0,
                    "response": "There is the phrase BE YOUR OWN BANK if you know then you know why this is being mentioned.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i87kjlr",
                    "author": "psc454",
                    "score": 1,
                    "created_utc": 1652290250.0,
                    "response": "investors were surprised to discover a bankruptcy disclosure statement in the report. It states customers could be treated as unsecured creditors, meaning they may not get their funds back should the firm go bust.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i87kmr2",
                    "author": "arbzbarbz",
                    "score": 1,
                    "created_utc": 1652290285.0,
                    "response": "Yeah the whole market is struggling....and will do for a while\n\nhttps://youtu.be/HN-H47QiVQ8",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i87o3u6",
                    "author": "myballsareitchy",
                    "score": 1,
                    "created_utc": 1652291633.0,
                    "response": "Do you pay gas fees to remove ETH from Coinbase pro?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i87qilm",
                    "author": "Kendallious",
                    "score": 1,
                    "created_utc": 1652292590.0,
                    "response": "Would this affect you if you had everything stored in Coinbase wallet?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i87t4he",
                    "author": "artemistica",
                    "score": 1,
                    "created_utc": 1652293622.0,
                    "response": "\"In comments shared on Twitter, Coinbase CEO and founder Brian Armstrong said  \n the exchange had “no risk of bankruptcy,” and that the disclosure was   \nmade due to new rules set by the U.S. Securities and Exchange Commission  \n regarding public companies that hold crypto assets on behalf of others.\"  \n\n\nThis is as others have pointed out, just a required legal notification not a warning of some imminent bankruptcy event.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i87tdpc",
                    "author": "pbDudley",
                    "score": 1,
                    "created_utc": 1652293727.0,
                    "response": "What’s the best crypto cold storage wallet?  I was just going to buy the ledger nano x. It’s gotta be good enough?  If the nano x breaks your coins are still safe right?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i87vvdr",
                    "author": "Stevesd123",
                    "score": 1,
                    "created_utc": 1652294718.0,
                    "response": "Is my coin safe in the separate coinbase wallet app?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i89jacs",
                            "author": "n0nati0n",
                            "score": 1,
                            "created_utc": 1652319948.0,
                            "response": "Yes, that’s the general advantage of self custody wallets. Hardware wallets being the even more secure alternative.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i881cyr",
                    "author": "Photo_Awkward",
                    "score": 1,
                    "created_utc": 1652296887.0,
                    "response": "Armstrong can sell his mansion to ensure that CB stays alive.\nAlso no more expensive ad and focus on providing amazing products/services and outstanding customer service. Here's an idea, create an easy to use friendly app that can accept and send payments in crypto (I mean for millions of people to use)",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8bgmly",
                            "author": "Additional-Cap-7110",
                            "score": 2,
                            "created_utc": 1652363566.0,
                            "response": "Not sure his mansion would be enough plus probably protected from such things",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8bgycc",
                                    "author": "Photo_Awkward",
                                    "score": 1,
                                    "created_utc": 1652363706.0,
                                    "response": "Then he doesn't believe in his company? 😂",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8h0ip0",
                                            "author": "Additional-Cap-7110",
                                            "score": 1,
                                            "created_utc": 1652460797.0,
                                            "response": "It’s quite normal that your personal assets aren’t included in a companies assets",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i95cib0",
                                                    "author": "Photo_Awkward",
                                                    "score": 1,
                                                    "created_utc": 1652923260.0,
                                                    "response": "But his personal assets was purchased through corporate means 😂",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8840lk",
                    "author": "pc_bs_420",
                    "score": 1,
                    "created_utc": 1652297911.0,
                    "response": "Lmao",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i88azj7",
                    "author": "ryankindsethart",
                    "score": 1,
                    "created_utc": 1652300623.0,
                    "response": "As someone who has worked for a company that filed Ch.11 bankruptcy and saw what happens to their debts alongside everyone’s equity…this doesn’t shock me.\n\nBut still you have some serious shit to figure out coinbase if you’d like to make this work. Let’s start with a customer support line that you bring in-house or fucking outsource if you have to.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i88gkie",
                    "author": "Joshua1879",
                    "score": 1,
                    "created_utc": 1652302833.0,
                    "response": "How we’re all those private jet trips using the investor’s money?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i88h3jf",
                    "author": "Verax86",
                    "score": 1,
                    "created_utc": 1652303041.0,
                    "response": "LOL I’m glad coinbase banned me now.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i88hfmi",
                    "author": "Verax86",
                    "score": 1,
                    "created_utc": 1652303175.0,
                    "response": "I can’t believe people still use coinbase. They’re the worst exchange ever.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i88j789",
                    "author": "HACH-P",
                    "score": 1,
                    "created_utc": 1652303876.0,
                    "response": "Glad I haven't been able to connect any cards/accounts for 2 years then.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i88o262",
                    "author": "jdg401",
                    "score": 1,
                    "created_utc": 1652305872.0,
                    "response": "But but but, crypto doesn’t need regulation…",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i88ow63",
                    "author": "Bigwiggs3214",
                    "score": 1,
                    "created_utc": 1652306225.0,
                    "response": "I would imagine a company that deals in such a volatile business would not just sink because of a bear market. \n\nGo ahead and share all fud and let crypto fall even farther. \n\nCrypto is inevitable. I'll be buying the dip(s).",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i88sugh",
                    "author": "pikachu5actual",
                    "score": 1,
                    "created_utc": 1652307928.0,
                    "response": "What happens to the eth2 that is currently being staked when they go bankrupt?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i88ve24",
                    "author": "fsbacon33",
                    "score": 1,
                    "created_utc": 1652309055.0,
                    "response": "I've warned people about Coinbase for over a year now.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i88zr97",
                    "author": "nerdtard1515",
                    "score": 1,
                    "created_utc": 1652311028.0,
                    "response": "What woukd happen to coinbase wallet? Will still work?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i88zz6v",
                    "author": "noquarter53",
                    "score": 1,
                    "created_utc": 1652311145.0,
                    "response": "I don't understand how they aren't still making tons of money in this environment.  They make money on fees, no? All of the selling should be generating the same fees.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8967xa",
                    "author": "obervant1",
                    "score": 1,
                    "created_utc": 1652314092.0,
                    "response": "$COIN  account holders. GET YOUR ASSETS OUT OF COINBASE AS  THE CUSTODIAN. Read the other posts. Crypto is not treated like a normal security in the mind of the bankruptcy courts when it comes to custody. If they $COIN files for bankruptcy, your custodial assets are considered Coinbase assets. In that case, YOU LOSE YOUR CRYPTO because crypto in custody at $COIN is an asset of $COIN held in your name. Do the DD. Speak to a lawyer. In the end protect your money.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i896sao",
                    "author": "WideCoconut2230",
                    "score": 1,
                    "created_utc": 1652314357.0,
                    "response": "This would be worse than Mt Gox. Wasn't your crypto supposed to be yours? It would be the end of crypto and all future crypto trading platforms.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i89axp2",
                    "author": "LeastDiet838",
                    "score": 1,
                    "created_utc": 1652316260.0,
                    "response": "Transferring my Crypto to a hardware wallet tomorrow.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i89d2cc",
                    "author": "TheMcDizzle",
                    "score": 1,
                    "created_utc": 1652317219.0,
                    "response": "Maybe it’s time to stop spending tons of dough getting their logo on NBA courts during the playoffs.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i89fltd",
                    "author": "Sweet-Jellyfish-8428",
                    "score": 1,
                    "created_utc": 1652318371.0,
                    "response": "So I have everything in Coinbase pro and I’m down a horrible amount of money.\nWhat other wallet could I get that’s safer? And would I just do a transfer and still have the same amount of coins?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8auccq",
                            "author": "thisonelife83",
                            "score": 1,
                            "created_utc": 1652351232.0,
                            "response": "Your money is safe, this is all FUD.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i89gvmy",
                    "author": "West_Annual3022",
                    "score": 1,
                    "created_utc": 1652318927.0,
                    "response": "This is getting blown out of proportion, its because we are in a bear market and wall street does not want Crypto to be independent of the market, which is why the institutions are holding the most crypto and will doing everything to create fud and short crypto",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i89ikbm",
                    "author": "indian1234",
                    "score": 1,
                    "created_utc": 1652319650.0,
                    "response": "Took all my funds into cash today. Fuck coinbase. Even saying that could tank all crypto assets. What a fucking tool.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i89v1jt",
                    "author": "TedRaskunsky",
                    "score": 1,
                    "created_utc": 1652325518.0,
                    "response": "Safe to say that super bowl commercial didn’t pay off. It was a great commercial though.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ab83o",
                    "author": "Heyitsakexx",
                    "score": 1,
                    "created_utc": 1652335319.0,
                    "response": "Can this effect Coinbase wallet",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8acg2g",
                    "author": "read_again2",
                    "score": 1,
                    "created_utc": 1652336212.0,
                    "response": "I knew that Hitbtc would be the best choice. This is more proof of that.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8atv96",
                    "author": "thisonelife83",
                    "score": 1,
                    "created_utc": 1652350859.0,
                    "response": "COIN mints $money. These are FUD articles to drive down the price. No chance COIN goes bankrupt anytime soon. I’ve seen the fees and spreads.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8dhecm",
                    "author": "Leading-Solid5322",
                    "score": 1,
                    "created_utc": 1652392434.0,
                    "response": "am afraid of what is writting here that coinbase is bankrup and can wipe out users funds am totaly afraid",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8fqnvc",
                    "author": "AlChapoDiamonds",
                    "score": 1,
                    "created_utc": 1652439887.0,
                    "response": "Fix the top movers! #RNDR is going to make the metaverse scalable and it not being shown.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8v2e18",
                    "author": "Rollec",
                    "score": 1,
                    "created_utc": 1652732031.0,
                    "response": "So will they let you unlock your ETH2 so you can move it out of CB?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8vaxff",
                            "author": "coinbasesupport",
                            "score": 1,
                            "created_utc": 1652735525.0,
                            "response": "Hi u/Rollec, we truly wish that this was something that was possible, but due to the functionality of the smart contract that the funds are deposited into, we cannot withdraw any funds from the ETH staking pool.\n\nYou may read more about this here: https://help.coinbase.com/en/coinbase/trading-and-funding/staking-rewards/eth-2-0-staking\n\nWhen the ETH2 upgrade is complete and withdrawals are enabled by the Ethereum network, you’ll be able to send or sell your staked ETH along with all rewards you’ve earned.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "un9s9l",
            "title": "Guys any issue with coin base not allowing to use cash already deposited to make a purchase?",
            "url": "https://www.reddit.com/r/CoinBase/comments/un9s9l/guys_any_issue_with_coin_base_not_allowing_to_use/",
            "author": "Confident_Fly_2565",
            "created_utc": 1652275499.0,
            "score": 9,
            "num_comments": 59,
            "subreddit": "CoinBase",
            "selftext": "My bad, My transfer is pending, that's why I can't purchase, it says it's available but somewhere else it says my transfer to coinbase is still pending. I don't know but this site app is not as intuitive as it should be.",
            "stickied": false,
            "comments": [
                {
                    "id": "i87347x",
                    "author": "orindragonfly",
                    "score": 3,
                    "created_utc": 1652283512.0,
                    "response": "Not that but it’s asking me for a ID to send my ALGOS I just bought never did this before Guess I will have to drop them and go to Binance",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i877jy6",
                            "author": "Stock-Marzipan4155",
                            "score": 1,
                            "created_utc": 1652285236.0,
                            "response": "Same here. After using them for 5 years I needed to upload an ID again. I’m out",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i877umm",
                                    "author": "orindragonfly",
                                    "score": 0,
                                    "created_utc": 1652285353.0,
                                    "response": "Yeah that’s the straw that broke the camels back",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i86kz51",
                    "author": "_lucid_dream",
                    "score": 1,
                    "created_utc": 1652276138.0,
                    "response": "I can’t make any purchases",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i87jmrc",
                            "author": "Glock19LabRat",
                            "score": 1,
                            "created_utc": 1652289899.0,
                            "response": "Same",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i87zxqs",
                            "author": "thecrabmonster",
                            "score": 1,
                            "created_utc": 1652296326.0,
                            "response": "I cannot either.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8bmwgy",
                            "author": "BlGJOSH",
                            "score": 1,
                            "created_utc": 1652366132.0,
                            "response": "I can’t either, the f’n market crashed at COINBASE won’t let me buy anything… can’t wait for my ETH to come off stake so I can move it to a different wallet!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i86mcd7",
                    "author": "Confident_Fly_2565",
                    "score": 1,
                    "created_utc": 1652276738.0,
                    "response": "I wanted to buy too... Now what can I do with the cash I have there? I tried to cash out and it says \"Something went wrong\"",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i86oim4",
                    "author": "Parking_Goal7853",
                    "score": 1,
                    "created_utc": 1652277659.0,
                    "response": "Can’t buy",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i86qxar",
                            "author": "_lucid_dream",
                            "score": 1,
                            "created_utc": 1652278668.0,
                            "response": "I can now, go figure now that bitcoin is back above 29k",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i86raiy",
                                    "author": "1HappyGuy1",
                                    "score": 1,
                                    "created_utc": 1652278817.0,
                                    "response": "Yeah I was going to get more AVAX at 30 dollars then magically Coinbase gets “connection issues”.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i86rl1w",
                                            "author": "omgwhatsavailable",
                                            "score": 1,
                                            "created_utc": 1652278934.0,
                                            "response": "A tale as old as time",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i86vf6c",
                                                    "author": "1HappyGuy1",
                                                    "score": 2,
                                                    "created_utc": 1652280479.0,
                                                    "response": "Yeah, it went up to 35.  Still can’t buy 😔",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i86wbmq",
                                    "author": "Parking_Goal7853",
                                    "score": 0,
                                    "created_utc": 1652280840.0,
                                    "response": "I deposited 5k to buy the dip. Coinbase took my deposit but wouldn’t let me buy. Now they take their finger off the stop button once everything starts going back up.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8801ne",
                                            "author": "thecrabmonster",
                                            "score": 1,
                                            "created_utc": 1652296370.0,
                                            "response": "Same here and they disabled my account",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i87jn4k",
                            "author": "Glock19LabRat",
                            "score": 1,
                            "created_utc": 1652289904.0,
                            "response": "Same",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i86qdil",
                    "author": "thecrabmonster",
                    "score": 1,
                    "created_utc": 1652278441.0,
                    "response": "They disabled my account because they say a deposit did not go through.  Wrong. Never a problem until this event. I believe they are disabling a lot of accounts.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i86vjhr",
                            "author": "1HappyGuy1",
                            "score": 0,
                            "created_utc": 1652280526.0,
                            "response": "Yeah, I think they are doing this to mine.  I have invested a lot of money into them, should have moved my assets to a wallet sooner.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i874d7u",
                    "author": "orindragonfly",
                    "score": 1,
                    "created_utc": 1652283999.0,
                    "response": "Coinbase needs a class action against them",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i86lpuh",
                    "author": "Gardening_Shirt",
                    "score": 0,
                    "created_utc": 1652276467.0,
                    "response": "Same. Account unlinked. Unable to link via routing number and account to verify.  Unable to whore out my data to plaid in exchange to connect. Can't buy.\n\nI want to buy.  I've been with Coinbase for years.  Really making a case to have your stock drop even further.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i86voxj",
                            "author": "1HappyGuy1",
                            "score": 1,
                            "created_utc": 1652280586.0,
                            "response": "Bro this is happening to me too, I can’t buy 😢",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8bn4jd",
                                    "author": "BlGJOSH",
                                    "score": 1,
                                    "created_utc": 1652366220.0,
                                    "response": "I can’t buy either, stupid ass shit!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i86jk7w",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1652275501.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i883fo6",
                    "author": "Dear_End5797",
                    "score": 1,
                    "created_utc": 1652297683.0,
                    "response": "Yes they have been having problems , took them several days to unlock my account because they said my ach deposit failed (it did not)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8kztwr",
                    "author": "dgidyi",
                    "score": 1,
                    "created_utc": 1652540391.0,
                    "response": "🧬 @Foreverise_BSC - revolutionary watch-to-earn protocol allowing holders to earn up to 298 USDT per month\n\n💰 Main utility is \"Forever Earn\" platform on for Android / iOS through which you can watch ads and earn USDT\n\n⭐️Pinksale Presale Live #foreverise \nhttps://www.pinksale.finance/#/launchpad/0xa756324759Ac9a1097b875484596Db815f8fE1Df?chain=BSC",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9oa4pr",
                    "author": "terinitat",
                    "score": 1,
                    "created_utc": 1653307590.0,
                    "response": "WOW Doge private sale will be live  Today, 2pm UTC.\n✅Hard cap: 100bnb \n✅Soft cap: 50bnb\n✅Min buy: 0.2bnb\n✅Max buy: 2bnb \n✅ Free NFT for private sales buyers.\nTwitter: https://twitter.com/Wow_Dodge\nTg: http://t.me/wowdogetoken\n#BSC #NFTs #BSCgem.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i86m8j2",
                    "author": "_lucid_dream",
                    "score": -2,
                    "created_utc": 1652276692.0,
                    "response": "Coinbase sucks, wish Strike would up their weekly limit from $1000",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "un13pg",
            "title": "Coinbase Customer Support is the worst ever.",
            "url": "https://www.reddit.com/r/CoinBase/comments/un13pg/coinbase_customer_support_is_the_worst_ever/",
            "author": "Kezotron",
            "created_utc": 1652242139.0,
            "score": 10,
            "num_comments": 36,
            "subreddit": "CoinBase",
            "selftext": "If you reach customer support in the Philippines, hang up and keep dialing until you reach someone in the US.  There are really good customer support people in the Philippines.   Coinbase does not hire them.   The people on the phone in the Philippines lie to you, put you on hold for no reason for long periods of time and laugh at you,  It is frustrating not being able to access your funds.   When customer support finds that amusing it is a total nightmare.",
            "stickied": false,
            "comments": [
                {
                    "id": "i86165g",
                    "author": "coinbasesupport",
                    "score": 1,
                    "created_utc": 1652265251.0,
                    "response": "Hi u/Kezotron, thanks for getting in touch.   \n   \nWe're happy to help you with this. If you reach out to our team here: https://help.coinbase.com/en/contact-us they will look into this as soon as possible. This will also create a case and a case number.  \n   \nWhen you have a case number, feel free to get back to us here with it, so we can look into this further for you.  \n   \nThank you!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i857vvk",
                    "author": "Kiwip0rn",
                    "score": 2,
                    "created_utc": 1652242872.0,
                    "response": "7th low Karma complainer today... yeah... 🙄",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i859gb5",
                            "author": "FinasterideJizzum",
                            "score": 1,
                            "created_utc": 1652243784.0,
                            "response": "low karma doesnt mean people aren't having a bad time. im glad i haven't had to contact them, i know customer support can be a real pita on both ends.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i85ost7",
                    "author": "pacoelflaco21",
                    "score": 1,
                    "created_utc": 1652254765.0,
                    "response": "My account has been restricted during months, I am completely desperate. Hire a lawyer, it seems is the only thing that works",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i877sjv",
                    "author": "hasan995",
                    "score": 1,
                    "created_utc": 1652285331.0,
                    "response": "Happened to me a year ago. Posted on here and got a response after months . Good luck",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8l03fy",
                    "author": "dgidyi",
                    "score": 1,
                    "created_utc": 1652540512.0,
                    "response": "🧬 @Foreverise_BSC - revolutionary watch-to-earn protocol allowing holders to earn up to 298 USDT per month\n\n💰 Main utility is \"Forever Earn\" platform on for Android / iOS through which you can watch ads and earn USDT\n\n⭐️Pinksale Presale Live #foreverise \nhttps://www.pinksale.finance/#/launchpad/0xa756324759Ac9a1097b875484596Db815f8fE1Df?chain=BSC",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8xgdon",
                    "author": "choxgjufz",
                    "score": 1,
                    "created_utc": 1652782413.0,
                    "response": "💋Sex2earn💋\n\n🚀Fair Launch on Thursday 3PM UTC\n🔞Live strip show by Ashley before launch\n👄Sex2earn- Blockchain Amateur Porn Platform by $SEX token\n✅Upload ur video for free & get paid in $SEX\n✅Watch ur favorite videos\n✅KYC Audit\n\n#crypto #BSC #BNB\nTG & TW: @Sex2Earn",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ob5p0",
                    "author": "terinitat",
                    "score": 1,
                    "created_utc": 1653308234.0,
                    "response": "WOW Doge private sale will be live  Today, 2pm UTC.\n✅Hard cap: 100bnb \n✅Soft cap: 50bnb\n✅Min buy: 0.2bnb\n✅Max buy: 2bnb \n✅ Free NFT for private sales buyers.\nTwitter: https://twitter.com/Wow_Dodge\nTg: http://t.me/wowdogetoken\n#BSC #NFTs #BSCgem.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i856k5z",
                    "author": "AutoModerator",
                    "score": 0,
                    "created_utc": 1652242139.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "umzi04",
            "title": "what does usdc use?",
            "url": "https://www.reddit.com/r/CoinBase/comments/umzi04/what_does_usdc_use/",
            "author": "halo9909",
            "created_utc": 1652236712.0,
            "score": 4,
            "num_comments": 36,
            "subreddit": "CoinBase",
            "selftext": "trying to send out but my receiving said asks if it uses eth or polygon chain and i can’t see any info on coinbase to choose which one",
            "stickied": false,
            "comments": [
                {
                    "id": "i84wjkj",
                    "author": "Tall_Run_2814",
                    "score": 8,
                    "created_utc": 1652237076.0,
                    "response": "Ethereum",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i84vre5",
                    "author": "AutoModerator",
                    "score": 2,
                    "created_utc": 1652236712.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i854afh",
                    "author": "Kiwip0rn",
                    "score": 1,
                    "created_utc": 1652240928.0,
                    "response": "Ethereum only.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8l06af",
                    "author": "dgidyi",
                    "score": 1,
                    "created_utc": 1652540549.0,
                    "response": "🧬 @Foreverise_BSC - revolutionary watch-to-earn protocol allowing holders to earn up to 298 USDT per month\n\n💰 Main utility is \"Forever Earn\" platform on for Android / iOS through which you can watch ads and earn USDT\n\n⭐️Pinksale Presale Live #foreverise \nhttps://www.pinksale.finance/#/launchpad/0xa756324759Ac9a1097b875484596Db815f8fE1Df?chain=BSC",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ob681",
                    "author": "terinitat",
                    "score": 1,
                    "created_utc": 1653308243.0,
                    "response": "WOW Doge private sale will be live  Today, 2pm UTC.\n✅Hard cap: 100bnb \n✅Soft cap: 50bnb\n✅Min buy: 0.2bnb\n✅Max buy: 2bnb \n✅ Free NFT for private sales buyers.\nTwitter: https://twitter.com/Wow_Dodge\nTg: http://t.me/wowdogetoken\n#BSC #NFTs #BSCgem.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i84wd6z",
                    "author": "Rey_Mezcalero",
                    "score": -2,
                    "created_utc": 1652236993.0,
                    "response": "Would say mainnet.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i84w9np",
                    "author": "SmoothlyFaraway",
                    "score": 0,
                    "created_utc": 1652236946.0,
                    "response": "What error message are you getting?",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}