{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "us2kz6",
            "title": "What’s the deal? How come coinbase is asking to see my id again? This is like 3 times in less then a year not including when they ask to see id for the learn to earns. Do they not know who I am yet? My info hasn’t changed and I’m on the site regularly. Am I missing something?",
            "url": "https://www.reddit.com/r/CoinBase/comments/us2kz6/whats_the_deal_how_come_coinbase_is_asking_to_see/",
            "author": "CryptoRednecks",
            "created_utc": 1652840526.0,
            "score": 1,
            "num_comments": 6,
            "subreddit": "CoinBase",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i91241h",
                    "author": "tjkrtjkr",
                    "score": 2,
                    "created_utc": 1652842400.0,
                    "response": "I'm not sure, Coinbase can fuck off though.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i90yaqf",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1652840526.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i910evw",
                            "author": "CryptoRednecks",
                            "score": 0,
                            "created_utc": 1652841559.0,
                            "response": "Lol thank you kindly for the reminder but I didn’t give any personal info nor do I plan to. It’s not a case its a question. And I would never contact coinbase support as I know better for if there’s an actual issue I’m better off taking an L and trying my luck on a different site instead of going through that headache. As for trusting coinbase staff only… I don’t even trust my own mother why would I ever trust coinbase staff that’s like telling me to trust the dealer at the casino lol next ill be trusting the used car salesman lol but thank you anyway I needed a good laugh. I hope you have a wonderful day and keep up the good work 😊👍",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i919j2e",
                                    "author": "gslice",
                                    "score": 1,
                                    "created_utc": 1652846395.0,
                                    "response": "You’re talking to a bot …",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i915ja0",
                    "author": "FlipnHodl",
                    "score": 1,
                    "created_utc": 1652844159.0,
                    "response": "That never bothers me so long as some jackass doesn’t drain my account some day without CB asking for the ID. Then I’d be pissed.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i916bmm",
                            "author": "CryptoRednecks",
                            "score": 1,
                            "created_utc": 1652844580.0,
                            "response": "Yeah it doesn’t really bother me as much as I just don’t really see the point. A hacker isn’t going to need my id and irs was already told exactly who i am the moment I first signed up and I haven’t been inactive for a long period of time I’m fairly certain they have the ability to verify my phone id and current location and facial scan to even open the site so why the id on top of everything else? Just seems pointless and redundant.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}