{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uwzkam",
            "title": "Mysteriously frozen accounts? Can't cash out? Here's why, and what to do.",
            "url": "https://www.reddit.com/r/CoinBase/comments/uwzkam/mysteriously_frozen_accounts_cant_cash_out_heres/",
            "author": "-George---",
            "created_utc": 1653422393.0,
            "score": 110,
            "num_comments": 65,
            "subreddit": "CoinBase",
            "selftext": "Read this while you can before it gets taken down.\n\nFirst: don't panic. This is S.O.P. for all the big centralized exchanges. Coinbase, it seems, has done a worse job than others this downturn, and has seemingly learned nothing from past cycles.\n\nYes, you should be outraged. Yes, Coinbase (and Kraken and Binance) should be dragged in front of Congress. Yes, they will deserve the inevitable regulation they are going to get. (That we'll bear the burden of.)\n\nThe root of all of the nasty problems and support fubars showing up on this sub, are a result of one thing:\n\n# Not enough liquidity\n\nThat's it. But instead of Coinbase just publicly owning up to that (which to be fair would make it worse for everyone), we see things like:\n\n- Mysterious \"error messages\" when trying to cash out to bank, or move assets to a real blockchain address\n- Accounts mysteriously locked for no explainable reason - can't get in to own account\n- Accounts mysteriously *closed* for no explainable reason\n- KYC demanded for no explainable reason\n- KYC provided never seems to be \"good enough\" to unlock accounts\n- Unresponsive support\n- Suspiciously \"inept\" support that can't even answer basic questions\n- Bank account unlinked for no explainable reason, can't re-link\n\nThese problems seem hit \"mid-tier\" accounts the most - about $10k to $100k in total value. (Then trickle-down to lower-tier accounts as liquidity problems get worse.)\n\nWhy? Because freezing those accounts first provide the biggest bandaid agianst liquidity drain, with the fewest grumpy customers - with hopefully lower odds of hitting customers that have unlimited lawyers on standby, and millions of Twitter followers.\n\nKeep in mind, that all your \"balances\" that show up on Coinbase are just numbers in a database. IOUs, if you will. With the money you give them, they put *your* money to work for *them*. Using it to front-run your own orders, etc. Much like banks and brokerages do. But as soon as you try to cash out to your bank, or send crypto to a real external blockchain address, the money becomes \"real\" and they have to cough it up.\n\nAgain, this is not unique to Coinbase. Kraken and Binance do it too. Coinbase has just been worse about it, this particular cycle.\n\nThe solution? I don't have a magic bullet, only suggestions:\n\n1. Be patient. You'll get your money eventually.\n    1. Coinbase won't go bankrupt anytime soon.\n    1. Even if they get close, they'll be an incredibly attractive buyout target.\n1. **Be courteous, professional, and non-threatening**.\n    1. Don't give them a single excuse to hold your money hostage, because they are looking for one.\n1. Submit claims or reports to:\n    1. The [FTC](Https://reportfraud.ftc.gov/)\n    1. The [CFTC](https://forms.cftc.gov/Forms/Complaint/Screen1)\n    1. Your [congressional representative](https://forms.cftc.gov/Forms/Complaint/Screen1)\n    1. Your [state AG](https://www.usa.gov/state-attorney-general)\n    1. Your [US senator](https://www.senate.gov/senators/)\n1. Submit links or PDF copies of said cliams to Coinbase. (In a calm, professional manner as if it's just another day at work.)\n1. Post your experience on Reddit and/or Twitter. Also in a calm, professional, non-threatening manner.\n\nDisclaimer: Much of this information is based on experience and observation, and with partial mid-level inside company confirmation.\n\nIf anyone has other/better ideas, please add them!",
            "stickied": false,
            "comments": [
                {
                    "id": "i9uj3r7",
                    "author": "-George---",
                    "score": 49,
                    "created_utc": 1653422560.0,
                    "response": "Guys I see that you keep shadowbanning this content. I will get through, as well as the fact that you keep shadowbanning it. There are other ways to get it onto the sub besides a top-level post.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9uk2e4",
                            "author": "coinbasesupport",
                            "score": 5,
                            "created_utc": 1653422969.0,
                            "response": "Hey there u/-George---, it appears that your post was autoflagged for spam, we apologize for this. We understand that reddit is an open forum for discussion and this post does not directly break any rules of this subreddit. We have gone ahead and reverted the removal of your post.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9ukfsy",
                                    "author": "-George---",
                                    "score": 30,
                                    "created_utc": 1653423127.0,
                                    "response": "Appreciated.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9vcbad",
                                    "author": "Accomplished-Way7608",
                                    "score": 7,
                                    "created_utc": 1653435480.0,
                                    "response": "Yea you better apologize!",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9wqkjr",
                                            "author": "vernes1978",
                                            "score": 3,
                                            "created_utc": 1653463563.0,
                                            "response": "You're like that hyped up guy that pops up the moment your friends managed to talk the drunk hooligans out of the idea of a fight and then you pop up shouting \"that's right! you better fuck off ye pussies!\"",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9xds3k",
                                                    "author": "ChrisR109",
                                                    "score": 2,
                                                    "created_utc": 1653481524.0,
                                                    "response": "After a soccer match.  That's when the hooligans usually come out.\n\n*ARRRGH!!!*",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9uqwwk",
                    "author": "AnimalProof",
                    "score": 44,
                    "created_utc": 1653425869.0,
                    "response": "Stumbled on this post. My CB account has been frozen, although not mysteriously.\n\nI've been a loyal customer of Coinbase since 2017, spending thousands of dollars in fees over the years. \n\nLast week Friday I purchased several thousand USDC coin to send to a broker who I've worked on deals with several times. As soon as I tried to send the funds to his wallet, Coinbase denied the transfer and then immediately locked my account... for 2 months! The reason told to me is that that wallet was flagged as 'fraudulent'. It's not. Like I said, it's someone I know. They refuse to give me any other reasons.\n\nSo for 2 months I can't trade/buy or transfer crypto. Support told me my only option is to either sell my holdings and transfer it back to my bank account, or wait 2 months (they recommended I just wait 2 months). I don't have a lot of money so can't afford to wait the 2 months and go purchase elsewhere. So I sell and send back to my bank account, which incurred another fee of $100. \n\nIn total, Coinbase charged me just shy of $350 in fees only to handcuff me and force a sellback. It's an unreasonable request to ask someone (especially a long-time customer) to wait 2 months. I submitted a support request, asking for my fees to be paid back to me, which I believe is only fair based on their actions.\n\nI have written back and forth with support several times and even though the headline of my support ticket is literally 'I'd like my fees to be refunded', support comes back again and again stating that their decision is final and that my account is frozen for 2 months, and nothing I can do will convince them otherwise, not once mentioning the fees. \n\nI don't think I'm asking for too much here. So frustrated. Can't believe I've given any money to these guys. Don't hold funds on large exchanges is still the best advice I've ever gotten in crypto.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9v8slv",
                            "author": "-George---",
                            "score": 15,
                            "created_utc": 1653433826.0,
                            "response": "I don't know why you're getting downvoted. That's a terrible experience. I'm sorry, and best of luck to you.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9veiox",
                                    "author": "MacroHard_0",
                                    "score": 6,
                                    "created_utc": 1653436525.0,
                                    "response": "If not a Cex, What’s the alternative for fiat on-ramp?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9vpl3g",
                                            "author": "-George---",
                                            "score": 5,
                                            "created_utc": 1653441805.0,
                                            "response": "There's several p2p programs and websites.\n\n- Bisq is an excellent privacy-first program and service.\n- localbitcoins.com is a market leader for BTC.\n- localcoinswap.com is another leader for all crypto.\n- Physical coin kiosks, but the spreads are usually outrageous, 20% or higher. Maybe that will improve with competition over time.\n\nThose services are p2p and people accept a range of options, from XMR via in-person cash, to Paypal, etc. Selling is a little trickier than buying, risk-wise, which is why it's more expensive than buying from a CEX.\n\nPersonally, I increasingly just buy on CEXes, then move to private wallet and trade on a DEX (eg stuff on the Polygon network). \n\nBut to be fair, it can be very cheap and literally instant to day-trade on a CEX - because you are just trading IOUs (\"not your keys not your coins\" yada yada). There is no waiting on block confirmations, and no gas fees. (But a small fee to the CEX.) And the spreads are hard to beat. The trick is, you just keep a low enough amount on a CEX that you can afford it all getting suddenly locked up indefinitely - even lost forever, if the market tanks, or even if they run out or liquidity on just a specific volatile asset.\n\nSo, personally I try to avoid that. Esp after this crash, I'm done day-trading on CEXes.\n\n**I'm going 100% private wallet and decentralized exchanges-only from now on, Coinbase only for the momentary on/off-ramp to my bank**.\n\nYou do have to trust a DEX not to steal your money. *But* it's only at risk for the length of the transaction, a few seconds - otherwise it's in your own private wallet.\n\nDeFi limit orders, too, are also in principle safer than on a CEX, because both sides of the transaction are already verifiably locked up in a smart contract just waiting to execute. However, unless you've reviewed every line of code, it could still be a rug-pull - and it does happen - so you need to trust the service offering limit orders.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i9w29so",
                                            "author": "ndreamer",
                                            "score": 1,
                                            "created_utc": 1653447838.0,
                                            "response": "mining, is the best way. This can be done with machines or staking. This will give \"Clean coins\"",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9xmf2t",
                                    "author": "AnimalProof",
                                    "score": 2,
                                    "created_utc": 1653485842.0,
                                    "response": "Thanks, appreciate that.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9waiue",
                                    "author": "bigaznDDDDDragon",
                                    "score": 2,
                                    "created_utc": 1653452217.0,
                                    "response": "He getting down vote by the coinbase fan boys and employees. Legit questions and answers are getting down vote.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9y9wd0",
                            "author": "SirDouglasMouf",
                            "score": 2,
                            "created_utc": 1653495536.0,
                            "response": "Have you tried moving assets to CB pro and then into a wallet?\n\nI was blocked from moving any assets out of Coinbase for a week. I moved them to Coinbase plus and then out to a wallet.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9yvt52",
                                    "author": "AnimalProof",
                                    "score": 1,
                                    "created_utc": 1653504069.0,
                                    "response": "Thanks for the advice- I'll see if I can do that. Luckily, I only have a few small holdings remaining in CB.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9uui9p",
                    "author": "shadowmage666",
                    "score": 8,
                    "created_utc": 1653427419.0,
                    "response": "Best post I’ve seen on this sub regarding negative experiences. Thanks for posting some actual data and real info",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9wdx98",
                    "author": "anonymemphis",
                    "score": 3,
                    "created_utc": 1653454279.0,
                    "response": "Following this post just in case. Thanks.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9xdvt4",
                    "author": "ChrisR109",
                    "score": 3,
                    "created_utc": 1653481580.0,
                    "response": "C'mon now.  We all know it's the account holders that fucked up.  That's what the know-it-alls keep informing the masses.  It's NEVER coinbase's fault.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9yix6c",
                            "author": "-George---",
                            "score": 2,
                            "created_utc": 1653499033.0,
                            "response": "That narrative at least seems to be toning down lately. At least for now. Seems Coinbase in particular was especially ill-prepared this crash.\n\nBut I guess neither of us can see the whole universe of reddit sentiment. Unless we did a study. :-)",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9yoz75",
                                    "author": "ChrisR109",
                                    "score": 2,
                                    "created_utc": 1653501390.0,
                                    "response": "There was another thread where somebody messed up.  'They' came out of the woodwork to just drill the dude into the ground and bury him.  It's sad.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9ytou5",
                                            "author": "-George---",
                                            "score": 1,
                                            "created_utc": 1653503239.0,
                                            "response": "Yeah it can be bad no doubt. The knee-jerk tired trope of \"not your keys not your coins\" drives me nuts.\n\nI mean, Duh. I hypothesize that the only people who say that, are in a very, very narrow demo - but multiplied by Reddit's numbers, still makes for too many at any given time: Self-unaware, unempathetic, narcissistic noobs who just learned that fact themselves between 2 and 4 weeks ago, and are within a certain stage of shame where trying to make others feel bad, makes them feel better - while they also somehow think it makes them look smart, witty, and/or edgy.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9xluq8",
                    "author": "QuestofMiren",
                    "score": 3,
                    "created_utc": 1653485576.0,
                    "response": "Where can we submit claims and reports if we are based in the UK?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9xlvvm",
                            "author": "haikusbot",
                            "score": 1,
                            "created_utc": 1653485591.0,
                            "response": "*Where can we submit*\n\n*Claims and reports if we are*\n\n*Based in the UK?*\n\n\\- QuestofMiren\n\n---\n\n^(I detect haikus. And sometimes, successfully.) ^[Learn&#32;more&#32;about&#32;me.](https://www.reddit.com/r/haikusbot/)\n\n^(Opt out of replies: \"haikusbot opt out\" | Delete my comment: \"haikusbot delete\")",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9yf5it",
                            "author": "bentonboomslang",
                            "score": 1,
                            "created_utc": 1653497567.0,
                            "response": "Commenting because I'd like to know the answer too.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9yikll",
                            "author": "-George---",
                            "score": 1,
                            "created_utc": 1653498897.0,
                            "response": "As OP I can't help you there outside of google. Hopefully others can.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9xnd4g",
                    "author": "marinelayer_89",
                    "score": 3,
                    "created_utc": 1653486275.0,
                    "response": "All this…makes me not want to invest into crypto 😵‍💫",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9yi6ti",
                            "author": "-George---",
                            "score": 1,
                            "created_utc": 1653498747.0,
                            "response": "Greatly minimize this by only using Coinbase (et. al) as an on/off-ramp to your bank account. Buy some crypto - never a huge amount at a time - *immediately* transfer it to your own wallet. Then either hold there, or do trading in the defi space. To cash out to your bank account, transfer back to Coinbase, immediately sell to USD, and immediately transfer to your bank.\n\nIf everyone did this of course they'd have no business model - or at least not a multi-billion-dollar business model with very substantial c-suite salaries and perks. Let's all stop and say some prayers.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9ulsd3",
                    "author": "almyles3000",
                    "score": 9,
                    "created_utc": 1653423699.0,
                    "response": "Well said and well presented",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9umg6j",
                    "author": "Emerald_Flamingos",
                    "score": 9,
                    "created_utc": 1653423977.0,
                    "response": "Thanks OP. Nice to see there are some good intentioned folks out here. Keep it up! :)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9x52su",
                    "author": "SurprisedByItAll",
                    "score": 2,
                    "created_utc": 1653476115.0,
                    "response": "I received an email saying my state issued ID information is missing now and I need to upload it again. I will be limited to withdrawals only if I don't do so. OP's message is making me realize that maybe he's 100% right and there are liquidity problems. If they've trickled down to my account then that's scary because I'm a small fish. \n\nHere was my post that this one may have answered honestly, https://www.reddit.com/r/CoinBase/comments/uxe6z9/coinbase_missing_information/?utm_medium",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9x5u3e",
                            "author": "coinbasesupport",
                            "score": 0,
                            "created_utc": 1653476658.0,
                            "response": "Thank you so much for clarifying. Would you mind providing your case number here? We would be more than happy to look into this for you. Thanks.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9y1hg5",
                    "author": "Creepy-Importance-13",
                    "score": 2,
                    "created_utc": 1653492215.0,
                    "response": "Facebook group “Coinbase clients demanding justice” \nGood info but seriously get out while you can!!!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9vh3ks",
                    "author": "Jahmann",
                    "score": 3,
                    "created_utc": 1653437769.0,
                    "response": "This just happened to me. My coinbase card started getting declined for no reason, took me a couple of days to realize that withdrawals was suspended and the account was held.\n\nTickets went unresponded to for a couple days so I called and they had me reverify my identity with no explanation. I tried to talk to the chat thing to find out why it happened, but I got a bunch of canned responses about confirming my personal information and how they can't tell me about security policy or some bs. Everything was working at this point. I was specifically asking for evidence about unauthorized access to my account, and the responses just were totally disconnected like a bot.\n\nThis makes perfect sense really. Withdrawing everything as we speak.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9vi7mx",
                            "author": "coinbasesupport",
                            "score": 0,
                            "created_utc": 1653438307.0,
                            "response": "Hi, u/Jahmann! We're sorry to hear about your experience. Please provide us your case number, and we'll see what we can do to assist. Thanks!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9wbbmq",
                    "author": "CVP11",
                    "score": 3,
                    "created_utc": 1653452678.0,
                    "response": "Countless people have had there coinbase account frozen for no reason myself included. It’s been two years and i still dont have access to my account. I did have 300k in bitcoin but now its probably worth half that. I think u are dead on with your theory. I think coinbase is a scam company and needs to be investigated by the SEC.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9vc92b",
                    "author": "Accomplished-Way7608",
                    "score": 2,
                    "created_utc": 1653435450.0,
                    "response": "Contact your congressman and news media and tell them your story!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9utfi3",
                    "author": "Kiwip0rn",
                    "score": -3,
                    "created_utc": 1653426954.0,
                    "response": "🙄 nope",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9w1bnl",
                    "author": "ApprehensiveSteve",
                    "score": 0,
                    "created_utc": 1653447368.0,
                    "response": "Transfer all of your shit into GameStop's new wallet.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9uip35",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653422393.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9y13b5",
                    "author": "Creepy-Importance-13",
                    "score": 1,
                    "created_utc": 1653492060.0,
                    "response": "Get out while you can",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9yvjg0",
                            "author": "-George---",
                            "score": 1,
                            "created_utc": 1653503962.0,
                            "response": "Get out *if* you can, and then *when* you can.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9vqxqu",
                    "author": "jhanon76",
                    "score": -1,
                    "created_utc": 1653442455.0,
                    "response": "Of course all the \"coins\" are IOUs.  Real crypto is in a wallet not an exchange.  For everyone who thought their day trading was protected on an exchange has ZERO CLUE what cryptocurrency is.  Once the exchanges are dragged in front of congress, they will cease to carry cryptocurrency...transparency and insurance are not the point of crypto.  People risking lots of money thinking someone would bail them out are going to singlehandedly ruin crypto and all the good it was designed for.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9vtyzt",
                            "author": "-George---",
                            "score": 5,
                            "created_utc": 1653443875.0,
                            "response": "The problem is, most people in crypto are *necessarily* new entrants, who aren't as savvy as \"old-timers\" like me or possibly you who had to learn real quick to survive.\n\nI say \"necessarily\", because I at least - and probably you too - want crypto to grow. I want my portfolio to grow. That means mainstream adoption. That means easy-peasy services. That means Matt Damon advertising (whether specifically a good idea or not in that case). That means *trustable* services - which of course Coinbase is not. That means your (or someone's) elderly mom jumping in without fear.\n\nBut most noobs just put their money in a CEX and leave it there. They just don't know. And that *should* be OK. (And, in fact, it almost always is except when they freak the hell out when there's no liquidity and they get problems like this.)\n\nJust because you and I think that's suicidal, doesn't mean *that is just what new entrants do*. Almost universally. They are programmed to do *exactly that* by billions of dollars in advertising - you and I can't compete against that. And *we need an exponentially growing curve of new entrants*.\n\nI don't know what the answer is. Maybe, in part, regulation (an idea that in turn makes many crypto maxi heads explode). But even then, what would that look like? It would almost certainly punish the end users - not the Coinbase C suite, board, or other major shareholders.\n\nBut I do know that mocking or criticizing new entrants for their pain and suffering at the hands of Coinbase and other CEXes, is *not* the answer.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9wfnhw",
                                    "author": "Cautious-Error6353",
                                    "score": 0,
                                    "created_utc": 1653455393.0,
                                    "response": "Yeah most people on this forums ridicule newbies. They do more harm and spread more FUD. I am ignoring them anyway. Learned some hard lessons along the way.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9xwktx",
                                    "author": "jhanon76",
                                    "score": 1,
                                    "created_utc": 1653490225.0,
                                    "response": "I understand your point but you just described a pyramid scheme that you want protected by insurance.  Yes it makes your crypto more valuable but it also just makes it another transparent currency...which it never was intended to be.  From Day 1 an exchange was never a place to store money you cannot lose...but it has always been a mechanism to inflate the value of coins...hence hodlers need them to survive.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9yh36s",
                                            "author": "-George---",
                                            "score": 1,
                                            "created_utc": 1653498313.0,
                                            "response": "> I understand your point but you just described a pyramid scheme\n\nThat was no accident. What do you think an economic system that collapses without never-ending exponential growth is? \n\nIt's no different than investing in anything else, or the very foundation of the global economic system. Whether growing ETH results in an exponentially expanding universe of smart contracts, defi services, DEXes, and mostly concentrated wealth; or growing AMD results in exponentially expanding universe of offices, payrolls, CO2 emissions, and the ever-increasing conversion of third-world dirt into ever-faster CPUs and toxic waste - the concept is the same.\n\nThe future of crypto is PoS, which is more efficient than the legacy financial system. And when ETH crashes, for example, there's no company to go bankrupt - so, barring other circumstances (like being tied to an algorithmic stablecoin), little fear of it permanently going to 0. And no CEOs to get into sex/murder scandals, no quarterly report pressures, no layoffs, etc. (These are literally all the reasons I personally gamble in crypto more than stocks lately.)\n\nAnd I never said anything about \"insurance\". The problem is liquidity. The real solution is to solve the \"not your keys not your coins\" foundation at a legislative or regulatory level, so that when you buy coins, by law you own those coins immediately on the blockchain - so that there is literally no liquidity problem, and they can't lock you out. But they have lobbyists and deep pockets using our money (that they never actually bought our coins with), so it will doubtfully happen. But that *is* at least a competitive angle for a small player to take advantage of - who of course, mathematically, will never be able to leverage up to compete with the big-boys.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9yiq4j",
                                                    "author": "jhanon76",
                                                    "score": 1,
                                                    "created_utc": 1653498958.0,
                                                    "response": "My point is that you CAN and SHOULD own those coins...by putting then into a wallet.  Day trading has massively overinflated value of coins well beyond their intended use and requires more liquidity than is presently available at the base of the pyramid.  Buyers today think this is like bank money (FDIC insured) or stocks (essentially fed insured against failure).  For sure the exchanges are taking advantage of people because they also know crypto is unregulated and mysterious.  But nobody should give an unregulated exchange a large sum of cash and expect that they will get any of it back.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9yv8qk",
                                                            "author": "-George---",
                                                            "score": 1,
                                                            "created_utc": 1653503846.0,
                                                            "response": "I think we're talking past each other.\n\nI think if you read what I've written, you'll see that I've explicitly urged, emphatically, numerous times, including on this thread, do not store your crypto on CEXes.\n\nAlso you're talking in terms of \"shoulds\" without acknowledging the existing state.\n\nIt is unambiguously obvious that I agree with your \"shoulds\". I mean, that was the whole premise of my original post, so I'm not even sure why you've reiterated that argument.\n\n>  But nobody should give an unregulated exchange a large sum of cash and expect that they will get any of it back.\n\nThe existing state of things - not the \"shoulds\" - is that *billions of dollars* in advertising and marketing are being thrown at the specific target market of likely future crypto investors, *specifically to convince them to put their money on CEXes, leave their money on CEXes, and **stake their money on CEXes**.*\n\nSo you and I can opine on what savvy crypto users should or should not do until the cows come home. But we can't compete against that.\n\nSo given that, now what?",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9umxq4",
                    "author": "AmericanScream",
                    "score": -15,
                    "created_utc": 1653424182.0,
                    "response": "Fun fact:  Crypto exchanges are basically *unregulated casinos*.\n\nThere's no transparency.  There's no oversight.  They're outside of the regulatory authority of most jurisdictions.  They're not licensed as banks. They're not licensed as brokerage firms.  They're about as well regulated as the Western Union kiosk in a neighborhood 7/11.\n\nCEX's, like just about everything in the crypto industry, is part of a scheme to defraud gullible people who have been fooled into thinking they're going to get rich if they simply hold onto a completely useless, intangible digital asset that has absolutely no utility or intrinsic value.  \n\nJust stop it, people.   Get out while you still can... IF you can.\n\nSee /r/CryptoReality",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9vc42e",
                            "author": "VPN4reddit",
                            "score": 9,
                            "created_utc": 1653435386.0,
                            "response": "Coinbase is a publicly traded company you idiot. They are licensed AND regulated. Their whole ledger is public knowledge.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9yv7vi",
                                    "author": "AmericanScream",
                                    "score": 1,
                                    "created_utc": 1653503836.0,
                                    "response": "The only thing that's audited are their base financials.\n\nThere is no transparency when it comes to their brokerage operation.\n\nThey ARE NOT licensed as a brokerage firm.  They are NOT licensed as a bank.  They do NOT offer FDIC protection for their customers.  They are nowhere near as well regulated as the NYSE or Nasdaq or actual financial exchanges.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9vy1ly",
                            "author": "dak4f2",
                            "score": 1,
                            "created_utc": 1653445790.0,
                            "response": "My credit card legit considered a crypto dot com purchase I made as part of their \"gambling / casino\" category and charged me interest up the ass lol.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9vlx64",
                    "author": "bob99900090",
                    "score": -2,
                    "created_utc": 1653440072.0,
                    "response": "You’re probably getting audited and your accounts frozen",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9vq24g",
                            "author": "-George---",
                            "score": 6,
                            "created_utc": 1653442031.0,
                            "response": "Well there's literally no possible way to connect this and my coinbase account. Not IP address, OS, browser fingerprinting (if they even had full access to Reddit's metadata), nothing.\n\nBut I wouldn't mind knowing they wasted time trying. ;-)",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9x063z",
                    "author": "braidenthedork",
                    "score": -1,
                    "created_utc": 1653472182.0,
                    "response": "thank me later🙏❤️ https://www.youtube.com/watch?v=tDZtBzqow6Q",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}