{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "r0qe0e",
            "title": "Scam or possible incredible payout?",
            "url": "https://www.reddit.com/r/CoinBase/comments/r0qe0e/scam_or_possible_incredible_payout/",
            "author": "rongy_dringus",
            "created_utc": 1637710196.0,
            "score": 16,
            "num_comments": 58,
            "subreddit": "CoinBase",
            "selftext": "Let me tell u the Rolercoaster ride I’ve been on the last few days. \n\nOK, so I met someone on Twitter (I know, red flag lol). We talked for like 6 to 7 days. She asked why in the world I wasn’t part of an eth mining pool. She said she was bringing in 4 eth a day as profit. I asked her how it’s done, apparently, you take tether in your coin base wallet, and you join an Ethereum mining pool, and they use your tether to create eth and you get dividends back in Ethereum. \n\nI tried it with a small amount and saw that it was indeed making profit that I could withdraw in tether and send back to coin base and ultimately my account. The profit was incredible. The return is 1-3% per day depending on the amount of tether you have. \n\nSo I put in $200k of tether and was making 2% per day. That’s $4000 per day in ethereum straight to my account as passive income. I was about to retire. \n\nToday I took a nap, when I got up, I checked my tether account (200,000 tether), and the balance was zero. A random address had withdrawn it all 😣\n\nI contacted the mining pool help and they said it has to be staked/pledged for 30 days. I have no access to it or the profits, but I can see the profits being made (approx 0.5 tether every 6 hours)…staking it doubles the profit. \n\nSo I called coinbase wallet freaking out wondering if this is a scam and they said they’ve never heard of an issue like this before which is a good sign. Also, that girl I met who told me about it, is still talking to me and trying to ease my worries…which is also a good sign because of it was a scam, she would just disappear. \n\nIf it’s a scam, I’m out of 200k. If it’s not a scam. The 200k is set to bring in $270k just in profit in one month.\n\nDo you guys have any experience or thoughts on this?",
            "stickied": false,
            "comments": [
                {
                    "id": "hlu2vtd",
                    "author": "unvieledloki",
                    "score": 5,
                    "created_utc": 1637711622.0,
                    "response": "its a scam, you can't earn ETH buy staking tether alone.    and if you mange to join a liquidty pool you need to supply 2 assets.    plus if any one dm's you to join its a scam they are likely waiting to see if you add more and will drain it  i recommend taking it out\n  plus if it was something that really worked they wouldnt need to dm you to join there would be public post and alot more people would know about it",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hlu2yxs",
                            "author": "rongy_dringus",
                            "score": 1,
                            "created_utc": 1637711663.0,
                            "response": "Can’t take it out…for 30 days is what the said",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hlu58s0",
                                    "author": "unvieledloki",
                                    "score": 1,
                                    "created_utc": 1637712714.0,
                                    "response": "i would keep a eye on it, i honestly hope you dont lose it",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hm42oqp",
                                            "author": "ItzCStephCS",
                                            "score": 3,
                                            "created_utc": 1637896821.0,
                                            "response": "he lost it.. \n\nsource: i'm rereading through OPs post history 2 days later OOF :c",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hm4ka15",
                                                    "author": "hawkdog09",
                                                    "score": 1,
                                                    "created_utc": 1637907220.0,
                                                    "response": "I truly don’t get how people fall for this. And then just put 200k in with no research into the legitimacy of it. That would be a multi million dollar operation at the very least, and they can’t be bothered to do any due diligence? SMH. Hate to say it, but I’m always happy when these scams turn out to just be people being absolute morons, instead of just accidentally clicking a link or not knowing how it happened.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "hm8favk",
                                                            "author": "ItzCStephCS",
                                                            "score": 1,
                                                            "created_utc": 1637984255.0,
                                                            "response": "Yeah most of the times it’s people being greedy af. If this man took 2 seconds to ask Reddit or even a discord first if this shit is legit then he might still have his tethers.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i6ir91k",
                                    "author": "SayonCH",
                                    "score": 1,
                                    "created_utc": 1651145363.0,
                                    "response": "i was scammed to by a Woman, she called her \"Minnie\". she is on twitter and make always new accounts. i had the same story like you but in my case it was 1500$. isn't possible to force the money back?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hlu8dlv",
                    "author": "Ilikegooddeals",
                    "score": 2,
                    "created_utc": 1637714174.0,
                    "response": "So you were able to withdraw once and now you can’t? Sounds fishy, think they honeypotted you my guy/girl or whatever you are.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hlut07j",
                    "author": "SirFlopper",
                    "score": 2,
                    "created_utc": 1637723903.0,
                    "response": "Definitely a scam. They often do exactly as you said; they will take a small amount and give you a bigger amount back after a short period. This convinces you it is legit so then you give them everything and they make off with that.\n\nLook at it this way, the wealthy consider good returns to be 12% annually. The return you were promised is between 365% to >1,000% annually. If that were possible those people would not be convincing strangers on twitter to hand over their money and the wealthy would not be wasting their time with blackrock.\n\nOr another example, they could turn 1k into 1.4mm in 2 years. Does that sound realistic?\n\nEdit: put figures into return calculator and assumed compound",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hlut7pt",
                            "author": "rongy_dringus",
                            "score": 1,
                            "created_utc": 1637724003.0,
                            "response": "I’m very financially illiterate and this shows it. I’m working on convincing them I have a bigger sum in exchange",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hluusyh",
                                    "author": "SirFlopper",
                                    "score": 1,
                                    "created_utc": 1637724786.0,
                                    "response": "I hope they bite homie",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "hm8stf3",
                                    "author": "Elymanic",
                                    "score": 1,
                                    "created_utc": 1637992006.0,
                                    "response": "How are you financially illiterate with 200k to spare?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "hlutejw",
                            "author": "rongy_dringus",
                            "score": 1,
                            "created_utc": 1637724093.0,
                            "response": "How did they get into my CB wallet?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hlxpufw",
                    "author": "Solid-Mess",
                    "score": 2,
                    "created_utc": 1637781121.0,
                    "response": "Scam. You will never be able to take it out. They got you goodX sent you back money to prove it was real and you fell for it and sent a shit load. \n\nIt’s gone. \n\nThat sucks",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hoy5px2",
                    "author": "Muddassar9",
                    "score": 2,
                    "created_utc": 1639765182.0,
                    "response": "It is a scam, I also lost 63000 usdt. after 30 days it will be pledged again for 30 or 60 or 90 days. you will be asked to deposit same amount for verification and to unpledge your amount. It is gone forever.  \nI even had 4 different account, using referal links to get commission, all 4 were emptied at the same time. Than person, She is still in contact with me, keeps telling me to unpledge by depositing more.  \nContact that pool's customer service and ask them how to unpledge? and if they ask for money ask this rich friend of yours who earns 4 eth a day to help you unpledge. which will never happen.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hoy9tnb",
                            "author": "rongy_dringus",
                            "score": 2,
                            "created_utc": 1639766778.0,
                            "response": "Sorry to hear that. You can go to their wallet on etherscan and see all the complaints from people getting ripped off. It sucks that not even tether will take action against them. I’ve emailed them several times and they need law enforcement to reach out to them…which if you know cops and detectives in the US, they don’t want the paperwork",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hoybzh6",
                                    "author": "Muddassar9",
                                    "score": 1,
                                    "created_utc": 1639767608.0,
                                    "response": "The reason I was scammed is because I trusted what was advertised everywhere \"Coinbase Wallet is 100% safe unless the password/phrase is compromised\"  \nwell I am from pakistan, and can't even ask law enforcement. Also after 9 emails, and lots of social media tagging, I gave up, because I never got a response from Coinbase. Only scammers using coinbase name.  \nI got into this on 11 October 2021, and at that time I googled alot but didn't find and scam posts. My money was teken out on 7 December. And I followed that address on etherscan, It is still taking money out of lots of wallets daily, But I hardly see any complaints on internet.  \nAlso permission was granted to that address when I bought the node, Coinbase made it easy for scammers, no confirmations, no info. Well I can go on....  \nI also feel very sorry for your loss. There needs to be more awareness. Hope only good things happen you in future.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hoykww7",
                                            "author": "rongy_dringus",
                                            "score": 1,
                                            "created_utc": 1639771115.0,
                                            "response": "I spoke with coinbase on the phone. They said coinbase has insurance for theft like this but not coinbase wallet. Especially since I clicked on what I thought was voucher/mining certificate - what that did was it introduced a smart contract into coinbase wallet that allowed them unlimited access to my tether. So because of that it was my fault. At least they didn’t steal my NFTs 🤷🏻‍♂️",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "hoy9x0j",
                            "author": "rongy_dringus",
                            "score": 2,
                            "created_utc": 1639766815.0,
                            "response": "Also read my next post. It’s about the aftermath",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hoyke2j",
                                    "author": "Muddassar9",
                                    "score": 1,
                                    "created_utc": 1639770906.0,
                                    "response": "I read that. I cant post there, bcz i have less karma and my account is not 30 days old. Did you get any hopeful response from anywhere?\n\nIf anyone, any hacker any conman, can recover the money it is yours.\r  \nScammer details:\r  \nFacebook: [https://www.facebook.com/profile.php?id=100070352479944](https://www.facebook.com/profile.php?id=100070352479944)\n\nFacebook 2nd profile: [https://www.facebook.com/profile.php?id=100055165178110](https://www.facebook.com/profile.php?id=100055165178110)\r\n\nWhatsapp: +82 10-8271-4604\r\n\nDapp: [https://eth-defi5.com/#/?invite\\_code=CQB7XA](https://eth-defi5.com/#/?invite_code=CQB7XA)\r\n\nTheir customer support: [https://www.eth-defl0.com/index/index?visiter\\_id=&visiter\\_name=&avatar=&groupid=0&business\\_id=5](https://www.eth-defl0.com/index/index?visiter_id=&visiter_name=&avatar=&groupid=0&business_id=5)\r\n\nWhen they got my token approval/when I bought node: 0xd75473798cfe3a0792441fc370f5f461bfdb8aad529fc12013daa6a398622ba0\r  \n\r  \nWhen It got stolen from 1 of accounts (had 4): 0x483a53bdb394b42876ac4ce1debc8bea11ff2759090d7d7c617abae104cd88e8\r  \n\r  \nThis address which took the money has average balance of 300k-500k, and withdraws money from multiple accounts, then different amounts pass though 3-4 accounts and then to some exchange, binance, oke,kucoin, etc etc. This scam is going hot.\r  \nP.S. Different girls are working on this, found telegram profile on same number operated by someone else. This person tells she is south korean, but uses multiple international number, including Hongkong and UK.\r  \nThey also run another scam. TRADING ON MT4. They provide signals.\r  \nBroker Website: https://www.taya.center/\r  \nyou earn few days and then long signal, no stoploss, when almost empty you hedge and they tell you to topup more.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hoykost",
                                            "author": "rongy_dringus",
                                            "score": 2,
                                            "created_utc": 1639771025.0,
                                            "response": "Yes lots of ppl are getting hurt",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hlu5b3m",
                    "author": "PythonKoder",
                    "score": 4,
                    "created_utc": 1637712744.0,
                    "response": "The  GIRL 'Guy in real life' strikes again. I always wonder, who falls for these obvious scams but unfortunately it's always proven that people do.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hltzpsm",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1637710196.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hlu1lxv",
                    "author": "RedneckHippy76",
                    "score": 1,
                    "created_utc": 1637711045.0,
                    "response": "I think when you stake, you are agreeing to not be able to sell or trade whatever you staked for whatever specified time the staking pool sets.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hlu46x0",
                    "author": "Tacodo",
                    "score": 1,
                    "created_utc": 1637712229.0,
                    "response": "😬😬😬",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hpe8pqd",
                    "author": "Icetoad420",
                    "score": 1,
                    "created_utc": 1640067512.0,
                    "response": "Please join us at https://www.reddit.com/r/eth\\_liquidity\\_scam/ to discuss this scam and how we are fighting it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hpnu1t0",
                    "author": "AlInRedd",
                    "score": 1,
                    "created_utc": 1640248209.0,
                    "response": "I think this lady kind of felt bad for me and let me go. I paid transactions fees several times but I could eventually get my initial 1000 USD back in my wallet. She followed up at least three times a day suggesting me to deposit at least 10,000 USDT. I kept her warm by loving her until I could sneak out my initial investment back out. She's impressed now. For privacy purposes I'm not going to share her picture as it might be someone else's.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hqgfp8v",
                    "author": "Significant-Cow1734",
                    "score": 1,
                    "created_utc": 1640810693.0,
                    "response": "It keeps happening because people dont know that a smart contract can give power to third parties to wipe out your wallet.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hqha9q2",
                            "author": "rongy_dringus",
                            "score": 1,
                            "created_utc": 1640822951.0,
                            "response": "Exactly… I would have never thought my coin base wallet could be compromised in any way…",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hqhdari",
                                    "author": "Significant-Cow1734",
                                    "score": 1,
                                    "created_utc": 1640824246.0,
                                    "response": "Sorry for your loss. I hope you have the health and force to gain much more than that!",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hqhdpyw",
                                            "author": "rongy_dringus",
                                            "score": 1,
                                            "created_utc": 1640824427.0,
                                            "response": "Much appreciated. Money comes and goes but health is most important. Stay healthy, stay safe, thank you for your post",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hsx7hc5",
                    "author": "Ok_Tap1515",
                    "score": 1,
                    "created_utc": 1642353751.0,
                    "response": "Can any hacker retrieve the funds after being taken from mining pool?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hsx7vyr",
                            "author": "rongy_dringus",
                            "score": 1,
                            "created_utc": 1642353911.0,
                            "response": "Nope",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hsx83k7",
                                    "author": "Ok_Tap1515",
                                    "score": 1,
                                    "created_utc": 1642353993.0,
                                    "response": "So it’s gone forever?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hsx864p",
                                            "author": "rongy_dringus",
                                            "score": 1,
                                            "created_utc": 1642354021.0,
                                            "response": "Yup…$200k",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "huupvop",
                                                    "author": "Ok_Tap1515",
                                                    "score": 1,
                                                    "created_utc": 1643551574.0,
                                                    "response": "Has any used or recovered money by using Datrek recovery? I’m trying to find out more about them.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "huuq1x3",
                                                            "author": "rongy_dringus",
                                                            "score": 1,
                                                            "created_utc": 1643551662.0,
                                                            "response": "There is no current way of recovering money from any outside company. Many will try to scam you. The money needs to be returned either by the exchange (coinbase, metamask, etc), or by Tether themselves. There’s no other way",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "hsx8dxs",
                                    "author": "Ok_Tap1515",
                                    "score": 1,
                                    "created_utc": 1642354105.0,
                                    "response": "How is this possible is the wallet Id is used only be deposited",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "hsx8n17",
                                    "author": "Ok_Tap1515",
                                    "score": 1,
                                    "created_utc": 1642354201.0,
                                    "response": "Would this still happen if you limited the withdrawal amount instead of have unlimited in the mining pool?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hvktkim",
                    "author": "ClimateStrong2640",
                    "score": 1,
                    "created_utc": 1643991891.0,
                    "response": "Im having a similar situation here, i just tried it with $3k to see how it works. The returns are great,  and I have made a 100,000 USDT contract that I haven’t fulfill and I’m glad I’m reading your message. Any chance you can talk to me directly in Telegram ? I want to learn from your experience and get my little money out ASAP. @jpeth79",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hyfbqax",
                            "author": "JDPrime21",
                            "score": 1,
                            "created_utc": 1645820474.0,
                            "response": "u/ClimateStrong2640 how did you find out the contract value ? One thing you do is immediately transfer your asset from wallet to your prefered exchange. I was about to get ripped in same way but smartly i used my due diligence to verify what url the scammer is trying to have me enter in my wallet address and luckily I was able to understand that this is a scam and I withdraw all my money to my coinbase exchange.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hyxsx5e",
                    "author": "aboutarik21",
                    "score": 1,
                    "created_utc": 1646157501.0,
                    "response": "this is definitely a scam and the scammer girl is trying to make you contribute more funds to unlock your pledge.Don't put any more funds and try to cancel the smart [contract.it](https://contract.it)'s a one way platform.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hz0lhz1",
                    "author": "mephistowarlock",
                    "score": 1,
                    "created_utc": 1646200340.0,
                    "response": "I almost got hit by this attack as well. The girl is claiming she is from Singapore and her name is Adele Lim. She has a Facebook with the same name but I bet it is someone else. Watch out for these kind of scams.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i0e9qvi",
                    "author": "LuciaMT2022",
                    "score": 1,
                    "created_utc": 1647108846.0,
                    "response": "acabo de caer en un scammer.  un Ethereum 1 +x 2. dejo el site aqui para que lo tengais en cuenta. No se como voy a recuperarlo, creo que es imposible.\n\n[https://ethereum-up.com/eth.php#Rules](https://ethereum-up.com/eth.php#Rules)\n\ntener cuidado amigos!!",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}