{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uvyqkc",
            "title": "My account has been locked for 18 days. Customer service keeps closing my support requests. When I call up, no information can be given about why, for how long and with no guarantees of me ever being able to access the account again.",
            "url": "https://www.reddit.com/r/CoinBase/comments/uvyqkc/my_account_has_been_locked_for_18_days_customer/",
            "author": "bentonboomslang",
            "created_utc": 1653307779.0,
            "score": 2,
            "num_comments": 36,
            "subreddit": "CoinBase",
            "selftext": "I've been a Coinbase customer for many years and never had a problem. I thought they were a cut above the competition in terms of legitimacy. Now I'm realising I should have listened to all those people online who tried to warn others that they are no better than the rest of the crypto scams.\n\nI don't know what to do next. I have tried emailing and calling. I've had two open support tickets automatically closed with the message \"We hope you were able to get the help you needed. We're closing this case.\" despite me not receiving any information from Coinbase.\n\nOn my latest call I was told I could not be given **any information or guarantees** about when the case will be looked at or what has happened to my account.\n\nI have a recording of the call. It's pretty unbelievable.\n\nI'm effectively being told my money is gone.\n\nIt seems like legal involvement is going to be my only route from here because Coinbase are giving me nothing.\n\nAny help would be much appreciated.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9obho8",
                    "author": "coinbasesupport",
                    "score": 4,
                    "created_utc": 1653308432.0,
                    "response": "I can understand feeling uneasy in such a situation. We're happy to check on that for you, unless legal action's been taken (in that case, we'd have to respectfully decline.) What's your most recent case ID?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9om8g1",
                            "author": "bentonboomslang",
                            "score": 0,
                            "created_utc": 1653314092.0,
                            "response": "I've not taken any legal action yet no. I would obviously really rather not but as it stands it I'm not sure what else to do. I'm completely in the dark.\n\nMy most recent case number is #11889791 but as I say, apparently this case has been \"closed\" for some reason. \n\nIf you are able to tell me anything other than \"I'm sorry but we cannot offer any information on this case what-so-ever\" then I'm all ears. Thanks.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9ops1m",
                                    "author": "coinbasesupport",
                                    "score": 3,
                                    "created_utc": 1653315744.0,
                                    "response": "Thanks for providing us with this case number!\n\nWe located the case in question and can confirm that although the cases you've submitted have been closed, this does not mean the matter is closed. \n\nWe see that your account is under review by the appropriate department. While we do not have the ability to provide you with specific info relating to the review, we can assure you that it is being actively worked on. A specialist from this team will be in touch with you directly should an update become available. We do not have a timeframe for this as this is taken on a case by case basis and so can vary.\n\nWhile we appreciate this isn't exactly the information you were looking for, we hope you understand, and we greatly appreciate your patience.\n\nThanks!",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9oz5ap",
                                            "author": "bentonboomslang",
                                            "score": 1,
                                            "created_utc": 1653319864.0,
                                            "response": "Even hearing \"This case is actively being worked on\" is more information than I've received from other sources so far.\n\nI don't understand why you have an automated email saying cases are closed when they are still being actively worked on? Perhaps so you are covered by the \"you will receive assistance within 10 working days\" claim on your site? Whatever the reason, it should be changed by your team.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9rrurp",
                                                    "author": "Accomplished-Way7608",
                                                    "score": 1,
                                                    "created_utc": 1653366618.0,
                                                    "response": "They flat out lie so you won't take legal action.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i9ondmd",
                                    "author": "QuestofMiren",
                                    "score": 2,
                                    "created_utc": 1653314634.0,
                                    "response": "I would also love to know this outcome u/bentonboomslang, because right now I have no doubt that they will respond exactly with \" we can't give you any information\".",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9opbhe",
                                            "author": "coinbasesupport",
                                            "score": 1,
                                            "created_utc": 1653315536.0,
                                            "response": "Thank you so much for your message. Would you mind providing a case number so that we can review further? Thanks!",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9oaumq",
                    "author": "Iamthemaster1000",
                    "score": -1,
                    "created_utc": 1653308045.0,
                    "response": "Similar happened to a friend. He finally got access to his coins and money but it took almost a year. His values plummeted by the time he got access so he lost a lot of money \n\nCoinbase suddenly goes blank and has access problems when people want to withdraw money. It’s as if coinbase always has liquidation problems\n\nI’d keep at it and hopefully the right rep will unlock your account",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9rrzdf",
                            "author": "Accomplished-Way7608",
                            "score": 1,
                            "created_utc": 1653366700.0,
                            "response": "Coinbase copied Bernie Madoff's business model.🤣",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9on3x6",
                    "author": "QuestofMiren",
                    "score": 1,
                    "created_utc": 1653314507.0,
                    "response": "EXACTLY the same with me since 9th of May\n\n&#x200B;\n\nI feel for you, I'm just as baffled, stressed, frustrated, and feel pretty betrayed by a company that I have recommended to everyone in the last 3-4 years. Even holding stocks in them that I'm down 50% on.   \n\n\n[https://www.reddit.com/r/CoinBase/comments/uw0ta2/horribly\\_handled\\_support\\_from\\_you\\_guys/](https://www.reddit.com/r/CoinBase/comments/uw0ta2/horribly_handled_support_from_you_guys/)",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9plaio",
                            "author": "Kiwip0rn",
                            "score": 1,
                            "created_utc": 1653329157.0,
                            "response": "🤭 🙄",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9rrx2h",
                            "author": "Accomplished-Way7608",
                            "score": 0,
                            "created_utc": 1653366660.0,
                            "response": "\"recommended to everyone\" 🤣 \n\ndude just wrecked your reputation!!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9ob6yy",
                    "author": "elaboratejuncture27",
                    "score": -2,
                    "created_utc": 1653308256.0,
                    "response": "This bad\nCoinbase has been misbehaving lately",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9oafbl",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653307779.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia1cdb8",
                    "author": "Dramtosil",
                    "score": 1,
                    "created_utc": 1653547732.0,
                    "response": "The cyber security has experience in recovering a hacked coinbase account. My account has just been successfully recovered through him, he’s the best cybersecurity ever. Contact me if you need proof of our chat so you know he’s real and not a scammer. You can reach him on Instagram: @Clintontech78 or WhatsApp: +1 (302) 455-7823",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9qzwsu",
                    "author": "WifflebatGangster",
                    "score": 0,
                    "created_utc": 1653352202.0,
                    "response": "They're using your funds to trade with and since you kept your money there,  it's their money to play with.  They're playing the cryptocurrency markets same as you are with YOUR money and deciding when to allow you access to it to make your own moves. When you see a good move,  they restrict you. They're stealing it.  Plain and simple.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}