{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uuwx6i",
            "title": "how to long to verify account after it gets locked for security reasons",
            "url": "https://www.reddit.com/r/CoinBase/comments/uuwx6i/how_to_long_to_verify_account_after_it_gets/",
            "author": "runquiksee",
            "created_utc": 1653170048.0,
            "score": 2,
            "num_comments": 36,
            "subreddit": "CoinBase",
            "selftext": "Added case number for support rep\nCase 11909669\n\nSo my ID is expired but the expiration was extended due to the pandemic. But coinbase id verification system is not designed for these circumstances so whenever i have to send it scan my ID for verification it has to be manually approved and it can take days to a week or more. Now that is frustration and I'm actually waiting again after getting locked for my own security protection haha, and i emailed my selfie they requested and I'm just doing what i can only do is wait wait wait \n\nNow im wondering when you have a current ID is the verification process instant and the lock gets removed after? Like instantly? This process I'm going through takes forever i might go and start working on getting a new ID card and that line itself might be hours but better than waiting a week just to approve a selfie",
            "stickied": false,
            "comments": [
                {
                    "id": "i9hvmni",
                    "author": "AutoModerator",
                    "score": 2,
                    "created_utc": 1653170048.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9i1chk",
                    "author": "coinbasesupport",
                    "score": 2,
                    "created_utc": 1653173014.0,
                    "response": "Thanks!  We do see your response received about 3 hours ago, and your specialist will get back to you as soon as they can.  Looks like we may have also chatted already over Twitter.  We have no ETA as response time can vary due to a few factors like volume and severity of the issue. Thanks for continuing to wait!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9i6jbt",
                            "author": "runquiksee",
                            "score": -2,
                            "created_utc": 1653175763.0,
                            "response": "Hi at did at Twitter then but I'm asking had my ID is current and i have no problems with your verification system would my locked account be unlocked instantly? \n\nIt's hard to wait like this cause i didn't do anythingout of the ordinary. My account gets locked buying and sending coins. What's stressful is that im trying to pay someone. I have no more excuses left. How you tell someone you don't know when they will get their payment",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9i6l6d",
                    "author": "runquiksee",
                    "score": -3,
                    "created_utc": 1653175792.0,
                    "response": "I don't think your verification team actually works on the weekend Right?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9i7wtw",
                    "author": "runquiksee",
                    "score": -2,
                    "created_utc": 1653176516.0,
                    "response": "I guess you didn't read my post. Now i have to delete this and repost a new thread because i don't think your going to read this post again",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}