{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uk87lz",
            "title": "Can’t Send to BTC Address From CB App?",
            "url": "https://www.reddit.com/r/CoinBase/comments/uk87lz/cant_send_to_btc_address_from_cb_app/",
            "author": "GoodN0se",
            "created_utc": 1651909046.0,
            "score": 3,
            "num_comments": 2,
            "subreddit": "CoinBase",
            "selftext": "I wanted to send my accumulated rewards to a cold wallet. I see that using the phone app, I can only send to contacts by emails, phone numbers and name. When I enter the actual wallet address it says ‘please enter a valid phone number.’ Am I missing anything?\n(I’ve been using CBP for trades & transfer, thought to try to transfer rewards directly from CB this time.)",
            "stickied": false,
            "comments": []
        },
        {
            "id": "ujzsje",
            "title": "2FA failing on my phone.",
            "url": "https://www.reddit.com/r/CoinBase/comments/ujzsje/2fa_failing_on_my_phone/",
            "author": "MarcusMan6",
            "created_utc": 1651878292.0,
            "score": 11,
            "num_comments": 19,
            "subreddit": "CoinBase",
            "selftext": "Got a new phone, same number yesterday.\n\nAttempting to log into the CB Pro App and every time I enter the code they text me it says the code is incorrect. I'm still logged in on my browser but unable to log-in via the app which is quite annoying.\n\nI'm assuming it's maybe related to the \"connectivity issue\" they say they're experiencing when you call support but who knows.\n\nAny one else in the same boat?\n\n&#x200B;\n\nEdit: Holy mother of low life scammers. It's been less than 15 minutes and I have FOUR DM requests from people claiming to be support lmao. Anywhere I can put them on a list for the sake of trying to keep the sub safe?",
            "stickied": false,
            "comments": [
                {
                    "id": "i7madxb",
                    "author": "Tall_Run_2814",
                    "score": 9,
                    "created_utc": 1651882010.0,
                    "response": "2fa with cell is easy to compromise.  Implore you to switch with 2FA with an authenticator app.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7mzm0a",
                    "author": "Turbulent-Ad-6845",
                    "score": 3,
                    "created_utc": 1651894977.0,
                    "response": "When do get back on regular coinbase switch to a Yubikey for your 2FA , No hacky hacks then",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7n5etg",
                    "author": "BiochemBeer",
                    "score": 3,
                    "created_utc": 1651898486.0,
                    "response": "Once you get this fixed, get an Authenticator app (Google or MS) or even better a Yubikey.\n\nLook at 30% of the posts here as it's people who used SMS for their 2FA and had their account compromised.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "ujocdt",
            "title": "Goodbye Coinbase",
            "url": "https://www.reddit.com/r/CoinBase/comments/ujocdt/goodbye_coinbase/",
            "author": "Visual-Two-9747",
            "created_utc": 1651846244.0,
            "score": 33,
            "num_comments": 87,
            "subreddit": "CoinBase",
            "selftext": "I am at my wits end! I can't get customer service to respond (6+ months) and I have lost more money trying to use the app and wallet than I have investing in any of the services. Keep the money Coinbase; I have closed out and deleted everything attached to you.",
            "stickied": false,
            "comments": [
                {
                    "id": "i7ktngx",
                    "author": "MysticLimak",
                    "score": 59,
                    "created_utc": 1651857655.0,
                    "response": "5 years of using CB not one issue…",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7lj0c4",
                            "author": "RTV_Xapic",
                            "score": 21,
                            "created_utc": 1651869050.0,
                            "response": "Yeah same, and i always read these stories and think about if i should move to another site, but then i read some similar things on sites like kraken and i really dont know what to do. But maybe its just people getting hacked? Or scammed?",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i7mu2qi",
                            "author": "heiney_luvr",
                            "score": 3,
                            "created_utc": 1651891938.0,
                            "response": "Same until this past week. They sent me an email saying they apologized for an issue they had when I try to deposit money. On transaction history it shows the deposits are cancelled. They provide a link to fix it and all it does is go to my dashboard. Support has been utterly trash. Withdrew everything I could today. It's only about $400. Opened account on Binance.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i7mnt1z",
                            "author": "knokkkor",
                            "score": 5,
                            "created_utc": 1651888696.0,
                            "response": "I've been using Coinbase for 7-8 years and haven't had a single issue with them. Never had my account locked or well.. any issue.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7memmi",
                    "author": "Itsonlyfare",
                    "score": 5,
                    "created_utc": 1651884136.0,
                    "response": "My transaction of $700 was lost and they kept copying and pasting canned responses. I’m done with Coinbase too.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7k3cb6",
                    "author": "Visual-Two-9747",
                    "score": 19,
                    "created_utc": 1651847027.0,
                    "response": "Coinbase is literally messaging me now - after repeated emails, chats, messages, inquiries - to discuss my issue. My money has already been moved from their platform and they they can piss right off.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7lwyip",
                            "author": "blairbear555",
                            "score": 8,
                            "created_utc": 1651875526.0,
                            "response": "I thought you said they can keep the money…",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i7l5sw1",
                            "author": "zionmatrixx",
                            "score": 8,
                            "created_utc": 1651862955.0,
                            "response": "Good for you. If we could get more people to leave this shady company, the crypto world would be a better place.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7mjwcv",
                    "author": "DiverCool4853",
                    "score": 3,
                    "created_utc": 1651886751.0,
                    "response": "Tbh with the terrible customer service I've had with banks I'm happy with coinbase app and coinbase pro I hate the coinbase wallet I got $200 stuck in there its costing me $450 to take it out 🙃 and there customer service was fire 🔥 for me responded real quick and took care of my issue over the phone real professionally just saying my experience",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7k4vwh",
                    "author": "Daikon_Dramatic",
                    "score": 10,
                    "created_utc": 1651847670.0,
                    "response": "Me too. Never again.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7k25kv",
                    "author": "Bog-EA",
                    "score": 4,
                    "created_utc": 1651846526.0,
                    "response": "I'm trying to get my money out first, but then I'm right behind you.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7k2ga4",
                            "author": "Visual-Two-9747",
                            "score": 10,
                            "created_utc": 1651846653.0,
                            "response": "I just did. Converted everything to one coin and cashed right out. Happily paid another fee to instantly deposit back into my checking account. Good riddance.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7k7t8e",
                    "author": "joejitsu_crypto",
                    "score": 15,
                    "created_utc": 1651848870.0,
                    "response": "God I hate this nonstop stream of FUD posts. We get it, you either suck with technology enough to lose money somehow with a very user friendly interface or are paid to post in an attempt to keep people away from crypto as long as possible. I have no idea why the mods have allowed this sub to become this. It's ridiculous.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7kfcd2",
                            "author": "_stoned_chipmunk_",
                            "score": 4,
                            "created_utc": 1651851903.0,
                            "response": "CB is down for lots of people. I'm a CB Pro user and the issue is on their end, as they have admitted. Don't blame people for being upset about CB not working like it is supposed to. This isn't a user error issue at all.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7ku3mm",
                                    "author": "Nothingbutsocks",
                                    "score": 6,
                                    "created_utc": 1651857845.0,
                                    "response": "CB being down isnt the issue, exchanges go down yes. He means the never eneding posts of \"They won't answer\", \"They stole my money\", \"My money is stuck\". THOSE are user error most of the time.\n\nThey fall for phishing scams, they post the wrong address while transferring or they even send coins that aren't supported by CB then they expect CB to fix it.\n\nTons of user error posts blaming CB for it, its only fair to get annoyed.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i7kutsv",
                                            "author": "_stoned_chipmunk_",
                                            "score": 5,
                                            "created_utc": 1651858154.0,
                                            "response": "But you don't know if that is always the case. I talked to support who admitted they gave a connectivity issue (related to the rewards changes) and they said they would email me this morning. That was 7 hours ago. No response. They have bad customer service. I feel you, there are definitely tons of people complaining about stupid things but CB customer service is God awful and they are not responsive. I haven't been able to buy/sell for two days now.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i7liilh",
                                                    "author": "Ok-Cryptographer5481",
                                                    "score": 5,
                                                    "created_utc": 1651868819.0,
                                                    "response": "Same here.  I have not been unable to buy/sell also for 2 days.  They can't even pony up an explanation.  JHC, at least stick something on the site and tell us what the hell is going on.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i7lj5k8",
                                                            "author": "_stoned_chipmunk_",
                                                            "score": 4,
                                                            "created_utc": 1651869117.0,
                                                            "response": "It's the dishonesty that makes me even more angry. Like you said, own up to the situation and be honest with customers. Lying about it only exposes how shady they are.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "id": "ujmq1t",
            "title": "Large amount of money transferred into coin base that I did not authorize.",
            "url": "https://www.reddit.com/r/CoinBase/comments/ujmq1t/large_amount_of_money_transferred_into_coin_base/",
            "author": "KirkCuhsins",
            "created_utc": 1651841372.0,
            "score": 14,
            "num_comments": 35,
            "subreddit": "CoinBase",
            "selftext": "I have not used my coin base account in months. On Wednesday I got a text saying that there will be a transfer of (a large) amount of money into coin base.  The next text wanted me to confirm, which I said I did not authorize it.  They texted that the transaction would be cancelled and that my account was secure.  A couple days later, the money has still left my bank account (says pending) and I cannot find it in my coin base.  \n\n&#x200B;\n\nDid I just get hacked and that money is gone forever?  Or does it really take this long to process something/cancel it and the money should be back in my account soon?",
            "stickied": false,
            "comments": [
                {
                    "id": "i7jrvo7",
                    "author": "Commercial-Jacket-33",
                    "score": 5,
                    "created_utc": 1651841841.0,
                    "response": "Yes and Yes.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7jstvi",
                    "author": "jsinclair12",
                    "score": 11,
                    "created_utc": 1651842307.0,
                    "response": "Probably hacked, unfortunately",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7jtqku",
                    "author": "2OneZebra",
                    "score": 12,
                    "created_utc": 1651842748.0,
                    "response": "I would say yes. Yes you have been hacked. Consider all your accounts hacked and change all passwords. \n\nEnable 2fa on everything. \n\nNotify the bank immediately. \nCancel all your cards and get new ones.\n\nPull a credit report on yourself. Check for fraudulent  transactions in the report and with your bank and any other accounts.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7js3iw",
                    "author": "iLiKeEgGzZzZ",
                    "score": 20,
                    "created_utc": 1651841951.0,
                    "response": "Call your bank. Coinbase won't do shit for you.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7k8c1c",
                    "author": "sayknee",
                    "score": 3,
                    "created_utc": 1651849080.0,
                    "response": "Coinbase has never texted me when I do an ACH bank deposit. Did you enter any personal info when you dealt with the second text?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7k8cx6",
                    "author": "BabydollPenny",
                    "score": 7,
                    "created_utc": 1651849090.0,
                    "response": "CB doesn't TEXT you..you got scammed. Ouch. Sorry. Damn people suck.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7k9x36",
                            "author": "KirkCuhsins",
                            "score": 3,
                            "created_utc": 1651849723.0,
                            "response": "It was the automatic coin base fraud prevention system.  Basically two factor authentication.  Are you saying coin base doesn't even do THAT?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7kada7",
                                    "author": "BabydollPenny",
                                    "score": 3,
                                    "created_utc": 1651849909.0,
                                    "response": "Oh damn ,idk about that ..but I guess it does use text for the 2fa. Sorry. I wasn't aware it was a 2fa text(sorry I'm a bit tarded this morning..and didn't put text =2fa.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i7lfpa3",
                                    "author": "XxNukeMutantxX",
                                    "score": 4,
                                    "created_utc": 1651867510.0,
                                    "response": "Coinbase wouldn’t send you a text with links in them.  Only thing they text is confirmation codes .  I get emails and texts from all my online accounts not just coinbase.  Gitgud",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "id": "ujphvn",
            "title": "Connection Trouble",
            "url": "https://www.reddit.com/r/CoinBase/comments/ujphvn/connection_trouble/",
            "author": "Artistic-Wave-2455",
            "created_utc": 1651849479.0,
            "score": 9,
            "num_comments": 19,
            "subreddit": "CoinBase",
            "selftext": "I face some problem that I can't buy/sell crypto rn\n\nIt's show that Connection Trouble\n\nHow to fix it? I'm urgent now thanks",
            "stickied": false,
            "comments": []
        },
        {
            "id": "ujtz79",
            "title": "Accidentially sent money from wrong bank account (SEPA)",
            "url": "https://www.reddit.com/r/CoinBase/comments/ujtz79/accidentially_sent_money_from_wrong_bank_account/",
            "author": "kalleslayer",
            "created_utc": 1651861852.0,
            "score": 3,
            "num_comments": 8,
            "subreddit": "CoinBase",
            "selftext": "Will I get my funds or do I have to contact support?",
            "stickied": false,
            "comments": []
        },
        {
            "id": "ujr8xe",
            "title": "Manual review...how long?",
            "url": "https://www.reddit.com/r/CoinBase/comments/ujr8xe/manual_reviewhow_long/",
            "author": "icecool82",
            "created_utc": 1651854323.0,
            "score": 3,
            "num_comments": 7,
            "subreddit": "CoinBase",
            "selftext": "Hello guys\n\nCase number 07853241\n\nI have my account on \"manual review\" from a long time.\n\nI have provided all the papers you were asking for and uploaded on sendsafely but still no one picking it up.\n\nIf you could be so kind to use it again i really will appreciate it.\n\nThanks",
            "stickied": false,
            "comments": []
        },
        {
            "id": "ujnt9w",
            "title": "mobile.coinbasexs.com This exchange is a scam",
            "url": "https://www.reddit.com/r/CoinBase/comments/ujnt9w/mobilecoinbasexscom_this_exchange_is_a_scam/",
            "author": "Kingsly-007",
            "created_utc": 1651844696.0,
            "score": 4,
            "num_comments": 11,
            "subreddit": "CoinBase",
            "selftext": "Stay away from this site, it's a scam; they will blackmail you into paying an exit tax with outside funding before you can move any assets of that exchange; they will ask for more and more and more and won't stop. Don't fall for their tricks; you know this site is not legit when the customer service speaks in terribly  broken English",
            "stickied": false,
            "comments": [
                {
                    "id": "i7k1cmi",
                    "author": "TheBronx172",
                    "score": 8,
                    "created_utc": 1651846177.0,
                    "response": "The name should of been a dead give away “Coinbasexs” I think we all need to take things a little slower and read things through.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "ujp61k",
            "title": "Coinbase question? (Please, read below. Thank you!).",
            "url": "https://www.reddit.com/r/CoinBase/comments/ujp61k/coinbase_question_please_read_below_thank_you/",
            "author": "susygomezd",
            "created_utc": 1651848583.0,
            "score": 3,
            "num_comments": 7,
            "subreddit": "CoinBase",
            "selftext": "Hello guys! Hope you are all doing very well!\n\nIf you allow me to ask, please:\n\n1. If I wish to change from Coinbase to antother company, which exchange would be better?\n\n2. How may you transfer funds from Coinbase to such NEW & Different Exchange?\n\n\n3. Would you advise such transition?\n\n\n(To give you a very brief summary of context… I have about 7 Crypto Coins on my humble Coinbase Portfolio which is COMPLETELY BLOCKED from either Buying or Selling as both my Nationality and Geographical Location are from a Country in South America. \n\nNo matter if you use a VPN or whatever… I’m basically stuck since last year due my “legal paperwork” as most South American countries are literally blocked from buying/selling… all I’m allowed to do is send, receive, and hold my Crypto. \n\nNow, I’m completely aware that other Platforms will most likely block me from buying/selling just as Coinbase. \n\nNevertheless, I want the peace of mind that my assets are in the safest, most secure, and fair platform + a company that may have a better, more positive Customer Service).\n\nRespectfully to everyone. Thank you all!",
            "stickied": false,
            "comments": []
        },
        {
            "id": "ujit8m",
            "title": "Delete BRD App after migration to Coinbase App",
            "url": "https://www.reddit.com/r/CoinBase/comments/ujit8m/delete_brd_app_after_migration_to_coinbase_app/",
            "author": "MaximumBlast",
            "created_utc": 1651825805.0,
            "score": 3,
            "num_comments": 14,
            "subreddit": "CoinBase",
            "selftext": "Can i safely delete the BRD app after migration?",
            "stickied": false,
            "comments": []
        },
        {
            "id": "ujabid",
            "title": "5K of XLM deposited to Coinbase Pro One Week ago and it's still missing",
            "url": "https://www.reddit.com/r/CoinBase/comments/ujabid/5k_of_xlm_deposited_to_coinbase_pro_one_week_ago/",
            "author": "bitcoinman987",
            "created_utc": 1651793613.0,
            "score": 3,
            "num_comments": 26,
            "subreddit": "CoinBase",
            "selftext": "I deposited 5K of XLM into Coinbase one week ago and it's still missing. I've tried filing a case and reaching out to Coinbase Support on Twitter, but no one has helped me. Has anyone tried something that worked?\n\nThanks for your help! I need this money to buy food and pay rent",
            "stickied": false,
            "comments": [
                {
                    "id": "i7ho93o",
                    "author": "maryupallnight",
                    "score": 12,
                    "created_utc": 1651793737.0,
                    "response": "Did you send it with a memo?\n\nIf not you must contact support for them to find it and put in your account might take 60 days.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7huzzl",
                    "author": "SergMOrg",
                    "score": 4,
                    "created_utc": 1651797017.0,
                    "response": "You should not lose your coins. From where did you send your coins (wallet, exchange?). \n\nNormally, CB will ask you to send a specific amount from the same wallet  you missed  to put the memo field. Be sure this time you include the memo provided by Coinbase when you create the receive address.\n\nThey will verify the amount and return your tokens.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "ukd1jb",
            "title": "DAI yield",
            "url": "https://www.reddit.com/r/CoinBase/comments/ukd1jb/dai_yield/",
            "author": "Massive-Vacation-672",
            "created_utc": 1651929209.0,
            "score": 5,
            "num_comments": 3,
            "subreddit": "CoinBase",
            "selftext": "Hey! I just bought with 60€ DAI. And right after I put it to earn yield for me. But when i look at it it says that it’s only earning on 2.81€ of assets? why not the full 60€?",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uk29tg",
            "title": "USER UNABLE TO BUY OR SELL SOLUTION!",
            "url": "https://www.reddit.com/r/CoinBase/comments/uk29tg/user_unable_to_buy_or_sell_solution/",
            "author": "Capital_Chair2745",
            "created_utc": 1651886362.0,
            "score": 3,
            "num_comments": 11,
            "subreddit": "CoinBase",
            "selftext": "For two days I have had problem buying or selling crypto during prime times. I've called support and they suggested using the web on the phone instead. After trying this method it didn't work. I've tried all their trouble shooting tips EXCEPT updating my phone to the latest version. After I've done this I've had no problems buying or selling.\n\nI'm not sure if it is just coincidence that it happened to work but with the rediculous fees and poor technical support I'll be looking to move on from this exchange in time due to not being reliable at key moments.\n\nPlease only use money your willing to lose on this exchange because of the unreliability.\n\nEDIT: I also tried verifying my identity at coinbase.com/verify-document",
            "stickied": false,
            "comments": [
                {
                    "id": "i7naz59",
                    "author": "wallc7777",
                    "score": 3,
                    "created_utc": 1651902269.0,
                    "response": "🤦‍♂️",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}