{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "v1b4t4",
            "title": "ETH2 no longer supported and ETH2 balances no longer exist?",
            "url": "https://www.reddit.com/r/CoinBase/comments/v1b4t4/eth2_no_longer_supported_and_eth2_balances_no/",
            "author": "negups",
            "created_utc": 1653948325.0,
            "score": 2,
            "num_comments": 15,
            "subreddit": "CoinBase",
            "selftext": "For starters, this isn't another post complaining about how ETH2 is locked for trading/withdrawal on Coinbase. I'm in it for the long haul and am fine with that. In fact, I still regularly buy ETH and stake it as ETH2 on Coinbase. But therein lies the issue.\n\nWhen I went to stake some ETH as ETH2 on Coinbase today, I noticed that the option to do so was [nowhere to be found](https://i.imgur.com/TEFbpBu.jpg). I then went to my Assets page and found that ETH2 is no longer listed with the rest of the assets I hold. In addition, my total balance does not include any of the ETH2 amount I should have.\n\nIt was starting to look like any mention of ETH2 had been scrubbed from the system. However, I then noticed that on the ETH asset page, there is a button that says [\"Looking for Ethereum 2? Head over to the ETH2 page\"](https://i.imgur.com/P3ibjEJ.jpg). So, I tapped it and was successfully taken to the ETH2 asset page, which at least still exists.\n\nHere, I still see no ETH2 balance; instead, I see a message stating [\"This asset is not supported by Coinbase\", along with, confusingly, a button linking back to the ETH page I just came from, encouraging me to stake my ETH as ETH2 (\"Stake ETH, get ETH2. Head over to the ETH page\")](https://i.imgur.com/85w8n68.jpg), which, again, there seems to be no way to do.\n\nSo, my first question is, are others seeing this same behavior? And, if so, does anyone know what's going on? And, if not, ummmm... what is going on u/coinbasesupport?\n\nAs someone who has been around the block in the crypto community, this instinctively feels like a rug pull, which is all too common in the realm of crypto. However, the likelihood is virtually zero that a multi-billion dollar publicly traded company would be pulling the rug on its users, especially on only a fraction of the assets they control. But, still, I see no information/updates/news on either the Coinbase website, app, or status page, about ETH2 staking being disabled or ETH2 balances being unavailable temporarily or any bugs/upgrades/changes/maintenance that may have caused this unintentionally or otherwise.\n\nIn any case, it's pretty disconcerting for ETH2 balances to have vanished into thin air (or at least seeming like they have from my perspective as a user) without the slightest peep from Coinbase. While I'm confident Coinbase probably isn't stealing ETH2 assets, I'm less confident that they didn't lose them or have them stolen. Best case scenario, it's just the display of the asset balance that is temporarily broken or disabled for some reason, but that is *unquestionably* something that should be communicated prominently on the ETH2 asset page.\n\nFor what it's worth, I am seeing this behavior on both the Coinbase web app, as well as the latest version of the Coinbase Android app (which, by the way, is also colossally slow and unresponsive, even on a top-of-the-line S20 Ultra which has no problem running any other app - including older versions of the Coinbase app).\n\nAs an aside from someone who has worked in FinTech for a long time - from tiny startups to the largest investment banks - the **one** thing you absolutely *cannot* do as a custodian of financial assets is \"lose\" those assets, even if just by perception.\n\nWho would use a bank that occasionally thinks you have less money than you actually do? Even if that money is safe and can eventually be restored to the account, it's very unlikely that the user will be able to spend the \"missing\" money in the interim, which can result in serious long-term consequences for them (e.g., missing a mortgage/credit card/medical bill/utility/loan payment, etc., all of which will significantly impact their credit score for nearly a decade, making it much more difficult to buy/rent a home, get a loan, finance a car, etc.), in addition to just being majorly stressful.\n\nEven if there is a legitimate worst-case scenario that was outside of your control (e.g., the ACH network, which is what processes the majority of banking transactions in the US, is down), you'd at least, at the absolute bare minimum, let your customers know to temporarily expect disruptions to your service (and, ideally, have a mitigation plan in place to work around the issue). What you definitely wouldn't do is just remain silent and hope not too many of your customers notice.\n\nNo one would accept this behavior from their bank or brokerage, I see no reason why this is excusable for Coinbase just because they deal with crypto assets rather than fiat currency or stocks. (Short of me missing something painfully obvious, which is certainly a possibility, and I'll proudly wear the egg on my face if so.)",
            "stickied": false,
            "comments": [
                {
                    "id": "ialmyxk",
                    "author": "PsLJdogg",
                    "score": 5,
                    "created_utc": 1653952981.0,
                    "response": "ETH2 is still completely normal for me. Do you live in, or recently move to, New York by chance? I know ETH2 is not supported by Coinbase in Hawaii or New York.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iam2r87",
                            "author": "Taco-adventure-5150",
                            "score": 2,
                            "created_utc": 1653961116.0,
                            "response": "Same for me",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iamj7ir",
                            "author": "jmichelucci",
                            "score": 2,
                            "created_utc": 1653970218.0,
                            "response": "Works for me too",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ialpj4c",
                    "author": "fx9TMK",
                    "score": 2,
                    "created_utc": 1653954313.0,
                    "response": "That’s a really long scary post. Made me go check and my ETH2 is there. You sure the laws about crypto didn’t change in your area? Made it so you can’t get staking rewards?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iam9xm7",
                            "author": "jhanon76",
                            "score": 1,
                            "created_utc": 1653964825.0,
                            "response": "That was the point of the post...to scare people.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iancz69",
                                    "author": "fx9TMK",
                                    "score": 1,
                                    "created_utc": 1653994404.0,
                                    "response": "That was the point of my comment…… to say I was scared",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iam9v7m",
                    "author": "jhanon76",
                    "score": 2,
                    "created_utc": 1653964790.0,
                    "response": "Holy hell that was a long, winding, complaining article about a glitch.  Eth2 is still there.\n\nYou should have called Roy...",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ialj0rk",
                    "author": "Kiwip0rn",
                    "score": 0,
                    "created_utc": 1653950954.0,
                    "response": "🙄 okays...",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ialds5p",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653948326.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iandet7",
                    "author": "WECANalsoWe",
                    "score": 1,
                    "created_utc": 1653994726.0,
                    "response": "🔗 Welcome to $IBT ⛓\n\n🚨IBT Token Official Contract is here. When the launch day and time arrives, trading will begin.\n⚡️IBT CA: 0x9D3d5C13a4CcE652ef7bFAEE3378d2cd59fD37B3\n📅 UPCOMING LAUNCH DATE: June 3, 18:00 UTC 📅\n\n🟠 Join the TG : t.me/IBTProject\n\n⚙️ $IBT Smart Tokenomics ⚙️\n\n⛓ Total Supply: 1,000,000 $IBT\n⛓ 50% Burned Tokens\n⛓ 7% Staking\n⛓ 5% Comps & Giveaways\n⛓ 32% LP Listing\n⛓ 6% GameFi Development\n\n🕸SOCIAL NETWORKS 🕸\n🌍 Website 🗯 Telegram 🕊 Twitter  📣 Channel",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ialo8yj",
                    "author": "ConfidentKangaroo453",
                    "score": -2,
                    "created_utc": 1653953646.0,
                    "response": "Coinbase sucks. Wash your hands of them. They're dirty.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "v1b8sg",
            "title": "Any success restoring accounts? and/or money back from Coinbase in the UK? [Legal action?]",
            "url": "https://www.reddit.com/r/CoinBase/comments/v1b8sg/any_success_restoring_accounts_andor_money_back/",
            "author": "QuestofMiren",
            "created_utc": 1653948651.0,
            "score": 0,
            "num_comments": 9,
            "subreddit": "CoinBase",
            "selftext": "My story is like many others, account has been blocked for no reason, I haven't had access for almost a month now. Multiple phone calls, cases being opened and then closed without any assistance. Being told to wait because someone is looking into it, yet the cases are being closed. Just generally being lied to..\n\nAfter much more research it's come to my attention that this is a frequent occurrence. But I'm yet to find anyone that has successfully come out of this situation with everything intact other than a small number of people that have been fighting by emails and calls for 6 months to a year.\n\nSo i'm to assume that this is not something that will be resolved in the next week or two while the market it shifting and I would like to have bought more BTC with my USDC (weeks ago). I have zero reason to even believe that it will be resolved any time soon, even from coinbase themselves who give no timeframe, and beyond that, keep closing my cases.\n\nI can't go through the stress of going back and forth with coinbase and getting nowhere for the foreseeable future as I have conditions that will most likely come to the surface if I have to go through that stress. So I'm trying to get through this with more effective measures.\n\n&#x200B;\n\nHas anyone in the UK (and would be good to hear from anyone anywhere else also) been able to succeed against coinbase in some sort of compromise, demand, lawsuit, or claim.\n\n**Specifically with things like getting their account re-enabled when they haven't done anything against ToS in the first place.** \n\nTo either result in them getting their account back, or to succeed in at least getting their assets/money back.\n\n&#x200B;\n\nI would prefer to do this without an official lawsuit or going to court, I'd like to make all the steps before this last resort. If anyone has any advice on the steps I would appreciate it. (I've already read through coinbases complaint process, and I've made 2 official complains already, so I'm ready for the next steps beyond coinbases process)",
            "stickied": false,
            "comments": [
                {
                    "id": "ialjrzp",
                    "author": "AcademicMistake",
                    "score": 1,
                    "created_utc": 1653951340.0,
                    "response": "I have never waited more than 1 hour with gemini in UK no matter what i do, honestly never looked back since i left coinbase",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ialqyjc",
                            "author": "QuestofMiren",
                            "score": 1,
                            "created_utc": 1653955068.0,
                            "response": "Thanks, I will most likely switch over if I ever get this situation resolved",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ialefls",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653948652.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ian6spc",
                    "author": "Sea_Community5436",
                    "score": 1,
                    "created_utc": 1653989202.0,
                    "response": "/filter template\n$BOKAY Stealth Launch \n🔥🔥🔥🔥👌🏽👌🏽👌🏽👌🏽\n\nTG: https://t.me/burn_okay\n\nWeb: http://www.bokay.fun\n\nTwitter: https://twitter.com/burnokaytoken",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iandnun",
                    "author": "WECANalsoWe",
                    "score": 1,
                    "created_utc": 1653994910.0,
                    "response": "🔗 Welcome to $IBT ⛓\n\n🚨IBT Token Official Contract is here. When the launch day and time arrives, trading will begin.\n⚡️IBT CA: 0x9D3d5C13a4CcE652ef7bFAEE3378d2cd59fD37B3\n📅 UPCOMING LAUNCH DATE: June 3, 18:00 UTC 📅\n\n🟠 Join the TG : t.me/IBTProject\n\n⚙️ $IBT Smart Tokenomics ⚙️\n\n⛓ Total Supply: 1,000,000 $IBT\n⛓ 50% Burned Tokens\n⛓ 7% Staking\n⛓ 5% Comps & Giveaways\n⛓ 32% LP Listing\n⛓ 6% GameFi Development\n\n🕸SOCIAL NETWORKS 🕸\n🌍 Website 🗯 Telegram 🕊 Twitter  📣 Channel",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ialioe7",
                    "author": "Kiwip0rn",
                    "score": 0,
                    "created_utc": 1653950775.0,
                    "response": "You cannot be helped until you admit your ToS violations.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}