{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "v0djns",
            "title": "Extended withdrawal times",
            "url": "https://www.reddit.com/r/CoinBase/comments/v0djns/extended_withdrawal_times/",
            "author": "Justin__Time",
            "created_utc": 1653838115.0,
            "score": 8,
            "num_comments": 45,
            "subreddit": "CoinBase",
            "selftext": "Has anyone had any issues withdrawing from Coinbase? It used to be I could withdrawal crypto within 3-5 days. Now it says 9 days. I am going to try some other exchanges if this is the new normal.",
            "stickied": false,
            "comments": [
                {
                    "id": "iafy8wb",
                    "author": "gold4829",
                    "score": 5,
                    "created_utc": 1653841808.0,
                    "response": "Its an absolute joke now....Same BS.  I have seen as high as 14 days!  I am currently in 10 days.  Imagine that 1/3 of a month when these clowns pull the funds out of the bank either same day or next.  They are definitley making money with floating these deposits so long.  No frk reason for this.  Gemini has up to 5 days.  From my experience it will clear from 3 to 5 days on Gemini.  Not this 9,10 or 14 day crap from Coinbase.  \n\nThese clowns have completely ruined thier debit card from doing this BS.  Imagine you go to the store and want to buy something.  Nope got to wait 1/3 of a month to purchase!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iagkqav",
                            "author": "AcademicMistake",
                            "score": 3,
                            "created_utc": 1653852145.0,
                            "response": "gemini instant for me more or less",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iaglits",
                                    "author": "gold4829",
                                    "score": 0,
                                    "created_utc": 1653852519.0,
                                    "response": "how are you getting instant ach?   Are you paying for a debit or credit card fee to load?  To me I would never pay a fee to load or unload.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iagolqx",
                                            "author": "AcademicMistake",
                                            "score": 1,
                                            "created_utc": 1653853962.0,
                                            "response": "I just send a bank transfer straight from my bank to gemini and within a minute or so my balance updates, i can buy, send and do anything instantly, deposits of crypto as usual undergo confirmations but they are usually very quick.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iagq28x",
                                                    "author": "gold4829",
                                                    "score": 1,
                                                    "created_utc": 1653854653.0,
                                                    "response": "you must be across the pond then as your banking system is different than we have in US.  I know there is instant transfer here in US but it comes with a high fee.  I know coinbase offers it because when I do an ACH ramp off into my bank they try to get you to use that method.  \n\nHowever coinbase is super fast with ACH going out of them into your bank.  Im talking either within hours or the next very day.  Unfortunately that does not hold true with their super slow ACH ramp on.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "iagqf3g",
                                                    "author": "gold4829",
                                                    "score": 1,
                                                    "created_utc": 1653854818.0,
                                                    "response": "Oh let me rephrase that.   Yes you are correct, I can do the same ACH into gemini instant.  However they do have the 5 days hold time to take it off platform.   Its Coinbase thats the problem with long hold times.  \n\nIm really thinking of ACH into gemini, then wait the 5 days, then sent it to coinbase to load debit card.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "iafyx2a",
                            "author": "Justin__Time",
                            "score": 1,
                            "created_utc": 1653842108.0,
                            "response": "Agreed. Absolutely ridiculous. Definitely going to look elsewhere. I may try Kraken or Gemini. Not sure how those one fair in comparison. Should only be limited by the speed of ACH transfer.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iag9icq",
                    "author": "gslice",
                    "score": 2,
                    "created_utc": 1653846919.0,
                    "response": "Yup. My ACH deposits were available to send “instantly “\n\nNow (with no failed deposits) I have to wait 7 days. Sometimes it says 10 sometimes 6??? Already moved over to Gemini with my debit card. 24h wait.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iag3pw4",
                    "author": "cryptosperm",
                    "score": 2,
                    "created_utc": 1653844268.0,
                    "response": "Maybe the Holiday is partially to blame since banks are closed.  The network probably gets backed up with people trying to move money with banks before the break.  Then after the break it is catchup.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iagj6mk",
                    "author": "TheCrustyCurmudgeon",
                    "score": 1,
                    "created_utc": 1653851427.0,
                    "response": "pretty sure this is controlled by your bank, not coinbase.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iai8pu3",
                            "author": "a2zsportsfreak",
                            "score": 1,
                            "created_utc": 1653882572.0,
                            "response": "Its not, it came out of my bank the same day and my waiting period is 15 days.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iafpx38",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653838115.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iah1jfb",
                    "author": "AmericanScream",
                    "score": 1,
                    "created_utc": 1653860260.0,
                    "response": "Wait until it becomes ∞ days.   That's coming soon.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iah1u1b",
                    "author": "clloud002",
                    "score": 1,
                    "created_utc": 1653860407.0,
                    "response": "I tried transferring my BTC to another exchange after I heard that Coinbase would take my assets if they filed bankruptcy. For some reason it says I have zero BTC after I try to transfer it when the balance clearly has funds.  What happened??",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iahd44z",
                            "author": "tahanks4",
                            "score": 1,
                            "created_utc": 1653866159.0,
                            "response": "You likely have a pending balance on just a portion of your total there should be an available balance you can check.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iah6qze",
                    "author": "stevennguyen907",
                    "score": 1,
                    "created_utc": 1653862863.0,
                    "response": "Yes. Out of no where Coinbase decides to hold funds for random days 5,7,9,15 you name it. We can buy crypto but cannot withdraw it to another wallet or anything like that. Have had years of good payment history with Coinbase using the same bank and yet I get this. Sadly Coinbase is going away for me. Trying other exchanges.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iajsdvk",
                            "author": "Character_Jelly3797",
                            "score": 1,
                            "created_utc": 1653921840.0,
                            "response": "Same as soon as I can pull everything",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iahct2j",
                    "author": "tahanks4",
                    "score": 1,
                    "created_utc": 1653865996.0,
                    "response": "I'm in the US and coinbase takes 6 days consistently for my ach transfers to clear. Coinbase releases funds same time each day around 4 central time for me.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iahhppt",
                    "author": "Independent_Boot_314",
                    "score": 1,
                    "created_utc": 1653868586.0,
                    "response": " I’m having issues with them as well. Funds used to be available asap now it’s 7 days. Not receiving my rewards from tezos and 4% cash back from Coinbase Visa card either.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iahibph",
                            "author": "coinbasesupport",
                            "score": 1,
                            "created_utc": 1653868914.0,
                            "response": "Hi, u/Independent_Boot_314! We'd like to be of assistance here. Please raise a support ticket with us from the below link, and an agent will be able to assist you! Thanks!\n\nhttps://help.coinbase.com/en/contact-us",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iahvsek",
                    "author": "Haven_on_earth",
                    "score": 1,
                    "created_utc": 1653875924.0,
                    "response": "Yes I had to wait 10 business days to pay with my debit card, pretty embarrassing when you get your debit card transanction denied at the cashier ...",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iai8kfj",
                    "author": "a2zsportsfreak",
                    "score": 1,
                    "created_utc": 1653882488.0,
                    "response": "My limit was lowered from 1k a day to 250 a day and my waiting period from 5 days out to 15 days. What a joke coinbase is. It came right out of my checking account the same day too. Scumbags. Once I get this little bit off here I'm changing exchanges. Any recommendations?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaibmyu",
                    "author": "Creepy-Importance-13",
                    "score": 1,
                    "created_utc": 1653884270.0,
                    "response": "Just listen to me get out while you can",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaicdio",
                    "author": "ShaftedNun",
                    "score": 1,
                    "created_utc": 1653884724.0,
                    "response": "If you guys are just buying BTC or ETH just go to interactive brokers. Zero issues and reputable.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iak0x0i",
                    "author": "dfk814",
                    "score": 1,
                    "created_utc": 1653925753.0,
                    "response": "The only way you can immediately withdraw from Coinbase is as a criminal.  Sign up for a criminal account and Coinbase will transfer your money immediately, and there you go!  \n\nI would imagine the withdrawal fees are a little steep, but Brian Armstrong needs his cut.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iak4k8e",
                    "author": "IlArkitekt",
                    "score": 1,
                    "created_utc": 1653927372.0,
                    "response": "I've been getting around that Coinbase funds clearing hold. I'm using the Strike wallet on my phone. I've got it connected to my debit card I use for my dedicated crypto checking account. I can do a debit card transfer up to $1,000 a week, buy BTC in a few seconds, and then send it out to my coinbase wallet where I can trade. I can then send it out of Coinbase. Zero holds. The only limit is that thousand a week which I think you can get that increased. I haven't had any holds for months.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iakmxr8",
                    "author": "gonezow",
                    "score": 1,
                    "created_utc": 1653935535.0,
                    "response": "yup used to get 1K instant ACH on CB, as of today now 8 days. No notice that terms have changed before buy, not very nice.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iakyja7",
                    "author": "Abasooo",
                    "score": 1,
                    "created_utc": 1653940948.0,
                    "response": "METALSHIBA \n\n- Partnerships confirmed with knightswap, gempad, the royals and A11 ventures\n- 400 BNB hardcap\n- Experienced team\n- NFT Launchpad\n-NFT Marketplace\n-Comic art\n-DAO\n\nTG: t.me/metalshibainu",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iagc4lx",
                    "author": "MadThad762",
                    "score": 0,
                    "created_utc": 1653848129.0,
                    "response": "I have this problem too. Not long ago I could deposit funds and spend them using the card immediately. Now I have to wait 7 days. It makes the card inconvenient to use.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iagei4v",
                            "author": "coinbasesupport",
                            "score": 0,
                            "created_utc": 1653849242.0,
                            "response": "Hey u/MadThad762 - sorry for any inconvenience. Understand wanting to use the card on the fly.\n\nIf you use a linked bank account as a payment method to deposit funds to your Coinbase cash wallet or to purchase cryptocurrency, these funds are immediately available for buying and selling on Coinbase. You can see when deposited funds will be available for withdrawal or spending prior to authorizing a purchase or deposit, as well as on the confirmation email for the transaction.\n\nIf you would like to change the funding method, go to the Pay tab, then select Coinbase Card > Paying with.\n - Choose Select asset, then choose the crypto that you’d like to pay with.\n\nYou can automatically top-up your card by setting up recurring buys for the asset you choose to fund with as well.\n\nHope this helps Thad, many thanks!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}