{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uxme61",
            "title": "Any other crypto exchange?",
            "url": "https://www.reddit.com/r/CoinBase/comments/uxme61/any_other_crypto_exchange/",
            "author": "Miramilenium",
            "created_utc": 1653499528.0,
            "score": 0,
            "num_comments": 15,
            "subreddit": "CoinBase",
            "selftext": "I’ve been on Coinbase for over four years. They are saying how my identity information is not correct. There’s no way I can re-verify my ID because the links they send me keep going in circles. Is there any other crypto exchange where you can safely trade and withdraw your funds? (Just not Kucoin please)\nWhat are the best decentralized exchanges?",
            "stickied": false,
            "comments": [
                {
                    "id": "i9ysx5s",
                    "author": "Kiwip0rn",
                    "score": 5,
                    "created_utc": 1653502940.0,
                    "response": "Nope. 🤷‍♀️",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ytgcg",
                    "author": "jhanon76",
                    "score": 2,
                    "created_utc": 1653503147.0,
                    "response": "Binance, Kucoin, Coinbase...you've successfully gotten yourself \"scammed\" on all of them.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9zjo30",
                            "author": "Miramilenium",
                            "score": -2,
                            "created_utc": 1653513783.0,
                            "response": "My Binance  issue is solved. For your information, once you get hacked, they have all your information from your phone number, email, mailing address and IP . My phone number was stolen too. All thanks to kucoin leak. That’s how they got into Binance where they locked my account once I warned them. \nI have nothing to say to you but to wish you the same, so you can experience it yourself. Then you will probably shut up.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia05aoa",
                                    "author": "jhanon76",
                                    "score": 6,
                                    "created_utc": 1653523634.0,
                                    "response": "Bro you got phished not hacked.  You posted a million times that you got hacked but redditors kept trying to explain what happened and you didn't listen.\n\nBlocked me...nice...best way to keep me from calling out your BS again.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia11m44",
                                            "author": "Miramilenium",
                                            "score": 1,
                                            "created_utc": 1653539817.0,
                                            "response": "My coinbase account was not hacked nor phished. You missed the point, so please find something better to do.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9yu47k",
                    "author": "ocstallion",
                    "score": 0,
                    "created_utc": 1653503408.0,
                    "response": "Not sure why you'd replace Coinbase with a dex, but Osmosis zone is the shit",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9za9sp",
                    "author": "Arzharkhel",
                    "score": 0,
                    "created_utc": 1653509879.0,
                    "response": "I use FTX US and I'm very happy with them.  The only drawback with them is that their crypto selection is pretty limited.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia1ov4c",
                            "author": "dipp1011",
                            "score": 1,
                            "created_utc": 1653558723.0,
                            "response": "I know someone who wants to convert over 140 usd in fist to crypto. He has a fully verified ftx account but he’s scared of the horror stories he hears about accounts with funds getting frozen. \nI personally dealt with coinbase and their bullshit and I can say it’s not a funny experience.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9yk7su",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653499528.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}