{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "up9h19",
            "title": "Algo rewards",
            "url": "https://www.reddit.com/r/CoinBase/comments/up9h19/algo_rewards/",
            "author": "Trololoumadbro",
            "created_utc": 1652502618.0,
            "score": 10,
            "num_comments": 27,
            "subreddit": "CoinBase",
            "selftext": "For everyone who was so up-in-arms over the apparent reduction in Algo rewards on CB during the switch to the governance model, and for those of you who stuck it out despite the FUD... go check it out on CB now...\n\n>!5.75%!<",
            "stickied": false,
            "comments": [
                {
                    "id": "i8ju2b1",
                    "author": "GhostOfMcAfee",
                    "score": 6,
                    "created_utc": 1652511148.0,
                    "response": "It probably has something to do with #weALGOoffexchanges",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uoyn1v",
            "title": "Problem Resolved - Customer Service Did Well - Just didn't want to post negative news.",
            "url": "https://www.reddit.com/r/CoinBase/comments/uoyn1v/problem_resolved_customer_service_did_well_just/",
            "author": "maryupallnight",
            "created_utc": 1652468089.0,
            "score": 10,
            "num_comments": 13,
            "subreddit": "CoinBase",
            "selftext": "https://www.reddit.com/r/CoinBase/comments/uodg5i/coinbase_must_provide_photo_selfi_address_again/\n\nI posted the above.   Today I was on the phone for 1 hour and explained the situation.   Frustrating yes, but this is the world we live in  with KYC.\n\nNote - don't get mad or frustrated with the person on the other end of the phone.  They want to help.\n\nAlso, a moderator here reached out to me.  I don't know if that helped.\n\nThe point is this is not just about CB - this is the new world.\n\nNow, I put in a limit sell - hoping to get the price I want 2 cents above spot.",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uou9q6",
            "title": "Is anyone else unable to send their crypto away from coinbase to a different address? I do the whole process with 2FA and all, but at the end it doesn't send anything. No notification or something like it either.",
            "url": "https://www.reddit.com/r/CoinBase/comments/uou9q6/is_anyone_else_unable_to_send_their_crypto_away/",
            "author": "SpookySnicker",
            "created_utc": 1652455713.0,
            "score": 13,
            "num_comments": 51,
            "subreddit": "CoinBase",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uovhaw",
            "title": "Scam? Scam bait? Safe?",
            "url": "https://www.reddit.com/r/CoinBase/comments/uovhaw/scam_scam_bait_safe/",
            "author": "Aysher",
            "created_utc": 1652459048.0,
            "score": 6,
            "num_comments": 27,
            "subreddit": "CoinBase",
            "selftext": "I received an e-mail from Coinbase asking me to verify my account. I didn’t create an account.\n\nGoogled the site and tried the “forgot password” option. It did, indeed, send me the e-mail and it was addressed to Michael Smith. That is 100% not my name.\n\nI immediately changed the password to the Coinbase account and to my e-mail. Now when I go to Coinbase to try to log in, I do the captcha and then get stuck in an infinite redirect loop.\n\nWhat’s going on? Did Michael Smith type my e-mail by mistake? Has logging into the site given anyone access to my device? Any other action I can take? I assume I can’t delete or deactivate the account (I’m not interested in having one) without logging into it, but I’m concerned the whole thing is scammy or virus-y.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8h6lhp",
                    "author": "DuraffGH",
                    "score": 3,
                    "created_utc": 1652463200.0,
                    "response": "The same just happened to me",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uondhu",
            "title": "15,000 USDT lost in KCC transfer (KuCoin to Coinbase) Urgent help needed",
            "url": "https://www.reddit.com/r/CoinBase/comments/uondhu/15000_usdt_lost_in_kcc_transfer_kucoin_to/",
            "author": "iAddio",
            "created_utc": 1652431948.0,
            "score": 10,
            "num_comments": 47,
            "subreddit": "CoinBase",
            "selftext": "As in the description, a seemingly major mistake has been made.\n\nWith the Luna collapse and USDT looking like it was starting to depeg, I wanted to move my USDT to USD therefore I made the transfer from KuCoin to Coinbase and in doing so, selected KCC as this had the cheapest fees.\n\nI found a thread from around 9 months ago where many people had also made this mistake and lost 10's if not 100's of thousands of dollars. \n\nI've spoken to Coinbase support and they've said 'it's probable that you won't retrieve the funds' \n\nIs this seriously true? There is nothing they can do about it Is this still the stance they are taking as a company? \n\nThere was talk of a class action lawsuit in the thread I found for people to have their funds returned. Is this happening? \n\nThis is not money I can afford to lose. It wasn't invested, that's why I was keeping it in USDT. \n\nAny help would be greatly appreciated at this point. \n\nThanks,   \nA",
            "stickied": false,
            "comments": [
                {
                    "id": "i8fht4s",
                    "author": "Rad_Herring",
                    "score": 35,
                    "created_utc": 1652432747.0,
                    "response": "Always send a small test transfer when you're about to move a lot of funds.\n\nThat way you would have only said goodbye to that small amount, but now you've instead said goodbye to all of it.\n\nYou won't make that mistake again.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8fty5e",
                            "author": "LosinCash",
                            "score": 13,
                            "created_utc": 1652442001.0,
                            "response": "How is this not standard practice? I always transfer a minimum then break the large amount into quarter chunks. Seeing posts like this boggles my mind.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8fwfdp",
                                    "author": "Rad_Herring",
                                    "score": 6,
                                    "created_utc": 1652443443.0,
                                    "response": "And putting more than he can afford to lose into crypto in the first place, as if it's a fiat bank account!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8fogfs",
                    "author": "Rad_Herring",
                    "score": 16,
                    "created_utc": 1652438310.0,
                    "response": "By the way, it's not a Coinbase issue, its a KuCoin issue.\n\n\"This is not money I can afford to lose. It wasn't invested, that's why I was keeping it in USDT\"\n\nYou realise USDT isn't money, it's crypto, right? Just because it's price is pegged to the dollar doesn't mean it carries any less risk than any other coin. \n\n You've put more than you can afford to lose into a crypto that temporarily failed, and now you've lost it all through a combination of those temp issues with the crypto, and then user error. Mostly user error.\n\nDo not put any money in crypto that you can't afford to lose. That doesn't mean only put money in stable coins.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8gd66z",
                    "author": "Tall_Run_2814",
                    "score": 12,
                    "created_utc": 1652451448.0,
                    "response": "All crypto must be sent and received on the same network.  Coinbase does not have access to the KCC network.  In addition, when you retrieved the deposit address from Coinbase a warning is displayed clearly stating to only send on the ethereum network.  \n\nYou risked $15,000 trying to save $25.  This is in no way Coinbase's fault.  \n\nCrypto exchanges are not banks, and there is no insurance for your funds.  You have to be careful and verify each step.  Sorry for your loss",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8fkhe1",
                    "author": "druglover17",
                    "score": 9,
                    "created_utc": 1652435087.0,
                    "response": "Its lost forever. Sorry man.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8fockn",
                    "author": "fx9TMK",
                    "score": 7,
                    "created_utc": 1652438227.0,
                    "response": "When you click to receive USDT on coinbase, it tells you first to only send it using erc-20 network. Like others have said, should’ve done a test transaction and should’ve done a little research. It was an expensive lesson, can’t blame anyone else but yourself. Also, all those lawsuits are just people talking big but they never did anything, especially since they were in the wrong",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8fja47",
                    "author": "unvieledloki",
                    "score": 7,
                    "created_utc": 1652434044.0,
                    "response": "yep, cb will not recover crypto sent on wrong networks or sent to wrong address",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8g4y6a",
                    "author": "gingerballs45",
                    "score": 4,
                    "created_utc": 1652447802.0,
                    "response": "I just want to say I’m proud to see how far the knowledge of everyone on this sub has come. Used to, these posts would be filled with people not understanding, now everyone understands and gives the same answer with a general consensus on how it works.\n\nI don’t know if you’ll get your crypto back, but they do have it and I’m sure they are aware of this issue.\n\nhttps://help.coinbase.com/en/coinbase/trading-and-funding/sending-or-receiving-cryptocurrency/unsupported-crypto-recovery",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uoj4so",
            "title": "Coinbase always happens to crash during crucial moments",
            "url": "https://www.reddit.com/r/CoinBase/comments/uoj4so/coinbase_always_happens_to_crash_during_crucial/",
            "author": "No_Fishing9589",
            "created_utc": 1652414213.0,
            "score": 23,
            "num_comments": 39,
            "subreddit": "CoinBase",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8fp4zs",
                    "author": "Rad_Herring",
                    "score": 6,
                    "created_utc": 1652438812.0,
                    "response": "Of course. When there are \"crucial moments\" the system is being hammered by everyone well above normal load and bandwidth.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8escqj",
                    "author": "Kiwip0rn",
                    "score": 7,
                    "created_utc": 1652414352.0,
                    "response": "🙄👌 I am up and running just fine all day.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uonqew",
            "title": "cant buy and i dont know why?",
            "url": "https://www.reddit.com/r/CoinBase/comments/uonqew/cant_buy_and_i_dont_know_why/",
            "author": "justlurkingmanfukoff",
            "created_utc": 1652433565.0,
            "score": 5,
            "num_comments": 24,
            "subreddit": "CoinBase",
            "selftext": "i just tried buying more of the coins i have on coinbase, but i cant get past the window where i choose the amount bc it says 'not found' and won't let me proceed further\n\nhowever i did successfully buy a different coin via my coinbase wallet, same card, same everything\ndoes anyone know why i have this problem and can help me with it?",
            "stickied": false,
            "comments": [
                {
                    "id": "i8fmy24",
                    "author": "Sharkweekbravo",
                    "score": 3,
                    "created_utc": 1652437153.0,
                    "response": "You're a poet and didn't know it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8fis97",
                    "author": "Rad_Herring",
                    "score": 3,
                    "created_utc": 1652433607.0,
                    "response": "coinbase gone broke",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uonzyc",
            "title": "coinbase wallet",
            "url": "https://www.reddit.com/r/CoinBase/comments/uonzyc/coinbase_wallet/",
            "author": "Old_Degree_9325",
            "created_utc": 1652434772.0,
            "score": 4,
            "num_comments": 14,
            "subreddit": "CoinBase",
            "selftext": "IS Putting your crypto in coinbase wallet the same as leaving in on the exchange?  The wallet has a 12 word phrase so I'm assuming it's a hot wallet removed from the exchange. Am I correct or should I use a different wallet?  Thanks.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8gcfl7",
                    "author": "MosDaddyda",
                    "score": 3,
                    "created_utc": 1652451133.0,
                    "response": "The Coinbase wallet is ERC20 so you can use your seed to import it into MetaMask or any ERC20 wallet if the Coinbase wallet app had issues.  The coins are on chain and under your control as long as you have your seed.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uonv3h",
            "title": "coinbase unable to charge back an unauthorized transaction on my card...",
            "url": "https://www.reddit.com/r/CoinBase/comments/uonv3h/coinbase_unable_to_charge_back_an_unauthorized/",
            "author": "Top_Bluebird3539",
            "created_utc": 1652434143.0,
            "score": 4,
            "num_comments": 16,
            "subreddit": "CoinBase",
            "selftext": "Somebody used my card and coinbase wasn't able to get my money back... wtf? I've had this happen about five years ago on my bank of america card and got my money back without question.\n\nHere's the email response I received:\n\n\"We've completed our investigation of your dispute for the transaction of $54.05 made on 5/5/2022, 9:58 UTC at SORARE.COM.\n\nUnfortunately, the chargeback was rejected by the network for the following reason :\n- Cannot initiate chargeback on a verified VISA transaction.\n\nAs a result, we will be closing your claim.\n\nRegards,\nCoinbase Support\"\n\nSeriously????",
            "stickied": false,
            "comments": [
                {
                    "id": "i8g8oxs",
                    "author": "jhanon76",
                    "score": 3,
                    "created_utc": 1652449509.0,
                    "response": "CB is used to buy crypto which you can then store in a wallet.  Anything else is just pure risk",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8fw8vq",
                    "author": "gold4829",
                    "score": 4,
                    "created_utc": 1652443340.0,
                    "response": "Dont accept that BS.  File a complaint with CFPB against their bank Metabank and one against Coinbase and you will get it reversed.  This fed agency is gold as I have used them myself.  Completely free and it works.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uo5v3h",
            "title": "Coinbase servers down?",
            "url": "https://www.reddit.com/r/CoinBase/comments/uo5v3h/coinbase_servers_down/",
            "author": "Standard_Confusion99",
            "created_utc": 1652375208.0,
            "score": 53,
            "num_comments": 105,
            "subreddit": "CoinBase",
            "selftext": "Have not been able to log into Coinbase or Coinbase Pro via website or app. Has the bear market crashed their servers? Anyone else experiencing this? Pretty frightening if someone wants to make a fast trade.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8cdfyf",
                    "author": "Standard_Confusion99",
                    "score": 19,
                    "created_utc": 1652376534.0,
                    "response": "Imagine Fidelity or Schwab, etc. being down when you want to sell a falling stock. Unacceptable.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8cx6hz",
                            "author": "DUXICON",
                            "score": 3,
                            "created_utc": 1652384343.0,
                            "response": "lol right? it's definitely happened, but nowhere nearly as often as coinbase.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8carh9",
                    "author": "mjacovino",
                    "score": 37,
                    "created_utc": 1652375464.0,
                    "response": "of course. Coinbase exchange down at another critical time.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8d6qwi",
                            "author": "t0gnar",
                            "score": 7,
                            "created_utc": 1652388055.0,
                            "response": "Yeah sorry it was me. I sent money to buy the dip…",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8dl7d3",
                                    "author": "YaBastaaa",
                                    "score": 3,
                                    "created_utc": 1652394085.0,
                                    "response": "I thought it was Putin,  buying and selling on coinbase 😂",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8ccwg1",
                    "author": "scottdarkmass",
                    "score": 7,
                    "created_utc": 1652376316.0,
                    "response": "same here. CANNOT LOG IN TO COINBASE\n\nshady crap and unacceptable \n\nits like a bank closing their doors during a bankrun\n\nare you telling me when markets are crashing and volatility is at its greatest that Coinbase cannot be trusted?\n\nbetween the stock down >80& and gov agencies looking for reasons to intervene. this is an abject failure.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8caers",
                    "author": "DarnPeaches",
                    "score": 6,
                    "created_utc": 1652375324.0,
                    "response": "I'm running into the same issues on mobile and PC. Ugh. This is not looking good.\n\nEdit: looks like the status page is also down",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8cag2c",
                    "author": "MarleyLo",
                    "score": 5,
                    "created_utc": 1652375338.0,
                    "response": "Yeah same here. Can't access it",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8cal1z",
                    "author": "babybeark",
                    "score": 5,
                    "created_utc": 1652375393.0,
                    "response": "Same here",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8cannf",
                    "author": "betweenthebars34",
                    "score": 4,
                    "created_utc": 1652375421.0,
                    "response": "Yup, can't access at all",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8cbhf1",
                    "author": "Intense4Life",
                    "score": 3,
                    "created_utc": 1652375753.0,
                    "response": "yup, can't access on iOS right now. Classic tech scums. Everyone wants to be the star of tech until shit gets real.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ch0ip",
                    "author": "bgboy600",
                    "score": 12,
                    "created_utc": 1652377959.0,
                    "response": "yall used to cry about robinhood 😆 🤣",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8cpc9n",
                            "author": "Slamdunkdink",
                            "score": 3,
                            "created_utc": 1652381296.0,
                            "response": "I think robinhood was the canary in the coal mine.  People should have paid attention.  But of course they didn't.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8ceqg8",
                    "author": "CalligrapherFar749",
                    "score": 7,
                    "created_utc": 1652377052.0,
                    "response": "I’m logged in with no problem",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uo6tuo",
            "title": "Can’t get assets off of Coinbase",
            "url": "https://www.reddit.com/r/CoinBase/comments/uo6tuo/cant_get_assets_off_of_coinbase/",
            "author": "ghostybot",
            "created_utc": 1652377861.0,
            "score": 23,
            "num_comments": 47,
            "subreddit": "CoinBase",
            "selftext": "Anyone else not able to get their assets of Coinbase? I have tried several times and those coins aren’t moving.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8cto1d",
                    "author": "djdonte",
                    "score": 3,
                    "created_utc": 1652383015.0,
                    "response": "I tried to move a few grand of BTC just now and they “delayed” the send for exactly three days. They claim if I verify my ID I can send it instantly. I tried and every time it hangs up or it says the info on my ID doesn’t match which ain’t true. It’s the same ID I gave them when I opened my account.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8d585y",
                            "author": "JonWick33",
                            "score": 3,
                            "created_utc": 1652387450.0,
                            "response": "When that happened to me out of the blue a couple months ago I ended up having to wait like 20 days. It said 3 days but thats not how it happened.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8d6138",
                                    "author": "djdonte",
                                    "score": 3,
                                    "created_utc": 1652387772.0,
                                    "response": "After about 10 trys it sent me an email saying my ID was verified and the funds got transferred.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8cqse2",
                    "author": "TomInSilverlake",
                    "score": 3,
                    "created_utc": 1652381882.0,
                    "response": "I have been trying to transfer BTC to a wallet and it just keeps timing out....",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8cj4e5",
                    "author": "K_Decibel",
                    "score": 5,
                    "created_utc": 1652378800.0,
                    "response": "I just got mine off. The network is clogged with transactions so they are taking longer than usual.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uo22vc",
            "title": "Account Disabled- Insane list of documents requested",
            "url": "https://www.reddit.com/r/CoinBase/comments/uo22vc/account_disabled_insane_list_of_documents/",
            "author": "PrudentStyle7591",
            "created_utc": 1652364918.0,
            "score": 46,
            "num_comments": 86,
            "subreddit": "CoinBase",
            "selftext": "I had been using Coinbase fine for months mostly as an offramp. I tried to move .05 bitcoin out to another wallet as a test transfer. Was sent an email that said I can either KYC (again) or just wait a few days for the transfer to go through. I just waited since I already did the KYC and dont really like following links from emails. \n\nFast forward a week or so and my account is now blocked (no withdrawal or trading). Mind you this was in April before this big crash. I contact coinbase and kyc again and start to interact with their completely powerless online/phone customer service and they just tell me to wait for email reply. I have followed up probably 15 times with no response. \n\nWell today I got an email that tells me because I never responded the case is closed and the list of documents they want to reopen my account is insane. \n\n\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\n\n\"Please provide the following information by replying directly to this email and uploading the corresponding documents.  \n \n\n1. Please provide additional details around your current or previous occupation/any businesses you own/are involved in. Please also provide supporting documentation, eg. a payslip issued within the last 3 months or a letter from your Human Resources department confirming your employment.  \n 2. Please confirm the source of funds deposited into your Coinbase account and provide us with supporting documentation, (e.g. a payslip, statements from other exchanges, loan agreement, credit card statements, screenshot of transactions from an unhosted wallet).  \n 3. Please confirm the primary source(s) through which your overall wealth/net worth was generated and provide us with supporting documentation (e.g., a pay slip; brokerage/investment statement; home sale document, probate or conveyancing document, copy of Will, Grant of Probate, Gift Letter etc). If your source of wealth originated from investing in crypto or other investments, please provide additional supporting documentation showing the initial investments resulting in your wealth.  \n 4. Please provide us with 12 months worth of bank statements, issued within the last 13 months.\"\n\n\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~  \n   \n  This is all just insane and I have quite a substantial amount of money trapped inside and I have found no way to actually speak to anyone that has any power to do anything. Just feels like straight up fraud.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8bmsc0",
                    "author": "hyutslut331",
                    "score": 13,
                    "created_utc": 1652366086.0,
                    "response": "I got the same message!! Similar timing, I tried to move my money out like a month ago and now my account is deactivated.\n\nI don’t have these documents and coinbase is holding my $20,000 worth if btc hostage it seems. \n\nIf I can get any of my money out to another platform I’ll consider it a win. Fuck coinbase",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8boik6",
                            "author": "PrudentStyle7591",
                            "score": 7,
                            "created_utc": 1652366766.0,
                            "response": "Its the worst. And its a terrible design to have this all done by email. I never had any type of alert or notification on the actual site itself. In this day and age I dont trust random links that send me requests for the most personal of documentation.  \n\nPeople wonder how people get scammed or defrauded but an email link asking me to upload all my personal data/financial history with nothing on the main page itself to verify?!\n\nIt absolutely is designed to hold funds hostage and I have even more than you stuck in. Just a nightmare.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8c5kxa",
                    "author": "evilgold",
                    "score": 6,
                    "created_utc": 1652373435.0,
                    "response": "I say it sure is good that we have these well regulated exchanges like coinbase to stop all those evil people trying to withdraw their money without first proving that they are innocent of money laundering. Sorry to say it fella but if they're asking for that info then you MUST be a criminal, because there is no other reason for them to need verification of your sources of income, it must be drug money, or sex trafficing... I mean if its NOT from crimes then obviously you have nothing to hide and can submit all that info and trust coinbase to keep it safe and secure for all of time right? RIGHT?\n\n/s",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8c1lbw",
                    "author": "meshreplacer",
                    "score": 3,
                    "created_utc": 1652371884.0,
                    "response": "I suspect they are adding these barriers to prevent a run on the bank and cause a liquidity issue.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8bxt54",
                    "author": "Rad_Herring",
                    "score": 9,
                    "created_utc": 1652370416.0,
                    "response": "It's a bank run. Coinbase is fabricating reasons for you to keep money on their exchange while there's a mass exodus in progress and the share price is slamming down. It hit $41 earlier today, down from $360 just 6 months ago.\n\nOf course they're not letting you take your money off, they're becoming insolvent.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8cg40w",
                            "author": "BroodingToiletLicker",
                            "score": 6,
                            "created_utc": 1652377604.0,
                            "response": "Insolvent? I don’t think you know what that means. A company doesn’t become insolvent because their stock price is going down. It becomes insolvent when they are unable to service their debt or their operating expenses vastly exceeds their revenue (but even then, many companies can operate for many years at a loss or can make many cuts to their operating expenses relatively quickly). The biggest risk is an inability to service debt. \n\nA quick look at their financial statements shows they had revenues of over $1 billion but only owed $22m in interest. They posted a $430m loss in Q1 but they also had a non-recurring expense on R&D of $600m for their (really stupid) NFT platform. \n\nThey aren’t becoming insolvent and looking at their balance sheet shows they’re able to cover their liabilities (people’s deposits). Unless you’re accusing them of fabricating their financial statements (a pretty serious crime for a public company), they’re very far from insolvency.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8e3z5h",
                            "author": "chad711m",
                            "score": 4,
                            "created_utc": 1652402669.0,
                            "response": "Insolvent lol! Reality check dude. One co-founder has a networth over 700 million. The company has been profitable since day 1. The stock price is being shorted atm and the market as a whole is bearish. Smart people are buying the dip not cutting their losses.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "uo3o24",
            "title": "Coinbase's losses show crypto investors moving to decentralised exchanges",
            "url": "https://uk.finance.yahoo.com/news/coinbase-losses-crypto-investors-decentralised-exchanges-094830978.html",
            "author": "Rad_Herring",
            "created_utc": 1652369260.0,
            "score": 31,
            "num_comments": 23,
            "subreddit": "CoinBase",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8d1ghw",
                    "author": "otherwisemilk",
                    "score": 5,
                    "created_utc": 1652385971.0,
                    "response": "At this point I dont even want Coinbase to list Nano. Bullet dodged*",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uo9bkr",
            "title": "Coinbase Says Some Customers Are Having Issues Accessing Accounts",
            "url": "https://maxbit.cc/coinbase-says-some-customers-are-having-issues-accessing-accounts/",
            "author": "bitdex",
            "created_utc": 1652384649.0,
            "score": 10,
            "num_comments": 20,
            "subreddit": "CoinBase",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8d0vvy",
                    "author": "Chazmer87",
                    "score": 4,
                    "created_utc": 1652385748.0,
                    "response": "Dun dun dun",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uodg5i",
            "title": "COINBASE - Must provide PHOTO, Selfi & address again even if you did KYC - Notified 20 minutes after I deposit coins and put in sell order; called, got disconnected, not call bac, called again, said I would be contacted, no, HELP! - Don't be like me - contact Coinbase and ask to provide your info",
            "url": "https://www.reddit.com/r/CoinBase/comments/uodg5i/coinbase_must_provide_photo_selfi_address_again/",
            "author": "maryupallnight",
            "created_utc": 1652395727.0,
            "score": 5,
            "num_comments": 30,
            "subreddit": "CoinBase",
            "selftext": "I did all the KYC in April on 2021.\n\n\nJust today - I transferred in $1,000 in coins,  I put in a sell order.\n\n\n10 minutes after putting in the sell order, I got an email saying my trading has been suspended \n\n\nI called customer service and told them the above.  The person said they would work with me over the phone and authorize everything if I do the KYC.\n\nI did my best - we got disconnected - no call back.\n\nI call customer service and try again.  I'm told someone will call me back - so far 1 hour no call back.\n\nThis is suspicious - deposit coins, then email saying must do KYC.\n\nHELP!!!!!!!!!!!!!!!!!!!!!!!\n\nReaders - contact Coinbase and tell them you want to do your NEW KYC before having your trading account suspended.",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uoamtd",
            "title": "Trying to take my Loops off Coinbase, but I keep getting a message saying I need to “top up.” How do I get past this?",
            "url": "https://www.reddit.com/r/CoinBase/comments/uoamtd/trying_to_take_my_loops_off_coinbase_but_i_keep/",
            "author": "ablonde_moment",
            "created_utc": 1652388211.0,
            "score": 4,
            "num_comments": 19,
            "subreddit": "CoinBase",
            "selftext": "I see that some ppl have been having issues sending assets off Coinbase, but that hasn’t been a issue for me. What is a problem, though, is this weird message I’m getting saying I need to “top up” and purchase a small amount of LRC to continue. I did that, and I got the message again. For context, I’m only trying to send about $20. \n\nDoes anyone know how I get past this message?",
            "stickied": false,
            "comments": []
        },
        {
            "id": "unzldv",
            "title": "LRC Liquidity",
            "url": "https://www.reddit.com/r/CoinBase/comments/unzldv/lrc_liquidity/",
            "author": "ApprehensiveSteve",
            "created_utc": 1652357397.0,
            "score": 20,
            "num_comments": 25,
            "subreddit": "CoinBase",
            "selftext": "Hi, just wanted to confirm your exchange ran out of liquidity for Loopring?",
            "stickied": false,
            "comments": [
                {
                    "id": "i8bdqmb",
                    "author": "moneycashdane",
                    "score": 8,
                    "created_utc": 1652362301.0,
                    "response": "Yes, yes they did.  Keep on transferring to L2, don't let your loops get stuck in this CEX!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8bhzfy",
                            "author": "jadedhomeowner",
                            "score": 3,
                            "created_utc": 1652364149.0,
                            "response": "How does this help (genuine q) - If they're out, they're out?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8bls6b",
                                    "author": "joejitsu_crypto",
                                    "score": 5,
                                    "created_utc": 1652365693.0,
                                    "response": "Forces coinbase to buy the coins they sold to people, hopefully having a positive impact on LRC price and reflecting actual demand",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "id": "unu1c6",
            "title": "Coinbase warns customers they may lose crypto if company goes bankrupt",
            "url": "https://www.dailymail.co.uk/news/article-10807233/Coinbase-warns-customers-lose-crypto-company-goes-bankrupt.html",
            "author": "Rad_Herring",
            "created_utc": 1652334415.0,
            "score": 44,
            "num_comments": 184,
            "subreddit": "CoinBase",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8aat4t",
                    "author": "Robinhood-is-a-scam",
                    "score": 59,
                    "created_utc": 1652335027.0,
                    "response": "Mandated wordage by the SEC, not a warning or disclaimer. USD has lost 40% of its value in 3 years and I don’t see anyone pooping their pants about that.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ad146",
                    "author": "Sir_Lagz_Alot",
                    "score": 34,
                    "created_utc": 1652336648.0,
                    "response": "This is a warning that they’re required to give, as a publicly traded company regulated and overseen by the SEC. \n\nKraken, Gemini, Binance.US, Crypto.com, all will follow suit in the event that they go bankrupt. \n\nCoinbase is the only one publicly traded on the NYSE, which is why they’re in the spotlight.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8ax94b",
                            "author": "VegetablePowerful236",
                            "score": 8,
                            "created_utc": 1652353367.0,
                            "response": "Exact reason why everyone should take their crypto off the exchanges and put it in to a wallet. Not really your money when it’s on there.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8c4l4l",
                            "author": "millhammer29",
                            "score": 3,
                            "created_utc": 1652373043.0,
                            "response": "Yes but it is always a good idea to be self custodial",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8bs7gc",
                    "author": "bewenched",
                    "score": 5,
                    "created_utc": 1652368213.0,
                    "response": "Ooh Time to load up on their stock. It will bounce back nicely.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8bhhci",
                    "author": "malx4eva",
                    "score": 15,
                    "created_utc": 1652363933.0,
                    "response": "This is fear porn",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8b3339",
                    "author": "Tall_Run_2814",
                    "score": 17,
                    "created_utc": 1652356987.0,
                    "response": "Coinbase is not going bankrupt.  These articles are intended to store fear in noobs that do not understand that publicly traded companies often miss their quarterly estimates.  \n\nCoinbase has a solid business structure and will make money regardless of the market going up or down.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8c3ajh",
                            "author": "Fray26",
                            "score": 5,
                            "created_utc": 1652372543.0,
                            "response": "Plus they are a well funded exchange. The big guys are running the show right now. They ain't going nowhere.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8c59k9",
                    "author": "Graeyz",
                    "score": 3,
                    "created_utc": 1652373311.0,
                    "response": "Can I put my stuff in a hardware wallet to keep it safe ? Or do I need to sell  at loss but not loose every thing?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8bia3h",
                    "author": "NevilleHarris",
                    "score": 5,
                    "created_utc": 1652364273.0,
                    "response": "Bought more ETH to stake on Coinbase yesterday. Tired of the fear mongering.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8buequ",
                    "author": "One8s7n",
                    "score": 3,
                    "created_utc": 1652369073.0,
                    "response": "Just fud. It's worst case scenario",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uo8n8j",
            "title": "Coinbase isn’t letting me withdraw my LTC? Says that I have 0 balance",
            "url": "https://www.reddit.com/r/CoinBase/comments/uo8n8j/coinbase_isnt_letting_me_withdraw_my_ltc_says/",
            "author": "cradavious",
            "created_utc": 1652382785.0,
            "score": 3,
            "num_comments": 16,
            "subreddit": "CoinBase",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "unneit",
            "title": "Can’t withdraw funds",
            "url": "https://www.reddit.com/r/CoinBase/comments/unneit/cant_withdraw_funds/",
            "author": "Miramilenium",
            "created_utc": 1652312884.0,
            "score": 67,
            "num_comments": 104,
            "subreddit": "CoinBase",
            "selftext": "Yesterday I was supposed to have $600 available (as CB stated), and today $2800 available for withdrawal. Well I couldn’t  take my funds out yesterday nor today. Customer service said that much less  funds should be available tomorrow. My CB account said that as well until two hours ago when it changed it again to available in 2 days?! And tomorrow I’m guessing it’s going to be available in 3 days?!\nThey keep moving the available date for withdrawal to always a next day. \nAre they bankrupt already? This is really mind-boggling.",
            "stickied": false,
            "comments": [
                {
                    "id": "i89nt6p",
                    "author": "COgrown",
                    "score": 22,
                    "created_utc": 1652322008.0,
                    "response": "I'm not sure if this is some organized fud or what.\n\nI'm not seeing any changes at all.  Withdraws yesterday same as ever and the same currently.\n\nY'all must be triggering something.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i89hoq2",
                    "author": "thecrabmonster",
                    "score": 5,
                    "created_utc": 1652319286.0,
                    "response": "I have been completely shutdown on Coinbase for no apparent reason 48 hours and counting.  Bank fully funded. No reason for \"ACH error\"  All assets frozen with verified bank deposits. Customer service deflects and sends the same canned response.  The only other problem I have had like this with coinbase is when crypto was down last summer. Not good.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i896ctg",
                    "author": "drempire",
                    "score": 5,
                    "created_utc": 1652314155.0,
                    "response": "This seems to be a disturbingly common complaint today.\n\nWhat's going on? Should I be concerned?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i897sti",
                            "author": "Miramilenium",
                            "score": 6,
                            "created_utc": 1652314828.0,
                            "response": "They’re also asking me to do verification of my identity. Which I did many times before. So I take pictures of my ID, submit it, and then instead of having it accepted, it send me back to the screen of taking pictures",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i89boj9",
                                    "author": "drempire",
                                    "score": 3,
                                    "created_utc": 1652316596.0,
                                    "response": "I had that problem when I first signed up",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8a5ue5",
                            "author": "promaster9500",
                            "score": 5,
                            "created_utc": 1652331660.0,
                            "response": "I just withdrew money like an hour ago it's fine",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i897izy",
                            "author": "susygomezd",
                            "score": 3,
                            "created_utc": 1652314705.0,
                            "response": "I am already bro. SO MANY comments stating the same or other horrible scenarios with no solution nor support from their “incredible” customer service🤡😠\n\nTo which exchange may we switch? (If someone is interested on such transition).",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i897fqu",
                    "author": "cyberjag999",
                    "score": 3,
                    "created_utc": 1652314663.0,
                    "response": "Oh yeah and I get 4% rebate on all of my transactions which so far Totally awesome",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "ung2te",
            "title": "Coinbase Faces No Risks of Bankruptcy Despite Market Crash and Disappointing Q1 Results, Says CEO",
            "url": "https://wwcrypto.net/archive/Coinbase-Faces-No-Risks-of-Bankruptcy-Despite-Market-Crash-and-Disappointing-Q1-Results-Says-CEO/",
            "author": "configsql",
            "created_utc": 1652292553.0,
            "score": 132,
            "num_comments": 89,
            "subreddit": "CoinBase",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i87qs11",
                    "author": "Kiwip0rn",
                    "score": 52,
                    "created_utc": 1652292697.0,
                    "response": "Nobody with any common sense believed they were in any threat of bankruptcy.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i87rdcz",
                            "author": "Rey_Mezcalero",
                            "score": 16,
                            "created_utc": 1652292934.0,
                            "response": "But the haters sure are trying to beat the story and give the FUD impression. \n\nCB isn’t my main exchange...but out of them all I would feel CB has the most or near the top of fiscal responsibility since it’s public and has stronger reporting metrics they have to maintain",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8b4n0w",
                                    "author": "miles-1243",
                                    "score": 6,
                                    "created_utc": 1652357855.0,
                                    "response": "I expect if Coinbase sleeps with the fishes (and is unable to release people's coin/funds) the value of crypto will crash and be nearly worthless anyway.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8cpa5b",
                                            "author": "Rock_Strongo",
                                            "score": 6,
                                            "created_utc": 1652381274.0,
                                            "response": "Yeah... Coinbase going bankrupt anytime in the next 20 years means crypto is all but dead. All the smug people on reddit circle-jerking to their cold storage wallets will still have full control of their now-worthless coins though.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i87s6uu",
                            "author": "JonWick33",
                            "score": 8,
                            "created_utc": 1652293254.0,
                            "response": "Anybody can go bankrupt. If you would have told me in 2000 that GM and Chrysler would go under I wouldn't have believed you. Huge banks go under. Hell, even my City went bankrupt lol.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i89u0zg",
                                    "author": "stocksnhoops",
                                    "score": 5,
                                    "created_utc": 1652325010.0,
                                    "response": "The scary fact to come from this story is if a company that held crypto were to declare bankruptcy, the crypto would be the companies and be the assets of the bankruptcy court. So any holders of crypto who bought and just left it and don’t follow the daily or monthly ins and outs of the market might wake up one day and their coins are no longer their property.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i87v0mv",
                    "author": "Deeman0",
                    "score": 17,
                    "created_utc": 1652294377.0,
                    "response": "I kissed the money goodbye the moment I spent it on crypto, so I never worry about anything.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i88vxtm",
                            "author": "jerstud56",
                            "score": 7,
                            "created_utc": 1652309298.0,
                            "response": "Yeah I actually checked my account for the first time in months, meh. I'll check it out in another couple months.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i899cjq",
                            "author": "1HappyGuy1",
                            "score": 4,
                            "created_utc": 1652315541.0,
                            "response": "You must have invested in Safemoon",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i88ursl",
                    "author": "BonesGR",
                    "score": 4,
                    "created_utc": 1652308780.0,
                    "response": "I wasn’t worried about CB going bankrupt but I did wonder what happens to the coinbase wallet if they go bankrupt.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i889wgs",
                    "author": "sqlbastard",
                    "score": 11,
                    "created_utc": 1652300200.0,
                    "response": "i see, so theyre going bankrupt then",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i88sxja",
                            "author": "Yarrr_piratejackoff",
                            "score": 8,
                            "created_utc": 1652307966.0,
                            "response": "I need all the laughs I can get today",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i88anqs",
                    "author": "lloydeph6",
                    "score": 7,
                    "created_utc": 1652300493.0,
                    "response": "This isn’t about crypto guys, this FUD is about lowering the stock price of COIN. We have to distinguish the two. Don’t forget Coinbase has only be publicly trading since April 2021",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uo0xwh",
            "title": "Coinbase card - Choosing new reward",
            "url": "https://www.reddit.com/r/CoinBase/comments/uo0xwh/coinbase_card_choosing_new_reward/",
            "author": "c-a-y",
            "created_utc": 1652361653.0,
            "score": 3,
            "num_comments": 16,
            "subreddit": "CoinBase",
            "selftext": "I’m being directed to choose a new card reward but all listed rewards expire on May 17.  If the new rewards choices aren’t shown yet, why am I being directed to make a choice now?",
            "stickied": false,
            "comments": [
                {
                    "id": "i8bcrla",
                    "author": "CVN75Shipmate",
                    "score": 3,
                    "created_utc": 1652361851.0,
                    "response": "Mine expires in 4 days. I’m gonna wait till then",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "unsdwl",
            "title": "Do Not Buy on Coinbase, Won't let you withdraw",
            "url": "https://www.reddit.com/r/CoinBase/comments/unsdwl/do_not_buy_on_coinbase_wont_let_you_withdraw/",
            "author": "IntelligentPause668",
            "created_utc": 1652328525.0,
            "score": 12,
            "num_comments": 38,
            "subreddit": "CoinBase",
            "selftext": "Just used them to try to take advantage of the dip and buy some coin, as soon as i try to withdraw i get (been trying for like an hour when minutes are important at this time) :\n\nSomething’s not right. Please try again later. Your funds are safe.\n\nliterally what the f\\*\\*\\*, do not buy with this shady ass company.\n\nedit: just tried a second test coin. algo first now avax can't get anything out, wtf, this company is so shady\n\nedit 2: spoke to their support, which is just about as terrible as their service, still no help, literally losing money now as i can't get my crypto out and trade to my desired cryptos\n\nedit 3: i have withdrawn many times before, it's working now possibly because i was posting in a lot of places how shady it was, they should of at least posted they had technical issues if that was the case, now my algos lost like 10% of it's value f\\*\\*\\*in brilliant, what a sh\\*\\* company",
            "stickied": false,
            "comments": [
                {
                    "id": "i8a8aa7",
                    "author": "JustDalek_",
                    "score": 7,
                    "created_utc": 1652333264.0,
                    "response": "I just withdrew without issues. Funds I already had, no ACH clearing waiting times. BTC, ATOM, XLM",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8ajs6s",
                            "author": "UnableView0",
                            "score": 4,
                            "created_utc": 1652342090.0,
                            "response": "Did the same. Took all my coins out and had no problems.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8b881v",
                    "author": "AlwaysCrank",
                    "score": 11,
                    "created_utc": 1652359696.0,
                    "response": "Been using Coinbase for years. Transferred thousands in and out. No problems.\n\nOP admits it's always worked in the past, but has 1 issue and throws an absolute temper tantrum all over the internet?\n\nOP sounds like a little bitch.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "unhi3e",
            "title": "Can't withdraw funds? Fine, I'm done with Coinbase.",
            "url": "https://www.reddit.com/r/CoinBase/comments/unhi3e/cant_withdraw_funds_fine_im_done_with_coinbase/",
            "author": "HeidNuu",
            "created_utc": 1652296457.0,
            "score": 45,
            "num_comments": 55,
            "subreddit": "CoinBase",
            "selftext": "Customer support didn't even listen to my actual problem and gave me a generic response. I have money that has existed in my account for MONTHS and I cannot withdraw it to my bank OR send crypto to different wallets. They stated that there are no restrictions on my account, but for some reason all my assets read as \"0\" balance available to send. I removed my bank account and I am done with this exchange.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8811qc",
                    "author": "bobbybottombracket",
                    "score": 9,
                    "created_utc": 1652296766.0,
                    "response": "I just moved all my coins from CB. No more.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i881bib",
                    "author": "Prestigious_Bed2052",
                    "score": 6,
                    "created_utc": 1652296872.0,
                    "response": "Fuck bro same thing happening to me, when I try to withdraw it says my balance is zero.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i88m481",
                    "author": "EstimatorGuy224",
                    "score": 3,
                    "created_utc": 1652305058.0,
                    "response": "More and more I’m convinced these are bots lying about not being able to withdraw. Just transferred all my BTC to my ledger. Transferred perfectly in < 5 minutes…",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "unnu7l",
            "title": "Coinbase stock plunges again after company reports dismal results",
            "url": "https://decryptor.live/2022/05/coinbase-stock-plunges-again-after-company-reports-dismal-results/",
            "author": "HighwayMaterial9779",
            "created_utc": 1652314240.0,
            "score": 12,
            "num_comments": 11,
            "subreddit": "CoinBase",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "unls5y",
            "title": "Coinbase drastically lowered my account deposit limit",
            "url": "https://www.reddit.com/r/CoinBase/comments/unls5y/coinbase_drastically_lowered_my_account_deposit/",
            "author": "blu_mOOn_2020",
            "created_utc": 1652308084.0,
            "score": 16,
            "num_comments": 28,
            "subreddit": "CoinBase",
            "selftext": "Not sure why. It was for example, a 10k bank ach deposit limit, to now 500 deposit  daily limit. Wtf?! Is it just today a glitch?! Why the drastic deposit decrease?!? I'm just nervous with coinbase since this blows!",
            "stickied": false,
            "comments": []
        },
        {
            "id": "undzg4",
            "title": "coinbase made me reverify my identity and now I have a max buying power of only $270....it was $5000 yesterday like it has been for the last year...wtf?!",
            "url": "https://www.reddit.com/r/CoinBase/comments/undzg4/coinbase_made_me_reverify_my_identity_and_now_i/",
            "author": "CO2GOAT",
            "created_utc": 1652287005.0,
            "score": 46,
            "num_comments": 45,
            "subreddit": "CoinBase",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i88f37h",
                    "author": "StiltonG",
                    "score": 12,
                    "created_utc": 1652302247.0,
                    "response": "Same happened to me.  Was $5K, then suddenly it's $250.\n\nEdit: I simply requested an increase and within minutes Coinbase sent me notification my limit is $5K again.  They just had some sort of glitch it seems.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i88pqw8",
                            "author": "StiltonG",
                            "score": 3,
                            "created_utc": 1652306585.0,
                            "response": "Wait, wtf? Why are people down-voting my comment?  Did I say something controversial?  Wtf, I simply advised I had the same experience & that they rectified it.  Can someone let me know why they're down-voting this comment?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i87kd3s",
                    "author": "Glock19LabRat",
                    "score": 4,
                    "created_utc": 1652290183.0,
                    "response": "Same. Except mine says my limit is zero!!",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "unoplk",
            "title": "URGENT - My account has been restricted for 24 days and your support teams have been UNABLE to resolve the issue. I have spent HOURS on the phone with your support teams none of whom have been able to give me a straight answer regarding what the issue is and how it can be resolved.",
            "url": "https://www.reddit.com/r/CoinBase/comments/unoplk/urgent_my_account_has_been_restricted_for_24_days/",
            "author": "Coinbase_HELPME_",
            "created_utc": 1652316985.0,
            "score": 8,
            "num_comments": 30,
            "subreddit": "CoinBase",
            "selftext": "My support case is  #11504440. \n\nHere is my timeline:\n\nApril 17th - Phone is stolen at Coachella \nI immediately called customer support to request a temporary lock on my account. This was processed.\nApril 19th - I set up a new IPhone and reset my 2FA on my Coinbase account. My account access was restored.\n\nSince this time, my account has remained “restricted.” \nI am unable to make payments on my BTC backed loan and I am unable to sell or buy crypto.\nI have submitted all requested documents for identify verification - including:\n- California Drivers license \n- Photo of marriage certificate and birth certificate showing name change \n\nI SEEM TO BE STUCK IN SOME HORRIBLE LOOP WITH YOUR SUPPORT TEAM WHERE THEY  ARE EITHER NOT READING OR CANNOT ACCESS MY CASE HISTORY.\n\nI have not received any clear instructions regarding what else may be needed to clear this case. I am a a loss at this point and meanwhile have experienced significant losses despite repeated attempts to sell my crypto. This is absolutely unacceptable. I had a high degree of trust in Coinbase before this experience and I am completely aghast at what is happening now. \n\nYour phone support teams have NO ability to escalate calls to a live person with higher abilities to respond to issues outside of the prescribed script. \n\nI am literally stuck in a loop and watching my life savings erode.\n\nPLEASE HELP ME!",
            "stickied": false,
            "comments": []
        },
        {
            "id": "unmx9z",
            "title": "\"check your internet connection\"",
            "url": "https://www.reddit.com/r/CoinBase/comments/unmx9z/check_your_internet_connection/",
            "author": "noquarter53",
            "created_utc": 1652311439.0,
            "score": 11,
            "num_comments": 12,
            "subreddit": "CoinBase",
            "selftext": "I cannot think of a more insulting way to tell me the app is shit.  My internet connection is fine, and Coinbase knows it's fine.  \n\nWho would honestly make the decision to \"blame the user's internet connection when our app isn't working\".",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uno0mo",
            "title": "Coinbase wallet won't let me transfer my apecoin to wallet from account.",
            "url": "https://www.reddit.com/r/CoinBase/comments/uno0mo/coinbase_wallet_wont_let_me_transfer_my_apecoin/",
            "author": "Unlucky_Astronaut213",
            "created_utc": 1652314814.0,
            "score": 7,
            "num_comments": 23,
            "subreddit": "CoinBase",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i89b9e4",
                    "author": "gold4829",
                    "score": 5,
                    "created_utc": 1652316408.0,
                    "response": "maybe you should go APE over it...",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "unoir9",
            "title": "card buys permanently disabled??? phone customer service was no help",
            "url": "https://www.reddit.com/r/CoinBase/comments/unoir9/card_buys_permanently_disabled_phone_customer/",
            "author": "Less-Good6873",
            "created_utc": 1652316384.0,
            "score": 7,
            "num_comments": 18,
            "subreddit": "CoinBase",
            "selftext": "so, i made a small bank account purchase the other day for $UST and a day later my purchase power dropped from $25,000 to $5,000 and all my cards were unable to purchase any crypto. i have had my coinbase account for over 4 years with the same debit card attached. now i can’t buy any crypto with my card and have to wait the 8+ days to take my coins off the exchange.\n\ni called and was put on hold for 3 minutes multiple times for them to say oh it’s because your card, if you get a NEW card it will work. so i go to my other bank, and get a new card issued and what do i know.. IT STILL WONT LET ME PURCHASE WITH my card!!! what a waste of time and misinformation! \n\nTLDR: coinbase randomly disabled my card purchases permanently and won’t help me try and get them enabled again.\n\nIM JUST TRYING TO BUY THE DIP!!!",
            "stickied": false,
            "comments": []
        },
        {
            "id": "unndzv",
            "title": "Transaction delayed for 72 hours",
            "url": "https://www.reddit.com/r/CoinBase/comments/unndzv/transaction_delayed_for_72_hours/",
            "author": "Donny_Solider",
            "created_utc": 1652312838.0,
            "score": 7,
            "num_comments": 34,
            "subreddit": "CoinBase",
            "selftext": "Hi all, had a verified account for years. Just bought 3 lite coin and tried to send to my Binance wallet but it put it on hold unless I verified my identity again… I have done this 7 times in the past 4 hours, on the verification section I now have 7 driving licenses that all say ‘accepted’ but every I go back to the payment it still says delayed until May 14th.\n\nHave logged out, tried browser and app and both are same. I then try to press cancel and it says oops something went wrong please try again - any idea what the hell is going on? Thanks in advance.",
            "stickied": false,
            "comments": []
        },
        {
            "id": "unl3pv",
            "title": "unable to trade out to wallet",
            "url": "https://www.reddit.com/r/CoinBase/comments/unl3pv/unable_to_trade_out_to_wallet/",
            "author": "Irish_Chevron",
            "created_utc": 1652306198.0,
            "score": 9,
            "num_comments": 15,
            "subreddit": "CoinBase",
            "selftext": "why do i keep getting an error when i try to withdraw to my wallet.\n\nall i get is.. somethings not right please try again later.\n\ni had setup a regular payment to buy with coinbase.. but if i cannot withdraw or move BTC to wallet it feels like lost money.\n\n&#x200B;\n\nWhat is the issue with trading funds with coinbase?",
            "stickied": false,
            "comments": []
        },
        {
            "id": "unjzjb",
            "title": "ETH 2.0 and getting it off coinbase. What options do we have?",
            "url": "https://www.reddit.com/r/CoinBase/comments/unjzjb/eth_20_and_getting_it_off_coinbase_what_options/",
            "author": "hardcoretuner",
            "created_utc": 1652303141.0,
            "score": 6,
            "num_comments": 30,
            "subreddit": "CoinBase",
            "selftext": "So we were promised a way to trade ETH2 before it was done. That has clearly not happened. And now coimbase may go bankrupt, and all our money is gone? That's what the latest announcement is from coinbase. So with that in mind, can we sue coinbase as a group to get our ETH2 moved off their site? What options do we have?",
            "stickied": false,
            "comments": [
                {
                    "id": "i88k7wm",
                    "author": "Odinsblood1980",
                    "score": 8,
                    "created_utc": 1652304281.0,
                    "response": "From Coinbase CEO's Twitter : \n\n1/ There is some noise about a disclosure we made in our 10Q today about how we hold crypto assets. Tl;dr: Your funds are safe at Coinbase, just as they’ve always been.\n\n2/ We have no risk of bankruptcy, however we included a new risk factor based on an SEC requirement called SAB 121, which is a newly required disclosure for public companies that hold crypto assets for third parties.  https://www.sec.gov/oca/staff-accounting-bulletin-121\n\n3/ We believe our Prime and Custody customers have strong legal protections in their terms of service that protects their assets, even in a black swan event like this.\n\n4/ For our retail customers, we’re taking further steps to update our user terms such that we offer the same protections to those customers in a black swan event. We should have had these in place previously, so let me apologize for that.\n\n5/ This disclosure makes sense in that these legal protections have not been tested in court for crypto assets specifically, and it is possible, however unlikely, that a court would decide to consider customer assets as part of the company in bankruptcy proceedings...\n\n6/ We should have updated our retail terms sooner, and we didn't communicate proactively when this risk disclosure was added.  My deepest apologies, and a good learning moment for us as we make future changes.\n\n7/ Finally, we of course offer a self-custodial wallet solution (Coinbase Wallet) for those who prefer to store their own crypto. Our goal is to make the best custodial and self-custodial solutions in crypto - each carry their own risks and benefits, and it's important...\n\n8/ ...that customers can choose the best solution for their needs. We'll continue working to improve customer protections in all our products across both categories.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i88i55d",
                    "author": "Girafferage",
                    "score": 13,
                    "created_utc": 1652303456.0,
                    "response": "Well first of all you agreed to the terms and agreements so you should probably read those next time because it means you cant sue them. All exchanges have that clause where they will pay out bankruptcy fees and the like and then pay out investors based on their amounts involved.\n\n Also what makes you think the most well known exchange in the United States is going Bankrupt?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i88kgia",
                    "author": "Kiwip0rn",
                    "score": 11,
                    "created_utc": 1652304379.0,
                    "response": "🙄 You were promised to get to trade before ETH2.0 was done. \n\nIs ETH2.0 done? No.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i88yufp",
                    "author": "ZacTheOriginal",
                    "score": 6,
                    "created_utc": 1652310618.0,
                    "response": "Lot of FUD posts from people that can't or won't read the details...",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "unmcnv",
            "title": "Coinbase Bankruptcy",
            "url": "https://www.reddit.com/r/CoinBase/comments/unmcnv/coinbase_bankruptcy/",
            "author": "Suspicious_Put7253",
            "created_utc": 1652309735.0,
            "score": 3,
            "num_comments": 14,
            "subreddit": "CoinBase",
            "selftext": "If Coinbase went bankrupt, would I still be able to access my cryptocurrencies held in Coinbase Wallet?",
            "stickied": false,
            "comments": [
                {
                    "id": "i88zqpy",
                    "author": "ZacTheOriginal",
                    "score": 3,
                    "created_utc": 1652311022.0,
                    "response": "Yes.  Coinbase wallet isn't coinbase.com.....   they just license the name.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "unfc30",
            "title": "Need clarity from Coinbase on if there are plans for an Asset/ERC-20 Recovery Service",
            "url": "https://www.reddit.com/r/CoinBase/comments/unfc30/need_clarity_from_coinbase_on_if_there_are_plans/",
            "author": "jgbagley",
            "created_utc": 1652290549.0,
            "score": 6,
            "num_comments": 15,
            "subreddit": "CoinBase",
            "selftext": "Coinbase has mentioned on several occasions ([example](https://www.reddit.com/r/CoinBase/comments/mttji6/unsupported_crypto_coinbase_my_biggest_mistake_of/)) that they were building an asset recovery service for users who accidently deposited an ERC-20 token which was unsupported, claiming that this service would be available in 2021. This was also mentioned on their support page until mid last year when it was removed as is visible using the Wayback Machine:  \n[https://web.archive.org/web/20210422131944/https://help.coinbase.com/en/coinbase/trading-and-funding/sending-or-receiving-cryptocurrency/unsupported-crypto-recovery](https://web.archive.org/web/20210422131944/https://help.coinbase.com/en/coinbase/trading-and-funding/sending-or-receiving-cryptocurrency/unsupported-crypto-recovery)\n\nCan we get clarification on if this feature is still planned to be delivered and if so, when?",
            "stickied": false,
            "comments": []
        },
        {
            "id": "unjul0",
            "title": "What’s going on please explain..",
            "url": "https://www.reddit.com/r/CoinBase/comments/unjul0/whats_going_on_please_explain/",
            "author": "ResponsibleCitron980",
            "created_utc": 1652302807.0,
            "score": 4,
            "num_comments": 16,
            "subreddit": "CoinBase",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i88gyua",
                    "author": "Alimakakos",
                    "score": 3,
                    "created_utc": 1652302990.0,
                    "response": "Luna/TerraUSD fiasco on top of everything else...",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i88gkbn",
                    "author": "neddog89",
                    "score": 7,
                    "created_utc": 1652302831.0,
                    "response": "Crime",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "unhdsx",
            "title": "I withdrew 2500 from coin base but only 2000 appears pending in my Wells fargo checking account! WTF?",
            "url": "https://www.reddit.com/r/CoinBase/comments/unhdsx/i_withdrew_2500_from_coin_base_but_only_2000/",
            "author": "Butterflymissiles",
            "created_utc": 1652296118.0,
            "score": 5,
            "num_comments": 19,
            "subreddit": "CoinBase",
            "selftext": "missing 500 bucks !",
            "stickied": false,
            "comments": []
        },
        {
            "id": "ungcnr",
            "title": "Coinbase Shares Plunge as Weak Earnings Prompt Near-Term Caution",
            "url": "https://wwcrypto.net/archive/Coinbase-Shares-Plunge-as-Weak-Earnings-Prompt-Near-Term-Caution/",
            "author": "configsql",
            "created_utc": 1652293296.0,
            "score": 5,
            "num_comments": 9,
            "subreddit": "CoinBase",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uncvmh",
            "title": "Btc not available",
            "url": "https://www.reddit.com/r/CoinBase/comments/uncvmh/btc_not_available/",
            "author": "Ok-Succotash8028",
            "created_utc": 1652284095.0,
            "score": 5,
            "num_comments": 11,
            "subreddit": "CoinBase",
            "selftext": "I do have funds in my Bitcoin primary wallet but says “0 of btc available” when trying to send to an external wallet address. Why is this happening?",
            "stickied": false,
            "comments": [
                {
                    "id": "i87n3om",
                    "author": "Eyetron2020",
                    "score": 5,
                    "created_utc": 1652291240.0,
                    "response": "Funds must clear first. Did you recently transfer money in to buy?",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uncyko",
            "title": "What is the truth about LUNA and UST?",
            "url": "https://www.reddit.com/r/CoinBase/comments/uncyko/what_is_the_truth_about_luna_and_ust/",
            "author": "CWCOfficial",
            "created_utc": 1652284312.0,
            "score": 4,
            "num_comments": 14,
            "subreddit": "CoinBase",
            "selftext": "Two whales, BlackRock and Citadel, borrowed $100k in BTC from Gemini exchange (in the loan book notice). Then use $25k BTC of which Swap to UST.\n\nBlackrock and Citadel contacted Do Kwan and asked to buy UST at a discount of a large amount of BTC.\n\nAnd so Do Kwan agreed to buy back that amount of BTC at a higher price than the market price, which is to sell at a discount of the amount of UST, which dilutes the UST's capitalization.\n\nRight after that, the 2 funds released all of btc and ust because those 2 funds knew that in Anchor Protocol, they were Staking a lot of UST customers with 20% APY. If generating enough Panic Sell for UST to lose its peg, it would create a total crisis because UST's capitalization at that time was larger than the entire amount of counterpart assets including LUNA and BTC as well as many other tokens.\n\nThis incident triggered the Anchor Protocol which forced the release of a lot of Luna tokens to pull the peg for UST back to 1$, and the snowball started to appear, the more UST fell => the more LUNA fell => the collateral value for UST fell further => Luna Foundation Group (LFG) had to sell a large amount of BTC mortgage to support BUY and BURN UST.\n\nFrom there, it caused selling pressure on the whole market when BTC dropped => 2 funds bought back the borrowed amount of BTC at a low price and made a big profit.\n\nThe question is at what price will these 2 funds close a short order at $100k BTC???\n\n**Did the ancestor Do Kwan strangle himself to death?**",
            "stickied": false,
            "comments": [
                {
                    "id": "i876aqo",
                    "author": "matiolindo",
                    "score": 4,
                    "created_utc": 1652284748.0,
                    "response": "I think a film will be made about this story. However, TERRA is going to survive, though Dok maybe will go out to get a looong vacation",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "undnqn",
            "title": "Can’t send off Coinbase now , waiting period ?",
            "url": "https://www.reddit.com/r/CoinBase/comments/undnqn/cant_send_off_coinbase_now_waiting_period/",
            "author": "gslice",
            "created_utc": 1652286133.0,
            "score": 4,
            "num_comments": 20,
            "subreddit": "CoinBase",
            "selftext": "Now they aren’t letting you send your crypto off of Coinbase for 6 days after legit purchase ? That sucks bad. Why ??",
            "stickied": false,
            "comments": [
                {
                    "id": "i87jlcx",
                    "author": "Tall_Run_2814",
                    "score": 3,
                    "created_utc": 1652289884.0,
                    "response": "The money you \"deposited\" hasn't cleared your bank account yet",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "umyyqv",
            "title": "Coinbase is beyond useless",
            "url": "https://www.reddit.com/r/CoinBase/comments/umyyqv/coinbase_is_beyond_useless/",
            "author": "Kezotron",
            "created_utc": 1652235025.0,
            "score": 8,
            "num_comments": 20,
            "subreddit": "CoinBase",
            "selftext": "I am trying to access $2000 in bitcoin in my account.   A substantial amount to any of the support team that refuses to help me.   Tonight I was put on hold for over 45 minutes by one of the team members.   I spent over 3 hours on the phone this evening and still cannot access my bitcoin.   Why are they holding my money hostage?  And why does the support team think this is a joke?",
            "stickied": false,
            "comments": [
                {
                    "id": "i854hsu",
                    "author": "Kiwip0rn",
                    "score": 3,
                    "created_utc": 1652241030.0,
                    "response": "What is this the 6th Low Karma troll today? And Yes you are 100% correct you ARE a joke... just sit there on hold.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "umbr0p",
            "title": "Unable to buy",
            "url": "https://www.reddit.com/r/CoinBase/comments/umbr0p/unable_to_buy/",
            "author": "Ok-Departure201",
            "created_utc": 1652162407.0,
            "score": 3,
            "num_comments": 17,
            "subreddit": "CoinBase",
            "selftext": "After setting up and verifying my Coin Base account, it is not letting me buy crypto.  I have verified my address and drivers license.  When I go to trade a crypto and click buy, then hit “Preview Buy”, it says “User is unable to buy” under the amount of money I would like to invest.  Any ideas on how to fix this?",
            "stickied": false,
            "comments": []
        },
        {
            "id": "udbphr",
            "title": "we need BI-WEEKLY auto buys....!",
            "url": "https://www.reddit.com/r/CoinBase/comments/udbphr/we_need_biweekly_auto_buys/",
            "author": "Cautious_Sprinkles_8",
            "created_utc": 1651087821.0,
            "score": 3,
            "num_comments": 6,
            "subreddit": "CoinBase",
            "selftext": "Seriously I get paid every 2 weeks not every week or the 1st and 15th of every month.   We need BI-Weekly auto buys.",
            "stickied": false,
            "comments": [
                {
                    "id": "i6fzbhd",
                    "author": "Kiwip0rn",
                    "score": 3,
                    "created_utc": 1651089620.0,
                    "response": "Then we need Monthly auto buys! Then we need Quarterly auto buys! Then we need Bi-Yearly auto buys! Then we need Yearly auto buys...",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uogyxo",
            "title": "Any remember someone posting here 1+ year ago - he said he deposited his families life savings into coinbase and got locked out. I wonder what became of that guy 👀 I still tell that story to this day 😐",
            "url": "https://www.reddit.com/r/CoinBase/comments/uogyxo/any_remember_someone_posting_here_1_year_ago_he/",
            "author": "AlexanderIsMy",
            "created_utc": 1652406969.0,
            "score": 3,
            "num_comments": 20,
            "subreddit": "CoinBase",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8fjmes",
                    "author": "NewChallengers_",
                    "score": 3,
                    "created_utc": 1652434345.0,
                    "response": "It was probably someone lying and trying to get into a high worth account. Happens all the time",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ekoxj",
                    "author": "Kiwip0rn",
                    "score": 4,
                    "created_utc": 1652410494.0,
                    "response": "He did his needed KYC requirements, Coinbase unlocked his account and has lived happily ever after.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "unh08v",
            "title": "Is coinbase wallet safe if CB goes under?",
            "url": "https://www.reddit.com/r/CoinBase/comments/unh08v/is_coinbase_wallet_safe_if_cb_goes_under/",
            "author": "Appropriate-Boot-172",
            "created_utc": 1652295107.0,
            "score": 4,
            "num_comments": 25,
            "subreddit": "CoinBase",
            "selftext": "I'm wondering if my coins in  the coinbase wallet are safe if CB goes under?",
            "stickied": false,
            "comments": []
        },
        {
            "id": "umo5cj",
            "title": "Any Way To Fix This?",
            "url": "https://www.reddit.com/r/CoinBase/comments/umo5cj/any_way_to_fix_this/",
            "author": "_BeastyBoi117_",
            "created_utc": 1652204123.0,
            "score": 3,
            "num_comments": 14,
            "subreddit": "CoinBase",
            "selftext": "I can add cash to my CoinBase account from PayPal and my bank; but I cannot use my cash, PayPal, or my bank to purchase any cryptos. \n\nInstead, I am getting a \"User is unable to buy\" error underneath the amount of cash I'm using to purchase cryptos and the blue \"Preview Buy\" button is not highlighted for me to press on it.",
            "stickied": false,
            "comments": []
        },
        {
            "id": "umpbbt",
            "title": "TRADING DISABLED Your recent purchase of digital assets has failed. Please resolve to resume trading (No RESPONSE)",
            "url": "https://www.reddit.com/r/CoinBase/comments/umpbbt/trading_disabled_your_recent_purchase_of_digital/",
            "author": "GreenBearPooh",
            "created_utc": 1652207328.0,
            "score": 3,
            "num_comments": 22,
            "subreddit": "CoinBase",
            "selftext": "Hi,   \n\n\nAn Ach trasnfer failed by my bank and I've already processed the payment to have it fixed but Coinbase support still hasn't lifted the trading restriction on my account. As my $300,000 plus portfolio is taking losses due to my inability to trade, coinbase is still waiting for confirmation that my $17,500 deposit went through. I shared with them the screenshot from my bank confirming it but account still has a hold on it . Case #11758479 has been opened with no update yet and another case was opened by the messaging live chat support that i didn't save the case # for. u/Coinbase please help . Losing money with each delay",
            "stickied": false,
            "comments": [
                {
                    "id": "i8303bi",
                    "author": "Commercial-Jacket-33",
                    "score": 4,
                    "created_utc": 1652207673.0,
                    "response": "Well, $200,000 now lol",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i839xzf",
                    "author": "Kiwip0rn",
                    "score": 3,
                    "created_utc": 1652211625.0,
                    "response": "Okay, 1 Karma account 🙄",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "upfgs2",
            "title": "WLuna - Ratio to Terra",
            "url": "https://www.reddit.com/r/CoinBase/comments/upfgs2/wluna_ratio_to_terra/",
            "author": "Zwilorg",
            "created_utc": 1652528411.0,
            "score": 5,
            "num_comments": 19,
            "subreddit": "CoinBase",
            "selftext": "Why is WLuna not following the 1/1 ratio it should be doing with the token it is referred to?? \n\nNow it kinda looks something like 1/2",
            "stickied": false,
            "comments": [
                {
                    "id": "i8kfar1",
                    "author": "Kiwip0rn",
                    "score": 4,
                    "created_utc": 1652529089.0,
                    "response": "Because most of the other exchanges are not trading.\n\nTwitter peps are sending everyone to Coinbase to buy, at our discount.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8ki4er",
                            "author": "Zwilorg",
                            "score": 3,
                            "created_utc": 1652530969.0,
                            "response": "I kinda understand that, but not the difference on the ratio! And especially the variable part of the ratio 😬",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8kjvc0",
                                    "author": "Kiwip0rn",
                                    "score": 3,
                                    "created_utc": 1652532056.0,
                                    "response": "CMC price on the top appears to be stuck, click on \"trading view\" for the live charts, LUNA and WLUNA are almost identical now, between Kucoin and Coinbase.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "id": "up481x",
            "title": "Withdrawal \"FAILED\" but my money doesn't return to my Commerce account.",
            "url": "https://www.reddit.com/r/CoinBase/comments/up481x/withdrawal_failed_but_my_money_doesnt_return_to/",
            "author": "BarTuv1324",
            "created_utc": 1652484286.0,
            "score": 4,
            "num_comments": 17,
            "subreddit": "CoinBase",
            "selftext": " \n\nI tried to withdraw  0.150798   BTC from my Coinbase Commerce wallet, but the transaction was never confirmed. A day later I noticed the status was \"FAILED\" on the Coinbase Commerce panel. Withdrawal \"FAILED\" but my money doesn't return to my Commerce account. Please help me solve this problem.  \nTransfer ID -  4f8e7565-f34a-4f1e-9f3d-6f9b1dd8bd5d   \nTX link - [https://www.blockchain.com/btc/tx/d253daab0d12fe912d40551ecf45c932c28895c8bac88a016c0eca526885709b](https://www.blockchain.com/btc/tx/d253daab0d12fe912d40551ecf45c932c28895c8bac88a016c0eca526885709b)\n\nSupport Case Number -  Case# 11836511 \n\nI've tried contacting Coinbase support via the form [https://help.coinbase.com/en/contact-us](https://help.coinbase.com/en/contact-us) but until now there has never been an answer. Can anyone tell me what to do?",
            "stickied": false,
            "comments": []
        }
    ]
}