{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "us55rf",
            "title": "Coinbase card top up and cashback rewards choice",
            "url": "https://www.reddit.com/r/CoinBase/comments/us55rf/coinbase_card_top_up_and_cashback_rewards_choice/",
            "author": "Unkn0wnShadow",
            "created_utc": 1652849777.0,
            "score": 4,
            "num_comments": 47,
            "subreddit": "CoinBase",
            "selftext": "Hello everyone. I just received and activated my Coinbase card, however, I don't have any button or field in the App where I can view my card or choose what coin to receive the cashback in. \n\nI've looked at 2 month old videos in YouTube and the App has 6-7 buttons to click around from, but mine has only 4 and no card tab or anything of that sort.\n\nDoes anyone have any tips or a video tutorial in case I'm missing something?",
            "stickied": false,
            "comments": [
                {
                    "id": "i91febw",
                    "author": "TripTryad",
                    "score": 3,
                    "created_utc": 1652850082.0,
                    "response": "Have you tried clicking the \"Pay\" option on the app? I think its the far right option on the bottom. It takes you to the card where you can add funds, choose your cashback and tap the card itself to view the card details.\n\n&#x200B;\n\nUnless you JUST signed up. If you did, you may not have been issued card details yet.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i91shr5",
                            "author": "Unkn0wnShadow",
                            "score": 2,
                            "created_utc": 1652860558.0,
                            "response": "Yes, I've tried that, but the only option there is to send crypto to a friend. I've had the account for almost a month now as well",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i91exym",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1652849778.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i939q68",
                    "author": "coinbasesupport",
                    "score": 1,
                    "created_utc": 1652891258.0,
                    "response": "Hi u/Unkn0wnShadow, thank you for reaching out to us here about this. Can you please move forward with [creating a case](https://help.coinbase.com/en/contact-us) with our team, once completed, you can share your case number with us and we can continue to follow up on this.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9bwow1",
                            "author": "Unkn0wnShadow",
                            "score": 1,
                            "created_utc": 1653055484.0,
                            "response": "Hello, I've already opened a case and was supposed to be contacted by a Card Specialist. Second day now without a word and support is acting like nothing happened. The case is # 11889787 where it was \"escalated\".",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i93nh3b",
                    "author": "Famous-Lychee-7645",
                    "score": 1,
                    "created_utc": 1652896765.0,
                    "response": "I buy and sell coins I have a good rate for you 🎉",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i946fxs",
                    "author": "CircuitGuy",
                    "score": 1,
                    "created_utc": 1652904484.0,
                    "response": "Log into the website.  Select Pay.  Look for Coinbase Card in the top right of the screen.  Click View Card.  On the top right of this screen will be an option to add funds, select coin used to pay for purchases, and options for Rerwards.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9bwqnd",
                            "author": "Unkn0wnShadow",
                            "score": 1,
                            "created_utc": 1653055504.0,
                            "response": "Tried that as well, mate... It's missing from the desktop version as well.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9byqrx",
                                    "author": "coinbasesupport",
                                    "score": 1,
                                    "created_utc": 1653056340.0,
                                    "response": "Thank you for waiting. We understand the urgency of your case and upon checking, we can confirm that your case is properly escalated to the relevant team. Please continue to communicate with the agent via your ongoing case, they will keep assisting you until the issue is resolved. Thank you for your understanding.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}