{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uylyr2",
            "title": "Issues sending coins to other app wallet",
            "url": "https://www.reddit.com/r/CoinBase/comments/uylyr2/issues_sending_coins_to_other_app_wallet/",
            "author": "jenlee90",
            "created_utc": 1653612220.0,
            "score": 1,
            "num_comments": 11,
            "subreddit": "CoinBase",
            "selftext": "I bought some coins on Coinbase and am trying to send it to a wallet in another app (I’ve sent money to this wallet successfully in the past).\nI get an email saying it successfully sent over but there is no movement in the money, and when clicking on “View transaction” in the email all I get is a page saying “there are “connection issues”.\n\nMy boyfriend has done this exact transaction with his accounts which have gone through instantaneously.\n\nI’ve called and emailed Coinbase support multiple times with no solution, or no response at all.\n\nI tried this all day yesterday, all day today, tried it on the Coinbase app, Coinbase web browser, on wifi, on cellular network… all without any success. Why can’t I send money with my account??",
            "stickied": false,
            "comments": [
                {
                    "id": "ia4x9dd",
                    "author": "coinbasesupport",
                    "score": 2,
                    "created_utc": 1653612588.0,
                    "response": "Hello there, u/jenlee90. Apologies if you're having issues with your transaction. Can you confirm if you have the hash ID of the transaction you sent from your Coinbase wallet? Can you also confirm which actions on Coinbase wallet that lead you to a connection issue? \n\nIf possible, and please make sure to make a copy of your seed phrase (don't share it to anyone including us), do the follow troubleshooting steps:\n- Update the app. \n- Update your phone software. \n- Try signing out.\n- Force quit the app.\n- Uninstall and reinstall the app.\n\nPlease provide all the details so we can double check this for you and isolate whether this is an app issue or not. Lastly, please share the case number of your previously raised support case. Thanks!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia4z09y",
                            "author": "jenlee90",
                            "score": 1,
                            "created_utc": 1653613448.0,
                            "response": "Hi there, I don’t have an ID of the transaction because when the transaction seemingly goes through and I get the confirmation email, when I click “view transaction” it directs me to a page that says there are “connection issues.\n\nI have uninstalled and reinstalled the app. I have tried this transaction with the Coinbase app as well as a desktop browser. I have tried it on a wifi as well as a cellular network. It all does the same thing and the money does not get sent over.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "ia4z6hc",
                            "author": "jenlee90",
                            "score": 1,
                            "created_utc": 1653613533.0,
                            "response": "My case number is 11988424, but I have not gotten a response after explaining my situation to them this morning.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia50n56",
                                    "author": "coinbasesupport",
                                    "score": 1,
                                    "created_utc": 1653614259.0,
                                    "response": "Thanks for sharing the case number! Per check, our specialist has shared with you an email about your concern. Please direct all your follow-ups to the support case so the team can further investigate if there's an issue with the app. Also, please advise them that you have gone through some steps to isolate the connection issue. Thank you!",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia50wuk",
                                            "author": "jenlee90",
                                            "score": 1,
                                            "created_utc": 1653614393.0,
                                            "response": "Okay thank you. How long should I wait to hear a response? It has been 20 hours since my explanation of the situation and I have not heard anything yet.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia51xyq",
                                                    "author": "coinbasesupport",
                                                    "score": 1,
                                                    "created_utc": 1653614895.0,
                                                    "response": "Give me one moment to check on this. Thanks!",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "ia5547j",
                                                    "author": "coinbasesupport",
                                                    "score": 1,
                                                    "created_utc": 1653616422.0,
                                                    "response": "Thanks for your patience, u/jenlee90! We have been advised that if you can please share a screenshot of the actual error and send it to the support case. We have also transferred the support case over to the right team so please expect an update anytime soon. Also note that we are unable to confirm how soon they will share a response but rest assured that the team is working on it. thank you!",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia4whz7",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653612221.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}