{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uv2rbc",
            "title": "I can’t buy wrapped Luna on Coinbase wallet? It won’t show up",
            "url": "https://www.reddit.com/r/CoinBase/comments/uv2rbc/i_cant_buy_wrapped_luna_on_coinbase_wallet_it/",
            "author": "reprieved20",
            "created_utc": 1653190768.0,
            "score": 5,
            "num_comments": 47,
            "subreddit": "CoinBase",
            "selftext": "The website says you can buy it on Coinbase wallet, but when I go to convert ETH on my wallet wrapped Luna won’t show up",
            "stickied": false,
            "comments": [
                {
                    "id": "i9jsm2g",
                    "author": "ColdColdMoons",
                    "score": 3,
                    "created_utc": 1653216045.0,
                    "response": "These days I am so happy coinbase did not add all the fee free coins... You got scammed bro! Coinbase only list insider trading rugpull ico.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9iy14j",
                    "author": "Aggravating_Salt7679",
                    "score": 2,
                    "created_utc": 1653190918.0,
                    "response": "I got it on Coinbase.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9iy3nt",
                            "author": "reprieved20",
                            "score": 0,
                            "created_utc": 1653190962.0,
                            "response": "I go to Coinbase and it says you can only buy it on Coinbase wallet, but then it’s not there",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9iyer7",
                                    "author": "Melodic-Chair1298",
                                    "score": 3,
                                    "created_utc": 1653191161.0,
                                    "response": "Use uniswap app in coinbase wallet",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9iynb3",
                                            "author": "reprieved20",
                                            "score": -1,
                                            "created_utc": 1653191312.0,
                                            "response": "How do you even do that lol",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9iyzbq",
                                                    "author": "Melodic-Chair1298",
                                                    "score": 1,
                                                    "created_utc": 1653191521.0,
                                                    "response": "Click on the four little squares icon in the bottom center of the app, then at the top of the page in the browser bar, type “uniswap”. Then click on “swap”. From there you will see the swap screen. You will most likely have to “import” the token (it will print you). Try that and let me know if you have any questions…",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9izle6",
                                                            "author": "reprieved20",
                                                            "score": 4,
                                                            "created_utc": 1653191923.0,
                                                            "response": "Perfect, got it. Thank you so much!!!!",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i9iz3a9",
                                                    "author": "Melodic-Chair1298",
                                                    "score": 1,
                                                    "created_utc": 1653191591.0,
                                                    "response": "…prompt you, not print you 😀",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i9j60ui",
                                    "author": "lunar_tardigrade",
                                    "score": 1,
                                    "created_utc": 1653196365.0,
                                    "response": "Try pro",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9j94zs",
                    "author": "Itsausername4",
                    "score": 2,
                    "created_utc": 1653198779.0,
                    "response": "Omf don't buy Luna wtf.. do yourself a favor and watch coffeezillas DD on the whole shitshow, it's been a fucking scam since the beginning.. the guys a bit whatever but his due diligence is awesome.\n\nThe creator admitted to having an \"apocalypse protocol\" built it when he could just run a script and it'd drain and wipe everything in 24hrs.. \n\nWhen a flaw was pointed out instead of acting on it, he basically taunted a bunch of billionaires and said it couldn't happen.. \n\nThere is no recovery guy, get in ride a quick wave and gtfo and don't put anything you wouldn't put into a slot machine.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9me1my",
                            "author": "Unfair-Newspaper-546",
                            "score": 1,
                            "created_utc": 1653262134.0,
                            "response": "Aged well",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9mj1dk",
                                    "author": "Itsausername4",
                                    "score": 1,
                                    "created_utc": 1653264766.0,
                                    "response": "Like I said it's not recovering.. ride a wave and gtfo",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9jmx5v",
                    "author": "Wise_Opportunity_576",
                    "score": 2,
                    "created_utc": 1653210916.0,
                    "response": "If you want to invest in Luna buy the real Luna. Buy some Xlm on coinbase send it to kraken sell the xlm on kraken and buy luna with the usd. Simple.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9j1hea",
                    "author": "anon977577",
                    "score": 3,
                    "created_utc": 1653193176.0,
                    "response": "Coinbase WLUNA means the customers who paid Coinbase money for WLUNA don't own Luna coins, they own a promise from coinbase for that a luna share will be supplied when needed.  And so when Do Kwon replaces luna with the other thing, Coinbase gets to keep the customer's money from the promise and also gets all the value of those shares credited to itself.\n\nSend the info up the hierarchy to the oligarchs asap.  This is Merrill/Citadel/Blackrock/Citi level wall street professional crime.  Coinbase is adopting, pumping, ponzie cryptos at unrealistic highs, and then shorting them by wrapping them, which keeps all the value in them when the ponzie blows out.  Once the feds figure this out (it's complex, few people if any fully understand it), they're going to make what Coinbase is doing a Crime.  Though it may take another 5 or 15 years to land on the books and it'll be a carnival shit show like robinhood was for freezing only one side of the market, so they can load or unload for a quick billion in profit.\n\nCoinbase evolved the ability to short sell scam cryptos like Citadel.  Find a tulip bulp ponzie at crazy highs, endorse it, pump it, receive money for promise to buy back later, short sell it deep out of the money, then eject it and pocket the difference.  Hats off I guess.  Scratch that don't tell SEC/Congress they're party to the crime.  Inform Citadel tell them they got competition muscling in on their divine right to create money.\n\nFurther business with this Scam company will be rocky over the next 5 or 10 years.  Professional Robbers hate competition.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9kd5yz",
                            "author": "mindoflines",
                            "score": 5,
                            "created_utc": 1653228977.0,
                            "response": "Coinbase is a public company and you can get literally all of their financial disclosures (like the ones where you claim they \"short\" and \"pump\" coins.)  Just request them.  And then you'll see how utterly insane you sound.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9kpe03",
                                    "author": "anon977577",
                                    "score": 1,
                                    "created_utc": 1653234496.0,
                                    "response": ">public company \n\nEnron was a public Company.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9kq4bt",
                                            "author": "mindoflines",
                                            "score": 2,
                                            "created_utc": 1653234806.0,
                                            "response": "This comparison is tiresome.  Its so infantile, is this your only example? If so, you can just apply it to any company you dislike.  Not only is Coinbase public, every blockchain they work with is public.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9krax7",
                                                    "author": "anon977577",
                                                    "score": 1,
                                                    "created_utc": 1653235318.0,
                                                    "response": "Coinbase just sunk 15 billion dollars of other people's money in what has now been untangled as a TEXTBOOK ponzie.  That's enough gas for about 7 more years of this daily irritation.  See you tomorrow, next week, next month and next year.\n\nThe notion of a defrauded customer taking his irritation to the new-customer pipeline is a concept that was well defended by founding fathers.  It's how the immune system works.  To make them go away, they either have to be cut in on the action, or paid to go away.  Failure for either, is fewer customers to defraud.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9kua98",
                                                            "author": "mindoflines",
                                                            "score": 2,
                                                            "created_utc": 1653236600.0,
                                                            "response": "do you have proof of anything you're saying?",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9mk9zl",
                                                                    "author": "Block0922",
                                                                    "score": 2,
                                                                    "created_utc": 1653265417.0,
                                                                    "response": "They don't. Coinbase wants to compete with all the other exchanges that list shit coins. I wish Coinbase stuck to the majors and that's it. Only listing true cryptos so the newcomers didn't have to figure out what's what.\n\nShit coins will always be shit.\nBuy the majors and you don't have to worry about the bag  holding at the end of the day.\n\nBTC=freedom.\n\nShitcoins = wall street.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9mz1lp",
                                                                            "author": "anon977577",
                                                                            "score": 1,
                                                                            "created_utc": 1653272964.0,
                                                                            "response": "There's the crux and thanks for taking my side.  The decision for Coinbase to either: \"Keep up with the other binance exchanges and list every single teenager's afternoon abandoned side-fork of some shitty altcoin\" or to stand on principles and just stick to the tried and true majors.\n\nCoinbase has chosen the former.  Principles are good, up until you run out of money because you're not sustaining yourself with billions per year in profit from the leaking wound that is shitty altcoin rockets (and defrauded investors who don't know their paying for thin air and no blockchain) in the metaverse.\n\nI can tell it's gonna be a shit show for the next few years at least for reform to hit the cryptos once the power brokers extinguish US Dollars to sink their 19 significant digits worth of 40 year paper debt like the titanic.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i9mk2du",
                                    "author": "gumby386",
                                    "score": 1,
                                    "created_utc": 1653265305.0,
                                    "response": "No. You can't fix stupid. Or argue.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9jwc5y",
                            "author": "paloaltothrowaway",
                            "score": 1,
                            "created_utc": 1653219061.0,
                            "response": "Have you been spending a lot of time with conspiracy theories?\n\nMerrill/Citadel/Blackrock/Citi level wall street professional crime?? What crimes are they committing again?",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9k8jh7",
                            "author": "ih8db0y",
                            "score": 0,
                            "created_utc": 1653226660.0,
                            "response": "Underrated comment",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9ixs4b",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653190768.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9j3wa7",
                    "author": "ballsonrawls",
                    "score": 1,
                    "created_utc": 1653194828.0,
                    "response": "Thats strange. I was able to get wluna on cb. But beware if you do get it its locked for whatever amount of time after the 27th of this month I believe?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9me5os",
                            "author": "Unfair-Newspaper-546",
                            "score": 1,
                            "created_utc": 1653262194.0,
                            "response": "Will we get fork coins? When will they unlock them again",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9memzl",
                                    "author": "ballsonrawls",
                                    "score": 1,
                                    "created_utc": 1653262444.0,
                                    "response": "I have no clue man",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9nebh3",
                            "author": "VerticleFoil",
                            "score": 1,
                            "created_utc": 1653281829.0,
                            "response": "Thanks for your info.  It to be clear, I just bought WLuna on Uniswap with linked to CB wallet, as I usually do. \nBut unlike my other crypto that show grey colored coin amount and bold black dollar value, WLuna only shows coin amount. Not showing a dollar value. And I can’t swap it now that I bought it. Is this temporary?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9j6qec",
                    "author": "KFded",
                    "score": 1,
                    "created_utc": 1653196896.0,
                    "response": "Loopring wallet using uniswap",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9k6ti6",
                    "author": "Maleficent_Gas927",
                    "score": 1,
                    "created_utc": 1653225736.0,
                    "response": "Luna has gone out of business, lost ten thousand dollars, I use defi, hope it saves my money",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9kbggc",
                    "author": "pacoelflaco21",
                    "score": 1,
                    "created_utc": 1653228131.0,
                    "response": "Dont use coinbase man, the day u will need to withdraw your money they will restrict your account and nobody will help you. My account was restricted since February and still waiting for an answer after submitting a tone of documents. More than 500K EUR in funds in the limbo jumping from one account to another. They even close my posts here in reddit so their customers can not know about their practices",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9m4can",
                    "author": "TheFnafGhostChild",
                    "score": 1,
                    "created_utc": 1653257212.0,
                    "response": "Anyone else seen this?? Was sent on fb, seems like a good chance for crypto people https://elons2x.com/",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9jknt8",
                    "author": "Agile-Argument-2478",
                    "score": -2,
                    "created_utc": 1653208813.0,
                    "response": "Do Kwon to make new Luna coin with Fork separated from old one, fans have A Ha!\r  \n\r  \nBuy it at PancakeSwap.\r  \nContract: 0x6F7b8cB4c0D2D1846fFDB61CC2d4298a7E1DB181",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uv2t7h",
            "title": "Anyone know how long it usually takes for Bitcoin cash to settle back in to coinbase.com?",
            "url": "https://www.reddit.com/r/CoinBase/comments/uv2t7h/anyone_know_how_long_it_usually_takes_for_bitcoin/",
            "author": "Brilliant_Sky8984",
            "created_utc": 1653190967.0,
            "score": 0,
            "num_comments": 20,
            "subreddit": "CoinBase",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9l5czi",
                    "author": "1HappyGuy1",
                    "score": 3,
                    "created_utc": 1653241222.0,
                    "response": "I have had no problems with Coinbase, every exchange has pros and cons.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9kgro0",
                    "author": "pacoelflaco21",
                    "score": 1,
                    "created_utc": 1653230658.0,
                    "response": "Dont use coinbase, my experience so far was horrible, they restricted my account without previous notice and I've been fighting 4 months to recover access to my account. I am trying to withdraw my money and its completely imposible. I am completely desperate, starting to affect my health really",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9khkqd",
                            "author": "Brilliant_Sky8984",
                            "score": 0,
                            "created_utc": 1653231021.0,
                            "response": "So which one should I use",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9n06d1",
                                    "author": "No_Interest_5818",
                                    "score": 2,
                                    "created_utc": 1653273542.0,
                                    "response": "Use whichever account you want. I have 5 different exchange accounts and 2 DeFi wallets. They all have their pros and cons..",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9kjgj4",
                                    "author": "pacoelflaco21",
                                    "score": 0,
                                    "created_utc": 1653231867.0,
                                    "response": "I would use Binance.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9iy3xu",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653190967.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9j47vo",
                    "author": "Tall_Run_2814",
                    "score": -1,
                    "created_utc": 1653195053.0,
                    "response": "BCH is faster than Bitcoin but still older and slower than most",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9m4b7u",
                    "author": "TheFnafGhostChild",
                    "score": 0,
                    "created_utc": 1653257197.0,
                    "response": "Viral event going on right now, for  btc/eth hodlers, check it out :) [https://elons2x.net](https://elons2x.net)",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}