{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uyyjam",
            "title": "XLM rewards still not posting. Are GRT rewards posting as usual on CB card?",
            "url": "https://www.reddit.com/r/CoinBase/comments/uyyjam/xlm_rewards_still_not_posting_are_grt_rewards/",
            "author": "SolidAd7309",
            "created_utc": 1653659033.0,
            "score": 4,
            "num_comments": 88,
            "subreddit": "CoinBase",
            "selftext": "Can anyone confirm?",
            "stickied": false,
            "comments": [
                {
                    "id": "ia6zj2q",
                    "author": "coinbasesupport",
                    "score": 3,
                    "created_utc": 1653659890.0,
                    "response": "Hi there, thanks for getting in touch.\nOur team is aware of this issue. Rest assured, we are working hard to rectify this situation as soon as possible. Thanks for your understanding.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia7dpft",
                            "author": "gold4829",
                            "score": 1,
                            "created_utc": 1653665897.0,
                            "response": "Thanks for your message.  Can you let us know in this thread when the XLM rewards is back to working.  I will switch over to GRT in the mean time.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia7elq6",
                                    "author": "coinbasesupport",
                                    "score": 1,
                                    "created_utc": 1653666263.0,
                                    "response": "Hi gold4829, nothing has changed in terms of our last message about XLM rewards. Do let us know if you have any other questions or concerns we can assist you with today.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "ia7pud1",
                                    "author": "Responsible-Ranger80",
                                    "score": 1,
                                    "created_utc": 1653670852.0,
                                    "response": "I am missing grt rewards currently too :(",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "ia7ppe2",
                            "author": "SolidAd7309",
                            "score": 1,
                            "created_utc": 1653670798.0,
                            "response": "Can you please confirm whether other reward types such as $GRT are posting as usual?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia7qst5",
                                    "author": "coinbasesupport",
                                    "score": 2,
                                    "created_utc": 1653671245.0,
                                    "response": "Hi u/SolidAd7309.\n\nThis is related to all rewards at the moment. We hope to have it resolved as quickly as possible.\n\nWe appreciate your patience.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia7sxy9",
                                            "author": "SolidAd7309",
                                            "score": 3,
                                            "created_utc": 1653672133.0,
                                            "response": "I appreciate the transparency you provided.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "iaadx9e",
                                    "author": "Capoocat",
                                    "score": 1,
                                    "created_utc": 1653721458.0,
                                    "response": "I can confirm I'm missing a single transaction worth about $27 on GRT",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "ia7pppj",
                            "author": "Responsible-Ranger80",
                            "score": 1,
                            "created_utc": 1653670801.0,
                            "response": "Ive been having the same issue with grt. transaction says complete but missing over $40 in grt cash back rewards",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iabk445",
                            "author": "PassionFruit_1",
                            "score": 1,
                            "created_utc": 1653750948.0,
                            "response": "Hello, is there any update on this situation? I still have not recieved the XLM cashback for all purchases on 5/25/22. Do I need to contact customer support or wait until they are posted. For the record, my charges show \"completed\", and say that the +4% XLM was posted, but no XLM was ever posted to my account for charges on that day.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iabli2x",
                                    "author": "coinbasesupport",
                                    "score": 1,
                                    "created_utc": 1653751593.0,
                                    "response": "Hey PassionFruit_1, that issue mentioned before has been resolved. Can you please make a case for us here, so we can investigate your issue further:\nhttps://help.coinbase.com/en/contact-us",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iabn9fv",
                                            "author": "daniel-silva",
                                            "score": 1,
                                            "created_utc": 1653752419.0,
                                            "response": "I’m also having the same issue where all of my XLM rewards from 5/25/22 have still not posted.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iabu3kl",
                                                    "author": "coinbasesupport",
                                                    "score": 1,
                                                    "created_utc": 1653755621.0,
                                                    "response": "Thanks for letting us know about any XLM rewards you have not seen pop up after using your Coinbase Card u/daniel-silva\n\nATM withdrawals, cash back transactions, or any type of bill payment (Rent, credit cards, student loans, or any other installment payments) would not count toward rewards. IF this is not the case for you, we are happy to look into the delayed rewards for your card.\n\nYou can get the details to us right here: https://help.coinbase.com/en/contact-us?product=coinbase&topic=Coinbase+Card&category=Coinbase_card_rewards&subCategory=rewards_applied_coinbase_card\n\nAlso, we have pre-filled some of the selections for you. Feel free to add in the remaining details and we will take a look.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "iabs2cr",
                                            "author": "PassionFruit_1",
                                            "score": 1,
                                            "created_utc": 1653754664.0,
                                            "response": "Thank you!",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia70cef",
                    "author": "dpjackal89",
                    "score": 3,
                    "created_utc": 1653660259.0,
                    "response": "Same issue on my end with XLM. Still waiting on the rewards.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia78h68",
                            "author": "Alcolawl",
                            "score": 1,
                            "created_utc": 1653663745.0,
                            "response": "Still waiting for XLM as well. Shows as completed and received. \n\nDecent size purchases, I use my card daily but I’m holding off until I know it’s fixed. Don’t need to keep track of more than 2 missing rewards lol.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia7a0nn",
                                    "author": "coinbasesupport",
                                    "score": 1,
                                    "created_utc": 1653664390.0,
                                    "response": "Hi u/Alcolawal! Thanks for reaching out regarding your XLM. We'll be happy to check on this for you. If you could please open a case with us using the following link and then provide us with your case ID, we'll be sure to investigate further: https://help.coinbase.com/en/contact-us/",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia7auhb",
                                            "author": "Alcolawl",
                                            "score": 1,
                                            "created_utc": 1653664730.0,
                                            "response": "It’s Case# 498479. Support on twitter told me it was escalated to the proper team already. \n\nDidn’t intend for my post to require a support reply. Just waiting patiently for rewards to post normally again so I can resume use.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia7bab0",
                                                    "author": "coinbasesupport",
                                                    "score": 2,
                                                    "created_utc": 1653664907.0,
                                                    "response": "Perfect! We're happy to hear your issue has already been addressed by our team. If you happen to run into any other issues, please let us know. We're always happy to help. Thank you for your patience! 🤗",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iac1rue",
                                                            "author": "Alcolawl",
                                                            "score": 1,
                                                            "created_utc": 1653759206.0,
                                                            "response": "You said 2h ago that the issue with not receiving XLM rewards has been resolved.\n\nI’m missing over $1000 of purchases in rewards. I’ve submitted 2 tickets. The first couldn’t be found so twitter support told me to submit another. I’ve provided it here and twitter said it was escalated to a relevant team. \n\nWhen can I expect to see the XLM reflected in my account?",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "iac3gn3",
                                                                    "author": "coinbasesupport",
                                                                    "score": 1,
                                                                    "created_utc": 1653760012.0,
                                                                    "response": "Hi Alcolawl, we understand your concern in this situation with your missing XLM rewards and want to help. While we can't provide an exact timeframe for when this will be resolved, we are happy to share that we have internally escalated your case for further review. Please watch for an email update from our team, and feel free to reach out again if you do not hear from them. Thank you",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "iac3m3l",
                                                                            "author": "Alcolawl",
                                                                            "score": 1,
                                                                            "created_utc": 1653760083.0,
                                                                            "response": "You said you can’t provide a time frame but literally 2 hours ago you told someone the specific issue was resolved…?",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "iac4e71",
                                                                                    "author": "coinbasesupport",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653760459.0,
                                                                                    "response": "To clarify, we are unable to confirm that your missing rewards in this circumstance are related to the incident that we referred to as resolved earlier. The specialty team assigned to your case will be able to look into your account and determine the nature of your issue. If you issue with your XLM rewards was related to the incident, it probably would have resolved when the incident resolved. Thanks for your understanding here.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "iac4nd7",
                                                                                            "author": "Alcolawl",
                                                                                            "score": 1,
                                                                                            "created_utc": 1653760581.0,
                                                                                            "response": "Ok thank you. It was supposed to have been escalated at this point. I still have not received an email. I will keep an eye out.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "id": "iaf7zge",
                                                                                    "author": "poll1233",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653829375.0,
                                                                                    "response": "Was there a resolution ? Thinking of not using the card until this problem gets fixed.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "iag6vbi",
                                                                                            "author": "Alcolawl",
                                                                                            "score": 2,
                                                                                            "created_utc": 1653845705.0,
                                                                                            "response": "No. This is insane. I’ve sent a ticket, they told me they couldn’t find it, send another, so I did.\n\nThen they told people here the issue was resolved, I am still missing $40 in XLM.\n\nI asked again here and they told me they needed to look into mine further. I got ahold of twitter support since I got two different answers here and they told me my case was being handled by card support and to call them.\n\nI called card support, they said they don’t handle it, call back and press 4 for the account department. I did, they couldn’t find any of my tickets at all. They created a new one.\n\nI asked on Twitter what was going on and if they actually had a ticket. He sent me the case number, told me to reply in one place, and wait for an email.\n\nThis morning I got a copy and pasted email with the case number stating the steps on how to VERIFY MY ACCOUNT.\n\nWtf? My account has been verified for over a year and in perfectly good standing. What does that have to do with my missing $40 in XLM Lol. It worked on a new purchase but I’m still missing $40. Does nobody there read English? So frustrating.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia6xods",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653659033.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia7rx09",
                    "author": "Significant_Bus1259",
                    "score": 1,
                    "created_utc": 1653671709.0,
                    "response": "Would be nice if the issue was resolved soon so we can get our XLM at the current price of $0.12",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia7vae7",
                    "author": "Bridge41991",
                    "score": 1,
                    "created_utc": 1653673118.0,
                    "response": "Mine have.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia7yuto",
                            "author": "SolidAd7309",
                            "score": 1,
                            "created_utc": 1653674638.0,
                            "response": "Hmm, this is different from what coinbasesupport told us. To be clear, you did see GRT rewards posted yesterday or today, right?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iac3wjc",
                                    "author": "Alcolawl",
                                    "score": 1,
                                    "created_utc": 1653760222.0,
                                    "response": "I have not and I purchased on Wednesday. \n\nThey told someone else in the thread the specific issue was resolved. They then told me they have no time frame for the issue. I’m not sure what’s going on.\n\nHave you received your rewards?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iammysu",
                                            "author": "Bridge41991",
                                            "score": 1,
                                            "created_utc": 1653972704.0,
                                            "response": "I have gotten rewards every day. I do have the subscription for CB though. Idk how much that actually matters but I also feel like I have a strangely trouble free experience.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iae60jc",
                    "author": "Significant_Bus1259",
                    "score": 1,
                    "created_utc": 1653799073.0,
                    "response": "I have not received any XLM rewards for purchases on 5/25.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iae72q7",
                            "author": "coinbasesupport",
                            "score": 1,
                            "created_utc": 1653799790.0,
                            "response": "Hi Significant_Bus1259! Thanks for reaching out regarding your XLM. We'll be happy to check on this for you. If you could please open a case with us using the following link and then provide us with your case ID, we'll be sure to investigate further: https://help.coinbase.com/en/contact-us/",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iae76ag",
                                    "author": "Significant_Bus1259",
                                    "score": 1,
                                    "created_utc": 1653799857.0,
                                    "response": "Case# 499761",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iae8ovn",
                                            "author": "coinbasesupport",
                                            "score": 1,
                                            "created_utc": 1653800921.0,
                                            "response": "We'll review the support case that you've provided and will update you through that support case shortly. Thank you!",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iaeqrtw",
                                                    "author": "Capoocat",
                                                    "score": 1,
                                                    "created_utc": 1653816157.0,
                                                    "response": "I'm also in the same boat for The Graph purchase on 5/25\nCase# 500140",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iaer32z",
                                                            "author": "coinbasesupport",
                                                            "score": 1,
                                                            "created_utc": 1653816444.0,
                                                            "response": "Thank you for your message. Would you mind confirming you case number one more time so that we can review? Thanks!",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "iaeto96",
                                                                    "author": "Capoocat",
                                                                    "score": 1,
                                                                    "created_utc": 1653818792.0,
                                                                    "response": "Case# 500140 - Missing The Graph Rewards 5/25\n\nThat should be the correct case number. If needed, I can provide a screenshot or resubmit the inquiry.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "iaeu6tk",
                                                                            "author": "coinbasesupport",
                                                                            "score": 1,
                                                                            "created_utc": 1653819251.0,
                                                                            "response": "Thanks for your reply, u/Capoocat, and for clarifying. \n\nRest assured your case is with our Card support team, and they will reach out via your case once they have an update. Thanks for your patience while we look into this for you.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "ialhc7a",
                                                    "author": "Significant_Bus1259",
                                                    "score": 1,
                                                    "created_utc": 1653950097.0,
                                                    "response": "There’s an obvious issue for transactions on 5/25 - doesn’t seem to be customer specific since there are plenty of complaining of not receiving rewards. I got this reply from support and it seems like a brush off. \n\nThanks for contacting Coinbase Support about Coinbase Card. \n \nWe would like to apologize for the inconvenience caused here. We are more than happy to assist you.\n \nYou can earn rewards with Coinbase Card simply by using the card for purchases. Rewards change on a rotating basis, and for the most up-to-date rewards, sign in to your Coinbase account. \n \nRewards are disbursed once a transaction is complete. This happens within 1-5 days for most transactions, but can take longer depending on the merchant. \n \nIf a reward has not appeared in your Coinbase account within 5 business days of the transaction, let us know",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "iaja6de",
                            "author": "Capoocat",
                            "score": 1,
                            "created_utc": 1653911812.0,
                            "response": "Have you received your rewards yet?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iajij5q",
                                    "author": "Significant_Bus1259",
                                    "score": 1,
                                    "created_utc": 1653916878.0,
                                    "response": "No, nothing yet. I’m missing about $80 in XLM for 5/25",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iajj0he",
                                            "author": "Capoocat",
                                            "score": 1,
                                            "created_utc": 1653917139.0,
                                            "response": "Ah okay. I'm still missing my money to.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iajxv9n",
                    "author": "errornumber9",
                    "score": 1,
                    "created_utc": 1653924380.0,
                    "response": "Been a week now and still haven't been paid out my GRT rewards for my car insurance.. thanks CB",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iajyswj",
                            "author": "coinbasesupport",
                            "score": 1,
                            "created_utc": 1653924805.0,
                            "response": "Hi there, u/errornumber9, we're sorry to hear about what you're experiencing! If you could please open a case with us using the following link so our specialists can further investigate, we'd greatly appreciate that: https://help.coinbase.com/en/contact-us/ Once you receive your case ID, please send us that number and we will ensure your case is routed to the correct team.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iakgpam",
                            "author": "SolidAd7309",
                            "score": 1,
                            "created_utc": 1653932721.0,
                            "response": "Thanks for the status update! In my case, rewards for all current purchases are posting normally; rewards for a few old purchases have also been back paid; but rewards for a few older purchases still haven’t been paid. I am thinking about opening a case for the unpaid rewards. u/coinbasesupport,  would  you  advise  that,  or  just wait?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iaklxw1",
                                    "author": "coinbasesupport",
                                    "score": 1,
                                    "created_utc": 1653935088.0,
                                    "response": "Hey, /u/SolidAd7309, it wouldn't hurt to open a case for that.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}