{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ur0aid",
            "title": "Can't change adress + add birth date + don't have learn and earn",
            "url": "https://www.reddit.com/r/CoinBase/comments/ur0aid/cant_change_adress_add_birth_date_dont_have_learn/",
            "author": "lehorselessman",
            "created_utc": 1652719567.0,
            "score": 2,
            "num_comments": 2,
            "subreddit": "CoinBase",
            "selftext": "My profile page can not be edited. A support mod told be that my birthdate, etc. appears, but it doesn't on my page. Also my profile is verified, not sure why I can not learn and earn. \n\ncase  #11849954",
            "stickied": false,
            "comments": [
                {
                    "id": "i8u7e9u",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1652719567.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8u952y",
                    "author": "coinbasesupport",
                    "score": 1,
                    "created_utc": 1652720253.0,
                    "response": "Hi there, thanks for bringing this to our attention and including your case #, it makes the process quicker. We were able to do some research into your ticket #11849954 and can see that you should have received an email response yesterday. The agent assigned to your case sent over this message:\n\n\"After a review of your account, everything appears to be verified and you should be able to complete Earn tasks. We have now signed you out from your active sessions, and we suggest you log back in and try accessing Earn tasks again after 24 - 48 hours.\"\n\nAfter 48 hours, if you are still experiencing this issue, please respond to this email, and please try to follow the extended troubleshooting steps that were also provided in the same email. Thank you!",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}