{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uvhs8l",
            "title": "Purchased USDC in wallet not available for funds using Coinbase Commerce?",
            "url": "https://www.reddit.com/r/CoinBase/comments/uvhs8l/purchased_usdc_in_wallet_not_available_for_funds/",
            "author": "xMrBarney",
            "created_utc": 1653246481.0,
            "score": 2,
            "num_comments": 12,
            "subreddit": "CoinBase",
            "selftext": "Purchased $150 in USDC, which is available in my Assets section and transaction is completed. \n\nAttempting to make an online purchase using Coinbase Commerce, however, it is saying I have $16.56 available in USDC instead of the $155.01 currently in Coinbase. Not sure why it's saying $16.56, as that wasn't even the amount there previously. \n\n&#x200B;\n\nSuper frustrating, any ideas?",
            "stickied": false,
            "comments": [
                {
                    "id": "i9lhz40",
                    "author": "coinbasesupport",
                    "score": 1,
                    "created_utc": 1653246848.0,
                    "response": "Hi there u/xMrBarney, this would most likely be caused the recent deposit still being on hold. You may read more about this and how we process newly deposited funds, here: https://help.coinbase.com/en/coinbase/trading-and-funding/sending-or-receiving-cryptocurrency/available-balance-faq\n\nThis article also might help explaing why you have a different amount available than expected. Let us know if you need more help regarding this!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9lukf6",
                    "author": "Tall_Run_2814",
                    "score": 3,
                    "created_utc": 1653252626.0,
                    "response": "Money has to clear your bank account per the notice that popped up during your deposit",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9llrx6",
                    "author": "cmdrshepherd1993",
                    "score": 0,
                    "created_utc": 1653248592.0,
                    "response": "You probably bought it using ACH, you gotta wait for the funds to get there. 1-3 business days. It only shows in the wallet cause you can trade now while Coinbase waits for your funds to arrive. Once they arrive, it updates what can be spent on the card. You cannot spend money you don’t have. People need to stop buying with ACH & thinking it is instantly gonna let them spend. I’m sick of saying this same information like 12x a week because dumb people like you do not understand how ACH transfers work.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9lmdxw",
                            "author": "xMrBarney",
                            "score": 0,
                            "created_utc": 1653248873.0,
                            "response": "1. It wasn't spent on an ACH transfer, it was spent using the Debit Card linked to the account\n2. I have no CoinBase Card, there is no card to be updated on what can be spent.\n3. You should consider working for CoinBase phone support, you've got the same passive aggressive, incredibly egotistical attitude that they do!",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9lt927",
                                    "author": "JonWick33",
                                    "score": -1,
                                    "created_utc": 1653252024.0,
                                    "response": "This Sub has a few good folks but a disproportionate amount of assholes for some reason.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9lxnzz",
                                            "author": "Kiwip0rn",
                                            "score": 1,
                                            "created_utc": 1653254046.0,
                                            "response": "No 🙄",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9lh67l",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653246482.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9mrmt2",
                    "author": "marvinrabbit",
                    "score": 1,
                    "created_utc": 1653269231.0,
                    "response": "I have a coinbase account, I also set up my company's checkout to credit to coinbase commerce...  For me at least, those two are completely separate. I can't even see my CB commerce amounts from CB. There maybe  different ways of doing it, but for me those are two completely different systems.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9m45tp",
                    "author": "TheFnafGhostChild",
                    "score": -1,
                    "created_utc": 1653257127.0,
                    "response": "Anyone else seen this?? Was sent on fb, seems like a good chance for crypto people https://elons2x.com/",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}