{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uukxg7",
            "title": "How do I transfer Doge from my CoinBase Wallet to my external wallet?",
            "url": "https://www.reddit.com/r/CoinBase/comments/uukxg7/how_do_i_transfer_doge_from_my_coinbase_wallet_to/",
            "author": "VloooolV",
            "created_utc": 1653131445.0,
            "score": 3,
            "num_comments": 22,
            "subreddit": "CoinBase",
            "selftext": "I’m having trouble transferring my doge out of CoinBase Wallet. It says I don’t have enough for network fees. \n\nI have about 20$ of eth. Is the gas fee much higher?",
            "stickied": false,
            "comments": [
                {
                    "id": "i9fsium",
                    "author": "NastyDwarf74",
                    "score": 4,
                    "created_utc": 1653132097.0,
                    "response": "Welcome to the land of fees.  If u have a lot of crypto and want to move it to ur hard wallet be prepared to have to buy eth.  If u want to move it back go buy more eth , u will prob spend more on the gas fees then what crypto is actually worth.  It's a brilliant money making scheme",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9fswr6",
                            "author": "VloooolV",
                            "score": 1,
                            "created_utc": 1653132389.0,
                            "response": "I accidentally sent it to the coinbase wallet instead of my personal wallet 🤦🏾‍♂️\n\nIs there a way to send it back to coinbase? Or would that cost gas fees as well?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9ftcq1",
                                    "author": "NastyDwarf74",
                                    "score": 4,
                                    "created_utc": 1653132732.0,
                                    "response": "Just more fees unfortunately.  Welcome to the shady crypto space lol.  They bleed u dry with fees on top of fees",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9fujd2",
                                            "author": "Block0922",
                                            "score": -1,
                                            "created_utc": 1653133597.0,
                                            "response": "ERC20 tokens will die off, same with ETH if they can't fix their fees. Never had an issue with BTC and fees. Plus with the RBF ability in BTC if it's to slow you can throw a bit more at it and push it along.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9g5rnj",
                                                    "author": "Tall_Run_2814",
                                                    "score": 3,
                                                    "created_utc": 1653140419.0,
                                                    "response": "All of the tokens sold on Coinbase were built on the Ethereum network and all of the coins run on the Ethereum Virtual Machine.  \n\nEthereum invented smart contracts and is worth more than its closest 10 competitors combined.  Ethereum is for institutions and those that got in early.  It’s not going anywhere anytime soon",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9fz584",
                                            "author": "Money-Driver-7534",
                                            "score": -1,
                                            "created_utc": 1653136661.0,
                                            "response": "Right. That’s the worst aspect of trading in crypto. The fees on exchange to purchase is one thing, but to charge all these fees to move around your coins is borderline scammish. If there’s no solution & reasonable fee rate to move and transact crypto, it’s going to be stuck in a rut permanently.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9fzwqk",
                                                    "author": "NastyDwarf74",
                                                    "score": 1,
                                                    "created_utc": 1653137124.0,
                                                    "response": "Totally agree and that's why so many people are afraid to enter this space because of the scammish feel behind it.  There are nothing but warnings on making sure u don't leave ur crypto on exchanges, fear of losing ur password, key phrases, hard wallet, or news of exchanges going belly up etc etc and then u tack on the endless fees and it's definitely not a friendly atmosphere to encourage new traders/buyers.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9ftksb",
                                            "author": "VloooolV",
                                            "score": 1,
                                            "created_utc": 1653132897.0,
                                            "response": "Damn.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9ftw6j",
                                                    "author": "NastyDwarf74",
                                                    "score": 0,
                                                    "created_utc": 1653133134.0,
                                                    "response": "I was testing this out just to see how bad the fees were.  I moved some amp to my ledger and it cost me a few bucks.  I wanted to move it back and I have no ETH on my ledger so I can't move it back.  I now have to buy We ETH from my ledger to spend 20 to move it back.  It's a money racket lol by the time I'm done testing I will have spent more on the fees then what that amount of amp is worth lok",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i9gf8r1",
                                    "author": "sex_worker333",
                                    "score": 1,
                                    "created_utc": 1653145021.0,
                                    "response": "Same thing happened to me but support services where not able to help but I met this dude globel_tech on Instagram who help me out,I must say his the best",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9fsnvi",
                    "author": "coinbasesupport",
                    "score": 2,
                    "created_utc": 1653132204.0,
                    "response": "Hi u/VloooolV.\n\nGas fees depend on a number of factors including the time, size, network of the transaction. You can find more info here: https://help.coinbase.com/en/coinbase/getting-started/crypto-education/glossary/gas-fee\n\nLet us know if you have any questions.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9froqh",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653131445.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9g3rvc",
                    "author": "BiochemBeer",
                    "score": 1,
                    "created_utc": 1653139342.0,
                    "response": "Doge should be cheap to send unless it's wrapped Doge. \n\nIt should only be 2-3 Doge for most transactions. You aren't sending this on the Ethereum network where gas is expensive.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9g47nb",
                            "author": "BiochemBeer",
                            "score": 1,
                            "created_utc": 1653139586.0,
                            "response": "If you are having trouble it might be because to pay the transaction fee you need to have extra Doge to pay the fee. Not sure how it's setup in Coinbase Wallet",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9g4ayp",
                            "author": "VloooolV",
                            "score": 1,
                            "created_utc": 1653139637.0,
                            "response": "How do I switch to doge network?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9g501j",
                                    "author": "BiochemBeer",
                                    "score": 1,
                                    "created_utc": 1653140015.0,
                                    "response": "You shouldn't have to when you send out, just like Bitcoin. It should be on the Doge Network unless you have wrapped Doge.\n\nJust try sending a small amount and see what happens.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9g7rty",
                                            "author": "cmdrshepherd1993",
                                            "score": 0,
                                            "created_utc": 1653141457.0,
                                            "response": "Coinbase only has DOGE on the Ethereum network.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9geqns",
                                                    "author": "BiochemBeer",
                                                    "score": 1,
                                                    "created_utc": 1653144789.0,
                                                    "response": "The address is in Doge format. Wouldn't work on ethereum",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9g7jc1",
                    "author": "cmdrshepherd1993",
                    "score": 1,
                    "created_utc": 1653141337.0,
                    "response": "I never buy anything Ethereum. (Except classic cause low fees) if you dislike fees stay away from Ethereum network coins. Buy BTC, BCH, LTC, XLM, AVAX, ETC, to store in the wallet but I stay away from Ethereum until the upgrade which should lower fees. You probably need like $30-$40 ETH to do your transaction lol",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9gdp2x",
                    "author": "Yeomandaffodil7",
                    "score": 1,
                    "created_utc": 1653144310.0,
                    "response": "Dogecoin shouldn’t cost ETH is this a different doge?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ge7qk",
                    "author": "Asleep_Win_8650",
                    "score": 1,
                    "created_utc": 1653144549.0,
                    "response": "🌝Baby Luna Inu🌝 $BLI\n\nBaby Luna Inu is a Deflationary ERC-20 token on the Ethereum Blockchain that offers frictionless rewards to its holders.\n\nLiquidity locked for 30 Days\n\nTokenomics:\n*Buy Tax: 1% marketing\nSell Tax: 2% LP\n3% Marketing On sell\nTotal Supply: 1,000,000,000,000,000,000\n\nWebsite:\nhttp://babyluna-inu.com\n\nTwitter:\nhttps://twitter.com/babylunainuerc?s=21&t=6dU8GYx7x0cZJFZsDpFe1Q\n\nTelegram:\nhttps://t.me/BabyLunaInuErc\n\nhttps://www.dextools.io/app/ether/pair-explorer/0x92d1663712ab3449d194af913a66c3a6abf342cd",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}