{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uqvnyp",
            "title": "Is anyone experiencing the app issues atm? thanks",
            "url": "https://www.reddit.com/r/CoinBase/comments/uqvnyp/is_anyone_experiencing_the_app_issues_atm_thanks/",
            "author": "Adept_Economics_364",
            "created_utc": 1652706750.0,
            "score": 4,
            "num_comments": 25,
            "subreddit": "CoinBase",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8tdjuz",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1652706750.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8tdvuc",
                    "author": "coinbasesupport",
                    "score": 1,
                    "created_utc": 1652706920.0,
                    "response": "Hi u/Adept_Economics_364.\n\nIs there anything we can help with? Can you give us some more info on what's happening with your app at the moment?\n\nwe'll look out for your reply.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8tezh3",
                            "author": "Adept_Economics_364",
                            "score": 2,
                            "created_utc": 1652707463.0,
                            "response": "Whenever i want to enter the app nothing happens, not even the login option, just the login screen. Tried reinstall but everything is the same",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8tg0gc",
                                    "author": "coinbasesupport",
                                    "score": 1,
                                    "created_utc": 1652707967.0,
                                    "response": "Thanks for letting us know you can't log in.\n\nWe're happy to help, can you try the following steps?\n\nIf you are experiencing this issue on a desktop computer, please:\n- Update your browser to the latest version.\n- Try reproducing the issue in incognito mode.\n- Clear your browser's cache and restart your browser.\n- Test if the issue still occurs on a different browser (we recommend Google Chrome).\n- Try signing out of, then back into, Coinbase.\n- Try using our mobile app. If the issue does not appear on mobile, that will help us isolate the issue.\n\nIf you are experiencing this issue on the Coinbase mobile app, please:\n- Update the app to the latest version available.\n- Update your phone software to the latest version available.\n- Try signing out then back into the app.\n- Force quit the app and restart it.\n- Uninstall the app and reinstall it.\n- Try using our website on a desktop computer. If the issue does not appear on mobile, that will help us isolate the issue.\n\nIf you are experiencing this issue via mobile web, a tablet, or a Windows phone:\n- Coinbase is not optimized for these platforms. Please use the desktop website or an iOS/Android smartphone.\n\nIf you're still having an issue, please send our support team a message here: https://help.coinbase.com/en/contact-us\n\nLet us know if you need anything else.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8tev9r",
                    "author": "YuriyNigmatylinvkh",
                    "score": 1,
                    "created_utc": 1652707405.0,
                    "response": "Clear cache and refresh your wallet",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ve1s2",
                    "author": "R3NNYB",
                    "score": 1,
                    "created_utc": 1652736860.0,
                    "response": "Yeah I can't log in on my phone, the app just loads forever. Have done everything like clearing my cache, uninstalling the app etc.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8vgq5p",
                            "author": "coinbasesupport",
                            "score": 1,
                            "created_utc": 1652738020.0,
                            "response": "Hey u/R3NNYB, if this is a consistent problem, would you mind reaching out to our support team and letting them know what version of the application you are using, and the model/OS of your phone? There can be many reasons that the app might face issues like this, and we'd like to get your situation recorded and addressed whenever you'd like.\n\nPlease contact us with this information by using the contact us portal, here: https://help.coinbase.com/en/contact-us/",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i961czz",
                    "author": "HqrkatMatt",
                    "score": 1,
                    "created_utc": 1652936363.0,
                    "response": "🔥 DINOSTEP.APP 🔥\n\n🦖 The First Move To Earn App With Virtual Dinosaurs\n👟 Earn while building healthy habits with the Dino\n✨ Varied NFTs\n💵 Passive Income Features\n💎 App Activation Code & NFT Drop For Fair Launch Contributors\n\n🚀 Fair Launch Starts On May 9th",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}