{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "v12wrb",
            "title": "Coinbase Card rewards are not populating.",
            "url": "https://www.reddit.com/r/CoinBase/comments/v12wrb/coinbase_card_rewards_are_not_populating/",
            "author": "see_with_sound",
            "created_utc": 1653925103.0,
            "score": 4,
            "num_comments": 21,
            "subreddit": "CoinBase",
            "selftext": "I’ve been using the card for some time now and never had an issue until now. With the new rotating rewards, I selected XLM. I’ve made some purchases and some have given me the rewards while others haven’t. I look at the history and it’s been about 4-5 days since. I click on the purchase and even says 4% of rewards has been given. Even the statuses say “completed”. But when I look at my XLM balance, nothings changed. Even in XLM history it doesn’t show any of the cards purchases that say completed. Anyone else having this issue?",
            "stickied": false,
            "comments": [
                {
                    "id": "iak1z5d",
                    "author": "coinbasesupport",
                    "score": 2,
                    "created_utc": 1653926227.0,
                    "response": "Hi there u/see_with_sound, we appreciate you bringing this to our attention! We'd be happy to assist you with this. If you could please open a case with us using the following link and then provide us with your case ID once you receive it, we will be sure to investigate this issue further: https://help.coinbase.com/en/contact-us/",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iakzbp9",
                            "author": "Ryzzthebizz",
                            "score": 1,
                            "created_utc": 1653941327.0,
                            "response": "Do you know when UK users will be able to earn rewards using their Coinbase card?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ial1vy5",
                                    "author": "coinbasesupport",
                                    "score": 2,
                                    "created_utc": 1653942554.0,
                                    "response": "Hey RyzztheBizz, THere is nothing in this article here about rewards with the Card with UK holders:\nhttps://help.coinbase.com/en/coinbase/trading-and-funding/other/coinbase-card-faq\n\nWe say just keep a look out on the main channels for Coinbase for any announcements! Please do not hesitate to reach out with anything else!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ial6ba1",
                    "author": "989x4000",
                    "score": 2,
                    "created_utc": 1653944650.0,
                    "response": "It is an American holiday today try waiting until Tuesday to see if it arrives",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iakb37i",
                    "author": "TStaysHumble",
                    "score": 1,
                    "created_utc": 1653930237.0,
                    "response": "It appears no rewards were actually distributed from 5/25/22-5/27/22. I hope this is addressed by Coinbase soon. I’ve referred a lot of people based solely on the card as an entry into cryptocurrency.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iakdtnm",
                            "author": "see_with_sound",
                            "score": 1,
                            "created_utc": 1653931439.0,
                            "response": "Appreciate the response. Those are actually the dates of when purchases were made. I use to use CB for everything. But when it comes to needing support, it’s non existent. I lost count of tickets where someone was suppose to get back to me and still have yet to have someone reach out about an open ticket. I had to order a new number for my card and this new card I have, I get an invalid institute number error at some stores and some online sites. I mainly just use it for the card and get rewards. But that’s coming to a decline. Pretty sad.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iakfj6y",
                                    "author": "TStaysHumble",
                                    "score": 1,
                                    "created_utc": 1653932201.0,
                                    "response": "I will give them the benefit of the doubt for now as they have made me whole for other mistakes on their part. But I will proceed with caution and pay more attention to my transactions. \n“Never attribute to malice that which is adequately explained by stupidity.” Or incompetence in this case.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "ialy9wg",
                            "author": "solongsweetkarma",
                            "score": 1,
                            "created_utc": 1653958821.0,
                            "response": "I received my 4% XLM using the card on all of those dates, sometimes it takes a few days for it to finally post I’ve noticed",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iajzgws",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653925103.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iakreaz",
                    "author": "TheLegendaryWizard",
                    "score": 1,
                    "created_utc": 1653937589.0,
                    "response": "Same thing for me with GRT, I spend 650 dollars with the card and should have gotten 25 dollars in GRT, it says completed, but I never got the crypto",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaktb1e",
                            "author": "coinbasesupport",
                            "score": 1,
                            "created_utc": 1653938489.0,
                            "response": "Hey, /u/TheLegendaryWizard, you're also welcome to open a case with us using the following link, if you'd like: https://help.coinbase.com/en/contact-us/ We appreciate the chance to help here.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ialb7ul",
                    "author": "Glittering_Rub2089",
                    "score": 1,
                    "created_utc": 1653947047.0,
                    "response": "Same thing happened to me and then on the 29th I got them. In the transaction history it said they were paid out but nothing showed up in my xlm wallet until the 29th. Original transaction were from 25th-28th",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ialbu3y",
                    "author": "poyoso",
                    "score": 1,
                    "created_utc": 1653947357.0,
                    "response": "This was happening to me last week but after a couple of days rewards were accrued.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ian4g1d",
                    "author": "Sea_Community5436",
                    "score": 1,
                    "created_utc": 1653987026.0,
                    "response": "/filter template\n$BOKAY Stealth Launch \n🔥🔥🔥🔥👌🏽👌🏽👌🏽👌🏽\n\nTG: https://t.me/burn_okay\n\nWeb: http://www.bokay.fun\n\nTwitter: https://twitter.com/burnokaytoken",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iak2lvr",
                    "author": "dfk814",
                    "score": -2,
                    "created_utc": 1653926506.0,
                    "response": "Hey, they are swindlers.  Cut up the card. Only one getting “rewarded” is CEO, Brian Armstrong.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iak7ugy",
                            "author": "TimeIsTheEnemy94",
                            "score": 2,
                            "created_utc": 1653928808.0,
                            "response": "The fuck are you talking about",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}