{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "us55rf",
            "title": "Coinbase card top up and cashback rewards choice",
            "url": "https://www.reddit.com/r/CoinBase/comments/us55rf/coinbase_card_top_up_and_cashback_rewards_choice/",
            "author": "Unkn0wnShadow",
            "created_utc": 1652849777.0,
            "score": 1,
            "num_comments": 3,
            "subreddit": "CoinBase",
            "selftext": "Hello everyone. I just received and activated my Coinbase card, however, I don't have any button or field in the App where I can view my card or choose what coin to receive the cashback in. \n\nI've looked at 2 month old videos in YouTube and the App has 6-7 buttons to click around from, but mine has only 4 and no card tab or anything of that sort.\n\nDoes anyone have any tips or a video tutorial in case I'm missing something?",
            "stickied": false,
            "comments": [
                {
                    "id": "i91exym",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1652849778.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i91febw",
                    "author": "TripTryad",
                    "score": 1,
                    "created_utc": 1652850082.0,
                    "response": "Have you tried clicking the \"Pay\" option on the app? I think its the far right option on the bottom. It takes you to the card where you can add funds, choose your cashback and tap the card itself to view the card details.\n\n&#x200B;\n\nUnless you JUST signed up. If you did, you may not have been issued card details yet.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i91shr5",
                            "author": "Unkn0wnShadow",
                            "score": 1,
                            "created_utc": 1652860558.0,
                            "response": "Yes, I've tried that, but the only option there is to send crypto to a friend. I've had the account for almost a month now as well",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}