{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "rcoiqj",
            "title": "Trading, withdrawing, depositing all locked on my account despite having taken the proper actions.",
            "url": "https://www.reddit.com/r/CoinBase/comments/rcoiqj/trading_withdrawing_depositing_all_locked_on_my/",
            "author": "marxistmanamonster",
            "created_utc": 1639076457.0,
            "score": 4,
            "num_comments": 6,
            "subreddit": "CoinBase",
            "selftext": "I was notified by a box that appeared in the Coinbase pro app that an ACH transfer I had made for a deposit a few days ago had failed, and that I wouldn't be able to trade, withdraw or deposit until it is resolved. I followed the instructions and made the payment yesterday afternoon. Coinbase sent me an email confirming \"funds recovery complete,\" but that my account may still have restrictions. \n\nToday, I no longer see the box in the app saying that my account has been limited. However, I still can't deposit, trade, withdraw etc. \n\nWhen can I expect these limits to lift off of my account?",
            "stickied": false,
            "comments": [
                {
                    "id": "hnw1ica",
                    "author": "coinbasesupport",
                    "score": 1,
                    "created_utc": 1639078312.0,
                    "response": "u/marxistmanamonster Thanks for reaching out. If you would please raise a support ticket with us [here](https://help.coinbase.com/en/contact-us), and then share your case number in this thread, we can escalate to the relevant team for an expedited review for you. Thanks!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hnvwxnf",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1639076457.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}