{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "utn2mr",
            "title": "Beginners Question…",
            "url": "https://www.reddit.com/r/CoinBase/comments/utn2mr/beginners_question/",
            "author": "SoggyApricot100",
            "created_utc": 1653028079.0,
            "score": 2,
            "num_comments": 20,
            "subreddit": "CoinBase",
            "selftext": "Hello and apologies in advance as this may be a rather dumb question…\n\nI have JUST downloaded the Coinbase IOS app and made my first very small crypto investment. Needless to say, I am pretty new and ignorant to this so there are many things I’m still figuring out; including the general workings of the app and the interface. \n\nI have invested some of my local currency (GBP) into Eutherium which I can see listed on my assets screen, but underneath them I can also see Euros listed as €0. \n\nAs my currency is set to GBP and I haven’t got any existing assets in Euro, I’m wondering why this is on my list at all? Is there anything I can do to take it off so that I’m not looking at an empty listing?\n\nThanks!",
            "stickied": false,
            "comments": [
                {
                    "id": "i9aqmo5",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653028080.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9bw5is",
                    "author": "anon977577",
                    "score": 1,
                    "created_utc": 1653055258.0,
                    "response": "\\>very small crypto investment.\n\nCongrats but also condolences it's a landfill fire in the wild wild west out here.  One thing you'll have trouble getting down is that the offerings from coinbase are no different than US Dollars, they can be debased by the people who run them.  The Government hates everything about Cryptocurrency even stablecoins.\n\nI am pretty new and ignorant: (We all are, before we get 1, 2, 5, and 10 years experience).  Coinbase just sunk 100% of their customer's faith into WLUNA which was shown to be a textbook ponzie:\n\n[https://www.youtube.com/watch?v=y\\_otSD3LYCA](https://www.youtube.com/watch?v=y_otSD3LYCA)\n\n[https://www.youtube.com/watch?v=4VNsuwS26pM](https://www.youtube.com/watch?v=4VNsuwS26pM)\n\nRead the 9500 page EULA again, coinbase isn't responsible for their offerings turning out to be nothing but people handing out thin air in exchange for cold hard cash.\n\nIf you do not personally and thoroughly understand how your cryptocoin works down to the bare metal and back, and how it works in reality and between two operators and how the riggings are attached to the real world, then you're lost in the woods paying money for leaves and pebbles you find on the ground, freshly lifted by scoundrels.\n\nAlso you can feel that Congress and the SEC are about to run in and clean everyone's clocks in regards to the recent stablecoin scams, and total losses produced by them, offered by binance exchanges, the one in your url notwithstanding.\n\n[https://www.youtube.com/watch?v=WxxyDMBRu9E](https://www.youtube.com/watch?v=WxxyDMBRu9E)\n\nWelcome to the house of clowns and mirrors, where everyone is selling their own Disney Bucks, Caesar Bux, and $Unique\\_Name\\_Bucks they lifted from thin air for $price\\_where\\_buyer\\_meets\\_seller .\n\nPlay it like you play scratch tickets at the gas station lottery.  Expect to lose 100.0% of your investment most of the time, in the hope (a very tiny one) to catch the next altcoin unseating Bitcoin in market cap.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9dqlqm",
                    "author": "Accomplished-Way7608",
                    "score": 1,
                    "created_utc": 1653083727.0,
                    "response": "Your money is gone. Welcome to cryptoland!",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}