{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ur6vr4",
            "title": "Account hacked. Everything stolen. All Authenticators failed. Coinbase support going nowhere. And the wire transfer is still pending!",
            "url": "https://www.reddit.com/r/CoinBase/comments/ur6vr4/account_hacked_everything_stolen_all/",
            "author": "JonahStaab",
            "created_utc": 1652737368.0,
            "score": 0,
            "num_comments": 50,
            "subreddit": "CoinBase",
            "selftext": "May 14th I wake around 9:30am to find that my coinbase balance is at $0.00 and my gmail is being bombarded with spam. I manage to find emails from coinbase at 8:07am stating the first bit of my portfolio was sold and converted to cash and wired off. I signed into coinbase and found a Chime and Sable bank account that were randomly added to my account. \n\nI had google authenticator enabled, I received no 2 fa text, no new device sign in email, no anything. Somehow everything was breached. \n\nThe account sign-in log doesn't even show anyone was on my account at the time of the transfers. \n\nI contacted support and asked them to stop/reverse these transfers and they say they can't. I even contacted Chime and Sable explained stolen funds are on the way to the account numbers. No luck.\n\nDoes anyone have any ideas or has been in this situation? I really hate to believe that coinbase is going to just sit back and make me watch my $20,000 be sent off into the sunset on a pending wire transfer to some thief when their security failed in every way. \n\nEspecially when they had the account information and time on their side.\n\nCASE#  11845720",
            "stickied": false,
            "comments": [
                {
                    "id": "i8vxtt1",
                    "author": "Tall_Run_2814",
                    "score": 13,
                    "created_utc": 1652746069.0,
                    "response": "You're bullshitting.  You don't receive text if you're using Google authenticator.  \n\nEither you use an authenticator app or SMS text for 2FA, not both on the same account.  This leads me to believe you weren't using either which therefore explains perfectly how and why this happened.  \n\nSorry for your loss but this space is a place for us to learn from each others successes and failures and that can only take place with honesty.  Best of luck",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8vzo54",
                            "author": "JonahStaab",
                            "score": 1,
                            "created_utc": 1652746996.0,
                            "response": "Very quick to draw a conclusion rather than ask and conversate. That doesn't seem like something a person wanting to learn would do. \n\nBut if this is true then it would have been on text 2fa. I had to get a new phone about a month ago. That phone had my authenticator on it and I had to go through the identity verification process to get signed back in once I got a new phone as I could not access the authenticator on my other phone because it was broken. \n\nThe reason I said it had both, is because upon signing into my account and checking the security tab, it listed both the authenticator and text 2fa as enabled and \"very secure. \"",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8x2ao2",
                                    "author": "ndreamer",
                                    "score": 1,
                                    "created_utc": 1652769787.0,
                                    "response": "Do you have cloud sync turned on for backups ? Did you download anything on your phone recently (apps) \nCheck your email history, look at app passwords/single sign on, filters and email forwarding",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9bvs6z",
                                    "author": "Tall_Run_2814",
                                    "score": 1,
                                    "created_utc": 1653055101.0,
                                    "response": "Someone hacked your SIM and has access to your phone, text, etc.  Thats how it happened.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8vqobe",
                    "author": "y90210",
                    "score": 5,
                    "created_utc": 1652742553.0,
                    "response": "You used text for 2fa?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8vsm9k",
                            "author": "JonahStaab",
                            "score": -4,
                            "created_utc": 1652743493.0,
                            "response": "I had google authenticator and text 2fa yes",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8w02g1",
                                    "author": "y90210",
                                    "score": 6,
                                    "created_utc": 1652747196.0,
                                    "response": "It's one or the other, and sms is how people take over your account, they clone your sim and get your verification texts.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8w0jxb",
                                            "author": "JonahStaab",
                                            "score": 0,
                                            "created_utc": 1652747441.0,
                                            "response": "Thank you. \n\nYes it was sms verification as I'm guessing google authentication was disabled once I finished the identity verification process to regain access to Coinbase after my old phone with authenticator was destroyed. \n\nAny idea why it would not show a device login or new device connection?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8x3sxd",
                                                    "author": "Distinct-Vanilla-788",
                                                    "score": 4,
                                                    "created_utc": 1652771073.0,
                                                    "response": "You got sim swapped. Contact you SIM card provider. That’s how to handle it.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8vqlh8",
                    "author": "Turbulent-Ad-6845",
                    "score": 3,
                    "created_utc": 1652742514.0,
                    "response": "For sure on regular coinbase need Yubikey for 2FA ...Hope you get some help",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8x2f4z",
                            "author": "ndreamer",
                            "score": 1,
                            "created_utc": 1652769893.0,
                            "response": "It’s certainly the easiest way and a very cheap way to secure your device.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8wchnz",
                    "author": "Brbz0rz",
                    "score": 3,
                    "created_utc": 1652753419.0,
                    "response": "Should been holding ETH 2. You'd still have that!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8wif0n",
                    "author": "seektolearn",
                    "score": 2,
                    "created_utc": 1652756492.0,
                    "response": "can someone please explain the process of how to whitelist? This sounds like a good security measure, but I'm not sure how to do it. thank you in advance",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8wkwm1",
                            "author": "Kiwip0rn",
                            "score": 1,
                            "created_utc": 1652757863.0,
                            "response": "(I am trying to do this by only memory)\nGo into CB Pro click your name (or the ... on the phone's browser) \nClick \"address book\"\nAnd toggle the \"Whitelisting\" to on.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8wm31i",
                                    "author": "seektolearn",
                                    "score": 1,
                                    "created_utc": 1652758541.0,
                                    "response": "ok thanks, i'll check it out!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8w0qms",
                    "author": "atomicreload",
                    "score": 1,
                    "created_utc": 1652747535.0,
                    "response": "Did you have whitelisting on? So that the crypto could only be sent to your authorized addresses?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8w1dkv",
                            "author": "JonahStaab",
                            "score": 2,
                            "created_utc": 1652747854.0,
                            "response": "I don't believe so. I may have done that when I started but whoever got into my account added multiple bank accounts to it",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8w2vr2",
                                    "author": "atomicreload",
                                    "score": 3,
                                    "created_utc": 1652748601.0,
                                    "response": "Don't take this the wrong way I'm just going to tell you straight. Considering your other comments and your original, I don't think you understand crypto, CB's account security tools, or general cyber security practice very well. I'm sorry dude it really sucks and I hope you have a miracle come your way. But you don't seem to understand the security you had in place well enough to explain it for strangers on reddit help you.\n\nI truly hope you get somewhere with CB's customer service though. They are almost criminally ignorant, and when they do reply they just gaslight you with your own ignorance of how their whole platform works.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8w4plp",
                                            "author": "JonahStaab",
                                            "score": 3,
                                            "created_utc": 1652749515.0,
                                            "response": "Thanks. I definitely do not know that much about it. But I don't know what I haven't been able to answer though.  I know what you mean by whitelisting the bank accounts. \n\nIsn't that the point of Coinbase? A more user friendly platform that doesnt require a vast knowledge to invest and protects your assets?\n\nHind site is 2020 and yes I'm paying the price. Definitely an eye opener for how much Coinbase does for people.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8xsrc3",
                                                    "author": "QAnonRetard",
                                                    "score": 2,
                                                    "created_utc": 1652790741.0,
                                                    "response": "There is no such thing as “the point of coinbase”. Stop trying to blame others, you are 100% at fault",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i8xsv5l",
                                                    "author": "QAnonRetard",
                                                    "score": 2,
                                                    "created_utc": 1652790801.0,
                                                    "response": "Also there is no such thing as “what Coinbase does for people”.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8vussj",
                    "author": "Accomplished-Way7608",
                    "score": -6,
                    "created_utc": 1652744561.0,
                    "response": "Your money is gone. This is most likely an inside job by a Coinbase employee offshore. They have all your info and are outside US law. Happened to literally thousands of customers. Scams and fraud are rampant in unregulated cryptoland.\n\nBest thing to do is call your congressman and news media. Tell them your story.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8vyn3p",
                            "author": "JonahStaab",
                            "score": 2,
                            "created_utc": 1652746481.0,
                            "response": "Interesting. I got an alert 10+ days ago that my Gmail was potentially breached by malware on my computer. I ran windows defender, avast, and spybot. Everything checked out. And I never use my computer to sign in to Coinbase or anything that is high security for this reason. \n\nEven if this was the case I just don't know how there is no trace or anything at all",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8w74l8",
                                    "author": "cmdrshepherd1993",
                                    "score": 3,
                                    "created_utc": 1652750727.0,
                                    "response": "You need to do the following: Stop using Google anything. Change to protonmail and no gmail; get a yubikey or Authy for 2FA; enable Whitelisting. Get a cold wallet or at least a hot wallet but write your seed phrase down, put it in a safe. Don’t share it with anyone or any business or any site for any reason. Ever. And NEVER have $20,000 in an exchange. You put it in your private wallet.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8zw0hs",
                                            "author": "Accomplished-Way7608",
                                            "score": 2,
                                            "created_utc": 1652822666.0,
                                            "response": "How do you sell and cash out without an exchange??",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8zwwnl",
                                                    "author": "cmdrshepherd1993",
                                                    "score": 1,
                                                    "created_utc": 1652823050.0,
                                                    "response": "When you wanna pull some out, send from your wallet to the exchange & either spend on the card associated with your exchange or send to your bank. \n\nExample: $50,000 in BTC in private wallet, *walks down the street* “I want to buy Ice-Cream, I’ll need $5” *sends $10 of the $50,000 to exchange & cashes out to bank or spends on Coinbase card to get 4% back. But rest of the money is safe in private wallet.* easy peasy, lemon squeezy, pumpkin cheesy my guy.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i934kfl",
                                                            "author": "Accomplished-Way7608",
                                                            "score": 1,
                                                            "created_utc": 1652889154.0,
                                                            "response": "Sounds too complex for a layman like me. That's why I don't ever see mass adoption happening.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i93az2p",
                                                                    "author": "cmdrshepherd1993",
                                                                    "score": 1,
                                                                    "created_utc": 1652891760.0,
                                                                    "response": "Okay it’s not. If you had $200 cash and wanted to spend it on your bank card, you have to send that money from your wallet to your card to spend it which you could use an atm to deposit.  So money in wallet to exchange (bank) to spend. But keep in your wallet lol simple",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i8wlhsm",
                                            "author": "Kiwip0rn",
                                            "score": 2,
                                            "created_utc": 1652758201.0,
                                            "response": "Looking down this post, they either have absolutely no idea what they are doing, or just plain lying.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9eclgr",
                    "author": "VeryStrongg",
                    "score": 1,
                    "created_utc": 1653094906.0,
                    "response": "🐲Lil Dragon $LDG NFT Metaverse for human resources Evolved to create hyperlinks between Cryptocurrencies, NFT ecosystem and Metaverse.\n\nPresale live now on Pinksale: https://www.pinksale.finance/#/launchpad/0x058d5489433b49bDb86E7A6f195b5EA12d6A82d8?chain=BSC\n\n✅Audit by TechRate\n✅Metaverse beta version\n✅Listed in CMC\n\n📌We will launch on Pancakeswap after Presale.\n\nFollow our official social media for more info:\nWebsite: https://lildragon.io/\nTelegram: https://t.me/LilDragonOfficial\nTwitter: https://twitter.com/LilDragOfficial",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9h7gjk",
                    "author": "balamsapero",
                    "score": 1,
                    "created_utc": 1653158022.0,
                    "response": "Am fully ready for #BULLRUN \nStacked up my bags filled with DeppDoge \n\nHeading to the moon 🚀🚀🚀\n#BSC\nhttps://t.me/deppdoge",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9hv50k",
                    "author": "unkoshanks1",
                    "score": 1,
                    "created_utc": 1653169796.0,
                    "response": "🏄SO CAL TOKEN OFFICIAL 🏄\n\nWelcome to SO CAL Token and ride the biggest wave in crypto. We offer staking, NFTs, P2E surfing game, yoga, sound bath, crypto classes and we will be developing the Caliverse a fully functional world with endless possibilities.\n\n🔥🔥INTER-FI AUDIT COMPLETE 🔥🔥 \n🚀🚀 finalized a deal with Moonboyz 🚀🚀\n7 AMAs\n🎙️Cesar's Calls\n🎙️Venom\n🎙️Phoenix\n🎙️Achilles\n🎙️Rug Free House\n🎙️The Futures Lounge\n🎙️Anti Ruggers\n🎙️Moonboyz Crypto\nShill army, Pinksale Trending and a bunch of other marketing tactics. GET READY\n\nTelegram: t.me/socaltokenoffical\n\nPromoted by t.me/MOONBOYZ_CRYPTO #928",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "ur6ulj",
            "title": "testing",
            "url": "https://www.reddit.com/r/CoinBase/comments/ur6ulj/testing/",
            "author": "jsp1073",
            "created_utc": 1652737278.0,
            "score": 0,
            "num_comments": 47,
            "subreddit": "CoinBase",
            "selftext": "Can I post here??",
            "stickied": false,
            "comments": [
                {
                    "id": "i8vg5hm",
                    "author": "Worried_Possession94",
                    "score": 2,
                    "created_utc": 1652737767.0,
                    "response": "Yes",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8vof2m",
                    "author": "imacryptohodler",
                    "score": 1,
                    "created_utc": 1652741490.0,
                    "response": "Confirmed",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8wlxqz",
                    "author": "Kiwip0rn",
                    "score": 1,
                    "created_utc": 1652758455.0,
                    "response": "And a 100 new friends in your DM for making a Post. \n\nDO NOT DO ANYTHING they say to do.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9h7h53",
                    "author": "balamsapero",
                    "score": 1,
                    "created_utc": 1653158030.0,
                    "response": "Am fully ready for #BULLRUN \nStacked up my bags filled with DeppDoge \n\nHeading to the moon 🚀🚀🚀\n#BSC\nhttps://t.me/deppdoge",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}