{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uwjmuo",
            "title": "Coinbase customer service hung up on me",
            "url": "https://www.reddit.com/r/CoinBase/comments/uwjmuo/coinbase_customer_service_hung_up_on_me/",
            "author": "chubbyzucchini",
            "created_utc": 1653370480.0,
            "score": 1,
            "num_comments": 11,
            "subreddit": "CoinBase",
            "selftext": "So I've been trying to sell my dogecoin and convert it to USD, however I am unable to sell it. My money is stuck in dogecoin, so I decided to call customer service. They told me, they're not sure so they will email me and update me. I recieved an email which stated the reason I called. Included in the email: if I don't recieve a response within 6 days, I should reply back. I heard nothing, and responded saying it still wasn't working. They responded with a generic email giving me troubleshooting methods, most of which I've tried. I already told them the various troubleshooting I tried. So I called them tonight, and they just had me troubleshoot the same things over and over again. I hit my verification limit for 24 hours. So after wasting this time the issue wasn't solved. They told me, that now I'm  going to have to wait another 24 hours for anything to be done ( its already been 8 days) When I told them this, and asked if I could speak to a manager after being told that I should get and email and just to respond to that email (again) they told me I could not speak to a manager. It ended with them hanging up and me, and my money still stuck in coinbase. Screw Coinbase. \n\nPs: I read other posts of people having this exact issue. I haven't seen any resolve.\n\nEdit: I forgot that the customer service person put me on hold for 5 minutes without notifying me. They also were playing games by suddenly placing me on hold and then coming back. Also edit for spelling.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9tnpgj",
                    "author": "coinbasesupport",
                    "score": 1,
                    "created_utc": 1653409520.0,
                    "response": "Hey there u/chubbyzucchini I'm sorry to hear about your experience when trying to sell your Doge. I would love to be able to assist you further. If you could please provide me with your case ID,  I will be sure to look into this for you. Thank you in advance!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9rxfms",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653370480.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9rxpmr",
                    "author": "Kiwip0rn",
                    "score": -3,
                    "created_utc": 1653370691.0,
                    "response": "Okays 🙄",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9rxve6",
                            "author": "chubbyzucchini",
                            "score": 1,
                            "created_utc": 1653370811.0,
                            "response": "Uh what? Like why the eye roll? This is B.S",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9ryi17",
                                    "author": "SneakyHump69",
                                    "score": 3,
                                    "created_utc": 1653371287.0,
                                    "response": "Did you have your doge for less than 7 days?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9rzbof",
                                            "author": "chubbyzucchini",
                                            "score": 1,
                                            "created_utc": 1653371922.0,
                                            "response": "No, I had it for more than a week when this first occurred.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9t8yj3",
                                    "author": "Emerald_Flamingos",
                                    "score": 1,
                                    "created_utc": 1653403375.0,
                                    "response": "🥝 is a sponsored troll, don't worry 'bout them. YSK this sub is mostly used by bad actors to try and con crypto newcomers, as is ConBase itself IMO. \n\nGood luck getting your issue resolved, but don't hold your breath for ConBase to help in any way whatsoever. I would start looking into other methods to find restitution; ConBase loves their legalese, but it's mostly just a deterrent. They contravene their TOS constantly, so customer legal complaints tend to hold water and are actually dealt with favorably to the user. That's just my 2¢ though. \n\nGood luck OP.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9rxz42",
                                    "author": "Kiwip0rn",
                                    "score": -2,
                                    "created_utc": 1653370885.0,
                                    "response": "🙄 👍 okays 🤷‍♂️",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "id": "uwjja7",
            "title": "email: Action Required for Users Impacted by Recent EU Sanctions. Account deleted after verifying.",
            "url": "https://www.reddit.com/r/CoinBase/comments/uwjja7/email_action_required_for_users_impacted_by/",
            "author": "creekNew",
            "created_utc": 1653370052.0,
            "score": 1,
            "num_comments": 14,
            "subreddit": "CoinBase",
            "selftext": "I received an email from help@coinbase.com on May 5th regarding EU sanctions on russian citizens (Action Required for Users Impacted by Recent EU Sanctions). \n\nI live in the EU and it obviously does not apply to me.\n\nOther redditors received the same email recently (https://www.reddit.com/r/CoinBase/comments/uh8qds/is_this_email_legit/?utm_source=share&utm_medium=ios_app&utm_name=iossmf), where people who live in the EU receive this.\n\nEmail is signed by coinbase.com, ends with coinbase.com and does not contain any foreign unicode letters that looks like latin. So it seems legit.\n\nThe email said the account will be frozen by May 31st if I don't upload documents verifying that this does not apply to me (I live in the EU) to this service: https://coinbase.sendsafely.com/dropzone/cx-files/xxxx\n\nIt seems this link is also legit (according to official reddit coinbase support, I found similar links here on reddit asking that and support confirms it is ok; there were also some redditors asking on twitter and it was confirmed as well). There are some older reddit posts with users having mixed responses though.\n\nIt also says on official website that coinbase use sendsafely to receive documents from users (https://help.coinbase.com/en/coinbase/managing-my-account/update-my-account/additional-information-verification)\n\nSo overall, it seems like an legit email. To my inquiry I also received an email from security@coinbase.com saying that it was legitimate email.\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nAfter I uploaded the documents I received an email on May 17th telling me the access to my account was restored.\n\nBut today (May 24th) my account was deleted because of terms violations (i only withdrew remaining couple of Euros from my account because the email asked me).\n\nIt seems to me unlikely that it is a scam since an email and links were legit (I surely hope so), as well as other reddit discussions (see link in the beginning) but rather a mistake from coinbase.\n\nPlease help with the advice. I can't reach coinbase by phone (because account deletion) so I sent them email but they have not respond yet.\n\nAny response from r/coinbasesupport or r/coinbasesecurity will be appreciated.\n\n\n\nthank you",
            "stickied": false,
            "comments": [
                {
                    "id": "i9tp5j5",
                    "author": "coinbasesupport",
                    "score": 1,
                    "created_utc": 1653410103.0,
                    "response": "Hi there u/creekNew I appreciate you providing us all this detail and ensuring that the emails your received were legitimate. I truly wish to assist you with this. If you could please provide us with your case ID so we may investigate this further, we'd greatly appreciate that. Thank you in advance!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9rwuq7",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653370053.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9rx5y1",
                    "author": "coinbasesupport",
                    "score": 1,
                    "created_utc": 1653370283.0,
                    "response": "Hey there, u/creekNew. Can you please share with us your case number? If you haven't yet, please raise one here and share with us the case number: https://help.coinbase.com/en/contact-us",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}