{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uqyfk7",
            "title": "Dogecoin not transferring to Nano S",
            "url": "https://www.reddit.com/r/CoinBase/comments/uqyfk7/dogecoin_not_transferring_to_nano_s/",
            "author": "IamnotabotnamedJon",
            "created_utc": 1652714586.0,
            "score": 2,
            "num_comments": 7,
            "subreddit": "CoinBase",
            "selftext": "Hi all, I bought a new Nano S and yesterday I set it all up and tried to transfer my crypto onto it.  First I did my Bitcoin and It gave me a message that it could take up to 15 minutes (I think) to transfer. Almost instantly I received an email saying it sent it to the account I gave it.  Within a few minutes I noticed the it was now showing up in my Nano \"Leger-Live\" and was gone from the Coinbase account. No problem.\n\nNext, I did the same procedure for my Dogecoin.  This time it said It may take up to \"6 hours\" to transfer.  Once again I received and email saying it sent to the correct account.  Well it's now been over 12 hours and the dogecoin is still in the coinbase account and not showing up in my Leger-Live.\n\nWhat gives?",
            "stickied": false,
            "comments": [
                {
                    "id": "i8tv34h",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1652714586.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8tv9kb",
                    "author": "coinbasesupport",
                    "score": 1,
                    "created_utc": 1652714662.0,
                    "response": "Hey! Apologies for Do you have a case# for us to investigate further?  If not, can you please make a case here, so we can look into your issue further:\nhttps://help.coinbase.com/en/contact-us",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8tvkw8",
                            "author": "IamnotabotnamedJon",
                            "score": 1,
                            "created_utc": 1652714795.0,
                            "response": "No case yet, I was just now starting to investigate this myself and asking on reddit if anyone here knew what was happening.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8tx7z4",
                    "author": "Tall_Run_2814",
                    "score": 1,
                    "created_utc": 1652715472.0,
                    "response": "[https://support.ledger.com/hc/en-us/articles/115005174025-Dogecoin-DOGE-?docs=true](https://support.ledger.com/hc/en-us/articles/115005174025-Dogecoin-DOGE-?docs=true)\n\nLearn to use Ledger Support site",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8u8l9s",
                    "author": "IamnotabotnamedJon",
                    "score": 1,
                    "created_utc": 1652720036.0,
                    "response": "Ok - thanks for all the support on chats all.  It turns out it was just my eyes failing me.  I had a small letter instead of a capital letter in my send code.  Once I redid the send with the correct address, it went right through.   My bad.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ufzgh",
                    "author": "closeupp",
                    "score": 1,
                    "created_utc": 1652722974.0,
                    "response": "$MOVEN Fairlaunch on Pinksale\nThis project potential 100x gains\n✅ KYCed \n✅ Audited contract \n✅ #2 trending\n✅100+ KOLs Partners Social marketing \n✅ Partnerships with Sport Brands\n✅ Alpha Test will be available this month!\n\nTg : (@)MoveNbsc\n\nlinktr.ee/movenfinance",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uqyr5b",
            "title": "Mysterious Coinbase Card deactivation?",
            "url": "https://www.reddit.com/r/CoinBase/comments/uqyr5b/mysterious_coinbase_card_deactivation/",
            "author": "Agile_Sun8138",
            "created_utc": 1652715470.0,
            "score": 14,
            "num_comments": 43,
            "subreddit": "CoinBase",
            "selftext": "My Coinbase card was mysteriously deactivated.  It took a week of calls, emails, etc., to get them to reactivate.  In reactivating it they said, \"Please note that additional violations of our Cardholder Agreement may result in permanent suspension.\"\n\nWhen I asked them what the heck they meant, they said they couldn't go into further details, and pointed me at their FAQ - which said nothing relevant.\n\nHas anybody ever had this happen?  I keep the card under $2500 a day, don't buy anything shady, etc., so I am really wondering why the mysterious closure.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8v9lv1",
                    "author": "Elva_Ginon_69",
                    "score": 5,
                    "created_utc": 1652734971.0,
                    "response": "Coinbase is Fallin",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8txvlh",
                    "author": "Bog-EA",
                    "score": 5,
                    "created_utc": 1652715737.0,
                    "response": "Gambling, gun shops, weed shops?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8u9jrp",
                    "author": "pcm2a",
                    "score": 4,
                    "created_utc": 1652720413.0,
                    "response": "I had it happen after eating at a restaurant in my city, where I have eaten many times. With mine they actually approved the meal and them canceled it and deactivated my card later. \n\nI also had paid my IRS taxes with the card, but it was days earlier, with a lot of payments in-between. I won't try that again.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8udoup",
                    "author": "Connect-Ad-1088",
                    "score": 4,
                    "created_utc": 1652722064.0,
                    "response": "when you try to buy hookers and blow with your cb card......",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8vev0r",
                            "author": "ElectronicAd7520",
                            "score": 1,
                            "created_utc": 1652737210.0,
                            "response": "No.... That's ok. Just look at the crypto execs at the big conferences : p",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8vorfr",
                    "author": "ithd1",
                    "score": 4,
                    "created_utc": 1652741651.0,
                    "response": "Just happened to me, no idea why, trying to find out but meanwhile taking my crypto out of my coinbase account just in case they also decide to deactivate my account for no reason.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8vpk82",
                            "author": "coinbasesupport",
                            "score": -3,
                            "created_utc": 1652742028.0,
                            "response": "Hey there, ithd1. Could you open a support case for this concern, and provide us the case number, so we can further investigate? Thanks! Here's the link to open a support case. https://help.coinbase.com/en/contact-us",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8w3oz0",
                    "author": "Creepy-Importance-13",
                    "score": 3,
                    "created_utc": 1652749012.0,
                    "response": "Get the F out now while you can",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ujisq",
                    "author": "Manateeboi",
                    "score": 3,
                    "created_utc": 1652724357.0,
                    "response": "This just happened to me. Trying to figure out why but they have yet to give me any reason. They told me to wait a month and they can resubmit my account for review.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8tzbr2",
                    "author": "silverside30",
                    "score": 2,
                    "created_utc": 1652716329.0,
                    "response": "Your first mistake was doing business with this shitty company.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8u9q8e",
                            "author": "pcm2a",
                            "score": 8,
                            "created_utc": 1652720481.0,
                            "response": "It would be more helpful if you could provide an alternative that gives 4% cash back. Hate them all you want but that's an incredible value.\n\nUse them for crypto? Nope.\n\nUse them for cash back? Yep.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8v8oem",
                                    "author": "kiefferbp",
                                    "score": 1,
                                    "created_utc": 1652734597.0,
                                    "response": ">It would be more helpful if you could provide an alternative that gives 4% cash back. Hate them all you want but that's an incredible value.\n\nIt would be more helpful if you could provide an alternative that gives 20% APY. *cough* UST *cough*\n\nJust because it gives good cash back doesn't mean it is a good card.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8v9duk",
                                            "author": "pcm2a",
                                            "score": 1,
                                            "created_utc": 1652734879.0,
                                            "response": "I don't see how buying the UST token is related.\n\nYou choose what token to get 4% back. \nYou choose what to do with it after. Swap it, sell it, keep it.\nSwap it to USDC or BTC, sell it to fiat, swap it with safemoon. Your choice.\n\nCrushes my 2% Citibank by double. Doesn't apply outside the U.S.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8vemiq",
                                                    "author": "kiefferbp",
                                                    "score": 1,
                                                    "created_utc": 1652737108.0,
                                                    "response": "They are similar in that the rewards you get reflect the risk. In the case of the Coinbase card, the extra risk is using an unusured asset (usually USDC) and having to rely on their buggy payment system working correctly. In my case, I lost $1k due to Coinbase not properly routing a refund and had to fight them for 2 months to get it back. Dealing with that is not worth the extra $20 in cashback versus the citibank double cash.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8vggop",
                                                            "author": "pcm2a",
                                                            "score": 1,
                                                            "created_utc": 1652737905.0,
                                                            "response": "Your refund issue is a great callout. Never use a crypto card for something you might return. Pay bills, eat out, but gas and groceries. I also use it for Amazon but for returns I pick for it to be refunded to my Amazon account.\n\nIf a few hundred in USDC is too risky, best steer clear of crypto all together maybe?",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8vjogb",
                                                                    "author": "kiefferbp",
                                                                    "score": 1,
                                                                    "created_utc": 1652739326.0,
                                                                    "response": "I have detailed my issue in another thread, but the $1k \"refund\" wasn't truly a refund. For some reason, the transaction got cancelled at the register but the money was drawn from the card.\n\n>If a few hundred in USDC is too risky, best steer clear of crypto all together maybe?\n\nTrust me when I say that it is not too risky for me, but you're picking up pennies in front of a steamroller using a debit card for purchases and relying on Coinbase for any screwups.\n\nI just don't like taking unnecessary risks. I use Gemini now and withdraw my crypto to my hardware wallet the moment the ACH clears. I am not trusting these exchanges any more than I have to.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i8vm0l3",
                                                                            "author": "pcm2a",
                                                                            "score": 1,
                                                                            "created_utc": 1652740380.0,
                                                                            "response": "Miss out on earning extra crypto with long term holds. For example 6.7% on ETH/BTC or 10+ on matic. It is possible that the CEX suddenly disappears with.your crypto and your interest.\n\nFor no risk, hardware wallet and check it in 10 years might be the best way.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i8ubxe2",
                                    "author": "silverside30",
                                    "score": 0,
                                    "created_utc": 1652721360.0,
                                    "response": "That’s all well and good, but how’s that working out for OP?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8uc6vz",
                                            "author": "pcm2a",
                                            "score": 3,
                                            "created_utc": 1652721468.0,
                                            "response": "You don't lose any money when it happens. You still have full access to everything. Just can't use the card.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8ucujf",
                                                    "author": "silverside30",
                                                    "score": -2,
                                                    "created_utc": 1652721728.0,
                                                    "response": "Or earn that 4%. I’ll stick with a cash back card from a real bank that has a customer service department that will pick up the phone and earn variable 2-5% cash back",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i8ugd47",
                                                    "author": "nas1292",
                                                    "score": 0,
                                                    "created_utc": 1652723123.0,
                                                    "response": "Hey! I’m having a similar problem with my card. Did you need to reorder a new card for it to work again? Thanks for the help!",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8uhw1t",
                                                            "author": "pcm2a",
                                                            "score": 4,
                                                            "created_utc": 1652723721.0,
                                                            "response": "I called, talked to support, they made some kind of ticket and couldn't do anything else. Two days later it was reactivated.\n\nThe support was very nice and totally useless, except to create a ticket for another department.\n\nNo new card was needed, at least for me.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8weiuy",
                    "author": "Thenftmaster",
                    "score": -1,
                    "created_utc": 1652754449.0,
                    "response": "Coinbase has been a rip since it started.  Their trading fees are absurd next to other exchanges.  People are so worried about the 4% back on their $50 eatery tab, or $100 worth a gas should probably not be in crypto to start.  Is a huge percent a draw? Sure it is.  And then you're eth went from $4k a coin to $2k a coin in 4 months, and your bitcoin lost 60%.  So much for that big draw.,,,,,,,",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8tx82o",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1652715473.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8wh6rk",
                    "author": "MichaelK70",
                    "score": 1,
                    "created_utc": 1652755835.0,
                    "response": "I've moved everything to Crypto.com except Spell Token and SHPING which isn't listed there, and I have very little $ in either of those on Coinbase.  I don't trust Coinbase to not file bankruptcy and peeps losing everything. Coinbase fees are outrageous too. Crypto.com is good on the fees.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8woj71",
                    "author": "asterik-x",
                    "score": 1,
                    "created_utc": 1652760003.0,
                    "response": "Is it possible to look at full moon while sneezing?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8x9bz6",
                    "author": "dpjackal89",
                    "score": 1,
                    "created_utc": 1652776064.0,
                    "response": "Same issue here. I deposited my money to pay my bills with the card and then had my card deactivated the next day. So now my funds have been stuck on Coinbase waiting to process so I can withdraw them. It finally just finished processing. I'll be moving to Gemini and withdrawing all my crypto along with it. The Cashback isn't worth all this hassle. Gemini has their own cards. It pays less Cashback but it's an actual credit card.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8xahxj",
                            "author": "coinbasesupport",
                            "score": 1,
                            "created_utc": 1652777150.0,
                            "response": "Thanks for your response u/dpjackal89.\n\nWe're sorry to hear of any frustration here. We can see that our team recently responded to you through your case. They will follow up with you again as soon as they have a further update, and you can also respond through your case email if you have any other questions. \n\nThank you for your patience here!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9617n0",
                    "author": "HqrkatMatt",
                    "score": 1,
                    "created_utc": 1652936262.0,
                    "response": "🔥 DINOSTEP.APP 🔥\n\n🦖 The First Move To Earn App With Virtual Dinosaurs\n👟 Earn while building healthy habits with the Dino\n✨ Varied NFTs\n💵 Passive Income Features\n💎 App Activation Code & NFT Drop For Fair Launch Contributors\n\n🚀 Fair Launch Starts On May 9th",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}