{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uz6e8j",
            "title": "Coinbase does not want to retrieve unsupported ERC-20 tokens, while Huobi DOES",
            "url": "https://www.reddit.com/r/CoinBase/comments/uz6e8j/coinbase_does_not_want_to_retrieve_unsupported/",
            "author": "cryptotraderinwork",
            "created_utc": 1653681418.0,
            "score": 0,
            "num_comments": 55,
            "subreddit": "CoinBase",
            "selftext": "  \n\nMonday I converted my $35.000 of $BNB to USD Stablecoin on [Gate.io](https://gate.io/)\n\nAfter that, I wanted to convert it to euros on my Coinbase account, so I sent the USD Stablecoin to my Coinbase. I knew I had to look out for the network of course, as the $USDC adress of Coinbase only accepts ERC-20 tokens.\n\nThe unfortunate thing is that when you convert your crypto to USD Stable Coin on [gate.io](https://gate.io/)\n\n, you can withdraw several USD stable coins such as $HUSD, $BUSD, $TUSD and $USDC. I just looked at the network (ERC-20) and thought I withdrawed $USDC. Unfortunately, it turned out later that I had withdrawed the ERC-20 $HUSD. Yes, I know this is my fault and that I should have tried a small transaction first, but I can't change it anymore.\n\nCoinbase has not listed $HUSD and says they cannot return the tokens. The tokens are only credited automatically when Coinbase lists $HUSD on their exchange.\n\nI emailed the Huobi Trust CEO about this, as Huobi is the exchange behind stablecoin $HUSD (just like Binance is the exchange behind stablecoin $BUSD and Coinbase is the exchange behind stablecoin $USDC). He said the following:\n\n***'We will continue to work hard to communicate with coinbase. But I can't be sure when $HUSD will be listed. But you do have the right to find coinbase to recover your assets. If any customer mistakenly deposits a token that is not listed on Huobi, Huobi will assist in retrieving it, or even advance payment. In fact, you did deposit your assets into the coinbase address. I believe that as long as you keep looking for them to solve the problem, they will help you. After all, $35,000 is not a small sum. Good luck.'***\n\nSee my transaction on etherscan:  \n [https://etherscan.io/tx/0x12a231dc8801724334895452f41dce8cb621d2db584c969bbe3c7fa6b9efa78d](https://etherscan.io/tx/0x12a231dc8801724334895452f41dce8cb621d2db584c969bbe3c7fa6b9efa78d)",
            "stickied": false,
            "comments": [
                {
                    "id": "ia94jze",
                    "author": "Kiwip0rn",
                    "score": 7,
                    "created_utc": 1653694091.0,
                    "response": "So you screwed up with your Self Custody Wallet, and now want the Centralized Custody Service to bail you out?\n\nYou want Self Custody, take Self Responsibility for your actions... you failed with Self Custody and DeFi, don't come crying about it here.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaanrz4",
                            "author": "cryptotraderinwork",
                            "score": 0,
                            "created_utc": 1653730465.0,
                            "response": "I take self responsibility, 'kiwip0rn'. I sent it to Coinbase Exchange (CEX), not to my Self Custody Wallet, so your comment is invalid.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iaap1ak",
                                    "author": "cryptotraderinwork",
                                    "score": 1,
                                    "created_utc": 1653731602.0,
                                    "response": "If I sent it to my Self Custody Wallet, there would have been no problem... so your comment is 100% invalid",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "iaaqqsz",
                                    "author": "Kiwip0rn",
                                    "score": 1,
                                    "created_utc": 1653733187.0,
                                    "response": "Well, Coinbase Custody doesn't recognize HUSD and it will NEVER be listed on Coinbase Custody. So sit-down and just wait for it to be listed.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iaaqyak",
                                            "author": "cryptotraderinwork",
                                            "score": 0,
                                            "created_utc": 1653733369.0,
                                            "response": "Do you think it will be listed in the near future? I hope so... I know it is my fault, but why do exchanges like Huobi and Binance help customers with retrieving unsupported ERC-20 tokens and Coinbase not? I am happy to pay $3500 as I imagine it takes some manual  work...",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iaar1ba",
                                                    "author": "Kiwip0rn",
                                                    "score": 1,
                                                    "created_utc": 1653733443.0,
                                                    "response": "What part of \"NEVER\" are you having problems with?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iaar8ji",
                                                            "author": "cryptotraderinwork",
                                                            "score": 0,
                                                            "created_utc": 1653733628.0,
                                                            "response": "I saw that Coinbase wants to list 90% of tokens available, so I have hope.\n\nGood luck with 'helping' people on this subreddit....",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "iaas4dx",
                                                                    "author": "Kiwip0rn",
                                                                    "score": 1,
                                                                    "created_utc": 1653734367.0,
                                                                    "response": "🤣🤣😂 Coinbase Custody has no plans of listing 90% of tokens. They just updated the requirements for listing, to avoid nonsense of Meme Coins and Scammy coins.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "iaas9qy",
                                                                            "author": "cryptotraderinwork",
                                                                            "score": 0,
                                                                            "created_utc": 1653734489.0,
                                                                            "response": "Why do you keep saying Custody? I mean Coinbase Exchange. They listed $BUSD in April and are considering listing $GUSD (which is as large as $HUSD) coming month, so keep laughing at me. You really are a contributor to the crypto space, you help people so much. Your name says it all I guess",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "iaasn1j",
                                                                                    "author": "Kiwip0rn",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653734796.0,
                                                                                    "response": "🙄 because the Coinbase site is \"Coinbase Custody\"; \"Coinbase Pro\" is the exchange (and the new \"Advanced Trading\" platform).",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "iaasqbl",
                                                                                            "author": "cryptotraderinwork",
                                                                                            "score": 1,
                                                                                            "created_utc": 1653734873.0,
                                                                                            "response": ">Oke thanks for explaining",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "id": "iaasvh5",
                                                                                    "author": "Kiwip0rn",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653734988.0,
                                                                                    "response": "Because \"Coinbase Custody\" Coinbase has Custody of your coins, in the \"Coinbase Wallet\" you have Self Custody of the coins 🙄",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "iaat2b2",
                                                                                            "author": "cryptotraderinwork",
                                                                                            "score": 0,
                                                                                            "created_utc": 1653735147.0,
                                                                                            "response": ">Because \"Coinbase Custody\" Coinbase has Custody of your coins, in the \"Coinbase Wallet\" you have Self Custody of the coins \n\nOke I understand, If I sent it to my coinbase wallet, there would have been no problem... Well, I hope $HUSD will be listed within 2 years. I wish you despite your harsh comments all the best in crypto and life.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia91oeo",
                    "author": "Tall_Run_2814",
                    "score": 5,
                    "created_utc": 1653692626.0,
                    "response": "Coinbase is not the “exchange behind USDC”.  USDC and USDT are the standards in crypto.  I haven’t seen an exchange or network that doesn’t use USDC.  Respectably USDC and USDT are consistently ranked in the top 10 on both CoinGecko and CoinMarketCap. \n\nThe best investments in crypto are research and time.  Sorry for your loss",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia940mr",
                            "author": "Kiwip0rn",
                            "score": 3,
                            "created_utc": 1653693815.0,
                            "response": "Yes and No, Coinbase and Circle were involved with the creation of USDC. Coinbase wanted a Stablecoin and originally didn't want anything to do with USDT; so they helped back USDC.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iaanx6g",
                            "author": "cryptotraderinwork",
                            "score": 1,
                            "created_utc": 1653730597.0,
                            "response": "Why can Huobi help me and Coinbase not in this case? And it is not lost, look etherscan, it's just there. Binance and [Gate.io](https://Gate.io) also help you sent back the unsupported ERC-20 tokens with a high fee. I am happy to pay $3500 as it is my fault, but Coinbase simply does not want to help.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iadx2go",
                                    "author": "Tall_Run_2814",
                                    "score": 1,
                                    "created_utc": 1653793375.0,
                                    "response": "Coinbase does not have an Asset Recovery Team.  Unfortunately you're not the only person who has done this, countless people do this everyday.  It would cost millions in man-power to hire enough people to reverse and recover these assets",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iaeeeru",
                                            "author": "cryptotraderinwork",
                                            "score": 1,
                                            "created_utc": 1653805297.0,
                                            "response": "They should do this. It's a central exchange, and if countless people do this every day, they should hire people to reverse and recover these assets, just like other exchanges do. I am happy to pay 10% ($3500) to recover my assets.\n\nWhat does Coinbase do? Nothing. Worst exchange ever.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iak9wpj",
                                                    "author": "Tall_Run_2814",
                                                    "score": 1,
                                                    "created_utc": 1653929717.0,
                                                    "response": "Some exchanges do.  Expensive learning lesson.  May I ask, were you not concerned at any time while sending such a large amount of money?  \n\nMaybe I was just born paranoid but I've been in crypto for a while and still send test transactions if its more than a couple hundred dollars.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "iaefk7n",
                                            "author": "cryptotraderinwork",
                                            "score": 1,
                                            "created_utc": 1653806257.0,
                                            "response": "And what happened to the Asset Recovery Team which was supposed to roll out in 2021? NOTHING. Coinbase does not keep its promises. Unreliable exchange.\n\n[https://www.reddit.com/r/CoinBase/comments/mttji6/comment/gv2h2fx/?utm\\_source=share&utm\\_medium=web2x&context=3](https://www.reddit.com/r/CoinBase/comments/mttji6/comment/gv2h2fx/?utm_source=share&utm_medium=web2x&context=3)",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia8e5gd",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653681419.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia8goyq",
                    "author": "berelentless99",
                    "score": -7,
                    "created_utc": 1653682570.0,
                    "response": "Coinbase does not help you when things get difficult. They only are busy collecting fees",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uz66fz",
            "title": "Which cryptocurrency is the best to invest now and will explode after this bear market?",
            "url": "https://www.reddit.com/r/CryptoCurrencyTrading/comments/uuqp1n/which_cryptocurrency_is_the_best_to_invest_now/?utm_source=share&utm_medium=ios_app&utm_name=iossmf",
            "author": "o1pa1",
            "created_utc": 1653680782.0,
            "score": 2,
            "num_comments": 53,
            "subreddit": "CoinBase",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "ia8ctfe",
                    "author": "Blockchain_Benny",
                    "score": 4,
                    "created_utc": 1653680814.0,
                    "response": "Crystal ball says Yes",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia967pv",
                    "author": "ballsonrawls",
                    "score": 4,
                    "created_utc": 1653694937.0,
                    "response": "Lmao",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaam2yn",
                    "author": "daydreaming1980",
                    "score": 3,
                    "created_utc": 1653728868.0,
                    "response": "ERGO +  ADA (DCA EVERY WEEK )",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia97vnr",
                    "author": "Hyperlite211",
                    "score": 4,
                    "created_utc": 1653695799.0,
                    "response": "Btc will be first. Btc dominance will get to the mid 60's",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia9ms0w",
                    "author": "reddit_1999",
                    "score": 4,
                    "created_utc": 1653703685.0,
                    "response": "ADA.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaaq30q",
                    "author": "Jezzes",
                    "score": 2,
                    "created_utc": 1653732576.0,
                    "response": "Bitcoin",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia91b0v",
                    "author": "kagochok",
                    "score": 3,
                    "created_utc": 1653692438.0,
                    "response": "USDC",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaa40du",
                    "author": "pob125",
                    "score": -1,
                    "created_utc": 1653713674.0,
                    "response": "Jasmy",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia8rp2d",
                    "author": "Bizzlebanger",
                    "score": 1,
                    "created_utc": 1653687736.0,
                    "response": "RBIF",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia8xwf7",
                    "author": "badAnatomy",
                    "score": 1,
                    "created_utc": 1653690753.0,
                    "response": "ALGO",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia8qqqi",
                    "author": "No-Background-1991",
                    "score": -3,
                    "created_utc": 1653687280.0,
                    "response": "Shiba inu 🚀",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia90atr",
                    "author": "Mysterious-Access-60",
                    "score": -1,
                    "created_utc": 1653691937.0,
                    "response": "$AMP",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia8cqyg",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653680782.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia8ln8h",
                    "author": "graydi66y",
                    "score": 1,
                    "created_utc": 1653684852.0,
                    "response": "Pretty much anything that has a decent shot at going back up.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia9v430",
                    "author": "Lord0fBeer",
                    "score": 1,
                    "created_utc": 1653708112.0,
                    "response": "$VET Vechain",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaauj6p",
                    "author": "EyDabbelyu",
                    "score": 1,
                    "created_utc": 1653736344.0,
                    "response": "DOGE",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaaxuiy",
                    "author": "Kanthabel_maniac",
                    "score": 1,
                    "created_utc": 1653738737.0,
                    "response": "Bitcoin cash",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iabetdv",
                    "author": "Spiky_Rifle",
                    "score": 1,
                    "created_utc": 1653748410.0,
                    "response": "$CSPR Casper",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaerhyl",
                    "author": "Accomplished-Way7608",
                    "score": 1,
                    "created_utc": 1653816828.0,
                    "response": "This bear market has a long way down still.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaeyqnb",
                    "author": "JohnnieZermeno",
                    "score": 1,
                    "created_utc": 1653823154.0,
                    "response": "I'd say strategy is as important as the coin to buy as well  \nXRP if they get out of the current battle with SEC  \nBTC if you hold mega long term\n\nUSDT or any major stable if you know nothing about crypto\n\nKDX considering the backing from Kadena Eco\n\nDFI if you want to do DeFi on Bitcoin\n\nFTM considering the investment in getting developers on board  \n\n\nSo it could be anything and no strategy is full proof",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iag72t6",
                    "author": "fxxffyzdzt",
                    "score": 1,
                    "created_utc": 1653845801.0,
                    "response": "✋ @DoctorMonkey22, #DMONKEY, the new GEM on BSC 💎\n\n🔹 Seed Sale on JUNE 1, 2022 🤑\n🔹 Presale & launch in this JUNE 🔥\n🔹 Best Charitable Community Coin 👩‍⚕️\n\n✅ NFT Collection\n✅ Burn and buyback token\n✅ Liquidity will be locked via PinkSale\n\n👥 Main TG: https://t.me/DoctorMonkeyOfficial",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia98yua",
                    "author": "jhanon76",
                    "score": -1,
                    "created_utc": 1653696365.0,
                    "response": "Babydoge to 60k!!!!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaa3dlh",
                    "author": "ForsakenLet4803",
                    "score": -1,
                    "created_utc": 1653713230.0,
                    "response": "Algo !",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaaj0dr",
                    "author": "boyscoutsgravelly",
                    "score": 0,
                    "created_utc": 1653726044.0,
                    "response": "the one with a trustworthy , transparency and growing ecosystem, and my pick for that is Kadena and its minions !\n\nbesides my devirsified bag ofcourse",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uz67nj",
            "title": "Mina Earn",
            "url": "https://www.reddit.com/r/CoinBase/comments/uz67nj/mina_earn/",
            "author": "Royal-Author-669",
            "created_utc": 1653680883.0,
            "score": 2,
            "num_comments": 41,
            "subreddit": "CoinBase",
            "selftext": "I boned myself getting the Earn for Mina. I was waiting for the price to get back closer to .80. Well when it hit .811 I did the quiz and I got the first one but when I went to do the 2nd one it said something went wrong try restarting app. So I did a bunch of times. After about an hour of messing around I see that they have removed it from the Earn group.\nAhhh well, 1 out of 3 is better than 0.\nLesson don't be to greedy.😂",
            "stickied": false,
            "comments": [
                {
                    "id": "ia8wejb",
                    "author": "gold4829",
                    "score": 2,
                    "created_utc": 1653690014.0,
                    "response": "get the three bucks of mina and convert it to BTC or ETH",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia8x8ey",
                            "author": "Royal-Author-669",
                            "score": 1,
                            "created_utc": 1653690423.0,
                            "response": "They cut it off after I did the 1st one. I wasnt able to get the other 2",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iabx0z5",
                    "author": "Babyfart7",
                    "score": 2,
                    "created_utc": 1653756980.0,
                    "response": "I got the Mina by opening Coinbase in my browser and taking the quiz’s there. You may need to open the quiz  in a separate tab.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia8cyzn",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653680883.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iabtck7",
                    "author": "Babyfart7",
                    "score": 1,
                    "created_utc": 1653755265.0,
                    "response": "Is anyone able to get Mina ? I couldn’t even get the first question it said connection issues.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ianf84h",
                    "author": "VillaHaiuuv",
                    "score": 1,
                    "created_utc": 1653996040.0,
                    "response": "🔗 Welcome to $IBT ⛓\n\n🚨IBT Token Official Contract is here. When the launch day and time arrives, trading will begin.\n⚡️IBT CA: 0x9D3d5C13a4CcE652ef7bFAEE3378d2cd59fD37B3\n📅 UPCOMING LAUNCH DATE: June 3, 18:00 UTC 📅\n\n🟠 Join the TG : t.me/IBTProject\n\n⚙️ $IBT Smart Tokenomics ⚙️\n\n⛓ Total Supply: 1,000,000 $IBT\n⛓ 50% Burned Tokens\n⛓ 7% Staking\n⛓ 5% Comps & Giveaways\n⛓ 32% LP Listing\n⛓ 6% GameFi Development\n\n🕸SOCIAL NETWORKS 🕸\n🌍 Website 🗯 Telegram 🕊 Twitter  📣 Channel",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}