{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "riss76",
            "title": "Google Pay Added?",
            "url": "https://www.reddit.com/r/CoinBase/comments/riss76/google_pay_added/",
            "author": "MatterMinder",
            "created_utc": 1639780827.0,
            "score": 8,
            "num_comments": 4,
            "subreddit": "CoinBase",
            "selftext": "I'm a little concerned that Google Pay was added to my payment methods without my consent. It says I have a card on file but won't tell me what it is. Can't delete the option. What the fuck?\n\nHow can I tell if it's legit or added by a third party?\n\nNot feeling very warm and fuzzy here...\n\nEDIT: maybe this became an option when I got the Coinbase debit card? It would have been nice to have this explained.",
            "stickied": false,
            "comments": [
                {
                    "id": "hoz8qn3",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1639780827.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hq9yv5q",
                    "author": "Natey_Two",
                    "score": 1,
                    "created_utc": 1640699399.0,
                    "response": "My Google Pay got added too without my explicit consent, but does not work (selection is greyed out in Coinbase as of December 2021).\nI suspect my phone has it set up as a payment method, and Coinbase leveraged that.\n\nI do not have a Coinbase Debit Card.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}