{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ur9rli",
            "title": "Top VC explains his confidence in Coinbase",
            "url": "https://avc.com/2022/05/the-founder-resolve/",
            "author": "Donpabloescobar",
            "created_utc": 1652745980.0,
            "score": 25,
            "num_comments": 36,
            "subreddit": "CoinBase",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8vzli7",
                    "author": "Kronossan",
                    "score": 6,
                    "created_utc": 1652746959.0,
                    "response": "I'm increasingly concerned with their infrastructure seemingly falling apart right under their noses (service outages, bugs, etc.), customer support's inability  to keep up (understaffed most likely), and the near total comms blackout.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8wguho",
                            "author": "TheRealAstic",
                            "score": 14,
                            "created_utc": 1652755653.0,
                            "response": "1. I have never been effected by a “service outage” in 4 years of near constant daily use. \n\n2. I’ve never needed support. \n\n3. I don’t really care to hear their opinion on anything. \n\nI’m the user they want, and they have catered Pro to users like me. \n\nThe other users aren’t worth their time and energy. Just like Tesla doesn’t negotiate or have PR, if you want to deal with them, you can, otherwise you can fuck off and they will do fine without you.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8z7fql",
                                    "author": "Nimoy2313",
                                    "score": 1,
                                    "created_utc": 1652812497.0,
                                    "response": "You might be my long lost twin I never knew about.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8wmz0k",
                                    "author": "AllinKemah",
                                    "score": -3,
                                    "created_utc": 1652759056.0,
                                    "response": "Tell us how you really feel",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8vxo9v",
                    "author": "Donpabloescobar",
                    "score": 0,
                    "created_utc": 1652745992.0,
                    "response": "I agree, Armstrong's leadership is among the best in the business.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8wi6xe",
                            "author": "Kiwip0rn",
                            "score": 2,
                            "created_utc": 1652756377.0,
                            "response": "Let's not go too overboard... Armstrong is solid as the CEO of Coinbase.\n\nBut, Armstrong is kinda a dumb-arse, on social media (well, any media), politically, socially and personally it appears from a distance.\n\nI don't think I would pay him to wash my car; but I will give him an unreasonable amount of my Net Worth for him to keep on his Custody and exchange platforms.\n\nLike Musk, I will buy his cars; but I am NOT interested in anything else with him.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8w2bc5",
                    "author": "anon977577",
                    "score": -1,
                    "created_utc": 1652748321.0,
                    "response": "The W in WLUNA means Coinbase doesn't have the coin it says you have, it's just their pinky promise that you will have the actual share if you were to use it in a way that demands its existence.  Does this give them the ability to short crypto since they can sell you a cryptocoin without actually having it, then waiting for the price to go down and then fulfilling the transaction when it's profitable to do so?\n\nWhich doesn't seem fair at all or in the spirit of cryptocurrency.  it's the same thing the Feds are doing at the central bank when they roll their palm on a keyboard to create new money and then sell it at market for full price.\n\nMake or break time Armstong.  \"Losing 15 billion dollars worth of your customer's money\" in a few hours is not a good look or a good smell.  Bernie Madoff was ordered to sit in prison until he died for ponzie schemes that were lesser in value and lesser in customer losses.\n\nSo yeah, kind of a thing, but you have immunity because the Government hates cryptocurrency and so your mistake in offering a doomed altcoin and customers losing 100% of their investment, is music to their ears.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8wgu9n",
                            "author": "Kiwip0rn",
                            "score": 7,
                            "created_utc": 1652755650.0,
                            "response": "🙄 We are all dumber for reading your post.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8wkv5y",
                                    "author": "anon977577",
                                    "score": -1,
                                    "created_utc": 1652757840.0,
                                    "response": "When coinbase wraps an altcoin, does that mean your coin is just an \"IOU the named coin\"  So if Luna were to stop functioning, then the wrapped coin makes no sense since they don't have the coin and can't get you one, and so coinbase and the customer is left with thin air?\n\nCongress has these questions and are probably going to start playing your game of: \"Congress was made stupider for Coinbase shenanigans, what you're all doing here is an illegal ponzie scheme and you're going to the same jail cell as bernie madoff.\n\nThere we can all ponder stupid posts from inside the jail cell as punishment for knowingly defrauding customers.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8z2uxm",
                                            "author": "Additional-Cap-7110",
                                            "score": 1,
                                            "created_utc": 1652810624.0,
                                            "response": "I think they do have the coin, it’s just worthless",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8z69mu",
                                                    "author": "anon977577",
                                                    "score": 1,
                                                    "created_utc": 1652812021.0,
                                                    "response": "So I guess what you're saying is the only way to get rich in the western rigged casino stock market ATM machine for the oligarchs, is to outswindle the swindlers, or to find a tillar to suck at the office of moneyprinting, and get on the dole like a barnyard animal.\n\nCan I convert to their religion and study source mafia scriptures, or is that bad form?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i90ui9l",
                                                            "author": "Additional-Cap-7110",
                                                            "score": 2,
                                                            "created_utc": 1652838729.0,
                                                            "response": "I think when you’re a whale you’re incentivized to play pump and dump games because anything you do to make big money with big money is going to move markets.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i914nh6",
                                                                    "author": "anon977577",
                                                                    "score": 1,
                                                                    "created_utc": 1652843701.0,
                                                                    "response": "Pumping and Dumping stocks and cryptos appears to be the theme for the last 20 years.  I don't think Maxine Waters was being serious when she asked dfv if he knew he \"manipulated the market\".  Manipulating the market is all the giant firms do.  You enter a position, you pay to brainwash the general public into buying your dollar for 2 dollars, then you sell it to them and now you're onto the next.\n\nCryptocurrency altcoins appears to be muscling in on this scam.  People giving themselves trillions of coins, then selling them on the market for supply/demand float.  Individuals Scanning/copying hundred dollar bills with a printer is supposed to be illegal, and yet, take a look around you, that's all coinbase is doing.  Creating money from thin air and giving it to itself.  WLUNA is the endgame of that ponzie scheme and so what coinbase is doing is a kind-of-illegal like what Bernie madoff was doing.  Selling thin air for money and making sure you've got at least a few congressmen and politicians in your hip pocket to run interference and change the law if you find yourself in a courtroom, and an angry Judge who thinks his idea of justice is holier than thou's.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i959bq2",
                                                                            "author": "Additional-Cap-7110",
                                                                            "score": 2,
                                                                            "created_utc": 1652921769.0,
                                                                            "response": "I agree with you but I don’t understand what the problem is with a wrapped token?",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i97ozhj",
                                                                                    "author": "anon977577",
                                                                                    "score": 1,
                                                                                    "created_utc": 1652974586.0,
                                                                                    "response": "The problem with a wrapped crypto token is that it increases the number of fiddlers and riddlers between you: (The person who wants to store and accumulate labor for withdrawl at an undisclosed point in the future) and the mechanism protecting that labor from thieves between you and that process.\n\nThe entire concept of \"Wrapping\" a coin transforms a theoreticaly sound Cryptocurrency that protects its labor from thieves into a glorified fiat and invalidates the entire thesis of cryptocurrency.  If there's a person wrapping your coin, that's basically giving them the god power of right to debase crypto like what the central banksters have.\n\nHere you can see the bankers filling their air with irritation about you filthy plebians trying to muscle in on their racket of creating debt, issuing the buying power to self, and saddling the debt to others making them think the debts are assets.\n\n[https://youtu.be/WxxyDMBRu9E?t=609](https://youtu.be/WxxyDMBRu9E?t=609)\n\nWhat's wrong with wrapping?  The problem is organized crime exists.  And the wrapping is a vulnerability that gives the power structures that Crypto was designed to disable an opportunity to regain their power to steal without election, representation or authorization from the people being robbed.",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8vxnd0",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1652745980.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8yc6q8",
                    "author": "jsinclair12",
                    "score": 1,
                    "created_utc": 1652799765.0,
                    "response": "Thousands and thousands of accounts are hacked and wiped out, with no help from Coinbase.  Do not leave any assets in Coinbase.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8ywxnb",
                            "author": "Accomplished-Way7608",
                            "score": 1,
                            "created_utc": 1652808259.0,
                            "response": "Crooked CEO Brian Armstrong thinks is they are all his!!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8ywrz1",
                    "author": "Accomplished-Way7608",
                    "score": 1,
                    "created_utc": 1652808194.0,
                    "response": "Why does Coinbase have an F rating with BBB?",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "ur9z3m",
            "title": "How to convert XLM (stellar) to Tether on Coinbase Wallet?",
            "url": "https://www.reddit.com/r/CoinBase/comments/ur9z3m/how_to_convert_xlm_stellar_to_tether_on_coinbase/",
            "author": "Express_Sentence6959",
            "created_utc": 1652746656.0,
            "score": 1,
            "num_comments": 19,
            "subreddit": "CoinBase",
            "selftext": "Hello, I sent myself some XLM from coinbase to coinbase wallet. I want to convert it into USDT (tether). However, when I click TRADE it says I have no coins in my account. It precisely says you don't have this coin - even thought I never chose which coin I want to do it with. Is there any other way I can get tether with coinbase? I was able to send XLM back to coinbase, sent it back to the wallet - transfer confirmed. And yet, I'm still unable to see any coins in the \"trade\" tab. Is that normal? If so, how can I buy tether on coinbase? Or should I use another exchange for this?",
            "stickied": false,
            "comments": [
                {
                    "id": "i8vz6lg",
                    "author": "unvieledloki",
                    "score": 2,
                    "created_utc": 1652746754.0,
                    "response": "i think the trade tab inside the non custodial wallet is for erc20 tokens only,  so send the xlm back to the exchange app and trade you usdt their then send to the wallet,  you will incure gas fees though doing so",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8vzhn7",
                            "author": "Express_Sentence6959",
                            "score": 2,
                            "created_utc": 1652746906.0,
                            "response": "thanks that helps.. however, the coinbase app says its only on their coinbase wallet app - shaking my head.. lol :) maybe i'll transfer another coin and see if it does the trick",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8w10gz",
                                    "author": "coinbasesupport",
                                    "score": 1,
                                    "created_utc": 1652747672.0,
                                    "response": "Hey there u/Express_Sentence6959, that would be a great workaround for this situation! If you send any ERC-20 token from Coinbase.com to your Coinbase wallet, it will show up on the Ethereum network, and you can swap it for any other token, like USDT via a DEX Uniswap!",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8w18d7",
                                    "author": "unvieledloki",
                                    "score": 0,
                                    "created_utc": 1652747781.0,
                                    "response": "i just opened my app right now, i can buy xlm from the exchange app",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8whnz4",
                                            "author": "TheRealAstic",
                                            "score": 1,
                                            "created_utc": 1652756092.0,
                                            "response": "People from New York think that everyone has the restrictions they do. It’s hilarious. \n\nHe also was gonna pay a $150 gas fee to swap $4 of XLM, but he doesn’t know what that is anyway.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8vyzkv",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1652746657.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8wdlsf",
                    "author": "ndreamer",
                    "score": 1,
                    "created_utc": 1652753985.0,
                    "response": "You can convert xlm to usdc just not using the coinbase wallet. Use one of the more competent stellar based wallets like Solar.\n\nCoinbase doesn’t support usdc (xlm) chain the only exchange that does is okcoin.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8y13ni",
                    "author": "literallygoated",
                    "score": 1,
                    "created_utc": 1652794951.0,
                    "response": "Why would u want USDT over USDC lmao",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i961a1d",
                    "author": "HqrkatMatt",
                    "score": 1,
                    "created_utc": 1652936308.0,
                    "response": "🔥 DINOSTEP.APP 🔥\n\n🦖 The First Move To Earn App With Virtual Dinosaurs\n👟 Earn while building healthy habits with the Dino\n✨ Varied NFTs\n💵 Passive Income Features\n💎 App Activation Code & NFT Drop For Fair Launch Contributors\n\n🚀 Fair Launch Starts On May 9th",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i98g8ni",
                    "author": "balamthanedar",
                    "score": 1,
                    "created_utc": 1652985589.0,
                    "response": "@cumversetoken\n PRESALE IS LIVE!\n\n 😍 Metaverse dating\n 👤Play in your avatar\n 🎮 Compatible with all major VR devices\n 🔥 Tinder for the metaverse👀 \n 🤏🏼 Swipe right\n ❤️ fall in-love or\n 💦 have sexual experiences 🫦\n 📍Virtual land drops to the 1st holders. \n #BSC\n t.me/cumversecrypto",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}