{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "v180sk",
            "title": "$2,760 disappeared from portfolio during fund transfer by support to new account, no help from support to retrieve",
            "url": "https://www.reddit.com/r/CoinBase/comments/v180sk/2760_disappeared_from_portfolio_during_fund/",
            "author": "Kultr0",
            "created_utc": 1653939483.0,
            "score": 16,
            "num_comments": 34,
            "subreddit": "CoinBase",
            "selftext": "So I lost my login information to my new account while in the military, but I was always logged in via the Coinbase app on my phone. Support recommended I make a new account and transfer my funds over, so I said okay and they said they sent my ticket to the proper support team for transfer.\n\n2 weeks go by and I move my funds to Coinbase Pro, then move them back on 5/24. on 5/25 at 6PM $1,180 randomly disappears from my account, then on 5/25 at 7:55PM $1,454 disappears from my account. Then the remaining dollars of my mixed assets disappear 8:30PM (With no transaction or withdraw history whatsoever) I receive $0.01USD and $0.54SOL from Coinbase on my new account... none of my other assets were sent.\n\nIt is now 5 days later and I have spoke to multiple support specialists via phone, text support, and e-mail, as well as numerous even hung-up on me while in silence. I am getting no answers or resolution. One support specialist told me that my funds were being transferred to my new account, although it was very obvious that the specialist had no clue what he was talking about because he couldn't even tell me the amount being transferred when I asked, then hung up on me when I requested to speak with a supervisor. I am in shambles and all I seek are my funds back, I am having no help from support, I am experiencing the run-a-round... I am so stressed the past 5 days this is unbelievable.",
            "stickied": false,
            "comments": [
                {
                    "id": "iakzf3b",
                    "author": "Tall_Run_2814",
                    "score": 31,
                    "created_utc": 1653941373.0,
                    "response": "Sounds like you were scammed by fake Coinbase support.  They would never ask you to create a new account and transfer from your old one to a new one.  Sounds like you were conned into sending your crypto to a fake Coinbase site.  Sorry for your loss",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iakzpxo",
                            "author": "Kultr0",
                            "score": 2,
                            "created_utc": 1653941517.0,
                            "response": "But I was speaking to a support specialist from the phone number provided on the website? So I'm confused how I'd be scammed. I also didn't do the transfer, the transfer occurred about 1 week later and I received $0.01USD and $0.54SOL from Coinbase on the new account. But none of my other assets. Which is very peculiar.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iala6ty",
                                    "author": "Accomplished-Way7608",
                                    "score": 3,
                                    "created_utc": 1653946535.0,
                                    "response": "Was the \"support specialist\" in India? They have been known to steal customer data and sell it on the black market. They are outside US law.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ialb346",
                                            "author": "Kultr0",
                                            "score": 4,
                                            "created_utc": 1653946981.0,
                                            "response": "Unfortunately the support specialist was in India. So you're saying the specialist stole my money? How tf do these things happen... that was my hard earned money I was putting in month by month. What exchange is safe to use if not Coinbase?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ialcen7",
                                                    "author": "iglootyler",
                                                    "score": 12,
                                                    "created_utc": 1653947642.0,
                                                    "response": "Unfortunately you found a fake website.  If you can still see the website in your history I bet the domain is misspelled",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "iamluk2",
                                                    "author": "Accomplished-Way7608",
                                                    "score": 2,
                                                    "created_utc": 1653971953.0,
                                                    "response": "Stay away from crypto all together is my advice.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "iamppvq",
                                    "author": "cryptoboywonder",
                                    "score": 1,
                                    "created_utc": 1653974621.0,
                                    "response": "Did you type the coinbase address yourself and then searched for Support/phone number, or did you click onto a link which then took you to a site that resembled a coinbase website?  So sorry for your loss.  I never trust anyone online, and I never click links to websites unless there is absolutely no other way.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iam8nyb",
                    "author": "Sir_Lagz_Alot",
                    "score": 4,
                    "created_utc": 1653964156.0,
                    "response": "From what it looks like, you’ve been scammed. Can you share the support site and number you called/used? If anything, the rest of us can avoid those links or numbers.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iam6fj4",
                    "author": "ResearchParking",
                    "score": 3,
                    "created_utc": 1653962995.0,
                    "response": "Coinbase will never ask you to move money or make a payment",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ial0lhq",
                    "author": "Kiwip0rn",
                    "score": 5,
                    "created_utc": 1653941941.0,
                    "response": "🙄",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iamegf9",
                    "author": "nohwhatnow",
                    "score": 2,
                    "created_utc": 1653967314.0,
                    "response": "You got scammed by out of US Support. You're Screwed",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ialgves",
                    "author": "Alcolawl",
                    "score": 4,
                    "created_utc": 1653949864.0,
                    "response": "I know their support sucks. I know you’re beyond stressed. If it is an error on their end, they will fix it. It just might take some time to get to the right person. Hound them here, hound them on twitter, reply to emails. I had to talk to nearly 10 different people before they finally gave my case to the right person, then it was resolved instantly.\n\nIf I am being honest with you though, I think your funds are gone. This sounds like you got conned into moving your funds to a scammers account.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iali1u6",
                            "author": "Kultr0",
                            "score": -1,
                            "created_utc": 1653950456.0,
                            "response": "Yeah I'm starting to lose hope and may move on and start buying again. But I don't feel safe using Coinbase anymore, especially my current account. Do you know of any other trustworthy exchanges? How's crypto dot com or Kraken?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ialm15n",
                                    "author": "Alcolawl",
                                    "score": 1,
                                    "created_utc": 1653952495.0,
                                    "response": "They are fine. I only used them a long time ago when I couldn’t buy certain things on Coinbase.\n\nLike I said, someone will eventually get to the bottom of your issue. It’s just getting to the right person that can be difficult. \n\nEven if you did send your coins to a scammer address, they will let you know that the coins were sent to an unknown external address and it’s irreversible. It happened to me once on the good old fake Elon Musk twitter comment directly under his tweet. Just accepted it and moved on or I’d be bitter forever.\n\nWasn’t Coinbase’s fault, it was mine. As many horror stories as there are here, Coinbase has been where I’ve felt safest aside from my own hardware wallet. For example, Binance won’t even verify me because they still think I live in a state I moved from 6 years ago.\n\nHopefully it is just an error on their end though, that would be ideal.  Good luck 🤞",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iakw343",
                    "author": "coinbasesupport",
                    "score": 1,
                    "created_utc": 1653939799.0,
                    "response": "Hey Kultr0, do you have a case number we can take a look at for you? Please and thank you!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ial0z4l",
                            "author": "Kultr0",
                            "score": 1,
                            "created_utc": 1653942119.0,
                            "response": "12037869",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ial23vt",
                                    "author": "coinbasesupport",
                                    "score": 1,
                                    "created_utc": 1653942659.0,
                                    "response": "Thanks! It does appear that your case is open & has been escalated. You should have received an email from that team, which was sent May 25 and is awaiting a response from you.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ial2xgh",
                                            "author": "Kultr0",
                                            "score": 3,
                                            "created_utc": 1653943043.0,
                                            "response": "I have received no e-mail from support other than automated responses that have nothing to do with my email.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ial3l1l",
                                                    "author": "coinbasesupport",
                                                    "score": 0,
                                                    "created_utc": 1653943355.0,
                                                    "response": "In earlier case notes, you'd provided us with two email addresses. Please check the inbox of the first one you provided, and also scan through trash & spam folders.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "ial3v5s",
                                                            "author": "Kultr0",
                                                            "score": 2,
                                                            "created_utc": 1653943488.0,
                                                            "response": "I have two e-mails, one that had the funds and one that was supposed to receive the funds. I received no emails. Could you resend the email please? Or escalate my case for a response.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "ial7o7r",
                                                                    "author": "coinbasesupport",
                                                                    "score": 1,
                                                                    "created_utc": 1653945302.0,
                                                                    "response": "We sent a Mod Mail with our update on your case! Please have a look at your inbox.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "ial96kn",
                                                                            "author": "Kultr0",
                                                                            "score": 3,
                                                                            "created_utc": 1653946040.0,
                                                                            "response": "I'm sorry but I still have no emails in both my inbox's.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "ialabrh",
                                                                                    "author": "Accomplished-Way7608",
                                                                                    "score": -2,
                                                                                    "created_utc": 1653946602.0,
                                                                                    "response": "Your money is gone bro. Accept it. Most people lose money in crypto anyway.",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iala0ci",
                    "author": "Accomplished-Way7608",
                    "score": -7,
                    "created_utc": 1653946448.0,
                    "response": "Your money is gone. Lesson learned. Coinbase is insolvent and needs your funds to pay off whales who are cashing out.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ialb4y6",
                            "author": "Kultr0",
                            "score": 2,
                            "created_utc": 1653947006.0,
                            "response": "Bruh that's my money",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iamlscx",
                                    "author": "Accomplished-Way7608",
                                    "score": -1,
                                    "created_utc": 1653971911.0,
                                    "response": "It's gone bro.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iameosj",
                    "author": "McL0v3n",
                    "score": -1,
                    "created_utc": 1653967451.0,
                    "response": "Good luck man! Coin bases customer service is trash! There only job is to not admit fault! They will lead you on for ever. I had crypto stolen out of my account with out any 2 step verification 40+ times in a row until they wiped out my whole crypto account and bank account after they got my crypto they started buying crypto with my bank account attached until I noticed. Went on for 7 hours with no notifications or anything. The only money I got back was the money out of my bank account, and coin base is trying to say I owe them that money since my bank reversed the charges. Lost all crypto though. Sorry to be a downer man lol hope you have a better experience with customer service.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iakvf3g",
                    "author": "AutoModerator",
                    "score": 0,
                    "created_utc": 1653939483.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ialkemv",
                            "author": "Kultr0",
                            "score": 1,
                            "created_utc": 1653951660.0,
                            "response": ">12037869",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iall4p8",
                                    "author": "coinbasesupport",
                                    "score": 2,
                                    "created_utc": 1653952028.0,
                                    "response": "Hello thre, u/Kultr0. Thanks for reaching out to us regarding your missing transactions and apologies if you had to go through such experience. Please allow us sometime to check this for you. Will share you another update here once we have the information to your concern. Thank you!",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "ialmol5",
                                    "author": "coinbasesupport",
                                    "score": 1,
                                    "created_utc": 1653952834.0,
                                    "response": "Thanks for waiting, u/Kultr0. We have escalated your support case to the relevant team, and they are now working on a resolution for you. We have also sent a separate follow-up to advise them to share with you an update so please expect for one anytime soon. Thank you!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}