{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "v05h49",
            "title": "Anyone got an explanation on missing W Luna?",
            "url": "https://www.reddit.com/r/CoinBase/comments/v05h49/anyone_got_an_explanation_on_missing_w_luna/",
            "author": "Bulky_Experience1045",
            "created_utc": 1653806633.0,
            "score": 3,
            "num_comments": 3,
            "subreddit": "CoinBase",
            "selftext": "My wrapped Luna also just disappeared into thin air on Coinbase. I know I’m not the only one. Anyone received any message from Coinbase regarding this?",
            "stickied": false,
            "comments": [
                {
                    "id": "iaeg0ll",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653806633.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaegjuw",
                    "author": "coinbasesupport",
                    "score": 1,
                    "created_utc": 1653807076.0,
                    "response": "Hi, u/Bulky_Experience1045! WLUNA and UST were delisted on May 27th, 2022 at 9am PDT. While these wallets are still available for send / receive transactions, they may not appear near the top of your Asset pages as they previously did.\n\nFor Coinbase.com/mobile - you can view these wallets by navigating to the bottom of the Assets page, search for the wallet via Trade, or select the wallet via the send/receive or deposit/withdraw flow.\n\nFor Coinbase Pro, because WLUNA/UST is no longer tradable, the value of these assets will no longer be available in total portfolio balance (this happens for any non-tradable asset, like XRP). You can also find these wallets by selecting the Send / Receive or Deposit / Withdraw options or navigating to Portfolios. Thanks!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaeiijl",
                            "author": "Bulky_Experience1045",
                            "score": 1,
                            "created_utc": 1653808764.0,
                            "response": "It says I have 0 wrapped Luna in my wallet? But clicking on the wallet I see all my w Luna transactions. I find it strange 🤷🏽‍♂️",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}