{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uz0wrc",
            "title": "Trading features still restricted even though I paid Coinbase back what I owe. Please don't take forever to fix this.",
            "url": "https://www.reddit.com/r/CoinBase/comments/uz0wrc/trading_features_still_restricted_even_though_i/",
            "author": "Then_Log_9413",
            "created_utc": 1653665904.0,
            "score": 1,
            "num_comments": 38,
            "subreddit": "CoinBase",
            "selftext": "My case support number is 12005676.  I understand that according to Coinbase that it takes three to five business days once a payment has been processed and received for approval of restrictions to be lifted on an account, and the reason there's an added wait time on top of the wait of having your payment transactions processed is done for no other reason than to sociopathically inconvenience and infuriate every unfortunate soul that becomes a victim to this crap.\n\nYou guys received your money. I've been using Coinbase Pro for over two years now, and the first time I use your Instant USD deposit that is anything but instant, the transactions get rejected by my bank despite me having enough money in my account to cover the deposit, and I get these arbitrarily indefinite restrictions on my account. I paid one payment I owed Coinbase and the other with USD. I know for a fact that both of them have been paid and the USD payment was debited from my checking account last night.\n\n Please don't make me go through this nightmare where you tell me you will stop holding my money hostage I'm three to five days and then entire weeks go by without anything being resolved. \n\nI don't understand why you guys simply receiving the money I \"owed\" you isn't good enough to give me access to my cryptocurrency again. Why does there have to be a three to five day approval process? You got your money, it has officially been processed and debited, now stop holding my money hostage you have no moral right to be doing what you guys are doing!",
            "stickied": false,
            "comments": [
                {
                    "id": "ia7dq31",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653665905.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia7f0cg",
                    "author": "coinbasesupport",
                    "score": 1,
                    "created_utc": 1653666431.0,
                    "response": "Hello u/Then_Log_9413, we appreciate you reaching out to us regarding your account. We understand how frustrating this can be and apologize for any inconvenience this may have caused. After reviewing your case, we do see that our agents sent you a response 1 hour ago. If you have any further questions, we kindly ask that you refer them to the existing email thread. We appreciate your cooperation and understanding.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia7jc0s",
                            "author": "Then_Log_9413",
                            "score": 1,
                            "created_utc": 1653668196.0,
                            "response": "I tried to respond to them but am unable to for some reason.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia7k0mj",
                                    "author": "coinbasesupport",
                                    "score": 1,
                                    "created_utc": 1653668474.0,
                                    "response": "Thanks for letting us know, u/Then_Log_9413.\n\nWhat error are you getting when trying to reply?\n\nWe'll look out for your reply.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia7f22c",
                    "author": "Then_Log_9413",
                    "score": 1,
                    "created_utc": 1653666450.0,
                    "response": "I mean seriously, you guys are going to lock me out of selling and withdrawing cryptocurrency over TEN FREAKING DOLLARS when you could have just as easily taken it out the crypto balance I already had since that's what you threaten to do anyways?\n\nThat's like a bank being owed a nickel from someone who is a millionaire and as a result locks his checking account instead of just debiting the 5 cents from six figure debit account balance, and then continuing to bar the owner from his money even after he paid back the nickel.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia7kyxi",
                    "author": "Then_Log_9413",
                    "score": 1,
                    "created_utc": 1653668857.0,
                    "response": "Their chats disappeared.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia7l0oz",
                    "author": "Then_Log_9413",
                    "score": 1,
                    "created_utc": 1653668876.0,
                    "response": "Earlier this week I used the USD Instant Deposit feature on Coinbase Pro and I guess I made an error in assuming that it would be debited out of my checking account on the same day I get paid from my job in direct deposit, at least at the earliest. The two transactions were for $10 and $60. I paid the $60 I owed to Coinbase with my Bitcoin balance, and I paid the $10 with USD from my bank. I saw in my online account history that $10 was debited some time yesterday to Coinbase, so I now know for a fact I have paid off what I owe in order to have the restrictions on buying, selling, converting, and withdrawing lifted from my account, but for some reason the restrictions are still there despite Coinbase having officially received the payments.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia7mc7y",
                            "author": "coinbasesupport",
                            "score": 1,
                            "created_utc": 1653669418.0,
                            "response": "We understand your concern with your restrictions not be lifted yet, and want to help you resolve this. In order to do so, we kindly ask that you reply to our email sent one hour ago with the details of your concern. Thank you for your patience while we work to restore your account access.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iah0okm",
                                    "author": "Then_Log_9413",
                                    "score": 1,
                                    "created_utc": 1653859839.0,
                                    "response": "Which e-mail? I checked my inbox and couldn't find it. I mean the post right above should explain it perfectly.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iah333j",
                                            "author": "coinbasesupport",
                                            "score": 1,
                                            "created_utc": 1653861021.0,
                                            "response": "Happy to help point you in the right direction. Looks like we followed up on your case via email sent May 27th. If you are having any difficulty seeing this email within your inbox, try checking your spam and trash folders.\nSome email providers automatically filter our automated messages as spam. \n\nA quick Google search for \"how to check my spam settings\" should show you how to change these settings. Be sure to add your specific email provider (Gmail, Yahoo, Outlook, etc.) in your search.\nReview all of your folders, filters, and labels (e.g., Gmail's Social and Promotional labels/tabs); sometimes a filter will move the email out of the inbox.\n\nSearch for \"@coinbase.com\" in your email provider's search function, which should locate all emails from us, even if they've been directed to other folders.\n\nIf your email settings has a Safe Senders list (this is different from your contacts list), add @coinbase.com.\n\nStill having trouble finding the email, try contacting your email provider to find out what's happening to incoming emails from @coinbase.com. There may be an issue that needs to be sorted out with the provider.\nIf you're using an email program like Microsoft Outlook or Mozilla Thunderbird, you might need to log into your email account from a browser on your computer to change the email settings.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia7t4cu",
                    "author": "Kiwip0rn",
                    "score": 1,
                    "created_utc": 1653672208.0,
                    "response": "🙄",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia9a8yg",
                    "author": "jhanon76",
                    "score": 1,
                    "created_utc": 1653697037.0,
                    "response": "Anyone besides the OP explain why everybody owes money to exchanges??",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaj01nr",
                    "author": "riggerrducker",
                    "score": 1,
                    "created_utc": 1653903578.0,
                    "response": "We are having a giveaway of total of 250$ #PumpToken, check it out now. Launch on June 4 🤟 https://t.me/PumpOfficialGroup",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaj9lyl",
                    "author": "SmgymaAy",
                    "score": 1,
                    "created_utc": 1653911419.0,
                    "response": "Check out #AstroBirdz. Big things happening with this project with release of marketplace and N.E.S.T. (NFT Energizing Space Terminal). Load up now or #FOMO in later. Your choice!\n\n @astro_birdz #birdzarmy \n #luna #BTC #web3 #gem\n #NFT #NFTCommunity \n https://t.me/AstroBirdzOfficial",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaj9mbq",
                    "author": "lodalelemeratu",
                    "score": 1,
                    "created_utc": 1653911425.0,
                    "response": "Check out #AstroBirdz. Big things happening with this project with release of marketplace and N.E.S.T. (NFT Energizing Space Terminal). Load up now or #FOMO in later. Your choice!\n\n @astro_birdz #birdzarmy \n #luna #BTC #web3 #gem\n #NFT #NFTCommunity \n https://t.me/AstroBirdzOfficial",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}