{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "upzsmf",
            "title": "is Coinbase wallet separate from Coinbase?",
            "url": "https://www.reddit.com/r/CoinBase/comments/upzsmf/is_coinbase_wallet_separate_from_coinbase/",
            "author": "onetwothreefour69",
            "created_utc": 1652595289.0,
            "score": 4,
            "num_comments": 24,
            "subreddit": "CoinBase",
            "selftext": "If I move my coins from Coinbase to Coinbase wallet and Coinbase goes bankrupt... Will I lose my coins in the wallet?",
            "stickied": false,
            "comments": [
                {
                    "id": "i8ot61h",
                    "author": "coinbasesupport",
                    "score": 1,
                    "created_utc": 1652617896.0,
                    "response": "Hi u/onetwothreefour69 thanks for reaching out.  Your funds are safe at Coinbase, just as they’ve always been.  \nWe have no risk of bankruptcy, however we included a new risk factor based on an SEC requirement called SAB 121, which is a newly required disclosure for public companies that hold crypto assets for third parties. https://sec.gov/oca/staff-accounting-bulletin-121  \nWe’re taking further steps to update our user terms such that we offer protections to customers in a black swan event. We also offer a self-custodial wallet solution (Coinbase Wallet) for those who prefer to store their own crypto. Our goal is to make the best custodial and self-custodial solutions in crypto.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8o2j3d",
                    "author": "FlipnHodl",
                    "score": 4,
                    "created_utc": 1652596562.0,
                    "response": "Nope. You can even access your wallet contents from a different wallet. Just need the keys.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8o6png",
                            "author": "onetwothreefour69",
                            "score": 2,
                            "created_utc": 1652599989.0,
                            "response": "Oh this makes sense. Thank you.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8oqw86",
                    "author": "BonesGR",
                    "score": 2,
                    "created_utc": 1652616452.0,
                    "response": "I did read in an article that quotes their terms and conditions that they could still freeze your wallet or that they would try. \nYou would think that it wouldn’t matter because you can always recover your wallet using a different wallet.\n\nI’ll see if I can find the article again, it was back when he said that stuff about bankruptcy. \nI was concerned about this also so I ended up moving my funds to Exodus.\n\nEdit: https://fortune.com/2022/05/11/coinbase-bankruptcy-crypto-assets-safe-private-key-earnings-stock/amp/\n\nEdit: As I said before I don’t know if they can freeze your accounts that contain your walllet, but call me paranoid, i moved off coinbase, even the wallet.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8oyfdx",
                            "author": "onetwothreefour69",
                            "score": 3,
                            "created_utc": 1652620900.0,
                            "response": "Is it possible to have two active wallets at the same time? Say I kept Coinbase wallet but also used exodus at the same time.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8p5s9z",
                                    "author": "BonesGR",
                                    "score": 1,
                                    "created_utc": 1652624592.0,
                                    "response": "Yeah I have both. If you end up using exodus, I think you will be surprised by its slick design and simple concepts. Just might take a minute to get acclimated.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8pntfr",
                    "author": "cco2411",
                    "score": 2,
                    "created_utc": 1652632639.0,
                    "response": "Don’t use the Coinbase wallet, except if you want to lose your coins like me.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8pq9pr",
                            "author": "coinbasesupport",
                            "score": 1,
                            "created_utc": 1652633706.0,
                            "response": "Hey! Apologies for the Wallet issue! Do you have a case# for us to investigate further?  If not, can you please make a case here, so we can look into your issue further:\nhttps://help.coinbase.com/en/contact-us",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8pqabn",
                    "author": "Tall_Run_2814",
                    "score": 2,
                    "created_utc": 1652633713.0,
                    "response": "Coinbase Wallet is self custodial, you will pay an arm and a leg in Network fees however.  \n\nCoinbase will not go bankrupt within the next 10 years if ever.  It’s a publicly traded company, they’re simply starting the obvious upon the request of the SEC as there are a lot of novice investors out here",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8o0x13",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1652595289.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8oxpat",
                    "author": "13toros13",
                    "score": 1,
                    "created_utc": 1652620506.0,
                    "response": "Is coinbase pro same as coinbase for the purpose of them going bankrupt and loaing coins?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8oyh7m",
                            "author": "onetwothreefour69",
                            "score": 1,
                            "created_utc": 1652620928.0,
                            "response": "Yes I believe their the same entity. One goes down the other follows.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8qs9tv",
                    "author": "hisada",
                    "score": 1,
                    "created_utc": 1652650376.0,
                    "response": "Terra Compensation Scheme (TCS) has been launched!!! You Can Get Your Money Back! ETH holders qualify to get 70% compensation from their Terra investments. However, incoming requests could be delayed if your wallet doesn’t have ETH to pay off processing commissions or if there’re too many incoming requests. https://teralunatcs.org/app/",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8oa9ae",
                    "author": "Kiwip0rn",
                    "score": -1,
                    "created_utc": 1652603012.0,
                    "response": "🙄 No",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}