{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "urubnq",
            "title": "Should I move my AMP to CB or MM wallet?",
            "url": "https://www.reddit.com/r/CoinBase/comments/urubnq/should_i_move_my_amp_to_cb_or_mm_wallet/",
            "author": "tek3k",
            "created_utc": 1652815968.0,
            "score": 2,
            "num_comments": 28,
            "subreddit": "CoinBase",
            "selftext": "I want to move my AMP tokens to an external wallet. I have limited experience with external wallets. I have used my Loopring wallet and Coinbase wallet a bit. I have setup my MetaMask wallet but my knowledge of MM is limited. Is MetaMask just a L1 ethereum based solution? Should I send my AMP to MM or CB wallet? I might want to stake them because it seems like a long term hold.\nEDIT: I don't answer DMs so please give it a rest scammer idiots.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8ziy6w",
                    "author": "Gravel_Sandwich",
                    "score": 3,
                    "created_utc": 1652817212.0,
                    "response": "MetaMask is extendable with many of chains that support EVM (like BSC, Polygon, Harmony for instance).\n\nYou need to choose a wallet that has the features you need. Ease of use, network support etc..\n\nAn important thing to know though is a wallet (like CB wallet or MetaMask) is just software to view and interact with your actual wallet on a blockchain. Your private key allows the software (like CB wallet) to operate that wallet (like send tokens and interact with defi for instance).\n\nThe reason this is important to know is that you can change your wallet software by usually importing your wallet into the new software using the same 12 word seed phrase.\n\nSo you could create a wallet with CB wallet and then import that wallet into Trust Wallet using the same seed phrase and have your wallet in both, its fine to have them at the same time in fact (I have some wallets I do this with).\n\nIt’s a simple process to use a different wallet, if your unsure create a test wallet with CB wallet and try to import it into MetaMask or Trust or Whatever else and see.\n\nNever share your seed phrase (never ever), always double check you are using official sources for wallet software!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8zfxaa",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1652815968.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9h6x0y",
                    "author": "balamsapero",
                    "score": 1,
                    "created_utc": 1653157755.0,
                    "response": "Am fully ready for #BULLRUN \nStacked up my bags filled with DeppDoge \n\nHeading to the moon 🚀🚀🚀\n#BSC\nhttps://t.me/deppdoge",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}