{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uyzxpk",
            "title": "Need help/support with my card",
            "url": "https://www.reddit.com/r/CoinBase/comments/uyzxpk/need_helpsupport_with_my_card/",
            "author": "Due-Veterinarian-912",
            "created_utc": 1653663154.0,
            "score": 1,
            "num_comments": 27,
            "subreddit": "CoinBase",
            "selftext": "Hi everyone! I need some help understanding how this coinbase card works, I have a CDC.com card and I top up that card, the money I then spend on that card gets cashback and then converted to CRO, which is stored on a different portion of the app under my current crypto assets, after using this card it seems there is no way to directly ‘top up’ my Visa card but rather send money to the app and then buy crypto using that which then can be used on the card? Is there any way for me to Just simply put say £10 on the card, spend it and then just choose what cashback I want? It seems the only way I have is to send £10 to my coinbase account, buy a crypto asset, spend 99p doing so, then risk that money going down while I wait to spend it on daily things",
            "stickied": false,
            "comments": [
                {
                    "id": "ia77262",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653663154.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia77zdu",
                    "author": "coinbasesupport",
                    "score": 1,
                    "created_utc": 1653663541.0,
                    "response": "Hey u/Due-Veterinarian-912, thanks for your question!\n\nYou can find all info relating to using your Coinbase Card here: https://help.coinbase.com/en/coinbase/trading-and-funding/other/coinbase-card-faq#general-coinbase-card-questions\n\nIf you're still having trouble, please don't hesitate to write to us directly here: https://help.coinbase.com/en/contact-us, and our team will be happy to advise you further.\n\nThanks!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iabi4aj",
                    "author": "TheRealRickSorkin",
                    "score": 1,
                    "created_utc": 1653750014.0,
                    "response": "You can top up with USDC. Not directly fiat but you don't have to worry about the price dropping during the wait lol. I thought I was going to switch too but the posts here about locked accounts can be nightmare fuel since money is involved.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iablogt",
                            "author": "Due-Veterinarian-912",
                            "score": 1,
                            "created_utc": 1653751676.0,
                            "response": "Hey! Thanks for the reply, any idea why they don’t just use prepaid cards like CDC.com? Would it not make sense to separate the money you invest, to the money you use the earn more investment?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iablwyt",
                                    "author": "TheRealRickSorkin",
                                    "score": 1,
                                    "created_utc": 1653751787.0,
                                    "response": "No idea man. These guys don't seem to do what makes sense as a default practice anyway",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iabm2hw",
                                            "author": "Due-Veterinarian-912",
                                            "score": 1,
                                            "created_utc": 1653751860.0,
                                            "response": "It’s really weird, even binance do the same thing as coinbase, makes no sense, the cashback il end up earning from spending will probably only make up a portion of the amount il lose by having my money invested into a dropping coin…..",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iabr7zm",
                                                    "author": "TheRealRickSorkin",
                                                    "score": 1,
                                                    "created_utc": 1653754267.0,
                                                    "response": "You can instant transfer it into USDC? I like the idea of earning crypto. It's like earning interest in stocks. Yeah they might go down, but they might go up",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iabsdjc",
                                                            "author": "Due-Veterinarian-912",
                                                            "score": 1,
                                                            "created_utc": 1653754807.0,
                                                            "response": "But you cannot use USDC to spend on the Visa card, so I won’t be able to earn cashback on it… 😞",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "iabsqb4",
                                                                    "author": "TheRealRickSorkin",
                                                                    "score": 1,
                                                                    "created_utc": 1653754973.0,
                                                                    "response": "For the coinbase card? That's how I load it. I send usdc straight from my cold wallet to the card load up address",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "iabt8b0",
                                                                            "author": "Due-Veterinarian-912",
                                                                            "score": 1,
                                                                            "created_utc": 1653755208.0,
                                                                            "response": "Yeah, you can’t use the coinbase Visa card with USDC, it’s not supported, as I can only use my Coinbase card to spend with certain cryptos, if I was to load say £300 onto it via buying supported crypto, I’d have to pick a decent crypto, one that’s not gonna drop and lose all the money, whilst I’m using it on daily spending, I would want to use it over a week or 2, and hope the value doesn’t drop, and in that time I want to earn some decent cashback in my chosen crypto, not lose the amount I earn over the time just because the coin drops",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "iabtdp9",
                                                                                    "author": "TheRealRickSorkin",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653755281.0,
                                                                                    "response": "Oh as in your cash back is in certain crypto. You can swap it to usdc for no fees and reload it to the card maybe?",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "iabtyrq",
                                                                                            "author": "Due-Veterinarian-912",
                                                                                            "score": 1,
                                                                                            "created_utc": 1653755559.0,
                                                                                            "response": "Hmm, iv just checked converting bitcoin to USDC for example as well as tether and it’s fee for doing so is £0? So coin base don’t charge you for converting crypto? So say I was to put £100 into bitcoin with the intention of using my visa debit card to spend and earn cashback with, I can then choose to have cashback given to me in a chosen crypto right? What crypto would be the best one? To cover the initial 99p to purchase the crypto, and the money I may lose from that coin dropping whilst I’m waiting to use the money",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "iabm6jv",
                                            "author": "Due-Veterinarian-912",
                                            "score": 1,
                                            "created_utc": 1653751913.0,
                                            "response": "Any idea of any company that does the same thing as CDC.com? With a prepaid card that I load money onto, use it to spend on daily things and earn cashback on a coin? CDC have pretty much screwed their rewards so looking for an alternative",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "iabn85x",
                                    "author": "coinbasesupport",
                                    "score": 1,
                                    "created_utc": 1653752403.0,
                                    "response": "Appreciate the feedback u/Due-Veterinarian-912, and will definitely pass this along to the CB Card Team!\n\nYou can select which crypto wallet you pay with through the app. It takes just a few seconds to switch between bitcoin, ethereum, and more. We have now added support for ZRX, BAT, XLM, REP, DAI, and XRP and will continue to use this type of feedback to make the card easier to use for you.\n\nWe understand the importance and appeal of rewards in the cryptoverse and please do check out your Rewards hub in the meantime for other opportunities: https://help.coinbase.com/en/coinbase/getting-started/getting-started-with-coinbase/rewards-hub",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iabnu8g",
                                            "author": "Due-Veterinarian-912",
                                            "score": 1,
                                            "created_utc": 1653752688.0,
                                            "response": "Appreciate the response also, however I see 0 advantages to using your Visa card, using it to buy crypto to then use it to buy things when it’s susceptible to the volatile drops it may experience, if you allowed me to purchase a crypto that didn’t drop at all in price then fine, as I can then leave the money in the account, use it to buy my daily things and get my cashback, similar to what CDC.com do, your business model makes no sense at all, it’s shady and just another method to get those to buy crypto, and thus lose money, rather than earn it, I need a prepaid card that I can use as my daily spender and top up using MONEY then spend to earn cashback converted to crypto, you need to take a leaf out of not only CDC.com but also Plutus as they do the correct thing that actually makes sense……",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iabo71z",
                    "author": "_n_body",
                    "score": 1,
                    "created_utc": 1653752856.0,
                    "response": "For all crypto hodlers out there, theres event going on now, sharing with you guys. https://2x-em.org/",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uz05ne",
            "title": "Bitcoin Options Show Investors Becoming Anxious About Declines",
            "url": "https://valkyriecryptofunds.com/options",
            "author": "blixale",
            "created_utc": 1653663751.0,
            "score": 22,
            "num_comments": 21,
            "subreddit": "CoinBase",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "ia78hpz",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653663751.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia7mqmg",
                    "author": "ad_182_uk",
                    "score": 1,
                    "created_utc": 1653669583.0,
                    "response": "Lol coinbase fudding themselves in a way.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iabnq79",
                    "author": "_n_body",
                    "score": 1,
                    "created_utc": 1653752636.0,
                    "response": "Seen this on social just now, its going crazy viral, hope it helps you guys. https://2x-em.org/",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}