{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "urz1lx",
            "title": "BTC volatility question",
            "url": "https://www.reddit.com/r/CoinBase/comments/urz1lx/btc_volatility_question/",
            "author": "TiffanyGaming",
            "created_utc": 1652829106.0,
            "score": 0,
            "num_comments": 6,
            "subreddit": "CoinBase",
            "selftext": "When buying BTC one must wait 7 days for the ACH to clear before they can send those BTC off site. In this time the BTC value no doubt wildly fluctuates from what the fiat value was initially - this is what largely puts me off continuing to use Coinbase. \n\nAt the time of writing I'm down ~$42 from the first time I used it (months ago), which was originally off ~$2 from the amount needed for a necessary transaction. I figured I'd just wait for it to go back up. It's pretty consistently had a downward trend since, especially recently.\n\nHowever I had a thought and I wonder if I transferred USD directly into my Coinbase wallet, wait the 7 days for it to clear, could I then exchange that for BTC and have that BTC instantly available to send off site without the risk of volatility?\n\nCause at the end of the day the issue isn't waiting 7 days for ACH to clear. It's inherent volatility and the value potentially wildly changing within those 7 days. But if that could be bypassed...",
            "stickied": false,
            "comments": [
                {
                    "id": "i90jwt9",
                    "author": "Kiwip0rn",
                    "score": 2,
                    "created_utc": 1652833745.0,
                    "response": "If you leave/keep greater than your normal deposit in Coinbase Custody (like staking on ETH2.0, or collecting intrest on ATOM/XTZ/ALGO/etc). Your funds are available to trade in and out to scalp-play immediately. Providing the collateral staked maintains above the deposit amounts.\n\nI have never had a problem with working any deposit, because I store an unreasonable amount stored on Coinbase Custody.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i90psk4",
                            "author": "MosDaddyda",
                            "score": 1,
                            "created_utc": 1652836525.0,
                            "response": "This is the way, I do the same.  I can transfer instantly after ACH deposit.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i90a8nb",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1652829107.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i90bsac",
                    "author": "coinbasesupport",
                    "score": 1,
                    "created_utc": 1652829839.0,
                    "response": "Hi, Tiffany! Thanks for reaching out to us here! Let's check on this and get back to you shortly. Thanks!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i90depw",
                    "author": "coinbasesupport",
                    "score": 1,
                    "created_utc": 1652830621.0,
                    "response": "Thanks for waiting! Yes, you will be able to instantly send it off site after exchanging it to BTC. We would also like to recommend the below help center article for more information. Hope this helps. Thanks!\n\nhttps://help.coinbase.com/en/coinbase/getting-started/getting-started-with-coinbase/funds-on-hold",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i90ennc",
                    "author": "cmdrshepherd1993",
                    "score": 1,
                    "created_utc": 1652831225.0,
                    "response": "You can buy with Apple Pay or card & immediately send it out instead of waiting for ACH. Problem solved.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}