{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "kgi38b",
            "title": "Terrible Coinbase experience. Account clearly hacked and funds stolen. (Case 03035902)",
            "url": "https://www.reddit.com/r/CoinBase/comments/kgi38b/terrible_coinbase_experience_account_clearly/",
            "author": "ElProfe987",
            "created_utc": 1608418076.0,
            "score": 69,
            "num_comments": 81,
            "subreddit": "CoinBase",
            "selftext": "My coinbase account was hacked in early November and it took over 6 weeks and dozens of emails (after coming onto reddit and posting several times) for me to ever hear from an actual human response. I have been completely in the dark during this whole time.\n\nNow they tell me my account was clearly hacked from a remote IP address and funds were stolen, but there is nothing they can do.\n\nHow can a company that is about to have an IPO not have any telephone support and treat their customers this way? \n\nHopefully the continuing bad press that is posted here will force Coinbase to change their ways, but if not, a bank that is run this poorly seems like very poor stock investment in the future.\n\nI hope anyone who reads this will learn from my mistake and not do business with such a shady company.",
            "stickied": false,
            "comments": [
                {
                    "id": "ggfeeis",
                    "author": "salimmk",
                    "score": 10,
                    "created_utc": 1608427202.0,
                    "response": "I agree that they need to do better with hacking victims. When I was hacked I submitted multiple tickets and never got a response for weeks. Only way I ever got through was coming to this subreddit and complaining, that finally got the recovery process started.\n\nI'm so glad I used the vault wallet, the 48 hour waiting period for withdrawals really saved me. Also the automated number to dial in and lock your account even if you've been hacked is really good.\n\nI wish more people would take cybersecurity more seriously. I know I didn't until I was hacked and it was too late. Now I use hardware security keys, unique passwords for every account, app based 2FA, non-admin account for PC, no browser extensions etc etc...",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ggft67f",
                            "author": "ElProfe987",
                            "score": 6,
                            "created_utc": 1608435942.0,
                            "response": "I called in to lock my account as soon as I saw my 2FA was changed, but I think the bitcoin transaction already went thru before I had a chance to lock it.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ggg6wq2",
                                    "author": "raymonddurk",
                                    "score": 5,
                                    "created_utc": 1608445388.0,
                                    "response": "It sounds like you had SMS 2FA? That's not 2FA. 1. Transfer your funds off of an exchange when you're able to but 2. Use a Yubikey or if not then Google Authenticator.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "ggfudcs",
                                    "author": "salimmk",
                                    "score": 3,
                                    "created_utc": 1608436688.0,
                                    "response": "Yeah it's too late by the time you find out. The hackers plan it like that. That's why they make the vaults with 48 hour waits and secondary email approval. But with a bad malware infection hackers can work around it.\n\nAnother good luck I had was a backup phone number in my coinbase account which got an alert a withdrawal was initiated. This was after the hacker removed my primary phone number but I guess coinbase has a policy that you can't remove all the phone numbers. If I had missed that text I could have lost everything.\n\nAnother thing hackers do is delete emails containing password change and email change alerts. Or even create forwarding rules in your account to steal your emails.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "ggfnge6",
                            "author": "amatushevsky",
                            "score": 2,
                            "created_utc": 1608432427.0,
                            "response": "Hey, i am new guy in Coinbase. wandering - if actually had the 2FA before they hacked you?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ggfoscn",
                                    "author": "salimmk",
                                    "score": 1,
                                    "created_utc": 1608433221.0,
                                    "response": "Yeah I had it. But some people have very bad habits like saving their secret key in their cloud storage. When I got infected with malware I believe the hacker got the secret key which was saved in my drive and logged my keystrokes to steal my password.\n\nPlease don't make the same mistakes that I did.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "gyoy21y",
                                            "author": "sparveen2021",
                                            "score": 1,
                                            "created_utc": 1621429993.0,
                                            "response": "Have you got your money back from Coinbase at the end?\n\nThey should take the responsibility to protect the security and cybercrime to keep our fund safe",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "gyoyrzs",
                                                    "author": "salimmk",
                                                    "score": 1,
                                                    "created_utc": 1621430323.0,
                                                    "response": "Yes I did. The 2 day waiting period on the vault wallet saved me.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ggeu57d",
                    "author": "tripper21",
                    "score": 10,
                    "created_utc": 1608418133.0,
                    "response": "How did you get hacked?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ggfk7cm",
                            "author": "BiochemBeer",
                            "score": 7,
                            "created_utc": 1608430546.0,
                            "response": "This - did you have 2FA enabled?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "gggaib9",
                                    "author": "brianddk",
                                    "score": 2,
                                    "created_utc": 1608448635.0,
                                    "response": "At this point, if someone doesn't enable HW-2FA, I consider it the same as no 2FA.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "ggfvu8g",
                                    "author": "ElProfe987",
                                    "score": 4,
                                    "created_utc": 1608437588.0,
                                    "response": "I did. All coinbase would say is that my account was accessed by a certain IP and then transferred all my bitcoin out of the account. They said they are not responsible for anything so I am out of luck.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ggfw9jr",
                                            "author": "BiochemBeer",
                                            "score": 10,
                                            "created_utc": 1608437853.0,
                                            "response": "That would mean that they had your 2FA. If someone got your password and 2FA then you are out of luck. What kind of 2FA? Did someone steal your identity?\n\nThe vault feature would slow this down at least.\n\nI hope you didn't lose too much. If you are in the US file a police report, depending on your tax situation you might be able to claim the loss at least.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "hk07fzy",
                                            "author": "Super-Airport1111",
                                            "score": 2,
                                            "created_utc": 1636503542.0,
                                            "response": "Many of the thousands affected lost their bitcoin because Coinbase broke their own user agreement. What about their protection for password resets with new devices. 24 to 48 hours, no exceptions, except for hackers.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "gggjgp6",
                                            "author": "m0rdecai665",
                                            "score": 2,
                                            "created_utc": 1608458006.0,
                                            "response": "Did they tell you that IP?",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ggfwmra",
                    "author": "_befree_",
                    "score": 18,
                    "created_utc": 1608438078.0,
                    "response": "You should always transfer your funds off of Coinbase and into a private wallet. This is crypto 101.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "gggg2sp",
                            "author": "Big-Hold826",
                            "score": 24,
                            "created_utc": 1608454266.0,
                            "response": "He should have the option to leave it there and not worry about safety if that is their business to custody. If he is making trades live and its hacked that answer of yours will not fly.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hq0h8b6",
                                    "author": "Plenty-Garden-8886",
                                    "score": 2,
                                    "created_utc": 1640514524.0,
                                    "response": "i agree that answer shouldnt fly lol i was live making trades when hacked dec 23rd 3 days ago smh crazy how smootly and easily they targeted me but even more crazy seeing all these storys of the same thing happinging. i personally lost just under 1k usd and it hurt but ill bounce back im seeing some losing as high as 11.6 million. i was sending my eth to a wallet but neglected to send other coins and paid the price...",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "ggh1r0v",
                                    "author": "_befree_",
                                    "score": 1,
                                    "created_utc": 1608470722.0,
                                    "response": "This true. Trading is another thing. I still don’t keep my coins there when I am not actively trading.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "gghwg2d",
                                    "author": "BiochemBeer",
                                    "score": 1,
                                    "created_utc": 1608485070.0,
                                    "response": "The vault feature there locks your funds and requires additional verification. If people do plan to use Coinbase for long term storage, they should enable this.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ggj1qkn",
                                            "author": "Big-Hold826",
                                            "score": 3,
                                            "created_utc": 1608505537.0,
                                            "response": "coinbase should enable this automatically, if thats the only way they can Guarantee your funds will not be stolen. If a bank is compromised and your funds are stolen they reimburse you. This goes for credit cards too because security is what the service is for. All the high fees coinbase takes are meant to secure their security infrastructure. People are letting them get away with way too much. Kraken is an example of an exchange that does not play when it comes to security.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hpyy44p",
                                                    "author": "Aware-Ad7554",
                                                    "score": 2,
                                                    "created_utc": 1640477691.0,
                                                    "response": "Automatically it should be enabled!",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "hq0hd4e",
                                            "author": "Plenty-Garden-8886",
                                            "score": 1,
                                            "created_utc": 1640514647.0,
                                            "response": "the scammers get right past the 2step verification so easily its insane",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "gggl16z",
                            "author": "Nicadelphia",
                            "score": 9,
                            "created_utc": 1608459750.0,
                            "response": "Then what's the point of coinbase? Serious question genuinely curious",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ggh1ngo",
                                    "author": "_befree_",
                                    "score": 2,
                                    "created_utc": 1608470675.0,
                                    "response": "Well for those of us that live in the wasteland of New York State, they’re aren’t any other legal options.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "gghbval",
                                    "author": "sickvisionz",
                                    "score": 2,
                                    "created_utc": 1608475612.0,
                                    "response": "It's an exchange.  You buy and exchange crypto.  Once done, you should move it to your wallet. Some people treat it like it's a bank and they hold their life savings in it.\n\nExchanges have roughly zero insurance on crypto. It they say they do, read the fine print. It's only on literal real world currency in your account, not the crypto holdings.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "ggh6erp",
                            "author": "Cantersoft",
                            "score": 3,
                            "created_utc": 1608473088.0,
                            "response": "Hi, any tips on where to move it though? How do I get a private wallet?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ggh840v",
                                    "author": "_befree_",
                                    "score": 3,
                                    "created_utc": 1608473841.0,
                                    "response": "I use a trezor hardware wallet. I love it but there are many options. Mycelium or electrum are good wallets that do not require a hardware device.\n\nAnything that allows you to control your private keys will suffice. Just make sure you don’t lose it or allow anyone access. \n\nThis is the trade off between an exchange and a hardware wallet. On an exchange the website keeps your keys and the responsibility is not on you. Private wallets are much more secure but rely on the user not making a serious error.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ggp11p9",
                                            "author": "Cantersoft",
                                            "score": 1,
                                            "created_utc": 1608648152.0,
                                            "response": "Tysm. I will look into these.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "hpyyazz",
                                    "author": "Aware-Ad7554",
                                    "score": 1,
                                    "created_utc": 1640477786.0,
                                    "response": "Buy a nano -x or Trezor only😁",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "ggh2st6",
                            "author": "Jager1966",
                            "score": 4,
                            "created_utc": 1608471252.0,
                            "response": "So sick of hearing this bullshit.  How is crypto ever going to gain legitimacy if they can't even secure it online.  FUCK a hardware wallet.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ggh9ovc",
                                    "author": "LimbBizkit",
                                    "score": 1,
                                    "created_utc": 1608474558.0,
                                    "response": "Cb isn’t a hardware wallet",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "ggfztst",
                            "author": "ElProfe987",
                            "score": 6,
                            "created_utc": 1608440085.0,
                            "response": "Live and learn",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ggeu037",
                    "author": "AutoModerator",
                    "score": 3,
                    "created_utc": 1608418076.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gghd4bs",
                    "author": "Nomivad",
                    "score": 2,
                    "created_utc": 1608476230.0,
                    "response": "A further security step to strongly consider is enabling whitelisting on your account. That way even if they get your 2fa somehow you will get a notification that they tried to add a new ip address and you will have 48 hours to lock down your account.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gh8bvag",
                    "author": "ElProfe987",
                    "score": 2,
                    "created_utc": 1609110177.0,
                    "response": "Filed a formal complaint, but don’t expect any results. I realize coinbase isn’t a bank, but they are a platform that millions of people use to store billions of currencies. They have a responsibility to give people back their money when they were clearly a victim of fraud.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hvyt1z6",
                            "author": "Simple_Holiday_7494",
                            "score": 1,
                            "created_utc": 1644254061.0,
                            "response": "Exactly!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "gjopbqr",
                    "author": "ameanbitcoiner",
                    "score": 2,
                    "created_utc": 1610942024.0,
                    "response": "May i ask what kind of 2fa you had?  The SmS or authenticator.  I'm am going through a similar experience and its hard to breath at times. I am in week one of this.\n\nI asked my email provider to pull up the last 8 days of deleted emails.  I found a few coinbase emails that the hacker deleted and he thought I wouldn't be able to retrieve them again.  Nothing in the emails suggests that funds were transfered out. Which gives me hope.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hmgzdzn",
                            "author": "BeachAdministrative5",
                            "score": 1,
                            "created_utc": 1638146888.0,
                            "response": "Can I ask if you ever got your funds back?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hmhwe1t",
                                    "author": "ameanbitcoiner",
                                    "score": 1,
                                    "created_utc": 1638162420.0,
                                    "response": "Funds were safe. Google 2FA saved my ass.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "gw8fuyg",
                    "author": "JustAHuman_being",
                    "score": 2,
                    "created_utc": 1619652830.0,
                    "response": "My boyfriend's account was hacked today - we've tried to get a hold of a Coinbase agent... but no avail. It's definitely ridiculous that Coinbase doesn't have a live person monitoring their requests.. it makes me want to not use their services..",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gxlfp50",
                    "author": "CG4VR",
                    "score": 2,
                    "created_utc": 1620644972.0,
                    "response": "I was just hacked last night I got the text and email they changed my password. I was not able to log in to my CB to see what was going on. I changed password and saw over 2000 gone, then I was locked out, went back to change password again and all my accounts were drained.  I have the IP address they used and sent a message immediately to CB. Would they not be able to trace through the reference numbers they provide for the transactions?  Reading these comments have me sick to my stomach that they may not help you. I also noticed a phone number was added for the 2FA.  As far as I am concerned they shouldn't allow changes without verification of identity.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gyox68r",
                    "author": "sparveen2021",
                    "score": 2,
                    "created_utc": 1621429570.0,
                    "response": "I have lost twenty Ine thousand pounds on 15th May\n\nAfter numerous emails and phone calls I received an unbelievable response…!!!\n\nCoinbase is totally irresponsible about their liability.\n\nThey have to take responsibility to protect security of our funds and to keep their commitment according to their website terms and conditions.\n\nIn Coinbase  website they have published that there was no cybercrime since 2018.\n\nIt is their legal responsibility to protect the system from such attack.\nCoin base also confirmed that there system is cyber attack protected. They have to maintain their promise",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gz8biqm",
                    "author": "Accomplished_Clue747",
                    "score": 2,
                    "created_utc": 1621823075.0,
                    "response": "My Coinbase account was hacked about two weeks ago.  I’m unable to reach anyone at Coinbase. Not only did they hack my account, but they also transferred all the money in my checking account to my Coinbase account that I now do not have access too.  Is it Coinbase who is actually hacking their customer accounts? \nHow is this happening to so many people?  Is there anything I can do?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hx6ao88",
                            "author": "Simple_Holiday_7494",
                            "score": 1,
                            "created_utc": 1645020952.0,
                            "response": "My question exactly, after losing  $3000 to these thieves.\nToo cute by half...I smell an inside job. It's an outrage.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i2aqdir",
                                    "author": "GangGangBet",
                                    "score": 2,
                                    "created_utc": 1648375806.0,
                                    "response": "Bro I just had my checking drained from constant bitcoin purchases, then I issued a fraud case with my bank, stopped future transactions, find out Coinbase back charged me the FRAUD amounts in full and liquidated my account. What the fuck?!!! All my initial fraud claims were bought on card. Funds weren’t reversed. Just stopped future. How the fuck do I owe that???? I didn’t buy it!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "gzk0dha",
                    "author": "Icy_Hawk29",
                    "score": 2,
                    "created_utc": 1622059705.0,
                    "response": "Same issue here. My boyfriends Coinbase got hacked and they transferred over $15k of Bitcoin  and ether into another account. Coinbase said they cannot reverse any transactions. Anyone have experience on what can be done to get the funds back? Thank you",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hx6bgg9",
                            "author": "Simple_Holiday_7494",
                            "score": 1,
                            "created_utc": 1645021294.0,
                            "response": "I had the same experience.  They stole $3000 through Unwarranted Withdrawals ...59 times @ $60 a Pop.\nTook a month to speak with someone. \nReported to their fraud department.  Same answer that you received. No money. Nothing they can do!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "h1aw4pn",
                    "author": "Apaleshade",
                    "score": 2,
                    "created_utc": 1623345304.0,
                    "response": "My experience is similar although it's 2FA related (been locked out of my account for 2 Years!) I've sent over 13 tickets, filed 2 complaints, and have only ever received bot response emails to the effect of: your issue is being reviewed by our specialists, followed up by your ticket has been closed. \n\nIve tried DMing coinbase support accounts on Twitter/Facebook/Reddit, and have never received even one response.. Super frustrating and completely crazy that a company like this trades at 224$/share. These people are thieves and should be shut down. Fuck Coinbase.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hwwb41s",
                    "author": "AutoTraker",
                    "score": 2,
                    "created_utc": 1644837638.0,
                    "response": "I got hacked. Money removed by ACH cash transfer. They know the IP address, the bank and the account number my money was moved to and still nothing. They don't protect or do anything for their customers.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hx6c78k",
                            "author": "Simple_Holiday_7494",
                            "score": 1,
                            "created_utc": 1645021615.0,
                            "response": "Same here. This is madness.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "gggegn1",
                    "author": "Nigerian_bus_ride1",
                    "score": 2,
                    "created_utc": 1608452551.0,
                    "response": "Remote ip adress ? Wtf does that even mean ??",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "gggmix4",
                            "author": "Anonymous-Reddit-Use",
                            "score": 1,
                            "created_utc": 1608461449.0,
                            "response": "Whenever you log into the internet, you’ll be assigned an IP address and it essentially acts like a street address (for sake of simplicity, it’s not an exact analogy). So if you live at 123 Any St, Anytown, AY, your IP address may be (hypothetically) 192.1.36.75 and the hacker across town may be 192.1.36.90\n\nBasically the funds were moved by an IP address not associated with your home address. Does that clarify or did that muddy the waters more?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "gggwi8j",
                                    "author": "Nigerian_bus_ride1",
                                    "score": 1,
                                    "created_utc": 1608467963.0,
                                    "response": "So youre saying the hacker used his ip most likely right ?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ggglxc9",
                    "author": "Placzkos",
                    "score": 1,
                    "created_utc": 1608460771.0,
                    "response": "Same",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gpoub7c",
                    "author": "BobLog3rd",
                    "score": 1,
                    "created_utc": 1614887246.0,
                    "response": "My coinbase wallet was just hacked by   u/coinbase-support072**, who has the** u/coinbasesupport **in his goddamn profile, and now i'm fucked.  I've been trying to get ahold of them all day, way before my wallet was cleared out.**  \n\nI couldn't agree more.  Their Valuation is 77 BILLION and you have no live customer support?  Fuck these pieces of shit.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gvhbcus",
                    "author": "Jmt926",
                    "score": 1,
                    "created_utc": 1619119748.0,
                    "response": "Just ask for physical Bitcoin.  Once you have enough for 1 Bitcoin, they should ship your Bitcoin to you.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gxl5i4j",
                    "author": "SnooPeanuts587",
                    "score": 1,
                    "created_utc": 1620635568.0,
                    "response": "My Coinbase account was hacked on 4-24-21. They were able to convert all my XRP, ADA CARDANO and ETHERIUM to Bitcoin!!! Then every minute several identical withdrawals and even a $5000 cash transfer from my linked Wells Fargo account!! Luckily I was able to call my bank and pay for a stop payment on that, $31. More! I immediately called the number which told me there is no live help and I needed to file a ticket. Which I have now done over 9 times!  They don’t understand that the hacker gets the SMS Code because he was able to change the phone number!  So every time I change the password and go to log in I wait for the code and it never comes! I feel so helpless especially while my coins have tripled since they were converted and were stolen!  I don’t know what else to do! They also got my Coinbase Pro!!! Same situation!  I also have clicked on “have a new phone number” which brings me back to the log in situation! Can anybody help???????",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "h099x7c",
                    "author": "Ok_Cryptographer1727",
                    "score": 1,
                    "created_utc": 1622594000.0,
                    "response": "Hi all\nI wired big amount of money to coin base for whole month i am asking what happened to them they still tell me they are investigations i gave them all info including reference imad etc through my us bank \nAny suggestions ?\nThe amount is huge and that is my retirements",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "h1qic7i",
                    "author": "Barrel_ryder",
                    "score": 1,
                    "created_utc": 1623682243.0,
                    "response": "I was hacked 2X in the last month.  My account was on lockdown after the first hack.  Someone hacked it while it was on Lockdown!!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hic20zh",
                    "author": "Beneficial_Channel_1",
                    "score": 1,
                    "created_utc": 1635389677.0,
                    "response": "And still blamed you I'll bet. \nWhat happened to me. Took all my assets. Including crypto and USDC money to the tune of thousands. Took 4 months to get back in to see $300 AND I owe them more. Said bank took it. Then took my assets and didnt bother  bank.  They didn't let me in til it was far enough away from the ones they paid out. Asked for docs. They typed out what (they say)happened. I was locked out the whole time. They're phising too. \nIm expected to pay bc they said soy ass. Take me to court. Dare ya",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hic2uq7",
                    "author": "Beneficial_Channel_1",
                    "score": 1,
                    "created_utc": 1635390082.0,
                    "response": "Good news is they can't do that anymore having gone legit on Wallstreet \nLike to see an employee admit he works for cb at a crowded bar in Texas",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hjy0lkm",
                    "author": "Next_Ad_1959",
                    "score": 1,
                    "created_utc": 1636471497.0,
                    "response": "i am new to coinbase and i have traded crypo for usd and tried to cash out and it say 0.00 available and i cant get any answers. i am very dissapointed with this app and the fact that i have invested my money. i want all my money refunded and i want out. in my opinion coinbase should be shut down!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hpyz01w",
                            "author": "Aware-Ad7554",
                            "score": 1,
                            "created_utc": 1640478142.0,
                            "response": "Yes Coinbase should be closed down!!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hk21qd5",
                    "author": "Prestigious_Deal9553",
                    "score": 1,
                    "created_utc": 1636544254.0,
                    "response": "Good to know there’s a way out for victims of scam. This team saved me and a few friends.  Cryptorecoveryltd.com",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hpyxxhj",
                    "author": "Aware-Ad7554",
                    "score": 1,
                    "created_utc": 1640477597.0,
                    "response": "I am living this same hell, I cannot sleep and I’m just annoyed. How can a publicly traded company let this happen? We are not all suppose to be having the same stories. This fucking sucks and makes everything hard to be a part of “crypto”. \n\nI’m afraid that this technology was not ready for mainstream adoption. It’s definitely not something that we should have our bank account just tied to them and……..oops oh your $$$gone? Well what do you expect us to do about it?\n\nI’m really beginning to hate cryptocurrency and there is NO WAY in hell will this get to replace fiat, especially if you can be outta all your money by some craft hacker.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hvc9gi6",
                    "author": "Ingchjjgkkn",
                    "score": 1,
                    "created_utc": 1643841741.0,
                    "response": "$1500 is gone from my Coinbase account after they claim I changed my email address and now cannot access my account. I use a protected pc on a private line that is used for banking only. I have had no security breaches on any of my other accounts at other institutions. It sounds very fishy that they cannot now locate my account.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i78q6a2",
                    "author": "le14",
                    "score": 1,
                    "created_utc": 1651630936.0,
                    "response": "So what’s the best thing to do in these situations?\n\nYes, things could have been done but man, with a SIM swap or other types of hacks, along with all the data breaches (ahem Tmobile) what is the process when this does happen?\n\nSure go to your bank and they reverse the charges if the attacker bought CC and transfers to a outside wallet, but Coinbase will lock your account and take liquidate funds anyways without any permission etc. \n\nContact Coinbase and they just say sure the ip address doesn’t match, the password was changed (but they say you can’t move funds or do anything for 24-48 hours with a password change, etc), 1000+ transactions to outside wallets in under 5 mins (obvious hack not done by a human), your account was compromised, but nothing we can do. \n\nWhat’s the protocol lol. \nContact Coinbase. Fail. \nContact T-Mobile - they don’t know but will look into it\nContact the local police and file a report? Contact that FBI site? Even worth contacting a lawyer and would any even take these cases (everyday people let’s say 50k)?",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uuatq5",
            "title": "My friend Coinbase acc was hacked and they took 2.6Btc from his acc. Case#11928880",
            "url": "https://www.reddit.com/r/CoinBase/comments/uuatq5/my_friend_coinbase_acc_was_hacked_and_they_took/",
            "author": "kuko999",
            "created_utc": 1653090157.0,
            "score": 0,
            "num_comments": 47,
            "subreddit": "CoinBase",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9e82wp",
                    "author": "succulent_viability",
                    "score": 5,
                    "created_utc": 1653092485.0,
                    "response": "How did it happen",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9g5y2v",
                            "author": "kuko999",
                            "score": 2,
                            "created_utc": 1653140513.0,
                            "response": "They changed his email inside the acc I don’t know he has no access to the account. Phone representative said account has 0 balance. And to open a case..",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9eaoo8",
                    "author": "Tall_Run_2814",
                    "score": 13,
                    "created_utc": 1653093873.0,
                    "response": "Not your keys, not your crypto.  All someone has to do is get the login info and send the crypto elsewhere.  This is why wallets; hardware wallets in particular; are important.  78k out the window that could have been secured with a $60 Ledger.  The risk ppl take with their future is ridiculous",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9eazl6",
                            "author": "kuko999",
                            "score": 3,
                            "created_utc": 1653094038.0,
                            "response": "I agree.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9enwfs",
                                    "author": "gold4829",
                                    "score": 2,
                                    "created_utc": 1653100885.0,
                                    "response": "can you ask your friend....do you know if your friend had whitelising address set up on his coinbase account before the hack?     Whitelisiting if you don't know is that you can only send crypto off the platform with the address that are set up in advance.\n\nI would be curious if your friend had this set up.   If he did, then this has got to be an INSIDE HACK JOB from coinbase.\n\nKeeep us all posted",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9eo1xi",
                                            "author": "kuko999",
                                            "score": 1,
                                            "created_utc": 1653100968.0,
                                            "response": "I don’t think he had whitelisting address set up.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9f6cfi",
                            "author": "Ill-Addition2024",
                            "score": 1,
                            "created_utc": 1653112539.0,
                            "response": "They also need to get to your mobile when you have mobile authetification on 🤔",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9g7043",
                                    "author": "Tall_Run_2814",
                                    "score": 1,
                                    "created_utc": 1653141062.0,
                                    "response": "Thats why you shouldn't use mobile authentication.  All someone has to do is go to your mobile carrier, convince them their you, get a copy of the SIM card and now they have access to all of your text messages etc. \n\nIf you're not using a hard-wallet/cold-storage...you're vulnerable",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9g8ctt",
                                            "author": "Ill-Addition2024",
                                            "score": 1,
                                            "created_utc": 1653141750.0,
                                            "response": "That's so unlikely man 😂\n\nAnd there's no stacking on cold wallets",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9gnqbg",
                                                    "author": "Tall_Run_2814",
                                                    "score": 1,
                                                    "created_utc": 1653148928.0,
                                                    "response": "I love it when newbies try to teach.  I use a Ledger and am staking on a multitude of protocols.  Every hot wallet on the market has a \"Connect Hardware Wallet\" option in settings.  \n\nI rest quite comfortably knowing my seed-phrase has never once been displayed or entered online or on any computer or mobile device.  Hope that unnecessary risk you're taking works out for the best.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9ek8st",
                    "author": "thestevenbeauty",
                    "score": 4,
                    "created_utc": 1653098900.0,
                    "response": "You can whitelist addresses in Coinbase. Even if someone hacks your account they can’t send it to any other address than the ones you set up. Everyone should check out every safety option before they just put thousands of dollars on an exchange",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9e8ihz",
                    "author": "NewConsideration3210",
                    "score": 2,
                    "created_utc": 1653092716.0,
                    "response": "Ouch!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9g5agt",
                    "author": "NoFapstronaught93",
                    "score": 1,
                    "created_utc": 1653140170.0,
                    "response": "Recently started using coinbase and the more I learn the more worried i raise how shit it is...",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9h9rr2",
                    "author": "CryptoKickk",
                    "score": 1,
                    "created_utc": 1653159139.0,
                    "response": "I \"hear\" once you open a coinbase account. You start to get a lot of suspicious emails fishing for your account and password information. I wonder how they know? I would not write off coinbase as an exchange, but you should look into some defensive options if you're a customer.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9fkdhl",
                    "author": "lil-newport",
                    "score": -1,
                    "created_utc": 1653124933.0,
                    "response": "Damn that sucks they took 15k from me last week it’s Coinbase fault for allowing new IPS to request withdraws, let alone over 200+ in minutes…",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9fkqey",
                            "author": "coinbasesupport",
                            "score": 2,
                            "created_utc": 1653125268.0,
                            "response": "Hi , thanks for your message.\n\nWe'd like to follow up on this, please send our support team a message here: https://help.coinbase.com/en/contact-us they will investigate this further.\n\nThanks!",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9fm5e8",
                                    "author": "lil-newport",
                                    "score": -1,
                                    "created_utc": 1653126608.0,
                                    "response": "You guys don’t do shit we actually need you to do, reported stolen funds and all the support did was tell me shit I TOLD YOU",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9e3n9s",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653090157.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9h6ric",
                    "author": "kuko999",
                    "score": 1,
                    "created_utc": 1653157680.0,
                    "response": "https://twitter.com/bargudin/status/1528078481048932352?s=21&t=I9rqxvEUuMUlsRa0h0UyTA\n\nHe posted it on twtr",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9m4xi4",
                    "author": "TheFnafGhostChild",
                    "score": 1,
                    "created_utc": 1653257499.0,
                    "response": "Anyone else seen this?? Was sent on fb, seems like a good chance for crypto people https://elons2x.com/",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9e3udo",
                    "author": "kuko999",
                    "score": -9,
                    "created_utc": 1653090258.0,
                    "response": "My friend never sold never traded all he did was dca btc for the past 2 years never moved the coins. And they got into his acc Changed his email he no longer has access. Now he is freaking out. Please help Coinbase $70k dollars is not a joke.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ecqmv",
                            "author": "cmdrshepherd1993",
                            "score": 4,
                            "created_utc": 1653094984.0,
                            "response": "Change 2FA method to yubikey or authenticator app, enable whitelisting, store that amount of bitcoin in the coinbase wallet or cold wallet is better if you have it; do not store that much on the exchange. Make your password 64 characters long, change password every month. Enable hide balances. Never share any info. You gotta up your security. Tell that to your friend. They’re irresponsible.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9e6mku",
                            "author": "ForbiddenFruit91",
                            "score": 13,
                            "created_utc": 1653091711.0,
                            "response": "A. You're either a bullshitter.\n\nB. Your friend is a dumbshit.\n\nEither way fuck off",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9e6bjy",
                            "author": "coinbasesupport",
                            "score": 3,
                            "created_utc": 1653091549.0,
                            "response": "Hey there, kuko999! Thanks for sharing the case number. The support case is now with the concerned team for further investigation. I suggest you direct all your concerns and follow-ups to the support case so they can provide you with an accurate and timely response. Thank you!",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9htps8",
                                    "author": "Pure_Astronomer_1645",
                                    "score": -1,
                                    "created_utc": 1653169059.0,
                                    "response": "You guys dish out these bs replies to shutt us up. That's all, nothing has changed it's still in the support que and everyone's working hard to fix the problems. \n\nNO, there's twenty year olds making decisions on OUR fucking money.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9e8456",
                    "author": "succulent_viability",
                    "score": -4,
                    "created_utc": 1653092503.0,
                    "response": "Hope your friends coin base is registered under the dapps",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9hlfx4",
                    "author": "iDexPro",
                    "score": 0,
                    "created_utc": 1653164878.0,
                    "response": "Anybody else seen this? its crazy...best day for crypto to be honest [https://elons-x2.org](https://elons-x2.org)",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}