{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "sicoom",
            "title": "The hard truth is SCAMS are everywhere (Beginners MUST READ)",
            "url": "https://www.reddit.com/r/CoinBase/comments/sicoom/the_hard_truth_is_scams_are_everywhere_beginners/",
            "author": "AlexPanno",
            "created_utc": 1643768167.0,
            "score": 10,
            "num_comments": 34,
            "subreddit": "CoinBase",
            "selftext": " I wanted to make a shortlist of things beginners can do to avoid scams, or at least limit the impact they may have when navigating this decentralized landscape.\n\n**Turn off your Discord DM's.**\n\nThese are literally the most common NFT scams out there. Let's point out some that exist.\n\n1. Hackers gain administrator access and post fake minting links in the announcement channel imposing as an actual organizer or founder. Usually targeting sold-out collections as there will be demand from those who missed out. Additional mint almost NEVER happens.\n2. When beginners ask for genuine help through general chat, they will receive multiple DM's with imposters acting as customer support. Project teams will NEVER message you first and will typically have a ticketing system built into their server.\n3. Imposter accounts sending you direct DM's promoting other collections, raffles you've apparently won, or early access to minting the NFT project of the server you are part of.\n\n**Don't give ANYONE your private key. Seriously, ever.**\n\nThis is an obvious one but for many people, the idea of being able to buy the mansion and the car allows all common sense to be thrown out of the window. It doesn't matter what the offer is, who is trying to help you, how much APY you could make...for the love of Christ, **DON'T EVER GIVE ANYONE YOUR PRIVATE KEY/SEED PHRASE. EVER.**\n\nYou will wake up with $0 left in your bank account after the scammers have drained every cent out of your account. I've seen it happen before to friends, it's a very sad sight to see. This applies to phishing through Discord, Twitter, Instagram, Telegram, basically any social platform that promotes the space.\n\nI would suggest beginners buy a cold wallet that stores your crypto & NFT's off-grid, it's the safest way to store your assets.\n\n**Beware the airdrops.**\n\nAirdrops can have malicious coding in them as well. Scammers will usually send the airdrop to random wallets with the name being the website where most will go to try and sell them. Easy money, right? Wrong. Everything is programmable and they will make them unsellable. Basically locking you into something that forces you to give them access to your funds. Your best bet here is to just ignore them. Simple.\n\nAlso be mindful that dodgy projects airdrop their shitcoins or NFT projects to influencers or celebrities, giving them the ability to claim \"said person of interest\" is a holder. This happens fairly often, so the simple rule is to just ignore any social news of this on project websites or articles.\n\n**Rugs are great in a house, but not in Web 3.0.**\n\nFake, or half-baked collections, have become a huge issue. OpenSea has just advised that almost 80% of projects on their platform are either fakes, scams, rip-off collections, or something in that lane. Rug pulls are and always have been prominent in the crypto/NFT space.\n\nWhat is a rug pull for beginners in a space? It's when a person or group of people release an initial project or currency with the promise of rolling our additional perks and utility that will unfold over time. They would then run off with the money well before any of those \"promises\" can take place.\n\nIn crypto, it's common to see influencers promoting a project or token (knowing it's worthless), one in which they hold assets. When their audience starts to buy it, they sell into that spike in NFT or token price, essentially leaving the new holders high and dry with an asset that is now worthless. The influencer walks away with millions, while the new holders are left with nothing. Be careful!\n\nIf you have fallen for a scam, don't be hard on yourself. Visit [revoke.cash](https://revoke.cash/), a tool that checks which websites have permissions to engage with a wallet and lets you revoke permissions. This doesn't reimburse you, but it may help in this happening again or provide a slight chance to stop the hacker before he has a chance to set his plan in motion.\n\n**Question everything, and EVERYONE.**\n\nThe biggest thing is to look for fully doxxed teams that are made up of reputable figures who have openly identified themselves. This is one of the most sound ways to know if the project leads are serious or if they will hide in the shadows waiting to rug you.\n\nThings to ask before jumping in would be:\n\n1. What is their reputation in the space?\n2. Has the project been audited by a reputable auditor? (Certik is usually the best)\n3. Have they worked on successful drops in the past? (What's their track record)\n4. Who is the artist?\n5. Does the art translate well?\n6. How active are the community and what type of discussion are being had?\n\nYou'll find A LOT of celebrities get paid to endorse or promote bad projects. One great example was Jake Paul, who promoted a pump and dump. Even if the celebrity promotes it like they're personally involved in the project. Be extremely cautious.\n\n**Lastly, be prepared to lose everything.**\n\nThis one is super simple in my opinion, but many refuse to acknowledge this simple guideline.\n\nOnly invest what you can afford to lose. If you can comfortably have that money sitting in an asset for 12 months or longer, knowing that all your expenses and lifestyle won't suffer then it's probably a safe amount. This goes for everyone.\n\nThat feeling you get in your stomach when your crypto crashes or NFT projects fail to provide any return, that's the feeling of someone who invested more than they could afford to lose. Don't be that person.\n\nThe other great rule is to NEVER invest in anything that you don't truly understand. That's literally gambling. There is a difference between Poker and roulette. One requires some strategy and understanding, the other is left to the gods themselves. Get the knowledge and understand first, the rest will come in time.\n\n\\-------------------------------------------------\n\nI hope this helps all the beginners out there who are thinking of getting into this space. There is a huge amount of opportunity, but also a huge amount of bad projects. The research will always be your best friend and question. literally. everything. For more education, check out [r/WhatTheNFT](https://www.reddit.com/r/WhatTheNFT/)",
            "stickied": false,
            "comments": [
                {
                    "id": "hv7yiz5",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1643768167.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hvb1xae",
                    "author": "BWallis17",
                    "score": 1,
                    "created_utc": 1643825574.0,
                    "response": "I'd also add never use SMS 2FA.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hv8hiqp",
                    "author": "Suspended_9996",
                    "score": 0,
                    "created_utc": 1643776480.0,
                    "response": "i saw a bitcoin/shitcoin  ATM >   is  BUY ONLY >  NO SELL!?  NO camera,  NO Transaction Records!?\n\nthere is also  BIG  RED SIGN  on the machine:\n\nYOU ARE A VICTIM OF  A FRAUD",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}