{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "pgms81",
            "title": "Change Coinbase Wallet Username?",
            "url": "https://www.reddit.com/r/CoinBase/comments/pgms81/change_coinbase_wallet_username/",
            "author": "GoodN0se",
            "created_utc": 1630604490.0,
            "score": 20,
            "num_comments": 9,
            "subreddit": "CoinBase",
            "selftext": "Can one change the @username assigned to a CB wallet after initial set-up? Thank you.",
            "stickied": false,
            "comments": [
                {
                    "id": "hk7jesn",
                    "author": "cheselnut",
                    "score": 3,
                    "created_utc": 1636643072.0,
                    "response": "Did you ever figure it out? Trying to do the same",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ho8mvvq",
                    "author": "ZenerSparks",
                    "score": 3,
                    "created_utc": 1639312346.0,
                    "response": "I contacted Coinbase Support regarding the same thing, and I got this in response:\n\n\"Hi, thanks for reaching out to us. A username can only be used once, even if the Wallet is deleted. This is for security reasons, as each username created is tied to its own unique 12-word recovery phrase.\nUnfortunately, the username cannot be edited. We recommend you open a new Wallet with your desired credentials.\nPlease note: Coinbase Wallet and Standalone Wallet Extension are user-controlled, non-custodial products – the recovery phrase is what gives you, and only you, complete access. For your security, Coinbase will never have access to this seed, which means we cannot access your Wallet under any circumstances.\"",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hbcbktu",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1630604491.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}