{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ur04v8",
            "title": "Get of off CEX!!!!!!!!!!",
            "url": "https://www.reddit.com/r/CoinBase/comments/ur04v8/get_of_off_cex/",
            "author": "Complex_Bus_6076",
            "created_utc": 1652719154.0,
            "score": 2,
            "num_comments": 21,
            "subreddit": "CoinBase",
            "selftext": "Coinbase wallet just like all other centralized wallets are going to have too much control over your wallet. If you got into crypto for the decentralization like many of us did, it’s in your best interest to open a DEX wallet like the Loopring L2 wallet (what I personally use)",
            "stickied": false,
            "comments": [
                {
                    "id": "i8u7y3d",
                    "author": "techma2019",
                    "score": 6,
                    "created_utc": 1652719782.0,
                    "response": "Not everyone wants the responsibility of maintaining their money in their personal computer. It will take a lot of years for the majority of people to be comfortable with this.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8u8gby",
                            "author": "zionmatrixx",
                            "score": 5,
                            "created_utc": 1652719982.0,
                            "response": "Majority of people can't even manage their money with a bank. No way in hell they would ever want the stress and headache of managing their own money like cryto allows, especially anyone over the age of 40.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8u8zlg",
                                    "author": "Complex_Bus_6076",
                                    "score": -2,
                                    "created_utc": 1652720194.0,
                                    "response": "All u need to do is open the wallet and hold it! No crypto management needed. I’ve had a DEX wallet for 6 months and I’ve never touched it after initial setup and guardian additions!",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8ujqj1",
                                            "author": "techma2019",
                                            "score": 7,
                                            "created_utc": 1652724442.0,
                                            "response": "I think you're confused. Do you not think of when your parents \"got a virus\" (aka popup ads) and think they had to buy a whole new computer? Or worse, did wipe their whole computer to start fresh? Those people will not have the foresight to backup any keys or wallets. They barely know how to move the photos from their picnic they took last week.\n\nOr worse still, they get a real virus/malware and the funds that are \"just being held\" in the little program wallet are siphoned out without them even knowing it.\n\nMajority of people are not going to get unplugged from the old system. The only way forward is for the banks to add the crypto wallets so you can hold your dollars alongside your Bitcoin with your bank. That is what global adoption will look like. People like you and I will have our own bank, on our own terms, but the vast majority will not want to do this.\n\nEdit: Unfortunately, now I see this is some shilling for LOOPRING. lmao. Oh well. Buy Bitcoin.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8ukakd",
                                                    "author": "Complex_Bus_6076",
                                                    "score": 1,
                                                    "created_utc": 1652724664.0,
                                                    "response": "But to say that CEX is the superior way to hold your crypto compared to DEX is vastly foolish IMO",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i8uk5uw",
                                                    "author": "Complex_Bus_6076",
                                                    "score": 1,
                                                    "created_utc": 1652724612.0,
                                                    "response": "Can’t argue with that, unfortunately for most people the need / want for security doesn’t come until it’s too late. That being said, just because it is harder for someone to learn something doesn’t mean they can’t learn it. Adaption makes people safer, education makes people smarter",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8u8k7b",
                            "author": "Complex_Bus_6076",
                            "score": -3,
                            "created_utc": 1652720024.0,
                            "response": "Truuuuue, the wallet I currently use (loopring) has an unbelievable mobile interface with the options to add guardians as well. Really easy for anyone to use! (Ofc you can use it on your web browser as well)",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8ufc8t",
                    "author": "KPrime12",
                    "score": 6,
                    "created_utc": 1652722721.0,
                    "response": "Ledger makes a good hard wallet",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8ugrxf",
                            "author": "Complex_Bus_6076",
                            "score": 1,
                            "created_utc": 1652723287.0,
                            "response": "Hard wallets are amazing too, once I get all the assists I want I will definitely do further research into hard wallets no doubt",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8u83cw",
                    "author": "pcm2a",
                    "score": 4,
                    "created_utc": 1652719840.0,
                    "response": "Get off of PRIVATE WALLETS!!!!!!!!!!\n\nYour keys, you're hacked, your problem.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8v1hsh",
                            "author": "Tall_Run_2814",
                            "score": 1,
                            "created_utc": 1652731665.0,
                            "response": "If you’re exchange account is hacked it’s your problem.  Just get a hardware wallet and hide your seed.  Un-hackable",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8u8cgi",
                            "author": "Complex_Bus_6076",
                            "score": -3,
                            "created_utc": 1652719940.0,
                            "response": "That’s a very valid point, I suggest you check out the Loopring L2 wallet with multiple guardians added ontop, maximum security is on L2 🤫🤫",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8unr5c",
                    "author": "RadiantTangent",
                    "score": 3,
                    "created_utc": 1652726053.0,
                    "response": "Regardless whether it's a Coinbase wallet or something like MEW, don't they all work pretty much the same ? Is it the difference between a hot and cold wallet you're whigging out about?\n\nCorrect me if I'm wrong, but I have the seed phrases to it. As long as I have those there shouldn't be any chance of losing funds right? I mean, without losing the phrases of course.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8uq54k",
                            "author": "Complex_Bus_6076",
                            "score": 1,
                            "created_utc": 1652727019.0,
                            "response": "Most DEX will provide you much more: security, privacy, and imo the best part: lower gas fees. That being said you can take it a step farther and open up a layer 2 DEX wallet and give yourself the fastest transaction times, the most security possible, and the cheapest gas fees while on an easily scaleable network. Loopring L2 wallet to integrate zkrollups soon to make transactions even faster and more secure. Long story short - you run a much greater risk of getting hacked and or losing money to ETH gas fees by using CEX",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8u88jp",
                    "author": "zionmatrixx",
                    "score": 1,
                    "created_utc": 1652719896.0,
                    "response": "\"Get of off CEX\"\n\nUhhhh what?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8u8op2",
                            "author": "Complex_Bus_6076",
                            "score": 1,
                            "created_utc": 1652720073.0,
                            "response": "“CEX” = Centralized exchange \n“DEX” = Decentralized exchange",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8u6c5s",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1652719154.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8v325w",
                    "author": "Kiwip0rn",
                    "score": 1,
                    "created_utc": 1652732307.0,
                    "response": "No, Hot Wallets are not better than CEX. Invest you, yourself, can afford hundreds of thousands to millions per year in Cyber Security and Insurance to protect your phone/computer, a Hot Wallet is not \"better\".\n\nIf you lose your Hot Wallet, phrase/password it is lost forever. If you lose your password (and/or HODL Mode code, Authentication Seed, etc.) for a CEX you can get access back with your KYC info.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}