{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "usbrec",
            "title": "Do not use this dumpster fire of a service",
            "url": "https://www.reddit.com/r/CoinBase/comments/usbrec/do_not_use_this_dumpster_fire_of_a_service/",
            "author": "Key_Advisor_78",
            "created_utc": 1652876955.0,
            "score": 4,
            "num_comments": 28,
            "subreddit": "CoinBase",
            "selftext": "I would warn anyone against using coinbase. Twice now I have had my account arbitrarily locked. This time for deciding to use the coinbase app. \n\nDespite having used the same account 15 days ago suddenly if I try to buy I need to submit id verification.\n\nOn a 3+ year old account.\n\nJust contact support: the wonderful app that somehow locked my account also makes it impossible to submit a support form, the app loads a Web page within the app to fill out the form, which then requires email verification... which means that you have to switch apps to your email service... which means when you open the coinbase app again the Web page to fill the form is reloaded and a new code is sent. As far as I can see this makes submitting a support claim impossible through the app. \nThat's without mentioning that the \"live calls\" direct to an automated bot that seems to reject calls half the time and just directs you to the web forms?? And the Web messaging is again a completely unhelpful bot that directs to the Web forms, which again are impossible to fill out thanks to the genius of coinbase developers.\n\nDo not support these absolute trash developers who are more focused on adding pointless features related to nft while completely ignoring the basics of customer support.\n\nEdit: to be completely transparent after the awful (lack of) direct support through the app I decided to just try and get my id verified and surprisingly it worked very quickly and the account is unlocked, but I still would not recommend coinbase, as mentioned before I had a similar issue previously that took much longer to resolve and plenty of other people seem to have similar experiences, so a lot of the support seems fairly arbitrary. With the number of hoops I have to jump through every time I login I expect a more consistent experience when it comes to account suspension.",
            "stickied": false,
            "comments": [
                {
                    "id": "i931642",
                    "author": "cmdrshepherd1993",
                    "score": 12,
                    "created_utc": 1652887760.0,
                    "response": "Lmao you’re lazy. Just verify ID & bam, problem fixed. You have to do that with any exchange. Gtfo",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i93bc5q",
                    "author": "Connect-Ad-1088",
                    "score": 2,
                    "created_utc": 1652891907.0,
                    "response": "i have never had a problem with cb in the two years i have been using cb, i have other accts at other exchanges too.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i92jpkn",
                    "author": "Dazedhazed",
                    "score": 2,
                    "created_utc": 1652880121.0,
                    "response": "Yeah I just got my notice of account closure, apparently I “engaged in prohibited use in violation of our Terms of Service, I literally only made buys and sells, Ironically though I get this a few hours after filing my 6th complaint because Im yet to receive an incentive and boom Im now someone who engages in prohibited use 🤷🏻",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i92e1q0",
                    "author": "coinbasesupport",
                    "score": 1,
                    "created_utc": 1652877229.0,
                    "response": "Hi u/Key_Advisor_78, thanks for letting us know about this support experience. \n\nCould you try opening a case via a web browser using this link: https://help.coinbase.com/en/contact-us. Once you receive a support case number, we'll be sure to look into this for you. Many thanks.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i92eqx6",
                            "author": "Key_Advisor_78",
                            "score": 0,
                            "created_utc": 1652877612.0,
                            "response": "With all due respect I am not wasting any more of my time fighting with a service that clearly cannot even be bothered to do the basics and lies on its support page.\n\nLast time this happened the only reason it seemed to be solved was a post on this subreddit, I can excuse it once but as far as I'm concerned coinbase is not worth the effort and this post is solely to give others a clear review of the service and I will be looking at other sites.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i92djvn",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1652876955.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i949dnz",
                    "author": "Ill_Investigator4307",
                    "score": 1,
                    "created_utc": 1652905687.0,
                    "response": "Fuck coinbase but only if you have protection.  She is a nasty bitch and will give you VD",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i94xoqa",
                    "author": "RubyFriday666",
                    "score": 1,
                    "created_utc": 1652916267.0,
                    "response": "\"You should only trust verified Coinbase staff.\" HAHAHAHHAHAHAH! They're the LAST ones you should trust. I'm convinced the whole of Coinbase is like two people who just have a bunch of generic answers that don't really address any problem or answer any question ready to send like the turbo button on old school NES controllers. Just giving people the run around until they make off with everyone's money",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9cjxi9",
                    "author": "SuuGmm",
                    "score": 1,
                    "created_utc": 1653064749.0,
                    "response": "Just seen this event for btc/eth online dont miss out  [https://elonsx2.org](https://elonsx2.org),  sharing hope it helps.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9eyto0",
                    "author": "kiu68799",
                    "score": 1,
                    "created_utc": 1653107194.0,
                    "response": "🐲Lil Dragon $LDG NFT Metaverse for human resources Evolved to create hyperlinks between Cryptocurrencies, NFT ecosystem and Metaverse.\n\nPresale live now on Pinksale: https://www.pinksale.finance/#/launchpad/0x058d5489433b49bDb86E7A6f195b5EA12d6A82d8?chain=BSC\n\n✅Audit by TechRate\n✅Metaverse beta version\n✅Listed in CMC\n\n📌We will launch on Pancakeswap after Presale.\n\nFollow our official social media for more info:\nWebsite: https://lildragon.io/\nTelegram: https://t.me/LilDragonOfficial",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i92o9i2",
                    "author": "anon977577",
                    "score": -7,
                    "created_utc": 1652882259.0,
                    "response": "Dog Piling on OP's paragraph and sewing in some education about the instruments you are trading on Coinbase and why they are degenerate: When Coinbase puts a \"W\" before a thinly traded altcoin, for example the W in LUNA for WLUNA or WCFG and 15 others coinbase has hosted.  That W means an additional \"IOU, trust me bro\" layer in between you and the chain. Now your labor is twice removed from you through two entities coinbase, and the software structure and individuals/methods of collateral that the initial founders used to convince the first men, that this coin is a hair above buying quantities of thin-air, as a milkshake that lures all the boys to the yard.\n\nThis video explains collateral in crypto issuance, and incentive alignment in the founding and issuance of the first blocks of trillions of #YourCoin at near zero price to the #FirstMen.  You must be able to describe to yourself and others the conditions and the nature and location of individuals who issued themselves huge quantities of thin-air, and fenced them off into digital units, using cryptography of transactions and blockchain.\n\n[https://www.youtube.com/watch?v=y\\_otSD3LYCA](https://www.youtube.com/watch?v=y_otSD3LYCA)\n\nCoinbase is not doing their research in their adoption of thinly traded altcoins.  They warn you somewhat by putting in extra popups that say: \"This is experimental you may lose 100% of your investment in a hot second\".  But somehow that doesn't feel like it's saying enough.\n\nYou're all paying cold hard cash for what amounts to fenced off thin air.  This idea done on wallstreet is what put Bernie Madoff in Jail, and yet, the Coinbase directors and above are not being plucked out of their houses having done the exact same thing Bernie Madoff did.\n\nTwo ideas offer Coinbase Execs and owners protection from govt correction/punishment.  1. They admit what we're doing are Ponzie schemes, it's in the whitepapers and you can read it in the C++ code. and 2. The government hates all Cryptocurrencies, since it muscles in on their Fiat currency, which happens to also be a ponzie scheme, the only difference is the founders did their issuance in 1971 with Nixon, and are currently all living in the middle east or in America/Europe with dual citizenships and seats on the thrones, or have the ears of the 80 members of shadow government.\n\nRocky roads ahead, will Coinbase evolve and thrive and root out the more brittle of the ponzies?  Or get its back broken by the powers that be when all of their instruments turn out to be all Ponzi?  Turn the page.\n\nAlso coinbase keeping your wallet password server side means the government is the last person in the chain depositing and withdrawing real labor, that regains government ability to \"debase any cryptocoin\" and create more of them at the drop of hat, and just say: \"Trust me bro, let me issue myself more cryptocurrency in the same name of coins you already bought and sell it to others for real cash, I'm good for it\".  Which is a show stopper the more you think about it. \n\nCongress talking about whether or not we tolerate the existence of these organizations, in the same way we tolerate people from the middle east controlling America's money supply.  Who designed this system?  It's not better than Fiat money except it's different founders.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i92y6e4",
                            "author": "vimmz",
                            "score": 7,
                            "created_utc": 1652886534.0,
                            "response": "Coinbase does not add a W to anything, that’s an on-chain practice that has been around a long time and stands for “wrapped”. They simply add coins that are on chain, it’s on you, the user to recognize what you’re buying. In most cases those are directly backed by the asset on-chain and there is effectively no risk to holding it vs the underlying asset. \n\nLong ago they gave up on trying to curate which assets are good or not and they will add basically anything that’s not an obvious scam. Why? Because that’s what their main competitors have done longer and they want market share from them. People were absolutely pissed Coinbase didn’t have dogecoin for the longest time, even though it’s literally a joke asset. They have to add just about everything to stay competitive.\n\nI don’t even get what you’re talking about in the last few paragraphs, conspiracy theory and FUD mumbo jumbo.\n- Yes Coinbase stores the private keys, yes that means they can take it away, and yes you can also move your own funds off if you’re worried about it. - No, governments cannot just “create” coins out of thin air, that’s one of the main value propositions of crypto currencies, that it’s not possible to do that due to the decentralization \n- Yes, congress will talk about new technologies that significantly affects the world and their citizens, especially when much of it is obviously like a security and they are not regulated as such yet, and many people are getting scammed as well",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i934e6m",
                    "author": "Accomplished-Way7608",
                    "score": -4,
                    "created_utc": 1652889082.0,
                    "response": "How much $$$ did they steal from you?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i96645o",
                            "author": "jhanon76",
                            "score": 1,
                            "created_utc": 1652939707.0,
                            "response": "Probably his life savings",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i93b2if",
                    "author": "greendevil77",
                    "score": -1,
                    "created_utc": 1652891799.0,
                    "response": "Yah their support is trash. I feel you on the arbitrary account locking. They locked my account last month without even notifying me, and after slogging through their automated system to talk to a real person all they would tell me was that they weren't allowed to tell anything and call back a month later.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}