{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "utdmjw",
            "title": "Does the Coinbase team have a plan or date set up for when we can withdraw our ETH stake?",
            "url": "https://www.reddit.com/r/CoinBase/comments/utdmjw/does_the_coinbase_team_have_a_plan_or_date_set_up/",
            "author": "bcool35",
            "created_utc": 1652995954.0,
            "score": 4,
            "num_comments": 64,
            "subreddit": "CoinBase",
            "selftext": "I have a few hardships this year and unfortunately was invested quite a bit in Terra, also. It seems like nobody knows when ETH 2 is going to happen. It could be several years. I made a rash decision by staking so much with Coinbase and now I could really use that extra cash.",
            "stickied": false,
            "comments": [
                {
                    "id": "i993zrm",
                    "author": "alwayssaysyourmum",
                    "score": 3,
                    "created_utc": 1652996284.0,
                    "response": "As far as I know it’s literally just a ‘when it happens’. Only staked about £80 (at the time - it’s about £45 now) as I didn’t like the open ended ‘you can’t take it out until we say so’ nature of it, but as there were so many warnings about that I don’t think there’ll be much accurate guesswork possible - it’ll just be when it is.   \n\nSorry if that’s a vastly less positive answer than you were hoping for - someone who knows more than me is free to shoot this to pieces. Good luck!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9950va",
                            "author": "coinbasesupport",
                            "score": 3,
                            "created_utc": 1652996750.0,
                            "response": "Appreciate the assist! For any questions on ETH 2 or ETH staking, we have great details here: https://help.coinbase.com/en/coinbase/trading-and-funding/staking-rewards/eth-2-0-staking\n\nDo know, when the ETH2 upgrade is complete and withdrawals are enabled by the Ethereum network, you’ll be able to send or sell your staked ETH. This would include any rewards you have earned as well.\n\nFor now, you won't be able to trade, send, or sell the amount you have staked. \n\nHope this helps clarify, but do let us know if you need anything else!",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i994zff",
                            "author": "bcool35",
                            "score": 1,
                            "created_utc": 1652996732.0,
                            "response": "Thanks, yeah that’s what i figured :/. I haven’t did much research, but they say on the website that they’re maybe planning on letting us withdraw at some point, but don’t give any specifics or timeframe",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i997x13",
                            "author": "bcool35",
                            "score": 1,
                            "created_utc": 1652998071.0,
                            "response": "Yup, talking to a customer service rep right now on the website. She said \n“As I can check, for now you won't be able to trade, send, or sell the amount you have staked. When the ETH2 upgrade is complete and withdrawals are enabled by the Ethereum network, you’ll be able to send or sell your staked ETH along with all of the rewards you’ve earned.” Sucks",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i993aby",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1652995960.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9957fs",
                    "author": "Trololoumadbro",
                    "score": 1,
                    "created_utc": 1652996834.0,
                    "response": "https://reddit.com/r/CoinBase/comments/uq6wy8/_/i8pannj/?context=1",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}