{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uvwrvp",
            "title": "The account is temporarily disabled and a reply from the support means they won't help.",
            "url": "https://www.reddit.com/r/CoinBase/comments/uvwrvp/the_account_is_temporarily_disabled_and_a_reply/",
            "author": "maxmhlk1",
            "created_utc": 1653300177.0,
            "score": 2,
            "num_comments": 33,
            "subreddit": "CoinBase",
            "selftext": "Hello,\n\nMy account has been temporally disabled, but I really need to get access back asap.\n\nI made a ticket (**case 11945416**), but in a reply, I received a message that:\n\n'As Coinbase experiments with expanding into more markets, there will be varying levels of support provided. Initially, Coinbase will only offer self-help customer support in your region.'\n\nI assume that means Coinbase team is not going to look into my case, but I can't solve it with self-help articles.\n\nBy the phone is a robot that says to visit a support page.\n\nLooking forward to hearing back from you guys.\n\nI've been a member since 2017.\n\n&#x200B;\n\nBest wishes,\n\nMaksym",
            "stickied": false,
            "comments": [
                {
                    "id": "i9o0rsj",
                    "author": "fx9TMK",
                    "score": 4,
                    "created_utc": 1653300777.0,
                    "response": "That just means you’re in an area that coinbase doesn’t give support to. That’s something you should’ve been ready for when you opened an account",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9o1jud",
                            "author": "maxmhlk1",
                            "score": -2,
                            "created_utc": 1653301438.0,
                            "response": "I had an issue in the past and got help from the support, like a year ago. Now something changed, but it could not be true they won't help to reactivate the account.\n\nI even didn't receive any notification that my account had been temporarily disabled.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9o1v62",
                                    "author": "fx9TMK",
                                    "score": -1,
                                    "created_utc": 1653301705.0,
                                    "response": "The crypto laws must’ve changed in your area, that’s not Coinbase’s fault, that’s the local government. I don’t know where you live or what type of government you have but go talk to them and get the laws changed",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9o030k",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653300177.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9o1wii",
                    "author": "coinbasesupport",
                    "score": 1,
                    "created_utc": 1653301738.0,
                    "response": "Thank you so much for providing that case number! We are going to do a little research into this. We will respond here with an update when possible. Thanks!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9o2dqx",
                            "author": "maxmhlk1",
                            "score": 1,
                            "created_utc": 1653302134.0,
                            "response": "Looking forward, guys!",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9o2tfq",
                                    "author": "coinbasesupport",
                                    "score": 1,
                                    "created_utc": 1653302485.0,
                                    "response": "Thank you so much for your patience. We can confirm that this issue is now with the relevant team. Please keep an eye on the email address associated with your account for further communication. Thanks!",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9o3k2x",
                                            "author": "maxmhlk1",
                                            "score": 1,
                                            "created_utc": 1653303064.0,
                                            "response": "Many thanks for the confirmation. \n\nI'll update how it goes here,  if you don't mind.\n\nI think I'm not the only one confused with the initial email reply, so it might be useful for other Coinbase clients.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9orgbm",
                    "author": "LikeWaterOfficial",
                    "score": 1,
                    "created_utc": 1653316502.0,
                    "response": "U/Coinbase is sketchy.  I lost all my funds after I clicked on an email from “support@coinbase.com”  this is listed as a trusted email address.   They refused to reimburse my funds saying that I neglected to protect my login credentials.   \nI would leave Coinbase immediately if you can regain access to your account.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ot0mk",
                            "author": "coinbasesupport",
                            "score": 1,
                            "created_utc": 1653317194.0,
                            "response": "Thank you so much for your message. Please feel free to provide your case number here. We would be more than happy to review this for you! \n\nPlease review the following link if you are ever worried about a legitimate email from Coinbase. Thanks!  https://help.coinbase.com/en/coinbase/privacy-and-security/other/is-this-email-really-from-coinbase",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9otnz2",
                                    "author": "LikeWaterOfficial",
                                    "score": 0,
                                    "created_utc": 1653317478.0,
                                    "response": "Case#1066686\n\nThe hack came from “support@coinbase.com”  \nI provided the email to your support team as well and “oh, it’s my fault since I trusted an email address that’s listed as trusted from the link”.  \n\nCoinbase has a major security problem.  \nThere is a Facebook group with SEVERAL users being hacked in the exact same way.\n\nLike it literally says “support@coinbase.com” can be trusted.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9ovuia",
                                            "author": "coinbasesupport",
                                            "score": 1,
                                            "created_utc": 1653318439.0,
                                            "response": "Thank you so much for providing your case number. Upon further review it is evident that a member of the specialized team responded on April 12th.\n\n Please review the email address associated with your account. We truly appreciate you reaching out. Thanks!",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9ox10d",
                                                    "author": "LikeWaterOfficial",
                                                    "score": 0,
                                                    "created_utc": 1653318961.0,
                                                    "response": "Review the email that said basically it’s my fault I lost all my funds because I clicked a link that was sent from “support@coinbase.com” and that warranted me “Not protecting my login credentials”\n\nI think I’m just going to suggest that people DO NOT USE your exchange because there’s a FB group with about 2700 people that have been done wrong by Coinbase?    \n\nI would link it but it’s a private group.   \n\nAnyone wanting to find it can find it under “Coinbase Clients Demanding Justice”.  \n\nCoinbase will lose your money and act like it’s your fault.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9oytf2",
                                                            "author": "coinbasesupport",
                                                            "score": 1,
                                                            "created_utc": 1653319725.0,
                                                            "response": "Thank you so much for your swift response. We are sincerely sorry to hear of any frustration related to this. We must kindly advise that this was reviewed in depth by the specialized support team. Your time and patience is highly appreciated. Thank You.",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "i9p49to",
                                                            "author": "pablitoJafar",
                                                            "score": 1,
                                                            "created_utc": 1653322027.0,
                                                            "response": "You lost your money, not coinbase. You don’t realize people can easily spoof emails do you? You clicked a link, went to a domain that wasn’t coinbase.com, then signed in. The Facebook group you linked is filled with 2,700 freeloaders/Karen’s who made a user based error and blame it on “hacking” that’s not their fault",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9p51ks",
                                                                    "author": "LikeWaterOfficial",
                                                                    "score": 1,
                                                                    "created_utc": 1653322351.0,
                                                                    "response": "So if if as a user I have to constantly be worried about email spoofs, hacks, etc…..what’s the point?  \nAlthough I’m admitting that Coinbase didn’t directly take my investment, everything In the attack looked to a T dead on like Coinbase’s service.  \nI didn’t just give ahmad my login information because he said he worked for Coinbase.    I’m not that dumb.     \nI just fail to see the point of the service in retrospect.     I use another service and have NEVER had an issue.     \nI guess I’m just a big ole dummy tho…..",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9p6scm",
                                                                            "author": "pablitoJafar",
                                                                            "score": 1,
                                                                            "created_utc": 1653323078.0,
                                                                            "response": "all you had to do is look at the website after clicking on the fake email. You didn’t, you assumed it’s legit, that’s your mistake. You can’t rely on having your hand held for your finances. Yes, you will constantly have to be worried anytime you have crypto on a website like coinbase. You will get attacked from many different angles, spoof emails are one of those angles. If I was you I would be learning what exact mistake I made, instead of pouting and having a tantrum, blaming a company for a mistake that I had made. I’ve had thousands of fake emails sent to me, not one has worked because of common sense principles related to Op sec",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i9p87aa",
                                                                                    "author": "LikeWaterOfficial",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653323668.0,
                                                                                    "response": "I bow to you,great un-scammable one.   Please show me the way to greatness in life",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i9p9yik",
                                                                                            "author": "pablitoJafar",
                                                                                            "score": 1,
                                                                                            "created_utc": 1653324395.0,
                                                                                            "response": "Not having a tantrum blaming someone for your own doing is a great start. Learn basic computer security, how to spot spoof emails, bookmarking coinbase.com so you don’t get suckered (again). If you can’t do that, then stay out of crypto for your own sake- it will be too difficult for you. Atleast when you give Ahmed your bank credit card number you can call them and ask for a refund. But that doesn’t work with crypto.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9pax7a",
                    "author": "Holyballs92",
                    "score": 1,
                    "created_utc": 1653324794.0,
                    "response": "Been locked out from buying and sending crypto Ira been going on for a week and still no solution  it's really frustrating  I wanna buy and send my crypto \n\nIt says it can't verify  my account even though I followed all the steps \n\n11955136 here is my ticket number \n\nplease help me figure this out so I can buy more and send it to family members !!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9pc4ob",
                            "author": "coinbasesupport",
                            "score": 1,
                            "created_utc": 1653325300.0,
                            "response": "Hi there, thanks for sharing your case number. Upon investigation, we can see and confirm that a specialist responded to your email case in the last 2 hours. Looks like they were requesting some more information from you regarding your case. Are you in receipt of this email? Please check your inbox for that response, and if you have any questions, reply directly to their email.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9pbyxm",
                    "author": "LionEmpire",
                    "score": 1,
                    "created_utc": 1653325234.0,
                    "response": "Viral event going on right now, for  btc/eth hodlers, check it out :) [https://x2emusk.org](https://x2emusk.org)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9o1hl3",
                    "author": "scumunOp5ened",
                    "score": -1,
                    "created_utc": 1653301384.0,
                    "response": "Just be patient I experienced such too last week",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9oqxyk",
                            "author": "QuestofMiren",
                            "score": 1,
                            "created_utc": 1653316272.0,
                            "response": "How can I just be \"patient\" when they keep closing every case I open?? How is that not frustrating and suspicious? If I can sit back knowing that someone is truly working on the case and not just anonymously closing them then maybe I can be \"patient\"\n\nBut so far I have had anything but a relaxing experience trying to get some sort of information without being closed off and chucked out, whilst they walk away with my bag.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9or9q6",
                                    "author": "QuestofMiren",
                                    "score": 1,
                                    "created_utc": 1653316420.0,
                                    "response": "oh sorry I thought this was my thread for a second! [here](https://www.reddit.com/r/CoinBase/comments/uw0ta2/horribly_handled_support_from_you_guys/)\n\nsorry, to your response to the OP - it looks like the support here might actually help, we shall see though .....",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9or857",
                                    "author": "scumunOp5ened",
                                    "score": 0,
                                    "created_utc": 1653316399.0,
                                    "response": "DM me",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9oeuf3",
                    "author": "AcademicMistake",
                    "score": -1,
                    "created_utc": 1653310347.0,
                    "response": "Leaving coinbase as soon as possible is your best option. and dont reply to direct messages claiming to be from support or people pretending to be in the same satuatiuon and able to help. they cant help you",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ogniq",
                            "author": "maxmhlk1",
                            "score": 1,
                            "created_utc": 1653311308.0,
                            "response": "Thank you for your advice.\n\nThere are in real a lot of people claiming they are Coinbase support agents writing in DM.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}