{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uyqtbv",
            "title": "Sending via Coinbase Wallet iOS",
            "url": "https://www.reddit.com/r/CoinBase/comments/uyqtbv/sending_via_coinbase_wallet_ios/",
            "author": "Juurbee",
            "created_utc": 1653628535.0,
            "score": 3,
            "num_comments": 43,
            "subreddit": "CoinBase",
            "selftext": "I'm sending BTC from Coinbase Wallet on my iPhone, using the camera to scan the receiving address's QR code. When I preview the transaction, the full address isn't shown - but rather the first and last few characters. Is there a way to show the full address? Thank you",
            "stickied": false,
            "comments": [
                {
                    "id": "ia5r8kc",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653628535.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia5s1z7",
                    "author": "coinbasesupport",
                    "score": 1,
                    "created_utc": 1653629092.0,
                    "response": "Hello there, u/Juurbee. Thanks for reaching out to us. We're working on sharing with you the answer to this question. Please allow us sometime to research and we'll get back to you shortly. Thanks!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia5st9z",
                    "author": "coinbasesupport",
                    "score": 1,
                    "created_utc": 1653629627.0,
                    "response": "Thanks for waiting, u/Juurbee. We have clarified with our wallet specialist that when using the QR scanner to send your assets outside of your wallet account, it will only show the first and last characters. Unfortunately, there isn't a way to expand and view the full address of the recipient. We will take this a feature request to improve the Coinbase wallet app.\n\nAlternatively, if you still wish to view the full address, you'll have to complete the transaction and get a hold of the hash ID. You can use blockchain explorers to view the transaction and you should be able to view the full address from there. Thank you!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia5t6ll",
                            "author": "Juurbee",
                            "score": 1,
                            "created_utc": 1653629885.0,
                            "response": "Got it thanks!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia5rhd5",
                    "author": "Longjumping-Gas-1125",
                    "score": -3,
                    "created_utc": 1653628704.0,
                    "response": "First connect your wallet coinbase wallet needs some rectification most times",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}