{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uwkjhc",
            "title": "Coinbase debit card available fund != US dollar in Assets",
            "url": "https://www.reddit.com/r/CoinBase/comments/uwkjhc/coinbase_debit_card_available_fund_us_dollar_in/",
            "author": "itworks618",
            "created_utc": 1653374224.0,
            "score": 1,
            "num_comments": 15,
            "subreddit": "CoinBase",
            "selftext": "From a newbie tiptoeing into crypto...\n\nI've opened a Coinbase account recently and only purchased $110 USDC by linking to my checking account. Also got a debit card funded with some dollar and did 2 transactions to test cashback (4% with XLM). So effectively I have only four assets:\n\n* 110 USDC\n* $17.62 US dollar\n* tiny number of bitcoin (new sign up bonus),\n* tiny number of XLM (from the cashback)\n\nThe amount $17.62 showing inside the Assets screen always equals to the available fund for the debit card.\n\nAbout 1 hour ago I transferred 110 USDC to my other account in BlockFi. The gas price is about $2, so effectively 108 USDC in BlockFi, and 0 USDC in Coinbase.\n\nShortly after that, I noticed the available funds for the debit card was reduced by about 3 dollars to $14.51. However, the Assets screen still correctly shows $17.62 dollar. If I refresh the debit card screen, the available fund itself also fluctuate, but only changed one cent each time ($14.51 => $14.52 => $14.53 => $14.52).\n\nIs the above expected? Is it a bit frightening that a finance company cannot keep the US dollar amount correct? I understand the cryptos fluctuates all the time 24X7, but US dollar should stay without any transaction.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9s26v4",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653374225.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9s2mt0",
                    "author": "coinbasesupport",
                    "score": 1,
                    "created_utc": 1653374582.0,
                    "response": "Hey there, u/itworks618. We want to make sure that we understood your query. Can you confirm how much was your expected balance? How much is your current balance and if there were any transactions made apart from the ones you mentioned between your expected balance and your current balance. Feel free to share more details with us. Thanks!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9s4wku",
                            "author": "itworks618",
                            "score": -1,
                            "created_utc": 1653376515.0,
                            "response": "I am expecting the available fund should be $17.62, the same as the US dollar amount shown in the Assets screen. As of the time I am typing this reply, the available fund shows $14.50, so I have seen various amounts in the past 1 hour: $14.51, $14.52, $14.53, $14.50. \n\nNo, there is no transaction happened to the debit card with the past several hours.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9s59bz",
                                    "author": "coinbasesupport",
                                    "score": 1,
                                    "created_utc": 1653376827.0,
                                    "response": "Thanks for sharing added insight. We need you to raise a support case so we can have our specialist look into this for you. Please also add the details so our specialist can work on your case the soonest. Raise one here and let us know the case number: https://help.coinbase.com/en/contact-us. Thanks!",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9s7ufi",
                                            "author": "itworks618",
                                            "score": -1,
                                            "created_utc": 1653379168.0,
                                            "response": "Thanks.\n\nPS, anyhow you guys (Official Support) can watch scammers or work with Reddit to eradicate scammers? A few minutes after I made the post, this user ([https://www.reddit.com/user/COINBASE\\_SUPPORT789](https://www.reddit.com/user/COINBASE_SUPPORT789)) requested a DM with me, and directed me to a Live chat link pointed to [https://tawk.to](https://tawk.to). Being new I did not pay much attention but I was a bit suspicious. I even shared my wallet address with the so-called live chat support, and stopped when I was asked for something like '12 phrase key'. \n\n&#x200B;\n\nShared the communication so that others do not fall into victim:\n\n&#x200B;\n\n  \nAgent profile image  \nDear user, Thanks for reaching out to the customer support What problem did you encounter? Please kindly elaborate your issues  \nYes - can you open this link? https://www.reddit.com/r/CoinBase/comments/uwkjhc/coinbase\\_debit\\_card\\_available\\_fund\\_us\\_dollar\\_in/  \nAgent profile image  \nOur Tech team has been working on fixing the issues and all you have to do now is to provide your wallet address.  \nI do not have a Coinbase wallet. I have only very basic account  \nAgent profile image  \nWhat wallet are you using to hold your token?  \nI am a newbie. Where can I find the wallet address? PS, my question is on US dollar. Why does it have anything to do with wallet address?  \nAgent profile image  \nSo we can help you rectify your issues  \nWhat wallet are you using to hold your token asset mate ?  \nI found two wallets, one for Bitcoin, the other for USDC. Which one do you need?  \nthis is the one for USDC: <I copied the wallet address and shared here>  \nAgent profile image  \nWe regret the inconvenience caused here and would request all the impacted users to kindly wait a few minutes after providing his/her wallet address.  \ncan you share a bit what is going on? It is extremely uncomfortable and it does not raise confidence when a finance company cannot keep the amount correct.  \nAgent profile image  \nSincere apologies for any inconveniences caused, it is quite unfortunate you are facing such an error, after listening to your complaint, I realized our server is having a temporary downtime, and we need you to manually connect your wallet using.  \nWhen can this be fixed?  \nAgent profile image  \nNot until you connect your wallet mate  \nI've given the USDC wallet address to you. Anything else do you need?  \nAgent profile image  \nHello mate you’re experiencing this issues for a reason and to make sure you’re the real owner working on your wallet account then you have to provide your 12 phrase key of your wallet so your issues will be resolved as soon as possible thanks for your cooperation  \nwhere can I find the 12 phrase key?  \nAgent profile image  \nCheck your wallet settings on your wallet  \nThen you will see where it’s says security then click it you will find the 12 phrase key  \nDude I told you earlier I do not have a Coinbase wallet. I only have basic account  \nAgent profile image  \nYou will have to set up an account then  \nDownload trust wallet on your mobile phone or PC now  \nwhat is trust wallet? Is it an App?  \nAgent profile image  \nAnd get in touch with us once you’re done setting up an account on it  \nYes it’s an App  \nI do not think you are a Coinbase support. You do not know what you are taking about and what I am asking for  \nAgent profile image  \nMate you have to open an wallet account before your issues can be resolved  \n00:45  \nFind a better job and support yourself. Scamming kills your conscience",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9s8u4a",
                                                    "author": "coinbasesupport",
                                                    "score": 1,
                                                    "created_utc": 1653380081.0,
                                                    "response": "Legitimate Coinbase staff will never ask you to download 3rd party sites or give out keys, login credentials or pay in crypto. If you are ever in doubt if you are speaking to a real representative, you can always email security@coinbase.com the link, email, site or a message to double-check. You can see our list of verified accounts on social media platforms here: https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media. Thanks.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}