{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "usts4d",
            "title": "Man, Coinbase sucks at advertising",
            "url": "https://www.reddit.com/r/CoinBase/comments/usts4d/man_coinbase_sucks_at_advertising/",
            "author": "GrayGray4468",
            "created_utc": 1652929343.0,
            "score": 0,
            "num_comments": 11,
            "subreddit": "CoinBase",
            "selftext": "Was watching warriors v mavericks and in the fourth quarter, a coinbase ad rolled. It was a bunch of tweets going back the years saying the same thing, ”Crypto is dead.” And that part was nice and had meaning, right? That was a good statement. And then it switched to their logo and a horrendous song, and then a butchered logo representing their 10th anniversary, “C10NBASE”. That’s just not a good logo, right? It hurts the eyes. Anyways, rant over, mods ban me if u want <3",
            "stickied": false,
            "comments": [
                {
                    "id": "i95p8z3",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1652929343.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "usthmk",
            "title": "COINBASE INITIATED A TOKEN SWAP AT 60 CENTS ON THE DOLLAR.......NO APPROVAL",
            "url": "https://www.reddit.com/r/CoinBase/comments/usthmk/coinbase_initiated_a_token_swap_at_60_cents_on/",
            "author": "Eze-Tepesh",
            "created_utc": 1652928356.0,
            "score": 0,
            "num_comments": 49,
            "subreddit": "CoinBase",
            "selftext": "***Initial email sent to Coinbase, after 3 hours of CS had me plucking hairs out of my eyeballs!***\n\n**Good afternoon,** \n\n **Case #11724154** \n\n**Basic transaction of swapping currency in Coinbase Wallet. Swap from CRPT TO ETH was confirmed at roughly $65,000 minus fees. To be exact, check the hash transaction swapping 174,258.015597920277296361 CRPT to ETH. Coinbase swapped it using UNISWAP for $29,550 which was incorrectly valued at .1696 cents per token. I have printouts of all the uniswap transactions from that day, time, hour and minute. All CRPT to ETH sell transactions were between .35 CRPT to .46 CRPT.  When you view the CRPT price chart for the entire day, not once did the currency drop to the amount of .1696. I am conducting the proper procedures for this huge error prior to contacting my attorney, per the Coinbase rules and regulations. I have 6 hours of printed chat from 5/7/22 and 5/8/22 so a case is open. Customer service was of no help and made matters worse by not escalating the issue to a higher authority. I am out over $35,000 and this is not the first issue I had that day, but the most glaring and unacceptable by all measures. As a businessman and someone who likes to conduct a transaction with full intent and honesty, this is a matter which must be resolved quickly. There was no such volatility with either token at that time, not even that entire day. Coinbase received a large fee for the transaction, as did uniswap. I am okay with the fees being high, although they were not advertised to me prior, it simply said \"it is a busy time and fees are higher than normal\". These fees are recorded in the hash transaction as well and I am still short $35,000. I am asking for an immediate reply and remedy of this error, as there are no other transactions showing that this is \"normal practice\". No one loses close to 60% of their funds by having a locked transaction and paying fees, which are recorded. Again, I would like to avoid litigation, but will do what I must to protect my assets. This is the second step I have taken to remedy this situation and my legal team advised me to go with this route first, as this is preferred by Coinbase. I agreed and am willing to be respectful, as long as the remedy is swift. I have printouts of every conversation I have had with customer service, along with detailed logs of every CRPT to ETH transaction through uniswap along with many other documents showing that this was an anomaly. I thank you kindly for the time and look forward to a swift resolution and the ability to regain my trust in Coinbase, the largest trading platform in the world for cryptocurrency.**\n\n**Below is the Hash transaction for what is being described above.**\n\n[**https://etherscan.io/tx/0xe4c1ac148ddbe54e827ca547a1550369d15ff0351e9bd2f2020cfc542009268e**](https://etherscan.io/tx/0xe4c1ac148ddbe54e827ca547a1550369d15ff0351e9bd2f2020cfc542009268e)",
            "stickied": false,
            "comments": [
                {
                    "id": "i95sgu8",
                    "author": "BiochemBeer",
                    "score": 4,
                    "created_utc": 1652931019.0,
                    "response": "I think you are confusing the Wallet app with the Coinbase exchange. They have no control over your wallet on Uniswap.  You must have authorized Uniswap (or someone else) via a smart contact to do that transaction. You pre-approved the swap even if you didn't realize it.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i95to44",
                            "author": "Eze-Tepesh",
                            "score": -3,
                            "created_utc": 1652931664.0,
                            "response": "I am not confused. The reason this is going back to Coinbase, is they directed me to go to Coinbase wallet. They are also replying to my emails but hiding behind the guise of volatility and slippage. There is no Coinbase Wallet CS, it gets re-directed to Coinbase and they are the ones who issued the case #.  I am trading on multiple platforms and even when I fool around with crap meme coins, have never been in this situation. This transaction was not approved for this amount, not ever. Only the gas fees.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i95ua4q",
                                    "author": "coinbasesupport",
                                    "score": 1,
                                    "created_utc": 1652932004.0,
                                    "response": "Hey there, Eze-Tepesh. Can you please share with us the case number so we can take a look? Thanks!",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i95uh5z",
                                            "author": "Eze-Tepesh",
                                            "score": 0,
                                            "created_utc": 1652932115.0,
                                            "response": ">Case #11724154\n\nIt's in the body of the initial post as well.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i98oiu5",
                                                    "author": "coinbasesupport",
                                                    "score": 1,
                                                    "created_utc": 1652988961.0,
                                                    "response": ">11724154\n\nThank you for sharing that over with us, we were able to locate your case and we have notified the team of your response. You should be hearing back from our team soon, please allow some time for them to review and respond to your case. We appreciate your understanding.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i96lqns",
                    "author": "fx9TMK",
                    "score": 4,
                    "created_utc": 1652953209.0,
                    "response": "Thanks OP, I like waking up and seeing posts where people blame others for their own mistakes.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i97h4z0",
                            "author": "Eze-Tepesh",
                            "score": -1,
                            "created_utc": 1652971325.0,
                            "response": "You are the best. Thanks for the kind words and morale boost. Bet you are the life of every party you have ever attended!",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i97hefi",
                                    "author": "fx9TMK",
                                    "score": 2,
                                    "created_utc": 1652971438.0,
                                    "response": "Thanks! I do hog the spot light some times. But if you ever need more advice, feel free to reach out to me. Remember to think next time and double check everything",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i97idt4",
                                            "author": "Eze-Tepesh",
                                            "score": -1,
                                            "created_utc": 1652971848.0,
                                            "response": "Absolutely. In fact, I'm happy to wire over 500K into your \"spotlight hog\" account and just let me know how much profit I have in about a year. No need for any updates in the interim as I am sure you are absolutely crushing it......so, surprise me.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i97j177",
                                                    "author": "fx9TMK",
                                                    "score": 1,
                                                    "created_utc": 1652972117.0,
                                                    "response": "No trust me, it seems like you aren’t smart enough to be moving money around. You’d probably send it to the wrong account then blame someone else for your mistake again",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i97kpn8",
                                                            "author": "Eze-Tepesh",
                                                            "score": 0,
                                                            "created_utc": 1652972819.0,
                                                            "response": "That may be true, but now I have you. Send the wire information player. I am sure you are \"all knowing\" and so thankful that you have secured an hour to troll, er, I mean help the \"idiots and peons\" during your charitable philanthropy session on reddit. All the big names offer help on here. Say hello to Elon and Bezos for me when you are at the country club, will ya?",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i97lqgg",
                                                                    "author": "fx9TMK",
                                                                    "score": 1,
                                                                    "created_utc": 1652973247.0,
                                                                    "response": "I doubt the high rollers would want a hello from someone that blames others for their own mistakes.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i97mdfx",
                                                                            "author": "Eze-Tepesh",
                                                                            "score": 0,
                                                                            "created_utc": 1652973517.0,
                                                                            "response": "Seeing that you spend all damn day on here making fun of others. I'd be happy to take you down a notch by posting coined photos of our homes, cars and businesses. Yah, I'll get crickets and a story, but my camera is ready and it sure is a pretty day, water looks clear from my vantage point. Move along, you are what makes these blogs insufferable.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i97mzhl",
                                                                                    "author": "fx9TMK",
                                                                                    "score": 1,
                                                                                    "created_utc": 1652973767.0,
                                                                                    "response": "Sure go for it. I can post a picture of my space station since you know, I can also use Google to find pictures of expensive things and claim them my own. Shoot get me a pic of your mansion with the pool filled with the whole legal team you got threatening to use to sue CB",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i97nz4c",
                                                                                            "author": "Eze-Tepesh",
                                                                                            "score": 0,
                                                                                            "created_utc": 1652974175.0,
                                                                                            "response": "I knew it, when it comes down to brass tax, you piss yourself. Keyboard warrior sniffed out in 3 minutes. Yah man, your comments and sarcasm are worthless, but seem to make you happy. You do not know the entirety of the transaction, yet you wish to judge. That's cool, but this entire thread, my first and likely last post was for one intention, to get CB to reply and they have. So, I am laughing my ass off at the level of negativity and so damn happy that I do not have to dwell over \"good karma\" on reddit to justify my wellbeing. I'd say, \"be well\" or \"take care\", but that would be mean as you are incapable of \"being well\" or \"taking care.\" No one as negative as you could ever be well. Unless you are being paid by reddit, get a life my man or get outdoors. See you up in the space station with Elon....idiot!",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9655wd",
                    "author": "jhanon76",
                    "score": 3,
                    "created_utc": 1652939002.0,
                    "response": "\"...likes to conduct a transaction with full intent and honesty...\"\n\n...$65k crypto transaction...",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i97h00u",
                            "author": "Eze-Tepesh",
                            "score": 0,
                            "created_utc": 1652971266.0,
                            "response": "I sense a bit of jealousy. It's not healthy.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i96g2qh",
                    "author": "MichoRizo7698",
                    "score": 3,
                    "created_utc": 1652948030.0,
                    "response": "Printing this to wipe ass",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i97n4ep",
                            "author": "Eze-Tepesh",
                            "score": 1,
                            "created_utc": 1652973823.0,
                            "response": "Must have a big ass, as this thread keeps growing with negative trolls like yourself.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i95o1yb",
                    "author": "Kiwip0rn",
                    "score": 5,
                    "created_utc": 1652928741.0,
                    "response": "🙄 nothing to do with Coinbase... but cool. 😎",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i95ohck",
                            "author": "Eze-Tepesh",
                            "score": -8,
                            "created_utc": 1652928960.0,
                            "response": "Okay, so they are just taking fees without responsibility and can sell your shit for any amount? Stop acting like this isn't theft in broad daylight. Simply sharing, as this is not the first time, they have had major issues.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i95qkvx",
                                    "author": "TheRealAstic",
                                    "score": 3,
                                    "created_utc": 1652930023.0,
                                    "response": "Wait why aren’t you just using the included browser function and swapping on 1inch I’m so confused.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i95r7c7",
                                            "author": "Eze-Tepesh",
                                            "score": -4,
                                            "created_utc": 1652930356.0,
                                            "response": "The swap was initiated by Coinbase-on-Coinbase wallet, as they were unable to perform a swap on Coinbase for over two hours (mystery, I know). Over 15 failed attempts of a cash-out or a swap on Coinbase main, with CS on chat repeatedly asking me \"to remain patient and try again\". Once we were able to move the tokens into Coinbase wallet, the swap was initiated. Wallet selected uniswap as a trade partner and only asked me to approve the ridiculous \"gas fees\" but clearly showed the transaction going through for the full amount. No one would approve such a thing, which is why they don't ask. This is where the issue lies.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i95t5hn",
                                                    "author": "TheRealAstic",
                                                    "score": 5,
                                                    "created_utc": 1652931380.0,
                                                    "response": "Why didn’t you do the swap yourself? Why are you using Coinbase main for that amount of money?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i95ud71",
                                                            "author": "Eze-Tepesh",
                                                            "score": -3,
                                                            "created_utc": 1652932052.0,
                                                            "response": "The CRPT was in Coinbase main. I swapped from ETH several hours prior and received a positive return. Paid fees, as anyone else would, no issues. Proceeded to initiate multiple attempts to withdraw and/or swap the tokens back to ETH. Two hours with CS and they were unable to solve nor explain why my account was unable to complete any swap or cash out on Coinbase main (first red flag). CS proceeded to suggest that I send the tokens to wallet and pursue a successful swap there. Had Coinbase main allowed a simple transaction to occur, I would not be typing this right now.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i95uyjb",
                                                                    "author": "coinbasesupport",
                                                                    "score": 2,
                                                                    "created_utc": 1652932390.0,
                                                                    "response": "Thanks for sharing the case number with us. Please allow us sometime to check this for you. Will share you another update here once we have the information to your concern. Thank you!",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i95y8or",
                                                                            "author": "DonutsForCops",
                                                                            "score": 2,
                                                                            "created_utc": 1652934334.0,
                                                                            "response": "How do you set a reminder on this?",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i960fcy",
                                                                                    "author": "TheRealAstic",
                                                                                    "score": 3,
                                                                                    "created_utc": 1652935736.0,
                                                                                    "response": "Lmao. I don’t know why they’re giving him hope, when he bought like .75% of the supply of a shitcoin and doesn’t even realize the price went up solely from his buy lol.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i960jr9",
                                                                                            "author": "DonutsForCops",
                                                                                            "score": 3,
                                                                                            "created_utc": 1652935815.0,
                                                                                            "response": "“Say it louder for the people in the back”\nOP isn’t hearing it",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        },
                                                                                        {
                                                                                            "id": "i97gpox",
                                                                                            "author": "Eze-Tepesh",
                                                                                            "score": 0,
                                                                                            "created_utc": 1652971146.0,
                                                                                            "response": "You are so damn uninformed, if stupidity was in human form, you'd be the walking version of it. The coin was at .25, I picked it up at .30 and rode it to .46, cashed out at .37. Had you conducted 5 seconds of chart research, you would not be trolling reddit blogs and counting your money.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i95sqee",
                                    "author": "Kiwip0rn",
                                    "score": 8,
                                    "created_utc": 1652931158.0,
                                    "response": "Coinbase cannot initiate anything in the Coinbase Self Custody Wallet, kinda the \"Self Custody\" thing of a Self Custody Wallet. \n\nAnd Coinbase doesn't receive anything from network fees. \n\nThis IS theft, the finger is pointing in the wrong directions, except for the 3 pointing back at you.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i95t4hf",
                    "author": "entropen",
                    "score": 4,
                    "created_utc": 1652931365.0,
                    "response": "This sounds like user error. Or user misunderstanding.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i95uuhg",
                            "author": "Eze-Tepesh",
                            "score": -2,
                            "created_utc": 1652932325.0,
                            "response": "If so, why is Coinbase unable to pin it down on that. Why are they stating that there was volatility with the exchange at the time, with no proof? Every document uploaded shows the token fluctuating by 1-2% over a 12-hour period. No user error here. I have messed up before, but not on a simple token swap. Amazing how everyone takes the side of the company that is littered with screw-ups on a daily basis. Simply sharing on this platform for the first time to see if anyone has had a similar experience.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i95vi6i",
                                    "author": "coinbasesupport",
                                    "score": 2,
                                    "created_utc": 1652932703.0,
                                    "response": "Thanks for your patience! We have sent a follow-up to the concerned team to respond to your most recent reply. We appreciate your understanding and please expect an email update anytime soon. Thank you!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i95naa5",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1652928356.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i95nkwf",
                            "author": "Eze-Tepesh",
                            "score": -2,
                            "created_utc": 1652928502.0,
                            "response": "I posted a hash transaction, not my Coinbase email.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i95p2ox",
                                    "author": "coinbasesupport",
                                    "score": 2,
                                    "created_utc": 1652929256.0,
                                    "response": "Hello!  Thanks for sharing your experience with us along with those blockchain explorer links.  It sounds like your issue may be a result of arbitrage, meaning the price of the asset in the decentralized exchange (Uniswap) is different from an exchange.  This can happen sometimes, such as if it is a new asset and/or liquidity pool for example.  It may have also been slippage during this swap.  \n\nOn arbitrage: https://help.coinbase.com/en/coinbase/getting-started/crypto-education/glossary/liquidity-pool\n\nOn spreads and slippage:  https://help.coinbase.com/en/coinbase/trading-and-funding/buying-selling-or-converting-crypto/understanding-slippage-and-spread\n\nLet us know if this may be the case for your specific issue, and we hope it helps clear things up.  If not please let us know.  We're happy to help!",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i95pvvc",
                                            "author": "Eze-Tepesh",
                                            "score": -1,
                                            "created_utc": 1652929666.0,
                                            "response": "Below are your policies, rules and regulations, based on numerous emails I have exchanged. In bold is my reply.\n\n1. Price slippage - The difference between the expected price of an order and the price that the order actually executes. Slippage is caused by the amount of liquidity, which is how quickly you can buy and sell an asset without impacting the price. So, if there is low liquidity or low trading activity in the market for a specific asset, then the slippage percentage will be higher. Coinbase Wallet will cancel any trade that exceeds a certain slippage percentage to prevent customers from losing value. \n\n***You did not cancel the trade, thus did not prevent or warn me of any slippage. The volatility at that hour was just fine, nothing out of the ordinary whatsoever. This was a basic swap. I did not leap on a rocket and try to jump off with everyone. The token continued to escalate in value after the swap, which is quite telling.***\n\n\r  \n2. Exchange Rate - before approving a trade quote, check to see if there is a warning of a price difference. This warning is important to review as it is stating the output is at a large difference from the spot price of the token at that moment.\n\n***There was no warning, only a \"networks are busy pop-up and a gas fee of $650\" which was approved. Not once was there a warning of slippage or selling my assets for 60 cents on the dollar, not ever.***",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i96fy3b",
                    "author": "MichoRizo7698",
                    "score": 1,
                    "created_utc": 1652947909.0,
                    "response": ">/dev/null",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}