{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "urgogw",
            "title": "Portfolio balance doesn't add up after transferring to cold wallet",
            "url": "https://www.reddit.com/r/CoinBase/comments/urgogw/portfolio_balance_doesnt_add_up_after/",
            "author": "ReznovRNR",
            "created_utc": 1652771016.0,
            "score": 0,
            "num_comments": 15,
            "subreddit": "CoinBase",
            "selftext": "I recently bought a Ledger Nano S, went and sent my whole ETH and BTC balance to it but 2 weird things have happened. Firstly I seemed to receive a lot less ETH than I was expecting, I had 0.25is but only received 0.17, I'm guessing I got fucked with transfer fees. But the second problem is now I seem to have a portfolio that is inflated by roughly the same amount that went missing. \n\n[here is the portfolio on coinbase at the moment](https://prnt.sc/OXWgyg1_TVPK)\n\n&#x200B;\n\nwhen adding the two together you get around 70 GBP, so what is the other 130? also weirdly 130gbp is roughly 0.08eth which is the gap I had when transferring to my Nano S?\n\n&#x200B;\n\nI have no idea where I'd even start with support, refreshing and relogging and clearing cache did nothing so I'm stumped",
            "stickied": false,
            "comments": [
                {
                    "id": "i8x41l9",
                    "author": "coinbasesupport",
                    "score": 1,
                    "created_utc": 1652771273.0,
                    "response": "Hey there, ReznovRNR. Could you open a support case for this concern, and provide us the case number, so we can further investigate? Thanks! Here's the link to open a support case. https://help.coinbase.com/en/contact-us",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8x3qkn",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1652771016.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i96176q",
                    "author": "HqrkatMatt",
                    "score": 1,
                    "created_utc": 1652936254.0,
                    "response": "🔥 DINOSTEP.APP 🔥\n\n🦖 The First Move To Earn App With Virtual Dinosaurs\n👟 Earn while building healthy habits with the Dino\n✨ Varied NFTs\n💵 Passive Income Features\n💎 App Activation Code & NFT Drop For Fair Launch Contributors\n\n🚀 Fair Launch Starts On May 9th",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}