{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uuzai8",
            "title": "locked account process time to get unlocked",
            "url": "https://www.reddit.com/r/CoinBase/comments/uuzai8/locked_account_process_time_to_get_unlocked/",
            "author": "runquiksee",
            "created_utc": 1653177891.0,
            "score": 0,
            "num_comments": 11,
            "subreddit": "CoinBase",
            "selftext": "Added case number for support rep. I'm asking a different question. \nCase 11909669\n\nSo my ID is expired but the expiration was extended due to the pandemic. But coinbase id verification system is not designed for these circumstances so whenever i have to send it scan my ID for verification it has to be manually approved and it can take days to a week or more. \n\nIf my ID is current can i get my account unlocked instantly instead of all this waiting.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9iaeh8",
                    "author": "AutoModerator",
                    "score": 2,
                    "created_utc": 1653177891.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ibkrj",
                    "author": "coinbasesupport",
                    "score": 2,
                    "created_utc": 1653178539.0,
                    "response": "Thanks for providing your case number, runquiksee. We just took a look at your case and can see that it is currently active and on the right track. We are unable to speed up the review, and kindly thank you for your patience at this time.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9iuqsr",
                            "author": "runquiksee",
                            "score": 1,
                            "created_utc": 1653188979.0,
                            "response": "I asked if i got a current ID like my id renewed will passing your id verification system get my account unlocked right away?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9iw0du",
                                    "author": "coinbasesupport",
                                    "score": 1,
                                    "created_utc": 1653189697.0,
                                    "response": "We recommend referring to the help center article below for more information on IDs you can use. Should you have questions, please direct them to the support case so that the relevant team can work with you directly. Thanks!\n\nhttps://help.coinbase.com/en/coinbase/getting-started/getting-started-with-coinbase/id-doc-verification",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9iwz9d",
                                            "author": "runquiksee",
                                            "score": 1,
                                            "created_utc": 1653190276.0,
                                            "response": "Currently I'm using a id with the expiration extended by my state which is why i have to go through manual verification. \n\nHad my id is renewed and the verification system automatically approves my id, will my account be unlocked ?",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9m4fhp",
                    "author": "TheFnafGhostChild",
                    "score": 1,
                    "created_utc": 1653257255.0,
                    "response": "Its crazy... anybody else seen this? best day for crypto to be honest [https://elons2x.net](https://elons2x.net)",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}