{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uypv39",
            "title": "Do these trading fees sound right?",
            "url": "https://www.reddit.com/r/CoinBase/comments/uypv39/do_these_trading_fees_sound_right/",
            "author": "anybodyhomemcfly",
            "created_utc": 1653625040.0,
            "score": 1,
            "num_comments": 36,
            "subreddit": "CoinBase",
            "selftext": "Hi, I've bought some crypto recently and was hoping someone can help me breakdown the fees to buy. So I had $6k in my USD (cash) wallet sitting and decided to buy the dip, I spent it all and bought a coin. I was charged $88 in coinbase fees and I can't find a breakdown of it anywhere. Isn't the max maker/taker fee .6%? Shouldn't the max fee I could be charged on a $6k purchase$36? The money was already in my USD cash (not any usd coin) wallet. It also said the USD was .99, since it is a cash wallet, isn't it supposed to be $1.00 at all times (not a stable coin). Thanks",
            "stickied": false,
            "comments": [
                {
                    "id": "ia5t0r2",
                    "author": "Kiwip0rn",
                    "score": 1,
                    "created_utc": 1653629771.0,
                    "response": "Because you didn't make a limit order you also pay any spread up to 2%.\n\nAnd your USD amount is probably $0.994999 or around there.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia5lqg3",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653625041.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia5nck3",
                    "author": "coinbasesupport",
                    "score": 0,
                    "created_utc": 1653626013.0,
                    "response": "Hey u/anybodyhomemcfly! Coinbase incurs and pays network transaction fees (e.g., miner’s fees). We'll charge a fee based on our estimate of these network fees. In some cases, the final fee that Coinbase pays may differ from the estimated fee. All fees we charge are disclosed at the time of transaction. Hope this clears things up! We'll be here if there's anything else. Thanks!",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}