{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "mujryy",
            "title": "Plaid keeps rejecting my bank credentials?",
            "url": "https://www.reddit.com/r/CoinBase/comments/mujryy/plaid_keeps_rejecting_my_bank_credentials/",
            "author": "Cwreck92",
            "created_utc": 1618897700.0,
            "score": 14,
            "num_comments": 11,
            "subreddit": "CoinBase",
            "selftext": "Hi all,\n\nI'm trying to finalize my coinbase profile here by adding my bank account to my account, and anytime I try to it fails, it tells me my credentials are invalid. What it's telling me is actually impossible due to me being able to log into my banks website & app with the same exact credentials I'm plugging into Plaid. I've tried 10+ times. I've even made sure to press each key for my password with 1 finger, and watching each finger press the correct key, JUST to be sure it wasn't user error. I ran into this problem before when trying to sign up on Webull, and it was never resolved. I contacted support and they just kept telling me to \"make sure my credentials were correct\" over and over again, even after trying to explain to them that the credentials I am using are 1000% correct. \n\n&#x200B;\n\nHas anybody else seen this issue before?",
            "stickied": false,
            "comments": [
                {
                    "id": "gva5yc2",
                    "author": "coinbasesupport",
                    "score": 1,
                    "created_utc": 1618973466.0,
                    "response": "Hi there u/Cwreck92 \\- Thanks for reaching out to us about this. If you haven't filed a support ticket for this concern, please file it through this [link](https://help.coinbase.com/en/contact-us). Once you do, please share to it to us so we can take a look. Thanks!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gv6p07q",
                    "author": "Polkanich",
                    "score": 3,
                    "created_utc": 1618913529.0,
                    "response": "I had the same problems with PNC. One time will connect - 100 not. Your bank probably is not  crypto friendly. Open a new account from the Plaid list and work through them. I lost 2 months on these problems with Coinbase and Binance. Just switch banks.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gv67zbv",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1618897700.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gv6c0dy",
                    "author": "neotank35",
                    "score": 1,
                    "created_utc": 1618901055.0,
                    "response": "had this happen on binance on sunday. it finally started working.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "gv6c2e1",
                            "author": "Cwreck92",
                            "score": 1,
                            "created_utc": 1618901104.0,
                            "response": "So you just tried on another day with your credentials through Plaid's verification system and it worked?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "gv6c4oi",
                                    "author": "neotank35",
                                    "score": 1,
                                    "created_utc": 1618901160.0,
                                    "response": "later the same day, after 10 tries it worked.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "gv6c5mi",
                                            "author": "Cwreck92",
                                            "score": 1,
                                            "created_utc": 1618901182.0,
                                            "response": "Right on, I'll give it another shot tomorrow. \n\nThanks!",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "gv6c6ne",
                                                    "author": "neotank35",
                                                    "score": 1,
                                                    "created_utc": 1618901207.0,
                                                    "response": "hope it works for you too.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "gv80wlq",
                    "author": "Muted-Translator5915",
                    "score": 1,
                    "created_utc": 1618938454.0,
                    "response": "Do you have 2FA enabled on your bank account login? I did and it wouldn’t connect to Plaid, so I had to disable it and then once it was all set up i turned it back on.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "gv8posx",
                            "author": "Cwreck92",
                            "score": 2,
                            "created_utc": 1618948661.0,
                            "response": "I do not. I’m going to give it another shot today.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hgu2yez",
                    "author": "ZeeSterben",
                    "score": 1,
                    "created_utc": 1634368025.0,
                    "response": "keeps happening to me with the correct logins. my bank is up & I can login fine but when I use the exact same credentials plaid just says it’s invalid and wont log me in. how can I get my money out of coinbase if plaid wont let me login?",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}