{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ut20cy",
            "title": "Hi guys, I'm building a design Studio as a Service for web3 builders. It's one flat monthly to scale all your design needs.",
            "url": "https://www.reddit.com/r/CoinBase/comments/ut20cy/hi_guys_im_building_a_design_studio_as_a_service/",
            "author": "caligolae",
            "created_utc": 1652962226.0,
            "score": 0,
            "num_comments": 27,
            "subreddit": "CoinBase",
            "selftext": "As someone who's been living at the intersection of product design and crypto for the last 5 or so years, I couldn't help but notice that most web3 user interfaces suck. We regularly see terrible user experiences and quite confusing web3 products that ignore even basic best practices.\n\nFor this and other reasons, I'm starting [Openprest.com](https://openprest.com/) a \"design studio a service\" (if that's a thing) to support web3 founders and make good design more accessible. Unlike traditional shops, we won't charge per hour or per project, but on a fixed monthly basis starting at $799/mo with unlimited design requests and revisions.\n\nThis is my humble attempt to narrow the chams between the wisdom of the recent past and the speed of the future. Helping founders build web3 products that are useful and unique. That are beautiful and usable. And that brings new perspectives, but never at the expense of greater surface complexity.\n\nThoughts or feedback would be great.",
            "stickied": false,
            "comments": [
                {
                    "id": "i96yau1",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1652962227.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}