{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uzo98z",
            "title": "Be careful with your Cards! I had an Unauthorized Usdc transfer using coinbase card. When I check the card transactions it doesn’t show but when I check Usdc transactions it shows $500 spent using coinbase card. I did not authorize this! Thus far no help from customer service",
            "url": "https://www.reddit.com/r/CoinBase/comments/uzo98z/be_careful_with_your_cards_i_had_an_unauthorized/",
            "author": "Ag1charles",
            "created_utc": 1653747425.0,
            "score": 46,
            "num_comments": 71,
            "subreddit": "CoinBase",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "iabi3r8",
                    "author": "Dizzy-Nebula-1919",
                    "score": 8,
                    "created_utc": 1653750006.0,
                    "response": "Isn't their a customer service number on the back of the card? It should be just as if you were calling a bank. \n\nAnyway Voyager debit card is being rolled out now as we speak. Might want to look into getting that. Voyager way better company than Coinbase.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iabdgfi",
                    "author": "coinbasesupport",
                    "score": 5,
                    "created_utc": 1653747747.0,
                    "response": "Hello!  Please contact our phone support as soon as you have a moment in case your account needs a temporary lock.  Then reach out to our account recovery team via our webform, and we'll be happy to assist further from there.  You will receive an email confirmation with your ticket number in the subject line.  Here is our contact info:  https://help.coinbase.com/en/contact-us",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iabrfr6",
                            "author": "Ag1charles",
                            "score": 4,
                            "created_utc": 1653754371.0,
                            "response": "I did all this and I’m getting no help. Just emails saying please provide more information. I’ve described everything in detail and still no help.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iabs06i",
                                    "author": "coinbasesupport",
                                    "score": 4,
                                    "created_utc": 1653754635.0,
                                    "response": "That must be very frustrating, and we're sorry that's happening to you.  Can we ask what your most recent ticket number is?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iabt9ao",
                                            "author": "Ag1charles",
                                            "score": 4,
                                            "created_utc": 1653755222.0,
                                            "response": "Case #11987450\nThanks",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iabun2x",
                                                    "author": "coinbasesupport",
                                                    "score": 4,
                                                    "created_utc": 1653755875.0,
                                                    "response": "Thanks!  We do see that you responded about 2 hours ago and your specialist escalated your issue.  They mentioned in their last response that they are working with appropriate teams to get things resolved for you.  You will get a response back as soon as possible.  We really appreciate your patience during this case.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iabvh89",
                                                            "author": "Ag1charles",
                                                            "score": 8,
                                                            "created_utc": 1653756264.0,
                                                            "response": "Thanks but I responded May 26 at 12:12AM then again 2 hours ago. Appreciate your help",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "iacther",
                                    "author": "Regular_Hunter5013",
                                    "score": 2,
                                    "created_utc": 1653772505.0,
                                    "response": "I had $1838 disappear from my USDC a month ago, still not resolved. it shows as (CARD SPEND) in my USDC wallet but no transaction is listed under my COINBASE card transactions, They just keep closing and opening new case #s but nothing gets resolved",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iad8nhr",
                                            "author": "coinbasesupport",
                                            "score": 1,
                                            "created_utc": 1653779827.0,
                                            "response": "Sorry to hear of any frustration you have had with the USDC transaction Hunter. Thank you for reaching out to us here and know, this is not the experience we want you to have.\n\nHappy to follow up on the Card Spend USDC issue. Would you kindly share one of those case numbers with us here?\nThanks for your patience and understanding, happy to follow this up.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iadekly",
                                                    "author": "Regular_Hunter5013",
                                                    "score": 1,
                                                    "created_utc": 1653782978.0,
                                                    "response": "The original # is 11552134, the latest # is 11657455. Thanks",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iadgma2",
                                                            "author": "coinbasesupport",
                                                            "score": 1,
                                                            "created_utc": 1653784083.0,
                                                            "response": "Thanks for providing your case numbers. We have just internally escalated your original case for further review. Please watch for an email update from the specialty team assigned to your case after it has been reviewed. We appreciate your patience!",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "iaddugf",
                                            "author": "Ag1charles",
                                            "score": 1,
                                            "created_utc": 1653782588.0,
                                            "response": "That’s exactly what mine shows!",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iadjrxb",
                                                    "author": "Regular_Hunter5013",
                                                    "score": 2,
                                                    "created_utc": 1653785835.0,
                                                    "response": "I figured out that in my case it was legit, it was a transaction from 35 days earlier. not sure why it took them so long to debit my USDC wallet",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iaf71jb",
                                                            "author": "ZexieGamingNetwork",
                                                            "score": 1,
                                                            "created_utc": 1653828824.0,
                                                            "response": "yea but thing is did you get rewards from the 1st purchase ? from that charge and did you count up all your money that you had in the account. They really need to fix this issue as it put me in a bind as i was under the impression i had already spent the money,  \n\n&#x200B;\n\nWAIT SO YOU COULDN'T Tell that 1800$ was still in your account after the 1st transaction you did?",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "iahc47h",
                                                                    "author": "Regular_Hunter5013",
                                                                    "score": 1,
                                                                    "created_utc": 1653865633.0,
                                                                    "response": "I use the card  for transactions that size almost daily, I also load the card daily, so no, at the time I didn't  notice that the money wasn't debited. I did get the rewards from the transaction. Since this incident I have been tracking transactions much closer.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iaddffl",
                    "author": "Designer-Swimming-20",
                    "score": 4,
                    "created_utc": 1653782360.0,
                    "response": "Bro they still owe me 500$ from a double withdrawal. The fuckin company is a joke",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iad55ft",
                    "author": "erorr132",
                    "score": 2,
                    "created_utc": 1653778039.0,
                    "response": "That's why I don't even use my CB card. I keep it at home locked away and blocked from transactions. Card scams wirh skimmers and keyloggers in general are everywhere and the thought of my CB card getting infiltrated would literally make me throw up",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iabws7n",
                    "author": "filbertbrush",
                    "score": 2,
                    "created_utc": 1653756867.0,
                    "response": "I had a very similar problem come up in February that just got resolved. They’re system had an error resulting in a charge from November posting to my card months later. It didn’t show up during the time I caught in it Feb since it had posted in November but wasn’t reflected in my card balance. I had zero help calling them. The only help I got was via email and it was sloooooowww. They did reimburse me for my time however. If they don’t offer you money press them for it. Your time is valuable if they have in fact made the same mistake.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaf7wol",
                            "author": "ZexieGamingNetwork",
                            "score": 0,
                            "created_utc": 1653829332.0,
                            "response": "kinda hard to say this is an error and they always say its rare but as you can see form this reddit that it is not rare and happens all the time,  what they do not understand is that you are under the impression that you already spent the money so then you get auto debits that take it but then 2 months later you put some money on your card to pay for something and BOOM its gone just for them to tell you its for a transaction from 2 months ago your like wtf and now you cant pay the bill you wanted to pay.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iacfe0t",
                    "author": "weaponz1",
                    "score": 2,
                    "created_utc": 1653765749.0,
                    "response": "The same thing happened to me today 358 USDC no info on the transaction.\nEmailed support waiting for a response",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iadfd5g",
                    "author": "cocv82",
                    "score": 1,
                    "created_utc": 1653783405.0,
                    "response": "Same thing happened to me a few days ago $496 charge on card.  They said 45-90 days to resolve, meanwhile my money is missing.  What a joke.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaf82zi",
                            "author": "ZexieGamingNetwork",
                            "score": 0,
                            "created_utc": 1653829427.0,
                            "response": "so that money is gone, they will tell you its for a transaction from 2 or 3 months ago that they covered.  and the 1st 496$ was probably used up by auto debits.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iacqz1q",
                    "author": "pafferreira",
                    "score": 0,
                    "created_utc": 1653771293.0,
                    "response": "I can't believe you people still use Coinbase!\nThe worst exchange ever!\nScammers!\nShysters!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iad3d06",
                            "author": "Kiwip0rn",
                            "score": 5,
                            "created_utc": 1653777151.0,
                            "response": "🙄 Okays 🙄  yet you have been hanging out here for 7 months.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iae3vo8",
                                    "author": "Data_miner_L",
                                    "score": 1,
                                    "created_utc": 1653797660.0,
                                    "response": "Which shows that he truly knows the behavior of Coinbase",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iafgdh3",
                                            "author": "Kiwip0rn",
                                            "score": 1,
                                            "created_utc": 1653833666.0,
                                            "response": "Let's see... 🤔 7 months vs 8 years... 🤔 who will have a deeper knowledge of the behavior of Coinbase 🤔🤔🤔",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iafk0xw",
                                                    "author": "Data_miner_L",
                                                    "score": 0,
                                                    "created_utc": 1653835461.0,
                                                    "response": "Okay Coinbase veteran, what do you have to say about the several other comments that mentioned money missing on their Coinbase card?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iaflf5f",
                                                            "author": "Kiwip0rn",
                                                            "score": 1,
                                                            "created_utc": 1653836087.0,
                                                            "response": "The several others? There are like 3 here, out of thousands of cards sent out. The other few are complaining about other things.\n\nI need to call my bank... it must have been the Bank's fault that the Starbucks Employee stole my wife's debit card info. 🙄",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iac0j40",
                    "author": "Connect-Ad-1088",
                    "score": 0,
                    "created_utc": 1653758614.0,
                    "response": "Hopefully someone will put cash on my cb card",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iabk0q3",
                    "author": "Accomplished-Way7608",
                    "score": -4,
                    "created_utc": 1653750903.0,
                    "response": "Your money is gone. Brian Armstrong needed it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iabcshk",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653747426.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iagd4da",
                    "author": "Ok-Mine6428",
                    "score": 1,
                    "created_utc": 1653848589.0,
                    "response": "Company is a joke when it comes to support and protecting \"clients\". I lost $ and they told me to go pound sand. File as many complaints as possible. FBI FTC FCC SEC BBB",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iakizy3",
                    "author": "RIPsidhuMooseWala",
                    "score": 1,
                    "created_utc": 1653933760.0,
                    "response": "Good news here 💱💱💱💱💱🥂🥂\n$TROPHY Token is now launched into pancakeswap 🥰🏆🏆🏆🏆🏆🏆 BUY MORE $TROPHY NOW AT VERY LOW PRICE🔅🔅🔅🔅🔅\n✅✅✅✅✅✅\nBUY MORE\nhttps://fairlaunch.trphy.io\n✅✅✅✅✅\nSWAP Now\nhttps://pancakeswap.finance/swap?outputCurrency=0xBaAd7173c7eDd91269F52c32c1d98B523e1852e4\n✅✅✅✅✅✅✅✅✅✅✅\n\nTotal Supply: 280,000 $TROPHY\nLiquidity Locked 🔐 : 90,600 $TROPHY\nLet's get $TROPHY Trending.\nLet's buy more into $TROPHY,\n\n$TROPHY 🏆 to the moon\nWebsite: https://trphy.io\nTG: t.me/trophyprotocol\nTw: twitter.com/trophy_app\nhttp://discord.com/invite/EhGCjvMG44",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaf1dos",
                    "author": "akajifutafe",
                    "score": -1,
                    "created_utc": 1653825125.0,
                    "response": "thank me later🙏❤️ https://www.youtube.com/watch?v=tDZtBzqow6Q",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaccszd",
                    "author": "Nice566",
                    "score": 0,
                    "created_utc": 1653764534.0,
                    "response": "I have encountered the same a month ago. for a much smaller amount $1.00,  I didn’t contact support.  now I will.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iacjj62",
                    "author": "cryptotraderinwork",
                    "score": 0,
                    "created_utc": 1653767736.0,
                    "response": "Just stop using coinbase, they are the worst. When you send an unsupported ERC-20 token or use the wrong network, coinbase doesn't help. Other exchanges do help in these cases. Coinbase has the worst support I ever experienced.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iad3n5q",
                            "author": "Kiwip0rn",
                            "score": 3,
                            "created_utc": 1653777290.0,
                            "response": "Here's an Idea 💡 how about NOT sending unsupported ERC-20 tokens to the Coinbase Custody platform 🤔",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iaef3rh",
                                    "author": "cryptotraderinwork",
                                    "score": 0,
                                    "created_utc": 1653805880.0,
                                    "response": "Here is another idea: how about Coinbase saying that their platform is the best to use for new people, while they don't even provide support for sending unsupported ERC-20 tokens to the Coinbase Custody platform WHILE OTHER EXCHANGES DO PROVIDE THIS SUPPORT.\n\n'Kiwip0rn'",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iae7e9h",
                    "author": "Creepy-Importance-13",
                    "score": 0,
                    "created_utc": 1653800011.0,
                    "response": "Can’t u understand! Get the f out while u can!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaerspq",
                    "author": "pafferreira",
                    "score": 0,
                    "created_utc": 1653817101.0,
                    "response": "My account with Coinbase was \"under review\" and therefore useless for 8 months!\nHey, smarty-pants I only hope the very same happens to you!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaf5mfm",
                    "author": "Glum-Bandicoot8346",
                    "score": 0,
                    "created_utc": 1653827968.0,
                    "response": "I had the worst experience setting up my account with that company. I won’t ever again transact with them. Period. If they were the only option, I’d forego investing in crypto. It’s not worth the stress.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaf71vm",
                            "author": "coinbasesupport",
                            "score": 1,
                            "created_utc": 1653828830.0,
                            "response": "Hey, /u/Glum-Bandicoot8346, that's hard news to stomach, as we want your Coinbase experience to be easy and dependable. If you'd like to talk about what may have gone wrong, we'd love to listen.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iaf6mvk",
                    "author": "ZexieGamingNetwork",
                    "score": 0,
                    "created_utc": 1653828580.0,
                    "response": "Happen to me as well for 111$, so the deal is they say its a prior transaction that is lagging behind but from what i can tell it is a double charge, the support assured me i was not doubled charge.    Mine was a transaction from 2 months ago i even got the product i ordered in the mail so it was payed and the people i got it from said they only see one charge for my card number.. so from what they are telling me is COINBASE covered the 1st transaction(even though i had the money to cover it in my account) and then they charged me 2 months later for it this latest charge does not show up under card transactions , the only place i could find it was under the tax printout you can get, so this is like a overdraft but without the fees, I keep my card locked as well at all times.   To me it looks like coinbase is stealing money from its customers.,",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaf6nm4",
                            "author": "Paid-Not-Payed-Bot",
                            "score": 3,
                            "created_utc": 1653828592.0,
                            "response": "> it was *paid* and the\n\nFTFY.\n\nAlthough *payed* exists (the reason why autocorrection didn't help you), it is only correct in:\n\n * Nautical context, when it means to paint a surface, or to cover with something like tar or resin in order to make it waterproof or corrosion-resistant. *The deck is yet to be payed.*\n\n * *Payed out* when letting strings, cables or ropes out, by slacking them. *The rope is payed out! You can pull now.*\n\nUnfortunately, I was unable to find nautical or rope-related words in your comment.\n\n*Beep, boop, I'm a bot*",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iaf92nl",
                                    "author": "ZexieGamingNetwork",
                                    "score": 1,
                                    "created_utc": 1653829944.0,
                                    "response": "who cares, mr karen",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}