{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uxw0j1",
            "title": "sign up boys",
            "url": "https://www.reddit.com/r/CoinBase/comments/uxw0j1/sign_up_boys/",
            "author": "AL3X230",
            "created_utc": 1653527495.0,
            "score": 0,
            "num_comments": 2,
            "subreddit": "CoinBase",
            "selftext": "Sign up for Coinbase using my link and we can each get CA$12.81 in Bitcoin https://www.coinbase.com/join/thriau_d?src=android-link",
            "stickied": false,
            "comments": [
                {
                    "id": "ia0djk8",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653527495.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uxvw1s",
            "title": "Coinbase support is fast but useless Case# 11972911 & Case# 11976370",
            "url": "https://www.reddit.com/r/CoinBase/comments/uxvw1s/coinbase_support_is_fast_but_useless_case/",
            "author": "idealers",
            "created_utc": 1653527092.0,
            "score": 4,
            "num_comments": 22,
            "subreddit": "CoinBase",
            "selftext": "Coinbase charged my bank twice for the same amount but only one was credited to my coinbase account. I told my bank and they reversed one of the charges. Coinbase proceeded and locked both my coinbase account and coinbase pro account. I tried to get support but they will not even read the complaint all they did is keep rattling about how I need to pay the $509 before my account can be unlocked. Non of these support people will even mention the main issue which is that I was charged twice. I finally was able to send USDC from another wallet to settle the reversal and now they have closed the case even though they still owe me $509. I uploaded documents and all but non of them will even acknowledge it. This is terrible.",
            "stickied": false,
            "comments": [
                {
                    "id": "ia0ehly",
                    "author": "Kiwip0rn",
                    "score": 4,
                    "created_utc": 1653527926.0,
                    "response": "🙄",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia0fp0n",
                    "author": "chonzey3043",
                    "score": 2,
                    "created_utc": 1653528467.0,
                    "response": "yes their support is completely useless. I got a transfer hold on my account. A ticket was opened then closed. As a customer it was never explained to me what the transfer hold is, or what the ticket was pertaining to or what the conclusion of the ticket was when it was closed.. what kind of business practice is this.. My trust in coinbase has been erased I cannot use your service any more in fear of my funds being on hold with no explanation as to why.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia0gycb",
                            "author": "idealers",
                            "score": 2,
                            "created_utc": 1653529049.0,
                            "response": "Frankly this is my first issue with them but it is obvious that their customer service is populated with call center people with little knowledge of the business itself. They just rattle out what they have been told to say but never really address the case. They closed my support request while they still have not solved the issue that they debited my bank account twice for the same amount and only put one in my coinbase account.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia0jgm0",
                                    "author": "coinbasesupport",
                                    "score": -2,
                                    "created_utc": 1653530222.0,
                                    "response": "Unfortunately, we're unable to review the account details and provide information regarding an account via social media. The agent assigned to your case will have much better tools for this task, and have the ability to retrieve this information for you. Usually, once pertinent and sufficient information has been provided, the existing case is considered closed and resolved, but if you have another concern that is not related to the previous case, you may always open a new one. We appreciate your patience and understanding.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia0jssb",
                                            "author": "idealers",
                                            "score": 4,
                                            "created_utc": 1653530381.0,
                                            "response": "you sound just like them. I opened a support case because I was charged twice. This was never addressed or resolved and now the case is closed. How many times do I have to open a case for the same issue? I have always thought coinbase an American company will be different from the others but I see it is no different and could be worst than some",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia0nnxh",
                                                    "author": "coinbasesupport",
                                                    "score": 0,
                                                    "created_utc": 1653532199.0,
                                                    "response": "We understand where you're coming from, idealers! As much as we would like to continue supporting you here on social media, further communication about your existing case can only be made via email only. Thank you for your cooperation.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "ia0ol93",
                                                            "author": "idealers",
                                                            "score": 1,
                                                            "created_utc": 1653532633.0,
                                                            "response": "Thanks was not really expecting support here. Was just letting others know about my experience.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "ia0q7ca",
                                                                    "author": "coinbasesupport",
                                                                    "score": 1,
                                                                    "created_utc": 1653533395.0,
                                                                    "response": "Understood! Let us know though if there's anything else you want us to follow up for you. Thank you!",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "ia24olg",
                                                                            "author": "idealers",
                                                                            "score": 1,
                                                                            "created_utc": 1653569262.0,
                                                                            "response": "If you really want to help you can tell whoever is assigned to my case to at least take a look at my bank screenshots and address the double debit by Coinbase. That is all I ask.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "ia25qbt",
                                                                                    "author": "coinbasesupport",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653569803.0,
                                                                                    "response": "Thanks for letting us know, u/idealers.\n\nWe've reviewed your case, and we can see that our team is looking into this. They will reach out to you if they need any further information.\n\nWe appreciate your patience while we resolve this.",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia0cxo3",
                    "author": "bluett1",
                    "score": 1,
                    "created_utc": 1653527210.0,
                    "response": "Terrible with direct deposit",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia245l3",
                            "author": "Connect-Ad-1088",
                            "score": 1,
                            "created_utc": 1653568982.0,
                            "response": "i have had no problem with direct deposit since i started it with cb.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia24kz5",
                                    "author": "bluett1",
                                    "score": 1,
                                    "created_utc": 1653569210.0,
                                    "response": "Give it time u will",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia0mwo3",
                    "author": "gold4829",
                    "score": 1,
                    "created_utc": 1653531834.0,
                    "response": "File a free online complaint with CFPB  this fed agency is gold and get results.  I used them myself and it works",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia0lxli",
                    "author": "BillyThaKidder",
                    "score": -1,
                    "created_utc": 1653531377.0,
                    "response": "This is HORRIBLE! I have had some issues with support here also. I'm so sorry man, it sucks. I do have a suggestion though. In whatever county you live in, file a Small Claims action against Coinbase. It only costs $63 here in my county in NC. Hi d say chances are, they do NOT send a representative to defend the case, and you will get a judgment for $509, or for however much you have been damaged - keep in mind that Small Claims actions (in my state) are only for disputes under $10,000. Sounds to me like you e gone thru a lot, and there's no telling how much you would've gained if that issue had not occurred. I'd file the action for $9,500, and bring all of the correspondence to your court date. Most of the time, there are no lawyers in small claims court. You present your evidence, then the other side presents their's. If they do not show up, the Judge will grant you a default judgment for however much you are asking for in the complaint. I'm pretty sure you'll have to file the action, then give notice by mailing a copy of the filed complaint to the address of the Registered Agent of Coinbase. You'll have to find out that address on your own, but you'll also (most likely) need to send notice (copy of filed complaint) to the Secretary of State's office in your state (along with $10 or $20 per defendant = 1) check their website to make sure you've done it properly, I promise it's not hard. Good luck. Feel free to message me if you need to.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia0coc5",
                    "author": "AutoModerator",
                    "score": 0,
                    "created_utc": 1653527093.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia0cydr",
                            "author": "idealers",
                            "score": 0,
                            "created_utc": 1653527219.0,
                            "response": ">Case# 11972911 & Case# 11976370",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia0gamb",
                                    "author": "coinbasesupport",
                                    "score": 0,
                                    "created_utc": 1653528746.0,
                                    "response": "Hi idealers! Thank you for following up your case with us. We can see that our specialists replied to your case #11972911 and 11976370, 3 hours and 22 hours ago respectively. We can see that you have also responded to one of the emails. Please continue doing so if you have any questions or other concerns. We appreciate your patience.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia0gksh",
                                            "author": "idealers",
                                            "score": 4,
                                            "created_utc": 1653528876.0,
                                            "response": "When I responded to the last email an auto-response came back and said that the case is closed and that I can open a new case all over again. Also throughout all the email correspondence non of your support people bothered to look into the fact that my bank account was debited twice. I uploaded screen shots from my bank account multiple times and it was never acknowledged or addressed",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}