{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ux9f0w",
            "title": "Notice of Account Closure; No Access, No Way to Reach Customer Support",
            "url": "https://www.reddit.com/r/CoinBase/comments/ux9f0w/notice_of_account_closure_no_access_no_way_to/",
            "author": "dogearific",
            "created_utc": 1653453079.0,
            "score": 0,
            "num_comments": 8,
            "subreddit": "CoinBase",
            "selftext": "Received notification of my account suddenly being closed with no warning or explanation as to what or why. Spent the last hour trying to get a hold of someone on the phone, email, chat, anything. I can't believe they can do this unilaterally and not provide an explanation, claim/appeals process, nothing. I can't even log in to my account and try to determine what the possible issue is. Hope I can get some assistance through this process.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9wbz6i",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653453079.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9wcgds",
                    "author": "coinbasesupport",
                    "score": 1,
                    "created_utc": 1653453373.0,
                    "response": "Hi u/dogearific, help's here! Please send us a support case [here](https://help.coinbase.com/en/contact-us). Once done, let us know the support case number you'll receive via email, so we can look into your account. Thanks!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9wdctx",
                            "author": "dogearific",
                            "score": 0,
                            "created_utc": 1653453925.0,
                            "response": "I can't find the proper drop down box to file a ticket for an account closure. What series of boxes do I click after selecting the coinbase product?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9wdyy2",
                                    "author": "coinbasesupport",
                                    "score": 1,
                                    "created_utc": 1653454309.0,
                                    "response": "Can you try this [link](https://help.coinbase.com/en/contact-us?product=coinbase&topic=managing_my_account&category=Account_Closure&subCategory=close_account)? Everything here is already selected. Please make sure as well to enter the email address linked to your Coinbase account and a brief description of your concern. Keep us posted!",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9weycj",
                                            "author": "dogearific",
                                            "score": 0,
                                            "created_utc": 1653454941.0,
                                            "response": "Thank you, just filed the report. My case # is:\n\n11977548",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9wfr3l",
                                                    "author": "coinbasesupport",
                                                    "score": 1,
                                                    "created_utc": 1653455459.0,
                                                    "response": "Got it, thanks! Looks like someone from the relevant team already responded to your case. Kindly check your inbox, and if you have further question, we suggest replying to the same email thread, so they can look into it right away, Thanks!",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9wfk2d",
                    "author": "Kiwip0rn",
                    "score": 1,
                    "created_utc": 1653455331.0,
                    "response": "🙄 Stop violating the ToS. \n\nAnd a business retains the rights to refuse to service (except to protected individuals). No explanation is necessary.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}