{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "v1j4gr",
            "title": "Coinbase Support not doing anything about my case",
            "url": "https://www.reddit.com/r/CoinBase/comments/v1j4gr/coinbase_support_not_doing_anything_about_my_case/",
            "author": "fadarex",
            "created_utc": 1653975297.0,
            "score": 1,
            "num_comments": 12,
            "subreddit": "CoinBase",
            "selftext": "I am very frustrated as I am writing this message. I opened a case on the 20th of May with regards to the fact that I was unable to login to my account despite the fact that I used my device. I even performed a password change as well. I then got a response that they were working on my case and will get back to me.  I checked my email today and it said that case was closed. I do not understand how the case can be closed when the issue was not resolved. I am still unable to login to my account.  It is still saying account temporarily restricted. I need to get this matter resolved because all my live savings is on the platform and I am literarily unable to have any access to any funds for my day to day activities. This is causing me a lot of stress and affecting my mental health. Please help me resolve this issue so that I can access my account. The number to the old case is: 11932328. That case was not resolved and now I have to open a new case on the same issue. I hope to get this resolved as soon as possible. The case number to new case is: 12041812. I cannot understand how they can close a case when it has not been resolved",
            "stickied": false,
            "comments": [
                {
                    "id": "iamygrm",
                    "author": "AcademicMistake",
                    "score": 2,
                    "created_utc": 1653981614.0,
                    "response": "You cant blame coinbase because you invested your day to day funds in crypto, you should of known the risks, if the price drops, are you going to also blame coinbase because you cant afford your bills ?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ian18mm",
                            "author": "fadarex",
                            "score": 0,
                            "created_utc": 1653984096.0,
                            "response": "I dont think you are getting the point. I understand the risk and I am not blaming coinbase for my investment decisions. What I am blaming coinbase for is holding my money and not allowing me access to my account, and not telling me what I need to do to solve the issue. Perhaps if you read my message clearly, you will understand that the problem was that their support was useless is addressing my issue.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ian57ut",
                                    "author": "svscorp",
                                    "score": 1,
                                    "created_utc": 1653987743.0,
                                    "response": "Have in somewhat similar situation. Scanning this subreddit I noticed that support is selectively responding threads. Have no access / no responses either.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iamqncp",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653975297.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ian67m3",
                    "author": "Alcolawl",
                    "score": 1,
                    "created_utc": 1653988663.0,
                    "response": "Call them.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iani34x",
                    "author": "fx9TMK",
                    "score": 1,
                    "created_utc": 1653997948.0,
                    "response": "The old “I invested my life savings and can’t access my account now” post. It’s a classic. I guess the whole, never invest more than you can afford to lose thing wasn’t part of your investing plan.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iamr698",
                    "author": "fadarex",
                    "score": 0,
                    "created_utc": 1653975682.0,
                    "response": "Old case closed without resolution: 11932328\n\nnew case: 12041812",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iamsvid",
                    "author": "Kiwip0rn",
                    "score": 0,
                    "created_utc": 1653976979.0,
                    "response": "Because it is empty due to your ability to provide protection with your account.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}