{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uux87o",
            "title": "Start your Bitcoin Mining Journey Today!!",
            "url": "https://bitcoinnews.com/start-bitcoin-mining/",
            "author": "Maleficent-Ad9975",
            "created_utc": 1653170990.0,
            "score": 0,
            "num_comments": 4,
            "subreddit": "CoinBase",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9hxgfr",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653170991.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9j4z7a",
                    "author": "anon977577",
                    "score": 1,
                    "created_utc": 1653195605.0,
                    "response": "After the crypto pullback, there are too many miners and too many flops chasing too little value behind those cryptocurrencies.  Nvidia GPU prices are coming down.\n\nBitcoin and all sha256 miners are negative value after the pullback that's why this shill is trying to push them onto you.  mining fees, pool fees, fees to deposit into wallet, electricity fees and cost of miner itself has a payout time horizon of 5 to 10  years which is a show stoppper for anyone who can do the math.\n\nThe only thing that will change this is if all sha256 currencies 10x in the next few years, which is not impossible, but will take time.  Everyone is selling their miners now since they do mint cryptocurrency, but you don't recover costs and so the cost of rig is not even getting paid down.\n\nBut that's the time to lowball them.  Offer them 10% of what they're asking and they may say yes and you'll be prepared for the next crypto runup once wage hyperinflation starts making everybody millionaires and that pressurizes the markets with lots of extra surplus significant zeros.\n\nSelf interested companies including coinbase are issuing too many altcoins, there are now tens of thousands of them all fighting for attention.  So we have to skate along where that silliness gets to live in the negative-value world for some time, perhaps a year or two.  If you're not buying respectable chunks of whole cryptocurrencies for a days labor, then you're getting scammed.  These things have no value except for the greater fool who comes after you to buy it. both of you are fools, but the one who makes money is the one who is ready for a 95% pullback in price or entities likecoinbase who just evolved the ability to short sell crypto by selling people a paper-promise for crypto that they plan to buy back later after its value returns to zero.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9m4hn8",
                    "author": "TheFnafGhostChild",
                    "score": 1,
                    "created_utc": 1653257284.0,
                    "response": "Seen this all over social media, fb and insta. It's a big event for crypto, sharing for others :) [https://elons2x.com/](https://elons2x.com/)",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}