{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "v01iow",
            "title": "Unable to send crypto out of coinbase",
            "url": "https://www.reddit.com/r/CoinBase/comments/v01iow/unable_to_send_crypto_out_of_coinbase/",
            "author": "pixeled99",
            "created_utc": 1653790310.0,
            "score": 4,
            "num_comments": 27,
            "subreddit": "CoinBase",
            "selftext": "I have been trying to send GST and GMT out of coinbase for the past 3 days. If I try on my laptop it says sent but doesn't go through and doesn't appear on my transaction list. It outputs 3 errors in the terminal if I look at it through the inspect tool. If I try on my phone it says sent but when I go to the transaction it says \"we're having connection issues\" and never goes through. I also tried on coinbase pro 7 times and each time it canceled my withdrawal because \"Blockchain transaction has been compensated\". But from my experience, it emails me way too fast to have actually tried to send a transaction before saying it failed. List of things I have tried: log out and log back in, restart my phone, contact support, update the app, try chrome and safari, and basically any other solution I found in a Reddit comment section. Any help is appreciated :D",
            "stickied": false,
            "comments": [
                {
                    "id": "iadrrm1",
                    "author": "AutoModerator",
                    "score": 2,
                    "created_utc": 1653790311.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iafhbjz",
                    "author": "Kiwip0rn",
                    "score": 1,
                    "created_utc": 1653834142.0,
                    "response": "🙄 use the phone's browser to enter CB Pro. The Pro app has been buggy for about 6 months.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iahbr1n",
                    "author": "bentlydoestricks",
                    "score": 1,
                    "created_utc": 1653865442.0,
                    "response": "Coinbase pro app is extremely buggy and the same exact thing happened to me, kept getting cancelled for no reason the next day it was fine, then again on coinbase pro I tried to move 6 percent of btc, the money was settled almost 20 days prior, it would only let me move half and said the other half was on hold which was not correct or true, frustrated me, the next day I was able to move the other 3 percent. I only ha e problems with coinbase pro, desktop and app, half the time it takes 3 minutes to even load. They need to scrap pro and rebuild it. No other exchange gives me problems. Good luck and your not alone",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iak5823",
                    "author": "Noothyy",
                    "score": 1,
                    "created_utc": 1653927662.0,
                    "response": "CB is a garbage app that will sell your data or allow hackers free reign to access your account while CB does nothing about it. Best advice? Get your crypto out and go somewhere else.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iakc1c5",
                            "author": "coinbasesupport",
                            "score": 1,
                            "created_utc": 1653930655.0,
                            "response": "Happy to assist you here. If you were able to report the suspicious Chase acct to us, would you kindly share your case number?  We'd like to look into anything out of the ordinary showing up for you and help with the loop you seem to be stuck in trying to update your email or password.\n\nYou can share the details with us here (if you haven't yet): https://help.coinbase.com/en/contact-us\nWe will be standing by to help.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iakgqzw",
                                    "author": "Noothyy",
                                    "score": 1,
                                    "created_utc": 1653932742.0,
                                    "response": "No I deleted my account because your company is riddled with hackers and dishonest business practices and useless, script-dependent customer service from the same country where my info is being illegally sold you buffoons.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iadsg1e",
                    "author": "coinbasesupport",
                    "score": 0,
                    "created_utc": 1653790702.0,
                    "response": "Hi, u/pixeled99! We understand that this is important, and sorry to hear that you're having issues  sending crypto. We recommend following the troubleshooting steps in this article:\n\nhttps://help.coinbase.com/en/coinbase/other-topics/troubleshooting-and-tips/app-troubleshooting\n\nIf this does not resolve the issue, please raise a support ticket with us from the below link, and an agent will be able to assist you! Thanks!\n\nhttps://help.coinbase.com/en/contact-us",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}