{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uyn8s0",
            "title": "Coinbase: shady, predatory bottom feeding company",
            "url": "https://www.reddit.com/r/CoinBase/comments/uyn8s0/coinbase_shady_predatory_bottom_feeding_company/",
            "author": "fUc_kyourhat",
            "created_utc": 1653616309.0,
            "score": 1,
            "num_comments": 27,
            "subreddit": "CoinBase",
            "selftext": "1.) In the decentralized world, when your money disappears and the support goes along with it, we call it a rugpull. When coinbase steals your funds and freezes them until an undetermined later date with no response from customer support, this is called \"check your internet connection\". If coinbase survives the bear market, they will probably sink in the storm of class action lawsuits coming to them due to their treatment of their customers and customers' money when some form of regulatory clarity is reached. I feel safer handing my money to the crackhead up the street with three first names.",
            "stickied": false,
            "comments": [
                {
                    "id": "ia6k557",
                    "author": "Connect-Ad-1088",
                    "score": 3,
                    "created_utc": 1653651765.0,
                    "response": "“Life savings gone”. I no be nowing write no be strong suit",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia55un6",
                    "author": "Kiwip0rn",
                    "score": 9,
                    "created_utc": 1653616783.0,
                    "response": "🙄 okays 👍🙄 thanks 2 Karma account that said they left Coinbase 25 days ago but is still trolling the CB boards.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia5e2go",
                            "author": "Substantial_Boot3453",
                            "score": -9,
                            "created_utc": 1653620871.0,
                            "response": "What's the coinbase salary for the year?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia5hk1b",
                                    "author": "Kiwip0rn",
                                    "score": 6,
                                    "created_utc": 1653622673.0,
                                    "response": "🙄",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia74l2u",
                                            "author": "jhanon76",
                                            "score": 2,
                                            "created_utc": 1653662112.0,
                                            "response": "Better watch out...this account is coming after you and your evil company at r/gyencoinbasevictims",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia7shu7",
                                                    "author": "Kiwip0rn",
                                                    "score": 2,
                                                    "created_utc": 1653671949.0,
                                                    "response": "🤣 those GYEN fan bois are entertaining, there might not be a dumber set of \"Investors\" 🙄 to have ever to exsist.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia5ua08",
                    "author": "CVP11",
                    "score": 1,
                    "created_utc": 1653630660.0,
                    "response": "they keeping my money hostage too",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia7y77e",
                    "author": "fUc_kyourhat",
                    "score": 1,
                    "created_utc": 1653674356.0,
                    "response": "Actually I didn't stake eth, and I'd have left coinbase 2 years ago if there was a way to semi conveniently on board fiat that didn't take 3-7 days available in the region im at. I'm mad that a- if eth is 1500 coinbase sells it to you for 1590 plus a fee, b- about 70 percent of the time that I onboard fiat, the instant I try to interact with it the app begins saying \"check your internet connection\" (common problem that lots of people experience that has everything to do with coinbase app and nothing to do with our internet connections and has been an ongoing issue since november, and which has never occurred while i try to actually put money into the platform), c- every solana transaction inbound or outbound gets held or frozen for anywhere between an hr and 3 days, d- every one of their services is misrepresented to take advantage of newer people who don't know any better, like their interest bearing coins receiving a quarter of the interest that the networks actually pay users (ie atom receiving 5 percent apy instead of the standard 17 percent), e- that I usually have to pay a fee ontop of other fees to correct issues caused by coinbase's app, f- any time I have ever attempted to deal with anything monetary or technical with coinbase support, they make things extremely difficult, lock family out of their accounts (I have yet to experience this problem but my family has experienced it several times)....these are volatile assets. The two days that coinbase decides to hold your funds hostage or have mysterious and conveniently timed technical issues cost their users thousands, sometimes hundreds of thousands of dollars. I have yet to experience any of these issues with binance or ftx or mexc or kucoin or any other cex- the only reason I use coinbase over those is because my bank doesn't flag my account when I use coinbase and they do with the others. To be real- I don't know what is going on with coinbase, but I do know their practices are shady and I feel resentful and taken advantage of every time I am stuck using their services. Luckily I have come to a place in my crypto adventures where I rarely need to onramp fiat and so rarely have to use them, but I definitely hope that they either adjust their practices or that there comes a day when people realize that paying 4 dollars to buy 20 dollars worth of crypto is batshit crazy and predatory.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia5cwn4",
                    "author": "bluett1",
                    "score": -6,
                    "created_utc": 1653620273.0,
                    "response": "Agreed",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia5cyo7",
                    "author": "bluett1",
                    "score": -8,
                    "created_utc": 1653620303.0,
                    "response": "That s y they had bad earnings",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia5dtxj",
                            "author": "Arzharkhel",
                            "score": 10,
                            "created_utc": 1653620743.0,
                            "response": "The ignorance that plagues crypto investors is daunting.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia5w0lg",
                    "author": "ColdColdMoons",
                    "score": -1,
                    "created_utc": 1653631936.0,
                    "response": "They still have an article hit piece on iota from 2020 and list no fee free coins. IOTA dev called them out... still nothing. They suppress coins and promote scams like Luna.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia54vu3",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653616309.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia9kzc8",
                    "author": "0To100Baby",
                    "score": 1,
                    "created_utc": 1653702724.0,
                    "response": "FanStream-a decentralized livestreaming platform.Connects crypyo users together in the live streaming world and the Metaverse space.\nFeature:\n-Live to earn&See to earn\n-Create your own NFT\n-Game Center\n*Have many Big partnerships🔥🔥\nTg:https://t.me/FanStream_Official\nTw:@Fanstream_Meta",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia746y7",
                    "author": "jhanon76",
                    "score": 0,
                    "created_utc": 1653661944.0,
                    "response": "Class action lawsuits because you staked eth?  Grow up",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia8bxmw",
                    "author": "Limp-Cry-8289",
                    "score": 0,
                    "created_utc": 1653680417.0,
                    "response": "They also keept my money hostage. I left cb as soon as I was able to. Wish I was warned before",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}