{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uuv5rg",
            "title": "Coinbase Customer Support Help?",
            "url": "https://www.reddit.com/r/CoinBase/comments/uuv5rg/coinbase_customer_support_help/",
            "author": "LSincla",
            "created_utc": 1653164442.0,
            "score": 2,
            "num_comments": 95,
            "subreddit": "CoinBase",
            "selftext": "I recently purchased a Ledger Nano X to move my crypto to cold storage. I made a test transaction of $10 with no issues to my Nano Ledger and back. When I attempted to withdraw the full amount of 50k XRP I forgot to copy my Ledger address and pasted my Coinbase address from the previous transaction. Since Ledger does not have a tag I used “1234”. This worked the first time as I was sending to Ledger. Now my 50K XRP worth $20,000+ is gone. This is a simple issue to fix as the XRP was sent to Coinbase’s XRP address and not the wallet of another customer or exchange. Coinbase would not have to “take” the XRP from another customer. All they need to do is match my transaction to the transaction in their wallet to return my funds. I don’t see how a company hoping to go public can possibly condone stealing a customers money. I’ve been a loyal customer and hope to stay that way. I just want the basic decency of correcting an easily fixed problem. Case#11914895",
            "stickied": false,
            "comments": [
                {
                    "id": "i9hs2pe",
                    "author": "Intern_Ill",
                    "score": 15,
                    "created_utc": 1653168206.0,
                    "response": "I'm sorry, but they didn't steal anything. You fucked up.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9i2vm7",
                            "author": "One8s7n",
                            "score": 5,
                            "created_utc": 1653173812.0,
                            "response": "Oh man that's fn brutal. Like amber heard cross examination brutal",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9jwb6m",
                            "author": "shamar_danowitz",
                            "score": 1,
                            "created_utc": 1653219040.0,
                            "response": "I almost did the same thing. But for some reason i double checked my btc ledger address and it changed from last test transaction. Sorry for your loss. Atleast you know for next time. New wallet address every time you send to a ledger",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9ht4t4",
                            "author": "LSincla",
                            "score": -4,
                            "created_utc": 1653168757.0,
                            "response": "If I sent XRP to the COMPANIES wallet by mistake and they choose not to return it to me “just because” that is in fact theft.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9ih6p0",
                                    "author": "jhanon76",
                                    "score": 4,
                                    "created_utc": 1653181589.0,
                                    "response": "Seems obvious to you but this isn't how crypto works.  Sorry you had to learn the hard way but the individualism and anonymity are the point of crypto",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9ilfrd",
                                            "author": "LSincla",
                                            "score": -5,
                                            "created_utc": 1653183871.0,
                                            "response": "Anonymity? There is literally a time stamp of the transaction  time with the exact amount of XRP leaving my wallet and entering Coinbase’s wallet. Pretty obvious where it came from. Not magic. Other exchanges have reversed these type of transfers. If it was from my wallet to another customers wallet then obviously it would be different story. The “address” is like a physical address. This example being Coinbase. The “tag” is the equivalent of the apartment number. Since Ledger doesn’t have a tag number since it’s an individual wallet my transaction doesn’t have a valid one. By default it goes to Coinbase’s wallet. It’s a simple matter of matching transactions.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9ipj9y",
                                                    "author": "jhanon76",
                                                    "score": 4,
                                                    "created_utc": 1653186094.0,
                                                    "response": "Crypto does not operate in \"obvious\"...no other exchanges also don't override these situations either.  I've lost money this way myself.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9jiznm",
                                                            "author": "LSincla",
                                                            "score": 1,
                                                            "created_utc": 1653207283.0,
                                                            "response": "I’m not asking to override a transaction. & yes it does in fact work like this. All the down votes care to actually explain how I’m wrong? Coinbase itself even states that it may be able to recover funds if this exact scenario were to happen if you were sending from another exchange.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9kcugt",
                                                                    "author": "jhanon76",
                                                                    "score": 1,
                                                                    "created_utc": 1653228824.0,
                                                                    "response": "Everyone already explained it.  Have a nice date",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9lcod2",
                                                                            "author": "LSincla",
                                                                            "score": 1,
                                                                            "created_utc": 1653244452.0,
                                                                            "response": "No one explained anything. Every comment is “you messed up. It’s magical Internet money.” Seems like I’m the only one that’s even laid out a basic understanding of how the wallet/tag system works. Literally not one rebuttal or factual statement whatsoever in regards to why the transaction can’t be corrected",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i9ljuve",
                                                                                    "author": "jhanon76",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653247708.0,
                                                                                    "response": "Coinbase did: https://help.coinbase.com/en/coinbase/trading-and-funding/sending-or-receiving-cryptocurrency/destination-tag-memo-faq",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i9imuyb",
                                                    "author": "Intern_Ill",
                                                    "score": 6,
                                                    "created_utc": 1653184641.0,
                                                    "response": "You fucked up. Period. I'm not trying to be a dick. But take responsibility for your own actions here. Be an adult.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9jioal",
                                                            "author": "LSincla",
                                                            "score": 2,
                                                            "created_utc": 1653206990.0,
                                                            "response": "Yeah I messed up but I’m not taking a $20k loss. The fuck?",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9hupmu",
                    "author": "cmdrshepherd1993",
                    "score": 8,
                    "created_utc": 1653169576.0,
                    "response": "Take responsibility pal, you messed up. Going too fast or something. It’s not their fault. You gonna blame Coinbase for something you did inside your cold wallet? DUDE lol 😂 noooo you do not get to do that.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9hvi0k",
                            "author": "LSincla",
                            "score": -1,
                            "created_utc": 1653169982.0,
                            "response": "Reading comprehension? I sent it FROM Coinbase to the exact same Coinbase address -tag (because the cold wallet doesn’t require a tag) I’m not “accepting” an easily reversed $20k loss. All Coinbase XRP wallets have the same address. The tag is what differentiates the wallets. XRP tags are 9 digits. Since the tag I entered is not 9 digits it is sitting in Coinbases own wallet. The idea that not returning it isn’t theft is ludicrous. It would be like a clerical error placing $20,000 in your own private checking account, you going to the bank and withdrawing it, then refusing to give it back because the bank should “accept responsibility”. How about holding companies customer service accountable??",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9ihamx",
                                    "author": "jhanon76",
                                    "score": 5,
                                    "created_utc": 1653181651.0,
                                    "response": "Every exchange is exactly the same.  Every single one.  XLM has the same issue where you need a tag and you are shit outta luck without it.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9hyvgj",
                    "author": "Turbulent-Ad-6845",
                    "score": 6,
                    "created_utc": 1653171727.0,
                    "response": "Ouchsauce",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9iie2r",
                    "author": "Kiwip0rn",
                    "score": 4,
                    "created_utc": 1653182231.0,
                    "response": "🙄 You screw up, and it is Coinbase's fault? \n\nYou shouldn't have a Ledger or any Crypto outside of a Centralized Exchange, if you need someone to hold your hand.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ilkkj",
                            "author": "LSincla",
                            "score": 0,
                            "created_utc": 1653183942.0,
                            "response": "No the mistake if my fault. But if my funds aren’t returned it is 100% a shitty thing to do.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9ir8o1",
                                    "author": "Kiwip0rn",
                                    "score": 1,
                                    "created_utc": 1653187060.0,
                                    "response": "No it isn't shitty, and you shouldn't get the coins back. \n\nIf you don't know what you are doing, you shouldn't be moving coins around. You have demonstrated that you are not capable of Self Custody, you want the Centralized Entity to help you.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9ikzch",
                    "author": "TennisBasic9645",
                    "score": -1,
                    "created_utc": 1653183626.0,
                    "response": "Anything easy is difficult for Coinbase. I doubt they would understand your problem or try to fix a simple error on your part.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9hkkka",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653164442.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9hkp3a",
                            "author": "LSincla",
                            "score": 0,
                            "created_utc": 1653164503.0,
                            "response": "Case#11914895",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9hm3vj",
                                    "author": "coinbasesupport",
                                    "score": 8,
                                    "created_utc": 1653165216.0,
                                    "response": "Thank you for sharing those details on the XRP send from your Nano u/LSincla.\n\nWe have checked up on your case and can see we were able to get this to the correct team and emailed you an update on May 19th of the actions taken and the time frame to review the transaction. We understand the frustration and difficulty caused by the address issue, and are working to get back to you with any next steps. Appreciate your patience while we continue working on the case, and if you do have any further questions or information, please reply directly within the email case thread.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9iwbm8",
                    "author": "SouthSeaCo1012",
                    "score": 1,
                    "created_utc": 1653189880.0,
                    "response": "Should have bought a digital hamburger.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9j8xuc",
                    "author": "Additional_Plan8781",
                    "score": 1,
                    "created_utc": 1653198623.0,
                    "response": "YouTube does the trick.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9mamlk",
                    "author": "JordanRPE",
                    "score": 1,
                    "created_utc": 1653260357.0,
                    "response": "Coinbas sucks. I wanted to buy more bitcoin, done if for years thru them, for some reason a box popped up that I can't buy. \nSend an email asking why not.  They told me to check back with them on June 28 2022. AND they told me \"we can't tell you why you can't buy anything right now\"\n\nMoved my bitcoin away from them in less than 10 minutes.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9mc2ra",
                            "author": "coinbasesupport",
                            "score": 1,
                            "created_utc": 1653261106.0,
                            "response": "Hi, u/JordanRPE! We understand that this is important, and we'd like to check on your case. Please provide us your support case number. Thanks!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9mckbl",
                    "author": "JordanRPE",
                    "score": 1,
                    "created_utc": 1653261363.0,
                    "response": "Coinbase Support 11915474",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9mehwd",
                            "author": "coinbasesupport",
                            "score": 1,
                            "created_utc": 1653262371.0,
                            "response": "Thanks for the case number, u/JordanRPE! We checked the case, and we see that this is already being handled by the relevant team. Although we are unable to change the decision/information provided to you, we recommend that you continue to communicate with us via email. Your case has been noted with your reach out here. Thanks!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9n43d5",
                    "author": "JordanRPE",
                    "score": 1,
                    "created_utc": 1653275629.0,
                    "response": "But the decision doesn't make any sense.\nWHY CANT I BUY MORE BITCOIN? What happened between 2 weeks ago and now?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ib65s",
                    "author": "VloooolV",
                    "score": -2,
                    "created_utc": 1653178314.0,
                    "response": "Same thing happened to me yesterday. I now have mu crypto stuck in the coinbase wallet and I can’t even transfer it out for some reason. \n\nPlus coinbase support is not available in my country, so I can’t even do anything. Such a scummy company.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9i1vkj",
                    "author": "Tall_Run_2814",
                    "score": 0,
                    "created_utc": 1653173290.0,
                    "response": "XRP hasn’t been listed on Coinbase for 2 years…",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9i72fl",
                            "author": "coinbasesupport",
                            "score": 3,
                            "created_utc": 1653176053.0,
                            "response": "Hello there, u/Tall_Run_2814. XRP is a supported asset across Coinbase's platforms such as Coinbase Pro, Coinbase retail and Coinbase wallet. \n\nGiven the SEC’s recent action against Ripple, trading on our XRP order books has been suspended in all regions. You're still able to send or receive XRP. While XRP funds will remain safely stored in your account after the trading suspension, you will not be able to buy, sell, or convert. There will be no impact to Coinbase Custody or Coinbase Wallet at this time. You may check this reference - https://help.coinbase.com/en/coinbase/getting-started/crypto-education/xrp-xrp-faq. Thank you!",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9i2mg2",
                            "author": "LSincla",
                            "score": 2,
                            "created_utc": 1653173678.0,
                            "response": "You can still transfer it to and from Coinbase.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}