{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "u93bvw",
            "title": "Coinbase card deactivated for over 24 hours with no support",
            "url": "https://www.reddit.com/r/CoinBase/comments/u93bvw/coinbase_card_deactivated_for_over_24_hours_with/",
            "author": "ThaiGQ",
            "created_utc": 1650592356.0,
            "score": 3,
            "num_comments": 41,
            "subreddit": "CoinBase",
            "selftext": "My Coinbase card has been deactivated for over 24 hours for no apparent reason. I've called live support for both the US Card and Accounts departments and they each refer me to the other. Neither department can tell me why my card is being temporarily suspended. The live support agents from the US Card department say my card is still active and the support agents from the Accounts department say they can't see any reason my account would be suspended\n\nAn agent in the Accounts department escalated my claims over the phone last night (04/20/2022), and said I would receive a confirmation email within 5-10 minutes and I have yet to receive one. I called again and a second agent recommended I send a message to the help desk with my case #. I've done so and all I've gotten so far is an automated message saying that it's been received.\n\nThis is one of the worst experiences I've had with a card. I have a fairly significant amount of money loaded on there to pay my monthly bills and now I don't have enough in my other accounts to make the payments.",
            "stickied": false,
            "comments": []
        },
        {
            "id": "tw4rj9",
            "title": "Emptied my wallet",
            "url": "https://www.reddit.com/r/CoinBase/comments/tw4rj9/emptied_my_wallet/",
            "author": "Sea-Marzipan1550",
            "created_utc": 1649086036.0,
            "score": 3,
            "num_comments": 63,
            "subreddit": "CoinBase",
            "selftext": "Someone was able to transfer all my money from my wallet to theirs. I can see it on Poloyscan and the address it was sent to. Coinbase can do nothing as I was told once it gets on the block chain it’s gone. They suggested I contact the person who received my money and ask them to send it back to me. Yeah right I’m sure that’s exactly what they’ll do. I’m out $6,000+ anyone have any ideas to help me get back my money???  Coinbase suggested I contact the FBI.",
            "stickied": false,
            "comments": [
                {
                    "id": "i3d33q8",
                    "author": "maxiepaxie92",
                    "score": 4,
                    "created_utc": 1649086318.0,
                    "response": "Any clue how someone got hold of your keys?",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "ui4dv6",
            "title": "Says payment pending when it has already went out of my bank!",
            "url": "https://www.reddit.com/r/CoinBase/comments/ui4dv6/says_payment_pending_when_it_has_already_went_out/",
            "author": "ItalianSausage696969",
            "created_utc": 1651663678.0,
            "score": 6,
            "num_comments": 67,
            "subreddit": "CoinBase",
            "selftext": " **Case# 11649216** \n\nadvanced traded and now its says:  \n\n# Payment Pending\n\nWe are still waiting for funds from a recent payment. Your account will be restored as soon as we receive funds.\n\n&#x200B;\n\n&#x200B;\n\nWhyyyyyyyyy?",
            "stickied": false,
            "comments": [
                {
                    "id": "i7aes95",
                    "author": "unvieledloki",
                    "score": 5,
                    "created_utc": 1651670441.0,
                    "response": "just because it left you bank, doesnt mean it instantly shows in theirs,   they need to verify the funds are received on their end first",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7a6gdn",
                    "author": "Steam-O",
                    "score": 3,
                    "created_utc": 1651666199.0,
                    "response": "Give it a minute",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7ab59b",
                    "author": "OpticallyMosache",
                    "score": 3,
                    "created_utc": 1651668683.0,
                    "response": "Same",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7grhtk",
                    "author": "Logical_Release_1736",
                    "score": 3,
                    "created_utc": 1651779699.0,
                    "response": "I’m right there with y’all. This is very frustrating, I only use the card to pay bills so, now I’m just having to deal with all this mess.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "ui7pyq",
            "title": "Algorand Fifa News?",
            "url": "https://www.reddit.com/r/CoinBase/comments/ui7pyq/algorand_fifa_news/",
            "author": "Sea-Leave-358",
            "created_utc": 1651674120.0,
            "score": 3,
            "num_comments": 40,
            "subreddit": "CoinBase",
            "selftext": "Maybe someone knows why such a big event like Algorand & Fifa partnership was not covered on coinbase news?",
            "stickied": false,
            "comments": [
                {
                    "id": "i7antid",
                    "author": "deaddoll_x",
                    "score": 3,
                    "created_utc": 1651674413.0,
                    "response": "I agree. I like the Coinbase newsletter and it was not covered. I believe  Charles' (Cardano) apperance in Fox News was also not covered. In any case, both are good news!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7azgr0",
                            "author": "Sea-Leave-358",
                            "score": 3,
                            "created_utc": 1651679104.0,
                            "response": "In my opinion, it's probably the biggest thing that has happened to crypto ever, and they chose not to cover it. Interesting.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7an4fb",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1651674120.0,
                    "response": "This subreddit is a public forum. For your security, do not post personal information to a public forum, including your Coinbase account email. If you’re experiencing an issue with your Coinbase account, please [contact us](https://help.coinbase.com/en/contact-us.html) directly. \n\nIf you have a case number for your support request please respond to this message with that case number.\n\nYou should only trust [verified Coinbase staff](https://help.coinbase.com/en/coinbase/other-topics/other/is-coinbase-present-on-social-media.html). Please report any individual impersonating Coinbase staff to the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoinBase) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}