{
    "subreddit": "CryptoTechnology",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "usjtr0",
            "title": "Can cryptocurrencies ever become 100% environment-friendly?",
            "url": "https://www.reddit.com/r/CryptoTechnology/comments/usjtr0/can_cryptocurrencies_ever_become_100/",
            "author": "Braswelldj",
            "created_utc": 1652899635.0,
            "score": 0,
            "num_comments": 10,
            "subreddit": "CryptoTechnology",
            "selftext": "The story of Earth is incomplete without the vaults of Gold and other treasures. But today, about 50% of the mined gold is just stored in bank vaults. At a time when the fight against climate change requires immediate action, the mining industry continues to emit between 4-7% of global greenhouse gasses (GHG)1. In fact, scientists estimate that the industrial activity needed to mine just one ounce of gold causes the emission of up to 800 kilograms of GHG2!\n\nObviously, technological evolution brought many alternatives, one in the form of cryptocurrencies. But then, everything comes at a cost. And cryptos aren’t growing on trees.\n\nAccording to the University of Cambridge, Bitcoin mining alone generates about 132.48 terawatt-hours (TWh) annually and the CO2 emitted by this varies on how that energy was created. In fact, in 2020, the US generated 0.85 pounds of carbon dioxide per kWh, which resulted in nearly 40 billion tons of carbon dioxide produced by US Bitcoin mining alone!\n\nOpening their eyes to the harrowing impact of this “new currency”, a lot of cryptocurrencies are trying to come up with alternative mining solutions, that would require less energy and could provide solutions to problems such as the need to accelerate ESG investments that can preserve the environment or the need for a secure, net-zero bridge between a dominant real-world store of value,i.e., gold, and the crypto asset world, without the environmental and social impact of either real-world mining or Proof of Work mining.\n\nCompanies are coming up with new investment alternatives including a tokenized\nInvestments like Nature’s Vault are backed by the preservation of at least 1/100th of a gram of gold in the ground, thereby ensuring forests, ground soil, and their associated ecosystems are not disturbed by gold mines, fossil fuels are not burned in mining activities and local and indigenous communities are not harmed by collateral impacts such as heavy metals contamination of groundwater, rivers, and lakes.\n\nBut do you think it’s enough? Can cryptocurrencies ever become 100% environment-friendly?",
            "stickied": false,
            "comments": [
                {
                    "id": "i93v49r",
                    "author": "sdcvbhjz",
                    "score": 7,
                    "created_utc": 1652899874.0,
                    "response": "Why did you leave out PoS chains?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9408aj",
                            "author": "domotheus",
                            "score": 8,
                            "created_utc": 1652901962.0,
                            "response": "Because it's a bot writing organic looking paragraphs and casually slipping in the advertised product somewhere in the middle",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9528wc",
                            "author": "Maleficent_Plankton",
                            "score": 2,
                            "created_utc": 1652918432.0,
                            "response": "Because it's an ad for N.V. (I'm not going to spell it out), which I'm sure no one here has ever heard of and should stay that way.\n\nName-dropped in both of his 2 most recent submissions.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i93xrdq",
                    "author": "-Jive-Turkey-",
                    "score": -1,
                    "created_utc": 1652900948.0,
                    "response": "Algorand is carbon negative.\n\nEdit: I’ll just leave this here. https://www.algorand.com/resources/blog/sustainable-blockchain-calculating-the-carbon-footprint",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i93zttf",
                            "author": "shape_shifty",
                            "score": 4,
                            "created_utc": 1652901796.0,
                            "response": "Algorand compensate for the carbon it emits, there is a big difference",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i94h051",
                                    "author": "-Jive-Turkey-",
                                    "score": 1,
                                    "created_utc": 1652908851.0,
                                    "response": "To be fair it uses a minuscule amount of energy.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i940qba",
                    "author": "Giga79",
                    "score": 1,
                    "created_utc": 1652902164.0,
                    "response": "https://ethereum.org/en/energy-consumption/\n\nETH POS is a 2000x energy reduction from ETH POW.\n\nThe photo in this article illustrates the difference what being 32500x less than BTC POW looks like by using the tallest tower in the world, the Burj Khalifa, and a household screw.\n\nBitcoin mining incentivizes the cleanest energy in multiple ways, first being economies of scale. But right now clean energy isn't being built-out because there are no customers during non-peak hours even while power is being generated, most batteries aren't environmentally friendly or ideal so instead of wasting the energy or not building at all they put it into BTC to send somewhere that needs that energy instead (like electric oil).\n\nPOW isn't used very much because it's not practical to decentralize using it anymore, the available and specialized cpu/hashrate power globally is just so high now. It's being phased out. BTC halves it's issuance every 4 years so it's incentives are being phased out too, it'll all sort itself out over time.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i962qtb",
                            "author": "89Hopper",
                            "score": 1,
                            "created_utc": 1652937316.0,
                            "response": ">Bitcoin mining incentivizes the cleanest energy in multiple ways, first being economies of scale.\n\nNo, Bitcoin mining incentivizes the cheapest form of power. It also requires a stable form of power, a mining operation is losing lots of money tied up in capital investment if it has to have half the rigs turned off because there isn't too much power being produced. This means they want an increase in base load, which is not adequately serviced purely by renewables.\n\nProof of this is mining companies buying and recommissioning coal and gas power plants purely for the purpose of BTC mining.\n\n2021 - [Stronghold Digital Mining decommissioned coal plant in PA for mining operation](https://futurism.com/bitcoin-mining-company-buys-entire-coal-power-plant)\n\n2020 - [Marathon makes deal with coal plant in Montana about to close to increase power output just for them](https://www.theguardian.com/technology/2022/feb/18/bitcoin-miners-revive-fossil-fuel-plant-co2-emissions-soared)\n\n2020 - [Greenidge Generation recommissions mothballed gas plant to run mining operation](https://apnews.com/article/bitcoin-mining-new-york-power-plant-climate-change-516dbd319394a6a30f83d94947abad20)\n\n2018 - [IOT Group try to reopen coal plant in Australia that had been shut for 4 years to mine. ](https://www.cnet.com/personal-finance/crypto/blockchain-coal-power-plant-mining-bitcoin-cryptocurrency/) It is worth noting, this never got off the ground but primarily due to environmental backlash.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i95boh7",
                    "author": "RavSammich",
                    "score": 1,
                    "created_utc": 1652922876.0,
                    "response": "I’m fairly certain fiat kills more trees than crypto, and in turn, whole ecosystems. Crypto mining also probably only takes a fraction of the energy/resources required to make a Tesla battery…I’m just speculating of course…",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}