{
    "subreddit": "CryptoMarkets",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ur7ncu",
            "title": "Taking advantage of a bear market smartly does not require gathering additional crypto. You'll also need to enhance your knowledge.",
            "url": "https://www.reddit.com/r/CryptoMarkets/comments/ur7ncu/taking_advantage_of_a_bear_market_smartly_does/",
            "author": "PersonalAd7357",
            "created_utc": 1652739482.0,
            "score": 7,
            "num_comments": 6,
            "subreddit": "CryptoMarkets",
            "selftext": "You may call the price movements over the preceding six months anything you choose. Even if we've improved slightly in the last two months, we're still on the decrease. But, in the case of a drop, I believe we all know what to do. Yes, make the purchase. You should try to time your fall such that you are at the bottom and can restock your supplies. Even if we fall lower, everyone who does that is smart, since no one will notice if you bought at 40k or 47k in ten years.  \n\n\nHowever, acquiring knowledge is another thing to do to completely gain from a terrible market. Because there aren't as many hopium-traders during a bad market as there are during a bull market, you can learn the most about the market. Learn how people react to a little pump during certain periods, for example, and how it goes. Instead, do some study to learn about new concepts. Cardano, ROSE, and now High Sloth Society were all found this way. Keep an eye on the situation.  \n\n\nI'd even go so far as to argue that if you can't afford the dip due to financial constraints, it's not an issue. Simply by monitoring the bear market, you may profit from it. Experience is the key to success.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8vk91u",
                    "author": "DubsAli",
                    "score": 2,
                    "created_utc": 1652739581.0,
                    "response": "And then people still make more money off of a memecoin than any one who put years of their life into proper research. No one will admit it, but so much of this is luck.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8vm1v1",
                    "author": "ScoobaMonsta",
                    "score": 2,
                    "created_utc": 1652740396.0,
                    "response": "“You should try to time your fall such that you are at the bottom”. Sorry but this screams noob. Timing the bottom is ridiculous! It’s not about timing the bottom. That’s straight up gambling! Trying to time the bottom will get you REKT. What you should be doing is learning basic TA so you have a rough idea where a correction is likely to end up. You then place a number of buy orders around different support levels. Some will take and some won’t. This is not timing the bottom! If you don’t know how to do TA and can’t be bothered to learn, then you simply average down if you are liquid enough. You are mixing trading and investing together. They are not the same and they require different strategies. Mixing these and not defining what each is will get you REKT. Pick a strategy and stick to it! Don’t deviate from it! Don’t let emotions dictate your decisions away from your strategy.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8voanj",
                            "author": "mrdeezy",
                            "score": 2,
                            "created_utc": 1652741434.0,
                            "response": "Wow, an intelligent comment in reddit crypto. This is a great post.\n\nPeople on reddit hate TA for whatever reason (probably they don't understand it)\n\nEveryone here just screams \"HODL\" which is the dumbest narrative and outrageously stupid. These assets that have 50% drawdowns every year.\n\nMy guess is that we are going to hit the 200 week sma for bitcoin. Its going to get very ugly if the fed doesn't prop the market soon. I am not even prepared to accumulate because the charts look like they will go much lower. Especially alts. Don't try to catch the falling the knife.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8w4zw1",
                            "author": "Master-Monitor112",
                            "score": 1,
                            "created_utc": 1652749659.0,
                            "response": "If you invest in bitcoin you can just invest every time it drops by 5-10k and at some point you will invest at the bottom. With bitcoin you don’t have to worry about any price you buy at right now because it hit a all new time high again at some point.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8wavpk",
                            "author": "KryptoSC",
                            "score": 1,
                            "created_utc": 1652752617.0,
                            "response": "Excellent point and good distinction between investing and trading. I invest and HODL in stocks, but I day-trade cryptos. I'm an algorithmic trader, so technical analysis and volatility are a key part of automated crypto trading strategy.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8w8m8j",
                    "author": "HowardMaryes",
                    "score": 1,
                    "created_utc": 1652751477.0,
                    "response": "Thank me later ❤️🙏 https://www.youtube.com/watch?v=tDZtBzqow6Q",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}