{
    "subreddit": "CryptoMarkets",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "upzi6e",
            "title": "Tethers market cap plunged. Is it time?",
            "url": "https://i.redd.it/o8owve13xkz81.jpg",
            "author": "Mannit578",
            "created_utc": 1652594060.0,
            "score": 98,
            "num_comments": 106,
            "subreddit": "CryptoMarkets",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8obb9k",
                    "author": "AdvertisingWitty4373",
                    "score": 60,
                    "created_utc": 1652603913.0,
                    "response": " the fact that this is just starting to bother people is a proof how messed up entire financial system is",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8pb59s",
                            "author": "AmericanScream",
                            "score": 13,
                            "created_utc": 1652627054.0,
                            "response": "Agreed.  The whole \"Don't trust - verify\" crowd stuck their heads in the sand the moment Tether and Circle refused to have their \"asset backed stablecoins\" properly audited.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8pirlk",
                                    "author": "OrdainedPuma",
                                    "score": 4,
                                    "created_utc": 1652630474.0,
                                    "response": "Pretty sure circle is verified.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8p3ktc",
                    "author": "RedMiceBlues",
                    "score": 6,
                    "created_utc": 1652623531.0,
                    "response": "Everything looks like crap right now. Take a look to Bitcoin market cap",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ooj68",
                    "author": "CukaCora",
                    "score": 31,
                    "created_utc": 1652614883.0,
                    "response": "Just to be safe and to avoid another UST, i converted all my USDT to BUSD",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8p3xvk",
                            "author": "nitrolimitz",
                            "score": 20,
                            "created_utc": 1652623705.0,
                            "response": "BUSD is good too but tbh if I were you I'd go with DAI or USDC more decentralized from what I can tell",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8p6ft4",
                            "author": "TheBigShrimp",
                            "score": 7,
                            "created_utc": 1652624898.0,
                            "response": "Someone explain to me why you'd rather hold a stablecoin than USD in and FDIC insured bank account",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8pd20v",
                                    "author": "StatisticalMan",
                                    "score": 5,
                                    "created_utc": 1652627927.0,
                                    "response": "because I can't use a dollar on the blockchain.\n\nUsing a DEX will require stablecoins (at least temporarily)\nBorrowing against crypto on defi platforms will require stablecoins (at least temporarily)\nDefi lending will require stablecoins (at least temporarily)\nDollar based liquidity pools will require stablecoins (at least temporarily)\nQuickly transfering \"dollars\" between exchanges will require stablecoins (at least temporarily)\n\nStablecoins are a tool. \n\nSure if the Federal Reserve issued tokenized dollars which could be used on Ethereum and other blockchains there would be no need for stablecoins until then:\n\nstablecoin = tokenized dollar on a blockchain",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8p709c",
                                    "author": "francesco93991",
                                    "score": 5,
                                    "created_utc": 1652625166.0,
                                    "response": "Because some people don't trust banks.\n\nAlso they might want to be ready to buy their favorite crypto asset when it's time, without having ti wait for a bank transfer to the exchange to be cleared up",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8pbfz8",
                                            "author": "AmericanScream",
                                            "score": 8,
                                            "created_utc": 1652627184.0,
                                            "response": "You don't need to trust banks.  They're regulated by law to not screw people over.  You need trust when you're dealing with CEXs because they have no oversight and no guarantee of protecting peoples' deposits.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8otq0h",
                    "author": "happinesssam",
                    "score": 4,
                    "created_utc": 1652618231.0,
                    "response": "Here's the question - can Bitfinex survive if they let Tether go?\n\nI'm guessing no, (though maybe someone more knowledgeable could weigh in), in which case they are going to be willing to throw a lot more resources at keeping the peg than the guys behind Terra, and they also have a functioning, extremely profitable company to back them up.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8p0ona",
                    "author": "georgotpyrc",
                    "score": 17,
                    "created_utc": 1652622096.0,
                    "response": "Tether is handling all the requested withdrawals without problems as far as I know. \n\nThey managed to pay out over 7 billion US Dollars in just a few days. I'd say this is very impressive and far from concerning actually.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8p4k3j",
                            "author": "Umarzy",
                            "score": 6,
                            "created_utc": 1652624009.0,
                            "response": "It's impressive, no doubt. But why is it that people are redeeming Tether for fiat USD this much the past few days. Has this huge figure ever been redeemed before? Or may be some are scared it may collapse due to UST fiasco?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8p6ysw",
                                    "author": "georgotpyrc",
                                    "score": 9,
                                    "created_utc": 1652625147.0,
                                    "response": "There always has been rumors that Tether is not fully backed, etc. My guess is, that in the light of the UST collapse a lot of people got scared and tried to get into other stables or fiat. \n\nI think it is the largest amount redeemed within a couple days so far.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8pbw56",
                                            "author": "AmericanScream",
                                            "score": 6,
                                            "created_utc": 1652627391.0,
                                            "response": "> There always has been rumors that Tether is not fully backed, etc.\n\nThey're not rumors.  They're facts.\n\nTether told everybody they were 1:1 fiat backed, and then the New York Attorney General [sued them](https://ag.ny.gov/press-release/2021/attorney-general-james-ends-virtual-currency-trading-platform-bitfinexs-illegal) and in discovery it was revealed they were lying, and only had about 3% in fiat.  If it weren't for evil government taking action they'd still be lying - and they continue to lie, and refuse to have their assets properly [audited](https://i.imgur.com/buhqFqw.jpg)",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8pfaek",
                                                    "author": "georgotpyrc",
                                                    "score": 5,
                                                    "created_utc": 1652628941.0,
                                                    "response": "Being not fully backed and not 1:1 fiat backed is two very different things.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8o42ed",
                    "author": "ma0za",
                    "score": 18,
                    "created_utc": 1652597792.0,
                    "response": "You Are half a week too late and IT allready recovered?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8otbkv",
                    "author": "Sorry_Attitude_",
                    "score": 6,
                    "created_utc": 1652617989.0,
                    "response": "It really means nothing, a lot of people probably just switched or they wanted to be able to hold volatility down\n\nIt is barely a hitch in the marketcap lol, I don't like USDT and i hope it dies but slow so it doesn't affect us\n\nI'm happy the Algorand market is mostly working with USDC or, at the moment, local stablecoins like STBL\n\nhope Kaddex takes this path too and not work with USDT as much as possible, DAI stablecoin type of infrastructure or USDC transparency only. Can't play with people's money like UST",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}