{
    "subreddit": "CryptoMarkets",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "urqgzu",
            "title": "Briefly about the main thing in the blockchain industry.",
            "url": "https://medium.com/@unclefibonacci/briefly-about-the-main-thing-in-the-blockchain-industry-122fb5441ec",
            "author": "btcxlab",
            "created_utc": 1652805427.0,
            "score": 1,
            "num_comments": 0,
            "subreddit": "CryptoMarkets",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "urq975",
            "title": "Do I stay or do I go",
            "url": "https://www.reddit.com/r/CryptoMarkets/comments/urq975/do_i_stay_or_do_i_go/",
            "author": "Huge-Paint4923",
            "created_utc": 1652804834.0,
            "score": 1,
            "num_comments": 2,
            "subreddit": "CryptoMarkets",
            "selftext": "So unless you've been living under a rock in the past two weeks  you've seen that the market for cryptos is in a serious downward spiral. Now understand that this is just the way that cryptos in general 'behave' but unless you had some serious foresight and are seriously in crypto you were not happy these couple of weeks.  \n\n\nMy question to you is, as I suppose most of you are on Binance (as am I ),are there any other marketplaces for crypto where you trade or acquire your hard earned assets that are just as Big and reliable. Of course I've heard of dozens of them like Dura-Fi and Coinbase but I am a  kind of a person that doesn't test out anything new unless I am certain that it is checked out, safe and recommended by a lot of people, this is especially true when it comes to my money.  \n\n\nSo I want to hear your recommendations and opinions about new markets. If there are any or do you recommend I just stick to  Binance.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8yqc18",
                    "author": "Hiviq",
                    "score": 1,
                    "created_utc": 1652805605.0,
                    "response": "Kraken, but it does not matter unless fees are cheaps and I can transfer the coins quickly to my wallet.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8yqe2s",
                    "author": "killzenth",
                    "score": 1,
                    "created_utc": 1652805627.0,
                    "response": "Shut up and go coinbase.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}