{
    "subreddit": "CryptoCurrencies",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ulnr3d",
            "title": "Ripple Bags Japan's First E-Commerce Adoption, as XRP Will be Utilized to Purchase Used Cars on SBI Motors",
            "url": "https://thecryptobasic.com/2022/05/09/ripple-bags-japans-first-e-commerce-adoption-as-xrp-will-be-used-to-purchase-used-cars-on-sbi-motors/",
            "author": "jakkkmotivator",
            "created_utc": 1652090423.0,
            "score": 45,
            "num_comments": 8,
            "subreddit": "CryptoCurrencies",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i7xg2jf",
                    "author": "Duckef",
                    "score": 3,
                    "created_utc": 1652109478.0,
                    "response": "Get those bags ready",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "ulr7dr",
            "title": "CluCoin has sold off over 2 million in their own token with most of it being completely unreported",
            "url": "https://www.reddit.com/r/CryptoCurrencies/comments/ulr7dr/clucoin_has_sold_off_over_2_million_in_their_own/",
            "author": "Walks_In_Shadows",
            "created_utc": 1652102729.0,
            "score": 10,
            "num_comments": 3,
            "subreddit": "CryptoCurrencies",
            "selftext": "Any questions on their discord ends in a swift ban. Same thing with the Goobers discord.\n\nI'd like to point you all [here](https://twitter.com/StefanGreybeard/status/1520114682333442051?t=U9EAQ1DB9jTeYMOOWqzu5w&s=19) to a former mod of the Clu team who left due to serious issues from the team. We had to beg these guys to tell any form of update and a lot of us got fed up so we sold off last year. This is so ironic considering CluCoin was an almost carbon copy of safemoon.\n\nI'm posting this so more people will know how big of a POS DNP3 is and that he needs to be held accountable for his actions. I've talked with people, some who invested over 50 grand into that shitcoin only for it all to be worth only $2000 now. Idk if I'm in the correct sub for this and if I'm not please direct me to the correct sub.",
            "stickied": false,
            "comments": []
        },
        {
            "id": "ull9vl",
            "title": "Bancor V3 Set To Launch May 11",
            "url": "https://usethebitcoin.com/bancor-v3-set-to-launch-may-11/",
            "author": "Brief-Bother-155",
            "created_utc": 1652079272.0,
            "score": 16,
            "num_comments": 2,
            "subreddit": "CryptoCurrencies",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "ukzx5j",
            "title": "I really think Cartesi has a chance at taking over soon",
            "url": "https://www.reddit.com/r/CryptoCurrencies/comments/ukzx5j/i_really_think_cartesi_has_a_chance_at_taking/",
            "author": "calisthenicslb",
            "created_utc": 1652010069.0,
            "score": 6,
            "num_comments": 16,
            "subreddit": "CryptoCurrencies",
            "selftext": "The reason I say this cause I think Cartesi is tackling an area where almost no other scaling solutions has ever focused on and that would maximizing interoperability.\n\nMost scaling solutions are throwing all their resources at obtaining crazy TPS numbers when in reality, after a certain level of increased TPS the returns start decreasing.\n\nAnd while Cartesi will boast incredible TPS rates, its main focus will be on reaching mainstream status through leveraging the fact that it runs Linux OS.\n\nFor those of you who don’t know, Linux is by far the widest used OS on the plant. You’re most probably using Linux right now in some way or another cause. Look at these numbers for example:\n\n• *90% of all cloud infrastructure runs on Linux*\n\n• *100% of the top 500 super computers run on Linux*\n\n• *96.3% of the top 1 million servers run on Linux*\n\n• *85% of all smartphones are based on Linux*\n\nThis means that once Cartesi is fully operational its going to have a huge edge over other platforms on the way that it is operable on almost every server, phone or computer.\n\nThat alone, along with the fact that they’re working hard on outperforming other scaling solutions as well, is the main reason why I think Cartesi will for sure make it big pretty soon.",
            "stickied": false,
            "comments": []
        },
        {
            "id": "ulsigk",
            "title": "Bank of Israel still unsure on digital shekel but garners public support",
            "url": "https://www.reuters.com/business/finance/bank-israel-still-unsure-digital-shekel-garners-public-support-2022-05-09/",
            "author": "Some_won",
            "created_utc": 1652106552.0,
            "score": 4,
            "num_comments": 3,
            "subreddit": "CryptoCurrencies",
            "selftext": "",
            "stickied": false,
            "comments": []
        }
    ]
}