{
    "subreddit": "CryptoMarkets",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "v17t2m",
            "title": "I have created a basic crypto using Algodesk, how do I learn to expand and add functionality / Rebuild from the ground up.",
            "url": "https://www.reddit.com/r/CryptoMarkets/comments/v17t2m/i_have_created_a_basic_crypto_using_algodesk_how/",
            "author": "ForeignAdagio9169",
            "created_utc": 1653938884.0,
            "score": 1,
            "num_comments": 4,
            "subreddit": "CryptoMarkets",
            "selftext": "I am a forester by trade, and really want to be able to open up investment into the forestry industry on a smaller scale. In the UK one of the largest land managers Gresham House operates with around a 40k buy in, after this you are essentially paid out high yield dividends yearly. \n\nObviously not many people have 40k, and so I am trying to figure out a way of breaking a woodland into smaller stands in order to allow people to buy \"a piece\" (A coin).   \nThis is complicated because if I owned a 100ha woodland worth say 100k. I could break it up into 1ha pieces and sell them relative to the value of the woodland.\n\nI know of an American housing company basically doing the same thing, houses are put up for rent. and you can buy x \"shares\" (coins) that are always sellable and pay a monthly dividend which is basically a share of the rent. \n\nPart of my problem would be that due to the nature of forestry a rotation is around 35/40 years. and so to pay dividends on coin ownership there would need to be a period of time that someone's initial investment would be locked. I know this sounds squiddish, its just that without an initial lockup period it wouldn't be possible to begin to pay out dividends. \n\nEssentially, the initial buy in would be a stake in an existing woodland. then the capital raised from selling \"shares\" (coins) would buy another woodland. this woodland would be at another point in its rotation. and this would carry on until there are enough woodlands to pay out yearly to all coin owners. the reason being is that if 10 woodlands had a 3.5 year break in production then you would be processing a huge amount of timber every 3.5 years which equates to a huge amount of money. Even more importantly if you had say 35 woodlands that had a year between them you would be harvesting yearly meaning huge dividends to coin holders. \n\nBasically, my idea is turning traditional investing into a approachable vehicle to generate money. without \"old money\" buy ins. Timber markets aside, I don't think there is any volatility to be seen aside from an initial \"buy in\" period that could be difficult. Please if anyone has any advice or tips on how to approach this, it would be greatly appreciated. \n\nMany thanks,\n\nAdagio.",
            "stickied": false,
            "comments": [
                {
                    "id": "iana8up",
                    "author": "CointestAdmin",
                    "score": 1,
                    "created_utc": 1653992232.0,
                    "response": "Algorand [pros](/r/CryptoMarkets/comments/v17t2m/i_have_created_a_basic_crypto_using_algodesk_how/iana9ae/) & [cons](/r/CryptoMarkets/comments/v17t2m/i_have_created_a_basic_crypto_using_algodesk_how/iana9kf/) and related info are in the collapsed comments below. Pros and cons will change for every new post. Submit a pro/con argument in the [Cointest](https://www.reddit.com/r/CointestOfficial/wiki/cointest_policy) and potentially win [Moons](https://coinmarketcap.com/currencies/moon/). Moon prizes by award for the Coin Inquiries category are: **1st - 300, 2nd - 150, 3rd - 75, and Best Analysis - 500.** \r\n\r\n---\r\n\r\nTo submit an Algorand pro-argument, [click here](https://www.reddit.com/r/CointestOfficial/comments/sifd8p/coin_inquiries_algorand_proarguments_february_2022/). | To submit an Algorand con-argument, [click here](https://www.reddit.com/r/CointestOfficial/comments/sifdb5/coin_inquiries_algorand_conarguments_february_2022/).",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "v16876",
            "title": "I think this perfectly describes how my buy and hold strategy since the beginning of December is going.",
            "url": "https://i.redd.it/43h7ussmmn291.jpg",
            "author": "my2centsforyoubam",
            "created_utc": 1653934408.0,
            "score": 1,
            "num_comments": 0,
            "subreddit": "CryptoMarkets",
            "selftext": "",
            "stickied": false,
            "comments": []
        }
    ]
}