{
    "subreddit": "CryptoMarkets",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "urvu0n",
            "title": "The recent market crash was another proof on the importance of treasury diversification for projects",
            "url": "https://www.reddit.com/r/CryptoMarkets/comments/urvu0n/the_recent_market_crash_was_another_proof_on_the/",
            "author": "totallyfvckedup",
            "created_utc": 1652820072.0,
            "score": 6,
            "num_comments": 2,
            "subreddit": "CryptoMarkets",
            "selftext": "I’m pretty sure that most of you are sick of reading posts about the market crash or how luna went to zero or how projects are down by over 80%, but the crash made me realize of how important it is to have a diverse treasury. \n\n\nSimilar to how individuals hedge their portfolios from volatility risks by holding multiple coins, some projects hold different coins or stablecoins to protect themselves from bear markets, and minimize loss risks. \n\n\nNo one can be 100% certain of the performance of the market, especially in a market as volatile as the crypto market since it’s an emerging market and panic sellers exist, resulting in a drastic decrease in a coin’s value. \n\n\nOne example is BIT that didn’t get affected by the crash like other altcoins did, since BItDAO holds BIT, ETH, USDT, USDC, FTT, WETH, and xSUSHI in its treasury, making it one of the most diverse, versatile and liquid crypto assets in the market. \n\n\nI personally never took into consideration whether a project’s treasury is diversified or not when doing my research before investing, but everything changed now.",
            "stickied": false,
            "comments": [
                {
                    "id": "i90f5op",
                    "author": "caixabancyc",
                    "score": 1,
                    "created_utc": 1652831470.0,
                    "response": "Their diversification seems to end at the crypto assets, I wonder if BIT ever considers diversifying to other financial assets like stocks, as I believe this is when they can achieve true diversification, what do you think about it?\n\nThere could be concerns of buying it off chain, they might want to consider buying synthetic assets from  Derived Finance as they offer zero slippage unlike others.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i90h9e7",
                            "author": "totallyfvckedup",
                            "score": 1,
                            "created_utc": 1652832496.0,
                            "response": "anything is possible in this DAO if there's full community agreement on",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}