{
    "subreddit": "CryptoMarkets",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "usp6df",
            "title": "Can anyone predict the future for BTC? The market seems helpless right now tbh.",
            "url": "https://www.reddit.com/r/CryptoMarkets/comments/usp6df/can_anyone_predict_the_future_for_btc_the_market/",
            "author": "Huge-Paint4923",
            "created_utc": 1652914734.0,
            "score": 1,
            "num_comments": 10,
            "subreddit": "CryptoMarkets",
            "selftext": "Bitcoin (BTC) last traded above $50,000 on December 27, 2021. Four months have passed since then, but traders appear to be hopeful that inflation has reached the right level to spur bitcoin adoption.  \n\n\nIn principle, 8.5 percent inflation in the United States means that prices increase by 50% every five years. This effectively reduces the purchase power of the dollar by 33%, turning $100 into $66. Is this the fall of USD?  \n\n\nOn May 4, the Federal Reserve (FOMC) of the United States is likely to make a decision on interest rates, but more crucially, the FED is expected to unveil a scheme to unload some of its $9 trillion balance sheet. As a result, rather than supporting the debt and mortgage markets, the Federal Reserve will most certainly sell $95 billion worth of these assets each month. Do you think this could affect the crypto market as well?   \n\n\nRisk markets have factored in the possibility of catastrophic outcomes. In 2022, the Russell 2000 mid-capitalization stock market index, for example, is down 16.5 percent year to date. Similarly, the Chinese stock market has had a 20% year-to-date correction, as assessed by the MSCI China index. Is this the time for investing? I've recently heard of some communities including High Sloth Society, ROSE, etc. What do you think about that? This may actually be something called a discounted market.  \n\n\nIt's impossible to predict what would set off a Bitcoin bull run, but Glassnode reported on April 18 that \"a considerable quantity of coin supply\" had accumulated between $38,000 and $45,000. There is a low-risk options method that can be utilized to place a long bullish bet for traders who anticipate BTC will hit $50,000 by July. What could this mean for BTC, thus for the crypto market as a whole?",
            "stickied": false,
            "comments": [
                {
                    "id": "i94wx1z",
                    "author": "CointestAdmin",
                    "score": 1,
                    "created_utc": 1652915910.0,
                    "response": "Bitcoin [pros](/r/CryptoMarkets/comments/usp6df/can_anyone_predict_the_future_for_btc_the_market/i94wy3o/) & [cons](/r/CryptoMarkets/comments/usp6df/can_anyone_predict_the_future_for_btc_the_market/i94wylf/) and related info are in the collapsed comments below. Pros and cons will change for every new post.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i94xes2",
                    "author": "Harrison_w1fe",
                    "score": 2,
                    "created_utc": 1652916138.0,
                    "response": "Crypto isn't going to be adopted because currently none of the technology can do anything.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i94zfl9",
                    "author": "adgebush",
                    "score": 1,
                    "created_utc": 1652917088.0,
                    "response": "This should not get anyone worried as this is a part of the game. Highs and lows will come in any industry and specially in the crypto industry as it is so volatile. I would rather stake more now as i always do when dips happen. I have shifted focus to upcoming DeFi projects like KOLnet that monetizes influencers for their service. Its better to earn without investing monetarily right now, as BTC is not jumping. The good news is , its not tanking either.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i954ahp",
                    "author": "L0ckeandDemosthenes",
                    "score": 1,
                    "created_utc": 1652919398.0,
                    "response": "Lol. It all takes time. Patience is the key to success in life.\n\n\n You gotta know when to hold em, know when to fold em...",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i95f1ou",
                    "author": "dudetalking",
                    "score": 1,
                    "created_utc": 1652924429.0,
                    "response": "Its part of cycle, 80% of crypto right now is hype and scams and there is 20% real value utility that lines up with real demand. Real demand is not moon dreams, and lambos.  \n\nI got out last year, and plan to get in sub 20K. Ideally I want to see some major crypto bankruptcies (Terra/Luna is a start), and real collapse usage especially in major projects, especially the worst ones like solana, cardano, which are just glorified websites. Heck Etheruem failing would be great too.\n\nThe whole nft thing is pure trash, with every celeb launching an nft, that needs to be flushed down the toilet. \n\nThe world is driven by the US Dollars, no one measure crypto in the price of Euros or RMB. Until the Federal Reserve stops removing liquidity all assets especially the riskiest ones will go down.\n\nSo there is no rush to buy, and this will not be a V shaped recovery, the recovery in crypto will take 5-8 years at least befre we return to over 50K, like the .com.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i95jpw6",
                    "author": "ETAVEGAMING",
                    "score": 1,
                    "created_utc": 1652926609.0,
                    "response": "Go to tradingview. Put on the 12 month chart. Bitcoin is following a pattern so far. If the pattern stays true, Bitcoin’s next bullrun should start in about 7 months.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i94uxa7",
                    "author": "Dian-Fossey",
                    "score": -1,
                    "created_utc": 1652914978.0,
                    "response": "We’re going to 10k before we go back up imo. We will rise again in glory but right now we’ll be anchored badly by the tech sector of the stock market, which is down bigly and potentially going to go either up or down some more at some point in the future. But maybe down more. If the nasdaq goes down another 10% , BTC will go down another 20 or 30. Buckle up! \n\nWe’ve been here before, fellas. Stick with the program and buy small amounts every month or couple of weeks and don’t sell your bags, if it’s BTC. \n\nAll alts are rekt and a lot will never come back, RIP. Sorry for you loss from a fellow bag holder.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}