{
    "subreddit": "CryptoMarkets",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "urx73h",
            "title": "Is this the next haven for investing ?",
            "url": "https://www.reddit.com/r/CryptoMarkets/comments/urx73h/is_this_the_next_haven_for_investing/",
            "author": "PersonalAd7357",
            "created_utc": 1652823784.0,
            "score": 1,
            "num_comments": 1,
            "subreddit": "CryptoMarkets",
            "selftext": "Okay so crypto has been in a bit of a decline lately and although that's nothing to worry about in the long run it has gotten me thinking to diversify my portfolio of investments.  \n\n\nI started searching for new unexplored markets and new sectors where blockchain might go because it is almost inevitable that blockchain will reach almost all tech sectors because of the techs versatility and ability to bring change for the better wherever it comes.  \n\n\nNow my belief (and of course I could be  mistaken this is just my personal analysis and I encourage you to make your own ) is that the best sector to invest in is the telecommunications sector and that the best market to try is the African market.  \n\n\nMy reasons for this belief is that only 25 percent of Africa has internet penetration and the telekom sector is in a dire need of an overhaul because rising costs and ever increasing demands demand the usage of blockchain.  \n\n\nI've heard of companies like World Mobile Token, Giant and Telcoin going in the similar direction and I think they might be onto something profitable however I still have my doubts.  \n\n\nWhat are your opinions on my analysis, and where would you invest ?",
            "stickied": false,
            "comments": [
                {
                    "id": "i913y2u",
                    "author": "Scofield88",
                    "score": 1,
                    "created_utc": 1652843334.0,
                    "response": "I don't know if comments like this are shilling and banned, but you can refer to what I did:\n\nI bought $5K of $WLUNA last Friday morning\r  \n\r  \nBought $15K into the relatively new project $RBIF r/roboinu\r  \n\r  \nAnd added $10K more into my ETH holdings\r  \n\r  \nLet it ride....this is cheap prices to buy into some of these cryptos; not sure it can get any lower IMO\r  \n\r  \n\\*\\*\\*\\*\\* You either are going to sit on the bench and watch .......OR........ get in the game and play\\*\\*\\*\\*\\*\r  \n\r  \nLets make some $$$$$\r  \n\r  \nCheers botha and best of Luck",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}