{
    "subreddit": "CryptoMarkets",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uvn9j5",
            "title": "Can you believe this is going on ?",
            "url": "https://www.reddit.com/r/CryptoMarkets/comments/uvn9j5/can_you_believe_this_is_going_on/",
            "author": "Becneldjh",
            "created_utc": 1653262977.0,
            "score": 1,
            "num_comments": 15,
            "subreddit": "CryptoMarkets",
            "selftext": "So have you heard about this legal case going on in Brazil  right now involving Binance ?\n\nNow basically a guy had loads Of SHIB coins and somehow he was hacked, his coins were on a platform called MetaMask and using analysis he found out that his coins were transferred to Binance.\n\nOf course he contacted Binance and asked them to lock the wallet, at first they said they were going to do it but later just ignored him leading to a court case in front of a Brazilian court, can you believe this. ?\n\nBinance argued in front of the court they had no connection to MetaMask and therefore didn't lock the wallet despite  the proof submitted, what do you guys think about this ?\n\nI'm on Binance right now but have no idea whether to continue being here because of this, I understand that they are just protecting their business but come on.\n\nWould you consider switching to other exchanges like Coinbase or Dura-fi and do you know of similar cases involving them and could you recommend some other reputable and secure exchanges ?\n\nI understand that I might be taking this to seriously but I tend to take notice of these things !",
            "stickied": false,
            "comments": [
                {
                    "id": "i9micem",
                    "author": "Dulcar1",
                    "score": 4,
                    "created_utc": 1653264399.0,
                    "response": "as a US citizen, I will only use US based exchanges. Much easier to sue them if something goes wrong.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9mjk35",
                    "author": "Nearby_You_313",
                    "score": 3,
                    "created_utc": 1653265042.0,
                    "response": "It's dumb to blame binance. They have no knowledge of who owns the wallet. To ask them, purely on trust, to just blanket freeze an account because you said so? Ridiculous.\n\nObviously they could ask you to complete certain transactions to prove ownership, etc., but by that point it's probably too late anyways.\n\nPoint being... don't do dumb things with your keys.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9mm9cx",
                    "author": "ETAVEGAMING",
                    "score": 4,
                    "created_utc": 1653266471.0,
                    "response": "How do you know this guy with a bunch of shib didn’t buy something with them and transferred them for purchase?\n\nYou don’t know. I don’t know. Binance doesn’t know.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9mifer",
                    "author": "RubberyTheology",
                    "score": 1,
                    "created_utc": 1653264444.0,
                    "response": "Coinbase wallet or trust wallet is better as well",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9okjs0",
                    "author": "ShabbySuburb",
                    "score": 1,
                    "created_utc": 1653313276.0,
                    "response": "To avoid such incidents I switched to decentralized exchange wowswap. I understand that there is more liquidity on binance, but my funds are completely under my control here",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9q1kcw",
                    "author": "Tall_Run_2814",
                    "score": 1,
                    "created_utc": 1653336122.0,
                    "response": "How can Binance prove that coins they received were gained maliciously on another app??  \n\nIf that were the case anyone could just call in and shut down anyone’s account with an accusation.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9y7oei",
                    "author": "Pairywhite3213",
                    "score": 1,
                    "created_utc": 1653494660.0,
                    "response": "Why not split some of your bags and move them into DEX? Most dex like Cometh Swap and DYDX are good places to store your assets, earn passively on them and also have full control of your assets.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}