{
    "subreddit": "CryptoTechnology",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "umboty",
            "title": "How's this analogy sound? Avalanche vs Nakamoto Consensus",
            "url": "https://www.reddit.com/r/CryptoTechnology/comments/umboty/hows_this_analogy_sound_avalanche_vs_nakamoto/",
            "author": "Interested-Investor",
            "created_utc": 1652162164.0,
            "score": 9,
            "num_comments": 10,
            "subreddit": "CryptoTechnology",
            "selftext": "Im trying to understand Avalanche consensus vs Nakamoto consensus better. Does this analogy work well? How can I improve it?\n\nYou're in a room full of strangers and you all need to agree on tacos or BBQ for dinner. \n\nNakamoto Consensus: Each person asks every individual person what they prefer\"\n\nAvalanche Consensus: \"Each person asks 5 others what they prefer and change their vote to side with the majority. Repeat this process a few times until everyone agrees\"",
            "stickied": false,
            "comments": [
                {
                    "id": "i80vehw",
                    "author": "kellysmith",
                    "score": 7,
                    "created_utc": 1652167049.0,
                    "response": "Nakamoto: The person who somehow proves they did more work than all the others gets to choose tacos or bbq for everyone else.\n\nAvalanche: your example is correct.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "ulqfey",
            "title": "Will we continue to see bigger projects and more demand for web3 development or do you think it is going to die out?",
            "url": "https://www.reddit.com/r/CryptoTechnology/comments/ulqfey/will_we_continue_to_see_bigger_projects_and_more/",
            "author": "ForbiddenOwl",
            "created_utc": 1652100356.0,
            "score": 4,
            "num_comments": 4,
            "subreddit": "CryptoTechnology",
            "selftext": "I'm a cyber security specialist and I've been getting into development for a while. When it comes to my field you learn how to properly read code and tell what a program does by looking at it but when it comes to writing my own stuff. Found out that it is a whole other ball game. I've learned Python, rust and solidity. I also learned a ton about developing on web3 from start to finish through Polygon's hackathons and developer resources. As someone who learns by doing, I highly recommend some workshops and hackathons.\n\nI haven't really found any web3 projects yet as this is kind of a side project but I constantly hear about how much in demand Solidity and web3 developers are right now. There's a massive amount of money to be made. My question to you is this, do you think this is just another fad? or could solidity be the new Python or Java? Something that becomes the industry standard. Rust by itself already feels like the new Python if I'm going to be honest.\n\nI personally believe this is the next step forward for a ton of facets of technology. I believe game development is going to move to the blockchain. Security is going to move to the blockchain, web3 hosting, etc. I genuinely don't think this is something that's going to get hype and die out, you might as well get a head start on the learning. Although with that being said, I would love to hear everyone's thoughts and opinions on the matter. Maybe someone out here knows something I don't.",
            "stickied": false,
            "comments": [
                {
                    "id": "i7wzifs",
                    "author": "Token_Broker",
                    "score": 4,
                    "created_utc": 1652102279.0,
                    "response": "I don't think web3 will be a thing. If people wanted privacy or even cared, they wouldn't use Google already. They wouldn't buy android or apple phones.\n\nPeople want ease and convenience. That's all",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7xtaw0",
                            "author": "Dr_I_Abnomeel",
                            "score": 4,
                            "created_utc": 1652114762.0,
                            "response": "Many people choose Apple phones _because_ they offer privacy.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}