{
    "subreddit": "CryptoMarkets",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ur7aoq",
            "title": "A Hacked Crypto Ad Firm Compromises CoinGecko, Etherscan",
            "url": "https://www.thismorningonchain.com/articles/defi/a-hacked-crypto-ad-firm-compromises-coingecko-etherscan/",
            "author": "totallynotbeyonce",
            "created_utc": 1652738494.0,
            "score": 1,
            "num_comments": 0,
            "subreddit": "CryptoMarkets",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "ur75wi",
            "title": "Fintech is a VERY underrated sector in the crypto market. With it, crypto can spearhead into world finance.",
            "url": "https://www.reddit.com/r/CryptoMarkets/comments/ur75wi/fintech_is_a_very_underrated_sector_in_the_crypto/",
            "author": "ImmediateAnywhere8",
            "created_utc": 1652738145.0,
            "score": 1,
            "num_comments": 2,
            "subreddit": "CryptoMarkets",
            "selftext": "We all dream of crypto going mainstream. And this isn’t actually that much of a crazy or far fetched idea. Many traditional companies are starting to enter the crypto market and work with crypto projects like Ethereum and Polygon. Even Hedera has Google, IBM and UbiSoft onboard their council.\n\nHowever, if we ever dream of attaining that mainstream status sooner rather than later, we need to focus a lot more on world finance, payments and banking. So basically what I’m saying is, we need to focus on Fintech development.\n\nIt’s a very underrated sector of development in the crypto market right now with only a couple platforms putting money into it one of which is Hedera actually as I mentioned before with HBAR foundation allocating $50 million solely for Fintech development.\n\nI think what they’re doing is actually very smart cause this will start attracting more and more finance companies to build and use their platform.\n\nAnd I truly think that other projects and blockchains should start following suit as well cause it is indeed a very important sector for to bolster crypto mainstream adoption.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8vmro3",
                    "author": "Ofiller",
                    "score": 1,
                    "created_utc": 1652740727.0,
                    "response": "U mean Vectorspace AI or just in general? \n(Disclaimer: early investor, heavy bias)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8vniir",
                    "author": "sugogosu",
                    "score": 1,
                    "created_utc": 1652741070.0,
                    "response": "Fintech is involved in crypto. There are a ton of fintech and payment companies that are heavily investing in offering fiat to crypto and vice-versa payments and investment services.\n\nStripe, PayPal, Bolt, Skrill, Checkout.com, PaySafe, Fidelity, etc...",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}