{
    "subreddit": "CryptoTechnology",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ustz48",
            "title": "Can’t wait for universities to start introducing cryptocurrency and blockchain technology related classes as a standard",
            "url": "https://www.reddit.com/r/CryptoTechnology/comments/ustz48/cant_wait_for_universities_to_start_introducing/",
            "author": "DeliciousNectarine8",
            "created_utc": 1652929981.0,
            "score": 75,
            "num_comments": 44,
            "subreddit": "CryptoTechnology",
            "selftext": "We’re starting to see more and more universities pushing towards introducing crypto related classes. I just hope that eventually they start becoming more of a standard.\n\nUBC has a 'Blockchain@UBC' microcertificate program that is leading students to internships in the industry.\n\nMIT Sloan also had an entire course on Blockchain technology which was taught by Gary Gensler. It's available on YouTube for free at MIT Open Courseware's channel.\n\nThere are crypto projects like BitDAO pushing this agenda as through funding autonomous entities like EduDAO which will help students start working and building in the Web3 and DeFi space.\n\nIf we keep up this pace then we might start witnessing the rise of some crypto-centric and specific colleges and universities which will definitely give crypto mainstream adoption a HUGE boost in my opinion.\n\nDid anyone here ever study a crypto or blockchain related course in their university? Would be interesting to know more about it to be honest.",
            "stickied": false,
            "comments": [
                {
                    "id": "i961wia",
                    "author": "Guitarmine",
                    "score": 28,
                    "created_utc": 1652936724.0,
                    "response": "Crypto-centric and specific colleges and universities... I highly doubt that. At the moment there are few valid cases for blockchains and I see no reason why there would be universities somehow focusing on cryptos anymore than they are focusing on JavaScript or HTML.\n\nTons of universities already touch upon blockchains, smart contracts etc. and I don't expect this to get any more attention and this is from someone working in the industry.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i977s6l",
                            "author": "Ancient_Guarantee_22",
                            "score": 1,
                            "created_utc": 1652967170.0,
                            "response": "Please go see how Walmart uses the blockchain for recall management of food.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i98wkff",
                                    "author": "deviantkindle",
                                    "score": 2,
                                    "created_utc": 1652992890.0,
                                    "response": "And for those of you who won't search because you \"know there's no valid use case\", [here you go.](https://pixelplex.io/blog/walmart-strives-for-food-safety-using-blockchain/)",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i99345v",
                                            "author": "scottymtp",
                                            "score": 2,
                                            "created_utc": 1652995882.0,
                                            "response": "I've read through it. Seems like a database where you upload certificates of authenticity would work fine for this use case.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i96lwoe",
                            "author": "DeliciousNectarine8",
                            "score": -9,
                            "created_utc": 1652953348.0,
                            "response": "Okay you build MORE use cases the more you introduce new brains into the space. Building these educational institutions to teach about crypto and discover new talent will give the crypto space a huge advantage for the long term.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i970ubk",
                                    "author": "Guitarmine",
                                    "score": 4,
                                    "created_utc": 1652963670.0,
                                    "response": "Typically there's a problem that needs to be solved and then there's a solution. You rarely come up with problems to solve. That's fundamentally the problem with Blockchain and cryptos. The real life uses cases are extremely limited where a trusted party (database) wouldn't be faster, cheaper and better.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i97m1su",
                                            "author": "pomelorosado",
                                            "score": 7,
                                            "created_utc": 1652973381.0,
                                            "response": "The history of technology and inventions are the opposite first you have a technology and then you are able to solve new problems.\n\nWhen electricity was discovered nobody knew that we were going to build three-phase motors.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9fwxw0",
                            "author": "4rindam",
                            "score": 1,
                            "created_utc": 1653135239.0,
                            "response": "they can certainly focus on the defi aspect. i mean defi only going to develop from here and eventually we will see people teaching on concepts like impermanent loss, liquidty pools and all i guess.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i964tne",
                    "author": "stealthgerbil",
                    "score": 13,
                    "created_utc": 1652938768.0,
                    "response": "I think most comp sci majors could program a basic blockchain already, the core concept is not super complicated.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i96ah6w",
                            "author": "McMasilmof",
                            "score": 3,
                            "created_utc": 1652943152.0,
                            "response": "Most comp sci students should learn each concept that crypto implements at some point anyway, i see no reason to make it its own.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i96lbqw",
                            "author": "DeliciousNectarine8",
                            "score": 1,
                            "created_utc": 1652952838.0,
                            "response": "True but it does (and should) get harder and harder by each year with more and more innovations and ways to solve scalability issues and other problems",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9636vs",
                    "author": "anaanamuss",
                    "score": 3,
                    "created_utc": 1652937623.0,
                    "response": "More here if you’d like\n\nhttps://www.classcentral.com/subject/blockchain-cryptocurrency",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i96bejv",
                    "author": "Schedule-Muted",
                    "score": 3,
                    "created_utc": 1652943907.0,
                    "response": "in my country it had already started.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i96jz88",
                    "author": "remag293",
                    "score": 2,
                    "created_utc": 1652951605.0,
                    "response": "CSU has a block chain course made by Joseph Gersch which was amazing",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i977wwg",
                    "author": "NobleFraud",
                    "score": 2,
                    "created_utc": 1652967233.0,
                    "response": "It's called cryptography or computer security classes Or distributed systems. It's already there.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i98xypv",
                    "author": "Nature_-1",
                    "score": 2,
                    "created_utc": 1652993539.0,
                    "response": "Seems you’re behind schedule. Because some some weeks back, I saw an article about DEIP being linked to various universities. They also have courses on Web3 and how to build on the creator economy",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9g6i9w",
                            "author": "kutchedwaga",
                            "score": 1,
                            "created_utc": 1653140809.0,
                            "response": "Teaching it in school will really accelerate the widespread adoption of cryptocurrency but u think the adoption is mainly limited by the flaw of lack of privacy which has been made clear by the applications coming out of xmr and scrt. Scrt has particularly increased the utility of NFTs.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i96fdm8",
                    "author": "mypussydoesbackflips",
                    "score": 2,
                    "created_utc": 1652947388.0,
                    "response": "My friend had an 80 y/o teaching blockchain basics (basically “what is a ledger 101” ) and the guy was eating olives straight out the jar during class",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i96fpnx",
                    "author": "AlexWasTakenWasTaken",
                    "score": 2,
                    "created_utc": 1652947692.0,
                    "response": "I studied economics at the university of Basel and in 2016 I already had a lecture about \"bitcoin, blockchain and cryptoassets\". We're already there.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i97i2wx",
                            "author": "shinypenny01",
                            "score": 2,
                            "created_utc": 1652971724.0,
                            "response": ">We're already there.\n\nOne lecture is not the same as specialized degree programs.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i98ux1g",
                                    "author": "AlexWasTakenWasTaken",
                                    "score": 1,
                                    "created_utc": 1652991595.0,
                                    "response": "Ah well I don't think you can make a full degree just on blockchain. Blockchain itself is quite simple. What you can code and deploy on it is still based on regular computer science. It's not like coding on blockchain will be entirely different.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9c7gk1",
                                            "author": "shinypenny01",
                                            "score": 1,
                                            "created_utc": 1653059845.0,
                                            "response": "Most CS graduates will graduate with zero knowledge of applications of programing as it relates to blockchains. CS departments are going to change that slowly. This and Data Science are the two big applied areas that traditional CS graduates are not very well equipped for without some applied courses in the discipline. It is starting to change curriculums. \n\nDoesn't mean it's a blockchain degree, but a CS degree with a minor in fintech/blockchain/data science has value on the job market.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i977nxr",
                    "author": "Ancient_Guarantee_22",
                    "score": 1,
                    "created_utc": 1652967114.0,
                    "response": "University of Arkansas has a whole school of blockchain backed by the Walton’s who currently use blockchain to identify recalls in their stores. \n\nThe rest of the world needs to catch up.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i984fzn",
                    "author": "sibov8",
                    "score": 1,
                    "created_utc": 1652980796.0,
                    "response": "We are seeing mass adoption happen slowly but surely. I think this EduDAO initiative is going to be massive for adoption. Exciting stuff.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i98x4g5",
                    "author": "Ok-Persimmon-2220",
                    "score": 1,
                    "created_utc": 1652993154.0,
                    "response": "A course I'd like to see is \"design patterns for smart contract applications.\"\n\nMaybe there is one already?\n\nIt would cover things like composability, on-chain vs off-chain computation, security auditing, and product release/update cycles.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9969mj",
                    "author": "Optimal-Barnacle2771",
                    "score": 1,
                    "created_utc": 1652997316.0,
                    "response": "I took a blockchain and cryptocurrency class at my college last year. It was a good introductory course, but I wish it had gone into more technicals and looked at the programming side of things more. Instead we focused on consensus, mining, and the important differences that a linked list has from a simple array or other similar data structures. I did learn a lot about hashing algorithms and the importance of private and public keys as well, which was very interesting.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9fn2ae",
                    "author": "MeatCrap",
                    "score": 1,
                    "created_utc": 1653127452.0,
                    "response": "There should also be classes about data ethics and considerations. Data is going to become a huge problems because major companies control more than 60% of the world's data.Projects like Ocean Protocol or Graph are already adressing the issue, but we still have a long way to go.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9io8r9",
                    "author": "Future-Goose7",
                    "score": 1,
                    "created_utc": 1653185393.0,
                    "response": "I think several computer science courses already cover the basics.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9m7tb1",
                    "author": "Bingopajama222",
                    "score": 1,
                    "created_utc": 1653258927.0,
                    "response": "IMAGINE! The mass adoption is already in full speed imho. Web3 and DEFI are growing bigger everyday. My favourite projects are delivering promises constantly such as Cardano, Package Portal, Mars Colony. Also can't wait until the FLD and TEAM TGE. Both will have a FOMO effect in the space. FLUID is  positioned to capitalize on this huge market by charging fees on any transactions that the platform generates, which the exchanges would otherwise not have done. The crypto space is getting more exciting!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9mat20",
                    "author": "unilorite",
                    "score": 1,
                    "created_utc": 1653260446.0,
                    "response": "This could actually inspire the next generation of crypto developers, I’m already surprised with what some devs are building in relations to NTF utility, dapps and even DeFi products. The Unique network devs working on NFT Re-fungibility and Nesting keeps making me impressed with how far the technology has come.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9maxb2",
                    "author": "MakeItRelevant",
                    "score": 1,
                    "created_utc": 1653260505.0,
                    "response": "I'd be happy to see universities offering PhD courses on crypto. We need quality people.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i962dlw",
                    "author": "Zombiefied7",
                    "score": -4,
                    "created_utc": 1652937057.0,
                    "response": "Lmao you don’t need classes for that it’s completely trivial like 1 lecture in some IT class will do it",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i96lplw",
                            "author": "DeliciousNectarine8",
                            "score": 2,
                            "created_utc": 1652953184.0,
                            "response": "So you mean building Web3 and DeFi spaces is easy? lol if that were true then it wouldn't have taken geniuses like Vitalik or Charles to come up with these crypto projects. Based on your logic, literally anyone in coding 101 could make a crypto project. That sir, is not true.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i97r4es",
                    "author": "nikgeo25",
                    "score": -1,
                    "created_utc": 1652975444.0,
                    "response": "Some cryptography classes cover blockchain afaik. Good for students to set up their own scams :)",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}