{
    "subreddit": "CryptoTechnology",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "v13xmq",
            "title": "an important read for the future of crypto",
            "url": "https://www.reddit.com/r/CryptoTechnology/comments/v13xmq/an_important_read_for_the_future_of_crypto/",
            "author": "pillow91aussie",
            "created_utc": 1653927996.0,
            "score": 0,
            "num_comments": 3,
            "subreddit": "CryptoTechnology",
            "selftext": "Snipit from the article\n\nA lot of blockchain-related news these days is saying that a bank X or a corporation Y will use a \"blockchain\" to \"reduce costs\". \n\nThis is just another buzzword considered by big banksters as another tool to extract value from everywhere in a more efficient way and save on cutting job positions.\n\nWhat I witnessed in the early years around online forums users is this,\n\nCryptocurrency should provide tools to enrich ordinary people. Small businesses that are struggling to make ends meet, not big depersonalized financial capital. This is what inspired me. This is my dream.\n\nIn the eyes of the original broad community vision, the tools of a cryptocurrency should allow people to do economic activity whatever the business size, geographic location, or interest rates set by big players.\n\nThe tools should allow people to make contracts (digital, self-enforcing, reasonable smart contracts) regardless of the differences in jurisdictions, traditions, followed business practices, etc.\n\nI hope Ergo will be helpful here. Thousands of small cooperatives and individual entrepreneurs are much more critical to healthy and sustainable wealth growth around the globe compared to a couple of corporations hiding profits in offshore heavens.\n\nLet's consider the use and integration with communities, cooperative federations, nonprofit foundations, and philanthropic trusts. \n\nLet's try to create grassroots finance. \n\nYes, many other things can be built, but I think my goal should not be forgotten. Smart contracts that help create value and protect the common people\n\nRead more at\nhttps://ergoplatform.org/en/blog/2021-04-26-the-ergo-manifesto/",
            "stickied": false,
            "comments": [
                {
                    "id": "iakecnh",
                    "author": "endlessinquiry",
                    "score": 5,
                    "created_utc": 1653931674.0,
                    "response": "Ergo is great, but this isn’t a place to shill.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iakugja",
                            "author": "lexymon",
                            "score": 1,
                            "created_utc": 1653939030.0,
                            "response": "Ergonauts are probably the only community in crypto which tells each other not to shill. And I like that. ;)",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}