{
    "subreddit": "CryptoMarkets",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uuzaz9",
            "title": "Bill Gates defends 60% tax for billionaires",
            "url": "https://digesttime.com/2022/05/20/bill-gates-defends-60-tax-for-billionaires",
            "author": "thefoodboylover",
            "created_utc": 1653177936.0,
            "score": 296,
            "num_comments": 65,
            "subreddit": "CryptoMarkets",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9ico2b",
                    "author": "FuturePowerful",
                    "score": 46,
                    "created_utc": 1653179133.0,
                    "response": "Well if there not going to invest it in improving anything just pleasure goods yah mabey he has a point",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ikumc",
                            "author": "stayyfr0styy",
                            "score": 31,
                            "created_utc": 1653183554.0,
                            "response": "It doesn’t matter, they won’t have to pay anything if they don’t sell stock or realize a gain, so he gets free virtue signal points.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9iog0o",
                                    "author": "alreadythrownaway625",
                                    "score": 20,
                                    "created_utc": 1653185501.0,
                                    "response": "This is what I came here to say this is a publicity stunt knowing it doesn't affect him because he won't draw income.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9iwwew",
                                            "author": "McMarbles",
                                            "score": 17,
                                            "created_utc": 1653190230.0,
                                            "response": "I don't think most people realize he can borrow/collateralize against his (unsold ie untaxed) stock to cover the basic shit we all use our (taxable) income for. And that this is what most wealthy people do to avoid the \"income\" tax...\n\nThe rules really are different for them.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9j32j8",
                                                    "author": "_cs",
                                                    "score": 5,
                                                    "created_utc": 1653194252.0,
                                                    "response": "If they’re borrowing or collateralizing against it, doesn’t that mean they still have to pay the money? Could you give an example? Like if he can get a loan to buy a $20m house using MS stock as collateral, he still has to pay the $20m at some point. What am I missing?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9j5ymk",
                                                            "author": "Fibocrypto",
                                                            "score": 5,
                                                            "created_utc": 1653196318.0,
                                                            "response": "He has a foundation that will never be subject to the tax",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "i9j5ypr",
                                                            "author": "TheHorror545",
                                                            "score": 3,
                                                            "created_utc": 1653196319.0,
                                                            "response": "I think it goes something like this:\n\nPut money into offshore tax haven investment fund. Borrow money from the fund. The collateral for the loan is the money remaining in the fund. Never pay it back. When he dies the fund collects the debt from the collateral (the money already in the fund). The fund then gets inherited tax free since it is in a tax haven.",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "i9j5jgt",
                                                            "author": "NoEatBatman",
                                                            "score": 6,
                                                            "created_utc": 1653196009.0,
                                                            "response": "the obvious... if you are -20m on paper and you get dividents for 21m then theoretically you only made 1mil income that year, but wait cause you also had a 1 mil personal credit and you are actually at 0, and that my friend is exactly how Jeff Bozo paid 0% in taxes but managed to make a 500mil yacht for himself",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i9j6mop",
                                                    "author": "Fibocrypto",
                                                    "score": 1,
                                                    "created_utc": 1653196821.0,
                                                    "response": "The rules are no different for gates than anyone else .\nThe only difference is that the wealthy structure thier money to avoid taxes and alot of us don't for various reasons .\nGates has his foundation and has no intent of ever paying that tax .",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9ip6xm",
                                            "author": "Apart_Number_2792",
                                            "score": 5,
                                            "created_utc": 1653185905.0,
                                            "response": "Exactly",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9j63l6",
                            "author": "resueman__",
                            "score": 1,
                            "created_utc": 1653196423.0,
                            "response": "If they're not investing it, it's effectively short term deflation, and they're being indirectly taxed by inflation though. It's kind of a moot point though, since the overwhelming majority of their wealth is usually just ownership of a company, and that company will still be providing whatever service it is that made it valuable in the first place.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9iqsxf",
                    "author": "Lobstershaft",
                    "score": 18,
                    "created_utc": 1653186812.0,
                    "response": "Watch the \"temporarily disgraced billionaires\" lose their minds over this",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9j610q",
                            "author": "Justalildwinkypoo",
                            "score": 2,
                            "created_utc": 1653196368.0,
                            "response": "They’re here, and they’re definitely losing their minds already 😂",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9j5v0e",
                    "author": "Fibocrypto",
                    "score": 12,
                    "created_utc": 1653196244.0,
                    "response": "The bill and Melinda gates foundation will not pay any of that tax rate . Foundations , Trusts , Charities have massive tax advantages . Bill gates has no intention of paying any of that tax .",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9in60u",
                    "author": "watercolorkiller",
                    "score": 15,
                    "created_utc": 1653184810.0,
                    "response": "Of course, that way nobody can catch up. He already has his money, it doesn’t matter to him if he’s taxed on future profits.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9j49ni",
                            "author": "PM_Me_1_Funny_Thing",
                            "score": 8,
                            "created_utc": 1653195088.0,
                            "response": "Nobody can catch up?\n\nSince this is a tax on the ultrawealthy, do you actually think Bill Gates cares if other ultrawealthy people have as much money as he does?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9j68n4",
                                    "author": "Fibocrypto",
                                    "score": -3,
                                    "created_utc": 1653196529.0,
                                    "response": "Yes bill gates cares about what the other super wealthy has . Bill gates has the bill and Melinda gates foundation which will not be taxed by these changes in the tax code .\nThe will help gates keep his wealth as the others who fail to create a foundation of there own lose Thier wealth because of the taxes .",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9j7xec",
                                            "author": "chris-c-thomas",
                                            "score": 3,
                                            "created_utc": 1653197821.0,
                                            "response": "You’re argument doesn’t make your point at all. He has an organization that won’t get taxed like other billionaires will but ultimately that doesn’t prove whether he cares or not what money his “competition” has. He’s way past that point in his life.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9j8i1g",
                                                    "author": "Fibocrypto",
                                                    "score": -4,
                                                    "created_utc": 1653198272.0,
                                                    "response": "You will need to do your own research on who bill gates is as a human being . I'm not here to argue over what you think of what I think . Do some research on him and watch some of the court video of him testifying over Microsoft Monopoly tactics and then maybe you will understand where I'm coming from .\nYou should not trust bill gates",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9j8u0v",
                                                            "author": "chris-c-thomas",
                                                            "score": 5,
                                                            "created_utc": 1653198538.0,
                                                            "response": "I trust Bill Gates just fine. I’ve done plenty of research and even work in the CS tech field for the past decade. Has he been a great human in his past? Not really in some regards. But is he some evil conspirator that current media is trying to paint him out to be? No. No he’s not.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9j91y2",
                                                                    "author": "Fibocrypto",
                                                                    "score": -3,
                                                                    "created_utc": 1653198714.0,
                                                                    "response": "I do not trust him and I never will . I don't care what the media says . At one point in time I lived only a few miles from Microsoft head quarters and I don't know every detail of bill gates but I have changed my view of who he is as a human being . You want to trust him go ahead but I never will .\nThe guy is lower than dirt as far as I'm concerned .",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9jaro8",
                                                                            "author": "Missy_Agg-a-ravation",
                                                                            "score": 5,
                                                                            "created_utc": 1653200117.0,
                                                                            "response": "How does “living a few miles from Microsoft headquarters” tell you anything about who Bill Gates really is? Do you have incredible hearing?",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i9jbsla",
                                                                                    "author": "Fibocrypto",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653200959.0,
                                                                                    "response": "It means nothing .",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                },
                                                                                {
                                                                                    "id": "i9jbvrl",
                                                                                    "author": "friebel",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653201032.0,
                                                                                    "response": "Well, he obviously have seen the grey aliens wandering around the facility.",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9j6l33",
                            "author": "resueman__",
                            "score": 2,
                            "created_utc": 1653196789.0,
                            "response": "It really comes down to how it's taxed. Income tax isn't going to affect him, or any other billionaire. Capital gains tax might affect them a little bit, but they still have ways to avoid it. Wealth tax is going to just be really *really* complicated to figure out the implications of.\n\nFrom the article, it sounds like he's not proposing any specific policy, just saying their effective tax rate should, somehow, be raised towards 60%, and that he'd support an estate tax of at least 60%.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9iwy2x",
                    "author": "bigLeafTree",
                    "score": 4,
                    "created_utc": 1653190257.0,
                    "response": "Many millionaires have become rich thanks to government contracts. That's were the big bucks are. Of course they will agree with more tax, that tax ends up in their hands as the government spends it.\n\n  And indeed, once you are rich, you want as many regulations and taxes as possible to avoid other competitors appearing.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9iwyiy",
                    "author": "Robin2Fast2Furious",
                    "score": 3,
                    "created_utc": 1653190264.0,
                    "response": "The 60% tax would not affect him since his wealth and income are donated to his foundation where his family oversees the proceeds and essentially get paid “salaries”.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9izf3b",
                            "author": "2heads1shaft",
                            "score": 4,
                            "created_utc": 1653191808.0,
                            "response": "Source?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9j1he6",
                                    "author": "CryptoChief",
                                    "score": -1,
                                    "created_utc": 1653193176.0,
                                    "response": "Google",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9j9w11",
                            "author": "LeroyJenkensJimbo",
                            "score": 1,
                            "created_utc": 1653199388.0,
                            "response": "Also, the ultra wealth usually just avoid high taxes with off shore accounting and all kinds of \"donations\". Elon is pretty rare in that he actually paid his",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9idp90",
                    "author": "dmagee33",
                    "score": -7,
                    "created_utc": 1653179701.0,
                    "response": "Who cares. The guy is nuts",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9j0y07",
                    "author": "2diceMisplaced",
                    "score": -1,
                    "created_utc": 1653192815.0,
                    "response": "This is stupid. There is NOTHING that prevents billionaires from giving more money to the government. They don’t get brownie points for telling me that the problem is that their philanthropy isn’t coerced enough.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9j13cw",
                            "author": "2diceMisplaced",
                            "score": 0,
                            "created_utc": 1653192914.0,
                            "response": "Yup… Here it is:\n\nhttps://fiscal.treasury.gov/public/gifts-to-government.html",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9if4nk",
                    "author": "reasonandmadness",
                    "score": -14,
                    "created_utc": 1653180479.0,
                    "response": "Tell you what, there’s barely any reason to stay here as it is. Plenty of other countries around the world for billionaires.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ihjy5",
                            "author": "SailsAk",
                            "score": 16,
                            "created_utc": 1653181790.0,
                            "response": "Doing business with the American economy is almost essential for any billionaire.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9ihn2o",
                                    "author": "reasonandmadness",
                                    "score": -12,
                                    "created_utc": 1653181836.0,
                                    "response": "Only to Americans.\n\nRegardless, that doesn’t mean they need to live here.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9j5ho8",
                    "author": "weepingswords",
                    "score": -2,
                    "created_utc": 1653195973.0,
                    "response": "Taxation is theft. If he wants to donate his money, that’s his decision. To call for other people’s money to be stolen is immoral.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9j1myl",
                    "author": "LayingWaste",
                    "score": 0,
                    "created_utc": 1653193276.0,
                    "response": "Sure, to secure his place at the top. How about me make it retroactive?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9j25yk",
                    "author": "we_are_all_satoshi_2",
                    "score": 0,
                    "created_utc": 1653193638.0,
                    "response": "Boomer that became successful from low tax era wants to pull the ladder u behind him",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9j2k93",
                    "author": "dathanvp",
                    "score": 0,
                    "created_utc": 1653193908.0,
                    "response": "A billionaire is rich enough to be poor on paper and not pay taxes.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9iyroj",
                    "author": "fnetma",
                    "score": -2,
                    "created_utc": 1653191387.0,
                    "response": "Give the government an inch they take a mile. All the money problems and wealth gaps are caused by government and the fed.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9j6ch0",
                    "author": "IronHayden11",
                    "score": 1,
                    "created_utc": 1653196611.0,
                    "response": "Put your hands down, Bill.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9j6he2",
                    "author": "Fibocrypto",
                    "score": 1,
                    "created_utc": 1653196712.0,
                    "response": "Let's all pay our fair share ? \nTax the rich through out history has always ended up as tax everyone more !",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9j8qgj",
                    "author": "NotPresidentChump",
                    "score": 1,
                    "created_utc": 1653198461.0,
                    "response": "There’s absolutely nothing from stopping him from giving 100% to the government but I suspect he doesn’t want to give up his new beachfront home in San Diego. \n\nhttps://fiscal.treasury.gov/public/gifts-to-government.html",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9jegyr",
                    "author": "funkystonrt",
                    "score": 1,
                    "created_utc": 1653203259.0,
                    "response": "Its not the problem that the government needs more money. The yearly tax income in the usa is around 3.5 trillion. Yearly. The problem is, that politicians have crazy spending habits that nobody ever (can) check or disagree with. If they run out if money, they dont look for ways to save/spend less but look for ways to get more money out of the people. If we would make them spend less we could do a lot with that money. I would start with paying politicians less money^^",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9jejus",
                    "author": "sirgunape",
                    "score": 1,
                    "created_utc": 1653203331.0,
                    "response": "well sure he is",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9j098n",
                    "author": "KlutzMat",
                    "score": 0,
                    "created_utc": 1653192348.0,
                    "response": "Do you pay taxes when you borrow money?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9j1teh",
                            "author": "sstrombe",
                            "score": 1,
                            "created_utc": 1653193399.0,
                            "response": "No, you don't, and in many cases interest payments on loans can actually be written off of income for taxes, since they loans are liabilities, not assets.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9j0vpp",
                            "author": "KingReef90",
                            "score": -1,
                            "created_utc": 1653192772.0,
                            "response": "It counts as income so I believe so.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9j317o",
                                    "author": "gigahydra",
                                    "score": 2,
                                    "created_utc": 1653194226.0,
                                    "response": "LMAO wow people must sure pay a ton of taxes those first few years of adult-hood, what with all the income they're receiving in student loans.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9j9q5c",
                    "author": "LeroyJenkensJimbo",
                    "score": 0,
                    "created_utc": 1653199259.0,
                    "response": "LOL, ol' Billy is ok with 60% on billionaires because he has more offshore accounts. They're not paying that. Reagonomics showed lower taxes actually improved billionaire paying of taxes and less avoidance.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9jar1c",
                    "author": "Mountain_Ad7812",
                    "score": 0,
                    "created_utc": 1653200102.0,
                    "response": "I think he’s better than musk",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}