{
    "subreddit": "CryptoMarkets",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uxicxp",
            "title": "We have never had a crypto market during recession, you might want to think about it if you want your money intact",
            "url": "https://www.reddit.com/r/CryptoMarkets/comments/uxicxp/we_have_never_had_a_crypto_market_during/",
            "author": "Burdrgts",
            "created_utc": 1653488153.0,
            "score": 6,
            "num_comments": 15,
            "subreddit": "CryptoMarkets",
            "selftext": "We are headed towards   recession, and this current situation in Ukraine is almost making it a certainty. How does this affect the crypto market you might ask ? Well no one knows because  during the last recession there was no such thing as a crypto market.   \n\n\nNow my opinion is that this will be felt deeply in the crypto market because when people start worrying about having to put food on the table and gas in their cars the last thing on their minds will be tokens NFTs and currencies that could crash at any time, and especially in those countries that aren't In North America and west Europe.  \n\n\nIn my opinion a lot of people will sell off what currency they have in order to have cash on hand.   \n\n\nFor those of us who are fortunate enough not to worry about food and gas, I think we should stay in the game but diversify our funds to companies that also use blockchain technology but don't necessarily only have cryptocurrency but are engaged in other sectors of commerce like telecommunications, sustainable energy for example what WePower, PowerLedger, World Mobile Token, Telcoin just to name a few for you to  understand where I am going with this.  \n\n\nThink about it, what makes crypto special is blockchain, and blockchain is the future for many sectors and not just a way to make BTC and other currencies and I believe that these other applications might be more recession proof.  \n\n\nDo you share my sentiments, what are your opinions on this subject, is my reasoning correct ?",
            "stickied": false,
            "comments": [
                {
                    "id": "i9xu4y9",
                    "author": "mrdeezy",
                    "score": 5,
                    "created_utc": 1653489223.0,
                    "response": "We are in a recession, Anyone recommending buying any crypto that isn’t dirt cheap btc or eth just simply has zero clue what they are talking about. Mostly all of these coins are just worthless junk. Then economic downturn will prove that.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9yb2zf",
                    "author": "HannsGoober",
                    "score": 3,
                    "created_utc": 1653495989.0,
                    "response": "We are already in a recession. It will be good for the crypto space because it will kill off a lot of the shit coins. The ones that survive will come out the other side stronger.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9y3tic",
                    "author": "socalquest",
                    "score": -1,
                    "created_utc": 1653493148.0,
                    "response": "Zoom out to year 2030. This recession/crash will all be forgotten. You won't even remember it. LOL Don't be so short-term!!! Think BIG!!! GLTA!!!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9yf39m",
                            "author": "crypto_crypto_guy",
                            "score": 2,
                            "created_utc": 1653497542.0,
                            "response": "Maybe, just maybe, your bags wont remember it, but people still remember 2008…",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9xxd8w",
                    "author": "Gaujo",
                    "score": -2,
                    "created_utc": 1653490548.0,
                    "response": "Exchange your bags for XMR",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9yn6wd",
                            "author": "IBoughtAllDips",
                            "score": 0,
                            "created_utc": 1653500690.0,
                            "response": "Why would we want to get extremely broke?",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9yrhcc",
                            "author": "robot4000",
                            "score": -1,
                            "created_utc": 1653502375.0,
                            "response": "Yeah, right at the top.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9xye0g",
                    "author": "FlakeMuse",
                    "score": 0,
                    "created_utc": 1653490960.0,
                    "response": "Ocean Protocol for mass data consumption as the market’s fundamentally change.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9yvw5q",
                    "author": "DrizzySnipes",
                    "score": 0,
                    "created_utc": 1653504102.0,
                    "response": "I heard you can get 20% Apr basically risk free with Anchor protocol.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uxicup",
            "title": "Is it worth to reallocate an alt with a lower loss towards \"blue chip\" alts with a higher loss %?",
            "url": "https://www.reddit.com/r/CryptoMarkets/comments/uxicup/is_it_worth_to_reallocate_an_alt_with_a_lower/",
            "author": "Aheuhue",
            "created_utc": 1653488146.0,
            "score": 7,
            "num_comments": 16,
            "subreddit": "CryptoMarkets",
            "selftext": "Title. Basically a risk management question for a long term portfolio. \n\nI'm trying to rebalance a little and be a little more hands off. I have a few alts that have a lower P&L than the likes of DOT, LINK etc. I'm confident my alts will survive the bear market but there's more room for downfall. \n\nI would be selling at a loss but also lowering overall loss % on more established coins.\n\nWhat's your take on risk off?",
            "stickied": false,
            "comments": [
                {
                    "id": "i9zodsn",
                    "author": "CartographerWorth649",
                    "score": 2,
                    "created_utc": 1653515815.0,
                    "response": "I'm more of an eternal HODLer, or close to it! I believe I'm a good buyer and a terrible seller, hence, recognizing my strengths and weaknesses I'll just HODL my alts from the all mighty Ethereum to the tiny DAFI with some tears in my eyes due to the current losses but with a clear image of the reasons which made me buy them on the first place!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaald6o",
                            "author": "tsurutatdk",
                            "score": 2,
                            "created_utc": 1653728213.0,
                            "response": "Lol. Reminds me of buying KGO and HPS and i'm at loss and don't want to think it anymore for i know it will recover fast once market is becoming stable. I also have FWT and MATIC but since i bought at cheaper price, i'm still in gain and don't want to sell due to its major developments.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iaav6n6",
                                    "author": "CartographerWorth649",
                                    "score": 1,
                                    "created_utc": 1653736835.0,
                                    "response": "I guess the best corse of action is just sitting tight",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9xurog",
                    "author": "mrdeezy",
                    "score": 1,
                    "created_utc": 1653489487.0,
                    "response": "It depends on the project and how established it is. \nExample I sold 5k worth of matic at .60 and bought I think it was 2.3 ethereum.\nI sold the ethereum for 4600 each. \nIf I held that matic and sold it near the top it would of been around 24k instead of 12k. \nJunk shitty In style coins. Sell them. Good established projects just keep them.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9y358y",
                            "author": "Aheuhue",
                            "score": 1,
                            "created_utc": 1653492882.0,
                            "response": "I remember that legendary run haha. Ran out of matic to sell somewhere halfway through.\n\nIn a bull market it you do get a bigger risk/reward though so it's not surprising vs reallocating to btc and eth.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9yd6lc",
                    "author": "HannsGoober",
                    "score": 1,
                    "created_utc": 1653496806.0,
                    "response": "Sell most of your alt coins, buy BTC/ETH. Or ride them into the ground and accept that they may never recover. This recession will kill off a lot of these alt coins, even some that are good projects. If history has told us anything, the top 10 3 years from now won't likely be all the same as they are today. You can usually count on BTC and ETH but every thing else in my opinion is a toss up.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9yjmiv",
                    "author": "Aheuhue",
                    "score": 1,
                    "created_utc": 1653499304.0,
                    "response": "Also true. BTC is usually the answer regardless, but I suppose it could be fun to run a little experiment, track the results and check back in the future. Might as well learn something out of it.\n\nEither way thank you for sharing your insight",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia2x3dj",
                    "author": "Asher_TC",
                    "score": 1,
                    "created_utc": 1653581457.0,
                    "response": "Now might not be a great time to sell but we e could go lower than we currently are. I'm increasing my Alts bags gradually from here and I will DCA through the bear season. \n\nOCEAN V4 will unlock new narratives (data NFTs) I'm looking forward to the launch\n\nEEUR is my best stablecoin as it's fully backed\n\nFor a good Dex, I choose GreenHouse. Liquidity Dex for L1 chains",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia2y7rg",
                    "author": "Umarzy",
                    "score": 1,
                    "created_utc": 1653581901.0,
                    "response": "I think it's worth it. Could remember cutting a loss on a play sometime last year & putting it entirely in ETH which worked pretty well. Later sold the ETH at $3k, a good trade.\n\nThough, I believe if one could continue to DCA on alts \\[especially with low FDV\\], they will outperform potential blue chips eventually in terms of ROI. ATOM hasn't really done much for me, the likes of SCRT & CTSI were much better in returns.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia3p109",
                    "author": "Despicable2020",
                    "score": 1,
                    "created_utc": 1653592660.0,
                    "response": "It pretty much depends on the project and how much you believe in it. I personally have no issues with riding my alts through the bear market if they are solid. I won't even think twice about riding FLUID in Q3 after TGE. Fluid is a unique project that is solving the problem of high latency on exchanges so its one that looks like its worth checking out.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}