{
    "subreddit": "CryptoMarkets",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "usj6gv",
            "title": "Besides the very high probability of a long term uptrend it's all just chaos and the butterfly effect.",
            "url": "https://www.reddit.com/r/CryptoMarkets/comments/usj6gv/besides_the_very_high_probability_of_a_long_term/",
            "author": "Calibre1972",
            "created_utc": 1652897808.0,
            "score": 2,
            "num_comments": 1,
            "subreddit": "CryptoMarkets",
            "selftext": "Let's say in the last 3 years there have been two bullmarkets of Bitcoin / Cryptocurrency: from end of 2020 to spring 2021 and summer 2021 until November 2021. \nSince then I did not find one single reasonable explanation, what could have triggered these bullmarkets. \nIs it really just chaotic,when fomo kicks in - as the result of chaotic market processes and trading algorithms? \nIt should be possible to analyze the preceding transactions and the trades on the BTC blockchain at the start of the bullrun. Have there been certain whales buying? Or was it a lot of small trades? Is the data on the blockchain to big to analyze and cluster. Or is this a well kept secret only the exchanges do know? \n\nSomebody in here must have an answer to this. \nWould be happy to read your thoughts.",
            "stickied": false,
            "comments": [
                {
                    "id": "i97jvju",
                    "author": "ShabbySuburb",
                    "score": 1,
                    "created_utc": 1652972471.0,
                    "response": "If you are interested, you have to dig deeper to understand. It's a market, traders make money trading exchanges, Centralized - binance, Decentralized - wowswap, NFT - opensea, investing in projects at the seed stage. What I mean to say is that the bull market starts from factors that interact with each other from different areas. I think that the next bull market will be influenced by DeFi and web3",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}