{
    "subreddit": "CryptoMarkets",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uwwu64",
            "title": "Out of all utility based projects I think Polygon might be one of the best out there",
            "url": "https://www.reddit.com/r/CryptoMarkets/comments/uwwu64/out_of_all_utility_based_projects_i_think_polygon/",
            "author": "Federal-Alfalfa",
            "created_utc": 1653415128.0,
            "score": 1,
            "num_comments": 5,
            "subreddit": "CryptoMarkets",
            "selftext": "I’m not the kind of guy to invest in hype coins and shitcoins. I really don’t mean to be the guy who says “im in it for the tech” but I really appreciate a project with high quality technology and use cases.\n\nAfter using so many chains and services, I found that Polygon is actually one of the most diverse in its use cases.\n\nIt doesn’t just settle as a scaling solution. It literally has an entire ecosystem going on that is capable of competing with entire L1s. This is even evident by the fact that at some point Polygon had more daily active users than Ethereum itself.\n\nAside from the fact that they’re currently highest performing scaling solution, they also have a bunch of deals that expand their use cases.\n\nTheir partnership with Stripe is one great example. The fact that the 5th most used payment app in the US chose Polygon as their scaling solution speaks a lot.\n\nSo you can basically use Polygon for payments, NFT minting, P2E games, private transactions (nightfall) and many more use cases to come.\n\nWhen it comes down to it, Polygon can do it all. And the fact that Polygon is this jack of all trades makes me really bullish on it long term cause we’ve yet to see a chain with this much diversity in its use cases and overall presence in the market.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9u3afz",
                    "author": "CointestAdmin",
                    "score": 1,
                    "created_utc": 1653415913.0,
                    "response": "Polygon [pros](/r/CryptoMarkets/comments/uwwu64/out_of_all_utility_based_projects_i_think_polygon/i9u3bmp/) & [cons](/r/CryptoMarkets/comments/uwwu64/out_of_all_utility_based_projects_i_think_polygon/i9u3c7b/) and related info are in the collapsed comments below. Pros and cons will change for every new post.Submit an argument in the [Cointest](https://www.reddit.com/r/CointestOfficial/wiki/cointest_policy) and potentially win [Moons](https://coinmarketcap.com/currencies/moon/). **Moon prizes by award for the Coin Inquiries category are: **1st - 300, 2nd - 150, 3rd - 75, and Best Analysis - 500.** \r\n\r\n---\r\n\r\nTo submit an MATIC pro-argument, [click here](https://www.reddit.com/r/CointestOfficial/comments/sife7l/coin_inquiries_polygon_proarguments_february_2022/). | To submit an MATIC con-argument, [click here](https://www.reddit.com/r/CointestOfficial/comments/sifeam/coin_inquiries_polygon_conarguments_february_2022/).",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}