{
    "subreddit": "CryptoMarkets",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uupgww",
            "title": "Fiat VS BTC What Do You Think?",
            "url": "https://i.redd.it/4wjlx4z6lu091.jpg",
            "author": "buzzbooz",
            "created_utc": 1653146977.0,
            "score": 218,
            "num_comments": 102,
            "subreddit": "CryptoMarkets",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9hb4u6",
                    "author": "Hulluja_Ajatuksia",
                    "score": 14,
                    "created_utc": 1653159799.0,
                    "response": "If Fiat is so terrible why does everyone keep using it to measure the value of BTC?\n\nWhy not cut ties and stop exchanging BTC for the evil Fiat?\n\nIs it, perhaps, because without the ability to convert it to Fiat value it isn't worth the electricity it wastes?\n\n\nYou can of course support BTC and other crypto without hating Fiat, most people do since their goal is to use crypto to get more Fiat... But doing so while insisting that Fiat is evil or worthless and you hate it is just silly.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9hd0rz",
                            "author": "buzzbooz",
                            "score": -1,
                            "created_utc": 1653160718.0,
                            "response": "In the article she says that crypto is based on nothing \n\nWell if she means scam coins like Luna then she have all the right \n\nImagine how many people lost their life savings investing defi projects buying useless coins got no use case and either it dumps on them for ever or they end up with a rug pull \n\nThere should be some restrictions on buying meme defi gamefi trash coins \nThey should have experience at least some time.\n\nBtc and ETH are the only legitimate coins",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9hseld",
                                    "author": "lakimens",
                                    "score": 2,
                                    "created_utc": 1653168376.0,
                                    "response": "But what are btc and eth based on? I'm not seeing an argument from your side",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9i538i",
                            "author": "Maidonoid",
                            "score": 1,
                            "created_utc": 1653174991.0,
                            "response": "Yeah well still, fuck fiat. Fiat is made to rob you of your hard earned wealth through inflation. One day, everything will be measured in BTC im sure of it.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9gu920",
                    "author": "SillyOldBillyBob",
                    "score": 47,
                    "created_utc": 1653151921.0,
                    "response": "All currency is a social construct. If everyone randomly decided tomorrow that its worthless it would be.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ha3uz",
                            "author": "RandomPlayerCSGO",
                            "score": 8,
                            "created_utc": 1653159304.0,
                            "response": "A currency is just a market good that is useful at storing value and using for exchange.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9hq38c",
                            "author": "ConceptualWeeb",
                            "score": 4,
                            "created_utc": 1653167189.0,
                            "response": "True we could be using bottle caps!… not that I’ve been saving all of mine for most of my life just in case, that would be crazy hahahahhaah",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9h2hmh",
                            "author": "FrickGoogle",
                            "score": 4,
                            "created_utc": 1653155666.0,
                            "response": "Social constructs are often times based on underlying factors",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9hbsek",
                                    "author": "SillyOldBillyBob",
                                    "score": 1,
                                    "created_utc": 1653160114.0,
                                    "response": "Bartering I think, I'll trade you my goods for yours.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9hbr2m",
                            "author": "0x1a3c3e7",
                            "score": -1,
                            "created_utc": 1653160095.0,
                            "response": ">All currency is a social construct. If everyone randomly decided tomorrow that its worthless it would be.\n\nThe term \"social construct\" is equivalent to \"arbitrary whim\".  That's what fiat is.  If everyone decided that fiat is worthless, it would be because it has no intrinsic value.\n\nMoney that exists without banks and legal tender laws has intrinsic value because it has special properties that make it useful as money all by itself.  Gold filled that niche for thousands of years before banks.  Now Bitcoin fills that niche better than gold ever did because it's more useful and easier to secure.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9hp2gg",
                                    "author": "circleuranus",
                                    "score": 2,
                                    "created_utc": 1653166682.0,
                                    "response": "> The term \"social construct\" is equivalent to \"arbitrary whim\".\n\nThis is utterly incorrect. There are entire branches of cultural anthropology devoted to studying and ethnography of the intricate systems and mediums of exchange historically and in modern times. Reciprocity is a vast, complex subject.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9hg4h6",
                                    "author": "Odd-Hair",
                                    "score": 1,
                                    "created_utc": 1653162237.0,
                                    "response": "BTC doesn't change the social contract fundamentally, it just changes the instrument",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9hvdxy",
                            "author": "FaceMobile6970",
                            "score": 1,
                            "created_utc": 1653169923.0,
                            "response": "This.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9hveu1",
                                    "author": "Anti-ThisBot-IB",
                                    "score": 0,
                                    "created_utc": 1653169936.0,
                                    "response": "Hey there FaceMobile6970! If you agree with someone else's comment, please leave an **upvote** instead of commenting **\"This.\"**! By upvoting instead, the original comment will be pushed to the top and be more visible to others, which is even better! Thanks! :)\n***\n ^(I am a bot! Visit) [^(r/InfinityBots)](https://reddit.com/r/InfinityBots) ^(to send your feedback! More info:) [^(Reddiquette)](https://www.reddithelp.com/hc/en-us/articles/205926439#wiki_in_regard_to_comments)",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9gstio",
                    "author": "0x1a3c3e7",
                    "score": 17,
                    "created_utc": 1653151263.0,
                    "response": "I assumed Bitcoin was a scam until I heard someone hate on it arbitrarily.  Only then was I motivated to actually google it and read the whitepaper.  That evening, I signed up on Coinbase and bought my first 0.3 BTC for $100.  It was the best investment I've ever made.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9gvpzp",
                            "author": "buzzbooz",
                            "score": 5,
                            "created_utc": 1653152583.0,
                            "response": "Imagine at that moment u decided to sell your house to all in at 100$",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9gwmw3",
                                    "author": "0x1a3c3e7",
                                    "score": 12,
                                    "created_utc": 1653152994.0,
                                    "response": "Working part-time at minimum wage, I was all-in at $100.  I've been buying BTC so that someday I can get a house.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9gyzrt",
                                            "author": "Ok-Toe1334",
                                            "score": 2,
                                            "created_utc": 1653154062.0,
                                            "response": "Bitcoin isn’t backed by a bank or has gold to have value of itself. You’re gambling in hoping that it’ll get you that house one day. Good luck mate but that’s all there is. Luck",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9gzs1y",
                                                    "author": "dfunkmedia",
                                                    "score": 6,
                                                    "created_utc": 1653154422.0,
                                                    "response": "\"backed by a bank\" - currencies 'backed by a bank' are down 50% since 2011, Bitcoin is up 30,000% since then\n\n'has gold' - US currency hasn't been backed by gold since 1972 M8\n\nIf you're going to make blanket statements, you should probably make sure they don't prove the opposite of what you're try to argue",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9h1uik",
                                                            "author": "Ok-Toe1334",
                                                            "score": 4,
                                                            "created_utc": 1653155369.0,
                                                            "response": "And what happens when the billionaire wants to withdraw all their money? It artificially money is it not? \n\nYou don’t need to be so butt hurt that someone dosent agree with a Bitcoin.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9hi895",
                                                                    "author": "dfunkmedia",
                                                                    "score": 2,
                                                                    "created_utc": 1653163287.0,
                                                                    "response": "You don't have to agree. I don't care if you do, and neither does BTC. Luna liquidated 31,000 BTC ($930 million USD) without the price so much as flinching 1% from their sale, and even a billion USD was barely 5% of the daily volume. If Elon Musk sold his entire TSLA portfolio and bought BTC with the intention of tanking it later he couldn't even buy 10% of the current supply. If the largest active BTC wallet today drained their entire supply in 5 minutes prices would rebound in an hour. It's well past the point where someone could short ladder attack it, so that point is also moot and based on ignorance of the market.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                },
                                                                {
                                                                    "id": "i9i3r9s",
                                                                    "author": "Wish_I_Was_Better1",
                                                                    "score": 1,
                                                                    "created_utc": 1653174277.0,
                                                                    "response": "If everyone goes to the bank tomorrow and withdraws everything. They won't have it. There is more money than there is physically cash. Money is made digitally by a central bank and there is a treasury that prints it as they need it. If everyone withdrew everything. It would take years to print it all. Or they would have to print $1000 notes. But it could still take a while... Also banks are legally allowed to spend \"some\" of your cash as long as they hold enough. Which makes it a legal Ponzi scheme. If you Google how much they need to hold in cash compared to customers deposits. You may be shocked. And probably a little worried if you have large amounts saved in a bank. I don't care that you don't care about bitcoin and you don't like it. I really couldn't give a shit but honestly look at the history of fiat. And tell me why you so blindly support fiat with so much passion that you will completely disregard any alternative to it.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "i9hsmcd",
                                                            "author": "lakimens",
                                                            "score": 1,
                                                            "created_utc": 1653168490.0,
                                                            "response": "Bro currencies are literally inflationary by design to encourage spending. Having a deflationary currency and a functioning economy do not go hand in hand.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9hsudp",
                                                                    "author": "dfunkmedia",
                                                                    "score": 1,
                                                                    "created_utc": 1653168607.0,
                                                                    "response": "Tell me more about how well our economy is functioning",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9htecd",
                                                                            "author": "lakimens",
                                                                            "score": 1,
                                                                            "created_utc": 1653168893.0,
                                                                            "response": "It's not fully halted, so that's good. Having Bitcoin as an official currency would be catastrophic since people would be discouraged to spend, assuming it's still deflationary by then.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i9h1n3l",
                                                    "author": "0x1a3c3e7",
                                                    "score": 2,
                                                    "created_utc": 1653155274.0,
                                                    "response": "Bitcoin is backed by math and cryptography, the blockchain, POW, and it's supporters.  It doesn't need to be backed by other commodities, central banks or governments.  But, after 14 years of constant attacks, hacks, and FUD, it's still here, and it still works just as flawlessly as it did on day one.  If that's what you call a gamble, then my dice are loaded.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9h22mu",
                                                            "author": "Ok-Toe1334",
                                                            "score": 3,
                                                            "created_utc": 1653155473.0,
                                                            "response": "Your dice is loaded? So is Elon musk and all the billionaires. You think you’re the one that’s gonna win? Ok mate",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9h4l8t",
                                                                    "author": "0x1a3c3e7",
                                                                    "score": -1,
                                                                    "created_utc": 1653156646.0,
                                                                    "response": "At no time in human history has any civilization ever rejected a superior form of money in order to retain an inferior form.  Bitcoin is the most superior form of money ever invented.  It has better properties than gold and doesn't require banks for security.\n\nUnlike the vast majority of the economy, crypto is the only market that is accessible to everyone.  Everyone stands to gain from it depending on how much they buy, how little they pay, and how long they hold.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i9haaha",
                                                    "author": "elonmushy",
                                                    "score": 0,
                                                    "created_utc": 1653159395.0,
                                                    "response": "Fiat is a Ponzi scheme. Except... No one wins...",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9h9l4q",
                    "author": "VariationFamous755",
                    "score": 4,
                    "created_utc": 1653159050.0,
                    "response": "We dont take advice from convicted criminals in my house",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9hhngw",
                    "author": "magpietribe",
                    "score": 5,
                    "created_utc": 1653162999.0,
                    "response": "Never forget, Christine Legard is a convicted criminal.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9hv8h0",
                            "author": "FaceMobile6970",
                            "score": 2,
                            "created_utc": 1653169847.0,
                            "response": "She is quite literally, a convicted financial criminal.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9gkjwa",
                    "author": "polish_jerry",
                    "score": 24,
                    "created_utc": 1653147475.0,
                    "response": "Fiat is backed by military",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9gwt7y",
                            "author": "Russianbot123234",
                            "score": 12,
                            "created_utc": 1653153076.0,
                            "response": "Also Bitcoin is backed by nothing but faith.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9gxmch",
                                    "author": "_adopted",
                                    "score": 6,
                                    "created_utc": 1653153450.0,
                                    "response": "Good vs Evil",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9hbmg5",
                                    "author": "wetbootypictures",
                                    "score": 4,
                                    "created_utc": 1653160032.0,
                                    "response": "Faith in math, open source programming and cryptographic security. Not faith in nothing.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9gr5v2",
                    "author": "dapper333",
                    "score": 5,
                    "created_utc": 1653150505.0,
                    "response": "I like the picture of her kissing and cuddling the Pfizer head",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9gzhm9",
                    "author": "Erzkuake",
                    "score": 5,
                    "created_utc": 1653154286.0,
                    "response": "Both are only worth what you can exchange them for. The day my butcher wants to be paid in Chupa Chups, it'll be worth more than fiat.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9hczqw",
                            "author": "Odd-Hair",
                            "score": 3,
                            "created_utc": 1653160704.0,
                            "response": "Thank you for understanding economics",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9hctw7",
                    "author": "Odd-Hair",
                    "score": 4,
                    "created_utc": 1653160625.0,
                    "response": "Because unless you convince someone to trade you fiat, then you better find someone who lets you buy groceries in BTC. Fiat currency is the key to accessing business inventory and services. It's their coin if you will, isn't it dumb that each store can have its own currency? Whoops only brought target dollars I sure hope Walmart offers fair value trade for them....wait a minute...that's what fiat currency already protects us from. Real issue is all monetary systems built on a trading mechanism will be abused by those who don't give a fuck about regular people rules. Crypto didn't fix anything, it just temporarily shifted money into our normie hands. Then ripped it all back , or does someone want to tell me how they  have moonshot returns. If BTC can't exist alongside fiat, well the RIP BTC",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9h3l2e",
                    "author": "MugiwarraD",
                    "score": 8,
                    "created_utc": 1653156168.0,
                    "response": "why would i take advice from ppl who dont know what they doing anyway.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9hgu21",
                    "author": "Total_Resolution_443",
                    "score": 3,
                    "created_utc": 1653162591.0,
                    "response": " Some people believe cryptocurrencies may have the potential to be used instead of money or fiat currency, which is backed by a government.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9gqw20",
                    "author": "parashok42",
                    "score": 15,
                    "created_utc": 1653150379.0,
                    "response": "No one would care about btc if you couldn't exchange it into fiat",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9h02dk",
                            "author": "dfunkmedia",
                            "score": 1,
                            "created_utc": 1653154557.0,
                            "response": "\"Nobody would care about gold if you couldn't exchange it for central bank notes\"\n\n\"Nobody would care about fiat if you couldn't exchange it for goods and services\"\n\nKind of a weird point but yes, mediums of exchange are valued for their fungibility. Thanks Mr Greenspan, your economic prowess is unmatched.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9h27qp",
                                    "author": "large_block",
                                    "score": 7,
                                    "created_utc": 1653155539.0,
                                    "response": "And their point still stands better than this garbage meme. And your comment sucks.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9hiihw",
                                            "author": "dfunkmedia",
                                            "score": 2,
                                            "created_utc": 1653163425.0,
                                            "response": "Weird how all the angry buttcoiner posts lately are 6-12 month old accounts that karma farm r/worldnews and have a vested interest in defending Russia on the internet.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9hitxh",
                                                    "author": "large_block",
                                                    "score": 4,
                                                    "created_utc": 1653163579.0,
                                                    "response": "I’m not sure who you’re referring to but I think you should go outside once in a while. Have a great day.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9hkv31",
                                                            "author": "dfunkmedia",
                                                            "score": 2,
                                                            "created_utc": 1653164586.0,
                                                            "response": "I live on a boat, currently listening to music anchored a little ways from the island and getting ready to go ashore for a Frontline Assembly concert with my girl once she's out of the shower and we make dinner so... Yeah, it's a great day thanks.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i9hevm9",
                                    "author": "Casino_Insider",
                                    "score": 1,
                                    "created_utc": 1653161631.0,
                                    "response": "Yet if have Gold unless it's stolen from me I don't depend on anyone else to have that gold.\n\nIf have crypto I depend on an infrastructure that's separate from me.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9hin8e",
                                            "author": "dfunkmedia",
                                            "score": 1,
                                            "created_utc": 1653163487.0,
                                            "response": "Yawn ok buttcoiner",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9huqk0",
                                                    "author": "Casino_Insider",
                                                    "score": 1,
                                                    "created_utc": 1653169589.0,
                                                    "response": "Funny because I'm not even subscribed to it and I own crypto, just because it's easy to make money with it by taking advantage of believers.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9gxhr4",
                            "author": "_adopted",
                            "score": -2,
                            "created_utc": 1653153391.0,
                            "response": "That’s just a lie",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9hffnp",
                                    "author": "Casino_Insider",
                                    "score": 3,
                                    "created_utc": 1653161898.0,
                                    "response": "Why does it need a monetary value then? Why not run the network just for the greater good of humanity? I mean, the point is to have a transparent ledger, right? Use it as a ledger then, no need to transfer the funds through it, just use it for receipts. People do it for scientific research (@home movement), why not to keep track of transactions?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9i5l9i",
                                            "author": "_adopted",
                                            "score": 1,
                                            "created_utc": 1653175255.0,
                                            "response": "Can you explain what you mean by receipts? What’s the difference between transferring ‘value’ and having the ‘receipt’ (proof of transaction) stored on the ledger? \n\nPeople do what for scientific research?\n\nAnd can you expand on ‘@home movement’ I have not heard of it",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9gwsw5",
                    "author": "cl4yf4c3",
                    "score": 10,
                    "created_utc": 1653153071.0,
                    "response": "\"Fiat is worthless\" - A guy I'll never take financial advice from...",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9gobdp",
                    "author": "scalper84",
                    "score": 3,
                    "created_utc": 1653149196.0,
                    "response": "Old people and tech hmm where have I heard this before oh the internet is just a fad.\nDon’t get why these people are in charge of tech.\nIt’s the same people you help turn the screen correct again in a pc.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9gxyxu",
                    "author": "killacam1187",
                    "score": 2,
                    "created_utc": 1653153605.0,
                    "response": "If you swapped Fiat with Bitcoin in every investment made with Fiat currency, Bitcoin would perform the same job as Fiat, but better. Fiat is only valuable when the people holding it deem it so.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9hfyge",
                            "author": "Odd-Hair",
                            "score": 2,
                            "created_utc": 1653162155.0,
                            "response": "So if we change all the apples to oranges, then we still have juice? Is that your point? It's a bad point",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9hgsn0",
                    "author": "Chanologist",
                    "score": 2,
                    "created_utc": 1653162572.0,
                    "response": "Hopefully we don't go In Time mode and make time currency",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9hnskq",
                    "author": "ahpek99",
                    "score": 2,
                    "created_utc": 1653166053.0,
                    "response": "The country itself backs its FIAT boys. And in the case of USD, the US army. No surprise why their printers keep going brrrrr",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9hpain",
                    "author": "Minute-Ask8025",
                    "score": 2,
                    "created_utc": 1653166792.0,
                    "response": "I always thought fiat was back by all of the people, infrastructure, resources, manufacturing capacity, intellectual property, and militaries of a country…",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9gk8vl",
                    "author": "Used-Poetry7571",
                    "score": 2,
                    "created_utc": 1653147332.0,
                    "response": "Are we surprised?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9glbvc",
                    "author": "Sorry_Attitude_",
                    "score": 3,
                    "created_utc": 1653147830.0,
                    "response": "Currency is just religion, the Central banks are just religions and same for the Bitcoin protocol\n\nThe only real difference is that Fiat has churches(central banks) and Cryptocurrencies have at home altars for different sects(blockchains)\n\nNothing inherently bad about either one, you can believe in Euro and Bitcoin and kaddex like me\n\nYou can believe in Ethereum, yuan and idk Near like others\n\nIt is just a mix and match.\n\nThe bad comes when you handle it in malicious ways and use it for malicious purposes \n\nBut it can obviously be used for good purposes too",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9gmjam",
                            "author": "buzzbooz",
                            "score": -2,
                            "created_utc": 1653148388.0,
                            "response": "But there is a huge difference \n\nFiat the Central bank decides to print more money and the printer goes brrrrrr \n\nAt least btc you need to spend energy to generate btc \nU can't increase the supply just like that",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9h1he5",
                                    "author": "Pipkin81",
                                    "score": 5,
                                    "created_utc": 1653155202.0,
                                    "response": "No, the huge difference is that fiat is backed by countries' economies and armies. Bitcoin isn't.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9hc06n",
                                            "author": "0x1a3c3e7",
                                            "score": -2,
                                            "created_utc": 1653160220.0,
                                            "response": "The rate of inflation disagrees with you.  Fiat isn't backed by anything more than the gullibility of the consumer.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9hcozo",
                                                    "author": "Pipkin81",
                                                    "score": 4,
                                                    "created_utc": 1653160558.0,
                                                    "response": "Well congratulations on writing two sentences. Now all you need to do is make an actual argument.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9hd7pk",
                                                            "author": "0x1a3c3e7",
                                                            "score": -1,
                                                            "created_utc": 1653160810.0,
                                                            "response": "Sir, you must pass grammar school before you can participate at my level of discourse.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9hddxe",
                                                                    "author": "Pipkin81",
                                                                    "score": 2,
                                                                    "created_utc": 1653160893.0,
                                                                    "response": "Making arguments has very little to do with good grammar. But hey, it's good enough to distract from the fact that you still don't have anything of substance to add to the conversation.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9gkocx",
                    "author": "SaberLight7",
                    "score": 1,
                    "created_utc": 1653147531.0,
                    "response": "Thank you madam for your guidance. Inflation has increased but not my salary. Fiat sucks. Governments are robbing us by giving some worthless shit.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9h1jio",
                            "author": "Pipkin81",
                            "score": 4,
                            "created_utc": 1653155229.0,
                            "response": "Another financial expert.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9gusnp",
                    "author": "Change21",
                    "score": 1,
                    "created_utc": 1653152169.0,
                    "response": "Lol exactly",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9h6d3s",
                    "author": "UberSeoul",
                    "score": 1,
                    "created_utc": 1653157487.0,
                    "response": "I find it funny that they have to keep saying it. If it were true, wouldn't the truth speak for itself?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9hpzis",
                    "author": "ColdColdMoons",
                    "score": 1,
                    "created_utc": 1653167137.0,
                    "response": "They are heavily invested in IOTA, digital identify and the new ECB fee free scalable cryptocurrency. They have conflict of interest against bitcoin",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9hxkyd",
                            "author": "buzzbooz",
                            "score": 1,
                            "created_utc": 1653171057.0,
                            "response": "No way they invested in iota \nWhere you got this news from?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9hy9fs",
                    "author": "proof_in_pudding",
                    "score": 1,
                    "created_utc": 1653171414.0,
                    "response": "That's rich coming from a central banker that does nothing but monetize debt with worthless paper.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9gzdy9",
                    "author": "Constant-Ad9398",
                    "score": -2,
                    "created_utc": 1653154239.0,
                    "response": "Euros are litteraly small pieces of paper.... Bitcoin is literally brilliant technology",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9hd9sm",
                            "author": "Odd-Hair",
                            "score": 4,
                            "created_utc": 1653160837.0,
                            "response": "Bitcoin is a bunch of hashed data that converts to value because someone said it has value. How does blockchain tech effect BTC, it's not backing web3 or an app architecture. If you want to talk about a different coin you can edit that first post. Bitcoin is a shiny piece of paper",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9hdpyf",
                                    "author": "Constant-Ad9398",
                                    "score": -1,
                                    "created_utc": 1653161058.0,
                                    "response": "Well litterally everything has value because someone said it has value",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9hfkvw",
                                            "author": "Odd-Hair",
                                            "score": 5,
                                            "created_utc": 1653161971.0,
                                            "response": "Exactly, so how is BTC different other than making you complete a skill testing question first to acquire it. I'm pretty sure McDonald's already made you do that for free fries back in the day",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9hfub2",
                                                    "author": "Constant-Ad9398",
                                                    "score": -1,
                                                    "created_utc": 1653162098.0,
                                                    "response": "Because of the financial properties",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9ho8ir",
                                                            "author": "Odd-Hair",
                                                            "score": 2,
                                                            "created_utc": 1653166266.0,
                                                            "response": "Which are...",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9h39d1",
                    "author": "herecomesthefun1",
                    "score": 0,
                    "created_utc": 1653156021.0,
                    "response": "If fiat money is based on government promises, then it’s literally the worst investment you can make.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9hcwpr",
                            "author": "Odd-Hair",
                            "score": 1,
                            "created_utc": 1653160663.0,
                            "response": "Gold bruh",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9h5ga6",
                    "author": "mishxx88",
                    "score": 0,
                    "created_utc": 1653157059.0,
                    "response": "If you still trust what the governments and banks are saying, think again.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9hpyrs",
                    "author": "ataturkseeyou",
                    "score": 1,
                    "created_utc": 1653167127.0,
                    "response": "They are both worthless, now give me all your bitcoin and fiat, I will deal with disposing them /s",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9hv4h9",
                    "author": "jebigajohnny",
                    "score": 1,
                    "created_utc": 1653169789.0,
                    "response": "I'm just going to leave this here... https://www.bbc.com/news/world-europe-38369822",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9hyitd",
                    "author": "zepert",
                    "score": 1,
                    "created_utc": 1653171550.0,
                    "response": "That's both of them. But, fiat is much superior as you HAVE TO pay your taxes with fiat. Otherwise, you lose the little freedom you have.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9h50qe",
                    "author": "kinklianekoff",
                    "score": 0,
                    "created_utc": 1653156848.0,
                    "response": "Every time soneome says it «comes from nothing» it’s so obvious they have not studied shit and base their statement on their arm-chair psychology about the btc/usd pair. It’s so ingrained to think in fiat terms about value.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9had3l",
                    "author": "cohonan",
                    "score": 0,
                    "created_utc": 1653159431.0,
                    "response": "Unlike fiat which needs the might and credit of entire nation states and central bank shenanigans to give it value, Bitcoin is based on nothing. \n\nIt doesn’t have any such crutches and therefore must exist on its own intrinsic abilities. Which it has been doing splendidly for it’s entire existence.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9hni7u",
                    "author": "motoraswd",
                    "score": 0,
                    "created_utc": 1653165909.0,
                    "response": "thank me later🙏❤️ https://www.youtube.com/watch?v=tDZtBzqow6Q",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9hv8b9",
                    "author": "Herr_Bier-Hier",
                    "score": 0,
                    "created_utc": 1653169845.0,
                    "response": "She’s a criminal… literally a convicted criminal. \n\nShe’s not stupid or ignorant but she’s hoping everyone listening to her is. \n\nhttps://www.google.com/amp/s/amp.theguardian.com/world/2016/dec/19/christine-lagarde-avoids-sentence-despite-guilty-verdict-in-negligence-trial",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9hvyji",
                    "author": "sarr-na",
                    "score": 0,
                    "created_utc": 1653170219.0,
                    "response": "printing money is real value.. fuck these dinosaurs",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uuphy4",
            "title": "On your opinion, is Luna a good investment for long-term or is a dead crypto project? Do you have a suggestion for other good projects?",
            "url": "https://www.reddit.com/r/CryptoMarkets/comments/uuphy4/on_your_opinion_is_luna_a_good_investment_for/",
            "author": "Sharing-isCaring2022",
            "created_utc": 1653147058.0,
            "score": 2,
            "num_comments": 11,
            "subreddit": "CryptoMarkets",
            "selftext": "\n\n[View Poll](https://www.reddit.com/poll/uuphy4)",
            "stickied": false,
            "comments": [
                {
                    "id": "i9gmv9h",
                    "author": "ariN_CS",
                    "score": 4,
                    "created_utc": 1653148535.0,
                    "response": "Good luck to everyone that’s saying it’s not dead, lmao",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9godrl",
                    "author": "DivinesiaTV",
                    "score": 3,
                    "created_utc": 1653149227.0,
                    "response": "This market especially is build on trust and for Luna its gone forever. People didnt like the leader for obvious reasons, how could it ever come back, especially if he is around.  \n\n\nLuna can have memeworth at best, but most likely not more and will just fade away.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9gqam0",
                    "author": "szaybus",
                    "score": 1,
                    "created_utc": 1653150105.0,
                    "response": "I've put like 20$ in it and I have something like 170k tokens. If it ever goes up to 0.01$ I will be pleasantly surprised, if not - oh well...",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9gtjrx",
                    "author": "GlazedPannis",
                    "score": 1,
                    "created_utc": 1653151598.0,
                    "response": "It’s likely dead. But I’ll put 20 bucks into it anyway. \n\nTron(TRX) has really impressed me. Throughout the volatility of the last several weeks it seems to be one of the only ones to hold a relatively steady price. I’m still surprised it was never mentioned anywhere, or why a bigger deal wasn’t made out of it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ie61k",
                    "author": "Sulla_The_God",
                    "score": 1,
                    "created_utc": 1653179957.0,
                    "response": "⚰️💀🥀😐",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9lzsnb",
                    "author": "Rohirrim91",
                    "score": 1,
                    "created_utc": 1653255048.0,
                    "response": "It's mostly likely dead. It will be hard to win back the trust of major investors into a coin after tanking so hard, no matter what they might promise to improve in the future.\n\nSaying that, if you have some money to throw away, might be worth a shot.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9q4sn1",
                    "author": "royale442",
                    "score": 1,
                    "created_utc": 1653337517.0,
                    "response": "Sometime you have to trust your instinct on some tokens and thats one of the effective ways to conviniently hodl unto a token for a period of 5 years. Conviction helps when hodling long term. \n\nI am bullish on $ADA for the next 5 years even through the torrid times. Also, I have seen $DINO through the hyperinflation phase and ready to enjoy the rebranding pump with $GREEN. 5 years is nothing when you are convinced about a token.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}