{
    "subreddit": "CryptoMarkets",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uuts96",
            "title": "Governance tokens will be reshaping decision making in companies and changing how business is done",
            "url": "https://www.reddit.com/r/CryptoMarkets/comments/uuts96/governance_tokens_will_be_reshaping_decision/",
            "author": "totallyfvckedup",
            "created_utc": 1653160122.0,
            "score": 2,
            "num_comments": 6,
            "subreddit": "CryptoMarkets",
            "selftext": "In a decentralized market, the decision making in companies whether it’s an investment or policies changing decision, will be done through voting by holders of a specific governance token. \n\n\nTraditional governance has a pyramid of power and those overseeing have control over what happens, which will make the rest of the community feel like they don’t have a say, and means that investments don’t truly reflect what the people want or their interests. \n\n\nBut blockchain is turning the tables through the rise of DAOs that are enabled by governance tokens, allowing token holders to build a real community and be heard within that community. \n\n\nFor example, BIT holders vote on which project should BitDAO support next, what changes should be implemented in the future, while also having access to one of crypto’s most diverse and liquid treasuries. \n\n\nSo if you compare traditional governance with decentralized governance, you’ll have on one hand a project/company/organization with a community that’s less engaged and that reflects the views of only a few interested and powerful parties, and on the other hand you’ll have a project that’s giving the power to the people.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9i6m9t",
                    "author": "magus-21",
                    "score": 2,
                    "created_utc": 1653175809.0,
                    "response": "> But blockchain is turning the tables through the rise of DAOs that are enabled by governance tokens, allowing token holders to build a real community and be heard within that community. \n\n>For example, BIT holders vote on which project should BitDAO support next, what changes should be implemented in the future, while also having access to one of crypto’s most diverse and liquid treasuries.\n\nHuh. Sounds like a stock share to me.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9icstr",
                    "author": "TumReinySeemyyt",
                    "score": 1,
                    "created_utc": 1653179207.0,
                    "response": "The topic appears catchy but the content is not, GT will make a significant difference as seen in DAO created on XDAO, voting power is not based on the amount of money but the quorum reached by majority means a lot, now a regular Joe can have a say as well.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}