{
    "subreddit": "CryptoCurrencies",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "sq3cdf",
            "title": "Digital Yuan Surpassed Visa in Number Of Transactions On Opening Day of 2022 China Winter Olympics",
            "url": "https://thecryptobasic.com/2022/02/11/digital-yuan-surpassed-visa-in-number-of-transactions-on-opening-day-of-2022-china-winter-olympics/",
            "author": "jakkkmotivator",
            "created_utc": 1644596898.0,
            "score": 3,
            "num_comments": 12,
            "subreddit": "CryptoCurrencies",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "hwiusyx",
                    "author": "Old-Pool-8887",
                    "score": 4,
                    "created_utc": 1644597750.0,
                    "response": "I don't believe in any data published by CCP.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "umgo4g",
            "title": "The Cryptocurrency path to sanity",
            "url": "https://www.reddit.com/r/CryptoCurrencies/comments/umgo4g/the_cryptocurrency_path_to_sanity/",
            "author": "Display--name",
            "created_utc": 1652182700.0,
            "score": 19,
            "num_comments": 27,
            "subreddit": "CryptoCurrencies",
            "selftext": " \n\nHello, i read a lot of FUD post these days about how we all lost our money with the crypto crash and it is the proof that crypto is a bubble etc.\n\nI am not considering myself a crypto guru but i am really happy in this bear market and i wonder why the most people do not like this. The Black Friday is finally here in the crypto space!!!\n\nIf you are in crypto for years you know and there is a smile in your face right now, but i have to say something to the new ones. Remember when you found out cryptocurrency and start investing? Remember when you said \"oh now is expensive to buy BTC, i wish i had bought before\"?\n\nThere is a sad truth to understand. In a bull market everything looks expensive to you and in a bear market everything looks destroyed and not worth to invest. The market is always up and down and because of this, we have a chance to grow our portfolio. In a stable market there is no opportunity to make a profit. We like unstable market!\n\nBe careful with small projects that may loose momentum and go to zero, invest only a very small amount just in case it skyrocket. Stick to the monsters of crypto (BTC, ETH) for long term profit.\n\nZoom out a BTC or Eth price chart and you will see that in the long term it is only up!\n\nNever leave your crypto in a centralized exchange. There is always risk for a hack, block account or stop supporting your country. Move them to your hardware wallet. Buy hardware wallet only from official website.\n\nSo now some steps of my personal view of the situation for the path of sanity:\n\n1. Invest only money you don't need.\n2. When markets crash, BUY.\n3. When markets crash, DO NOT SELL.\n4. Sell ONLY FOR PROFIT in a bull market.\n5. Don't panic.\n6. Market will go up again. Just wait.\n7. You never loose if you don't sell with a loss.\n8. Be happy in a bear market, you have the opportunity to buy more with less fiat.\n9. Drink a beer and relax, wish you the best!",
            "stickied": false,
            "comments": [
                {
                    "id": "i81fjyk",
                    "author": "theicemelts",
                    "score": 4,
                    "created_utc": 1652183262.0,
                    "response": "or, maybe invest in a crypto technology that you believe in with regards to it's utility and raison d'etre. I'm not being antagonistic and you make some very good points, but I feel a large part of some people's pain is due to chasing the moonshot. If you buy what you believe in, it is less anxiety ridden to then hold; as you believe the utility you own will be usable to you later.\n\nSecondly (but maybe should've been primarily), if you only spend what is comfortbale to spend, as in not spending your grocery/utility money, you don't over extend yourself.small purchases will mean dca due to fluctuations.\n\nLastly though, should you find you have spare cash to spend now, OP is right - what a great time to buy into more of the solution that you resonate with; the one(s) that you believe will achieve the things you believe in.\n\nha'p'orth - good fortune all!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i84gcb4",
                    "author": "hairyconary",
                    "score": 4,
                    "created_utc": 1652229667.0,
                    "response": "My smile would be a lot bigger if I hadn't lost 25% of my stable coin when UST crashed...",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i82n3c6",
                    "author": "thermologic_",
                    "score": 3,
                    "created_utc": 1652202370.0,
                    "response": "Its all about fed. Theyre gonna increase interest rates until 2024. So crypto hasnt even near its dip yet. There is too much road down there.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i852a1i",
                    "author": "Sammydho12",
                    "score": 3,
                    "created_utc": 1652239897.0,
                    "response": "Nothing feels better like having to go harder on your favorite coins in the wallet. I just added more BTC, MATIC, OGN and ONE into my wallet. Meanwhile, I don’t buy outside DCA!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i81w92c",
                    "author": "rogvc",
                    "score": 5,
                    "created_utc": 1652191664.0,
                    "response": "Bought a good amount worth of UST when it was down to .60 yesterday. Immediately set a limit order to sell it all at $1. Been sitting back ever since and just enjoying watching my money work for me",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "umdcgf",
            "title": "Cardano Founder Smashes Mike Novogratz Says He Doesn't Understand Why VCs Hate Cardano and Love LUNA",
            "url": "https://thecryptobasic.com/2022/05/10/cardano-founder-smashes-mike-novogratz-says-he-doesnt-understand-why-vcs-hate-cardano-and-love-luna/",
            "author": "jakkkmotivator",
            "created_utc": 1652168823.0,
            "score": 7,
            "num_comments": 6,
            "subreddit": "CryptoCurrencies",
            "selftext": "",
            "stickied": false,
            "comments": []
        }
    ]
}