{
    "subreddit": "CryptoMarkets",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "usdv7h",
            "title": "Tether’s Circulating Supply Reduced by $7 Billion in a Week",
            "url": "https://www.reddit.com/r/CryptoMarkets/comments/usdv7h/tethers_circulating_supply_reduced_by_7_billion/",
            "author": "SwapzoneIO",
            "created_utc": 1652883143.0,
            "score": 5,
            "num_comments": 4,
            "subreddit": "CryptoMarkets",
            "selftext": "Following the latest drama with UST and other stablecoins, USDT has seen a sizeable reduction in its overall circulating supply.\n\nTether, the company behind the largest stablecoin by market capitalization USDT, has seen a reduction in the asset’s circulating supply after investors withdrew over $7 billion from it.\n\nThe development came shortly after USDT briefly lost its peg to the US dollar on some exchanges, dropping to $0.96 in the wake of the Terra UST saga. Although USDT has regained its dollar parity on trading platforms, investors seemed to have lost some confidence following a withdrawal of $7 billion from the stablecoin.\n\nTether’s stablecoin reserve has come under criticism, with arguments as to whether USDT is indeed backed 1:1 to the US dollar. However, it is very important to note that Tether’s CTO confirmed on multiple occasions that the company backing USDT – Tether – continued redeeming the stablecoin at its value ($1), meaning that the peg remained unfazed.\n\nWhat is your opinion on this situation? Did you lose confidence in [USDT](https://swapzone.io/currencies/tether)?\n\n[Source: news.bitcoin.com](https://preview.redd.it/5cl9i3whs8091.png?width=1280&format=png&auto=webp&s=161bdad7db364933b2dc756dfd40d6cab1e01b7c)",
            "stickied": false,
            "comments": [
                {
                    "id": "i93s0ut",
                    "author": "PixiePooper",
                    "score": 1,
                    "created_utc": 1652898600.0,
                    "response": "No one really knows what they are holding as collateral, is it really 1:1? How liquid are the assets? I suspect that if there’s a “run on the bank” there’s going to be a point where they simply won’t be able to redeem USDT for USD, and then the price will crash. Like traditional banking - it’s all built on confidence, and once this goes it will collapse like a house of cards, unless they really are holding piles of cash.\n\nWhat’s the utility of holding USDT versus another stable coin or even USD?\n\nThere’s only downside to being long USDT, so I guess people are moving out of it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i943qp5",
                    "author": "BillMcN3al",
                    "score": 1,
                    "created_utc": 1652903383.0,
                    "response": "This problem or fud is as old as thether itself. Agree its all about confidence",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i97h1qv",
                    "author": "ShabbySuburb",
                    "score": 1,
                    "created_utc": 1652971287.0,
                    "response": "How about switching to decentralized stablez, DAI seems like a great option for that?",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}