{
    "subreddit": "CryptoTechnology",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ukwuca",
            "title": "Top Blockchain Programming Languages",
            "url": "https://www.reddit.com/r/CryptoTechnology/comments/ukwuca/top_blockchain_programming_languages/",
            "author": "NOWNodes",
            "created_utc": 1651996146.0,
            "score": 5,
            "num_comments": 8,
            "subreddit": "CryptoTechnology",
            "selftext": "According to market research estimates, blockchain technology will witness astounding growth in its market size in the next five years. Between 2020 and 2025, the global blockchain market size is expected to grow at a rate of 67.3% CAGR to reach US$39.7 billion in 2025 from US$3.0 billion in 2020. \n\nOne can reasonably presume that this growth will drive innovation and would also require the scaling up of existing platforms. For both of these to happen, the most important role would be that of the developers. While some of the existing languages would be continuously used, some of the innovations would require knowing new languages. \n\nOverall, developers and blockchain enthusiasts must remain aware of the benefits and drawbacks of multiple programming languages. This would help them to choose the most appropriate language – the best fit for their needs.\n\n[Here, in this article, we would look at the top blockchain programming languages and discuss what their qualities are.](https://nownodes.io/blog/top-blockchain-programming-languages/)",
            "stickied": false,
            "comments": [
                {
                    "id": "i7s1xfw",
                    "author": "shape_shifty",
                    "score": 8,
                    "created_utc": 1652001491.0,
                    "response": "No mention of Rust when a lot of popular cryptos are using it for their client and others are using it for smart contracts. No mention of JavaScript/TypeScript either when the vast majority of cryptocurrencies have a layer 1 SDK in JavaScript. On the other hand Kotlin and Haskell are in this article and they are very niche, there is no concrete arguments that would indicate that these technologies will be used more in the future",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7sii5v",
                            "author": "Optimal-Barnacle2771",
                            "score": 3,
                            "created_utc": 1652014279.0,
                            "response": "Haskell is a functional programming language that Cardano has chosen to use. It is certainly niche, but the deterministic properties of the language are very synergistic with the laws of cryptocurrency.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "ukxhur",
            "title": "What are issues Layer 2 (specifically on Ethereum) does not solve?",
            "url": "https://www.reddit.com/r/CryptoTechnology/comments/ukxhur/what_are_issues_layer_2_specifically_on_ethereum/",
            "author": "Matt-ayo",
            "created_utc": 1651999275.0,
            "score": 44,
            "num_comments": 25,
            "subreddit": "CryptoTechnology",
            "selftext": "There is rightfully a lot of hype around layer 2 protocols on Ethereum. They are certainly an improvement from a day-to-day user perspective.\n\nI've gotten a bit behind on the recent Eth changes, the coming Eth changes and how they will interact with layer-2, but I have heard select folk talk about how layer-2 and even Eth 2 don't fix all of Ethereum's issues and was just hoping to get a better grasp of that argument.",
            "stickied": false,
            "comments": [
                {
                    "id": "i7s3g94",
                    "author": "Simple_Yam",
                    "score": 30,
                    "created_utc": 1652002883.0,
                    "response": "Fast finality. \n\nIf you take a look at ZK Sync or Starkware explorers you'll see that it can take hours for submitted blocks to reach finality on L1.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7scrrw",
                            "author": "frank__costello",
                            "score": 15,
                            "created_utc": 1652010573.0,
                            "response": "This is an economy-of-scale issue\n\nGenerating ZK proofs is very expensive, so most ZKRs wait for many transactions before submitting a proof. This will get faster as usage increases. Arbitrum used to submit a batch once every hour or two, now they submit a batch almost every minute.\n\nHowever, the finality of an L2 is ultimately bound by the finality of the L1 that it settles on.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7sz3sv",
                                    "author": "domotheus",
                                    "score": 8,
                                    "created_utc": 1652022567.0,
                                    "response": ">This will get faster as usage increases\n\nand as their L1 costs decrease with [blob transactions](https://eip4844.com) being priced independently of the regular layer 1 congestion.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i7s3jh5",
                    "author": "diomediocre",
                    "score": 22,
                    "created_utc": 1652002964.0,
                    "response": "Data availability is a big one. Tracking the whole blockchain takes up a lot of space that still needs to be offloaded using the shard design. There's also issues with blockspace on Ethereum now that are indirectly involved in gas fee issues that severely limit layer-2s ability to do data calls so proto-danksharding and danksharding are looking to solve these through the use of \"blob\" transactions. Neither of these fix the underlying issues but should kick the can down the road a very long ways.\n\nNext is EVM compatibility and silos of resources. Most Ethereum L1 protocols can use existing tooling from Optimism or Arbitrum to migrate to an L2 but this took a substantial amount of effort and preparation, and launching on either isn't 1-1 to launching on another OR. This gets even worse when considering zkRollups which will apparently have a very difficult time achieving EVM parity and are similar to a whole new chain with a custom language. All these separate rollups also separate off developers and improvements for Ethereum as an L1 and are pretty directly in competition with each other for the competent developers who will move to L2s. On a customer side this makes liquidity and TVL splintered and highly dependent on non-Ethereum dependent bridges like Hop, Synapse, or Multichain. This effect will likely end up looking quite similar to the EVM dominated L1 wars recently.\n\nSome issues with Ethereum don't get solved by L2s but get solved by The Merge which is a phased delivery of sharding, rollups, and PoS. And some issues with Ethereum won't be affected at all in a bad way like the high level of dependence on a few entities for infrastructure support like Alchemy, Infura, and Metamask. These weaknesses have been exposed and are being slowly addressed on their own.\n\nL2s also create some issues we didn't really have before. Optimistic rollups currently have a \"weak assumption\" of trust with their whole fraud proof/sequencer setup and a week long return of resources to the main chain due to this setup. ZKrollups lose a lot of transparency with the simple mechanics of validity proofs and how products like Etherscan will be able to understand them supposedly (unsure of this claim), and have  extremely high processing requirements centralizing their creation and utilization somewhat.\n\nAs for the major issues people are looking to address of TPS and gas fees, most implementations are artificially capped right now so accurate numbers are hard to come by as with rollups gas fees should have a weird \"check-mark\" curve as gas will get cheaper until blocks start filling. I think most ORs are in the 5-10k TPS range while zkRollups are theoretically in the 50k range. Most online implementations bring Ethereum to Avalanche/Terra levels of fees on l2fees.com but those are noted to be the expensive L1s right now (Ethereum's fees being the whacky outlier) so most active L1s beat most active L2s on fees/TPS metrics currently though L2s are basically holding their own leash here.\n\nPromising stuff to look into would be Polygon's multiple investments into new L2 teams, Celestia approach to modularity and potentially Sovereign rollups, Aztec Network/Starknet/ZkSync just starting to rev up, whatever Polynya is hyped about currently, Optimism governance and airdrop release, I think it was zkSync hyping L3s, and Metis network or Loopring as dark horse candidates.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7s54m8",
                    "author": "Cemetate",
                    "score": 7,
                    "created_utc": 1652004378.0,
                    "response": "Composabillity. \n\nSeen as the LEGO blocks of DEFI, L2s break this!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7scuiv",
                            "author": "frank__costello",
                            "score": 7,
                            "created_utc": 1652010629.0,
                            "response": "Composability works fine on each individual L2, there's many DeFi apps already composed on Arbitrum.\n\nComposability can work across rollups, however it's not _atomic_ composability.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7sd0qn",
                    "author": "frank__costello",
                    "score": 3,
                    "created_utc": 1652010747.0,
                    "response": "Rollups solve the issues of computation and state storage, however they're still limited by historical data availability (the \"data availability problem\")\n\nThis issue either needs to be solved by the L1 (data sharding, danksharding and EIP-4844 proto-danksharding), or can also be addressed by using a different platform for data availability (such as Celestia or ZKSync's ZK-porter)",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "ul1utb",
            "title": "When it comes to zero knowledge proofs, how does it practically work in a private chain?",
            "url": "https://www.reddit.com/r/CryptoTechnology/comments/ul1utb/when_it_comes_to_zero_knowledge_proofs_how_does/",
            "author": "RedEagle_MGN",
            "created_utc": 1652016906.0,
            "score": 30,
            "num_comments": 10,
            "subreddit": "CryptoTechnology",
            "selftext": "I get that ZK can allow you to share info without sharing the exact info, e.g.:\n\nQuestion: Does Bob drink 10 cups of coffee a day\n\nAnswer: Yes, Bob drinks more than 10 cups of coffee a day but I am not going to tell you how many.\n\n&#x200B;\n\nBut how do ZK proofs practically work in a private chain?\n\nAs I see it the Blockchain is like a paper. Each node is a copy of the piece of paper and transactions are validates across nodes. With ZK proofs, is all the transaction data (who is sending what to who, how much is in each wallet, who requested the info and who verified it), is that all private or is the meta data still exposed?  \nIf the above is the case, why isn't ZK used in all cases on all blockchains?\n\nIs all the validation or just the info sent to companies private? \n\nWould not the 20x number of calculations needed for ZK for everything cause HUGE efficiency problems?",
            "stickied": false,
            "comments": [
                {
                    "id": "i7t6tg0",
                    "author": "DATY4944",
                    "score": 8,
                    "created_utc": 1652025974.0,
                    "response": "I thought zk proofs is like proving you control a private key without giving away the private key. Your example doesn't quite fit the intent that I'm familiar with.\n\nIt's like.. I can unlock a safe and let you have some of the contents without telling you the safe key.\n\nOr a better example: I can prove I know the safe key without even opening the safe.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7t84ay",
                            "author": "T0Bii",
                            "score": 4,
                            "created_utc": 1652026546.0,
                            "response": "That's one use case but you can proof lots of different things without sharing the information.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7tvrd2",
                    "author": "Dormage",
                    "score": 5,
                    "created_utc": 1652036853.0,
                    "response": "Zkp are just cryptographic protocols. They dont enforce a particular use. You can use them for many things but in general the protocols can be used for what you say.\n\nYou can prove you have some data, without sending the data. But not just any data, we need ana greement on that as well. Unkess your protocol is about coffee cups, you cant verify hoe many someone drank. In public chains, the data is transactions. In a private chain setup, it depends on the usecase.\n\nThere isnt realy much value to be gained by a private blockchain anyway. I suppose you could come up with some type of application where users need to provide a proof they have some digital information without violating ther privacy but the security considerations of the private network will outweight the privacy concerns.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "ukpwr4",
            "title": "In Less Than 7 Hours, Decred Will Make a Radical Consensus Change",
            "url": "https://www.reddit.com/r/CryptoTechnology/comments/ukpwr4/in_less_than_7_hours_decred_will_make_a_radical/",
            "author": "Corp-Por",
            "created_utc": 1651968708.0,
            "score": 17,
            "num_comments": 4,
            "subreddit": "CryptoTechnology",
            "selftext": "Decred is a project conceived by ex-Bitcoin devs,  the same devs who wrote the btcd node that is used by Lightning Labs.   The fundamental difference between Bitcoin and Decred is that the latter uses a hybrid PoW/PoS consensus.   Currently, 60% of rewards go to proof-of-work miners, 30% to proof-of-stake, and 10% to a Treasury (Decred stakeholders then vote on how the Treasury is spent, which development projects to fund, etc.)\n\nThe consensus will change on 4 points.  The most popular one is that the subsidy to PoS will increase to 80%, while the subsidy to PoW decreases to 10%.  This will give DCR stakers a 10% APY, which is very high, and DCR staking doesn't require custody, so there's no counterparty risk.  Prima facie this may sound like the stakeholders trying to enrich themselves, but it's not the case; the reasoning behind it is provided [here, in the original proposal for](https://proposals.decred.org/record/427e1d4) the change (that was voted upon by the DCR coin holders/stakeholders).  Keep in mind that reducing PoW subsidy does not reduce Decred's security, as [Decred is, apples to apples, 20x harder to 51% attack than Bitcoin](https://medium.com/@0xmzz/apples-to-apples-decred-is-20x-more-expensive-to-attack-than-bitcoin-68bafeb4546f)\n\n[This website](https://voting.decred.org/) contains updates about the consensus change, the timing, and the details about each of the 4 consensus changes.",
            "stickied": false,
            "comments": []
        },
        {
            "id": "ukvhvw",
            "title": "ZK Rollups are the missing piece to complete the blockchain scaling solution puzzle",
            "url": "https://www.reddit.com/r/CryptoTechnology/comments/ukvhvw/zk_rollups_are_the_missing_piece_to_complete_the/",
            "author": "J-59",
            "created_utc": 1651990132.0,
            "score": 14,
            "num_comments": 11,
            "subreddit": "CryptoTechnology",
            "selftext": "One of the main issues that’s still holding blockchain from being adopted worldwide is scalability, whether its transaction speed related or high gas fees that users are currently suffering from. \n\n\nZK Rollups are playing a major role in blockchain scalability, since Rollups vastly reduce the computing and storage resources required to validate blocks, by decreasing the amount of data in a transaction. \n\n\nOne of the industry’s leading ZK powerhouses is Polygon, that committed $1 billion aiming to acquire world-class ZK projects and teams, building ZK-based solutions, hiring premium talent, adoption of ZK solutions, research funding… \n\n\nMATIC has introduced zk based solutions like Hermez, Nightfall, Miden, Zero… and even the the first ever zk cryptography powered digital identity platform, Polygon ID.",
            "stickied": false,
            "comments": [
                {
                    "id": "i7rxswd",
                    "author": "Simple_Yam",
                    "score": 4,
                    "created_utc": 1651997849.0,
                    "response": "One misconception I keep seeing is that further development of ZK tech is only gonna help improve L2 Rollups. This is not true, a wide variety of L1s will benefit as well:\n\n - Sharded blockchains like Near will have much shorter intra-shard transaction finality and therefore higher security, it might become possible to not have to rely on fishermen. In the case of Near (which can support dynamic and infinite sharding) this means that it'll never need L2s to scale to 1 billion people (although some people consider shards to be Rollups).\n\n - Big block networks like Solana will become incredibly more secure and flip the trillema as well since users will be able to run trustless light nodes on dirt cheap hardware that just receive compressed batches of blocks with zk proofs - this is called a \"rolldown\". The common issue with blockchains that scale on L1 is that it's too expensive for a regular user to verify by running their own node.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7rylnw",
                            "author": "elithewalkingcripple",
                            "score": 6,
                            "created_utc": 1651998554.0,
                            "response": "Doesnt help if it cant stay online lmfao",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7s324g",
                                    "author": "Simple_Yam",
                                    "score": 5,
                                    "created_utc": 1652002521.0,
                                    "response": "Bugs are unfortunate but a short lived issue. Bitcoin has suffered a lot in its first few years. It has gone down twice (going down in Nakamoto consensus is different than BFT consensus but it's the same for the end-user), been forked and even double spent. The worst you can do in this space is be short-sighted. \n\nWe all want resilient systems but always remember that resilient systems are only born from fragile young systems, otherwise how do you identify the flaws that need to be fixed?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i7sgxhb",
                                            "author": "Agonze",
                                            "score": 1,
                                            "created_utc": 1652013327.0,
                                            "response": "I always enjoy how btc maxis never think about or acknowledge that even btc was centralized in it's early days when there were few miners.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9aq92j",
                                    "author": "gumbangww",
                                    "score": 1,
                                    "created_utc": 1653027783.0,
                                    "response": "It might be very true that Polygon has attracted a good number of Zk projects. However, there is still a concern about security. I'm sure that is one of the reasons Railgun decided to build its protocol on Ethereum for a start due to the native security that comes with L1s.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9aqhk4",
                    "author": "Jacobsendy",
                    "score": 1,
                    "created_utc": 1653027968.0,
                    "response": "Well, I guess it's a very good thing that emerging projects are being built to be composable with ZK rollups with an added potential for DeFi apps integration. Railgun exhibits that perfectly with its on-chain privacy utility built on L1 protocols. I guess we'll see more of that approach as the space develops",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}