{
    "subreddit": "CryptoMarkets",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uxxkdq",
            "title": "Theoretically speaking, we will eventually get an L1 that solves the trilemma. Would L2s try to stop it from taking over?",
            "url": "https://www.reddit.com/r/CryptoMarkets/comments/uxxkdq/theoretically_speaking_we_will_eventually_get_an/",
            "author": "AdhesivenessDue652",
            "created_utc": 1653532560.0,
            "score": 0,
            "num_comments": 9,
            "subreddit": "CryptoMarkets",
            "selftext": "The face of technology advancement keeps on getting faster and faster by the day. And while the trilemma seems like it’s very perplexing and hard to solve, it will eventually get solved by someone if we keep up this pace.\n\nMy question is, how would L2s and scaling solutions react?  \nA large number of the top 20 coins on the market are L2s and scaling solutions like Polkadot, Polygon, Avalanche aside from the many other scaling solutions that fall below the top 20 list.\n\nAll of these projects would technology be rendered obsolete if an L1 solved the trilemma and will slowly fade into obscurity. So I’m pretty sure they won’t go without a fight.\n\nThere are some L1s that are pretty close to solving the trilemma right now most prominent of which would be Cardano but their ecosystem is a bit dry right now and could use some more development. Another one would be Hedera especially now that Hbar foundation is allocating hundreds of million if dollars to allegedly make Hedera the most well rounded and capable L1 on the market.\n\nI don’t know how long it will take for an L1 to prove itself capable of solving the trilemma but I’m pretty sure we arent too far away from that day.\n\nHopefully when that day comes scaling solutions wont take a hard hit cause they’re a big part of the market right now so it would affect the market negative for a short while.",
            "stickied": false,
            "comments": [
                {
                    "id": "ia0waxv",
                    "author": "therealestx",
                    "score": 1,
                    "created_utc": 1653536576.0,
                    "response": "Unpopular opinion: the trilemma is a myth. It's just a marketing buzzword for who people are holding coins from non-scalable protocols.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia0q3r6",
                    "author": "mrdeezy",
                    "score": 0,
                    "created_utc": 1653533349.0,
                    "response": "Most of those are junk. I don’t own any crypto right now because the market is going to be visiting lower levels. I don’t give a ship about any crypto personally. \nBut the best layer 1’s to invest in are Solana, near protocol, avax, and atom. Solana and near is probably all I will have next bull run. Eth is overvalued and slow. Layer 2’s are stupid. No regular people want to use that shit. I would not buy Cardano under any circumstance. Kda is good and can 30x next bull run, but runs on Haskell which is garbage. So if does 30x is based on speculation heavy instead of using. Devs hate Haskell which Cardano uses too.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia22oot",
                            "author": "brotherRozo",
                            "score": 2,
                            "created_utc": 1653568196.0,
                            "response": "Devs hate Haskell because it’s different than the rest of the Turing compete languages they are used to being comfortable with, they will keep with it stubbornly, I don’t doubt that. But Haskell coders are up and coming, some are not even of age yet, they will replace the ETH dinosaurs in time!",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "ia1w8f8",
                            "author": "majorpickle01",
                            "score": 1,
                            "created_utc": 1653564307.0,
                            "response": "You think ETH is overvalued and slow but Solana of all things is the best to hold for the next bull cycle?  \n\n\nSolana can't even stay stable and working during a correction, let alone handle anything like the volumes ETH does",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia2n8o5",
                                    "author": "mrdeezy",
                                    "score": 1,
                                    "created_utc": 1653577504.0,
                                    "response": "I am talking prices only. All of the little moonboys here talk about tech. It doesn’t really matter. Solana is still in beta. It will have better return on investment than ethereum. Eth is slow and morbidly expensive. It’s pretty much a cultural L1 at this point and a secondary store of value. I am not here to talk about tech. I just get so tired of all the kiddos on here here are basically giving their coins a cultish following acting like they care about tech but in reality wanting to get rich. The whole thing is dumb and tiresome.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia2o028",
                                            "author": "majorpickle01",
                                            "score": 1,
                                            "created_utc": 1653577821.0,
                                            "response": "> I just get so tired of all the kiddos on here here are basically giving their coins a cultish following acting like they care about tech but in reality wanting to get rich. The whole thing is dumb and tiresome.  \n>  \n>Solana is still in beta. It will have better return on investment than ethereum.\n\nlmao",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}