{
    "subreddit": "CryptoMarkets",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uz2qch",
            "title": "Should I hodl my eth or swap it to bitcoin?",
            "url": "https://www.reddit.com/r/CryptoMarkets/comments/uz2qch/should_i_hodl_my_eth_or_swap_it_to_bitcoin/",
            "author": "Easy-Ad-6793",
            "created_utc": 1653670931.0,
            "score": 1,
            "num_comments": 15,
            "subreddit": "CryptoMarkets",
            "selftext": "I’m down 49% already, am I too late? Considering because btc dominance is soaring, I feel like the wyckoff distribution pattern is gonna play out on the ETH/BTC valuation, and if that happens, eth could drop another 50% according to the logarithmic regression indicator I used on trading view. Wondering what other people think. Thanks",
            "stickied": false,
            "comments": [
                {
                    "id": "ia7qu8w",
                    "author": "UltimateCrypto",
                    "score": 7,
                    "created_utc": 1653671261.0,
                    "response": "Nobody knows. Next time sell the ATH so you won’t have to ask if you should panic sell your 50% loss.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia8qq0t",
                            "author": "gettj",
                            "score": 3,
                            "created_utc": 1653687270.0,
                            "response": "I think he should hold though, will make faster profits holding ETH than BTC cos of rate of rise in value when the bull returns. In the interim, minting ETH into tenETH would be a profitable venture since he can earn more tenETHs as rewards for holding regardless of market direction.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia8ww2z",
                                    "author": "UltimateCrypto",
                                    "score": 1,
                                    "created_utc": 1653690252.0,
                                    "response": "Can’t argue with Hodl. That’s also a good strategy.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "ia84fln",
                            "author": "Cisco1787",
                            "score": 1,
                            "created_utc": 1653677075.0,
                            "response": "Bingo!",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "ia8rutx",
                            "author": "c-strong",
                            "score": 1,
                            "created_utc": 1653687814.0,
                            "response": "Sure, but did you not see that he has a “logarithmic regression indicator” that tells him what’s going to happen?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia8x01e",
                                    "author": "UltimateCrypto",
                                    "score": 1,
                                    "created_utc": 1653690307.0,
                                    "response": "Great sales pitch for it. Lol poor bastard",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "ia9mh2w",
                                    "author": "Easy-Ad-6793",
                                    "score": 1,
                                    "created_utc": 1653703520.0,
                                    "response": "I didn’t say it was going to happen I just said that the lower part of the regression band is around 900, 50% lower than the price now. and since eth has been to those levels before in the regression band I’m just speculating that it is in the cards that’s all… just trying to make smart moves with my money and trying to get some good feed back and maybe see what others suggest I could do. Still a beginner. 2021 class…",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iaabf37",
                                            "author": "c-strong",
                                            "score": 2,
                                            "created_utc": 1653719341.0,
                                            "response": "Fair enough, sorry for the snark. In that spirit though, my advice to any beginner is that as soon as you learn that 100% of technical analysis is utter steaming bullshit, the better. \n\nAnd yes, you should hodl your ETH - not because of some line on a chart, but because it has the most combined utility and market share of any cryptoasset, and will be central to the revolution in finance (and much else besides) that is only just getting started.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iaaz8q2",
                                                    "author": "Easy-Ad-6793",
                                                    "score": 1,
                                                    "created_utc": 1653739663.0,
                                                    "response": "I 100% agree. Probably going to end up holding. Thanks!",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia9bnd6",
                    "author": "Tall_Run_2814",
                    "score": 1,
                    "created_utc": 1653697781.0,
                    "response": "BTC dominance is not soaring.  Alt-coins fall harder in bear markets and rise harder in bull markets.  Look at the charts",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia9p6vb",
                    "author": "KryptoSC",
                    "score": 1,
                    "created_utc": 1653704962.0,
                    "response": "You should hold your ETH. Sure it might go lower, but you only sell when there's a fundamental reason to sell, like poor future direction or a major hack, not because of price fluctuations.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia9ph6b",
                            "author": "Easy-Ad-6793",
                            "score": 1,
                            "created_utc": 1653705112.0,
                            "response": "Yeah man that’s a really good point. I might just hodl. It’s just the charts are speaking a lot of bearish things to me. It’s a tough decision. I always hodl, never sold yet, but I feel like it would be good for me to try to step out of my comfort zone and consider stuff like this, you feel me?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iaantsg",
                    "author": "trader_pim",
                    "score": 1,
                    "created_utc": 1653730510.0,
                    "response": "things go up and down",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}