{
    "subreddit": "CryptoMarkets",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uy55au",
            "title": "ETH - Do You See That Bearish Divergence?",
            "url": "https://i.redd.it/1ddmrq5azs191.jpg",
            "author": "buzzbooz",
            "created_utc": 1653563349.0,
            "score": 102,
            "num_comments": 90,
            "subreddit": "CryptoMarkets",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "ia23cpk",
                    "author": "ivhano7",
                    "score": 51,
                    "created_utc": 1653568557.0,
                    "response": "Rsi is not leading indicator, it is a lagging indicator. When Ethereum reached its 2nd ATH, RSI was way higher than previous high...(not lower like in this pic) \n\nIn this chart actually, you can see Ethereum approaching oversold zone, what means it is a buying opportunity next few weeks...",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia2r3oq",
                            "author": "Womec",
                            "score": 8,
                            "created_utc": 1653579070.0,
                            "response": "There are also two bullish divergences on the bottom but we ignores those for reasons.\n\nRSI isnt a leading indicator but divergences in it are, I've personally never seen on not play out, it can take time but it always does.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia2vcld",
                                    "author": "buzzbooz",
                                    "score": -3,
                                    "created_utc": 1653580770.0,
                                    "response": "There was rsi divergence weekly tf \nWhen LUNA was around 100$ \n\nBut would expect it to go to 0 lol",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia2vzql",
                                            "author": "Womec",
                                            "score": 6,
                                            "created_utc": 1653581024.0,
                                            "response": "No but you would expect it to go down to one of the relevant weekly moving averages. Thats how divergence trading generally works.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "ia3fki8",
                                            "author": "dynamicallysteadfast",
                                            "score": 5,
                                            "created_utc": 1653588782.0,
                                            "response": "Yeah but that was an absolute Nuke out of the blue, TA can't hint at that\n\nYou can have bullish divergence then they find out PoW is broken, and BTC goes to zero. No hints on the charts for nukes",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia3g9io",
                                                    "author": "buzzbooz",
                                                    "score": -3,
                                                    "created_utc": 1653589067.0,
                                                    "response": "Tbh there is no coin from 2017 mooned didn't have either long bear market 90% dump or ended up being delisted and to 0\n\nSo take for example luna it did 370x in one year!! I don't get it why hodlers didn't sell \n\nDoge sol ftm wrx all these coins did more than 100x will get nuked but not to 0 I guess",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "ia3goky",
                                                            "author": "dynamicallysteadfast",
                                                            "score": 1,
                                                            "created_utc": 1653589236.0,
                                                            "response": "\"New paradigm\"\n\nPlus the coins often pass hands many times as they go up the levels, each person selling for 2-10x profit then bailing. It'd be interesting to know what percentage of holders at the top bought at what level",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "ia3hxw2",
                                                                    "author": "buzzbooz",
                                                                    "score": 2,
                                                                    "created_utc": 1653589745.0,
                                                                    "response": "On luna forum agora I have seen many if not the majority didn't sell cuz they were staking for 20% APR like its safe investment luna keeps going up and 20% what could go wrong \n\nFantom too from the bottom 800x but let's say on average 200x \n\nIts the same what happened with me in 2017 neo qtum icx sold late unfortunately",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "ia4fpls",
                                                            "author": "BMX-STEROIDZ",
                                                            "score": 1,
                                                            "created_utc": 1653604146.0,
                                                            "response": "> So take for example luna it did 370x in one year!! I don't get it why hodlers didn't sell\n\nBecause they're not traders, you have to lose several times before you get scared into taking profits.  It becomes instinctive and you need to develop that from experience.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "ia480t8",
                                            "author": "Mediocre_Piccolo8542",
                                            "score": 1,
                                            "created_utc": 1653600712.0,
                                            "response": "Does TA even apply for failed projects, scams and rug pulls? People used also to chart bitconnect 😂",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "ia2cmaf",
                            "author": "buzzbooz",
                            "score": -3,
                            "created_utc": 1653573041.0,
                            "response": "I am talking about the bearish divergence\n\nPrice= higher high while RSI = lower high this means strong bearish divergence",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "ia4aliy",
                            "author": "mandysux",
                            "score": 1,
                            "created_utc": 1653601844.0,
                            "response": "Could go down could go up?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia2s17t",
                    "author": "IsThereAnythingLeft-",
                    "score": 8,
                    "created_utc": 1653579446.0,
                    "response": "That’s just a bunch of lines you fool",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia1xb56",
                    "author": "lookslikeyoureSOL",
                    "score": 3,
                    "created_utc": 1653565005.0,
                    "response": "It already played itself out at the peak.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia206nf",
                            "author": "buzzbooz",
                            "score": -4,
                            "created_utc": 1653566777.0,
                            "response": "Dont you think this is the first time eth re testing the previous ath?\nThe 2017 ATH breakout buyers about to get shaked \nI am sure many opened leverage position there\n\nAnyway if eth goes down its better at least we have life changing opportunity",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia3np9f",
                                    "author": "ibeforetheu",
                                    "score": 2,
                                    "created_utc": 1653592110.0,
                                    "response": "I see a lot of lines on a chart",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia3p6jm",
                                            "author": "buzzbooz",
                                            "score": 2,
                                            "created_utc": 1653592724.0,
                                            "response": "I had to add more lines",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "ia28k1l",
                                    "author": "lookslikeyoureSOL",
                                    "score": 1,
                                    "created_utc": 1653571185.0,
                                    "response": "Life changing opportunity to buy right now where it's already at.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia2d3oa",
                                            "author": "buzzbooz",
                                            "score": 3,
                                            "created_utc": 1653573252.0,
                                            "response": "Have u been in 2018?\n\nDont u remember how many bought eth at 400 300 200 \n\nNow u bought at 200 u don't see the future btw and the price went to 90 that's 60% down \n\nIts better to wait there is no mega pump or one candle to the moon its not low cap meme coin \n\nSo who knows maybe 700",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia2lwtt",
                                                    "author": "lookslikeyoureSOL",
                                                    "score": 5,
                                                    "created_utc": 1653576960.0,
                                                    "response": "If you believe in ETH and BTC then you know as this market continues to grow then so does ETHs potential to do a 30x from here. You just need to be thinking long term. 10-20 years. Bitcoin still needs to do a 10x before its market cap exceeds gold, and I think we all know it won't just stop there. The market as a whole can still 100x its value. This technology is young, we are *tiny* and the room for exponential growth is absolutely insane.\n\nSo yes, buying right now is still a life changing opportunity.\n\nEdit; I guess that's an unpopular opinion here lol",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "ia3ccdq",
                                                            "author": "RealBonfiggy",
                                                            "score": 5,
                                                            "created_utc": 1653587471.0,
                                                            "response": "This lol",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "ia3mtl3",
                                                            "author": "dbdev",
                                                            "score": 4,
                                                            "created_utc": 1653591747.0,
                                                            "response": "Nah you’re spot on.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia211p2",
                    "author": "cookyeezus",
                    "score": 16,
                    "created_utc": 1653567287.0,
                    "response": "Go analyse ETH/BTC. It is going to bleed badly. Possibly we could see ETH reach less than 1k",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia21scn",
                            "author": "buzzbooz",
                            "score": 6,
                            "created_utc": 1653567700.0,
                            "response": "If u apply the same % eth lost last bear market then this time could go to 700$\n\nBut I don't believe that the history should repeat it self \n\nMaybe even lower or higher hahah",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia2v4fq",
                                    "author": "dacryptokid",
                                    "score": 7,
                                    "created_utc": 1653580680.0,
                                    "response": "If you notice this last Bull run we didn't have a blow off top that hit the red zone in the rainbow chart. This leads me to also believe we will not go as low either this cycle. As one would expect with a maturing asset class. The future may play out similar to the past however it won't be the same and I would expect it to be a little less extreme. Each Bull run probably pays out a little less overtime until it inevitably changes again.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia2vhpm",
                                            "author": "dacryptokid",
                                            "score": 1,
                                            "created_utc": 1653580826.0,
                                            "response": "That said I'm trying to buy BTC anywhere below 24k ideally below 20k but that's tricky bc what if it never comes? I'll start DCA my stack at around 24k w increasingly large but orders on each fib lower. It's hard to time. My guess is best prices won't be till end of year or early next year. Although buying and starting DCA this summer may also be appropriate.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia34e36",
                                                    "author": "buzzbooz",
                                                    "score": 2,
                                                    "created_utc": 1653584307.0,
                                                    "response": "True i agree with u \nBut don't u see its weird btc retesting the previous high? And going below it never happened \n\nI am waiting for 200 sma weekly which is close to 21k \nSo yah 24 20 and below is decent entry \nGood luck :)",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "ia3fx65",
                                                            "author": "dacryptokid",
                                                            "score": 2,
                                                            "created_utc": 1653588925.0,
                                                            "response": "Yes I agree that if we go below the current low circa 26.5k then we would be approaching last cycles ath's however I don't think it's weird. Weird if comparing to previous cycles however crypto has never lived through a full boom and bust cycle. It was born from the bust cycle yes but since 2008 bust and since 2009 BTC we can see that crypto hasn't ever gone through a full bust cycle. Macro economics suggest possible recession ahead. Look at any major index 5yr chart and it's been a great run. For the over all macro economic conditions, and due to this being a potential first for btc entering a recession, then yeah I believe 20k BTC can easily be a reality. I think it could go lower too but probably just wicks that get bought up. In better macro conditions BTC retraced over 80 percent...so imagine what it may do when all markets go down? Js I feel it's a lot of reasons to think it's not wierd and that the macro lows whatever they may be aren't in yet. Good luck to you too!\n\nEdited for better clarity",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "ia3h9f4",
                                                                    "author": "buzzbooz",
                                                                    "score": 1,
                                                                    "created_utc": 1653589469.0,
                                                                    "response": "Yeah and majority are still bullish it isn't like 2018 capitulation so if it goes to 17k or 18k wick there it would be amazing opportunity \n0.786 is around 18k I guess",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "ia4fz1k",
                                                    "author": "BMX-STEROIDZ",
                                                    "score": 1,
                                                    "created_utc": 1653604269.0,
                                                    "response": "> That said I'm trying to buy BTC anywhere below 24k ideally below 20k but that's tricky bc what if it never comes?\n\nDCA and especially since you're talking about accumulating not trading, I do both.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "ia22t43",
                                    "author": "Duke_of_Deimos",
                                    "score": 5,
                                    "created_utc": 1653568264.0,
                                    "response": "hahahaha!",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia22zz6",
                                            "author": "buzzbooz",
                                            "score": 6,
                                            "created_utc": 1653568369.0,
                                            "response": "Hahahaha!!",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia2qahs",
                                                    "author": "Salmonella97",
                                                    "score": 3,
                                                    "created_utc": 1653578743.0,
                                                    "response": "Ho ho ho!!!",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "ia2ukhi",
                                                            "author": "huggothebear",
                                                            "score": 3,
                                                            "created_utc": 1653580458.0,
                                                            "response": "He he he",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "ia28gjr",
                                                    "author": "deaddoll_x",
                                                    "score": 3,
                                                    "created_utc": 1653571139.0,
                                                    "response": "Hahahaha!",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "ia2a015",
                                                            "author": "CrojoJoJo",
                                                            "score": 1,
                                                            "created_utc": 1653571865.0,
                                                            "response": "Hehehehe!",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "ia2aysh",
                                                                    "author": "deaddoll_x",
                                                                    "score": 3,
                                                                    "created_utc": 1653572308.0,
                                                                    "response": "HA-HA-HA-HA 😭😭",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "ia2m4ly",
                                                                            "author": "Conscious-Proof-8309",
                                                                            "score": 2,
                                                                            "created_utc": 1653577049.0,
                                                                            "response": "[HAHAHAHAHAHA...](https://www.youtube.com/watch?v=PBuZaxYxYEc)",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "ia2sueh",
                                                                                    "author": "jiggs43",
                                                                                    "score": 0,
                                                                                    "created_utc": 1653579771.0,
                                                                                    "response": "HA",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "ia2ijuw",
                                            "author": "oakislandorchard",
                                            "score": 2,
                                            "created_utc": 1653575571.0,
                                            "response": "HAHA",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "ia28mpv",
                                    "author": "cookyeezus",
                                    "score": -6,
                                    "created_utc": 1653571220.0,
                                    "response": "People are blind by the Merge but cant realize that Vitalik has full control of Ethereum if he wants to.\n\nIf Putin threatens all his family for example he could shut the network down if he wanted to.\n\nI am not the biggest Jack Dorsey lover or fan, but he is right when he says only Bitcoin is fully decentralized.\n\nI still believe in ETH medium to long term but the next months will be bloody for ETH. Specially if the Merge goes wrong. These are uncertain times for ETH. \n\nI am all in on BTC and EUR. Nothing else is safe.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia2cu7h",
                                            "author": "buzzbooz",
                                            "score": 8,
                                            "created_utc": 1653573136.0,
                                            "response": "There is no way vitalik can shut the network down man be realistic \n\nYea btc is the safest bet but still ETH will shine",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia2vu2z",
                                                    "author": "dacryptokid",
                                                    "score": 2,
                                                    "created_utc": 1653580962.0,
                                                    "response": "What if merger is not successful? Think about all the working daps and moving parts? All the eth locked in staking. What if the merger is a failure? Nobody talks about that. What they are attempting to do is insanely difficult. This is probably why it's taken so much longer than they ever anticipated. I'm not 100% confident this merger is going to go very well. I hope it does even though I'm not invested",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "ia2ejdk",
                                                    "author": "cookyeezus",
                                                    "score": -3,
                                                    "created_utc": 1653573872.0,
                                                    "response": "I still think ETH will shine. \n\nBut I tell you that if Vitalik's life depended on it he could shut down the network.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "ia2m3x7",
                                                            "author": "Njaa",
                                                            "score": 2,
                                                            "created_utc": 1653577042.0,
                                                            "response": "How?",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "ia2n0ke",
                                                                    "author": "cookyeezus",
                                                                    "score": -6,
                                                                    "created_utc": 1653577411.0,
                                                                    "response": "I don't know how, I don't work for ETH. But I can tell you ETH is not decentralized as people think. Web3 is not decentralized. Metamask, Opensea, Uniswap, etc but be automatic and work without human intervention but they are not 100% decentralized.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "ia2qai3",
                                                                            "author": "-irx",
                                                                            "score": 1,
                                                                            "created_utc": 1653578743.0,
                                                                            "response": "Big part of nodes are hosted on the \"cloud\" and about half of those cloud servers are AWS. This is the part that is most centralized in ETH. Sadly Vitalik has less control than Jeff Bezos at this point. All these nodes going suddenly offline would disrupt a lot of services but technically this doesn't shutdown the entire network, only the services that use these nodes. You can always run your own full node if that ever happens and still have ability to make transactions.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        },
                                                                        {
                                                                            "id": "ia4z8dw",
                                                                            "author": "Njaa",
                                                                            "score": 1,
                                                                            "created_utc": 1653613560.0,
                                                                            "response": "It's funny that you think Metamask and OpenSea are decentralized apps. They are not, and no one has claimed they are.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "ia2ud07",
                                            "author": "JiggaJazz",
                                            "score": 1,
                                            "created_utc": 1653580375.0,
                                            "response": "Enjoy holding the bags! We got a long way to go before we hit bottom",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia2z3fw",
                                                    "author": "cookyeezus",
                                                    "score": 1,
                                                    "created_utc": 1653582244.0,
                                                    "response": "I know. I buy BTC every week so I can DCA (I am aiming to buy 100 weeks) and Euro. Idk where the bottom is so I DCA.\n\nGood luck finding the bottom.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "ia2vuot",
                            "author": "Confident_Ad_3800",
                            "score": 2,
                            "created_utc": 1653580969.0,
                            "response": "If it does then buy the dip!!!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia2x20m",
                    "author": "4022a",
                    "score": 7,
                    "created_utc": 1653581443.0,
                    "response": "Chart analysis is a cargo cult",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia3o7p7",
                            "author": "A_Light_Spark",
                            "score": 3,
                            "created_utc": 1653592323.0,
                            "response": "Yup... And still people vote this trash. I guess they like to look at graphs.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia2b9zu",
                    "author": "Freddious",
                    "score": 14,
                    "created_utc": 1653572446.0,
                    "response": "Diverge these nuts lmao gotem",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia2vqi4",
                    "author": "LSSCI",
                    "score": 5,
                    "created_utc": 1653580923.0,
                    "response": "Bring on $6 ETH!!!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia2xzqc",
                            "author": "buzzbooz",
                            "score": 2,
                            "created_utc": 1653581813.0,
                            "response": "Soon man hahaha",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia260ae",
                    "author": "R0Y-BATTY",
                    "score": 2,
                    "created_utc": 1653569946.0,
                    "response": "What we talking- Grizzly or teddy?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia4bv6r",
                    "author": "Jacobsendy",
                    "score": 2,
                    "created_utc": 1653602401.0,
                    "response": "Really makes me wonder the best strategy to consider in a situation like this. This Q2 will definitely be the rate determining point to know the turn in which the market will be taking",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia4f0bb",
                            "author": "gumbangww",
                            "score": 1,
                            "created_utc": 1653603818.0,
                            "response": ">best strategy to consider in a situation like this.\n\nSpool, built for the bear. Right now, I can't think of a better strategy than yield farming with stable coins in low risk pools and watch from the stands.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "ia5531c",
                            "author": "FigTreeMike",
                            "score": 1,
                            "created_utc": 1653616406.0,
                            "response": "hodl bitcoin.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia24ors",
                    "author": "AlveyFTW",
                    "score": 4,
                    "created_utc": 1653569264.0,
                    "response": "I see lines, lots of lines. No bears though. What you sprinkle on your cereal?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia29pnk",
                    "author": "rexedius",
                    "score": 2,
                    "created_utc": 1653571729.0,
                    "response": "Your pointing at a bullish high on the rsi from a year ago, the rsi is bottomed out near the 15 crypto is going to bounce back eventually, it will take a freakish play for it to break the current support.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia2vqap",
                            "author": "buzzbooz",
                            "score": 1,
                            "created_utc": 1653580921.0,
                            "response": "Whats the current support ?\n\nI mean its bearish divergence for eth on weekly\nAll crypto supports are made out of thin air",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia28peq",
                    "author": "khwkhwkhwkhwkhw",
                    "score": -7,
                    "created_utc": 1653571254.0,
                    "response": "I always hope one day ETH just totally collapses",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia2fjy9",
                            "author": "lcbbcl",
                            "score": 3,
                            "created_utc": 1653574310.0,
                            "response": "Continue, because won`t happen.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "ia2xtxe",
                            "author": "buzzbooz",
                            "score": 2,
                            "created_utc": 1653581749.0,
                            "response": "Why?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia23dwa",
                    "author": "mostardman",
                    "score": 1,
                    "created_utc": 1653568574.0,
                    "response": "can you explain it op?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia2vvat",
                            "author": "buzzbooz",
                            "score": 3,
                            "created_utc": 1653580975.0,
                            "response": "Bearish divergence is when the price make a higher high while the oscillator makes a lower high = weakness in the trend could be sign of correction or mega dump or nothing hahah",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia2ba3t",
                    "author": "G3STO3RT",
                    "score": 1,
                    "created_utc": 1653572448.0,
                    "response": "It's interesting that some investors can earn a lot of usdt in any case",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia2heb7",
                    "author": "tastehbacon",
                    "score": 1,
                    "created_utc": 1653575083.0,
                    "response": "Is this the Log view?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia2vx5l",
                            "author": "buzzbooz",
                            "score": 2,
                            "created_utc": 1653580996.0,
                            "response": "Yes",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia2rzu7",
                    "author": "mrdeezy",
                    "score": 1,
                    "created_utc": 1653579430.0,
                    "response": "There is bearish divs all over eth HTF charts. It was so long ago it doesn't mater and divs don't always play out. You also get divs from big price fluctuations that are fake. Use divs with OBV or rsi on LTF.  This chart is basically obsolete.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia2to5l",
                    "author": "cluelessguitarist",
                    "score": 1,
                    "created_utc": 1653580104.0,
                    "response": "Looks bullish, but i would need the crosshair line to verify which high is the first rsi is referring too.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia2w842",
                            "author": "buzzbooz",
                            "score": 2,
                            "created_utc": 1653581113.0,
                            "response": "Open it in tradingview \nCheck the rsi of the top 2017\nAnd the rsi of the most recent top on weekly timeframe",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia3wbjs",
                    "author": "fuck_the-system",
                    "score": 1,
                    "created_utc": 1653595688.0,
                    "response": "Btc will definitely see 8k this yr.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia4g978",
                            "author": "BMX-STEROIDZ",
                            "score": 1,
                            "created_utc": 1653604401.0,
                            "response": "Horseshit.  No one is going to sit on the sidelines and just watch BTC drop like that it will be scooped up.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia4neko",
                                    "author": "fuck_the-system",
                                    "score": 1,
                                    "created_utc": 1653607786.0,
                                    "response": "I'm sure it will be because I'm a buyer at 8k. Never said it's staying there just that it's going to hit it.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "ia5agfo",
                                    "author": "mangoruby",
                                    "score": 1,
                                    "created_utc": 1653619038.0,
                                    "response": "I’ll be on the sidelines",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia4b0al",
                    "author": "yeetsfeetsdeletes",
                    "score": 1,
                    "created_utc": 1653602024.0,
                    "response": "No, bearish divergence doesn't become as great of an indicator when you stretch it over more than a few months.\n\nNo offense, but this pretty bad TA with you making a resistance line on the RSI that literally spans years",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia4bqq7",
                    "author": "tazcharts",
                    "score": 1,
                    "created_utc": 1653602347.0,
                    "response": "it's a strong no from me",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia4jhyo",
                    "author": "esdeburatax",
                    "score": 1,
                    "created_utc": 1653605923.0,
                    "response": "Thank me later ❤️🙏 https://www.youtube.com/watch?v=tDZtBzqow6Q",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uy57yb",
            "title": "Sometimes it's a good idea to just zoom out. This bearish market might turn out to become a crypto winter, but there is always crypto summer after all",
            "url": "https://i.redd.it/3ujs0imyzs191.png",
            "author": "SimpleSwapExchange",
            "created_utc": 1653563627.0,
            "score": 67,
            "num_comments": 14,
            "subreddit": "CryptoMarkets",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "ia2bopc",
                    "author": "G3STO3RT",
                    "score": 4,
                    "created_utc": 1653572629.0,
                    "response": "Yeah, I think a lot of people have lost their usdt",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia30oz5",
                            "author": "One_Tie900",
                            "score": 1,
                            "created_utc": 1653582866.0,
                            "response": "Thats crypto hell, ops post forgot to talk about that one",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia3npyd",
                    "author": "Delonte_West",
                    "score": 4,
                    "created_utc": 1653592119.0,
                    "response": "nope, mine is still a vertical line straight down",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia453es",
                    "author": "Blocks_and_Chains",
                    "score": 3,
                    "created_utc": 1653599423.0,
                    "response": "For sure! Markets are cyclical, so we’ll have our crypto summer as well, eventually! This industry is not going anywhere, new investors are still coming into the space and new projects are still planning for their launch. Waiting to see how FLD will play out ([FLUID](https://www.fluid.finance/) will bridge CeFi & DeFi and solve the liquidity issue). Progress is happening across may verticals and prices will recover, I have no doubts!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia3nwlk",
                    "author": "mem269",
                    "score": 2,
                    "created_utc": 1653592195.0,
                    "response": "I'm surprised the term \"sweet summer child\" isn't used more in the crypto space.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia3gekp",
                    "author": "squidling_pie",
                    "score": 1,
                    "created_utc": 1653589124.0,
                    "response": "Decade",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia3r8a2",
                    "author": "BodyStunning1786",
                    "score": 1,
                    "created_utc": 1653593576.0,
                    "response": "Couldn't agree more\n\nPeople tend to look for short term profits and investments, but instead they should look at the market from a macro POV and see all the advancements that are happening on a daily basis.\n\nA lot of networks like Concordium for example, are adding ID-layers to their protocols for maximum privacy.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia3zr8b",
                    "author": "SnooCakes6065",
                    "score": 1,
                    "created_utc": 1653597147.0,
                    "response": "Absolutely! But I could also be good time to get some token when the market is down so as to be able to take profit when it goes back High. Like I bought $BLUES and I believe once the market goes up it is definitely going to favour me.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia5jzi4",
                    "author": "mibjt",
                    "score": 1,
                    "created_utc": 1653624033.0,
                    "response": "Xmas comes early",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia6bati",
                    "author": "Gurnika",
                    "score": 1,
                    "created_utc": 1653645147.0,
                    "response": "It’s those of us who stick around during the winters that sow the seeds for summer after all, and then the same crowd that always come in fair weather wonder why they don’t do so well.  Investing isn’t easy, most of it is about patience born of conviction, and for mine I miss the last bear market and look forward to the quieter times ahead.  IF we get a few years of zero action it’s just more time to grow those stacks and make meaningful connections within the community, as well as sorting out it those who are building from those who were nothing but hype.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia4jlww",
                    "author": "esdeburatax",
                    "score": 0,
                    "created_utc": 1653605976.0,
                    "response": "Thank me later ❤️🙏 https://www.youtube.com/watch?v=tDZtBzqow6Q",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}