{
    "subreddit": "CryptoCurrencies",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "upterp",
            "title": "Luna is Up 3,000% In The Last 24 Hours • ProCoinNews.com",
            "url": "https://procoinnews.com/luna-is-up-3000-in-the-last-24-hours/",
            "author": "Informal-Suit9126",
            "created_utc": 1652572067.0,
            "score": 3,
            "num_comments": 9,
            "subreddit": "CryptoCurrencies",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uq07b7",
            "title": "A beginners guide for blockchain gaming",
            "url": "https://zycrypto.com/an-easy-way-for-beginners-into-blockchain-gaming/",
            "author": "Brief-Bother-155",
            "created_utc": 1652597040.0,
            "score": 20,
            "num_comments": 4,
            "subreddit": "CryptoCurrencies",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8o5xei",
                    "author": "boxmuddue",
                    "score": 3,
                    "created_utc": 1652599324.0,
                    "response": "There is a great comment about blockchain gaming I found when i study this subject, here it is: \n\n\n\n\"I'm not sure what your understanding of blockchain and associated products is so I'll try to start off with a (relatively) short explainer just to be safe.\n\nBlockchain tech forms the backbone of digital currencies like bitcoin, ethereum, dogecoin, shibu, etc. that you might have heard about in the news. Blockchains are \"mined\" for such currency, but they also act as encrypted ledgers for every piece of currency mined or transacted.\n\nBecause of this level of security and trust, that ensures that every bit of digital currency (like bitcoin) is accounted for. You can't simply copy and paste more bitcoin into existence because the blockchain will call you a liar and because everyone has access to the same blockchain, everyone will know it. This concept of ownership and accountability is part of what gives these currencies value.\n\nNFTs are \"non fungible tokens\" and they're also based on blockchain tech. They differ from digital currencies like the above in that they're used for unique properties to create a level of ownership for certain digital items. Examples would include NBA Top Shot where you can purchase \"crypto collectables\", each one a unique NFT thanks to blockchain tech. Earlier this year, an artist named Beeple sold an NFT of his art for $69 million USD.\n\nThe key point to remember here is that before blockchain tech, people could download and disseminate as many digital copies of something like a .jpg or .gif of an asset. You still can, but now with blockchain, the argument is that you might own a digital copy of a piece of art from Beeple, but you own a copy -- not an NFT original that is owned only by someone else that is actually worth something because of that unique token.\n\nBlockchain tech and crypto currencies, especially NFTs, are not without controversy especially over the scams that have cropped up from time to time preying on potential investors eager to make a quick buck. It also doesn't help that crypto has also become associated with enabling criminal activity. Because blockchain transactions are also anonymous by design, it has also lured in criminal elements (such as ransomware groups) in making use of the technology since it's relatively easy to hide their digital money trail.\n\nSo games?\n\nPotential uses for blockchain in gaming could involve unique \"drops\" (loot from mobs, chests, etc..) associated only with certain players, as one example, or specific achievements or moments immortalized as NFTs. Suddenly, that crappy axe that dropped from Vossnar the Wrecking Ball might actually have value to someone because it's suddenly a unique NFT. It could then be traded around, or even sold for real-world money, to someone.\n\nThis also opens a Pandora's Box of concern, especially over whether people will now want to play games to have fun or as a second job, or if game design will be affected negatively in focusing more on \"earning\" for players as opposed to simply providing an entertaining moment. Other concerns may include things outside of the game such as gambling, something that Valve had gotten upset about with CS:GO skins way back when.. With the scrutiny that loot boxes are already getting, and the underground economy dealing in the sale of everything from accounts laden with rare in-game items to FIFA accounts filled with in-game currency thanks to bots farming it for use with Ultimate Team loot boxes, some argue this has the potential to make things worse instead of better for players in the long run.\n\nThis is not a definitive answer in the least -- the controversy and the debate over blockchain tech and associated products is an ongoing thing and will continue to be for a long time to come, but I hope this helps shed some light on what is happening at the moment at least\"\n\ncredit to: reboot_the_PC",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}