{
    "subreddit": "CryptoMarkets",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "t6lavf",
            "title": "QANplatform Usecase Story: DAO",
            "url": "https://qanplatform.medium.com/qanplatform-use-case-story-dao-61f04ee943c0",
            "author": "No-Froyo3657",
            "created_utc": 1646407320.0,
            "score": 18,
            "num_comments": 28,
            "subreddit": "CryptoMarkets",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "hzca20m",
                    "author": "BlueLatenq",
                    "score": 2,
                    "created_utc": 1646415210.0,
                    "response": "So basically what this is saying, aside from Dapps and other DeFi programs, QANplatform is also going to allow the construction of DAOs on their platform?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hzbwf8d",
                    "author": "No-Froyo3657",
                    "score": 1,
                    "created_utc": 1646409839.0,
                    "response": "For organisations trying to build a DAO, the blockchain to build on, is of paramount  importance as regards the cost and security of the DAO. Building on QANplatform will address all these issues.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hzc2x08",
                            "author": "Extent_Leather",
                            "score": 1,
                            "created_utc": 1646412400.0,
                            "response": "I suppose we'll have to wait until mainnet to see that.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hzc9tss",
                                    "author": "No-Froyo3657",
                                    "score": 1,
                                    "created_utc": 1646415119.0,
                                    "response": "Yeah, the mainnet is few months away, in Q3 most probably.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hzfrd5g",
                                            "author": "Extent_Leather",
                                            "score": 1,
                                            "created_utc": 1646475647.0,
                                            "response": "That will be soon. In the crypto space, everything is evolving and building so fast...",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hzcqt2v",
                    "author": "wancruz",
                    "score": 1,
                    "created_utc": 1646421742.0,
                    "response": "Does it support smart contracts?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hzfuen7",
                    "author": "krimmelnnd",
                    "score": 1,
                    "created_utc": 1646478119.0,
                    "response": "This looks good. Might share some similarities with the Otto blockchain built to support web3 dapps. Purely synthetic, and uses nft attestation for kyc verification. Both look good.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "urxohf",
            "title": "Best Cryptos to Day Trade",
            "url": "https://www.reddit.com/r/CryptoMarkets/comments/urxohf/best_cryptos_to_day_trade/",
            "author": "Phillip1219",
            "created_utc": 1652825089.0,
            "score": 4,
            "num_comments": 8,
            "subreddit": "CryptoMarkets",
            "selftext": "Anyone have any thoughts on some of the best crypts to day trade? I have about a hundred bucks to do it with. Been doing a similar thing with LUNA as it’s dying. Throwing a few hundred in at 0.00019 and selling at 0.00021. Since it’s so Up and Down All day, every time I sell I walk away with like $30 and I do that many times in the day. This is probably pity money for some, but it’s a pretty good side gig for me. Any thoughts on best cryptos to trade daily/hourly?",
            "stickied": false,
            "comments": [
                {
                    "id": "i904fge",
                    "author": "WTF_CAKE",
                    "score": 3,
                    "created_utc": 1652826398.0,
                    "response": "Probably ethereium and bitcoin, you need a more capital than what you have, if you're trying to day trade as a side gig. Fees will burn your gains and with wluna you're just praying on its volatility to make profit, which it does work but it's not always easy to time the bottom",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i904twn",
                            "author": "Phillip1219",
                            "score": 1,
                            "created_utc": 1652826582.0,
                            "response": "I’m just getting lucky with luna, because as you said it’s volatility",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i90365i",
                    "author": "mel42q",
                    "score": 2,
                    "created_utc": 1652825819.0,
                    "response": "I was thinking of trying to do this too",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i90nz9m",
                    "author": "RealEarth29",
                    "score": 2,
                    "created_utc": 1652835666.0,
                    "response": "Just beat that horse till its dead man. But if you start losing, dont give back too much. Make sure you pay yourself in cash even if its just a hundred bucks here and there. \n\nThen once that well dries up, chill with your money and wait until something similar happens with another crypto. This bear market will probably claim a few more victims. But don't start eagerly branching out into strategies you don't know, or start thinking its easy money everywhere. \n\nJust become a dead shitcoin volatility specialist lol.\n\nThe idea is you want to find a little edge like that and then push it hard. You don't need more strategies or more trades, just one simple thing that works and just beat it into the fucking ground until it doesn't work anymore.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i90dqqc",
                    "author": "lickmyara",
                    "score": 1,
                    "created_utc": 1652830786.0,
                    "response": "*watching with interest",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i90ss0c",
                    "author": "hideousmembrane",
                    "score": 1,
                    "created_utc": 1652837926.0,
                    "response": "I would love to do this but I would lose my money I'm sure. I dabbled with some bots on kucoin but barely made anything overall. \nHow do you recognise when it's a good time to do this with a coin? Just watching a daily chart for volatility and a bit of luck?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i90t962",
                            "author": "Phillip1219",
                            "score": 1,
                            "created_utc": 1652838149.0,
                            "response": "I guess so. I made quite a bit on LUNA when it was low. I was like it’s so low, there’s no way it won’t rise atleast a little. And when it’s so low even a small gain is a lot of profit. To find another Like it though is luck",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i913fe0",
                    "author": "Scofield88",
                    "score": 1,
                    "created_utc": 1652843068.0,
                    "response": "I used to day trade like you, but in the long run the fees will kill you. I eventually realized that with crypto holding for a long time you will get better returns and I have started to research and buy a few tokens with great potential in the future and hold it for a long time.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}