{
    "subreddit": "CryptoMarkets",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "v0jx2y",
            "title": "50% of the world doesn't have access to the Internet, but blockchain tech can change that.",
            "url": "https://www.reddit.com/r/CryptoMarkets/comments/v0jx2y/50_of_the_world_doesnt_have_access_to_the/",
            "author": "Burdrgts",
            "created_utc": 1653856873.0,
            "score": 0,
            "num_comments": 15,
            "subreddit": "CryptoMarkets",
            "selftext": "50% percent of the global population doesn't have access to the internet. When I read this  piece of information I could barely believe it, I  had to double check it.  \n\n\nDoes it surprise you as much as it has surprised me or was I just living in a fantasy all these years. ?  \n\n\nI believe I have a realistic view of the world but it seems I don't quite understand how poor  and unconnected some parts of the world are.  \n\n\nI make money from crypto, and pretty much everything else I do is in some way shape or form connected to the Internet and made possible by it. So many people including myself have benefited from it and I believe that it could change lives of people indefinetely  if they had the level of connectivity and knowledge that the internet provides.  \n\n\nDo you think it would improve our whole civilization if more companies started paying attention and investing in causes like these in remote parts of the world ? Because blockchain tech with it's sustainability and ability to improve any sector can bring about change by bringing a piece of the modern world to our globes most remote parts.  \n\n\nNow I have heard of a couple of companies like (World Mobile Token, Giant, Telcoin) that already implement blockchain as a foundation of their efforts to bring telekoms to the underdeveloped parts of the world but I believe that more companies like these are needed to make true change possible.  \n\n\nDo you share my sentiments and have you heard of any other projects that focus on benefiting these regions of the world.",
            "stickied": false,
            "comments": [
                {
                    "id": "iagwxfz",
                    "author": "Cur_scaling",
                    "score": 3,
                    "created_utc": 1653857988.0,
                    "response": "How ? You posted exactly nothing but pie in the sky bullshit. How does a database architecture ‘bring internet access’ to developing parts of the world ? Where does blockchain excel in funding pulling fibre optics around the world that SQL or NTFS does not ?\n\nHow exactly the fuck does ‘blockchain’ bring internet access to people ?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iagxxnq",
                            "author": "Burdrgts",
                            "score": -3,
                            "created_utc": 1653858475.0,
                            "response": "If you use blockchain (nodes) you could 'rent' those nodes to anyone, which means more people would be willing to participate in the project and get their piece of the cake, also less employees are necessary because you could verify a lot of the data more easily, making it less expensive to run ergo more  sustainable  thus more people could afford it....",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iagyan4",
                                    "author": "Burdrgts",
                                    "score": -2,
                                    "created_utc": 1653858651.0,
                                    "response": "I could go on for another 2 hours but nobody wants to read 10000 characters worth of text on reddit",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iajo5px",
                                            "author": "Effective-View-3935",
                                            "score": 1,
                                            "created_utc": 1653919806.0,
                                            "response": "Because you’re full of shit it’s not that we mind reading",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "iagyqbk",
                                    "author": "Burdrgts",
                                    "score": 0,
                                    "created_utc": 1653858866.0,
                                    "response": "and NFTs are based on blockchain",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iagv5sz",
                    "author": "SlowRs",
                    "score": 2,
                    "created_utc": 1653857122.0,
                    "response": "The problem is the cost of owning a computer and paying the electric etc. A lot of people without access to the internet isn’t a lack of it being there (obviously places don’t have it as well) but the lack of ability to access it due to cost when they are barely able to feed themselves.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iagwdto",
                            "author": "Burdrgts",
                            "score": -1,
                            "created_utc": 1653857722.0,
                            "response": "that is the point blockchain makes it less expensive therefore more people can afford it,",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iah2zy8",
                                    "author": "SlowRs",
                                    "score": 3,
                                    "created_utc": 1653860978.0,
                                    "response": "It makes buying a computer and electric cheaper? How exactly",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iajo82b",
                                            "author": "Effective-View-3935",
                                            "score": 1,
                                            "created_utc": 1653919838.0,
                                            "response": "Starting to hate blockchains, so much pseudo intellectual Bs flying around",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iaian81",
                    "author": "Nature_-1",
                    "score": 1,
                    "created_utc": 1653883665.0,
                    "response": "Basically one reason we need Web3. Especially with the recent upgrade that allows anyone to build on web3 using DEIP will help increase the amount of creators in web3",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaj1l48",
                    "author": "WilliamsKirk",
                    "score": 0,
                    "created_utc": 1653904968.0,
                    "response": "Thank me later ❤️🙏 https://www.youtube.com/watch?v=tDZtBzqow6Q",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}