{
    "subreddit": "CryptoMarkets",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "r29onj",
            "title": "The metaverse is an absolute joke",
            "url": "https://www.reddit.com/r/CryptoMarkets/comments/r29onj/the_metaverse_is_an_absolute_joke/",
            "author": "Vegas-Ranger",
            "created_utc": 1637883896.0,
            "score": 365,
            "num_comments": 614,
            "subreddit": "CryptoMarkets",
            "selftext": "Why on earth would I buy fake real estate, play shit card games or using crappy avatars in some potential virtual city?\n\nI rather stick with playing fun and classic games like DOOM, Fallout,Halo, Fortnite, cod, Battlefield, animal crossing, mario the list is endless.\n\nThese metaverse coins have insane valuations and have nothing to show for it, with low active user counts and shit games to play.\n\nMana is a shitty browser game\nAxs is a boring card game \n\nAnd most of these coins will take 5-10 years to finish why?\n\nBECAUSE GAMING DEVELOPMENT CAN DECADES TO COMPLETE.\n\nJust make your money and cash out before it dumps lol.",
            "stickied": false,
            "comments": [
                {
                    "id": "hm3erc7",
                    "author": "Elleucas",
                    "score": 194,
                    "created_utc": 1637884227.0,
                    "response": "Most of people already living in a metaverse. Sucked into Facebook, Instagram, Reddit and so on. Being most of time in a game like Fortnite is just the same.\nReal life have nothing to do with smartphones and laptops, despite nowadays are part of it; and unfortunately are taking more and more space.\n\nSo well, metaverse is just a part of the big picture",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hm42m06",
                            "author": "developeron29",
                            "score": 40,
                            "created_utc": 1637896781.0,
                            "response": "True, the reality they showed in ‘wall-e’ seems to become our reality one day",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hm478e2",
                                    "author": "Elleucas",
                                    "score": 9,
                                    "created_utc": 1637899280.0,
                                    "response": "Correct, and if you see usa is much more ahead in that sense",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hm4oykq",
                                            "author": "Mirved",
                                            "score": 11,
                                            "created_utc": 1637910481.0,
                                            "response": "Indeed who doesn't want to escape the hellscape that is the US. Idiots with guns running around on the streets. Half the people won't even get shots for a deadly disease. You've got almost no workers rights, healthcare is extremely expensive, you can get sued for basically anything, lots of bullying in schools or even shootings. No wonder people there flock to a metaverse.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hm5qylj",
                                                    "author": "lilThickchongkong",
                                                    "score": 15,
                                                    "created_utc": 1637938384.0,
                                                    "response": "Look i’m poor but i will buy you a one way ticket to China, Venezuela, or Haiti.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "hm68t32",
                                                            "author": "Mirved",
                                                            "score": 2,
                                                            "created_utc": 1637946567.0,
                                                            "response": "Ah those are the countries you compare yourself with a bunch of 3d world poor countries. Says enough doesn't it.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "hm71q5o",
                                                                    "author": "lilThickchongkong",
                                                                    "score": 2,
                                                                    "created_utc": 1637959835.0,
                                                                    "response": "No they all fit the criteria that you are searching for.\nSays nothing about me but everything about yourself.\n\nGood day.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "hm6l5sb",
                                                            "author": "Grey_BabyLegs",
                                                            "score": 1,
                                                            "created_utc": 1637952063.0,
                                                            "response": "Buy my ticket to Switzerland and home too ty",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "hm4jbnf",
                            "author": "farfaraway",
                            "score": 47,
                            "created_utc": 1637906591.0,
                            "response": "So I've been working at Ultra for just over two years now. The goal is to deploy a Steam-competitor, where games are minted as NFTs, and the in-game assets are also NFTs.\n\nWe think about what the Metaverse can be a lot because it fits with a lot of the technologies that we have been building out.\n\n[This](https://www.reddit.com/r/CryptoMarkets/comments/r29onj/the_metaverse_is_an_absolute_joke/hm3erc7/) comment really sums it up pretty well: the Metaverse is not about stuff in a virtual world. It isn't about VR. \n\nThe Metaverse is about a digital representation of YOU that interacts with other people. We've been doing this already for DECADES, but in a wholly centralized, siloed format.\n\nHaving a unique identity with digital assets tied to it is the real value proposition for the Metaverse, and as you can imagine it dovetails PERFECTLY with blockchain tech (open, decentralized networks) and NFTs.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hm5996v",
                                    "author": "fshock",
                                    "score": 5,
                                    "created_utc": 1637927266.0,
                                    "response": "Thanks, im getting some ultra. Sounds much better than just single game calling itself a metaversd",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hm5ae4w",
                                            "author": "farfaraway",
                                            "score": 1,
                                            "created_utc": 1637928172.0,
                                            "response": "I've been producing Ultra podcasts and we talk about metaverse stuff sometimes.\n\nUltra Chill on YouTube and Spotify, etc. Not hypey. Not markety. Just geeks tech talking.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "hm3kdoh",
                            "author": "tTensai",
                            "score": 3,
                            "created_utc": 1637887156.0,
                            "response": "Smartphones have a lot to do with real life nowadays. I use it to pay every service or purchase, to pay to my friends, my personal documents are in my smartphone, and so on. I may have misinterpreted you though",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hm3mp1g",
                                    "author": "Elleucas",
                                    "score": 5,
                                    "created_utc": 1637888373.0,
                                    "response": "I mean, metaverse is just an extension of what there is already. Is not something new. As you said you use smartphone for everything… like me… like most of people. Having an avatar in a parallel world is something not so different",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "hm59asw",
                            "author": "alormaaquadayqo",
                            "score": 1,
                            "created_utc": 1637927304.0,
                            "response": "Very well metaverse is really having its way across the space and the best thing is to jump on it as early as possible and Early investors will receive many benefits and the potential of high ROI, gaming NFT is included in this and GAMERSE has a very good spot and features to benefit all.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hm3f9bh",
                    "author": "Cool_Touch_6866",
                    "score": 80,
                    "created_utc": 1637884478.0,
                    "response": "Next gen...thts the whole point its really about the kids. The 7-15 year old kids now will be the the late 20 mid 30 yr olds in 20yrs. And metaverse and its subsidiaries will b culturally normal. The adults of today can complain and resist all we want. Think roblox,minecraft,fortnite on mega steroids tho. The future of gaming and social interaction is upon us. Hodl accordingly",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hm5d697",
                            "author": "wardersotiatryr2ld",
                            "score": 2,
                            "created_utc": 1637930264.0,
                            "response": "I'll add Gamerse to the list mentioned especially in terms of social interaction and trade in the virtual world. There's indeed nothing we can do about it but you hodl the right assets.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hm6egea",
                            "author": "Successful-Time7420",
                            "score": 1,
                            "created_utc": 1637949068.0,
                            "response": "No because 7-15 year olds at age 20-30 will have different tastes. It's easy to get hooked to tech when you are young. When you are older it doesn't appeal nearly as much.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hm3gcbu",
                    "author": "Cool_Touch_6866",
                    "score": 43,
                    "created_utc": 1637885024.0,
                    "response": "It will also aid in population control. Which will help ease global warming.  Reproductive rates will drop significantly once ppl become immersed in metaverse as the norm.plus More covid-esque health concerns and precautions = less human interaction = \n digitally intimate relationships = more masturbation...\n\n*disclaimer*\n\n im currently wearing a tinfoil sunvisor",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hm3v6a9",
                            "author": "PM_me_your_btc_story",
                            "score": 18,
                            "created_utc": 1637892832.0,
                            "response": "The metaverse is part of the great reset. They think we are too stupid to see it.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hm535km",
                                    "author": "iamamoa",
                                    "score": 3,
                                    "created_utc": 1637921939.0,
                                    "response": "Yes. I couldn’t agree more with this statement.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "hm5zikx",
                                    "author": "lilThickchongkong",
                                    "score": 3,
                                    "created_utc": 1637942467.0,
                                    "response": "To stupid to see or to stupid to allow it to happen. \nCompletely different.\nI believe we are not to stupid to see it but i for sure think we are damn well stupid for not stopping it as it will ensnare, it will create a new breed of slavery and that will all be our children and grandchildren.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hm60qqk",
                                            "author": "PM_me_your_btc_story",
                                            "score": 1,
                                            "created_utc": 1637943027.0,
                                            "response": "For sure. Most people who use facebook are already used to being data farmed. This is just the next step.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "hm4xd5z",
                                    "author": "Suor_So_Davit",
                                    "score": 1,
                                    "created_utc": 1637916969.0,
                                    "response": "This",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "hm4qhe0",
                            "author": "Impressive-Bus6770",
                            "score": 1,
                            "created_utc": 1637911608.0,
                            "response": "Really glad that someone finally discussed how the metaverse will affect our masturbatory habits",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hm42uyf",
                    "author": "FollowandWin",
                    "score": 36,
                    "created_utc": 1637896910.0,
                    "response": "You are not their target audience. It’s the children of today that will be the main users and supporters of the metaverse.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hm4andu",
                            "author": "alienscape",
                            "score": 9,
                            "created_utc": 1637901234.0,
                            "response": "Yeah, it all seems boring as shit to me. But should I bankroll my child to make me some sweet gains?",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hm65wz8",
                            "author": "TibbersCrypto",
                            "score": 1,
                            "created_utc": 1637945314.0,
                            "response": "Agreed. Many people forget they're going through what their parents went though.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hm3kq29",
                    "author": "skant153",
                    "score": 53,
                    "created_utc": 1637887340.0,
                    "response": "Just like that silly internet. It's a fad",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hm3ufr8",
                            "author": "leonnova7",
                            "score": 22,
                            "created_utc": 1637892439.0,
                            "response": "For real - who would go to some virtual place to talk when they could just talk over the phone.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hm3vbn8",
                                    "author": "jwall247",
                                    "score": 23,
                                    "created_utc": 1637892912.0,
                                    "response": "No need for silly phones, you can just talk in person.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hm3zqyw",
                                            "author": "skant153",
                                            "score": 15,
                                            "created_utc": 1637895259.0,
                                            "response": "No need to talk in person, you can just write letters",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hm4e6it",
                                                    "author": "CEOAerotyneLtd",
                                                    "score": 2,
                                                    "created_utc": 1637903334.0,
                                                    "response": "No need for email we can send letters and inter office mail!",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "hm5gfnr",
                                                            "author": "skant153",
                                                            "score": 1,
                                                            "created_utc": 1637932453.0,
                                                            "response": "No need for inter office mail, you can just send an im",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "hm42ybi",
                                    "author": "boy-antduck",
                                    "score": 4,
                                    "created_utc": 1637896959.0,
                                    "response": " same thing with texting. \"Why text when you could just call? It makes no sense.\"",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hm3kbr8",
                    "author": "GhettoChemist",
                    "score": 6,
                    "created_utc": 1637887128.0,
                    "response": "Get the next generation hooked on made up bullshit so a minority of citizens can buy up all the land/resources/equities with real value. By the time millennials realize they've been had it'll be too late.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hm3gcm4",
                    "author": "msor8",
                    "score": 5,
                    "created_utc": 1637885028.0,
                    "response": "Gaming still a good sector though, meta verse or not.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hm4ik42",
                            "author": "DesignerPilky",
                            "score": 2,
                            "created_utc": 1637906092.0,
                            "response": "Agreed! 100 billion dollar industry",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hm3znuv",
                    "author": "_hazlo",
                    "score": 11,
                    "created_utc": 1637895212.0,
                    "response": "The metaverse allows people to play games that they have control and ownership of the items in the metaverse.\n\nIf you play your favorite game 12 hours a day and gain abilities and tools to make you a very powerful player, you can actually sell for instance a sword to another player and make real money to pay for your real world expenses.\n\nThis is vastly different from the olden days of centralized gaming where only the top top players could make some money at tournaments.  And the centralized game owners f(or instance blizzard) can change the rules on you or to shut down the servers. This can't happen in a decentralized metaverse gaming system.\n\nPlay to earn and buy to play is going to be an ecosystem that will be mutually symbiotic for people who play the game as a career and for people who have an interest and the ability to buy the tokens or tools to allow them to become a better, more effective  player.\n\nAs an example I had a roommate who played world of Warcraft 20 hours a day and all he did was pay blizzard for the privilege to play and he never made any money from his work and he was frankly addicted.\n\nThe next world of Warcraft game, whatever it might be,  will allow the players to have control of their characters, tools, weapons and be able to buy, sell, trade & upgrade all the items in their control (NFTs) in a decentralized way on a marketplace and the centralized companies like blizzard can't pull the rug on the users.\n\nWe can all thank the creator of Vitalik for starting this after his experience with world of Warcraft:\n(Quote from the web);\n\nVitalik Buterin created ethereum, the technology behind the cryptocurrency ether, after World of Warcraft developers weakened his prized character.\nAccording to his about.me page, he played World of Warcraft from 2007 to 2010 but decided to quit after game maker Blizzard nerfed his \"beloved warlock's Siphon Life spell.\"\n\"I cried myself to sleep,\" he wrote, \"and on that day I realized what horrors centralized services can bring.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hm4qoe4",
                            "author": "Impressive-Bus6770",
                            "score": 1,
                            "created_utc": 1637911753.0,
                            "response": "Great explanation...just said the same thing to a friend earlier today",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hm53wdj",
                                    "author": "LauriNiemiy",
                                    "score": 1,
                                    "created_utc": 1637922598.0,
                                    "response": ">The next world of Warcraft game, whatever it might be,  will allow the players to have control of their characters, tools, weapons and be able to buy, sell, trade & upgrade all the items in their control (NFTs) in a decentralized way on a marketplace and the centralized companies like blizzard can't pull the rug on the users.\n\nI love the fact that you did mention the freedom decentralized metaverse offers, while they earn from interacting with these dapps and the marketplace. This allows for a crosslinking of different metaverses by the virtue of the NFTs offered on it.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "hm5ho3c",
                            "author": "tchuckss",
                            "score": 1,
                            "created_utc": 1637933236.0,
                            "response": "Uh… you are aware that a game being in the meta verse or whatever, developers will still have control over how the game works, right? They’ll still nerf stuff if they want. \n\nAnd play to earn sounds beautiful in theory, but hellish in practice. I play games to escape reality, not to bring my reality into them and turn it all into a second job, having to compete with people because items are worth money.\n\nThere certainly is ways of integrating blockchains or NFTs into games. But no game has done it well. They all suck. Even the more famous ones like that Axie Infinity or whatever are absolute shit as games. Most (if not all) of these “games” are thought of by financebros who want to exploit the hopeful. Not one is made by a game development team with experience making actual fun games.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hm3l4ne",
                    "author": "UnderstandingLoud542",
                    "score": 10,
                    "created_utc": 1637887553.0,
                    "response": "Why would people buy fake coins?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hm3nxsb",
                    "author": "tchuckss",
                    "score": 8,
                    "created_utc": 1637889034.0,
                    "response": "Because most of these idiotic games aren't being made by game developers; they're made by scammy financebros who see the potential in making money from stupid people. The game is way, way, way down on their priority list.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hm3nypf",
                    "author": "Jbitterly",
                    "score": 7,
                    "created_utc": 1637889048.0,
                    "response": "It’s unnatural to humans. Your rage is warranted. \n\nSome peoples lives suck so bad they can live as who they want to be in a digital world. That’s the trap…",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hm4hvkb",
                            "author": "bostoncommon902",
                            "score": 3,
                            "created_utc": 1637905662.0,
                            "response": "The irony is that you’re writing an anonymous response to an anonymous other commenter and talking about a digital currency.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hm7kjcj",
                            "author": "believeinapathy",
                            "score": 1,
                            "created_utc": 1637968678.0,
                            "response": "99% of our current modern society is unnatural to humans, like what lmao",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hm46l9g",
                    "author": "StingRayFins",
                    "score": 3,
                    "created_utc": 1637898927.0,
                    "response": "Ever paid for a song? Movie? Game? Software? They're all digital. Code. \n\nIt is NOT a joke. You're already doing it. It's just going to be bigger, better, more ownership, and more immersive.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hm4ax47",
                    "author": "Mission-Release-5956",
                    "score": 3,
                    "created_utc": 1637901391.0,
                    "response": "Then don’t buy it...",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hm4e577",
                    "author": "Coolcato",
                    "score": 3,
                    "created_utc": 1637903312.0,
                    "response": "Play GodsUnchained. Fun if you like Hearthstone, although to OP it will be “another shitty card game”.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hm4ehjq",
                    "author": "infopocalypse",
                    "score": 3,
                    "created_utc": 1637903522.0,
                    "response": "Eh. Games are the tip of the iceberg. Online stores will be in the metaverse, concerts, vr, your nft avatars will be like a status symbol combined wih the blue checkmark signifying its you, crypto address will be you ID on social media and financial transactions. There is so much that will be wrapped into it. Not just being PAID to play games.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hm4eoau",
                    "author": "rubioberry",
                    "score": 3,
                    "created_utc": 1637903638.0,
                    "response": "Can't make money playing HALO, unless you play tournaments, but you can make money playing decentraland and the upcoming sandbox",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hm4waop",
                    "author": "DriverHot5977",
                    "score": 3,
                    "created_utc": 1637916102.0,
                    "response": "When I was your age we used gold coins to get groceries! Now your telling me you want to use paper??! Aha I've seen it all.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hm3j9qc",
                    "author": "Bad__Manta",
                    "score": 11,
                    "created_utc": 1637886575.0,
                    "response": "Given the impending bear market, I wouldn’t normally say this, but invest in what it could be 5 years from now, not what it is today. Look at Bitcoin, in 2013 people were not at all taking it seriously and saying the exact same thing: ‘why would anyone want digital currency that can’t be used to buy anything? Same applies here, yeah it’s a lil rough, but give it time, who knows what the future of the metaverse is",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hm4s259",
                            "author": "eve_of_distraction",
                            "score": 3,
                            "created_utc": 1637912798.0,
                            "response": "Tons of people were extremely bullish on Bitcoin in 2013. Plenty of people aren't taking it seriously now either.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hm3hgxs",
                    "author": "slipsbups",
                    "score": 9,
                    "created_utc": 1637885610.0,
                    "response": "He's so right though. Even if it makes me money, I can't morally buy it if I hate it. The games are TERRIBLE.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hm3iyjf",
                            "author": "HERODMasta",
                            "score": 6,
                            "created_utc": 1637886409.0,
                            "response": "They are, until you get double your salary for half assing a shitty game part time",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hm5hrg2",
                                    "author": "tchuckss",
                                    "score": 2,
                                    "created_utc": 1637933294.0,
                                    "response": "So you’re not playing a game; you’re gambling.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hm5iess",
                                            "author": "HERODMasta",
                                            "score": 1,
                                            "created_utc": 1637933687.0,
                                            "response": "Which is part of investing, if you put it this way.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "hm3vyah",
                            "author": "jwall247",
                            "score": 2,
                            "created_utc": 1637893248.0,
                            "response": "Yes but just like ALL of crypto you have to sort through the mess to find something good, this isnt a new concept to crypto investors...",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hm4d1t8",
                            "author": "Virtual_Schedule_674",
                            "score": 2,
                            "created_utc": 1637902660.0,
                            "response": "Some game aren't, you have to search for the gems",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hm3h44k",
                    "author": "Ok_Watercress1575",
                    "score": 2,
                    "created_utc": 1637885425.0,
                    "response": "Check out gala gala games",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hm4051r",
                    "author": "cryptofundamentalism",
                    "score": 2,
                    "created_utc": 1637895469.0,
                    "response": "Can’t agree more … it’s a crap shoot even the “big concert” was a flop . 300 people showed up . For a free concert ?!?\n\n1100 users at any time . It’s a shitshow",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hm4aion",
                    "author": "Own_Idea1840",
                    "score": 2,
                    "created_utc": 1637901157.0,
                    "response": "Agreed but the computer folks and younger gen eat this up",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hm4bv32",
                    "author": "baddaboomtown",
                    "score": 2,
                    "created_utc": 1637901953.0,
                    "response": "Ngl you just convinced me in favor of the metaverse and I'll tell you why.\n\nI was obsessed with runescape right from the start. the runescape classic days. stupid fucking game, and I got a lot of shit for it.\n\nwell, now having a partyhat from 2001 is worth over $2k in real life. \n\nand you better believe I sold mine for my first bitcoin in 2013.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hm4grmr",
                    "author": "UsernamThatAintTaken",
                    "score": 2,
                    "created_utc": 1637904961.0,
                    "response": "I’ve been saying this. Let’s not forget the leading developers are also the ones that were JUST busted for fucking stealing data and spying on people. \nWonder why so many people are endorsing it?\nCause they’re being paid off.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hm4jf44",
                    "author": "Darkreef333",
                    "score": 2,
                    "created_utc": 1637906654.0,
                    "response": "Its going to be interesting to see what the demand for virtual concerts is ?\nAre you going to play cards in a virtual room with friends instead of your own home?\nI guess the next generation of kids raised with this technology will never ever leave the house\nKinda scary if you ask me",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hm4jn45",
                    "author": "ISatoruGojo",
                    "score": 2,
                    "created_utc": 1637906798.0,
                    "response": "If it doesn’t have Bloodborne,Fallout,Darksouls,Demon Souls. I don’t want it",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hm50jj8",
                    "author": "LTower",
                    "score": 2,
                    "created_utc": 1637919661.0,
                    "response": "I will say I have an oculus and it’s great fun for a couple hours a week (I play my Xbox way more).\n\nI’m a big poker player and playing poker in VR is great fun and much better practise than playing online on my computer.\n\nHowever I do completely agree in the fact I don’t see the meta verse taking over like some people think it will. It’ll last a few months and then die I don’t doubt.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hm52276",
                    "author": "2level",
                    "score": 2,
                    "created_utc": 1637920981.0,
                    "response": "I couldn't agree more. It is much harder to create a virtual environment such as Fortnite than adding NFT to skins and avatars. I tried Gala and it sucked. Axs may be a little bit like clash of clans, boring at first and then addictive.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hm52bww",
                    "author": "SophieBunny21",
                    "score": 2,
                    "created_utc": 1637921210.0,
                    "response": "I know what you mean, I don’t even play any games and I love doing sport and being outside to have fun… \nNevertheless it’s more for the newest generation and certain culture where people are very lonely and don’t interact much with each other. For that I think those coins have HUGE potential!!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hm59jrc",
                    "author": "JoeBookerTestes",
                    "score": 2,
                    "created_utc": 1637927504.0,
                    "response": "It’s simple,\nEvery year new technology comes out that take attention away from physical reality and directs it towards a technological space. It’s been happening for hundreds of years now within the realm of electronics. \n\nYou don’t have to participate in this new technological space. People will tell you you are missing out. Fuck em, enjoy your life. The best approach, in my opinion, is to profit off of the technology and live your life accordingly.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hm59kr1",
                    "author": "Decent-Matt",
                    "score": 2,
                    "created_utc": 1637927525.0,
                    "response": "Right, the hype is too early. Valuation too high for the time period. People want business to work backwards. Make money first build something later. Except the money is too good they have more fun spending it then building what they intended.\n\nWe are moving towards an immersive virtual experience. Ready Player One is a novel example to help people visualize what it might be, but as you said, we are decades away. Buying jpegs for absurd money now makes no sense. They will become useless when something far better replaces them.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hm5gond",
                    "author": "Shadoww2020",
                    "score": 2,
                    "created_utc": 1637932617.0,
                    "response": "Those are people who doesn't have a real life.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hm5mcbg",
                    "author": "HeyCharrrrlie",
                    "score": 2,
                    "created_utc": 1637935928.0,
                    "response": "You forgot to remind everyone that Mark Zuckerberg wants to farm your soul. Evil motherfucker!\n\nFuck Meta and fuck Mark Zuckerberg!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hm5o2vv",
                    "author": "roletamine",
                    "score": 2,
                    "created_utc": 1637936874.0,
                    "response": "I heard about a guy, cant remember where, who bought a virtual petrol station and is now making an income in real money when people fill their virtual cars up",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hm3ku31",
                    "author": "AnotherMillenial93",
                    "score": 10,
                    "created_utc": 1637887400.0,
                    "response": "This guy is clearly not an investor. Gamblers take note of his advice \n\nInvestors press the back button and keep scrolling. This is a guy that would have advocated to sell Bitcoin when it hit $100, or $1000, or $10,000.\n\nNo vision whatsoever lol good luck with your day trading buddy",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hm3yhl6",
                    "author": "bigtime284",
                    "score": 4,
                    "created_utc": 1637894599.0,
                    "response": "“I rather stick with playing fun and classic games” \nSee that’s your problem right there. You’re not thinking of the future, you’re just stuck in the past.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hm3eg33",
                    "author": "Separate-Pea-5457",
                    "score": 3,
                    "created_utc": 1637884068.0,
                    "response": "It’s metaverse season",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hm3hc9s",
                    "author": "xLnRd22",
                    "score": 3,
                    "created_utc": 1637885542.0,
                    "response": "I agree. Right now it’s a great idea but very boring and not a high fidelity feeling. Until it is more realistic this is just too much hype over nothing impressive to show",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hm4lk5d",
                            "author": "Badgerisbest",
                            "score": 1,
                            "created_utc": 1637908083.0,
                            "response": "There are incredible revenue models in certain modern games today. They suck for gamers but are incredible for the companies bottom line. I've heard of a few crypto related games that seem very cool but I'm not going to be an early adopter of Jack shit until it gets atleast to Ps3 level graphics.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hm41al7",
                    "author": "tuckerb13",
                    "score": 3,
                    "created_utc": 1637896077.0,
                    "response": "These are the kind of statements that people have always made about something that is super progressive and becomes game-changing.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hm3tvno",
                    "author": "UnfinishedAle",
                    "score": 2,
                    "created_utc": 1637892150.0,
                    "response": "Have you ever tried VR? I have a PSVR and RecRoom is kinda like a meta verse game where you have a character and you can play all different kinds of games in the world. It’s honestly really fucking cool. I can see it taking off, but the hardest part would be making a SINGLE game/world that people will want to play  essentially forever. As soon as the game gets boring, the jig is up. But I can see it working in the right conditions.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hm3znm3",
                    "author": "Remote-thing",
                    "score": 2,
                    "created_utc": 1637895208.0,
                    "response": "I do agree with the fake land and pixelated JPEG is so absurb its just an rich hobbies but the thing is more people wants to have an easy money thats why there playing the NFT games.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hm4a8hx",
                    "author": "captainjackass28",
                    "score": 2,
                    "created_utc": 1637900989.0,
                    "response": "Makes me wonder who came up with it. Fuckerberg is just an idiot who made a website that became popular, the people who actually make stuff like this are who are really behind it. I really hope it goes the way of google glasses and that fb streaming ap. \n\nHowever lots of coins dealing with things like that are on the rise. Decentraland, myneighboralice have both have a major increase recently and their both games online with similar ideas.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hm3k1l1",
                    "author": "BlackRadius360",
                    "score": 3,
                    "created_utc": 1637886980.0,
                    "response": "Roblox and Minecraft are very Metaverse...  I agree with the OP though.  Today I made a comment in another sub about how corny the Oculus is...  They have aomg way to go to make anything of note in this space.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hm41x3r",
                    "author": "P_M_TITTIES",
                    "score": 1,
                    "created_utc": 1637896414.0,
                    "response": "I think it’s wise to step back and see where we are headed. People are given less and less money for their time requiring them to work longer and longer hours. A lot of people go home and just want to zone out, it’s not too far off that in the future people go home and throw on a headset to tune into a world they want.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hm3uiaw",
                    "author": "boofdaug",
                    "score": 1,
                    "created_utc": 1637892476.0,
                    "response": "This guy gets it for sure.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hm3zq08",
                    "author": "12gagerd",
                    "score": 1,
                    "created_utc": 1637895245.0,
                    "response": "I think it's kinda stupid rn... but I see so much potential w. It for the future. Open source games are a favorite of mine though.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hm4x7fg",
                    "author": "taimoor2",
                    "score": 1,
                    "created_utc": 1637916840.0,
                    "response": "Read up on second life. Just because you don’t value something doesn’t mean someone else won’t.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hm4xmpo",
                    "author": "Justin_Beaf",
                    "score": 1,
                    "created_utc": 1637917188.0,
                    "response": "Bring back ze good old games down with the new stuff i dont know about ?1!1!1!-!1!1!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hm55byz",
                    "author": "AllsudsNofoam",
                    "score": 1,
                    "created_utc": 1637923867.0,
                    "response": "42m and we fist-fought over the Nintendo controller when I was young. I cannot fathom a world where someone would pay another person to watch them play Nintendo, just blows my mind. Yet, here we are, and I hear it is a multi-billion dollar industry.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hm5hx2g",
                    "author": "JMoney877",
                    "score": 1,
                    "created_utc": 1637933389.0,
                    "response": "During the early internet days.... buying a website was like buying realty. Ppl like you with no visionaries tried to say nobody will use the internet.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hm4f803",
                    "author": "bagodeadcats",
                    "score": 0,
                    "created_utc": 1637903975.0,
                    "response": "This trend of hating on metaverse and NFT seems like an organized campaign.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hm3v5gi",
                    "author": "FlakeMuse",
                    "score": 1,
                    "created_utc": 1637892820.0,
                    "response": "We are all doomed but hey enjoy your doom….",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hm3zx9x",
                    "author": "cellular-device",
                    "score": 1,
                    "created_utc": 1637895354.0,
                    "response": "Metaverse will thrive in areas such as universities/schools and work space/conferences/meetings\n\nEdit; consider anything we use zoom for during the pandemic and realize that it’s proofing for that shit. You could even make a point for podcasting and interviews if you really wanted to.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hm5eoup",
                            "author": "Mountainspiredvt",
                            "score": 1,
                            "created_utc": 1637931309.0,
                            "response": "Yes I see it in that sense for sure like a better version or way to connect for work. I really don’t see the vision of how it’s going to revolutionize shit like the internet and iPhone did. I would never use VRstyle stuff. I’ve done so much research on meta I just do not see it being as big projected as they’re saying. I don’t want VR Or want to use VR to do simple things like shopping on Amazon or looking on fb. I have no desire to expire a virtual world to do what? See a virtual concert. That’s lame af. Ppl more and more are looking for REAL experiences these days instead of virtual experiences.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hm4fr3b",
                    "author": "cope_seethe_dilate_",
                    "score": 1,
                    "created_utc": 1637904310.0,
                    "response": "The current iteration of the metaverse is simply an initial foray into the space. You can't really compare it to traditional gaming right now. In the future when the metaverse expands you may have larger, more accomplished developers creating worlds on it and it may allow for more integration and seamlessness between separate games than ever before.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hm4gcml",
                    "author": "stos313",
                    "score": 1,
                    "created_utc": 1637904693.0,
                    "response": "Same reason why people buy other abstractions in lieu of physical items.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hm4gwvr",
                    "author": "DesignerPilky",
                    "score": 1,
                    "created_utc": 1637905052.0,
                    "response": "Gaming is 100 billion dollar industry. NFTs is a 10 billion dollar industry. \n\n\nCrypto IS speculative and an investment in the future. If you have some better token that's being used right now everywhere please let everyone know.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hm4j3im",
                    "author": "theguywhoisright",
                    "score": 1,
                    "created_utc": 1637906445.0,
                    "response": "You’re being far too closed minded.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hm4ki73",
                    "author": "bergs007",
                    "score": 1,
                    "created_utc": 1637907373.0,
                    "response": "Check out Vulcan Verse... I think you'll be pleasantly surprised.  They've got a live mmorpg and let you terramorph your plot to your heart's content and people have made amazing looking plots. Combine that with monster companions, upcoming PvE, staking rewards, multiple other games in the ecosystem, a CEO that is extremely engaged with the community, their own DEX, their own NFT marketplace, and so much more to come.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hm4ldi9",
                    "author": "SRM-87",
                    "score": 1,
                    "created_utc": 1637907953.0,
                    "response": "Tbh op its just the next level of creating valuation for absolutely nothing... i wouldnt whine about it... just get some profit...",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hm4o1gr",
                    "author": "Green-words",
                    "score": 1,
                    "created_utc": 1637909823.0,
                    "response": "If Pokémon drops an nft game. That thing will sell like crazy.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hm4po1s",
                    "author": "Heisenbig",
                    "score": 1,
                    "created_utc": 1637911002.0,
                    "response": "We'll see if you gonna do it or not",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hm4rvgc",
                    "author": "Equivalent-Win-1294",
                    "score": 1,
                    "created_utc": 1637912654.0,
                    "response": "Because you know you can resell it to others for huge profits. Everyone playing these games are not in it for the gaming experience, but for the money you could make from flipping the in-game NFTs.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hm4yp51",
                    "author": "irdan87",
                    "score": 1,
                    "created_utc": 1637918096.0,
                    "response": "Op sums up why this page knows nothing",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hm4zhvm",
                    "author": "irdan87",
                    "score": 1,
                    "created_utc": 1637918772.0,
                    "response": "MY daughter (7) is obsessed enough with ROBLOX for me to know I need to stock up on META tokens.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hm50se3",
                    "author": "Neeeeedles",
                    "score": 1,
                    "created_utc": 1637919871.0,
                    "response": "Yep there is no metaverse project even worth mentioning right now, not even meta",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hm50zdn",
                    "author": "Hospital_Slow",
                    "score": 1,
                    "created_utc": 1637920040.0,
                    "response": "No-one asked you to. Everyone in this world is entitled to do whatever the fuck they want",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hm54z5n",
                    "author": "naIamgood",
                    "score": 1,
                    "created_utc": 1637923558.0,
                    "response": "shitty graphics don't matter, just look at roblox. Kids like it",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hm58f0m",
                    "author": "aardvarkbiscuit",
                    "score": 1,
                    "created_utc": 1637926567.0,
                    "response": "DOOM for the win",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hm5e4fd",
                    "author": "Master-Monitor112",
                    "score": 1,
                    "created_utc": 1637930927.0,
                    "response": "Trust me In a bear market you should play all the meta verse games collect tokens and sell In bull market .",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hm5ekp8",
                    "author": "warriorlynx",
                    "score": 1,
                    "created_utc": 1637931231.0,
                    "response": "Don’t think you ever heard of second life",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hm5oghx",
                    "author": "Kheppy",
                    "score": 1,
                    "created_utc": 1637937078.0,
                    "response": "I think the same.. \n\nBut right now it's the moment, we'll see",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hm63t96",
                    "author": "SoSoPatPat",
                    "score": 1,
                    "created_utc": 1637944394.0,
                    "response": "Why? The same reason people around the world have spent billions on fortnite skins. That’s the question you should really be asking. People like to spend money on shit like that so why are you bent out of shape that people want to spend money on the metaverse and not bent out of shape that kids spend $20 for stupid skins in a game that will never do anything at all for them.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hm6965i",
                    "author": "dersteppenhund",
                    "score": 1,
                    "created_utc": 1637946729.0,
                    "response": "Look for GodsUnchained, one of the best NFT games that i knew.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hm6hkqy",
                    "author": "bierli",
                    "score": 1,
                    "created_utc": 1637950444.0,
                    "response": "what is the difference to this stupid 2nd Life hype?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hm6yerm",
                    "author": "DisorientedPanda",
                    "score": 1,
                    "created_utc": 1637958280.0,
                    "response": "Check out Big Time and Phantom galaxies. Or Ultra as a replacement to steam, where you own your digital games and will be able to sell them on if you wish.\n\nMeta verse and crypto gaming is the next step. And it’s just getting started.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hm6ylpj",
                    "author": "ihatenestle1",
                    "score": 1,
                    "created_utc": 1637958374.0,
                    "response": "I have to disagree and I’m also going to bookmark this post so I can come back to it in 10 years and post about it in the new metaverse version of Reddit so I can gain some sweet sweet karma and NFT golds.\n\nWith the rise of VR, AR and wearables…Metaverse is the new digital gold rush…the new internet. It’s going to have its shitty graphics and tech like the original webpages back in the 90s but the potential for this space is truly unimaginable. If kids are using their mothers credit cards to purchase in-game weapons and skins now? Jesus…what happens when these kids grow up and want to join in on the new tech boom? Again unimaginable. We just need to try our best as a community to out compete Meta and Mark Zuckerfuck then I’ll truly be happy.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hm70bqp",
                    "author": "ShitPropagandaSite",
                    "score": 1,
                    "created_utc": 1637959186.0,
                    "response": "Sounds like you've never played something like EVE",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hm72jzp",
                    "author": "cyberwrayt",
                    "score": 1,
                    "created_utc": 1637960222.0,
                    "response": "Metaverse reminds me of the last season of Supergirl with Obsidian. Bullish.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hm7bdrz",
                    "author": "blickyj5",
                    "score": 1,
                    "created_utc": 1637964307.0,
                    "response": "When the future looks bright for something. It doesn't mean the product. Or the idea meets its evaluation. \n\nYes. Blockchain games r terrible right now. So r vr games. And ar is non existent. \n\nU basically saying that because its not ready. Its dumb to invest. \n\nSo why should people invest in cardano? \n\nOr even ethereum. Its basically unusable with its current form. Nobody in their right mind would use it unless they had to. People invest in eth or ada for the future. That itll get better.\n\nIts like seeing the first home game consoles n saying this is dumb. Nobody is gonna want to play games at home. People love arcades. N socializing. What a joke. Im not gonna invest in Nintendo dumb. \n\nDon't be short sided.\n\nYes many wont be successful. Yes many will be yrs away from a good experience. And many new metaverse plays will be complete scams. Like how we see meme coin scams. And no. Metaverse games won't end traditional video games. \n\nBut these r the risks an investor takes. Dyor. Invest if u think the future is bright. Or don't.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hm7izf4",
                    "author": "mrlol124",
                    "score": 1,
                    "created_utc": 1637967932.0,
                    "response": "Same thing for nfts, but none of that matters.\nThe demand is sky high and they are very hyped, people like it.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}