{
    "subreddit": "CryptoTechnology",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ush80h",
            "title": "A word of advice from someone that knows about investing needed",
            "url": "https://www.reddit.com/r/CryptoTechnology/comments/ush80h/a_word_of_advice_from_someone_that_knows_about/",
            "author": "Huge-Paint4923",
            "created_utc": 1652892393.0,
            "score": 15,
            "num_comments": 30,
            "subreddit": "CryptoTechnology",
            "selftext": "Okay I need advice from somebody that has had success investing in crypto or crypto companies, I've been contemplating an investment and although  I read a lot about various ideas about investing in this or that company I wonder how many of these people have actually invested their money and got some profits.  \n\n\nHere is my idea, I want to invest in crypto companies that deal in telecommunications, I have realized that with the coming of 5g and the demands of customers growing and costs rising blockchain tech will become an inevitable path forward for service providers and I would like to jump on the bandwagon early.   \n\n\nI have heard of several companies that invest in such enterprises like World Mobile Token, Giant, Telcoin but given that their market of choice is Africa I am kind of hesitant to put my money where my mouth is.  \nI do understand that Africa is a growing market but the questions of sustainability and future profits in a very uncertain market give me a lot of doubt.  \n\n\nNow do you believe that this could be a good idea, or will I just waste my money on projects doomed to fail ??",
            "stickied": false,
            "comments": [
                {
                    "id": "i93h1tt",
                    "author": "Matt-ayo",
                    "score": 71,
                    "created_utc": 1652894188.0,
                    "response": "As someone who spends a lot of time researching and thinking about crypto currencies this supposed link between 5G and crypto sounds like pure hype and no substance. There is nothing special about 5G that calls for a crypto currency, and there is no such thing as a crypto currency that works well for 5G. \n\nCrypto and 5G are just protocols and if either of them are of high quality it will be independent of the other - there is zero reason I can think of why you would ever design one around the other. Maybe a high throughout blockchain could take advantage of 5G, but if that were the case they would be advertising the phenomenal speeds and not 5G. \n\nI’m almost certain you are caught up in some fear of missing out by a gang of buzzword grifters. The value proposition hear sounds extremely dubious and I would recommend you do a lot more research before putting your hard earned into crypto related assets. Start with Bitcoin, it’s proven safe and the best way to understand other projects (which, btw, are mostly scams).",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i93oj7g",
                    "author": "DSPGerm",
                    "score": 10,
                    "created_utc": 1652897187.0,
                    "response": "Just invest in telecommunications companies jfc not everything has to be blockchain. Think about how slow blockchains are for a transaction vs a normal communication on a 5G network? Why would I want my SMS to take 15 minutes and cost a fluctuating value between $0.00003 and $300 USD? We literally had a system like that 20 years ago. And then when some unrelated coin drops 50% mine can lose value too? \n\nJust do yourself a favor and give your money to a financial professional so that you will have something left in a few years. Shit you might be able to invest in crypto in your 401k soon.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i94s5su",
                            "author": "Huge-Paint4923",
                            "score": -2,
                            "created_utc": 1652913708.0,
                            "response": "yeah ut it is a crypto sub, no point in asking about smt else",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9551n2",
                                    "author": "DSPGerm",
                                    "score": 2,
                                    "created_utc": 1652919752.0,
                                    "response": "You know the fastest way to become a millionaire with crypto? Start off a billionaire. \n\nThe reality is outside of any of like the top 5 coins it’s pretty much a crap shoot as to what projects will actually gain traction. Anyone could say “yeah project XYZ does this” but I don’t think any actual investment professionals would say that this is a good approach.\n\nNow if you say “hey I’ve got $1000 I don’t really care about what project in this space might take off” I’m sure there’s plenty of opinions. But I don’t think anyone would say yeah bet your savings on X coin in the telecom space because we know it’s a sound investment. \n\nAt the end of the day it’s your money. I just think you’re trying to find a solution to a problem that doesn’t exist. And you’re looking for advice that fits your hypothesis that I personally think doesn’t make much sense.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i95f41f",
                                    "author": "__redruM",
                                    "score": 1,
                                    "created_utc": 1652924459.0,
                                    "response": "Well hopefully your asking about something senseable somewhere else.  This type of investment should be less than 10% of what you have to invest.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i93ekhn",
                    "author": "laprika0",
                    "score": 9,
                    "created_utc": 1652893188.0,
                    "response": "How will you know that whoever answers this is trustworthy?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i93h025",
                    "author": "DashingSir",
                    "score": 7,
                    "created_utc": 1652894168.0,
                    "response": "Releasing a token does NOT mean the operation is decentralized. Either make sure there is a proper decentralized working DAO around the project (rare), or value the project as you would a centralized company in the stock market (tokens being second-class shares or worse, most likely).\nAnalyze moats, network effects, sustainable adoption incentives, etc, keep in mind dozens of competitors will probably appear.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i93m3vm",
                    "author": "morebeansplease",
                    "score": 2,
                    "created_utc": 1652896220.0,
                    "response": ">Here is my idea, I want to invest in crypto companies that deal in telecommunications, I have realized that with the coming of 5g and the demands of customers growing and costs rising blockchain tech will become an inevitable path forward for service providers and I would like to jump on the bandwagon early.\n\nThe way that standards work kinda prevents the monopoly I suspect you're looking for. The two pieces of technology are independent of eachother. \n\nThink of a car maker and a tire maker. We need each to have a fully functioning car. But no car only works with one tire manufacturer. Just as no tire manufacturer only works with one car company. There are standards for cars and there are standards for tires. There is a compatibility list. But no monopoly.\n\nDouble check that made sense by thinking about the production of screws and screwdrivers. \n\nCrypto and 5g are governed by the same type of standards. \n\nhttps://en.wikipedia.org/wiki/OSI_model",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i942vc5",
                    "author": "HogeWala",
                    "score": 2,
                    "created_utc": 1652903034.0,
                    "response": "There’s pkt cash that I think is about decentralizing network access",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i95le7y",
                    "author": "DanteJazz",
                    "score": 2,
                    "created_utc": 1652927420.0,
                    "response": "Who takes investment advice from Reddit?  You can read other people's experiences, which may be helpful.  But shouldn't you read investment books and talk to professional financial advisors?    Unless you are just gambling on Wall Street, and then it doesn't really matter, does it?   Think long term, and take advice from those who are professionals.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i93eqol",
                    "author": "PeacefullyFighting",
                    "score": 4,
                    "created_utc": 1652893256.0,
                    "response": "Check helium out. It's currently an IoT network run on Blockchain but are adding 5g. \n\nIt's in rough shape from a recent major upgrade but I expect them to resolve it soon.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i948cw8",
                            "author": "the_mr_walrus",
                            "score": 2,
                            "created_utc": 1652905271.0,
                            "response": "Helium is a great project",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i93j9vi",
                    "author": "flossraptor",
                    "score": 1,
                    "created_utc": 1652895084.0,
                    "response": ">I wonder how many of these people have actually invested their money and got some profits\n\nThe belief that there aren't a lot of people who have and continue to profit massively from crypto is pure sour grapes.\n\n&#x200B;\n\n>I want to invest in crypto companies that deal in telecommunications\n\nThis is sort of like investing strictly in mouse pads during the dot com boom. People who are making money in crypto realize that they cannot predict what the next big thing or viable use-case will be. Pick several projects in different areas that you think have potential.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i94rwmm",
                            "author": "Huge-Paint4923",
                            "score": 1,
                            "created_utc": 1652913597.0,
                            "response": "thans for the advice, Ive taken note",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i95dj4o",
                    "author": "__redruM",
                    "score": 1,
                    "created_utc": 1652923736.0,
                    "response": "Don’t invest in Africa? There are other growing economies with just as much potential and no where near the level of risk.  The crypto market as a whole is way down and there are mature currencies that almost certainly will survive the down turn and have the potential to double before the end of the year.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i95vh15",
                    "author": "KryptoSC",
                    "score": 1,
                    "created_utc": 1652932683.0,
                    "response": "I'm a CFA Charterholder and here's my take on this. You \"invest\" in stocks, especially in companies that have a long, successful history of paying increasing dividends. You \"speculate\" with cryptos. There are some very revolutionary and promising projects in the crypto space, like Helium and others that may do extremely well, but these projects have very little transparency,  they are not audited, and there are so many unknowns that it can never be regarded as a \"solid investment\". Any crypto may be currently mismanaged like LUNA/UST was and no one would know until it's too late. My 2 cents.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i962yx1",
                    "author": "JollySno",
                    "score": 1,
                    "created_utc": 1652937474.0,
                    "response": "Why wouldn’t they use Bitcoin on Lightning Network? That’s the first question. If there’s no good answer, then it’s a cash grab.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i96ie2m",
                    "author": "26oclock",
                    "score": 1,
                    "created_utc": 1652950140.0,
                    "response": "How does 5G and a cryptocurrency correlate it I may ask?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i977kjy",
                    "author": "zero_is_a_mirror",
                    "score": 1,
                    "created_utc": 1652967069.0,
                    "response": "please dont. we are not at that stage where that tech is gonna be adopted even a little bit. people are still working on defi and nfts. dont make the \"im 5 steps ahead of the market\" bets. these always turn out bad",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i984rwy",
                    "author": "sibov8",
                    "score": 1,
                    "created_utc": 1652980924.0,
                    "response": "Honestly if you're looking to invest with a bit of safety and people behind you. Check out a DAO, I personally use bitDAO because their treasury has over 2 billion dollars but obviously I urge you to do your own research.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i93psiv",
                    "author": "Taylor_Hendrix18",
                    "score": -3,
                    "created_utc": 1652897694.0,
                    "response": "If you wanna invest into crypto always DYOR and check the projects backers! Check out GamiFi and tell me that aint an awesome project to invest in, A launchpad with endless potential of project gems that could launch from there and their very own staking program",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i95q874",
                    "author": "HourParty9917",
                    "score": 0,
                    "created_utc": 1652929843.0,
                    "response": "So far the You need to buy low and sell high and watch the trends.   Get in now!  Crypto is cheap.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}