{
    "subreddit": "CryptoMarkets",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ujbm5y",
            "title": "South Korea’s New President Postpones Crypto Taxes to Promote Consumer Protection",
            "url": "https://crypto.news/south-koreas-new-president-postpones-crypto-taxes-to-promote-consumer-protection/",
            "author": "Mars_chego",
            "created_utc": 1651798321.0,
            "score": 23,
            "num_comments": 2,
            "subreddit": "CryptoMarkets",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uj1rnn",
            "title": "EP 152 of the Divi Crypto Podcast: Slashing and Delegated Staking with Alex Smirnov",
            "url": "https://open.spotify.com/episode/3a2DISiDPe2Fr7l6TOb0DA?si=gjefOEQ5RNWe2-tMwstOrg",
            "author": "camelia_1982",
            "created_utc": 1651769653.0,
            "score": 12,
            "num_comments": 0,
            "subreddit": "CryptoMarkets",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uj875d",
            "title": "Gucci Accepts Crypto!, Algorand Teams up with Fifa, and Markets Spiral",
            "url": "https://youtu.be/oFCCB7eVJxE",
            "author": "throwawayo_k",
            "created_utc": 1651787294.0,
            "score": 3,
            "num_comments": 5,
            "subreddit": "CryptoMarkets",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uj2k3v",
            "title": "After lots of Speculation, Anchor Protocol has officially launched floating interest rates",
            "url": "https://www.reddit.com/r/CryptoMarkets/comments/uj2k3v/after_lots_of_speculation_anchor_protocol_has/",
            "author": "Cora_dn",
            "created_utc": 1651771757.0,
            "score": 5,
            "num_comments": 0,
            "subreddit": "CryptoMarkets",
            "selftext": "There have been speculations for a long time that Anchor Protocol, a borrowing and lending platform built on the Terra blockchain, would launch floating interest rates. This speculation has finally been achieved as the defi protocol, which gave 20% yields to all the users, had introduced floating interest rates to produce sustainable yields for its users. \nColin Wu, a well-known crypto reporter, stated that compared to last week, the interest rate this week was 18%, down 1.5%. Reserves now total $209 million, a net outflow of about $30 million from last week.  \nIn a Twitter post, Anchor Protocol stated that As discussed in this last week’s semi-dynamic Earn rate AMA, the Earn rate will update today, May 1st, to exactly 18% APY @ 12pm EST. They also added; “The rate will update roughly every 388068 blocks or every month, but it may differ slightly MoM given that block times can change. Any MoM change over .25% in the yield reserve will trigger a rate change,”  \nHowever, one of the benefits of this is that it is aimed at producing sustainable yields for users. In addition, these Defi protocols use yields as an introductory marketing strategy. \nAlso, note that with this defi protocol, none of the yields is sustainable as they are partially paid via reserves from those projects. This is unlike projects like, AAVE, Theta, point network, etc as all of them are implementing a decentralized market which gives you access to higher interest rates and sustainable yields.",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uj0lqz",
            "title": "Privacy in crypto space.",
            "url": "https://www.reddit.com/r/CryptoMarkets/comments/uj0lqz/privacy_in_crypto_space/",
            "author": "sofitamatugr",
            "created_utc": 1651766255.0,
            "score": 3,
            "num_comments": 6,
            "subreddit": "CryptoMarkets",
            "selftext": "Over the years, the space has witnessed a drastic shift in technology from different sectors in the crypto sphere, including web3, privacy, and others, to provide a high level of flexibility, speed, and security.\n\n \n\nOne of the big roll ups is the privacy sector. Inherent transparent blockchain provides identity in many situations, and there are also a number of SC that require privacy to meet their legal needs. Privacy is one factor that is probably holding back enterprise adoption of public blockchain technology. Most at time, this is achieved in blockchain technology through a cutting edge known as \"Zero Knowledge Proof.\" In the context of the blockchain network, the only information reviewed in an onchain with zero knowledge is that some piece of hidden information is valid and known by the prover.\n\n \n\nMany blockchains use ZKPs; chain links support a privacy preserving oracle system called Deco, the likes of Mina, Zcash, Railgun and many others. \n\n \n\nRegulation and compliance have been a bit of a challenge in this aspect. That's what piqued my curiosity about Otto Blockchain. It is the first onchain KYC Blockchain that adheres to regulatory intent by barring illicit actors from participation.\n\n \n\nThis is implemented in a way that the information and data of users remain highly secured and unreviewed to others. I learnt the network relies on NFT, which is issued after the KYC and verification process to every user as a means of attestation. This represents every user's wallet KYC metadata. \n\n \n\nI think this, in a way, will focus on helping blockchain-based services and crypto meet mandatory compliance, governance, and identity requirements while maintaining optimum privacy and enhancing security through multi-chain assets.\n\n \n\nSince it is not yet launched but in beta test and the on boarding process for the beta test is ongoing, I'm curious how this will function differently from other privacy projects and how intuitive it will be.",
            "stickied": false,
            "comments": []
        }
    ]
}