{
    "subreddit": "CryptoMarkets",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uskj8m",
            "title": "Is It a Good Time to Buy? – Always the Same Question With Bitcoin, and Always the Same Answer.",
            "url": "https://inbitcoinwetrust.substack.com/p/is-it-a-good-time-to-buy-always-the",
            "author": "sylsau",
            "created_utc": 1652901601.0,
            "score": 10,
            "num_comments": 11,
            "subreddit": "CryptoMarkets",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i94361o",
                    "author": "CointestAdmin",
                    "score": 1,
                    "created_utc": 1652903155.0,
                    "response": "Bitcoin [pros](/r/CryptoMarkets/comments/uskj8m/is_it_a_good_time_to_buy_always_the_same_question/i94379g/) & [cons](/r/CryptoMarkets/comments/uskj8m/is_it_a_good_time_to_buy_always_the_same_question/i9437uh/) and related info are in the collapsed comments below. Pros and cons will change for every new post.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i95ezji",
                    "author": "pierreman",
                    "score": 2,
                    "created_utc": 1652924403.0,
                    "response": "I see MKR filling the LUNA gap. Anyone else seeing MKR becoming bigger? Their DAI pays .15% yield on Coinbase and is a solid stablecoin.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i96qb46",
                            "author": "DesperateArtistry",
                            "score": 1,
                            "created_utc": 1652956994.0,
                            "response": "The LUNA crash was uncalled for. Shook the whole market. I don't know if MKR could fill the spot there. I've heard of DAI but I'd personally invest in projects like BTC, ETH and DVDX, latter for hybrid tokens, particularly.  Also, RIDE for their association with Audi",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i98tnn6",
                            "author": "Nature_-1",
                            "score": 1,
                            "created_utc": 1652991072.0,
                            "response": "Isn’t DAI a stable coin backed by Allianceblock? Looks like I’ve seen an article about it.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i97deav",
                    "author": "ShabbySuburb",
                    "score": 1,
                    "created_utc": 1652969712.0,
                    "response": "You have to define a time frame for your question, do you have one?   \n\n\n  \nThe answer from a trader's position is that it is best to find a point to open a short position, since we have seen updates of the price low for the first time since 2020, so the price will continue to update the local lows, maybe even for a couple of years to next bitcoin halving  \n\n\n  \nI continue to keep short bitcoin on wowswap with 5x leverage, but speaking from long term buying, of course I use DCA strategy for that, accumulating assets in my spot portfolio",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i94xqc0",
                    "author": "adgebush",
                    "score": 0,
                    "created_utc": 1652916288.0,
                    "response": "Playing games and earning seems to be the logical way to go in this tough situation. I'm eagerly awaiting Honeyland as it promises great return and has features unheard of like P2O where one can own in-game assets. WL spots are up for grabs in their discord channel. I just hope i get some.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}