{
    "subreddit": "CryptoMarkets",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uwcgn7",
            "title": "BTC and blockchain doesn't make you invisible transaction wise and maybe it shouldn't",
            "url": "https://www.reddit.com/r/CryptoMarkets/comments/uwcgn7/btc_and_blockchain_doesnt_make_you_invisible/",
            "author": "Beckettdjh",
            "created_utc": 1653345837.0,
            "score": 2,
            "num_comments": 6,
            "subreddit": "CryptoMarkets",
            "selftext": "  \n\n\nNow generally  talking to people led me to a realization that most of them assume that using Bitcoin or any other blockchain based currency gave them full anonymity however that is not the case nor was Bitcoin created for that purpose.  \n\n\nEvery transaction using BTC can actually be traced to the wallet from which it came from although the identity of the one that owns the wallet remains unknown unless he accidentaly makes it identifiable or uses a platform that has KYC. Bitcoin was made with transparency in mind and with much more transparency than even some banks have.  \n \n\nThere are a lot of companies like   \nZksync, Loopring, World Mobile Token that try to create Digital ID technology that could also make transactions secure but at the same time transparent because although we certainly dont want for everyone to know who we are, we also have to realize there are some serious issues to adress like the potential for crypto to be used by crime organizations.  \n\n\nDo you believe that we should make crypto transactions more or less transparent and which implications this might have ? And do you think with all these companies adressing the issues which direction will it go in ?",
            "stickied": false,
            "comments": [
                {
                    "id": "i9qnha3",
                    "author": "CointestAdmin",
                    "score": 1,
                    "created_utc": 1653346053.0,
                    "response": "Bitcoin [pros](/r/CryptoMarkets/comments/uwcgn7/btc_and_blockchain_doesnt_make_you_invisible/i9qni87/) & [cons](/r/CryptoMarkets/comments/uwcgn7/btc_and_blockchain_doesnt_make_you_invisible/i9qnipl/) and related info are in the collapsed comments below. Pros and cons will change for every new post.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9qxxe3",
                    "author": "Lor360",
                    "score": 1,
                    "created_utc": 1653351202.0,
                    "response": "I own some crypto.\n\nWith that said, people here probably don't want to hear this, but no society will ever tolerate a untraceable shadow economy, and no society should. From terrorism funding to avoiding billions in taxes to bribes, a completely invisible currency is impossible.\n\nPractically, most crypto is traceable because unlike what a lot of internet communities think, real life is much more than just the computer. You need a permit to build a shed in your yard in America and you cant import a dog into Australia, yet people think billion dollar markets cant be touched by the state just because you wrote the money in Windows Notepad.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}