{
    "subreddit": "CryptoMarkets",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "v03z0p",
            "title": "Google and Facebook make billions of dollars off of our data and we barely ever think about it. Crypto can now help us monetize that data",
            "url": "https://www.reddit.com/r/CryptoMarkets/comments/v03z0p/google_and_facebook_make_billions_of_dollars_off/",
            "author": "calisthenicslb",
            "created_utc": 1653800012.0,
            "score": 61,
            "num_comments": 27,
            "subreddit": "CryptoMarkets",
            "selftext": "We often take our data for granted but the reality is that data is one of the most valuable sources of revenue that a company can get its hands on.\n\nAdvertisement companies are willing to pay hundreds of millions to get insights on the populous’ preferences and spending habits in order to know exactly how, when and where to target them with ads.\n\nThis is the bread and butter of many major companies of the world most notably Facebook and Google and these companies don’t want to give people control over their own data cause it would be detrimental to their revenue stream.\n\nBut with crypto all our data is being encrypted meaning we have full control over how we can use it. And we’re already starting to see some projects surfacing that are giving people the option to monetize their data kinda like what Ocean Protocol has been doing recently. Although they’ve only been doing this for scientific related purposes but I believe that this could easily be expanded.\n\nIt’s no wonder than these major companies are starting to tao into the crypto market. At first they actually fought crypto but quickly realized that they cant stop it. And you that famous saying “if you cant beat em, join em”",
            "stickied": false,
            "comments": [
                {
                    "id": "iaesfnc",
                    "author": "privacyguyincognito",
                    "score": 9,
                    "created_utc": 1653817684.0,
                    "response": "As long as billions of people use those platforms, blockchain will change nothing. Besides that most people don't give a shit about privacy.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iahjp7l",
                            "author": "Jacobsendy",
                            "score": 1,
                            "created_utc": 1653869641.0,
                            "response": "Actually, people instinctively care about privacy. No one will like to pay for an hotel and the transaction left visible to anyone willing to track it on the blockchain. The issue of privacy will be amplified once crypto goes mainstream and are considered for use as payment options. It'll be absolutely ridiculous to pay for a coffee or drink through crypto and because of that, the bartender can estimate buyers' wallet balance as a result. More reasons why Railgun might turn out to be a big deal if by any chance, privacy becomes a requirement while interacting with smart contracts.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iae9mku",
                    "author": "Skydome12",
                    "score": 3,
                    "created_utc": 1653801600.0,
                    "response": "If there was a way we as users could opt in/out of our data been used by private companies in exchange we got 50/50 share of revenue from the data been sold but it gave us full power to choose which companies buy our data i'd be all for it myself.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaee2az",
                            "author": "CIN432",
                            "score": 5,
                            "created_utc": 1653805020.0,
                            "response": "Like the Brave search engine but for everything.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iaell6g",
                                    "author": "Skydome12",
                                    "score": 3,
                                    "created_utc": 1653811478.0,
                                    "response": "Yes something like but something that gives us control over which companies can purchase our metadata/online browsing habits.  \n\n\nI'm sure there's a precedent for this and if someone could figure something like that out I'm sure people would be chill with it especially if your metadata/browsing habits is stored actually securely on a blockchain where you hold the decryption keys to the data offline.  \n\n\nI guess the difficult thing is weather a company would honor their purchase of the decryption and keep it between you and them though so there'd have to be global legal framework to deal with companies illegally selling decryption keys to other parties.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iaevy2g",
                    "author": "CincyDad1993",
                    "score": 1,
                    "created_utc": 1653820823.0,
                    "response": "This is what Oasis ($rose) is trying to tackle. They are testing it out in the medical and AI fields right now, but the plan is to give you complete control on how and when your data is monetized.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaf6spy",
                    "author": "Frogmangy",
                    "score": 1,
                    "created_utc": 1653828676.0,
                    "response": "Jasmy is on it already",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaf8hkk",
                    "author": "23Heart23",
                    "score": 1,
                    "created_utc": 1653829635.0,
                    "response": "isn’t this what BAT does in a browser?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaf9q5o",
                    "author": "T1Pimp",
                    "score": 1,
                    "created_utc": 1653830303.0,
                    "response": "Ah so you've cracked the nut of how to stop ad company A who you allow access to your data from repackaging it and selling it to others? 🙄 Clearly, they'd just do the right thing and not do that, right? You're also willing to pay for all the services you use as well I assume?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iafjnzx",
                    "author": "Late_Yak9855",
                    "score": 1,
                    "created_utc": 1653835299.0,
                    "response": "Or, crypto can help to anonymiz user experience just like CCD dose with their project. Zero knowledge proof and identity layer are going to play key role in the future for any social media and especially crypto.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iahk76p",
                            "author": "geistirnd",
                            "score": 1,
                            "created_utc": 1653869907.0,
                            "response": "Already in the works. Zero knowledge proofs are not just limited to anonymizing users experience, they are being actively explored in introducing privacy in decentralized finance. For example, Railgun built an on-chain privacy system with Zksnarks which can be used to anonymously transact altcoins and NFTs with ease. Also, Zero knowledge proofs are evidently crucial in the set up of the widely accepted privacy coin, Monero. Indeed, ZK proofs is already playing crucial roles.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iag6cv9",
                    "author": "mr_birrd",
                    "score": 1,
                    "created_utc": 1653845468.0,
                    "response": "So you want to use the internet FOR FREE THE WHOLE TIME and even monetize your data? Okay. There is a reason why it's free bro.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iagaiyv",
                    "author": "Odd_Ad7489",
                    "score": 1,
                    "created_utc": 1653847385.0,
                    "response": "Crypto can help us stay away form social media tracking and spaying, projects like CCD can help with this by allowing users to stay anonymous and not include user spaying. Privaci is going to be the mose valuable asset in the future.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iagjmac",
                    "author": "xXHeroyXx",
                    "score": 1,
                    "created_utc": 1653851630.0,
                    "response": "#Elastos",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iah0hg6",
                    "author": "Odd_Ad7489",
                    "score": 1,
                    "created_utc": 1653859740.0,
                    "response": "Crypto can provide privacy and anonymous participation in the network through projects like CCD blockchain with Zero knowledge proof and identity layer.. I think Crypto should focus on privacy and not in some monetization nonsense.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaeo3c7",
                    "author": "L1ttl3_john",
                    "score": -1,
                    "created_utc": 1653813729.0,
                    "response": "RVP baby! Edit: link to their website https://revolutionpopuli.com",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaeslfq",
                    "author": "KosheenKOH",
                    "score": 0,
                    "created_utc": 1653817828.0,
                    "response": "Can you actually ask Google and Facebook to give the money they profit out of our own data? It is our personal information,  so why not get that money for yourself? \nJust a curious thought",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iag6g8d",
                            "author": "mr_birrd",
                            "score": 2,
                            "created_utc": 1653845512.0,
                            "response": "No, you should read what you agree on when making a google account.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iahhz59",
                                    "author": "KosheenKOH",
                                    "score": 1,
                                    "created_utc": 1653868727.0,
                                    "response": "I was in a really high mood when asked this. Was curious for an answer on this. But thanks",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iaey1ov",
                    "author": "pmmeurpeepee",
                    "score": 0,
                    "created_utc": 1653822593.0,
                    "response": "but,google give services,thats how they obtain it\n\n&#x200B;\n\nso,r we dumpin phone ufs to buyer or what?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaf1gb2",
                    "author": "akajifutafe",
                    "score": 0,
                    "created_utc": 1653825178.0,
                    "response": "thank me later🙏❤️ https://www.youtube.com/watch?v=tDZtBzqow6Q",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}