{
    "subreddit": "CryptoMarkets",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "v1dsqz",
            "title": "Crypto companies that deal in insider trading should burn in crypto hell and have their coins delisted",
            "url": "https://www.reddit.com/r/CryptoMarkets/comments/v1dsqz/crypto_companies_that_deal_in_insider_trading/",
            "author": "Becneldjh",
            "created_utc": 1653956815.0,
            "score": 34,
            "num_comments": 10,
            "subreddit": "CryptoMarkets",
            "selftext": "And I would add to this list any crypto company that flirts with politicians, and it goes without saying all of those that deal in pump and dump schemes. ( Of course it is almost impossible to tell which one is until it is to late ).  \n\n\nNow insider trading in crypto is very simple, a company tells you they are planning an ICO you buy coins ahead of time when they launch and the value increases you take the dollar.  \nThis is destroying the purpose of crypto, and makes crypto currencies pretty much the same as any other any type of transaction or market sector that is prone to manipulation (stocks for example)  \n\n\nThe part with involving politicians in this is the most disgusting, they seek power everywhere and when crypto companies engage in such activities they lose their credibility, crypto is about trasparency, decentralization politics is about neither of those and I strongly believe that all companies found in bed with politicians should be delisted from Binance, Durafi, Coinbase you name it and sent to virtual purgatory for destroying the soul and essence of this idea.  \n\n\nOf course I know I might be taking it over the top and that I am maybe too idealistic but do you think that I am right and what are your opinions on this ?",
            "stickied": false,
            "comments": [
                {
                    "id": "iamjmm3",
                    "author": "aasteveo",
                    "score": 2,
                    "created_utc": 1653970488.0,
                    "response": "Congress, too!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ian3ira",
                    "author": "VirtualSputnik",
                    "score": 1,
                    "created_utc": 1653986183.0,
                    "response": "Ethereum should be top of that list.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ian3qra",
                    "author": "uit3s2n4ca",
                    "score": 1,
                    "created_utc": 1653986387.0,
                    "response": "thank me later🙏❤️ https://www.youtube.com/watch?v=djK2Gw5xc00",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ianax6p",
                    "author": "Casino_Insider",
                    "score": 1,
                    "created_utc": 1653992796.0,
                    "response": "What part of decentralized and unregulated don't you understand exactly?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ialuxb9",
                    "author": "mrdeezy",
                    "score": 0,
                    "created_utc": 1653957115.0,
                    "response": "I am struggling to think of an example of a crypto and a politician being together. Most politicians don’t like crypto at all.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ialvoow",
                            "author": "Becneldjh",
                            "score": 3,
                            "created_utc": 1653957501.0,
                            "response": "just three days ago news appeared about a US congressman being investigated for this",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ialwqi3",
                                    "author": "mrdeezy",
                                    "score": 0,
                                    "created_utc": 1653958035.0,
                                    "response": "That’s a total shitcoin, that will never make it on a real exchange.Anybody investing in that garbage gets what they deserve. Idealism in relation to crypto is very naive. It’s mostly junk being traded by degens. The people who are at the biggest disadvantage are the regular folks buying it on coinbase or binance because they believe in the tech.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}