{
    "subreddit": "CryptoTechnology",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uwroyt",
            "title": "Stablecoin Crash That Shook Crypto: All You Need to Know",
            "url": "https://www.reddit.com/r/CryptoTechnology/comments/uwroyt/stablecoin_crash_that_shook_crypto_all_you_need/",
            "author": "Dramatic_Spell5708",
            "created_utc": 1653401302.0,
            "score": 0,
            "num_comments": 10,
            "subreddit": "CryptoTechnology",
            "selftext": "\n \n\nThe TerraUSD stablecoin crash has prompted some analysts to warn of a long ‘’crypto winter’’ of sustained price falls. Others say it’s only a temporary setback.\n\nThe collapse of TerraUSD (UST)  and a linked cryptocurrency called Luna shook the foundations of the $155 billion stablecoin market.\n\nThe evisceration of the supposedly safe stablecoin began on May 7, sending shockwaves through the crypto industry. Days later Luna was virtually worthless while UST has plummeted to $0.07 from $1.\n\nExactly how they unraveled is complicated and convoluted. Easier to understand is that the collapse triggered one of the most stunning crypto crashes in the market’s short history, wiping almost $700 billion off the market capitalisation of crypto assets in a week.\n\nhttps://www.asiafinancial.com/stablecoin-crash-that-shook-crypto-all-you-need-to-know",
            "stickied": false,
            "comments": [
                {
                    "id": "i9tar7k",
                    "author": "frank__costello",
                    "score": 16,
                    "created_utc": 1653404143.0,
                    "response": "> The evisceration of the supposedly safe stablecoin began\n\nAnyone who thought it was safe wasn't paying attention, there were _many_ warnings",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9tffny",
                    "author": "PinkPuppyBall",
                    "score": 5,
                    "created_utc": 1653406109.0,
                    "response": "It's wasn't complicated at all. It was a ponzi scheme. The peg only worked as long as new money kept flowing into luna. \n\nUST were printed from luna, but luna only had value because of ust. So it was clear that it would collapse if you spent 5 minutes figuring out how it worked.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9tu5sz",
                    "author": "IBuildBusinesses",
                    "score": 4,
                    "created_utc": 1653412143.0,
                    "response": "I keep waiting for the Tether shoe to drop.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9zpcec",
                            "author": "EE214_Verilog",
                            "score": 1,
                            "created_utc": 1653516237.0,
                            "response": "If tether gets rekt, then the whole crypto market can collapse",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}