{
    "subreddit": "CryptoCurrencies",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uyolsk",
            "title": "How do/did you pick a coin to invest in?",
            "url": "https://www.reddit.com/r/CryptoCurrencies/comments/uyolsk/how_dodid_you_pick_a_coin_to_invest_in/",
            "author": "ViperXAC",
            "created_utc": 1653620768.0,
            "score": 18,
            "num_comments": 37,
            "subreddit": "CryptoCurrencies",
            "selftext": "I'm somewhat new to crypto, I have a couple wallets (Metamask, Loopring) and a few coins (LRC,IMX, AMP, ETH) that I've picked up asking the way, but I'd like to learn how to look for investment opportunities; short or long term.\n\nSo, what was the process you used to pick your investment?",
            "stickied": false,
            "comments": [
                {
                    "id": "ia5ev9s",
                    "author": "PeterParkerUber",
                    "score": 12,
                    "created_utc": 1653621291.0,
                    "response": "Funny name + dog on the logo",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia5gwk8",
                            "author": "ViperXAC",
                            "score": 6,
                            "created_utc": 1653622328.0,
                            "response": "Sounds about right.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "ia5lqam",
                            "author": "jaydogg81",
                            "score": 2,
                            "created_utc": 1653625038.0,
                            "response": "Hahahahhaha",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia5ruay",
                    "author": "Hurinal",
                    "score": 6,
                    "created_utc": 1653628946.0,
                    "response": "I just see youtubers/other people talking about how great a coin is and I don’t do any research about whitepapers,roadmap,team or anything",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia632gw",
                            "author": "Lee911123",
                            "score": 1,
                            "created_utc": 1653637741.0,
                            "response": "only exception should be btc, and eth.\n\nBut Eth is definitely a lot harder to understand than Btc",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia5mi4m",
                    "author": "DiamondDallasHands",
                    "score": 3,
                    "created_utc": 1653625495.0,
                    "response": "Just kind of trial and error and coming up with a portfolio that I feel works for me. I hold BTC, ETH, DOT, ALGO, LRC. I feel like BTC and ETH are self explanatory, DOT for interoperability, ALGO for an ETH alternative blockchain, and LRC for L2 and scalability solution. The only other thing I’m thinking about adding at the moment is  XMR.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia7revg",
                            "author": "PsychologicalSong661",
                            "score": 1,
                            "created_utc": 1653671498.0,
                            "response": "You have a nice choice, but mine isn't much about trial and error instead I always think diversification wise before investing. I try to have projects under DeFi, NFTs , Metaverse, Web3.... all represented in my portfolio. For interoperability, I have ALBT instead of DOT because it's still a very low cap now.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia5tz5f",
                    "author": "sangderenard",
                    "score": 0,
                    "created_utc": 1653630446.0,
                    "response": "I started investing about three months ago and it's been a heck of a journey of learning what I didn't know I didn't know.\n\nAre people going to get rich with something that isn't bitcoin? Sure, sure, I mean you can make money on anything with volatility. Will anything that isn't bitcoin ever be better than bitcoin at the job of being an asset? Probably not for a long time.\n\nEverything that isn't bitcoin right now is failing to be as simple and as elegant as it could be. It's all extra steps and proprietary or incomplete adoption - the task at hand of a universal commodity is bitcoin. \n\nI wish I had more careful and well articulated points, I have just the sense of urgency of my conviction on the matter.\n\nI am a beginner and I've made many of the beginner mistakes, and one of those is over diversification, and specific to crypto that takes the form of fomo. What if one of these projects really really takes off and I'm left behind? Well, if you want to play roulette play roulette, but the sure thing seems like it's bitcoin.\n\nGod, I'm so frustrated with myself for not being able to outline what has convinced me so, but it is the elegant perfection of what bitcoin is and what it isn't. It isn't more of the same system of money makes power makes law. It isn't its progeny - the bitcoin forks - because it doesn't have to be. It's open, honest, brutal, flow of value.\n\nIt is just enough, no more, no less.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia5warj",
                            "author": "BumAssWhiteman",
                            "score": 1,
                            "created_utc": 1653632150.0,
                            "response": "While Bitcoin does have power and appeal based on its simplicity, for my taste BTCs environmental impact is unsustainable and will lead to cataclysmic scalability issues if/when mass adoption occurs. BTC is almost too simple, and that's where the alt coins come in to bring a solution to those issues. It's a tad unfortunate thise issues require more complexity, but even today I've always felt BTC is old tech relatively speaking that's being held up by it's cultural status and the vast amount of wealth already invested.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia5wp08",
                                    "author": "sangderenard",
                                    "score": 0,
                                    "created_utc": 1653632445.0,
                                    "response": "I just saw another post from earlier today where it was explained brilliantly, that all the things that shitcoins do don't need to be done on the blockchain as a token - bitcoin functions perfectly as a protocol layer of money - the utilization of which itself can be optimized. \n\nAs regards the environmental impact, I'm a leftist and an environmentalist, and I think we can handle the environmental impact of bitcoin as the cost of doing business. Saying bitcoin is unsustainable implicitly assumes there is nothing else we can do to not only make room for bitcoin but turn the whole problem around. Namely, we need governments and corporations and the wealthy to get their shit together.\n\nWhen the weather is out of control and water supply is scarce - when the globe is destabilizing because of the consequences of the Anthropocene - it will be because we didn't kill enough rich people and politicians, not because of bitcoin mining.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia63z8m",
                                            "author": "BumAssWhiteman",
                                            "score": 2,
                                            "created_utc": 1653638548.0,
                                            "response": "I find it ironic you can simultaneously condemn billionaires for killing the planet while applying their logic of \"the cost of business\" to something more agreeable to you. Real environmentalists/anti-billionaires actually do demand more sustainable alternatives, and BTC absolutely falls short if that.\n\nThat aside, if BTC is ever going to be the fully functioning currency it intended to be - and not just an investment asset/store of value that 99% of 1% of the total population just buy and sits on - it will absolutely not scale to that level in it's current form. Not saying there are any perfect solutions this early in crypto, but there are a few cryptos that are already better than BTC at that like Algo, sol, ADA etc.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia6hboa",
                                                    "author": "sangderenard",
                                                    "score": -1,
                                                    "created_utc": 1653649861.0,
                                                    "response": "What I've seen of the environmental impact of bitcoin is acceptable considering what is offered by the technology, and alternatives fail to offer the same hedge against corruption. Considering how trivial the lifestyle adjustments would need to be to accommodate bitcoin with even a net neutral impact on the environment, I feel comfortable saying that bitcoin is something humanity needs, while, for instance, growing alfalfa for beef supply is something we don't need as much as we are taking it for granted. You may see a hypocrisy, but only because you've failed to appreciate the nuance.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "ia6k97z",
                                                            "author": "BumAssWhiteman",
                                                            "score": 1,
                                                            "created_utc": 1653651838.0,
                                                            "response": "Last thing I'll say: currently Bitcoin take about 9 years of average household electricity to mine a single coin. With about 1.95 million coins left to mine, it will consume just under 18 million years worth of household electricity. This doesn't include any remaining halvings or the cost of power per transaction l, which will likely dwarf minings resource consumption when/if it gains mass adoption. \n\nDress it up however you want, that is ione of the most inefficient uses of resources in mankind's history.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "ia6kgp0",
                                                                    "author": "sangderenard",
                                                                    "score": 0,
                                                                    "created_utc": 1653651970.0,
                                                                    "response": "Only because you do not recognize any utility being offered in the exchange. This is not a failing of bitcoin, but a lack of understanding of the significance of what is being offered, what is being replaced, and what priorities are out of whack in society creating the scarcity of clean energy available for bitcoin.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia62zg8",
                    "author": "Annual_Elderberry736",
                    "score": 1,
                    "created_utc": 1653637667.0,
                    "response": "Fundamentals, fast, feeless and green",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia74qwy",
                    "author": "Umarzy",
                    "score": 1,
                    "created_utc": 1653662183.0,
                    "response": "Research\n\nEvaluating a project from its utility, team, partnerships, & also narratives if it's what's gaining liquidity; like we saw with NFTs projects, GameFi & P2Es, Oracles also had their run at some point.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia8rp4w",
                    "author": "Blocks_and_Chains",
                    "score": 1,
                    "created_utc": 1653687737.0,
                    "response": "I look at crypto projects like any other startup - so, analyzing the team, the mission (if they really solve a problem) and the revenue model (sustainability). This is how I pick [FLUID](https://www.fluid.finance) nowadays (FLD will launch soon and I’m planning to ride it from the start). Let’s see!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia90ujg",
                    "author": "cato_runner47",
                    "score": 1,
                    "created_utc": 1653692210.0,
                    "response": "1 word. Ripple, it's the Apple, Google or Tesla of Crypto. All these giants fought the SEC in the past and mooned, and it's XRP's time to shine after that test is over... NFA but RMW. Good luck",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia9jfct",
                    "author": "Just_A_Crypto_Guy",
                    "score": 1,
                    "created_utc": 1653701909.0,
                    "response": "There are over 16000 different crypto’s to choose from.  I develop an investment strategy first, how much to invest on the long game, how much to use at the casino...errrrr centralized exchange.  Then what sector are you interested in and what will be the next thing.  Metaverse, NFT, blockchains, financial protocols, etc.  Then what do you want your money to do to make you money.  I'm big on passive income, so I want something that I can stake or provide LP so I can gain income in addition to the price going up.  Once I know what I want, I narrow projects down to those parameters and research.  There are a bunch of research sites, I prefer the new guardianplatform.io.  when I find one I like, I buy.  Don't rush, this process for me takes a couple weeks.  Good luck to you!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia9p056",
                    "author": "nicholaux",
                    "score": 1,
                    "created_utc": 1653704862.0,
                    "response": "Team, Partners, fundamentals, use case, utility, White paper, their roadmap. These basically are the things I look at before commitment of any sort.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}