{
    "subreddit": "CryptoMarkets",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "us002v",
            "title": "This Crypto Project Aims to Compete with Social Media Giants with The Force of The Community",
            "url": "https://www.reddit.com/r/CryptoMarkets/comments/us002v/this_crypto_project_aims_to_compete_with_social/",
            "author": "guesao",
            "created_utc": 1652832151.0,
            "score": 4,
            "num_comments": 6,
            "subreddit": "CryptoMarkets",
            "selftext": "Web 3.0 is the revolutionary mechanism through which you will have the power over your data, your identity and crucially be rewarded as content creators and consumers.\n\nThe [saynetwork.io](https://saynetwork.io) ecosystem epitomises these attributes, it is facilitated by its uSAY app which is almost 70% developed and, it consists of the uLIVE and uNFT marketplace functionalities.\n\nThe Say Network community led team is building Solana’s network first successful permissionless reward orientated social media platform where you will be paid with the $Say token for engaging in the ecosystem and from advertisement revenue redistribution.\n\nThe team plans to migrate the $SAY token from Solana network to its own Layer-1 Blockchain in the future.\n\nUsers and creators of the Say Network ecosystem will get 70% of ad revenue.\n\nThe social activity coefficient, or SAC, is a major ingredient in the Say Network secret sauce. The SAC algorithm will be implemented as a set of smart contracts deployed to the Say Network layer one. These contracts are responsible for analyzing and tracking content interaction relative to users within the Say Network ecosystem. The SAC, over time, will have the ability to recognize quality content and provide the mechanics for users to identify that content. A piece of content will have a higher number of plays and actions taken on a media object if the content distribution is favoured based on users content variety through the systems algorithm which is mathematically evaluated. The SAC will quantify based on the content distribution and content variety of the evaluated media object.\n\nAlong with self-sovereignty, Say Network aims to enable users to be rewarded for recognizing content that is popular before it becomes so. Through the use of the SAY token, users are able to incentivize the ecosystem to develop quality content in the hopes the platform fosters and promotes what makes us human and does not detract from it.\n\nUsers of the Say Network ecosystem apps will be able to claim rewards based on the SAC value accrued per user straight from hour social media profile dashboard which will be measured on every 24 hour epoch interval.",
            "stickied": false,
            "comments": [
                {
                    "id": "i90i2m9",
                    "author": "steploye",
                    "score": 3,
                    "created_utc": 1652832893.0,
                    "response": "The team seems to be working hard and growing the TG organically. Trusted Dev and awesome project!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i90imns",
                    "author": "trainh13",
                    "score": 2,
                    "created_utc": 1652833162.0,
                    "response": "Fantastic community and awesome project!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i911oxf",
                    "author": "Wesley_Binod",
                    "score": 1,
                    "created_utc": 1652842187.0,
                    "response": "Where do u purchase this coin",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i91is15",
                    "author": "Delicious-Swimming78",
                    "score": 1,
                    "created_utc": 1652852494.0,
                    "response": "Sounds like users can earn rewards (crypto) by recognizing (anticipating) content before it goes viral by doing ? Are people supposed to make some expenditure to give that content a visibility boost?",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}