{
    "subreddit": "CryptoMarkets",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uys5or",
            "title": "I don’t know whether I should laugh or cry about the fact that there’s Monkeypox coin",
            "url": "https://www.reddit.com/r/CryptoMarkets/comments/uys5or/i_dont_know_whether_i_should_laugh_or_cry_about/",
            "author": "totallyfvckedup",
            "created_utc": 1653633832.0,
            "score": 7,
            "num_comments": 8,
            "subreddit": "CryptoMarkets",
            "selftext": "The evolution of meme coins is getting out of hand, I understand all the Doge copycats (no pun intended), but launching a coin that’s based on a pandemic? that’s kinda sad. I’m reading news about that the MonkeyPoxInu (MPOX) turned out to be a scam, since allegedly the developers ran away with investors’ money which is about $400M.\n\n\nI honestly think that anyone that fell for this scam was either trying to make quick profits, or they’re genuinely gullible, I mean I can’t even imagine what this coin’s marketing strategy was to attract all those investors. \n\n\nWe should try and point out obvious scams as much as possible, to help new comers not fall for hypes, and guide them to invest in more community focused projects, like DAO based projects. \n\n\nOne example is BitDAO that’s community led, where BIT holders vote on which project to support next, aiming to build a tokenized economy that everyone can become a part of. \n\n\nAnd if they’re more NFT-oriented they can look into DAOs like PleasrDAO, that aims to collect digital art that represents and funds important ideas, movements and causes that have been memorialized on-chain as NFTs. \n\n\nAlso, individually researching the team behind any new startup, has proven to be a great technique for me to draw the line between projects with actual utilities, and ones that only rely on hypes.",
            "stickied": false,
            "comments": [
                {
                    "id": "ia64rad",
                    "author": "Cryptic_88",
                    "score": 3,
                    "created_utc": 1653639238.0,
                    "response": "There are so many scams out there. Focus should be on which coins have actual utility, economics and tokenomics that make sense. I look for projects making actual revenue, so you could put an intrinsic value on the project. This should be the narrative going forward. \n\nMy example is GET Protocol, project focusing on ticketing. Each ticket sold uses a $ value in GET coins, they have about 2m tickets sold for real life events and growing rapidly.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia6xs6r",
                    "author": "Cuntycrunchys",
                    "score": 2,
                    "created_utc": 1653659082.0,
                    "response": "Shit up and take my monkey! I mean money lol. F that!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia60fph",
                    "author": "G3STO3RT",
                    "score": 1,
                    "created_utc": 1653635427.0,
                    "response": "What do you think about stablecoins like usdt?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia66sy5",
                    "author": "TurnerYolanda",
                    "score": 0,
                    "created_utc": 1653641078.0,
                    "response": "Thank me later ❤️🙏 https://www.youtube.com/watch?v=tDZtBzqow6Q",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}