{
    "subreddit": "CryptoMarkets",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ut1yem",
            "title": "Hi guys, I'm building a design Studio as a Service for web3 builders. It's one flat monthly to scale all your design needs.",
            "url": "https://www.reddit.com/r/CryptoMarkets/comments/ut1yem/hi_guys_im_building_a_design_studio_as_a_service/",
            "author": "caligolae",
            "created_utc": 1652962044.0,
            "score": 0,
            "num_comments": 1,
            "subreddit": "CryptoMarkets",
            "selftext": "As someone who's been living at the intersection of product design and crypto for the last 5 or so years, I couldn't help but notice that most web3 user interfaces suck. We regularly see terrible user experiences and quite confusing web3 products that ignore even basic best practices.\n\nFor this and other reasons, I'm starting [Openprest.com](https://openprest.com/) a \"design studio a service\" (if that's a thing) to support web3 founders and make good design more accessible. Unlike traditional shops, we won't charge per hour or per project, but on a fixed monthly basis starting at $799/mo with unlimited design requests and revisions.\n\nThis is my humble attempt to narrow the chams between the wisdom of the recent past and the speed of the future. Helping founders build web3 products that are useful and unique. That are beautiful and usable. And that brings new perspectives, but never at the expense of greater surface complexity.\n\nThoughts or feedback would be great.",
            "stickied": false,
            "comments": [
                {
                    "id": "i99p0v5",
                    "author": "caixabancyc",
                    "score": 1,
                    "created_utc": 1653006586.0,
                    "response": "This is quite remarkable, these would really help ease the journey for Web3 founders. Imagine adding this to the low code Web3 constructor on DEIP? You would literally be able to start your Web3 companies from the scratch with little or no funds.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}