{
    "subreddit": "CryptoMarkets",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uup17o",
            "title": "TA: 2022 is looking very similar to 2008",
            "url": "https://app.subsocial.network/6737/ta-2022-is-looking-very-similar-to-2008-33227",
            "author": "infekt00",
            "created_utc": 1653145650.0,
            "score": 2,
            "num_comments": 0,
            "subreddit": "CryptoMarkets",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uup50v",
            "title": "Different platforms to invest in to generate passive income",
            "url": "https://www.reddit.com/r/CryptoMarkets/comments/uup50v/different_platforms_to_invest_in_to_generate/",
            "author": "tsurutatdk",
            "created_utc": 1653145967.0,
            "score": 1,
            "num_comments": 0,
            "subreddit": "CryptoMarkets",
            "selftext": "There are various options for earning money that don't require you to put in constant work. Staking crypto is one method that has gained popularity and still continuing to do so, especially with the current market conditions.\n\n\nI assume you agree on this one? What are your thoughts? I don't see any reason to disagree with, unless you have no experience with the crypto world and prefer banks.\n\nMany platforms exist that will pay you a reasonable APY. Some prefer decentralized platforms, while others prefer centralised ones. Where you fit in is entirely up to you.\n\nYou might want to take a peek at these. It may or may not be known to you, but it may be useful in assisting you in switching platforms at your own risk.\n\n1️⃣ Coinbase \n\nIt offers a simple staking solution for their staking-supported crypto on their exchange, with the added benefit of no minimum staking requirement, according to their article.\n\n2️⃣ Cryptocom\n\nAccording to what I've read, Crypto com's mobile apps offer both flexible and fixed term staking with a few touches. Everyone has the opportunity to earn up to 14% APY. This platform is user-friendly, and even newbies will find it to be an ideal platform for crypto staking.\n\n3️⃣ Teneo Finance\n\nTeneo allows holders to hold BTC, ETH, and other crypto assets while still earning from trading in the turbulent market, as long as those assets are minted into tenBTC, tenETH, and so on. (1 ETH is equivalent to 1tenETH etc).\n\nThe original assets are stored safely in the contract. I'm impressed on how Teneo's farming system works as they'll gradually reduce emissions as they attract capital. Investors should benefit from a low slippage switching opportunity at DEXs by rewarding tenXXX!\n\n4️⃣ Stake Fish\nIt's completely non-custodial staking service where they run public validator nodes on many crypto networks. This service has something in common with My container that also share masternode staking service. For me, it's pretty much unique way to earn.\n\n5️⃣ Ramp DeFi - I found out that you can earn yields while you borrow rUSD stablecoin.\n\nYou just need to mint stablecoin against your deposited assets and pursue new opportunities. They'll be rebranding in the coming months for a better change!\n\nThese are the few platforms I wanted to share with you based on my personal experience, but I'd also like to hear from you about which platforms are working for you. After all, we all desire a long-term platform from which we may gain and we can benefit from each other's experiences and contribution.\n\nSo please share your ideas and feel free to discuss any platforms that you believe are suitable for everyone.",
            "stickied": false,
            "comments": []
        }
    ]
}