{
    "subreddit": "CryptoCurrencies",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uqy1ss",
            "title": "Why is Bitcoin the safe coast?",
            "url": "https://www.reddit.com/r/CryptoCurrencies/comments/uqy1ss/why_is_bitcoin_the_safe_coast/",
            "author": "cako05",
            "created_utc": 1652713549.0,
            "score": 0,
            "num_comments": 16,
            "subreddit": "CryptoCurrencies",
            "selftext": "Why is Bitcoin the number one? I always read something like dont invest in altcoins/shitcoins just bitcoin but what makes it so safe? I mean if its the supply or decentralization there is litecoin or even better monero who is anonym. So what is the point of bitcoin, just the fact that its the first crypto?\n\nThe Luna crash let me thought about if the same can happen to bitcoin (not the same way but no more trust and everybody selling) and i dont find the answer.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8ttkkt",
                    "author": "N1LEredd",
                    "score": 2,
                    "created_utc": 1652713955.0,
                    "response": " Btc is around for 12 ish years now and survived plenty of big crashes.\n\nIf you think that what happened to Luna/ust can even remotely be related to Btc you need to do some reading how proof of work chains differ from algorithmic stablecoins.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8tumep",
                            "author": "cako05",
                            "score": -3,
                            "created_utc": 1652714396.0,
                            "response": "Please read again. I said not the same way like luna but it can happen that nobody trust bitcoin and everyone sell his coins (we saw a little trailer of that with uncle musk trying fud bitcoin) and its definitely not the technology cuz there are enough coins with proof of work. I dont get the just invest in bitcoin talk, bitcoin can be worthless over night too.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8tvdh9",
                                    "author": "N1LEredd",
                                    "score": 1,
                                    "created_utc": 1652714708.0,
                                    "response": "No it can not be worthless over night. Too many big boy institutional investors in it for the store of value premise. Not even talking about the myriad of retail money in it dwarfing any other coin massively. Nothing short of a 51% attack could change that. Which is almost impossible and even if it would be managed then the cost of doing so coupled with the immediate devaluation of Btc would make this attempt an insane money loss.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8ty6kl",
                                            "author": "BhristopherL",
                                            "score": 1,
                                            "created_utc": 1652715863.0,
                                            "response": "It’s a bit scary that it only costs roughly $42B to purchase enough ASICs for a 51% attack on the BTC network",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8tzgdq",
                                                    "author": "N1LEredd",
                                                    "score": 1,
                                                    "created_utc": 1652716382.0,
                                                    "response": "That’s, iirc - the price of the percentage of the in use hardware you’d need to pull it off. But that’s not regarding for those people would likely never sell their hardware. So you’d need even more to outweigh the total of current miners. It also costs a shitton to keep the attack up and in the end all you did was devalueing Btc as a whole because thats what immediately happens if you try to pull this shit.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8uhgor",
                    "author": "InternalFact1",
                    "score": 1,
                    "created_utc": 1652723554.0,
                    "response": "Not really. I think Ethereum is way safer literally and figuratively. Plus they're multi-purpose so they have a lot more potential for the future.  \nThey also have Polygon with more than 6 scaling solutions to solve the scalability issues on the platform unlike Bitcoin which is notoriously awful at scalability",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8u0et5",
                    "author": "Stock_Candle",
                    "score": -2,
                    "created_utc": 1652716768.0,
                    "response": "BTC was the first and sort of proved it's stance. It is not the best system and even it's creator knew it'd be fucked if there was any sort of hardware war. Basically meant to run without greed (which of course never works as long as humans are involved). It also pollutes as shit and is slow as hell...\n\nThink of it as the overrated OG. Survived many winters, many fanatics have emotional attachment because they made bank with it. Plenty of better options exist, but they don't have even remotely the same name recognition.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8u799t",
                            "author": "Keith_Kong",
                            "score": 1,
                            "created_utc": 1652719512.0,
                            "response": "Bitcoin Maxi's are not driven by an emotional attachment. It really spawns from the idea that digital scarcity can only be achieved by having a single Ledger that remains the consensus chain of value over time. All technical achievements are secondary (and only relevant) if a single base value token can be maintained.\n\nAll these different chains competing is great for technical innovation, but it completely destroys the idea that you have one fixed supply that represents value. If value has to move around to different tokens in order to use different dApps then you cannot pursue the Austrian economic model of a fixed supply currency.\n\nBitcoiners see competitive base layers as an inherently flawed model from an economic standpoint. If you really think about it, they're right. Non-crypto people cannot and do not want to consider the value of 10 different gas tokens fluctuating against each other trying to interact with dApps... whether it be for gaming or more serious applications like DeFi.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8up2nl",
                                    "author": "Stock_Candle",
                                    "score": 0,
                                    "created_utc": 1652726582.0,
                                    "response": "That's right, but it still doesn't change the fact that we are where we are.\n\nBitcoin had the potential to be everything, but we're way past the point of no return.\n\nMiners are now corporate groups aligning graphic cards like they're managing a tuna can. Has power is basically owned by 2-3 players. Other coins keep popping daily.\n\nThe dream of Bitcoin is gone.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8uqatb",
                                            "author": "Keith_Kong",
                                            "score": 1,
                                            "created_utc": 1652727083.0,
                                            "response": "The liquidity, nation state interest, and the growth of the lightning network disagree.\n\nI would freely admit that in the distant future some other chain *could* become the one true chain because it cements its functionality and decentralizes in ways that protect it better than Bitcoin and any others.\n\nI wouldn't put money on that, especially not on any specific chain available today. But I would grant you that it's philosophically possible\n\nBut the notion that we can be a multi-chain, multi currency ecosystem that expands to a global adoption level (every internet user is using all this stuff) is completely ignorant.\n\nVolatility can only be reduced with consolidation into a massive market cap. The expansion of commerce and financial instruments within a single monetary asset is the only way to create a stable, sustainable ecosystem.\n\nIf \"crypto\" cannot consolidate into a single monetary asset for all value exchanges, it simply won't succeed. Period.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}