{
    "subreddit": "CryptoMarkets",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uztqdt",
            "title": "Free trading journal",
            "url": "https://www.reddit.com/r/CryptoMarkets/comments/uztqdt/free_trading_journal/",
            "author": "donkeysticks_1point0",
            "created_utc": 1653764176.0,
            "score": 1,
            "num_comments": 8,
            "subreddit": "CryptoMarkets",
            "selftext": " \n\n[Demo](https://reddit.com/link/uztqdt/video/kd4xqpedk9291/player)\n\nHello,\n\nI'm a developer and a stock trader. I used many forms of journals to try and make sense of my trading habits (good or bad) but most made data entry a pain or just overall clunky to use. So I built my own trading journal that represents my needs and workflow. The goal is to create a trading journal that has a friendly UI, fast and **FREE** for most use cases.\n\nI had great response and feedback from my ALPHA build and would like to continue expanding the feature set with your help.\n\nCurrently, the journal is in **BETA** and I would love to hear feedback from the community to expand on features or fix any issues that are still lingering.\n\n*Some of the current features are as follows:*\n\n* Simple manual trade entry\n* Trade setup\n* Convert setup to a trade\n* Notes\n* Tags\n* Statistics\n* Trade calendar with day PnL\n* User settings with defaults for a even simpler entry process\n* Image attachments\n* Account balance tracking\n\n**Demo video:**[ **https://imgur.com/a/DCczC6o**](https://imgur.com/a/DCczC6o)\n\n**Website:**[ **stonkjournal.com**](https://stonkjournal.com/)\n\nThank You\n\n**Q&A**\n\n* ***Is it free?***  \n\n   * YES. While I can't promise that all future features will be free, the goal is to provide a free trading journal that has enough features to satisfy most people. All functionality in BETA should continue to stay free.\n* ***How is this different from TraderSync or TraderVue?***  \n\n   * Both those products are great but StonkJournal is tailored differently. The UI and functionality revolves around quickness, short learning curve and an overall journaling flow that if compared is quite different then the rest. While StonkJournal also has a dark theme like some of the other journals, the similarities mostly stop there. Trying it out is the best way to understand the differences and to see if it works for you.\n* ***What’s with the name?***  \n\n   * First and foremost I am not married to the name. However; it was mostly born out of humar, and while StonkJournal is a legitimate stock journaling application I found humor in naming it StonkJournal because the two words “Stonk” & “Journal” should NOT go hand in hand. Basically what I’m saying is don't take the name itself too seriously but also don't get attached for I might change it later :).",
            "stickied": false,
            "comments": [
                {
                    "id": "iacqgsw",
                    "author": "ppviyuela",
                    "score": 1,
                    "created_utc": 1653771045.0,
                    "response": "Just joined!! Looks great",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iacqn66",
                            "author": "donkeysticks_1point0",
                            "score": 1,
                            "created_utc": 1653771134.0,
                            "response": "Thank you",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}