{
    "subreddit": "CryptoMarkets",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uuci6w",
            "title": "Tether (USDT) Releases Report Claiming It Has Fully Backed Reserves",
            "url": "https://www.reddit.com/r/CryptoMarkets/comments/uuci6w/tether_usdt_releases_report_claiming_it_has_fully/",
            "author": "Proud-Discipline9902",
            "created_utc": 1653095956.0,
            "score": 32,
            "num_comments": 34,
            "subreddit": "CryptoMarkets",
            "selftext": "In a new [post](https://tether.to/en/assurance-opinion-once-again-re-affirms-tethers-reserves-fully-backed-reveals-significant-reductions-in-commercial-paper-and-increase-in-us-treasury-bills/), Tether Holdings Limited announced that not only is its signature product [Tether (USDT)](https://www.coincarp.com/currencies/tether/) backed by more assets than liabilities, the company is reducing its commercial investments in favor of treasury bills backed by the US government.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9ehokd",
                    "author": "CointestAdmin",
                    "score": 1,
                    "created_utc": 1653097591.0,
                    "response": "Tether [pros](/r/CryptoMarkets/comments/uuci6w/tether_usdt_releases_report_claiming_it_has_fully/i9ehpkh/) & [cons](/r/CryptoMarkets/comments/uuci6w/tether_usdt_releases_report_claiming_it_has_fully/i9ehq0h/) and related info are in the collapsed comments below. Pros and cons will change for every new post.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9eok2x",
                    "author": "PNW-Mastermind",
                    "score": 7,
                    "created_utc": 1653101243.0,
                    "response": "“Assets”\n\nPegging something to the dollar w/ junk bonds really makes me question their judgment & greed level. I wonder how bad they got clapped in the sell off to figure out that it was a terrible, and greedy idea  & that they needed the stability of treasury bonds! Something that we can’t know because their balance sheet isn’t transparent. So we just get to take their word for it, but people still storing their life savings on that greedy Chinese Hong Kong trash in a cold wallet somewhere & won’t be able to move quick enough if it looses its peg, & then they’re gonna get pegged by their wife before she ultimately takes the kids and leave their sorry ass",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ef4j1",
                    "author": "GETSOME88-007",
                    "score": 3,
                    "created_utc": 1653096263.0,
                    "response": "They lied before, why’s should we trust them again?\n\nFurther, even if they didn’t have the assets, would they admit it?\n\nHopefully another LUNA collapse is not on the horizon for USDT…….",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9enc12",
                            "author": "SailsAk",
                            "score": 6,
                            "created_utc": 1653100583.0,
                            "response": "I mean it was an independent audit so both tether and the auditing company would have to be lying. Makes it much less likely that both are lying",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9fke4q",
                                    "author": "Struce68",
                                    "score": 2,
                                    "created_utc": 1653124949.0,
                                    "response": "It was an attestation, not an audit. Big difference. Attestation is looking at a picture of Johnny Depp and Amber Heard smiling and saying they are a happy couple at this time and date. An audit would have an explanation of abuse and literal bed shitting.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9fo5st",
                                            "author": "SailsAk",
                                            "score": 1,
                                            "created_utc": 1653128442.0,
                                            "response": "This is incorrect. An attestation is literally the most thorough audit you can do. Go ask your CPA",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9frydw",
                                                    "author": "Struce68",
                                                    "score": 2,
                                                    "created_utc": 1653131659.0,
                                                    "response": "An audit is a type of attestation. An attestation is a report certified by a CPA/lawyer. This was not an audit and Moore/MHA Cayman stated multiple times “The reporting date is limited to a point in time as of 31 March 2022 at 11:59 PM UTC. We did not perform procedures or provide any assurance at any other date or time in this report.”\nThe firm is stating this was a snap shot of a specific time. You can’t have an audit for one point in time.\nSource: I know a little bit more than you believe when it comes to taxes and accounting.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9fttkq",
                                                            "author": "SailsAk",
                                                            "score": 0,
                                                            "created_utc": 1653133081.0,
                                                            "response": "An attestation is literally a deep dive into assets. An audit is a general overview. We literally know exactly where each dollar is allocated to. Somehow you want to say that this attestation happened a week ago so that means nothing. Yeah I was in Vegas I saw tether employees blow it all on hookers and blow. Source? Trust me bro.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9fuwhj",
                                                                    "author": "Struce68",
                                                                    "score": 2,
                                                                    "created_utc": 1653133858.0,
                                                                    "response": "This is so incorrect I don’t know how to counter argue it. I’m just trying to inform you and I don’t want to argue with a stranger over the internet. Good luck to you and hopefully tether doesn’t collapse.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9fv51f",
                                                                            "author": "SailsAk",
                                                                            "score": -1,
                                                                            "created_utc": 1653134026.0,
                                                                            "response": "They won’t. It’s a fact at this point",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i9fwfdf",
                                                                                    "author": "Struce68",
                                                                                    "score": 2,
                                                                                    "created_utc": 1653134899.0,
                                                                                    "response": "We will see. I have liquidated all my crypto assets though. It will be interesting to see if crypto can survive its first economic downturn. Either way I believe it will be a while until the crypto market cap sees new all time highs.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i9fx6ai",
                                                                                            "author": "SailsAk",
                                                                                            "score": 0,
                                                                                            "created_utc": 1653135395.0,
                                                                                            "response": "Now is the time to buy, not liquidate 😂",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9frma3",
                                            "author": "illinoyce",
                                            "score": 1,
                                            "created_utc": 1653131392.0,
                                            "response": "This is misinformation",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9fv513",
                                                    "author": "Struce68",
                                                    "score": 1,
                                                    "created_utc": 1653134026.0,
                                                    "response": "How?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9g3qcj",
                                                            "author": "illinoyce",
                                                            "score": 0,
                                                            "created_utc": 1653139318.0,
                                                            "response": "An attestation is an audit. It means the auditor backs the company’s claim after investigating their reserves.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9g6zho",
                                                                    "author": "Struce68",
                                                                    "score": 2,
                                                                    "created_utc": 1653141053.0,
                                                                    "response": "No, it is not. An audit is a type of attestation, but this is not an audit. This is a claim Tether (the company) was in possession of $82 billion worth of liabilities on the exact minute of March 31st 2022, at 11:59 pm. The same way if I rented a lambo, I would be in possession of a $300,000 car for a select time period. The accounting firm is certifying tether had those assets at that minute.\nAn audit would have bank reconciliations and cash flow analysis for several months at least, if not years. That is not what this is. No where on the report is the word audit.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i9etszp",
                                    "author": "PNW-Mastermind",
                                    "score": 0,
                                    "created_utc": 1653104131.0,
                                    "response": "If they’re not transparent w/ us why would they be with the auditors? I’m sure they have some pretty snazzy accountants that can make shit look good & let’s say they are being fully transparent & we take the audit report at face value. Well then now the majority of their asset value from the auditors report says that a small minority, 10% of their holding’s is backed by USD & other fiat cash and majority was in junk bonds until recent and apparently now it’s going to T bonds which is much more intelligent but they better be careful because when the fear reaches peak levels and inflation is halfway better which leads to halfway stabilize stocks & they start trading sideways in the recession, Wall St is gonna dump the bonds in favor of higher yields in energy, consumer staples probably dividends as well. and defense sectors especially if Ukraine vs Russia gets worse & that fundamentally will force T bonds to plunge then they’re gonna be back In the same game of musical chairs smh 🤦‍♂️ You don’t peg shit to the dollar & then back it with < 10% dollar. You’re telling the blind the sky is red and they don’t know any better. it’s fucked up man, I’m no economic genius just a high school drop out but if I wanted t bond stability I would just buy them, and not rely on a stable going that is backed by worldclass traders. Best of the best or not, ask Melvin Capital how bullet proof that strategy is lmao\n\n[Tethered To Chinese Greed](https://fortune.com/2021/10/15/tether-crypto-stablecoin-fined-reserves/)",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9f0e1v",
                                            "author": "SailsAk",
                                            "score": 4,
                                            "created_utc": 1653108237.0,
                                            "response": "I’m not even going to read this because you don’t even know what an independent audit is",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9elze1",
                    "author": "freemarketcommie",
                    "score": 2,
                    "created_utc": 1653099836.0,
                    "response": "It will continue to be tested.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9fmonn",
                    "author": "MeatCrap",
                    "score": 2,
                    "created_utc": 1653127115.0,
                    "response": "Well, I have been following them since the beginning. The amount of shady things USDT was involved, or the cases filled against them, made me fear for my money tbh. I moved my assets to USDC, BUSD and eMoney stablecoins which at least are backed by real world assets.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9gisry",
                    "author": "happybonobo1",
                    "score": 2,
                    "created_utc": 1653146656.0,
                    "response": "At least something positive can come out of the UST shit show. Tether has gotten away with ignoring most critics about transparency and full backing. Now they feel the pain for that. That is actually the charm of crypto. We can all \"vote\" with our money fast and cheap and NOW they are at least TRYING to improve.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9eev0n",
                    "author": "Smooth_Mix_3022",
                    "score": 1,
                    "created_utc": 1653096121.0,
                    "response": "Is crypt backed by treasury bills really crypto?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ez5xj",
                            "author": "PNW-Mastermind",
                            "score": 3,
                            "created_utc": 1653107420.0,
                            "response": "Well yes because nobody can seize your shit without your private keys & you can still use defi platforms but the problem is you have to keep value equal to $1 USD & the most likely way to do that is match its reserves $ for $ but that isn’t profitable enough for tether so they become day traders with additional reserve & that’s a cash cow until that cow gets too old and dies & if you spend all the cash you have on the Veterinarian bill trying to revive your cash cow & it fails and now you have not enough reserves to cover any major selling pressure, you could collapse the whole crypto industry all together because everyone’s favorite large cap coins including BTC & ETH are most likely wayyyyy over leveraged for and against USDT in long positions back during the bull and short positions currently in the bear. It’s a nuclear disaster waiting to happen unless USDC  surpasses tether but nobody looks into this shit they just go w/ USDT because it’s what they know & Tether has a false superior market cap on the surface.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9ftz4d",
                    "author": "batshit_lazy",
                    "score": 1,
                    "created_utc": 1653133192.0,
                    "response": "#\"...AS OF MARCH 31\"\n\nThis does not take recent events into account. Also worth noting that the 'third party' signing off on the report is their shady shell company in the Caymans...",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9h9wno",
                    "author": "King-Colbs",
                    "score": 1,
                    "created_utc": 1653159205.0,
                    "response": "It's quite difficult for me to understand all this, so I'm not trying to conduct investigations about Tether.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}