{
    "subreddit": "CryptoMarkets",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uven2t",
            "title": "El Salvador Has Shown 44 Countries How Bitcoin Can Bank the Unbanked and Give Them a Better Future. No doubt many of these countries will seize the Bitcoin opportunity in the future. Just a matter of time.",
            "url": "https://inbitcoinwetrust.substack.com/p/el-salvador-has-shown-44-countries",
            "author": "sylsau",
            "created_utc": 1653237467.0,
            "score": 8,
            "num_comments": 15,
            "subreddit": "CryptoMarkets",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9kwluq",
                    "author": "CointestAdmin",
                    "score": 1,
                    "created_utc": 1653237564.0,
                    "response": "Bitcoin [pros](/r/CryptoMarkets/comments/uven2t/el_salvador_has_shown_44_countries_how_bitcoin/i9kwn5z/) & [cons](/r/CryptoMarkets/comments/uven2t/el_salvador_has_shown_44_countries_how_bitcoin/i9kwnqa/) and related info are in the collapsed comments below. Pros and cons will change for every new post.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9kxm2k",
                    "author": "mialomit",
                    "score": 1,
                    "created_utc": 1653237963.0,
                    "response": "For us in the western world, 2021 has showed us you can definately unbank the banked lol",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9oh3cy",
                    "author": "FreeFactoid",
                    "score": 1,
                    "created_utc": 1653311535.0,
                    "response": "\"A Centrality Analysis of the Lightning Network\" by Philipp Zabka, Klaus-T. Foerster, Christian Decker, and Stefan Schmid was presented today at the Financial Cryptography and Data Security 2022 conference. \n\nThey collected data the state of the Lightning Network's nodes and channels over 2019-2021 and then calculated metrics about how concentrated nodes and transaction routing was. Some key conclusions:\n\n>!To just give one example, our analysis shows that the top 10% of all nodes control a vast majority of all transaction routes, and that the controlled share increases over time, see Fig. 1.... \n\n>! Overall, we can deduce that the Lightning Network is highly centralized. Having only few, very influential nodes through which most paths are routed, is not beneficial for the robustness of the network. These nodes pose as significant targets for attacks and could disrupt the network in the case of failure. However not only attackers could exploit this situation, but also the nodes or rather the individuals controlling these nodes.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}