{
    "subreddit": "CryptoMarkets",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "v1kmzo",
            "title": "Question about Delta Exchange interest rate swap",
            "url": "https://www.reddit.com/r/CryptoMarkets/comments/v1kmzo/question_about_delta_exchange_interest_rate_swap/",
            "author": "byrnf",
            "created_utc": 1653981542.0,
            "score": 1,
            "num_comments": 1,
            "subreddit": "CryptoMarkets",
            "selftext": "Ok to add some context, Delta Exchange have a future contract based on the funding rate of BTCUSD of Bitmex. So like literally you can short or long the funding rate.\n\nSo maybe Is a dumb question. But if this derivative is based on Bitmex Interest Rate Swap, and Bitmex predicts the next funding rate each 8 hours, isnt this contract the easiest to win?\n\nIf Bitmex predicts a lower funding rate to be applied in, lets say, 15 mins. isn't eays just short the delta contract and earn? or am I missing something else?",
            "stickied": false,
            "comments": []
        },
        {
            "id": "v1kffz",
            "title": "The rise of “play-to-earn” games has enabled gamers to monetize their hobbies while becoming the primary decision-makers on gaming platforms rather than the developers",
            "url": "https://www.cryptonewsz.com/making-the-lucrative-world-of-p2e-accessible-to-all/",
            "author": "sadriangross",
            "created_utc": 1653980642.0,
            "score": 33,
            "num_comments": 16,
            "subreddit": "CryptoMarkets",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "iancqob",
                    "author": "ShowerWide7800",
                    "score": 1,
                    "created_utc": 1653994224.0,
                    "response": "Where do the rewards come from?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ianfs8f",
                            "author": "boxing8753",
                            "score": 1,
                            "created_utc": 1653996422.0,
                            "response": "New investors, without new investors everyone looses… aka a ticking time bomb more often referred to as a Ponzi scheme.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iandeqy",
                    "author": "Mushwar",
                    "score": 1,
                    "created_utc": 1653994725.0,
                    "response": "99% are ponzi schemes sadly. Axie infinity, neopets, stepN to name a few. All require you to spend 300-1000$ to even begin playing, it's ridiculous. \n\nI doubt there'll be a good game with great earning potential as well since countries with weaker economies will flood the game (see axie infinity for example).",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iang6uk",
                            "author": "JDublinson",
                            "score": 1,
                            "created_utc": 1653996701.0,
                            "response": "I agree. One detail though, the value of Axies has crashed so you can enter for much cheaper than that now (and you will earn nothing)",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ianftqf",
                    "author": "waysixyes",
                    "score": 1,
                    "created_utc": 1653996450.0,
                    "response": "\n\n\nI think that Crypto gaming is still in its infancy, but it has tone of potential, and making P2E accessible to more players and users is a great start.\n\n For now, I have come across games that are truly enjoyable to play, but there is still a long way to go\n\nI think that the most interesting aspect here is the possiblity to amplifying blockchain reward system in \"regular\" games, imagine the potintial here",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ianguvr",
                            "author": "boxing8753",
                            "score": 1,
                            "created_utc": 1653997149.0,
                            "response": "Cryto gaming is in a Ponzi scheme phase and that’s about it atm… I would argue it’s more stupid than NFT’s these gaming projects are so obviously unsustainable without new investors to provide exit liquidity for the old investors and it’s it’s painfully obvious.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ian5nel",
                    "author": "3dio",
                    "score": 4,
                    "created_utc": 1653988134.0,
                    "response": "Shame currently the games are crappy and rewards not hardly worth your time. Same as other attention crypto/monetary efforts so far",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iamyqyp",
                    "author": "dobrecata",
                    "score": 1,
                    "created_utc": 1653981857.0,
                    "response": "I'm really glad there are such games where you can play and earn usdt at the same time",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ianfgyi",
                    "author": "boxing8753",
                    "score": 1,
                    "created_utc": 1653996208.0,
                    "response": "Why would developers go against the gamers, the gamers are the main investors so all that’s happening is they are listening to their investors AKA this is the industry norm…\n\nThe second the gamers leave the Ponzi scheme comes crumbling down… let’s not act like this is revolutionary, anyone with a brain should read this as a huge red flag… the gamers are the investors/the product, the revenue and the exit liquidity… without the gamers there is nothing and the second that happens the project crashes…. The opposite of sustainable",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}