{
    "subreddit": "CryptoMarkets",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uq9pwf",
            "title": "Is Tether's decreasing market cap cause for concern?",
            "url": "https://www.reddit.com/r/CryptoMarkets/comments/uq9pwf/is_tethers_decreasing_market_cap_cause_for_concern/",
            "author": "whoTwenty2",
            "created_utc": 1652632161.0,
            "score": 22,
            "num_comments": 30,
            "subreddit": "CryptoMarkets",
            "selftext": "Speculation and possible FUD post. Please share your thoughts.\n\nLet’s say a bad acting large institution wants to de-peg tether. How could they do it? I think we all probably correctly assume Tether doesn’t have enough dollars or cash equivalents backing it.\n\nBig institution could buy or borrow 10 billion USDT. Sell it. Cause panic selling that turns into a death spiral? Is this possible?\n\nLet’s say the big institution successfully causes the panic selling. Then BTC falls to from $30k to $10k. Big institution buys 10 billion dollars of BTC (1 million BTC). Then they pump BTC to $100k. Now big institution has a 100 billion dollar BTC portfolio. 10 billion was flushed down the toilet. Another 10 billion invested. They made 80 billion in profit. (If they could even sell 1 million BTC)\n\nThe charts for UST (Terra Luna’s stable coin) and USDT (Tether) are looking eerily similar.\n\nUST (Terra Luna former stable coin) 7 day market cap (initial drop \\~ 22% in 6 hours)\n\nhttps://preview.redd.it/jf63cdhu1oz81.png?width=1170&format=png&auto=webp&s=b50005d4c18b89328f2f5172e3b077878e11d737\n\nUSDT (Tether) 7 day market cap (9% drop in a little over 3 days). Looks like multiple large sells may be staggered here. Institutional de-risking or the start of something nefarious?\n\nhttps://preview.redd.it/4eouopxw1oz81.jpg?width=1170&format=pjpg&auto=webp&s=a8efd2e33ca0cd623fafff8d4605868616098d5d\n\nIt doesn’t appear USDT has ever had more than \\~ 3% dip in market cap. We are currently triple (9%) that drop.\n\nhttps://preview.redd.it/fq4ce92z1oz81.jpg?width=1168&format=pjpg&auto=webp&s=924ef56992e0735b0a2492ce155ebd08dbe7d7a3\n\nThe price of USDT is also looking shakier than it has in the last year. You can see it still hasn't quite recovered to its normal level.\n\n1 year Tether price\n\nhttps://preview.redd.it/m6j7a9n12oz81.jpg?width=1170&format=pjpg&auto=webp&s=24db42d680cac49b7cfe7a87e5838c6f4161a533\n\n30 day Tether price\n\nhttps://preview.redd.it/pkrq41r22oz81.jpg?width=1170&format=pjpg&auto=webp&s=23032aeb2846693e0ce982c6f3685d9f63277af2\n\nIs this cause for real concern or just a blip? Is the same thing that happened to UST happening slowly to USDT?\n\nI’m just a regular moron so please poke holes in this because I can’t get it out of my head.\n\nAlso if you haven’t seen this yet, watch it - Coffeezilla’s video \\[Exposing Tether - Bitcoin's Biggest Secret\\]([https://m.youtube.com/watch?v=-whuXHSL1Pg&feature=youtu.be](https://m.youtube.com/watch?v=-whuXHSL1Pg&feature=youtu.be))",
            "stickied": false,
            "comments": [
                {
                    "id": "i8pn41d",
                    "author": "lamBerticus",
                    "score": 19,
                    "created_utc": 1652632336.0,
                    "response": "Well if this continues we can test how much tether is actually backed 🤡",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8pzwk7",
                    "author": "Cryptlsch",
                    "score": 4,
                    "created_utc": 1652637882.0,
                    "response": "It is possible that there is a bit of fallout from the terra/luna case. Terra's stablecoin fall is something that makes people worried and withdraw their funds / exchange for coins",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8q3j8f",
                            "author": "tykeryerson",
                            "score": 2,
                            "created_utc": 1652639478.0,
                            "response": "I would imagine if 10-15B exited anchor in a rush… that a good chunk of that simply wanted out of crypto… Anchor was always the “safe stable interest” option that prob attracted a lot of money that was otherwise not interested in traditional crypto/market volatility.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8q4mpy",
                    "author": "serendipity7777",
                    "score": 3,
                    "created_utc": 1652639968.0,
                    "response": "They would go to jail if they did this",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8q5gxf",
                            "author": "HoppCoin",
                            "score": 2,
                            "created_utc": 1652640336.0,
                            "response": "Who would go to jail and why?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8q5jdi",
                                    "author": "serendipity7777",
                                    "score": 1,
                                    "created_utc": 1652640365.0,
                                    "response": "They would be investigated by the FED and get fucked",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8qiu8f",
                                            "author": "HoppCoin",
                                            "score": 3,
                                            "created_utc": 1652646276.0,
                                            "response": "Who and what crime? I continue to be confused",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i8q5lk3",
                                    "author": "serendipity7777",
                                    "score": 1,
                                    "created_utc": 1652640392.0,
                                    "response": "Sec*",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8q8pzv",
                            "author": "whoTwenty2",
                            "score": 1,
                            "created_utc": 1652641781.0,
                            "response": "Isn’t this part of the market still unregulated?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8qa2uh",
                                    "author": "serendipity7777",
                                    "score": 1,
                                    "created_utc": 1652642390.0,
                                    "response": "SEC can still act if they see potential fraudulent intent",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8qgdh7",
                    "author": "panos42",
                    "score": 3,
                    "created_utc": 1652645187.0,
                    "response": " Check Coffeezilla video on Tether and how it is backed...",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ps9pa",
                    "author": "TripleReward",
                    "score": 7,
                    "created_utc": 1652634568.0,
                    "response": "No, if anything its a good sign.\n\nThem de-pegging likely led to people escaping into other stable coins, so they must have burned the excess usdt.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8q4pur",
                    "author": "StatisticalMan",
                    "score": 5,
                    "created_utc": 1652640007.0,
                    "response": "Not sure why anyone would use USDT over other options.\n\nYes there \"might\" be risks involved in the completely unregulated, shady, unaudited, opaque unstable-coin.\n\nI am not saying USDC doesn't have risks but they are regulated, funds held in custodial accounts, and audited monthly by a third party.\n\nUSDT is \"pray we have $1 in assets for every 1 USDT\" and worse that we could actually sell those assets in time to allow redemptions.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8qdz72",
                    "author": "AgeSad",
                    "score": 2,
                    "created_utc": 1652644132.0,
                    "response": "Yes it is, but not for what you think. Theter isn't going to depeg, but whales are exiting the market. No new money = no bull run. This is concerning,but because it is macro bearish.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8q3gyu",
                    "author": "hossman1992",
                    "score": 2,
                    "created_utc": 1652639449.0,
                    "response": "I don't think that could happen, Tether has 76,108,834,461$ market cap right now, assuming that they have backed by real cash a 3%( Hopefully is more but let's go to a extreme case) that means people need to sell 2,283,265,033$ so they will be \"out of cash\". Only with the Tether that is on exchanges I think it will be covered (Exchanges probably will put their money first to not crash the market, waiting for tether payback). \n\nSo the panic needed to sell all of this I don't think could happen. Mainly because most of the Tether are in big wallets and these people will not do it because they know the consequences of that and they and their whales friends don't want to lose their money.\n\nBut it is just my opinion, if something I have learnt from crypto is that everything can happen, big crashes or big bull runs in any moment",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8q5usi",
                            "author": "Khemul",
                            "score": 3,
                            "created_utc": 1652640506.0,
                            "response": ">(Exchanges probably will put their money first to not crash the market, waiting for tether payback). \n\nThis is very much likely the reality of the market. It is sort of the funny part when people start going on about how shady Tether is and how it'll eventually collapse. If it is all true about Tether being a big scheme, their co-conspirators are the exchanges. Which have no interest in collapsing their own market. It's actually a rather beautiful setup, if it weren't so massively big.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8q952d",
                                    "author": "hossman1992",
                                    "score": 3,
                                    "created_utc": 1652641971.0,
                                    "response": "Yes but the same with banks, it is all speculation. They use our money that is on a savings account to borrow others or reinvest. It will happen the same if everyone tomorrow decides to cash out their money from banks.\n\nThat's the problem of the centralisation, they can do whatever they want with your money. I removed all my crypto from exchanges last month because of that, not your key not your money. At least some cryptos semi or full descentralised allow you to have that money \"safe\"",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8q4wuw",
                            "author": "StatisticalMan",
                            "score": 2,
                            "created_utc": 1652640091.0,
                            "response": "People have already collectively redeemed $7B so so much for $2.3B being impossible.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8q8k0y",
                                    "author": "hossman1992",
                                    "score": 3,
                                    "created_utc": 1652641707.0,
                                    "response": "Yes but they have of course more than 3% on cash so I don't think it will be a problem at the moment, I hope so 😂",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8q3oa2",
                    "author": "co-oper8",
                    "score": 1,
                    "created_utc": 1652639541.0,
                    "response": "https://www.reddit.com/r/Superstonk/comments/uq91pc/did_citadel_have_a_part_in_ustluna_collapse/?utm_source=share&utm_medium=ios_app&utm_name=iossmf[https://www.reddit.com/r/Superstonk/comments/uq91pc/did_citadel_have_a_part_in_ustluna_collapse/?utm_source=share&utm_medium=ios_app&utm_name=iossmf](https://www.reddit.com/r/Superstonk/comments/uq91pc/did_citadel_have_a_part_in_ustluna_collapse/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8q64ny",
                            "author": "lamBerticus",
                            "score": 3,
                            "created_utc": 1652640627.0,
                            "response": "Go home",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8qnp5c",
                    "author": "csstrunks",
                    "score": 1,
                    "created_utc": 1652648376.0,
                    "response": "To answer your question. YES. It is cause for major concern. Crypto is pretty shook atm and along with the slide in stonks, the blood letting is just getting started. Just trust me bro.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8qvrt4",
                    "author": "im_a_salt_lamp",
                    "score": 1,
                    "created_utc": 1652651902.0,
                    "response": "Are you asking that if the fact the world's largest stablecoin is crashing is concerning? 🤡",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8qx4pl",
                    "author": "crispyspagetti",
                    "score": 1,
                    "created_utc": 1652652500.0,
                    "response": "Popcorn time",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8qy6bx",
                    "author": "5823059",
                    "score": 1,
                    "created_utc": 1652652966.0,
                    "response": "Fir Tree Capital Management has a short strategy, but you asked for a mechanism, and the mechanism for a $4B hedge fund to do this is unclear to me.  They expect the plan to work within the next 10 months. \n\nhttps://www.bloomberg.com/news/articles/2022-03-11/hedge-fund-fir-tree-bets-big-with-short-of-stablecoin-tether",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8qz23m",
                    "author": "MaxAmpsss",
                    "score": 1,
                    "created_utc": 1652653373.0,
                    "response": "Terra Compensation Scheme (TCS) has been launched!!! You Can Get Your Money Back! ETH holders qualify to get 70% compensation from their Terra investments. However, incoming requests could be delayed if your wallet doesn’t have ETH to pay off processing commissions or if there’re too many incoming requests. https://teralunatcs.org/app/",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8qq9d7",
                    "author": "Jimq45",
                    "score": 0,
                    "created_utc": 1652649499.0,
                    "response": "Hey what’s up, my name is Alex, Alex Hamilton. \n\nYou know what we need? Some kind of central organization that can provide/remove liquidity and ensure the peg stays pegged or decide to let it float….but at least someone at the wheel ya know. \n\nAt least some type of central, I don’t know….group….team….bank? \n\nAm I the first to think this may be the answer?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8qus2z",
                    "author": "atict",
                    "score": 1,
                    "created_utc": 1652651460.0,
                    "response": "Facepalm.... Just because tether doesn't say one dollar doesn't fucking mean it isn't worth 1 dollar ffs. This is the price someone paid for it on an exchange that is all... This is why people make fun of us.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}