{
    "subreddit": "CryptoMarkets",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uup17o",
            "title": "TA: 2022 is looking very similar to 2008",
            "url": "https://app.subsocial.network/6737/ta-2022-is-looking-very-similar-to-2008-33227",
            "author": "infekt00",
            "created_utc": 1653145650.0,
            "score": 60,
            "num_comments": 15,
            "subreddit": "CryptoMarkets",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9hjbxn",
                    "author": "Master-Monitor112",
                    "score": 5,
                    "created_utc": 1653163827.0,
                    "response": "Nice blog post. Thanks for the write up on stable coins. I was deciding which one is the best to use from now on because I don’t trust USDT after it dropped to 96 cents.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9is3z9",
                            "author": "infekt00",
                            "score": 2,
                            "created_utc": 1653187532.0,
                            "response": "Thank you. Spent a few hours doing the research. \n\nNot sure if subsocial is the platform for me to continue writing on. It doesn’t seem like I’m getting any traction there but I’ll keep posting here regardless. \n\nThanks for the feedback.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9hsrs5",
                    "author": "Ok-Nefariousness1340",
                    "score": 2,
                    "created_utc": 1653168570.0,
                    "response": ">Paper backed stabled coins such as USDT inherit more counterparty and regulatory risk than I am comfortable with. Given they are backed by US dollars, they have a single point of failure. They exist only if current administration within the US government allows them to exist.\n\n>Call me paranoid, but I would not be surprised at all to wake up and hear that some patriotically named bill passed in the middle of the night regulating these types of coins effectively illegal.\n\nWhat would a scenario like this look like? Would the US government actually do something like, for example, confiscating the funds backing these tokens, or forbidding anyone from exchanging them for dollars? Would they order them to use their freeze functionality to lock down everything in defi apps like Uniswap?\n\nThe author describes DAI as a hedge against this risk. I like DAI but not convinced about it working for this purpose. It came very close to collapsing a few years ago when Ethereum lost half its value and crashed under $100. They decided to reinforce it by... adding centrally backed assets, mostly stablecoins, [as collateral](https://daistats.com/#/), which are now the majority of it. Considering such a cataclysmic event as the overnight death of USDC and USDT would also cause a massive Ethereum crash, it seems highly unlikely that DAI would be able to retain value when those coins do not.\n\nI don't think sudden erratic action to wipe out the wealth of a whole class of investors is really their style though; seems more likely that any harmful regulation will be of the slow and insidious type, though this could be wrong.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9irmcs",
                            "author": "infekt00",
                            "score": 1,
                            "created_utc": 1653187267.0,
                            "response": "That’s what I’m referring to. They have legislation already written to regulate usdt to the point of being unusable. Janet YELLen has a vendetta against these coins. However all the legislation I’ve read mentions usdt, usdc, but never DAI. \n\nThe uncertainties regarding DAI refer back to the one event we are all aware of. However that is prior to their diversification. \n\nIf you dig into Maker DAOs docs they have cleverly assembled a diverse set of collateral, each sitting in a silo via separate trust agreements. \n\nBy no means am I a maxi on any of these coins. I just do not see any coin that is a perfect fit.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9iwc64",
                                    "author": "Ok-Nefariousness1340",
                                    "score": 1,
                                    "created_utc": 1653189890.0,
                                    "response": "Could you point out the relevant parts of this legislation or at least link it? I'm not familiar with the details.\n\nAround half of DAI was generated with USDC collateral as per the link in my last post. If there was some event that crashed USDC to zero, could you describe how DAI could continue?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9js8cy",
                                            "author": "infekt00",
                                            "score": 2,
                                            "created_utc": 1653215720.0,
                                            "response": "https://www.congress.gov/bill/116th-congress/house-bill/8827/text?r=1&s=1",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9lvmwb",
                                                    "author": "Ok-Nefariousness1340",
                                                    "score": 1,
                                                    "created_utc": 1653253112.0,
                                                    "response": "Thanks. This 2020 introduced bill seems to require that any stablecoin issuer be a bank, be fully backed with USD (or narrow equivalents?), exist at the mercy and follow all the commands of a federal banking agency. Notably the law covers issuance of stablecoins, doesn't attempt to regulate their use.\n\n>It shall be unlawful for any person to issue a stablecoin other than an insured depository institution...[or] without obtaining written approval in advance ... Any issuer of stablecoins shall deposit reserves with the applicable Federal reserve bank in a segregated account in an amount equal to the nominal redemption value of all outstanding stablecoins issued by the issuer\n\nIts specific implementation is left up to banking agencies and is put on a delay:\n\n>(d) Rulemaking.—Not later than the end of the 3-month period beginning on the date of enactment of this Act, the Board of Governors of the Federal Reserve System, the Comptroller of the Currency, and the Federal Deposit Insurance Corporation shall issue rules to carry out this Act and the amendments made by this Act.\n\nUSDC seems likely able to meet these requirements, and it seems likely implementers would be in talks with them if the bill passed, given they are a US company with some ties to the banking establishment. USDC probably would not be destroyed as a result of this law.\n\nTether seems unlikely to be able to meet these requirements. However it isn't based in the US. I'm not sure whether or to what extent jurisdiction would protect it from enforcement rules resulting from this law. It would definitely induce a lot of panic though regardless, Tether depegging seems plausible as a result if this law was passed as-is.\n\nMakerDAO seems unlikely to be able to meet these requirements, as a decentralized entity it cannot do things like become a registered bank. It's decentralization could be a form of protection, complicating or preventing taking legal action against it (or actually enforcing any rulings) under this law. But again, there's the USDC weak point: this law would give the fed general powers which could be used to order USDC to freeze holdings associated with DAI if they chose to do so, which would result in undercollateralization and probable collapse. Since there is a delay in implementation though, MakerDAO would have an opportunity to preempt this by reducing its USDC exposure.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9o1mgx",
                                                            "author": "infekt00",
                                                            "score": 1,
                                                            "created_utc": 1653301502.0,
                                                            "response": "Also if you take a look at the USDC contract it’s merely a proxy contract and can be edited at anytime to mark certain coins as “bad” or prohibit exchange, etc.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9ik2qm",
                    "author": "tastehbacon",
                    "score": 2,
                    "created_utc": 1653183135.0,
                    "response": "You should check out r/superstonk\n\nWe have known this crash is coming and why since 2020.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9s4m7z",
                            "author": "RickDimensionC137",
                            "score": 1,
                            "created_utc": 1653376261.0,
                            "response": "Can't find anything. Care to link me a thread?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9kgcrn",
                    "author": "lard-blaster",
                    "score": 1,
                    "created_utc": 1653230466.0,
                    "response": "Past performance is not indicative of future results",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uup50v",
            "title": "Different platforms to invest in to generate passive income",
            "url": "https://www.reddit.com/r/CryptoMarkets/comments/uup50v/different_platforms_to_invest_in_to_generate/",
            "author": "tsurutatdk",
            "created_utc": 1653145967.0,
            "score": 5,
            "num_comments": 15,
            "subreddit": "CryptoMarkets",
            "selftext": "There are various options for earning money that don't require you to put in constant work. Staking crypto is one method that has gained popularity and still continuing to do so, especially with the current market conditions.\n\n\nI assume you agree on this one? What are your thoughts? I don't see any reason to disagree with, unless you have no experience with the crypto world and prefer banks.\n\nMany platforms exist that will pay you a reasonable APY. Some prefer decentralized platforms, while others prefer centralised ones. Where you fit in is entirely up to you.\n\nYou might want to take a peek at these. It may or may not be known to you, but it may be useful in assisting you in switching platforms at your own risk.\n\n1️⃣ Coinbase \n\nIt offers a simple staking solution for their staking-supported crypto on their exchange, with the added benefit of no minimum staking requirement, according to their article.\n\n2️⃣ Cryptocom\n\nAccording to what I've read, Crypto com's mobile apps offer both flexible and fixed term staking with a few touches. Everyone has the opportunity to earn up to 14% APY. This platform is user-friendly, and even newbies will find it to be an ideal platform for crypto staking.\n\n3️⃣ Teneo Finance\n\nTeneo allows holders to hold BTC, ETH, and other crypto assets while still earning from trading in the turbulent market, as long as those assets are minted into tenBTC, tenETH, and so on. (1 ETH is equivalent to 1tenETH etc).\n\nThe original assets are stored safely in the contract. I'm impressed on how Teneo's farming system works as they'll gradually reduce emissions as they attract capital. Investors should benefit from a low slippage switching opportunity at DEXs by rewarding tenXXX!\n\n4️⃣ Stake Fish\nIt's completely non-custodial staking service where they run public validator nodes on many crypto networks. This service has something in common with My container that also share masternode staking service. For me, it's pretty much unique way to earn.\n\n5️⃣ Ramp DeFi - I found out that you can earn yields while you borrow rUSD stablecoin.\n\nYou just need to mint stablecoin against your deposited assets and pursue new opportunities. They'll be rebranding in the coming months for a better change!\n\nThese are the few platforms I wanted to share with you based on my personal experience, but I'd also like to hear from you about which platforms are working for you. After all, we all desire a long-term platform from which we may gain and we can benefit from each other's experiences and contribution.\n\nSo please share your ideas and feel free to discuss any platforms that you believe are suitable for everyone.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9gqunx",
                    "author": "amberlove01",
                    "score": 1,
                    "created_utc": 1653150362.0,
                    "response": "Passive income never fades.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9hzkiz",
                            "author": "Angustony",
                            "score": 0,
                            "created_utc": 1653172085.0,
                            "response": "Luna? Terra?\n\nI suppose their failure was a bit too abrupt to be classed as fading....",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9gw1b1",
                    "author": "chichi0116",
                    "score": 1,
                    "created_utc": 1653152725.0,
                    "response": "My friend is using cryptocom , I'm not so familiar with teneo and fish. I do also hold ebox that gives me  passive rewards. Yeah i agree that staking is one of the reasons why we hold to other project.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9jeuag",
                    "author": "gumbangww",
                    "score": 1,
                    "created_utc": 1653203585.0,
                    "response": "Came across the APY on Spool despite being a middle ware. Ranges from 13% to 17% with stablecoins including USDC, DAI and USDT. Since it is automated with ready made yield strategies, I think it is more suitable for anyone who doesn't understand the dynamics of how DeFi work, especially in a bear market like this.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9jic7x",
                    "author": "Extent_Leather",
                    "score": 1,
                    "created_utc": 1653206681.0,
                    "response": "How does Teneo work? Are there rewards in ETH-BTC or are they paid in stable coins?  \nLong time I didn't hear anything about Ramp. Is that still a thing?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9hzg46",
                    "author": "Angustony",
                    "score": 0,
                    "created_utc": 1653172023.0,
                    "response": "Just be aware that staking your coins relinquishes ownership of them. \n\nThousands just lost everything staking on Terra, a stablecoin that de-pegged, and its associated coin Luna, so be aware that even with respected exchanges there are other risks too.\n\nIf the interest APY is high, so is the risk.\n\nIf earning free coins or money just by staking them and doing nothing sounds a bit too good to be true, you're probably right.\n\nFar safer to DCA and hold by using a cold wallet. If you picked a good coin, that will, over time, reward you handsomely. And using a cold wallet means it's yours regardless of what happens.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}