{
    "subreddit": "CryptoTechnology",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "utolys",
            "title": "NFT technology has so much utility and value. Too bad all this money is being wasted on JPEGs of million dollar chimps",
            "url": "https://www.reddit.com/r/CryptoTechnology/comments/utolys/nft_technology_has_so_much_utility_and_value_too/",
            "author": "AdhesivenessDue652",
            "created_utc": 1653035200.0,
            "score": 56,
            "num_comments": 29,
            "subreddit": "CryptoTechnology",
            "selftext": "A lot of people would argue that “its supply and demand that causes these crazy prices” but the reality is that the majority of these NFTs are artificially pumped by the same owner or artist in order to create hype around it and make a quick buck.\n\nI’m not against NFT art. I just think that it kinda sucks that all of this capital is being funneled towards hyper-inflated JPEGs that won’t end up contributing in providing any needed use cases.\n\nInstead, I think that more resources should be allocated towards exploring the multiple use cases that NFTs have to offer from legal work, to protecting against brand counterfeit to even music and concerts. And we’re starting to actually see some progress in that regard with some projects like Tune. fm using NFTs to their advantage for streaming as part of hbar foundation’s $250 million metaverse development fund which I think will push a lot of other chains to start doing encouraging NFT projects to discover the utilitarian side of NFTs.\n\nNFT art will stay as an important part of the crypto culture, but that doesn’t mean that we can’t explore new opportunities that NFT technology has to offer",
            "stickied": false,
            "comments": [
                {
                    "id": "i9b8jgv",
                    "author": "santha7",
                    "score": 9,
                    "created_utc": 1653043041.0,
                    "response": "Okay.  Serious question.  \n\nThe web is changing.  Web 3.0 is coming.  Where do you see NFT’s and blockchain in this newly envisioned ecosystem?    \n\nThanks for the discussion.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9buhhr",
                            "author": "wickerlark",
                            "score": 1,
                            "created_utc": 1653054546.0,
                            "response": "I could see NFT’s being used for digital purchases, so buying a game on Steam would allow you to resell that game online the same way you could a physical copy.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9bi0hr",
                    "author": "Dadbean-official",
                    "score": 5,
                    "created_utc": 1653048702.0,
                    "response": "This is kind of like ranting that \"music these days is all trash,\" yet your only exposure to new music is listening to the radio.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9b1474",
                    "author": "Dormage",
                    "score": 9,
                    "created_utc": 1653037196.0,
                    "response": "NFTs are not as useful as most think. A more broad picture of them is simply onchain data that is temper proof and uniquely identifiable. However, unlike transactions(which are onchain data as well) their utility is not contained and enforced within the system. Whatever you put in an NFT needs an external party to enforce it. Proof you own some digital peace of information is only proof if there is some external party, which accepts this as proof.\n\nYou can own any music in an NFT, but people can freely copy digital info without your knowledge, it is only if a court or some other external institution recognizes your NFT as proof that you will be able to enforce your ownership.\n\nNow you could argue that in the future this will happen but then again, it will be centralized and how will it be different from existing copyright claims, patents and licences? Those recods/documents/proofs are now stored in central databases and enforced by law/issuer, etc..\n\nThe only thing that an NFT can add to this is the fact the central party cant falsify/take back/change the information. But since both systems heavily rely on the same central party it makes no sense to not trust it.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9b6tg1",
                            "author": "OtterTF",
                            "score": -2,
                            "created_utc": 1653041690.0,
                            "response": "I beg to disagree your statement regarding the NFTs not being as useful as most think. You are only limiting its context to NFT art when you can mint NFTs for your diploma, security accesses, etc. NFT games like Illuvium and Taunt Battleworld have also added greater value to NFTs now. Looking at the other side of things would give you a better insight of what NFTs offer.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9b7iur",
                                    "author": "Dormage",
                                    "score": 8,
                                    "created_utc": 1653042252.0,
                                    "response": "Okay, so lets go with the diploma usecase? My University puts a divital signature of my degree onchain as an NFT. Now when I apply for a job, the employer csn verify the validity of my degree.\n\nSo the NFT is ONLY useful, if and only if my employer takes the NFT as proof, AND if he trusts the public key that issued the NFT belongs to the Univeristy.\n\nSo were back to square one, the NFT is usless unless central parties agree to accept it as proof. \nHow is this different or better then showing a signed degree from the University, which is common. Or how would that be better then a gov. Wide central repository of all degrees. The only added value is its immutable. But that would mean the University would have to change my diploma? Your truasting the University to sign NFTs with their public key anyway, why not trust them to not take your degree away from you?\n\n\nGame items are the same, as long as the code in the game reads NFT data and gives you the items its fine, but your onchain items are usless if the same developers simply change the code and the game does not recognize your NFTs anymore. You dont solve the single point of failure as all solutions rely on a central party at some point.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9b8fjk",
                                            "author": "santha7",
                                            "score": 1,
                                            "created_utc": 1653042957.0,
                                            "response": "Okay.  I like your logic.  \n\nNow.  Add in Web 3.0.   \n\nThis is where I see the connection.   The NFT becomes an important part of the web ecosystem.  [interesting blog](https://selfkey.org/significance-of-nfts-in-web-3-0-and-the-metaverse/)",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9bf18d",
                                                    "author": "Dormage",
                                                    "score": 5,
                                                    "created_utc": 1653047107.0,
                                                    "response": "Read the blog post. I agree there are uses for NFTs but I still think they are greatly overestimated. The blog is an attempt to paint a picture of a decentralized internet in which users are in control of their data. I read a tonne of papers about blockchain enabled digital identiy and while there is potencial for it, its not realy something you want to do with NFTs.\n\nPeople forget that in order to habe an immutable lesger, we must have verifiability of its entire history. By having your ID in NFTs it inherently means your ID is public, for everyone, for ever. You wouldnt be in control of it, you cant alter it or delete it. \n\nThe actual implementation should be something in the lines of ZKP and maybe, in the future, once its feasibly to do, hommomorphic encryption.\n\nSimplistic solution:\nID data is onchain, and ecrypted, a web3 enabled service requests access to part of your ID, if you agree, you give access by decrypting with your pvt key and encrypting back with the sites public key.\n\nProblem: We can do this offchain, but lets keep the onchain data for verifiability. The bigger problem is once site A gets your data, you loose control over it as it again, can be copied, distributed and used without your consent as it is nowdays.\n\nBetter solution:\nInstead of giving site A your data, have site A ask a question such as, is this user from and EU country and is he/she older then 18? Diliver a ZKP, prooving that this is true without revealing the data, have verifiability onchain.\n\nNot sure about how NFTs come into this but I honestly have not done any research on it. It could be useful but for public data. I suppose there is added value if you can see what everyone on the internet knows about you as opposed to centralized  services that store, and monetize your data without your consent/knowledge. But its still does not solve the privacy issue.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9biz6m",
                                                            "author": "the_rhino22",
                                                            "score": 1,
                                                            "created_utc": 1653049204.0,
                                                            "response": "Great discussion guys, appreciate both sides",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9bjaux",
                                                                    "author": "Dormage",
                                                                    "score": 3,
                                                                    "created_utc": 1653049364.0,
                                                                    "response": "This sub is one of the rare remaining forums where such discussions can be had without any negativity. Regardless of what ends up as a result, having a diacussion is much better then having none at all.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i9bewug",
                                    "author": "jgsabino",
                                    "score": 1,
                                    "created_utc": 1653047038.0,
                                    "response": "About the diploma use case, Ethereum is developing Soulbound Tokens (SBTs), which to my understanding are NFTs that are permanently associated to your Web 3.0 identity. SBTs can't be traded. May be a better implementation for this use case in the future.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9bseo7",
                                    "author": "fazdaspaz",
                                    "score": 1,
                                    "created_utc": 1653053647.0,
                                    "response": "You missed their point entirely",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9b6jmn",
                            "author": "takitus",
                            "score": -3,
                            "created_utc": 1653041467.0,
                            "response": "Well this is just flat out wrong",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9b0pdx",
                    "author": "Twic3",
                    "score": 11,
                    "created_utc": 1653036826.0,
                    "response": "Ok first can we just drop this theory that all NFTs are artificially pumped by people selling between their own wallets. This is very easy to debunk thanks to the transparency of the blockchain, i mean you can easily verify this by yourself by simply going to opensea and looking at the transaction lists [https://opensea.io/collection/boredapeyachtclub/activity](https://opensea.io/collection/boredapeyachtclub/activity).\n\nWhether you like it or not the demand for JPEGs is organic and has onboarded a huge amount of people into crypto. It frustrates me that people that believe in a new emerging technology are so closed minded about the applications of said tech.\n\nYes from a surface level JPEGS are dumb and the prices at the moment are detached from reality imo. But there is a precedent for digital collectables, people have been buying skins in games for years now sometimes for ridiculous prices - [https://estnn.com/10-of-the-most-expensive-items-in-video-games-ever/](https://estnn.com/10-of-the-most-expensive-items-in-video-games-ever/).\n\nNft profile pictures can just be seen as an extension of that desire people have to express themselves and stand out by flexing their wealth. Whilst also offering access to a community of like-minded individuals.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9b12zw",
                            "author": "NewOutlandishness663",
                            "score": 8,
                            "created_utc": 1653037166.0,
                            "response": "I hardly doubt what you're saying is completely true. Its been known and proven on multiple occasions that NFT owners artificially inflate the prices of their own NFTs and no one can do anything about it cause its perfectly legal",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9b1x1v",
                                    "author": "Twic3",
                                    "score": -1,
                                    "created_utc": 1653037817.0,
                                    "response": "I'm not saying this doesn't happen. But most people use said theory to explain the prices of Bored Ape Yatch Club and other high profile collections, which is just objectively false.\n\nBAYC all time sales is $2,129,069,294, how could a single person/entity be responsible for this volume?\n\nSources:\n\n [https://opensea.io/collection/boredapeyachtclub](https://opensea.io/collection/boredapeyachtclub)   \n\n\n[https://cryptoslam.io/bored-ape-yacht-club](https://cryptoslam.io/bored-ape-yacht-club)",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9b5nqj",
                                            "author": "blindbycrypto",
                                            "score": 3,
                                            "created_utc": 1653040734.0,
                                            "response": ">how could a single person/entity be responsible for this volume?\n\nThat's not what they said. Are you misinterpreting on purpose?\n\nThere are for sure some BAYC owners who does that. They also give BAYC to celebrities to use them as publicity and have degenerates believe these celebrities are real buyers and supporters of this garbage.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9b5i7j",
                                    "author": "peanutbutterwolve",
                                    "score": 1,
                                    "created_utc": 1653040604.0,
                                    "response": "For now it’s perfectly legal but shilling auctions is 100% illegal if you get caught. The fact that open sea, nifty, etc doesn’t have rules against this, or if they do they don’t implement them, means that they are in on the scam and I have a feeling they will be facing serious consequences in the future.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9b6h36",
                            "author": "wavefield",
                            "score": 2,
                            "created_utc": 1653041408.0,
                            "response": "You realize people can just create multiple accounts and work together to pump things? It's super obvious in the case of NFTs",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9b783m",
                    "author": "Simple_Yam",
                    "score": 0,
                    "created_utc": 1653042015.0,
                    "response": "What is this post?\n\nOP if you have great ideas building around NFTs that can cure cancer or whatnot then go ahead and build them. People trading art/pfp NFTs does not make any of the other usecases any less important.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9besyv",
                    "author": "armaver",
                    "score": 1,
                    "created_utc": 1653046978.0,
                    "response": "I look at it as one of the biggest stress tests in history. It helped Ethereum mature, so that's great.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9busw7",
                    "author": "Stiltzkinn",
                    "score": 1,
                    "created_utc": 1653054683.0,
                    "response": "I'm fine using NFTs as ENS or some other Blockchain game. The good stuff will mature in few years.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9b17mf",
                    "author": "No_Geologist_1826",
                    "score": -5,
                    "created_utc": 1653037272.0,
                    "response": "Anyway, if you guys looking for a NFT creation competition, there's a huge one currently on the table now, it's a $120k prize to be won by 5 winners. This is sponsored by Telos Network for their MissionNFT Challenge. If you guys know how to digitalized your drawings or painting, know how to do 3D Arts, or know how to do animations, anyone can join the contest. Registration and submission of entries is on-going until June 30. Here's the details: https://taikai.network/en/telos-foundation/hackathons/nftp-slug\nContact or reply me back if you are interested and I will help you to the event.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}