{
    "subreddit": "CryptoTechnology",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uzsuwe",
            "title": "Can we make BTC and crypto mining 100% eco-friendly",
            "url": "https://www.reddit.com/r/CryptoTechnology/comments/uzsuwe/can_we_make_btc_and_crypto_mining_100_ecofriendly/",
            "author": "Beckettdjh",
            "created_utc": 1653761419.0,
            "score": 23,
            "num_comments": 68,
            "subreddit": "CryptoTechnology",
            "selftext": "\\>Now of course the title is I will admit it a bit of a clickbait however the question is can mining crypto and crypto in general become more environmentally friendly and what are the ways to achieve this, 100 percent is hard to be achieved but 80 percent could do.  \n\n\nBitcoin mining alone actually consumes  enough energy to power entire countries, the carbon footprint of the mining is several billion tonnes of carbon monoxide a year, hardly eco friendly right.  \n\n\nNow one way to mitigate this is to find new more efficient ways to mine crypto which some are experimenting on right now  the other way is to switch our attention more to crypto/blockchain projects that focus on renewable energy sources like (WePower, Ledger, Empowa etc) or projects that focus on the common good  that could in the long run, although  not directly, develop communities making it possible for them to switch to more eko friendly energy sources (Giant, World Mobile Token ) that focus on developing and connecting underdeveloped regions of the world.  \n\n\nWith our climate and well the world in general going to hell, it is of paramount importance we find new and innovative ways to better our society and I believe that cutting back on carbon emissions and finding new and better ways to produce energy and combat global warming are the ways to go.",
            "stickied": false,
            "comments": [
                {
                    "id": "iac7ce1",
                    "author": "AltExplainer",
                    "score": 48,
                    "created_utc": 1653761884.0,
                    "response": "Miners go where electricity is cheapest. If renewables become the cheapest source of energy then mining will switch to renewables on it's own.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iad6l8w",
                            "author": "GuessWhat_InTheButt",
                            "score": 7,
                            "created_utc": 1653778760.0,
                            "response": "This plus ASIC-resistance, so we don't end up with useless hardware, is probably the best bet to make actual mining green.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iaecogy",
                                    "author": "FaceDeer",
                                    "score": 3,
                                    "created_utc": 1653803911.0,
                                    "response": "Any hardware used to mine Bitcoin is \"useless\" for non-mining purposes, since it's not being used for that. It doesn't really matter what else it's theoretically capable of.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iaedpez",
                                            "author": "GuessWhat_InTheButt",
                                            "score": 2,
                                            "created_utc": 1653804724.0,
                                            "response": "Graphics cards are absolutely capable of gaming and compute once they are replaced by more efficient ones in mining operations.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iaeiso0",
                                                    "author": "PM_ME_YOUR_APP_IDEA",
                                                    "score": 2,
                                                    "created_utc": 1653809009.0,
                                                    "response": "u/FaceDeer is talking about bitcoin ASICs, which are useless except for bitcoin mining.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "iae0ka4",
                                    "author": "herzmeister",
                                    "score": 0,
                                    "created_utc": 1653795514.0,
                                    "response": "asic resistance is nonsense\n\nhttps://download.wpsoftware.net/bitcoin/asic-faq.pdf",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iaebu1g",
                                            "author": "GuessWhat_InTheButt",
                                            "score": 5,
                                            "created_utc": 1653803257.0,
                                            "response": "This paper makes a lot of bold claims without citing even a single source.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iafd6z3",
                                                    "author": "herzmeister",
                                                    "score": 0,
                                                    "created_utc": 1653832106.0,
                                                    "response": "lol\n\nand yet you can't address a single point by yourself using reason and logic.\n\n\"i've just heard about bitcoin, i'm here to fix it\"\n\nand the \"bold claim\" is obviously that you can have asic resistance, when logic and experience has already proven that to be wrong.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "iaevv3i",
                                    "author": "bstr156",
                                    "score": -1,
                                    "created_utc": 1653820750.0,
                                    "response": "ASIC resistance is undesireable. ASICs will become cheaper, smaller, more efficient, more powerful, and this will lead to even higher degrees of decentralization.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iackm0m",
                    "author": "UncertainOutcome",
                    "score": 20,
                    "created_utc": 1653768263.0,
                    "response": "I'm a little worried that Bitcoin become a chain around the ankle of crypto. Basically all new coins are PoS or something similar, and a lot of older coins are switching (Eth) but changing Bitcoin is basically impossible at this stage. As time goes on, the power consumption is going to draw more and more negative attention as the rest of crypto moves on from it, and I worry that it's going to drag down the entire industry.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iacl819",
                            "author": "eunit250",
                            "score": 14,
                            "created_utc": 1653768570.0,
                            "response": "That is by design. PoS holders are rewarded simply for holding creating more wealth. There is no point in selling when it costs nothing to hold and you just create more wealth. PoW fixes this issue by miners having to sell some of what they mine in order to pay for their costs of securing the network, and by doing so distributing wealth. This is the main issue with PoS as there is no incentive to actually do anything with the tokens that are created or distribute wealth because the people with the biggest wallets who are generating the most have no incentive to sell as they control/secure the networks with literally zero work.\n\nPower is only as dirty as its source and as we move into the future and move away from dirty energy by reducing the cost of renewables, we will have no problem maintaining PoW networks. Hopefully people can get past the FUD and see this.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iaed0uz",
                                    "author": "FaceDeer",
                                    "score": 5,
                                    "created_utc": 1653804183.0,
                                    "response": "Ethereum's proof of stake has diminishing rate of return as the total amount staked rises, so eventually the opportunity cost of adding your earnings back to your stake won't be worth it. Much like how if a PoW miner just keeps on adding hashpower they eventually stop being profitable. It's a solved problem.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "iacnbrx",
                                    "author": "UncertainOutcome",
                                    "score": 13,
                                    "created_utc": 1653769588.0,
                                    "response": "Solar panels and wind turbines don't materialize out of the ether. The metals have to be mined, refinend, and shaped, the parts have to be put together, you need land to put them on, you need the infrastructure to carry it and batteries to store it. That's not free in the slightest, not even counting the materials used to build ASICs. No matter what flaws it might have, PoS solves that, and the vast majority of humanity will care about that more than somebody having too much magic internet money.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iacovw4",
                                            "author": "eunit250",
                                            "score": -5,
                                            "created_utc": 1653770290.0,
                                            "response": "Yep this is all true and I really think that because of this current renewables are really not much better emission wise than the fossil fuels we have today. The only way we can get around this is by looking into advancing technologies like nuclear and most importantly thermonuclear fusion.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iacq1hf",
                                                    "author": "UncertainOutcome",
                                                    "score": 8,
                                                    "created_utc": 1653770835.0,
                                                    "response": "But that's decades away, and bitcoin miners aren't just going to wait patiently until that happens - and all the while, people are going to grow less and less tolerant of miners. My prediction: Bitcoin will evolve or die.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "iaczdca",
                                    "author": "Simple_Yam",
                                    "score": 9,
                                    "created_utc": 1653775218.0,
                                    "response": "Sorry but this is bullshit.\n\nIn PoS everyone can participate in securing the network either by running a block producer or by delegating to block producers that share their values for the network.\n\nIn PoW it's incredibly hard to be a block producer. I can't for example in my apartment. You need to figure out storage, expensive hardware, cooling, sound isolation, figure out running costs, electricity etc etc etc\n\nSo what's the result:\n\n - PoS: the system doesn't punish you by diluting your coins because it makes it incredibly easy to participate in the issuing mechanism and it's fair to everyone. Everyone's wealth is constant.\n - PoW: the system punishes most small holders by diluting their coins because only the very fortunate and with big pocket$ can afford to run mining operations at a profit and acquire more coins (selling is a very small %, big miners operate at very large profits). Economies of scale make it so that only the largest mining coroporations earn all the newly issues cost: https://www.coindesk.com/business/2021/12/29/marathon-digitals-record-purchase-of-bitcoin-miners-will-cost-879m/",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "iacolxl",
                                    "author": "Junglepeter",
                                    "score": 3,
                                    "created_utc": 1653770162.0,
                                    "response": "Take my updoot, sir - an actually sane response to OP.  \n\nPoW is the only consensus mechanism that ensures a decentralized financial system as the BTC network provides.  \n\nThe developers propose changes -> the miners can enforce that change -> but only after the nodes agree on that change.  \n\nHow does the PoS consensus mechanism work compared to PoW? By a majority vote   \n\\- determined by the total staked amount, nothing else.  \n\nIf you think about it, PoW is very similar to the \"Seperation of powers\" that governs most modern democracies (legislative, executive, judiciary) while PoS follows the age-old \"the rich get richer\" scheme that has plagued our society for far too long.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iadonx7",
                                            "author": "Russianbot123234",
                                            "score": 7,
                                            "created_utc": 1653788547.0,
                                            "response": "You do realize I'm sure that the people with the ability to mine btc efficiently at this point are the rich people who own mining farms .. guess that doesn't fit the narrative tho.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "iad4oyt",
                            "author": "tuyguy",
                            "score": -1,
                            "created_utc": 1653777808.0,
                            "response": "PoW is a feature not a bug sir",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iad5hv5",
                                    "author": "UncertainOutcome",
                                    "score": 8,
                                    "created_utc": 1653778210.0,
                                    "response": "You can say that all you want, the general population disagrees.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iad64sv",
                                            "author": "tuyguy",
                                            "score": -2,
                                            "created_utc": 1653778534.0,
                                            "response": "😂 Do you speak for them? Maybe a minority of people in the West disapprove but BTC doesn't care. \n\nBTC uses only 1% of global energy and confers 1000x++ energy expenditure improvement compared to the legacy system. Do you realise that BTC may literally end/drastically minimise warfare? Since wars are secured by money printing? Not to mention all the other benefits and banking billions of people living under financial oppression (only BTC can do this since no other cryptos can survive state attack). \n\nImagine trying to save the planet by attacking 1% of global energy expenditure. \n\nHow do you feel about gold mining btw? You're not a hypocrite are you? Inb4 gold has industrial uses. Only like 10% of gold's demand is for industrial use, the rest is monetary.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iad8as2",
                                                    "author": "UncertainOutcome",
                                                    "score": 13,
                                                    "created_utc": 1653779642.0,
                                                    "response": "1% of global energy while handling not even a millionth of global financial processing. Bitcoin might not care now, but when politicians start telling miners to shut it down what is it gonna do? Nothing, that's what.\n\n\"Wars are caused by printing money\" and you think warmongers are ever going to use bitcoin? There's no point arguing with you, you haven't done the slightest bit of critical thinking.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iad8oim",
                                                            "author": "tuyguy",
                                                            "score": -12,
                                                            "created_utc": 1653779843.0,
                                                            "response": "I bet you only got into crypto this year because you sound like a total amateur. You're literally asking cryptoReddit for advice 😂 Clear sign of a noob if ever I've seen one. \n\nCome speak to me in 5 years.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "iadajaf",
                                                                    "author": "UncertainOutcome",
                                                                    "score": 11,
                                                                    "created_utc": 1653780817.0,
                                                                    "response": "Using the word \"noob\" makes it obvious you're about 16, which means it's my sign to move on.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "iae1cc4",
                                            "author": "green_apple_panther",
                                            "score": 1,
                                            "created_utc": 1653796012.0,
                                            "response": "\"tHe PuBlIc\" can disagree all they want, bitcoin nodes are not committing suicide by switching to PoS code.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iaccfzl",
                    "author": "BroodjeAap",
                    "score": 14,
                    "created_utc": 1653764365.0,
                    "response": "Any crypto that uses Proof of Work is not eco friendly by design, so unless there are plans to move away from PoW, it will always be not eco friendly.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iagdfs1",
                            "author": "Plastic_Feedback_417",
                            "score": 1,
                            "created_utc": 1653848738.0,
                            "response": "Just because it uses energy doesn’t mean it’s not eco friendly. You guys are getting swept up in main stream hysteria. \n\nWe need to use energy. Using energy provides better standards of living.\n\nYou could stop using a washing machine and was clothes by hand. You could sweep your house instead of vacuum. You could walk instead of drive. Yet all these tools improve our standard of living and the trade off is more energy.\n\nThe problem is not using energy. The problem is how it’s generated. And bitcoin uses more green energy than any other convenience you’ve gotten used to. The energy narrative against bitcoin is just an attack from people who benefit from fiat.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iaef7hf",
                    "author": "buck54321",
                    "score": 2,
                    "created_utc": 1653805965.0,
                    "response": "If everyone heated their house with miners, it would provide more than enough hashpower and be nearly net carbon neutral in totality.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iag6t6c",
                            "author": "kwanijml",
                            "score": 1,
                            "created_utc": 1653845677.0,
                            "response": "Correct. This is nothing but an energy pricing problem and bitcoin being a convenient scapegoat for eco-cultists and those who would use the ignorance of the kool-aid-drinking masses to try to subvert a crypto which competes with theirs.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iaexv1a",
                    "author": "bstr156",
                    "score": 2,
                    "created_utc": 1653822440.0,
                    "response": "There is no such thing as 100% eco-friendly. That goes for PoW, PoS, or anything else involving computers which are manufactured.\n\nIn an ideal future, all Bitcoin miners use readily renewable or highly abundant energy, and most blockchains other than Bitcoin use merged-mining which was a concept put forth by Satoshi Nakamoto which enables them to recycle the energy already spent by Bitcoin's miners while inheriting the security and hashpower of Bitcoin's network.\n\nPoS security is vulnerable through economic vectors more so than PoW. This is the biggest reason old-world institutions like PoS so much. It's a model in which they're confident they can more easily achieve dominance over consensus through acquiring lots of an asset via hyperinflationary fiat.\n\nAlso, in an ideal future people have ethics based on solid wisdom and common-sense instead of gullibly or nefariously adopting the superficial pseudo-ethics designed by and dispensed to them through politicians, compromised professors, and mass media, by elitists with ulterior motives.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iacbot4",
                    "author": "Timmiekun",
                    "score": 4,
                    "created_utc": 1653763993.0,
                    "response": "There are plenty of projects that aren’t as power hungry as bitcoin. They use different kinds of consensus mechanisms that do not require so much power and they work very well. We shouldn’t look to cheap energy. We should look to more efficient algorithms.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iagdidx",
                            "author": "Plastic_Feedback_417",
                            "score": 1,
                            "created_utc": 1653848772.0,
                            "response": "And those projects aren’t decentralized.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iage8w0",
                                    "author": "Timmiekun",
                                    "score": 1,
                                    "created_utc": 1653849120.0,
                                    "response": "There is no evidence to suggest PoW is required for decentralization.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iageky0",
                                            "author": "Plastic_Feedback_417",
                                            "score": 1,
                                            "created_utc": 1653849277.0,
                                            "response": "Well no one else has done it so far.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iacvjdy",
                    "author": "rjm101",
                    "score": 4,
                    "created_utc": 1653773494.0,
                    "response": "It's easy: just tax non-rewewable sources and subsidise it for renewable expansions. Only exemptions I'd apply would be on miners utilising flared gas otherwise you'd literally be releasing more methane into the air. This all has very little to do with Bitcoin really. It's like blaming computers for the world's electricity use, sure civilization has and can live without them but it doesn't mean we should.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iag6h3k",
                            "author": "kwanijml",
                            "score": 1,
                            "created_utc": 1653845523.0,
                            "response": "Correct.\n\n**All** uses of C02-producing energy should pay for their externalities.  That's it. Full stop.\n\nEvery other discussion about the topic as it relates to bitcoin or PoW is just attempted subversion of bitcoin (likely by proponents of competing crypto), or a regurgitation of eco-religion dogma, which lacks any nuance to understand how value works, how pricing works, and how human flourishing relates to energy.\n\nIf bitcoin mining drops or stops because of a well-priced carbon tax, so be it.  If banks and governments are unable to keep maintaining so much travel and physical transport and facilities, so be it (of course, the eco-religion exempts government...so that won't happen), if people can't hold as many massive sporting or entertainment events, with all the travel and shipping and energy use that creates, so be it.\n\nWe don't get to pick and choose what other humans should value, and then dictate based on that, which uses of energy are \"wastes\" and which are necessary.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iacpqgp",
                    "author": "langbang",
                    "score": 6,
                    "created_utc": 1653770684.0,
                    "response": "Nope, because of decentralization.  There will always be someone mining using fossil fuels.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iae5hks",
                    "author": "mookizee",
                    "score": 2,
                    "created_utc": 1653798723.0,
                    "response": "I'd don't see a problem with energy consumption. The future has never been about reduction in energy consumption. Look at the growth every decade for the last.\nIt's how we source the energy, and that's changing every day.\nMy concern with POW mining is the ewaste created from mining hardware.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iactr86",
                    "author": "wanglubaimu",
                    "score": 1,
                    "created_utc": 1653772638.0,
                    "response": "Sure, just like how other stuff is \"100% eco-friendly\", whatever that means. You can make it so by declaring it so, eco-friendliness isn't something that physically exists. If you put enough work in it and market it smartly, people might trust that it is.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iad6zfq",
                    "author": "nabraun124",
                    "score": 1,
                    "created_utc": 1653778958.0,
                    "response": "Probably a far-fetched and improbable possibility, but I wonder if we could ever see a proof-of-carbon-capture blockchain",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iae1o95",
                    "author": "green_apple_panther",
                    "score": 1,
                    "created_utc": 1653796221.0,
                    "response": "Climate change is just another government pushed conspiracy to get you to act against your own best interests.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iae15zy",
                    "author": "Zombiefied7",
                    "score": 0,
                    "created_utc": 1653795898.0,
                    "response": "Can we make BTC 100% eco-friendly? no\n\nCan we make crypto 100% eco-friendly? yes just abandon btc and other shitcoins",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iadks57",
                    "author": "InfiniteState",
                    "score": -1,
                    "created_utc": 1653786389.0,
                    "response": "\"Eco-friendly\" isn't a thing. It's propaganda designed to sell you things. The way to curb CO2 emissions is to invest in nuclear, solar, wind, and geothermal.\n\nBitcoin generates less CO2 than clothes dryers. Or video games. Or Christmas lights. And it provides way more utility. If we're going to curb human activities, start with those.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaefxus",
                            "author": "Alanski22",
                            "score": 1,
                            "created_utc": 1653806568.0,
                            "response": "Bitcoin provides more utility than clothing dryers and video games? What?",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iae21ol",
                            "author": "AHighFifth",
                            "score": 1,
                            "created_utc": 1653796456.0,
                            "response": "Primarily nuclear honestly",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iacxoa9",
                    "author": "SashiGarami",
                    "score": 0,
                    "created_utc": 1653774435.0,
                    "response": "Unless they all run on solar, nope. And even then, manufacturing solar panels isn’t eco-friendly either.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iagdper",
                            "author": "Plastic_Feedback_417",
                            "score": 1,
                            "created_utc": 1653848865.0,
                            "response": "Lol what is this nonsense. Is this the defeatist point of view? Nothing is green? We should just all revert back to farming or something lol?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iadegnu",
                    "author": "DigitalHemlock",
                    "score": -1,
                    "created_utc": 1653782917.0,
                    "response": "How about we work on Visa and Bank of America cutting their carbon footprints?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaeqt3t",
                    "author": "MongolianMango",
                    "score": 1,
                    "created_utc": 1653816190.0,
                    "response": "Proof of work hinges on mining have an expense associated with it. So if there is a way to still create a high cost with mining that isn't linked to something with high power usage, it will be possible.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaf786n",
                    "author": "ColinFerrari01",
                    "score": 1,
                    "created_utc": 1653828935.0,
                    "response": "Of course. Just use solar panels and other renewables.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iafevvp",
                    "author": "cannedshrimp",
                    "score": 1,
                    "created_utc": 1653832949.0,
                    "response": "This is the best explanation I’ve heard yet of how PoW is going to completely shift energy markets for the better. Gets really good around the 25 minute mark. https://overcast.fm/+I6zHZxkpE\n\nLong story short, it’s very well established that the energy transition is going to require a massive increase in energy production (solar, wind, etc) so that we are less reliant on fossil fuels during times of low demand. This also requires a massive increase in demand response on the grid. Bitcoin will fill the gap and basically help subsidize renewable energy development by becoming a demand response solution that effectively “prints money” when we are overproducing solar/wind. Furthermore, as more and more of these demand response programs come on effectively using “free energy” that can’t be used otherwise it will drive up competition and push out miners using energy that is more in demand or less efficient, which is a good thing.\n\nEdit: non-biased source - https://www.iea.org/reports/demand-response\n\nAnd remember that to a grid, POW is literally pure demand response.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iackjhj",
                    "author": "__redruM",
                    "score": -3,
                    "created_utc": 1653768229.0,
                    "response": "Maybe a scheme that's lottory based.  Every node that processes a transaction is entered into the next drawing for a coin.  Drawings occur every 10 minutes.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iad980w",
                            "author": "frank__costello",
                            "score": 3,
                            "created_utc": 1653780121.0,
                            "response": "PoW is a lottery\n\nThe problem with your idea is how do you prove \"every node\"? What if I run 100,000 nodes on the same computer?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iae8jiy",
                    "author": "not420guilty",
                    "score": 0,
                    "created_utc": 1653800814.0,
                    "response": "No need.   Just stop listening to the fud.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaen8d9",
                    "author": "pillow91aussie",
                    "score": 0,
                    "created_utc": 1653812950.0,
                    "response": "There are plenty of projects using more efficient pow systems (look at ergo)",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}