{
    "subreddit": "CryptoMarkets",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uyyppx",
            "title": "Everyone is praising Polkadot, but what aspects or areas do they need to improve on?",
            "url": "https://www.reddit.com/r/CryptoMarkets/comments/uyyppx/everyone_is_praising_polkadot_but_what_aspects_or/",
            "author": "Choice-Many-9550",
            "created_utc": 1653659595.0,
            "score": 140,
            "num_comments": 45,
            "subreddit": "CryptoMarkets",
            "selftext": " There isn’t a project out there that can compete with what Polkadot has created\n\nPolkadot’s utility and functions give us something that no one else can offer. They make sure that multi chain networks are maintained with high security while not compromising decentralization.   \nThere is no other project that can compete with what Polkadot has created.\n\nPolkadot's utility and functions provide us with something no one else can. They ensure that multi-chain networks are kept secure while not compromising decentralization.\n\nThe polkadot architecture and parachains are great. Personally, I believe it will bring functionality and utility. I'm also looking forward to the release of the XCM. When I read [this](https://www.coindesk.com/business/2022/05/24/social-media-disruptor-project-liberty-to-run-on-polkadots-blockchain-network/), I got even more intrigued as this could be a very good service for everyone in the Polkadot ecosystem and Web 3 in general.\n\nI like DOT, but I hope they get some non-engineers to chime in on the UX because it appears to be designed by and for engineers, which I believe is a big problem.",
            "stickied": false,
            "comments": [
                {
                    "id": "ia71lc2",
                    "author": "CointestAdmin",
                    "score": 1,
                    "created_utc": 1653660817.0,
                    "response": "Polkadot [pros](/r/CryptoMarkets/comments/uyyppx/everyone_is_praising_polkadot_but_what_aspects_or/ia71mgt/) & [cons](/r/CryptoMarkets/comments/uyyppx/everyone_is_praising_polkadot_but_what_aspects_or/ia71mzb/) and related info are in the collapsed comments below. Pros and cons will change for every new post.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia7fnyc",
                    "author": "Stiltzkinn",
                    "score": 9,
                    "created_utc": 1653666702.0,
                    "response": "I have not seen a blockchain game that uses DOT.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia9918k",
                            "author": "fuadbinomar",
                            "score": 1,
                            "created_utc": 1653696401.0,
                            "response": "Ajuna Network is seeking for a Kusama chain named Bajuna Network - and will be a game engine on DOT.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia99diz",
                                    "author": "Stiltzkinn",
                                    "score": 1,
                                    "created_utc": 1653696578.0,
                                    "response": "Looking forward to it!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "ia7qw7j",
                            "author": "ExultantDossier",
                            "score": 1,
                            "created_utc": 1653671283.0,
                            "response": "Good point! I just realized this after you mentioned it.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iaa763t",
                            "author": "boxOsox4",
                            "score": 1,
                            "created_utc": 1653715995.0,
                            "response": "Enjin’s Efinity is already a parachain. RMRK’s NFT standard is well suited for games and they are also building Skybreach. Bit.country is focused on virtual worlds and will have its own metaverse. Phala is essentially decentralized data centers capable of providing the backend computational power to service games/metaverse and they are also building Phalaworld. Donnie is building Exosama among other things and recently purchased a game studio. \n\nThese are just off the top of my head and definitely missing projects. Most of these are also L1 chains that can work together and be customized specifically for the needs of the gaming industry. What other ecosystem can say the same?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia76lag",
                    "author": "zygodontfario53",
                    "score": 4,
                    "created_utc": 1653662960.0,
                    "response": "UX was also an issue for me. It felt like I was cramming for a university exam when I learned about stash/controller wallets and how to stake with a validator.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia7mlfj",
                            "author": "Large_Value_4552",
                            "score": 1,
                            "created_utc": 1653669524.0,
                            "response": "I'm having the same issues. I simply switched to OkCoin to eliminate the complexity of staking from my ledger.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia856uv",
                                    "author": "chapeauxcfd27",
                                    "score": 1,
                                    "created_utc": 1653677403.0,
                                    "response": "Sounds like too much of a hassle.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia89zke",
                                            "author": "zygodontfario53",
                                            "score": 1,
                                            "created_utc": 1653679538.0,
                                            "response": "That’s why I just let the pro figure it out.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "iaa7xmt",
                            "author": "boxOsox4",
                            "score": 1,
                            "created_utc": 1653716568.0,
                            "response": "The .js wallet is for developers. You can use a wallet like Talisman which is more user friendly and stake on Acala or Parallel. It’s super simple to switch over.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia7430w",
                    "author": "badgesjours91",
                    "score": 5,
                    "created_utc": 1653661898.0,
                    "response": "Hackers have exploited code flaws and caused millions of dollars in harm in the last two years before they were detected.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia79oa7",
                            "author": "Petursinn",
                            "score": 3,
                            "created_utc": 1653664247.0,
                            "response": "Can you elaborate a little on this? First time I hear about this, am very interrested in more details.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia7g5el",
                                    "author": "badgesjours91",
                                    "score": 3,
                                    "created_utc": 1653666899.0,
                                    "response": "As far as I can remember the event took place last October 2017 when Polkadot launched its Initial Coin Offering. It was one of the largest ICOs at the time. The company received at least $145 million. The event's success was short lived.  \n\n\nAre you familiar with Parity Technologies? It is formerly known as EthCore and one of the key development teams behind Polkadot, was hacked less than two weeks later. It resulted in a total loss of approximately $150 million USD. Unfortunately, Polkadot's ICO money accounted for roughly 60% of the cash frozen during the attack. This loss of funds hindered project development in its early stages.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia83wui",
                                            "author": "Aspyrus258",
                                            "score": 1,
                                            "created_utc": 1653676847.0,
                                            "response": "But they were able to come back strong. How did they manage to do that?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia9b6qb",
                                                    "author": "blank_measurement",
                                                    "score": 1,
                                                    "created_utc": 1653697536.0,
                                                    "response": "They came back strong with the launch of the BBQ Birch testnet.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "ia9dt8d",
                                                            "author": "Aspyrus258",
                                                            "score": 1,
                                                            "created_utc": 1653698937.0,
                                                            "response": "Good for them although I’m not  really familiar with that testnet.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "ia9z44d",
                                                    "author": "Dosinu",
                                                    "score": 0,
                                                    "created_utc": 1653710422.0,
                                                    "response": "i would fujcking love to have some transparency on whether they paid back those lost funds etc",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "iaa9f5w",
                                    "author": "boxOsox4",
                                    "score": 1,
                                    "created_utc": 1653717720.0,
                                    "response": "There’s been no problems on polkadot itself. This was from when Parity was still working on Ethereum. From what I remember it was a new developer that made a mistake. Since then they have developed procedures to prevent things like this from happening again. One of which is rigorous auditing of everything. One of the reasons polkadot seems to move fairly slow. Kusama was also introduced as a real world environment to implement changes prior to launching on polkadot.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia72o0v",
                    "author": "dimpledconfidant33",
                    "score": 4,
                    "created_utc": 1653661288.0,
                    "response": "I just want to say that it is still a work in progress and has a lot to prove.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia87j9m",
                            "author": "CrosslyHysterical11",
                            "score": 1,
                            "created_utc": 1653678445.0,
                            "response": "Too early to judge. Let’s give them more time.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "ia8is3c",
                            "author": "RookieRamen",
                            "score": 1,
                            "created_utc": 1653683522.0,
                            "response": "Little more specific please",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia9wjie",
                                    "author": "jellicenthero",
                                    "score": 1,
                                    "created_utc": 1653708885.0,
                                    "response": "It's been hacked. It lacks developers innovating on it. Has never had it's actual scalability tested could fall apart like Luna or gas fees go insane etc. Could be great.... could go to zero too early to tell.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia80j25",
                    "author": "CrispOriginality",
                    "score": 2,
                    "created_utc": 1653675373.0,
                    "response": "Everything has its own pros and cons. Let’s not forget that.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia8hsjn",
                    "author": "gettj",
                    "score": 2,
                    "created_utc": 1653683069.0,
                    "response": "True, I quite agree the polkadot architecture and parachains are great. Same goes for it's DeFi aggregator, Dot Finance. The DEVs however as you said need make some interface more flexible and easy to navigate to non tech users.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia945x5",
                    "author": "Kamikaza731",
                    "score": 2,
                    "created_utc": 1653693892.0,
                    "response": "Direct competition is Atom and all cosmos projects. They have same goal but function differently. Atom has zones and sub zones while polkadot has parachain. Only thing that polkadot has is shared security while atom(cosmos hub) will get it in next upgrade. I cant say much about polkadot but there are a lot of projects on cosmos. Maybe the most exiting projects in cosmos ecosystem is ibc bitcoin(still under development) interchain security, and still kinda unfrotunate but in same time good is some good project luna has are moving to juno(which is part of cosmos). There is a lot happening in both but who would win in realaty i dont know.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia9dni5",
                    "author": "therealestx",
                    "score": 2,
                    "created_utc": 1653698851.0,
                    "response": "I would say ICP matches it in areas that Dot is strong in, such as interoperability and surpasses in many other unique functionalities such direct integration with other blockchains with no bridges, relay, or hub, serve web contents, social media, games and pretty much any application directly on chain, enabling full stacks with no dependencies on web 2 stacks such as AWS, azure, or even decentralized storage solutions. Also subnets (Blockchains) on ICP can communicate with each other securely using chain key cryptography without a central hub to validate transactions. \n\nDOT is a third gen protocol and extremely advanced and it can be improved by eliminating some web 2 dependencies and moving both front and back ends on chain for ecosystem dAPPS to make them truly decentralized and secure. As TVL on the protocol gets bigger, the front ends will become a huge attack vector, which may result in stolen funds or disruption to services.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia86u49",
                    "author": "guiltlesshonesty_84",
                    "score": 1,
                    "created_utc": 1653678136.0,
                    "response": "I had some issues with the Polkadot JS wallet.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia8l38p",
                            "author": "Low_Profession_4407",
                            "score": 1,
                            "created_utc": 1653684592.0,
                            "response": "I’ve heard and seen posts about it. They were saying that users have criticized the network's main wallet for its general functionalities.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia9cn8w",
                                    "author": "SevereNeighborhood86",
                                    "score": 1,
                                    "created_utc": 1653698313.0,
                                    "response": "Consider Fearless wallet as an alternative.  I am currently using it, the staking and crowdloans work well.  However, you need to be doing your research on validators.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iaa9krh",
                                            "author": "boxOsox4",
                                            "score": 1,
                                            "created_utc": 1653717843.0,
                                            "response": "Stake with Acala or Parallel and you don’t need to worry about selecting validators.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "iaa9nky",
                                    "author": "boxOsox4",
                                    "score": 1,
                                    "created_utc": 1653717904.0,
                                    "response": "It because the .js wallet is intended for developers. People should switch to a 3rd party wallet like Talisman, Nova, fearless, etc.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia8s7ll",
                    "author": "iaminsideyourdadsmom",
                    "score": 1,
                    "created_utc": 1653687986.0,
                    "response": "cross chain l2s will compete with dot",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia8xz11",
                    "author": "drche35",
                    "score": 1,
                    "created_utc": 1653690790.0,
                    "response": "Staking doesn’t even work through ledger",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaa9ovc",
                            "author": "boxOsox4",
                            "score": 1,
                            "created_utc": 1653717931.0,
                            "response": "Yes it does",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia9bgt7",
                    "author": "SuitDistinct",
                    "score": 1,
                    "created_utc": 1653697684.0,
                    "response": "It’s parachain is great and all but no one is using it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia86fvd",
                    "author": "BodyStunning1786",
                    "score": -2,
                    "created_utc": 1653677962.0,
                    "response": "What Polkadot is doing for the crypto space space is amazing. ZKPs are booming right and other networks are also applying them to their chains like Concordium for example.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia9g7kw",
                            "author": "Doinjesuswalk",
                            "score": 2,
                            "created_utc": 1653700206.0,
                            "response": "Lol at Concordium.\n\nEven more lol at what appears to be a Concordium bot shill account.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia8hpxx",
                    "author": "Healthy_Psychology27",
                    "score": -1,
                    "created_utc": 1653683036.0,
                    "response": "Polkadot are bringing in new users everyday so regardless of whatever the issues are, a lot of people are still bullish on this project.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}