{
    "subreddit": "CryptoMarkets",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uwbq2c",
            "title": "No one wants to pay more than they have to for an asset",
            "url": "https://www.reddit.com/r/CryptoMarkets/comments/uwbq2c/no_one_wants_to_pay_more_than_they_have_to_for_an/",
            "author": "Future-Goose7",
            "created_utc": 1653343664.0,
            "score": 0,
            "num_comments": 1,
            "subreddit": "CryptoMarkets",
            "selftext": "Whether you're a retail or institutional virtual asset trader, you want to be sure the platform you're using has the lowest latency and fees, as well as the greatest security standards. Unfortunately, this is no longer the case.\n\nThe virtual asset markets suffer from different issue such as  exchange-to-exchange liquidity fragmentation,  lack of best price discovery and execution,  market manipulation,  interoperability between venues, thin volume across trading pairs,  price disparity between venues,  lack of regulatory framework for institutional participation, major counterparty risks, high latency trades and wide spreads due to lack of liquidity, spreads can be vast.\n\nThese are issues that the industry faces, the most significant of which is latency, which no one has been able to address. Current options are costly and difficult to execute, necessitating a big initial investment.\n\n The Solution\n\n FLUID combines resources across member exchanges, connecting institutions and retail users with a universal order book.​ ​ The technical architecture provides seamless interoperability between member exchanges, resulting in unified global liquidity and a stabilized market. ​ ​Thanks to the latest technology, multi-party transactions are settled instantly across all chains, exchanges, and trading pairs using a blockchain-based solution overlaying an MPC wallet architecture.​\n\nFLUID's proprietary liquidity ensures that you obtain optimum rates for your transactions, assuring the best execution, ultra-low fees, and zero counterparty risk. It's run by a seasoned senior team with over 40 years of combined and diversified experience in tier-one financial institutions and has been building since 2019.\n\nI believe this will help us save time, money, and assets as well as wide-scale adoption of cryptocurrency and blockchain tech by bringing the best of both the traditional finance world and the crypto space together for the benefit of all.",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uwbvgq",
            "title": "\"Crypto has no value, it's backed by nothing!!.\" - Peter Schiff",
            "url": "https://www.reddit.com/r/CryptoMarkets/comments/uwbvgq/crypto_has_no_value_its_backed_by_nothing_peter/",
            "author": "Heisenberg_USA",
            "created_utc": 1653344098.0,
            "score": 6,
            "num_comments": 12,
            "subreddit": "CryptoMarkets",
            "selftext": "Sorry Pete but you're wrong. Value is **subjective**, if i and the other person find that the specific item has value, then that means it has value because we can use it to trade goods and services for it.\n\nIt doesn't need to backed by Gold if it's built on solid math. The reason currencies in the past were backed by Gold/Silver was to stop governments printing unlimited amounts of money, we were forced to use their currency.\n\nWith crypto currencies like BTC, we don't need Gold anymore to back it because it's decentralized, nobody can print more of it so the supply can't manipulated and it's backed by solid math.\n\n**Have a nice day Peter.**",
            "stickied": false,
            "comments": [
                {
                    "id": "i9qp1jz",
                    "author": "lost_mentat",
                    "score": 2,
                    "created_utc": 1653346813.0,
                    "response": " Certain assets have objective value : for example food , since you can literally eat it to survive . Also a share in a company that has free cashflow also has objective concrete value , which is your part of that free cashflow . \nCrypto is an asset class that is 100% subjective & unlike the $ it’s value isn’t backed by a government and a big army. I guess that’s what Peter is trying to say, but you are right that a lot of things have subjective value , yet are valuable , modern art comes to mind . so i guess you are both right",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9qugze",
                            "author": "Heisenberg_USA",
                            "score": 1,
                            "created_utc": 1653349484.0,
                            "response": "Everything has value if that person finds that item valuable in some way, maybe he likes the way it looks or how it operates.\n\nFor peter to say it has no value is garbage.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9qm0yt",
                    "author": "mrdeezy",
                    "score": 4,
                    "created_utc": 1653345356.0,
                    "response": "He isn’t wrong, and neither are you. It’s subjective",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9qu201",
                            "author": "river_up_north",
                            "score": 1,
                            "created_utc": 1653349277.0,
                            "response": "He's an idiot. You can transfer money inside an exchange via email in seconds, safe and for free. We're speaking on international trade. PeePal and other similar legacy services as a direct competitors suck a fucking ass. Cryptocurrency is like a dream came true. People that say stupid shit like crypto is backed by nothing should be put in rehab.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9qum07",
                            "author": "Heisenberg_USA",
                            "score": 1,
                            "created_utc": 1653349552.0,
                            "response": "Then you clearly don't know how the world works if you can't understand basic logic.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9quwb6",
                                    "author": "mrdeezy",
                                    "score": 1,
                                    "created_utc": 1653349696.0,
                                    "response": "Well I am not the one writing idiotic posts addressed to some guy who doesn’t want to read it and will never read it. Nobody gives a fuck about this. If he doesn’t like bitcoin it’s up to him. If you like bitcoin, it’s up to you.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9qv79j",
                                            "author": "Heisenberg_USA",
                                            "score": 1,
                                            "created_utc": 1653349845.0,
                                            "response": "How do you know by certainty he won't read it?. It shows what kind of an idiot you are with a lack of basic understanding that value is subjective, to say it has no value is dumb.\n\nHave a nice day.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9qn4sp",
                    "author": "usercb",
                    "score": 0,
                    "created_utc": 1653345886.0,
                    "response": "Isn’t “data” by definition “value”? I’m asking. I don’t actually know.. but I think of crypto as very valuable data.\nObviously a lot of people think Bitcoin is worth 30 K these days. That’s quite a bit more than “no value” to me.\nIt’s backed by all the traders and investors. It’s true it can disappear or fluctuate, such as in the case of Luna. But I still have my Luna. It’s not gone.. it’s just worth nothing for now and the foreseeable future. It could be removed from exchanges which would make me less interested in working to keep it..\nBut for the majority of major cryptos, they apparently have value and backing. It’s a matter of lumping them all into one idiotic statement.\nDiamonds don’t have any value if you view them as dumb rocks.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9quozl",
                            "author": "Heisenberg_USA",
                            "score": 1,
                            "created_utc": 1653349594.0,
                            "response": "Everything has value if a person likes the way it looks or operates. \n\nE.g. you find that the rock on the ground is dum but others might find that the shape and colour is rare to find so he knows it has value.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9qqdtq",
                    "author": "FanNo62",
                    "score": 1,
                    "created_utc": 1653347464.0,
                    "response": "If we take USD, for example, it is also not backed, but it has value, and because of the inflation, the crypto will grow\r  \n\r  \nCurrently, I'm buying coins and waiting for the minting NFT of AngelBlock, It should be tomorrow. It's the best time for buying, because the whole  market has fallen",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9quab5",
                            "author": "Heisenberg_USA",
                            "score": 1,
                            "created_utc": 1653349391.0,
                            "response": "The value of your money is forever decreasing as they print more money, today you buy less with it than you did 5 years ago because it's backed by nothing, not gold or solid math so they can keep increasing the supply.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}