{
    "subreddit": "CryptoMarkets",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uwwbd0",
            "title": "Even though the market is at its lowest in years, I’m still seeing more and more businesses enter the crypto market and that give me a lot of relief",
            "url": "https://www.reddit.com/r/CryptoMarkets/comments/uwwbd0/even_though_the_market_is_at_its_lowest_in_years/",
            "author": "pihip2",
            "created_utc": 1653413744.0,
            "score": 3,
            "num_comments": 3,
            "subreddit": "CryptoMarkets",
            "selftext": "Bitcoin and the vast majority of alts are at the lowest they’ve been in a year now and a lot of people are feeling frustrated and nervous (myself included).\n\nHowever, I this hasn’t been stopping companies from buying cryptocurrencies and even implementing chains and protocols into their businesses.\n\nThis gives even more confidence in the future of crypto cause if I know one thing, it is that top major companies rarely ever take bad financial decisions. Of course, there will always be exceptions with bad decisions, but the way that these major companies reached the top is through teams of financial consultants leading the way in the background.\n\nSo fact that these companies are entering the crypto makes me want to stay to see how the future of the market turns out.\n\nYou got UbiSoft and Atari, two of the largest gaming developers in the world, are developing games in the P2E market.  \nGameStop has already made huge waves in the crypto community. And Stripe, the 5th largest fintech company in the world and the 6th most used payment app in the US is working with Polygon. Also, Instagram is working with Polygon as well to enable users to display their NFT on their profiles.\n\nThe short-term sentiment of the market looks horrible right now, but if you look long term all you can see is bullish news on bullish news. That’s just my opinion but it’s an opinion that’s backed by facts.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9ujgut",
                    "author": "Apprehensive_Bison0",
                    "score": 1,
                    "created_utc": 1653422714.0,
                    "response": "When is BTC hitting $8k",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uww9b4",
            "title": "Here Is Why Bitcoin Is the Best Stablecoin. Few understand this.",
            "url": "https://inbitcoinwetrust.substack.com/p/here-is-why-bitcoin-is-the-best-stablecoin",
            "author": "sylsau",
            "created_utc": 1653413590.0,
            "score": 0,
            "num_comments": 6,
            "subreddit": "CryptoMarkets",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9tyxud",
                    "author": "CointestAdmin",
                    "score": 1,
                    "created_utc": 1653414111.0,
                    "response": "Bitcoin [pros](/r/CryptoMarkets/comments/uww9b4/here_is_why_bitcoin_is_the_best_stablecoin_few/i9tyyz4/) & [cons](/r/CryptoMarkets/comments/uww9b4/here_is_why_bitcoin_is_the_best_stablecoin_few/i9tyzlc/) and related info are in the collapsed comments below. Pros and cons will change for every new post.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}