{
    "subreddit": "CryptoTechnology",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uvnvvj",
            "title": "Do you believe that the telecommunications sector's future is in blockchain ?",
            "url": "https://www.reddit.com/r/CryptoTechnology/comments/uvnvvj/do_you_believe_that_the_telecommunications/",
            "author": "Becneldjh",
            "created_utc": 1653265068.0,
            "score": 1,
            "num_comments": 2,
            "subreddit": "CryptoTechnology",
            "selftext": "Now do you believe the telecommunications sector should accept blockchain and evolve ?  \n\n\nSince the first telephone has been made in England our world has not been the same, that first step of evolution is the one that ultimately led to us 150 years on, being connected in every way imaginable.  \n\n\nNow 150 years on service providers are facing a difficult task of  having to provide telephone services along with Internet and TV, needs of customers and costs ever increasing with no end in site.   \n\n\nMy question to you is do you think blockchain technology can solve all of these problems and offer a path to sustainable growth ?  \n\n\nI've heard that some traditional providers like Verizon are already contemplating this possibility and that some new companies like Telcoin and World Mobile Token are starting their businesses based on their model.  \nDo you believe these projects have a future ?  \n\n\nWould you even perhaps invest some of your money in something like this ?  \n\n\nLet me know what you think.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9mlx93",
                    "author": "lewildbeast",
                    "score": 1,
                    "created_utc": 1653266292.0,
                    "response": "Depends on whether mesh networks take off and regulation surrounding it.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}