{
    "subreddit": "CryptoCurrencies",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uy8pi7",
            "title": "My thoughts on Luna and alternative solutions for the problem",
            "url": "https://www.reddit.com/r/CryptoCurrencies/comments/uy8pi7/my_thoughts_on_luna_and_alternative_solutions_for/",
            "author": "Ankletwit",
            "created_utc": 1653574827.0,
            "score": 1,
            "num_comments": 0,
            "subreddit": "CryptoCurrencies",
            "selftext": "Brief history before I start: I'm one of those pre-crash guys that suffered massive losses during Luna incident. To be more specific, 72,000$ worth of Luna reduced to less than a single cent. So far, I've burnt 600k Luna since Kwon's tweet of burn address. I also have been member of both LUNAtics (LUNA) and Scala (XLA) community for more than a year and a half.\n\nLets start with events surrounding Luna: We know that Kwon did everything possible to dump old Luna and create new one. He went against 92% of community, against countless experts such as CZ (Binance CEO) and ETH fork creator for instance. The [proposal 1623](https://station.terra.money/proposal/1623) succeeded with a lot of manipulation from Kwon and Luna 2 is guaranteed to come. Kwon's happy but everyone else isn't. People go so far as boycotting platforms that support Luna 2 and withdrawing their crypto from them to make a point. People want burn. I'm pro-burn as well.\n\nNow, here's my suggestion to everyone that supports burn: Luna 2 will be a thing, whether we like it or not, but there's also [proposal 1861](https://station.terra.money/proposal/1861) for burn and if you think about it, creating completely new token and implementing burn mechanism for old one, those two proposals don't oppose each-other. Even more, they're means to prove a point. We could sit and debate all night which is better: burn or new chain, we won't reach a consensus, since Kwon stands by his idea strongly, we stand by ours. Why not make proposal 1861 possible as well? That way, we benefit by actually receiving what we want and Kwon benefits by avoiding the boycott. This is the only way to prove which side is wrong and which is right. Therefore, we still have a chance, nothing's lost here.\n\nNow, I've mentioned Scala (XLA) as well and I want to say some things about it too. Future of the cryptocurrencies lies in privacy. Scala inherited privacy from Monero and refined it. 100% untrackable transactions, support for mobile mining and many more, but the most notable thing I've seen: Kwon abandoned the Luna token in its hard time. Comparatively, when XLA had similar hardships, Scala Devs worked without profit, losing their own money, but made sure coin would survive and they succeeded. The loyal community needs loyal Devs and vice versa and I know community wasn't the reason of Luna's failure, it was Kwon.\n\nP.S. I'm staying positive about proposal 1861, I'm supporting both old LUNA and XLA. If proposal 1861 succeeds and gets implemented, I'll stay supporting both coins. If it doesn't get implemented, I'll forget LUNA existed in the first place and only support XLA from thereon. I suggest everyone to do the same. Vote for proposal 1861, search for other cryptos while proposal's still ticking as the means of alternative option. My personal suggestion is privacy coin Scala (XLA).\n\nHere's the link of [Scala official website](https://scalaproject.io/) if you want to know more about it.",
            "stickied": false,
            "comments": []
        }
    ]
}