{
    "subreddit": "CryptoCurrencies",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uxgim9",
            "title": "Ethereum is widely known as the world computer, yet it still has almost the exact same block time as when it launched, this is like having a 2015 GPU trying to run CyberPunk 2077",
            "url": "https://www.reddit.com/r/CryptoCurrencies/comments/uxgim9/ethereum_is_widely_known_as_the_world_computer/",
            "author": "calisthenicslb",
            "created_utc": 1653482544.0,
            "score": 15,
            "num_comments": 20,
            "subreddit": "CryptoCurrencies",
            "selftext": "The otherside mint taught me and many others a few lessons; Ethereum is not ready for mass adoption, L2 rollups are the only thing helping it survive and people are sick of paying their kidneys in fees for the sake of good security. Good security should never cost this much, if it does, it means that your “World Computer” needs upgrades. And every singe upgrade needs 8 years of purity testing to go forward, and it’s not like Ethereum will get cheaper with the merge. \n\nThis has led many people, even Yuga Labs who dropped the otherside mint on ETH, to consider other chains, chains that will not break when you’re minting a 100,000 NFTs all at once. How do we fix this? We explore better alternatives until Ethereum catches up, and if it doesn’t, we’ll just congratulate it on the good run. I’ve been exploring AVAX since it launched, LUNA till it crashed, Polygon, and now Cartesi as they’ve literally built a blockchain OS on Linux VM. \n\nit’s super fun to see where crypto is heading, everyone is exploring literally every single coding language to build the perfect chain. This is great, it brings more people to the space, more institutional money for big firms that missed out on ETH, and will be a great catalyst to kicking off the bull market sooner than ever.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9znl4t",
                    "author": "CartographerWorth649",
                    "score": 2,
                    "created_utc": 1653515473.0,
                    "response": "I can't stress enough the need for more scaling options for Ethereum!  \n\n\nThere are great projects almost solely with that purpose like LRC or Cartesi and some more independent lie Polygon (L1 and L2) or all the cross chain options on the Dotsama space with even NFT dedicated chains like Unique Network.  \n\n\nThe final point is that all of those and even less usual suspects like BNB or ICP can do exactly the same: help ethereum to scale!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia77gsl",
                    "author": "Umarzy",
                    "score": 2,
                    "created_utc": 1653663323.0,
                    "response": "Layer 1s can't scale technically. That's why L2s are there to help ETH to scale. It's still the most decentralized, secure & robust chain in the space, and the L2s tap from Ethereum security.\n\nWondering what would be the fate of the other L1s when L2s start taking their market share; the likes of Arbitrum, Optimism, StarkNet, Metis, Zksync & Cartesi would most likely gain huge traction.\n\nPs: StarkNet even raised 100M USD recently \\[in a bear market\\] at 8bn USD valuation, so it's obvious where the next liquidity will flow.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia867wg",
                            "author": "Suzxy",
                            "score": 1,
                            "created_utc": 1653677862.0,
                            "response": "Great line up of L2s here.\n\nI recently discovered Cartesi and i'm going down the rabbit hole, so far it looks promising as an L2 platform for the development and deployment of scalable decentralized application.\n\nMetis is one I am not familiar with and i'm also looking into StarkNet on the side, I believe the mainnet is already up, right?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia0vvyg",
                    "author": "provoko",
                    "score": 1,
                    "created_utc": 1653536343.0,
                    "response": "Avax has pros and cons, but is doing very well with subnets, that ape nft maker might launch their own subet on avax.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ydxw0",
                    "author": "Blocks_and_Chains",
                    "score": 1,
                    "created_utc": 1653497100.0,
                    "response": "<<..AVAX since it launched, LUNA till it crashed>> lol this is so crazy! But great mentions for scalability - Polygon and Cartesi will carry the torch forward. First rollups of Cartesi will run on Polygon actually.. so we can call CTSI a layer3 basically. Also, when their BlockchainOS solution will become fully functional, the adoption will see a real boost - more and more regular software developers will jump onto the blockchain…",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia02j7n",
                    "author": "iamjide91",
                    "score": 1,
                    "created_utc": 1653522324.0,
                    "response": "Crypto is indeed getting more interesting. But one thing I really don't like to see is one project trying to knock down the other. I think that all blockchains are unique on their own. If one doesn't work for you, you got alternatives.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia2dpqh",
                    "author": "apstl88",
                    "score": 1,
                    "created_utc": 1653573518.0,
                    "response": "When it comes to scaling, I think that Polkadot is way better than Ethereum at this point. We are waiting for upgrades for too long and no one knows when that is actually going to happen.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia38fq0",
                    "author": "MakeItRelevant",
                    "score": 1,
                    "created_utc": 1653585906.0,
                    "response": "I'm not sure, but maybe Ethereum can be ready for mass adoption after 2.0 update. I'm using AVAX and Polygon, but not Cartesi. I'll start my research on it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ze3g2",
                    "author": "Sourdoughsucker",
                    "score": 0,
                    "created_utc": 1653511433.0,
                    "response": "XRPLedger is one of the few that can scale and handle mass adoption. The validators all voted for allowing minting and transferring of NFT so you have a much cheaper and faster alternative",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uxg919",
            "title": "DeFi Platform Lido Votes Against Supporting New Terra Blockchain",
            "url": "https://www.coindesk.com/business/2022/05/25/defi-platform-lido-votes-against-supporting-new-terra-blockchain/",
            "author": "Some_won",
            "created_utc": 1653481636.0,
            "score": 42,
            "num_comments": 6,
            "subreddit": "CryptoCurrencies",
            "selftext": "",
            "stickied": false,
            "comments": []
        }
    ]
}