{
    "subreddit": "CryptoMarkets",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uzly3k",
            "title": "Are you bleeding out money? Gotta watch this...",
            "url": "https://www.youtube.com/watch?v=kLfhWXLtpHg",
            "author": "MarisolLima",
            "created_utc": 1653739539.0,
            "score": 10,
            "num_comments": 30,
            "subreddit": "CryptoMarkets",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "iab8g0p",
                    "author": "Successful-Elk-3444",
                    "score": 1,
                    "created_utc": 1653745132.0,
                    "response": "Evident from its history, the price of bitcoin can appreciate as quickly as it depreciates. Traders with a high-risk appetite are drawn to volatile assets that have the potential to reap huge rewards, or equally huge losses. However, whilst some traders rely on luck, others utilise a structured approach based on experience and knowledge.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iab8quh",
                    "author": "Chyokore",
                    "score": 1,
                    "created_utc": 1653745298.0,
                    "response": "Some traders short assets to hedge the risk of their larger portfolio. For example, if you already hold bitcoin but you suspect it is due to fall in the short term, you may decide to open a position to short sell bitcoin. If you are correct, the profit from your short position can reduce or exceed your loss from your long position.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iacbiu4",
                            "author": "GretaVonTendie",
                            "score": 1,
                            "created_utc": 1653763911.0,
                            "response": "I've discovered that lots of folks do not know that you can short Bitcoin via /mbt, the micro bitcoin futures. It is 10% of normal bitcoin price...i.e. if you are short one contract of/mbt (that's the futures symbol), and Bitcoin moves $400, the contract value moves $40.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iabhyxz",
                    "author": "TobiB1976",
                    "score": 1,
                    "created_utc": 1653749942.0,
                    "response": "Again very well done. I am always amazed by his expertise and overview. A Thumb up from me again.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iabl5o3",
                    "author": "Left_Iron3305",
                    "score": 1,
                    "created_utc": 1653751432.0,
                    "response": "Taking note of the correlation between markets will help a trader make better investment decisions.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iabw96q",
                    "author": "sibov8",
                    "score": 1,
                    "created_utc": 1653756626.0,
                    "response": "Seems interesting. Really want to be looking into ways to take advantage of the market. Going to try it with my big old bag of CCD and hope I don't get wrecked.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iacbxxq",
                    "author": "amylisalys",
                    "score": 1,
                    "created_utc": 1653764119.0,
                    "response": "Increases in margin trading allow you to win quickly, for example if you buy a product 2x the margin instead of buying it from the spot, you will earn in less time.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iacc8yv",
                    "author": "ispapoul",
                    "score": 1,
                    "created_utc": 1653764269.0,
                    "response": "Short sales work well in bull and bear market environments but strict trade entry and risk management rules are required to overcome the constant threat of short squeezes.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iab7jip",
                    "author": "Forberich",
                    "score": 0,
                    "created_utc": 1653744632.0,
                    "response": "This is really a great video expository on the market condition of the bear market \nA must watch for all . Wow",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}