{
    "subreddit": "CryptoMarkets",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uuydbi",
            "title": "Terra Crisis: G-7 Nations Call for Urgent Crypto Regulation – crypto.news",
            "url": "https://crypto.news/terra-g-7-nations-urgent-crypto-regulation/",
            "author": "Mars_chego",
            "created_utc": 1653174728.0,
            "score": 14,
            "num_comments": 11,
            "subreddit": "CryptoMarkets",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9ibas5",
                    "author": "greenwolf_12",
                    "score": 9,
                    "created_utc": 1653178385.0,
                    "response": "Do Kwan screwed us. They were just looking for something like this to happen so they could jump on crypto . Even possible the regulators engineered this...",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9j63i2",
                            "author": "pimpiulauf",
                            "score": 4,
                            "created_utc": 1653196421.0,
                            "response": "You are correct, Mate; they have the option to do so now, but I will not have the option to protect my privacy and not do so as well. I've seen Monero and Railgun especially talk about it, and now it's time to put it into practice, I suppose, because, as the usual saying goes, privacy is something that all humans naturally appreciate, and even those who refuse it to others expect it for themselves.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9i52q1",
                    "author": "MaineRage",
                    "score": 3,
                    "created_utc": 1653174984.0,
                    "response": "The catalyst.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9j5e3n",
                    "author": "6uRku2va",
                    "score": 2,
                    "created_utc": 1653195901.0,
                    "response": "I kinda knew this was coming up, the government was just waiting for any slight opportunity to do this, this will only bring about a more centralized system than decentralization and these are some of the things privacy protocols foresee when talking about privacy I guess and I think I believe them now. Good Railgun just launched its V1.on Ethereum, BSC, and PLygon mainet. Let's see how it will all turn out to be.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uuyfal",
            "title": "The most important thing about a P2E game is for it to actually be fun and that sadly isn’t the case on with most P2Es now",
            "url": "https://www.reddit.com/r/CryptoMarkets/comments/uuyfal/the_most_important_thing_about_a_p2e_game_is_for/",
            "author": "pihip2",
            "created_utc": 1653174906.0,
            "score": 5,
            "num_comments": 14,
            "subreddit": "CryptoMarkets",
            "selftext": "I get it, the main selling point of a P2E game is that it offers passive income for users while they play a game. It’s fun, it’s attractive and I get that.\n\nHowever, focusing on that and ENTIRELY forgetting about graphics, storyline, and game mechanics is very counterproductive.\n\nA couple 100 dollars from a game are cool but I don’t think that alone they’re enough to get people to move over from gaming consoles to P2E games.\n\nI just don’t see enough development honestly. By far the only chain that has some good games is Polygon. Aavegotchi is pretty entertaining and their token’s price has been holding up amazingly compared to all other coins and tokens on the market. Arc8 is also designed in a way that makes it pretty addictive with some pretty good gaming mechanics. It also helps that Polygon has one of the most efficient VMs making these NFT pretty profitable.\n\nSo while there are a couple of exceptions, the vast majority of P2E games become literal clones and developers don’t seem too keen on providing more entertainment to these games.\n\nIf these devs keep up this pace then the P2E market will slowly start losing interest among the masses and that would be a huge blow for the metaverse and crypto as a whole.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9ibf7i",
                    "author": "liveduhlife",
                    "score": 4,
                    "created_utc": 1653178453.0,
                    "response": "I really think that NFT in games should be an afterthought and also less of an investment and more of a simple utility. Just give us the capabilities to have player ownership of our in game assets and make a godamn good game. That’s all we ask for.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ijwhb",
                    "author": "curseof_death",
                    "score": 1,
                    "created_utc": 1653183040.0,
                    "response": "Two games that are in my radar are Illuvium and Blocklords. They are both launching on ImmutableX and they look like they might be good games and not just browser games where you need to grind for pennies. Might want to check them out.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9jhtsl",
                    "author": "avaricious_bonus",
                    "score": 1,
                    "created_utc": 1653206220.0,
                    "response": "Well, there's always the option of creating one or [bringing back old games](https://www.reddit.com/r/Kirin_Official/comments/uughx5/which_games_do_you_want_to_bring_back/) and making them P2E or something.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9keb0z",
                    "author": "agentskixo",
                    "score": 1,
                    "created_utc": 1653229514.0,
                    "response": "That is true tho, and it kept me outside this growing branch of crypto for a while. Now, I do think that in Honeyland I finally found a fun and sustainable crypto gaming experience, and I can't wait to try it out",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}