{
    "subreddit": "CryptoMarkets",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uthe4b",
            "title": "MINE: Very new token, ETH Reflections, Doxxed Team, less than 1M MC, Deflationary Token.",
            "url": "https://www.reddit.com/r/CryptoMarkets/comments/uthe4b/mine_very_new_token_eth_reflections_doxxed_team/",
            "author": "CaldyLock",
            "created_utc": 1653007400.0,
            "score": 0,
            "num_comments": 6,
            "subreddit": "CryptoMarkets",
            "selftext": "Have you ever wanted to sleep and earn income? That's exactly what passive income is.  Your money works for you. True Wealth creation comes from long term holds combined with passive income. That is the goal of the MINE token. To have a life altering impact on you as holders. It might be as small as funding that cup of coffee on the way to work each morning, to purchasing that dream house or even more! Only you can know what you can afford to invest.  Please invest wisely and only what you are comfortable losing as investments of any kind carry risk. Dream big when you get into MINE, because we are! We have lofty goals and want to share those rewards with those who have supported us as we take this journey. \n\nRight now you can get in super early at very low price. Investing in MINE is like putting money into a retirement account. It may go up and down along the way but you know at the end of the day it's the right way for future income. Not to mention the ETH reflections you gain by holding. The reflections are like dividends. They are\nbased on 6% of the trading volume which is equally distributed among every holder. Personal experience has already shown me it beats any interest rate you recieve from the bank. \n\nNot only does MINE use the development for buying mining equipment to mine its own eth, which creates a far larger ROI it combines it with 6% eth reflections. 100% of the mined eth goes towards buybacks feeding into the holders at the same time it's increasing the scarcity and eventually building towards becoming hyper deflationary. \n\nCome check out our links below. \n\nWebsite: https://theofficialminetoken.io/ \n\nReddit: https://www.reddit.com/r/MINE_Token/\n\nToken Address: 0x84bb61eb0336b309ccf14cc68bd1888cfa4846ea",
            "stickied": false,
            "comments": [
                {
                    "id": "i99qwd9",
                    "author": "CointestAdmin",
                    "score": 1,
                    "created_utc": 1653007532.0,
                    "response": "Ethereum [pros](/r/CryptoMarkets/comments/uthe4b/mine_very_new_token_eth_reflections_doxxed_team/i99qxcy/) & [cons](/r/CryptoMarkets/comments/uthe4b/mine_very_new_token_eth_reflections_doxxed_team/i99qxtn/) and related info are in the collapsed comments below. Pros and cons will change for every new post. Submit a pro/con argument in the [Cointest](https://www.reddit.com/r/CointestOfficial/wiki/cointest_policy) and potentially win [Moons](https://coinmarketcap.com/currencies/moon/). Moon prizes by award for the Top Coins category are: **1st - 600, 2nd - 300, 3rd - 150, and Best Analysis - 1000.** \r\n\r\n---\r\n\r\nTo submit an ETH pro-argument, [click here](https://old.reddit.com/r/CointestOfficial/comments/tuwvz5/top_coins_ethereum_proarguments_april_2022/). | To submit an ETH con-argument, [click here](https://old.reddit.com/r/CointestOfficial/comments/tuww2u/top_coins_ethereum_conarguments_april_2022/).",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i99zo5s",
                    "author": "AlertMantra",
                    "score": 0,
                    "created_utc": 1653011827.0,
                    "response": "Many tokens get launched every now and then, it is imperative to go for good tokens with great fundamentals. I can still talk about Bitay coin. I don't know if we know about Bitay exchange. Bitay ecosystem has indeed gone into spiral development and in full adoption of NFTs, P2E, Defi and many more. But in short you can check out Bitay exchange with up to 1million KYC users white-listing for it's Bitay coin ongoing with airdrop giveaway rolling out, up to $125k worth of airdrops.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}