{
    "subreddit": "CryptoTechnology",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "utolys",
            "title": "NFT technology has so much utility and value. Too bad all this money is being wasted on JPEGs of million dollar chimps",
            "url": "https://www.reddit.com/r/CryptoTechnology/comments/utolys/nft_technology_has_so_much_utility_and_value_too/",
            "author": "AdhesivenessDue652",
            "created_utc": 1653035200.0,
            "score": 142,
            "num_comments": 69,
            "subreddit": "CryptoTechnology",
            "selftext": "A lot of people would argue that “its supply and demand that causes these crazy prices” but the reality is that the majority of these NFTs are artificially pumped by the same owner or artist in order to create hype around it and make a quick buck.\n\nI’m not against NFT art. I just think that it kinda sucks that all of this capital is being funneled towards hyper-inflated JPEGs that won’t end up contributing in providing any needed use cases.\n\nInstead, I think that more resources should be allocated towards exploring the multiple use cases that NFTs have to offer from legal work, to protecting against brand counterfeit to even music and concerts. And we’re starting to actually see some progress in that regard with some projects like Tune. fm using NFTs to their advantage for streaming as part of hbar foundation’s $250 million metaverse development fund which I think will push a lot of other chains to start doing encouraging NFT projects to discover the utilitarian side of NFTs.\n\nNFT art will stay as an important part of the crypto culture, but that doesn’t mean that we can’t explore new opportunities that NFT technology has to offer",
            "stickied": false,
            "comments": [
                {
                    "id": "i9b8jgv",
                    "author": "santha7",
                    "score": 18,
                    "created_utc": 1653043041.0,
                    "response": "Okay.  Serious question.  \n\nThe web is changing.  Web 3.0 is coming.  Where do you see NFT’s and blockchain in this newly envisioned ecosystem?    \n\nThanks for the discussion.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9buhhr",
                            "author": "wickerlark",
                            "score": 20,
                            "created_utc": 1653054546.0,
                            "response": "I could see NFT’s being used for digital purchases, so buying a game on Steam would allow you to resell that game online the same way you could a physical copy.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9byk4n",
                                    "author": "Ellgar3",
                                    "score": 11,
                                    "created_utc": 1653056262.0,
                                    "response": "And with each sale a portion of the price could go automatically to the game devs, not just the seller, essentially creating an official secondary market for buying/lending games from other gamers.\n\nThis could also apply to loot in games, though i'm not a fan of pay-to-win games. But i must say that the play to earn concept is intriguing.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9d5lrr",
                                    "author": "elithewalkingcripple",
                                    "score": 5,
                                    "created_utc": 1653074170.0,
                                    "response": "*cough cough* gamestop\nNft marketplace *cough cough*",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9d5tuq",
                                            "author": "wickerlark",
                                            "score": 3,
                                            "created_utc": 1653074273.0,
                                            "response": "Oohhh is *that* what that’s gonna be?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9d5y65",
                                                    "author": "elithewalkingcripple",
                                                    "score": 3,
                                                    "created_utc": 1653074330.0,
                                                    "response": "Rumors... just rumors... but i believe so.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9e9lz7",
                                                            "author": "boredatwork9194",
                                                            "score": 1,
                                                            "created_utc": 1653093305.0,
                                                            "response": "But wouldn't the major players like Sony/Microsoft have to build out support for anything GameStop is going to do? Why would they bother partnering instead of just doing it themselves?",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9edorm",
                                                                    "author": "Gone_gone_beyond",
                                                                    "score": 1,
                                                                    "created_utc": 1653095495.0,
                                                                    "response": "Because the consumer wants it and (I know it’s hard to believe) the consumer usually gets what they want. One platform will do it and the rest will be dragged along kicking and screaming.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i9bydya",
                                    "author": "santha7",
                                    "score": 5,
                                    "created_utc": 1653056193.0,
                                    "response": "See. This is how I see it and one of the main reasons I’m investing in L2 like looting.  I see it as a way to sell back games and get butt raped by Companies like GameStop.   \n\nDon’t get me wrong. I like the stock, but I’m not dumb enough to think they ain’t gonna use the to make a LOT of money off my dumb ass.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9cy7fa",
                            "author": "Maleficent_Plankton",
                            "score": 8,
                            "created_utc": 1653070691.0,
                            "response": "I agree with wickerlark's response. But I also want to point out that the idea that web is changing and web 3.0 is coming is not necessarily true. People still haven't even decided on what web 3.0 is going to look like, whether there's significant demand for it, or whether it'll involve DLTs and NFTs at all.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9cyv5g",
                                    "author": "santha7",
                                    "score": 2,
                                    "created_utc": 1653070994.0,
                                    "response": "This is an excellent point.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9bxpn0",
                            "author": "kutchedwaga",
                            "score": 5,
                            "created_utc": 1653055911.0,
                            "response": "I just came across LegendaoNFTs recently when they collaborated with Kevin Smith, the producer, to release his new movie as one of their NFTs. \n\nThis is something that will really change the way we see NFTs as a whole, When this pulls through, I wouldn't be surprised if the music industry takes it up fully because it's an effective way to combat counterfeiting in the entertainment industry.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9d5j5d",
                            "author": "elithewalkingcripple",
                            "score": 3,
                            "created_utc": 1653074136.0,
                            "response": "I think there are a lot of applications people want crypto to be good for which it is not. However there are a few application with great utility using blockchain. Any contract can be validated on the blockchain without a third party or escrow being handled by a third party. Things that a creator wishes to be limited supply and doesnt wants fakes created can use an nft contract to assign each real\nLife item a blockchain representative which can never be counterfeited. Something adding onto the previous idea is having the item assigned to an nft be a digital game. Presently a game i buy from steam is not my game. It is only borrowed by me as long as i dont break any rules of steam, and if i want to sell that game, then im out of luck. With blockchain you could buy a game, enjoy it for as long as you would like, and then sell it to another person for a smiliar price to what you got it. Im sure there are issues with each thing i stated but as a growing technology i believe there is much potential.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9edsth",
                                    "author": "__redruM",
                                    "score": 2,
                                    "created_utc": 1653095557.0,
                                    "response": "> With blockchain you could buy a game, enjoy it for as long as you would like, and then sell it to another person for a smiliar price to what you got it. Im sure there are issues with each thing i stated but as a growing technology i believe there is much potential.\n\nLot’s of upside for the consumer, none for the publisher.  It’s a great idea, but unless a small online store does it and grows, it won’t happen, and of course the publishers may just decide to keep there games out of these resale stores.  I buy a game, play it for 10 to 20 hours, sometimes to a few hundred hours.  And I’m done.  It would be great to resell, but it seems like a hard no from publishers.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9eg7ha",
                                            "author": "elithewalkingcripple",
                                            "score": 2,
                                            "created_utc": 1653096837.0,
                                            "response": "I agree! Maybe publishers could build in some kind of automatic royalty system to take a set % after every sale and could make money even off resales.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9dijbt",
                            "author": "Nature_-1",
                            "score": 3,
                            "created_utc": 1653079991.0,
                            "response": "Would be a lot more interesting. I’ve seen the likes of DEIP using web3 protocols to build the creator economy, tokenize intangible Assets and even create liquidity for fractionalized NFTs. So yeah NFTs would be more utilized in the nearest future with Web3",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9ed5ah",
                            "author": "Gone_gone_beyond",
                            "score": 2,
                            "created_utc": 1653095201.0,
                            "response": "I think new platforms will be tokenized. Used to validate users (decrease bots and spam) and reward activity/contributions using micro transactions. Platforms will be built as DAOs with governance and group consensus built in. With the revenue generated directly tied to the value of the platform’s tokens; holders will be rewarded similar to owning stock (increased token value, dividends, profit sharing). I also think we will see platforms that are similar to the arcades (D&B or ChuckECheese, but where the tokens have an actual value.) We also have platform interoperability being worked on, platform users can “earn” tokens on one platform then convert them to a token that can be used on a different platform. There will also be an ever growing community of internet buskers/performers/trainers/WILDCARD working for “cash” tips. Blockchain brings tangibility and permanence to the internet, it will stop feeling like second life as we keep pushing into it.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9bi0hr",
                    "author": "Dadbean-official",
                    "score": 15,
                    "created_utc": 1653048702.0,
                    "response": "This is kind of like ranting that \"music these days is all trash,\" yet your only exposure to new music is listening to the radio.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9b1474",
                    "author": "Dormage",
                    "score": 34,
                    "created_utc": 1653037196.0,
                    "response": "NFTs are not as useful as most think. A more broad picture of them is simply onchain data that is temper proof and uniquely identifiable. However, unlike transactions(which are onchain data as well) their utility is not contained and enforced within the system. Whatever you put in an NFT needs an external party to enforce it. Proof you own some digital peace of information is only proof if there is some external party, which accepts this as proof.\n\nYou can own any music in an NFT, but people can freely copy digital info without your knowledge, it is only if a court or some other external institution recognizes your NFT as proof that you will be able to enforce your ownership.\n\nNow you could argue that in the future this will happen but then again, it will be centralized and how will it be different from existing copyright claims, patents and licences? Those recods/documents/proofs are now stored in central databases and enforced by law/issuer, etc..\n\nThe only thing that an NFT can add to this is the fact the central party cant falsify/take back/change the information. But since both systems heavily rely on the same central party it makes no sense to not trust it.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9c3z38",
                            "author": "maveric101",
                            "score": 6,
                            "created_utc": 1653058444.0,
                            "response": "You are not thinking broadly/creatively enough about this.\n\n> Whatever you put in an NFT needs an external party to enforce it.\n\nSo what?  That's true of existing systems, so it's not a downside.\n\n> Proof you own some digital peace of information is only proof if there is some external party, which accepts this as proof.\n\nLike the government?  If (when) NFTs are recognized as legal ownership records, they'll be as \"real\" as anything now.\n\n> Now you could argue that in the future this will happen but then again, it will be centralized\n\nEnforcement would be \"centralized,\" but not the storage/transfer/etc.\n\n> Those recods/documents/proofs are now stored in central databases and enforced by law/issuer, etc..\n\nYeah, centralized.  As opposed to storage on the blockchain, which would be decentralized.  With smart contracts adding value.  Also, there's tons of stuff that ISN'T on ANY sort of database.  Haven't you ever seen on one of those pawn shows where someone brings in an item, and either they don't have any proof of authenticity, or the proof of authenticity is just a piece of paper that's easily lost or destroyed?  Nobody's going to set up and manage a database for decades or centuries for a limited-run production of niche items, but ownership records for things like that could exist on the public blockchain indefinitely.\n\n> The only thing that an NFT can add to this is the fact the central party cant falsify/take back/change the information.\n\n1) Nope, that's not the only thing they offer.  One example is a secondary video games market, where people can sell their licenses.  The original developer could put all sorts of smart contracts in the system.  Each sale of a license could send a cut to the original developer.  Another idea is concert tickets.  Secondary market ticket sales would be scam-proof, and smart contracts could enforce that secondary be no higher than MSRP, which would solve the speculative/bot buying problem in one fell swoop.  If you don't see the value in replacing TicketMaster (and their ridiculous fees), I don't know what to tell you.\n\n2) An NFT solution doesn't need to be absolutely game-changing to make sense.  It just needs to be better than existing solutions.  And in basically every case, NFT solutions are at least notably better.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9edi5v",
                                    "author": "funkiestj",
                                    "score": 3,
                                    "created_utc": 1653095395.0,
                                    "response": ">  If you don't see the value in replacing TicketMaster (**and their ridiculous fees**), I don't know what to tell you.\n\nhave you seen gas fees?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9b6tg1",
                            "author": "OtterTF",
                            "score": 1,
                            "created_utc": 1653041690.0,
                            "response": "I beg to disagree your statement regarding the NFTs not being as useful as most think. You are only limiting its context to NFT art when you can mint NFTs for your diploma, security accesses, etc. NFT games like Illuvium and Taunt Battleworld have also added greater value to NFTs now. Looking at the other side of things would give you a better insight of what NFTs offer.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9b7iur",
                                    "author": "Dormage",
                                    "score": 16,
                                    "created_utc": 1653042252.0,
                                    "response": "Okay, so lets go with the diploma usecase? My University puts a divital signature of my degree onchain as an NFT. Now when I apply for a job, the employer csn verify the validity of my degree.\n\nSo the NFT is ONLY useful, if and only if my employer takes the NFT as proof, AND if he trusts the public key that issued the NFT belongs to the Univeristy.\n\nSo were back to square one, the NFT is usless unless central parties agree to accept it as proof. \nHow is this different or better then showing a signed degree from the University, which is common. Or how would that be better then a gov. Wide central repository of all degrees. The only added value is its immutable. But that would mean the University would have to change my diploma? Your truasting the University to sign NFTs with their public key anyway, why not trust them to not take your degree away from you?\n\n\nGame items are the same, as long as the code in the game reads NFT data and gives you the items its fine, but your onchain items are usless if the same developers simply change the code and the game does not recognize your NFTs anymore. You dont solve the single point of failure as all solutions rely on a central party at some point.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9cht2m",
                                            "author": "wanglubaimu",
                                            "score": 4,
                                            "created_utc": 1653063923.0,
                                            "response": "Signatures can be and are falsified thousands of times on a daily basis. If any system is ever ripe for replacing with cryptographic proves secured on a public ledger and witnessed by thousands of nodes distributed around the world , it's paper signatures. \n\nI like your other comment about the privacy concerns and the need to use zero knowledge proofs for anything related to ID, but that's in the distant future, the tech isn't ready yet to make this safely possible. Anyone who promotes blockchains for digital ID and voting currently is a dangerous charlatan, these people need to be called out and ignored. What I see the mainstream of the crypto industry currenty excited about and working on is stuff like gaming and music, and those work great with what we have already. \n\nNFT has become a buzzword, the general public probably thinks it means colorful pictures while some crypto bros might think anything will have an NFT in the future. But in reality this is just what smart people have foreseen years ago. We're finally getting real adoption and something like ticketing for example works great as an NFT. Because practically every young person who visits a concert or festival buys their ticket online these days anyway. It's already digital but then for legacy reasons they often still mail a paper ticket, which is idiotic on so many levels. Just think of the emissions trucks cause driving these pieces of paper around for no good reason. But for the issuer there are more advantages. They can finally at least monitor the resale market (aka scalping, which is a massive problem for the industry). And they can react to their findings and adjust the fee for reselling in the future as they see fit. This does not affect the honest concert goer as they don't intend to resell. It might actually lead to cheaper prices for the audience as well as increased profits for the promoters/venues, because now the middle men have been taken out of the picture. Someone buying fake tickets on craigslist or off some shady guy in a back alley will also be a thing of the past. \n\nThis is just one example, I honestly find it fascinating how underrated and misunderstood all these use cases are even within the crypto community itself. This is the adoption everyone's been waiting for and it's coming for real this time, there are dozens of billion dollar companies already involved and some of the products are already live, even if not quite mass market ready yet.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9df0nr",
                                                    "author": "Dormage",
                                                    "score": 1,
                                                    "created_utc": 1653078392.0,
                                                    "response": "I agree with the usecase you provide so I am only addressing the digital signatures. The way we usually go about this is we sign some timestamped random key from site A. Having a timestamp and a unique key makes the signature unusable at any other site and time.\n\nAdditionally, the signature is encrypted with the public key of the requester, so while the bytes are public, nobody can decrypt them other holder of the  private key, which is the site that requestes the ID.\n\nWould that not be sufficiently safe?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9djkkn",
                                                            "author": "wanglubaimu",
                                                            "score": 1,
                                                            "created_utc": 1653080462.0,
                                                            "response": "Honest question: When did you last work at or attend a university? \n\nIt may sound ridiculous but these places are usually beyond hope in regards to the administration. I could go into an hours long rant about this and explain why but the TLDR is that universities don't have their (computer) security act together, so they can't be trusted with putting this up online. What they currently do is require you to email to verify, at least the ones I know of. Some might not even offer that, then you would be stuck calling or sending paper mail. \n\nIf you wanted the certificates online, a private company could do it for them. Which I guess is fine in theory, I just think that it's likely most are going to use a public permissionless ledger because that's how these things usually go. Students would have concerns. And they simply don't want anything from private enterprises, same reason they favor open source software over commercial solutions, even in cases where the open source isn't that good. \n\nYou'd also have the issue of compatibility of different private solutions. The key advantage of putting it on the chain is that anyone can check it from anywhere in the world. It doesn't cost anything to maintain and the cost of putting the information up will be a lot lower than printing those shitty certificates with their seal or whatever \"security\" feature they have. We live in a globalized world where millions of people work in foreign countries but employees still have to request notarized copies or email the universities if they want to authenticate a degree. I have person experience with this, it's a big issue in some industries and regions, fake degrees are more common than you might think for the very reason that employees can't easily check. When they're on chain, it could be a formality, it could be done in an automated way when you apply and no human would ever have to even look at it unless they wanted to. It's not the same with a random digital signature that a guy from let's say Japan where they might use a different system from your country doesn't know how to trust. There will be blockchain services that abstract the complexity away, if even needed - like in the case of a multichain future. With smart contracts you can do that.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9dl2qr",
                                                                    "author": "Dormage",
                                                                    "score": 1,
                                                                    "created_utc": 1653081158.0,
                                                                    "response": "I work at an Univerisity. In my little country in EU, we have a national database of all degrees from bachelor to PhD. Every thesis is published and public, the ceritificate of the degree is also issued by the univerisity in digital form stored in a national database.\n\nAfter a contract is signed, the employer must register the employee in order to pay taxes, insurence and all the mandatory costs. It is then where the employee is checked to be qualified for the position again.\n\nI can relate to the issues you describe. I can see how these can be addressed with NFTs as well. \nHowever, my concern is does the solution require a blockchain and an NFT at all? Wouldnt a national central goverment mantained database serve the same purpose? Does the gov. Have any incentive to change ones degree ? Can we justify the complexity and inefficiency of blockchains for this?\n\nI suppose all we need is an interoperability standard?",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9dmvmy",
                                                                            "author": "wanglubaimu",
                                                                            "score": 1,
                                                                            "created_utc": 1653081995.0,
                                                                            "response": "That's already kind of progressive then, it's not the same for most countries.\n\n>It is then where the employee is checked to be qualified for the position again.\n\nI don't understand this part. The government mandates certain degrees for certain positions in the private sector? \n\n>Wouldnt a national central goverment mantained database serve the same purpose?\n\nSure, in theory. I get your point. So if all 200 countries implemented this and it were easy to use for anyone around the world, a blockchain wouldn't be needed at all. I highly doubt that's going to happen though. In reality you'll have some universities onboard and then others and then more and more. And in the end all of them will be on chain. The other way would require lots of political will and coordination. Blockchains are the path of least resistance for this problem, even though they're not strictly needed on a technical level like you say. I think in this case it's the established global and permissionless network that makes the difference. I'm sure most IT departments in universities will also run their own nodes in the future, at least for the preferred chain the university uses itself.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i9doenn",
                                                                                    "author": "Dormage",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653082707.0,
                                                                                    "response": "There are no mandates but once the fundation for taxing is the some metadata about the contract signed. That usually gets put in the database and checked. Honestly I do not know the specifics of how in detailed the check is. \n\nYeah, standards can be a pain to enforce (looking at your charger Apple) but we have many of those that work worldwide. Creating a standard is not as hard as getting everyone to use it. But then again, the NFT based degree is just another standard employers need to adopt? All universities and governments need to start putting it onchain and then ship a software soltuion for employers to use for verification. Sounds a lot like the same problem with the exception that the NFT solution uses a decentralized 100% replicated immutable slow DB, while the other uses a super fast, sharded DB cluster with redundancy.",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9b8fjk",
                                            "author": "santha7",
                                            "score": 1,
                                            "created_utc": 1653042957.0,
                                            "response": "Okay.  I like your logic.  \n\nNow.  Add in Web 3.0.   \n\nThis is where I see the connection.   The NFT becomes an important part of the web ecosystem.  [interesting blog](https://selfkey.org/significance-of-nfts-in-web-3-0-and-the-metaverse/)",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9bf18d",
                                                    "author": "Dormage",
                                                    "score": 14,
                                                    "created_utc": 1653047107.0,
                                                    "response": "Read the blog post. I agree there are uses for NFTs but I still think they are greatly overestimated. The blog is an attempt to paint a picture of a decentralized internet in which users are in control of their data. I read a tonne of papers about blockchain enabled digital identiy and while there is potencial for it, its not realy something you want to do with NFTs.\n\nPeople forget that in order to habe an immutable lesger, we must have verifiability of its entire history. By having your ID in NFTs it inherently means your ID is public, for everyone, for ever. You wouldnt be in control of it, you cant alter it or delete it. \n\nThe actual implementation should be something in the lines of ZKP and maybe, in the future, once its feasibly to do, hommomorphic encryption.\n\nSimplistic solution:\nID data is onchain, and ecrypted, a web3 enabled service requests access to part of your ID, if you agree, you give access by decrypting with your pvt key and encrypting back with the sites public key.\n\nProblem: We can do this offchain, but lets keep the onchain data for verifiability. The bigger problem is once site A gets your data, you loose control over it as it again, can be copied, distributed and used without your consent as it is nowdays.\n\nBetter solution:\nInstead of giving site A your data, have site A ask a question such as, is this user from and EU country and is he/she older then 18? Diliver a ZKP, prooving that this is true without revealing the data, have verifiability onchain.\n\nNot sure about how NFTs come into this but I honestly have not done any research on it. It could be useful but for public data. I suppose there is added value if you can see what everyone on the internet knows about you as opposed to centralized  services that store, and monetize your data without your consent/knowledge. But its still does not solve the privacy issue.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9biz6m",
                                                            "author": "the_rhino22",
                                                            "score": 6,
                                                            "created_utc": 1653049204.0,
                                                            "response": "Great discussion guys, appreciate both sides",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9bjaux",
                                                                    "author": "Dormage",
                                                                    "score": 7,
                                                                    "created_utc": 1653049364.0,
                                                                    "response": "This sub is one of the rare remaining forums where such discussions can be had without any negativity. Regardless of what ends up as a result, having a diacussion is much better then having none at all.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9ef8dh",
                                            "author": "__redruM",
                                            "score": 1,
                                            "created_utc": 1653096320.0,
                                            "response": "> So the NFT is ONLY useful, if and only if my employer **takes the NFT as proof, AND if he trusts the public key that issued the NFT** belongs to the Univeristy.\n\nIs that such a long shot?  It’s not a profitable use case, but if an HR department from a large company can validate your diploma without calling the university, or using their custom wriiten website, that sounds interesting.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9bseo7",
                                    "author": "fazdaspaz",
                                    "score": 2,
                                    "created_utc": 1653053647.0,
                                    "response": "You missed their point entirely",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9bewug",
                                    "author": "jgsabino",
                                    "score": 1,
                                    "created_utc": 1653047038.0,
                                    "response": "About the diploma use case, Ethereum is developing Soulbound Tokens (SBTs), which to my understanding are NFTs that are permanently associated to your Web 3.0 identity. SBTs can't be traded. May be a better implementation for this use case in the future.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9b6jmn",
                            "author": "takitus",
                            "score": -5,
                            "created_utc": 1653041467.0,
                            "response": "Well this is just flat out wrong",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9cj77e",
                            "author": "putsonshorts",
                            "score": 1,
                            "created_utc": 1653064463.0,
                            "response": "Napster, torrent, etc had free music yet streaming companies have no issues selling $15 per month services to listen to music. Same with GV and movies now. So you can create a wall around digital content and people will respect it. NFTs will allow those walled in places not just reward the market makers but also the creators.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9eemf0",
                            "author": "__redruM",
                            "score": 1,
                            "created_utc": 1653095999.0,
                            "response": "The digital content could be encrypted with the NFT, and only playable with special, signed software.  It still has to go into memory sometime, so it may not be foolproof, but apple had encrypted music at some point.  But people like copyable mp3 files better.  So selling consumers would be tough.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9besyv",
                    "author": "armaver",
                    "score": 2,
                    "created_utc": 1653046978.0,
                    "response": "I look at it as one of the biggest stress tests in history. It helped Ethereum mature, so that's great.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9dfkch",
                    "author": "SuperTimmyH",
                    "score": 2,
                    "created_utc": 1653078643.0,
                    "response": "solve the gas fee first or seamless L2 bridge",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9dmflr",
                    "author": "Sorry-Link9672",
                    "score": 2,
                    "created_utc": 1653081787.0,
                    "response": "Until you have a general purpose proof of utilization from a NFT concept that is not computationally exhaustive or at least has greater tradeoff in terms of value brought, I remain a skeptic. \n\nI'd love to be proven wrong in the future, but until the concepts successfully combat all major blockchain issues, applicability remains a dream imho.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9e7n1y",
                    "author": "NaibofTabr",
                    "score": 2,
                    "created_utc": 1653092249.0,
                    "response": "[Line Goes Up](https://youtu.be/YQ_xWvX1n9g)\n\nBecause of the *tiny* amount of code that can be contained in a token while keeping the transfer of tokens across the network practical, the actual utility of NFTs is *extremely* questionable. It's a nice idea *on paper* but the Internet literally cannot support the amount of data throughput that would be necessary for transfer of information stored on block chain to be useful, and it won't be able to anytime soon.\n\nAdditionally, as long as the community is swamped with people hoping to get rich by passing on their NFTs to the next sucker in line, it will be impossible for reasonable, non-scam projects to make headway. So, all you have to do to see a future of good NFT implementation is solve *greed* permanently - and then find a use case for NFTs that cannot be addressed more easily with not-NFTs.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9egywy",
                    "author": "drskeme",
                    "score": 2,
                    "created_utc": 1653097228.0,
                    "response": "there is no present value in an nft. a million years from now a picasso will still be in demand. that's the difference between art as an investment and nft's. nft's are great for money laundering, if that's your racket, onward and upward. for normal individuals- suckers.\n\n&#x200B;\n\ndo you really think a logan paul or nft from a c-list celebrity will be worth anything? First thing you should ask yourself, 'does the person that I'm buying the nft from have any talent or value that makes his investment unique?'",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9b0pdx",
                    "author": "Twic3",
                    "score": 13,
                    "created_utc": 1653036826.0,
                    "response": "Ok first can we just drop this theory that all NFTs are artificially pumped by people selling between their own wallets. This is very easy to debunk thanks to the transparency of the blockchain, i mean you can easily verify this by yourself by simply going to opensea and looking at the transaction lists [https://opensea.io/collection/boredapeyachtclub/activity](https://opensea.io/collection/boredapeyachtclub/activity).\n\nWhether you like it or not the demand for JPEGs is organic and has onboarded a huge amount of people into crypto. It frustrates me that people that believe in a new emerging technology are so closed minded about the applications of said tech.\n\nYes from a surface level JPEGS are dumb and the prices at the moment are detached from reality imo. But there is a precedent for digital collectables, people have been buying skins in games for years now sometimes for ridiculous prices - [https://estnn.com/10-of-the-most-expensive-items-in-video-games-ever/](https://estnn.com/10-of-the-most-expensive-items-in-video-games-ever/).\n\nNft profile pictures can just be seen as an extension of that desire people have to express themselves and stand out by flexing their wealth. Whilst also offering access to a community of like-minded individuals.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9b12zw",
                            "author": "NewOutlandishness663",
                            "score": 10,
                            "created_utc": 1653037166.0,
                            "response": "I hardly doubt what you're saying is completely true. Its been known and proven on multiple occasions that NFT owners artificially inflate the prices of their own NFTs and no one can do anything about it cause its perfectly legal",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9b5i7j",
                                    "author": "peanutbutterwolve",
                                    "score": 2,
                                    "created_utc": 1653040604.0,
                                    "response": "For now it’s perfectly legal but shilling auctions is 100% illegal if you get caught. The fact that open sea, nifty, etc doesn’t have rules against this, or if they do they don’t implement them, means that they are in on the scam and I have a feeling they will be facing serious consequences in the future.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9cdccy",
                                    "author": "NobleFraud",
                                    "score": 2,
                                    "created_utc": 1653062169.0,
                                    "response": "https://blog.chainalysis.com/reports/2022-crypto-crime-report-preview-nft-wash-trading-money-laundering/\n\nBiggest wash trader lost money overall on transaction fees.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9b1x1v",
                                    "author": "Twic3",
                                    "score": -1,
                                    "created_utc": 1653037817.0,
                                    "response": "I'm not saying this doesn't happen. But most people use said theory to explain the prices of Bored Ape Yatch Club and other high profile collections, which is just objectively false.\n\nBAYC all time sales is $2,129,069,294, how could a single person/entity be responsible for this volume?\n\nSources:\n\n [https://opensea.io/collection/boredapeyachtclub](https://opensea.io/collection/boredapeyachtclub)   \n\n\n[https://cryptoslam.io/bored-ape-yacht-club](https://cryptoslam.io/bored-ape-yacht-club)",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9b5nqj",
                                            "author": "blindbycrypto",
                                            "score": 4,
                                            "created_utc": 1653040734.0,
                                            "response": ">how could a single person/entity be responsible for this volume?\n\nThat's not what they said. Are you misinterpreting on purpose?\n\nThere are for sure some BAYC owners who does that. They also give BAYC to celebrities to use them as publicity and have degenerates believe these celebrities are real buyers and supporters of this garbage.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9b6h36",
                            "author": "wavefield",
                            "score": 4,
                            "created_utc": 1653041408.0,
                            "response": "You realize people can just create multiple accounts and work together to pump things? It's super obvious in the case of NFTs",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9b783m",
                    "author": "Simple_Yam",
                    "score": 1,
                    "created_utc": 1653042015.0,
                    "response": "What is this post?\n\nOP if you have great ideas building around NFTs that can cure cancer or whatnot then go ahead and build them. People trading art/pfp NFTs does not make any of the other usecases any less important.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9busw7",
                    "author": "Stiltzkinn",
                    "score": 1,
                    "created_utc": 1653054683.0,
                    "response": "I'm fine using NFTs as ENS or some other Blockchain game. The good stuff will mature in few years.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9d2gqq",
                    "author": "rudefruit99",
                    "score": 1,
                    "created_utc": 1653072679.0,
                    "response": "Selling my birth certificate on Opensea.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9djhl1",
                    "author": "TradeBitter",
                    "score": 1,
                    "created_utc": 1653080426.0,
                    "response": "People forget that the times they're a changin'.....all the fucking time. Nothing stays the same. Just enjoy the ride.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9efzxj",
                    "author": "sofitamatugr",
                    "score": 1,
                    "created_utc": 1653096728.0,
                    "response": "Well said. Some chains are already up with unique innovations on this, like the Ottoblockchain network relies on NFT. The NFT is issued to users after undergoing the KYC process. The NFT in this case represents the user's profile and signals to the developer and participant that the user is verified. I believe as we ascend, many chains will encourage utility in NFT. ",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9eimsc",
                    "author": "TroutFishingInCanada",
                    "score": 1,
                    "created_utc": 1653098066.0,
                    "response": "This really doesn’t need to be posted—in almost the exact same words—everyday.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9b17mf",
                    "author": "No_Geologist_1826",
                    "score": -5,
                    "created_utc": 1653037272.0,
                    "response": "Anyway, if you guys looking for a NFT creation competition, there's a huge one currently on the table now, it's a $120k prize to be won by 5 winners. This is sponsored by Telos Network for their MissionNFT Challenge. If you guys know how to digitalized your drawings or painting, know how to do 3D Arts, or know how to do animations, anyone can join the contest. Registration and submission of entries is on-going until June 30. Here's the details: https://taikai.network/en/telos-foundation/hackathons/nftp-slug\nContact or reply me back if you are interested and I will help you to the event.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}