{
    "subreddit": "CryptoCurrencies",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "upkf61",
            "title": "Who's next now that Luna Ponzi is down? Celsius, Nexo, BlockFi? CRED has previously paved the path in CeFi!",
            "url": "https://the-crypto-post.com/cred-lending-bankruptcy/",
            "author": "TheCryptoPost",
            "created_utc": 1652544524.0,
            "score": 19,
            "num_comments": 35,
            "subreddit": "CryptoCurrencies",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8ltc1a",
                    "author": "blah1blah1blah",
                    "score": 3,
                    "created_utc": 1652553795.0,
                    "response": "I use Celsius. Should I move?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8lulsj",
                            "author": "TheCryptoPost",
                            "score": 3,
                            "created_utc": 1652554379.0,
                            "response": "I don't know much anymore about Celsius. But we're they not using Terra to get their yields? I've seen way cleverer people than me afraid of that.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8lz1b3",
                                    "author": "thepunstar",
                                    "score": 4,
                                    "created_utc": 1652556459.0,
                                    "response": "They exited their yield earning contract right before it collapsed according to on-chain analysis and also confirmed by their CEO that funds are safe",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8l9e1k",
                    "author": "deaddoll_x",
                    "score": 3,
                    "created_utc": 1652544770.0,
                    "response": "IMO SOL is next",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8nemlm",
                            "author": "rkalla",
                            "score": 3,
                            "created_utc": 1652581363.0,
                            "response": "Agree with you, VC money holds it afloat, can’t scale, not decentralized and as soon as it recovers VC portfolios will cash out to close that positions and it’ll effectively be a HUGELY complex centralized finance rail… like a fedwire or Visa replacement, which is cool, but not worth billions and billions. It’s just infrastructure.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8la6dk",
                            "author": "TheCryptoPost",
                            "score": 3,
                            "created_utc": 1652545116.0,
                            "response": "No idea, is there any reason for a possible collaspe à la Luna ? I don't even follow anything related to this shitcoin anymore. How many time this blockchain has been stopped? I don't even see any meme about it.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8lh5zo",
                    "author": "randomWIGHT9000",
                    "score": 4,
                    "created_utc": 1652548250.0,
                    "response": "Nexo always felt off to me. So much promotion and spamming.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8liaxm",
                            "author": "TheCryptoPost",
                            "score": 4,
                            "created_utc": 1652548773.0,
                            "response": "Honestly, Nexo and Celsius are both giving me really scammy vibes.  \nI still remember the Nexo stuff related to Zeus Capital and Chainlink FUD: https://www.reddit.com/r/ethtrader/comments/htz00y/nexo\\_is\\_behind\\_zeus\\_capital\\_which\\_borrow\\_link\\_on/",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8lq1va",
                                    "author": "TheFearRaiser",
                                    "score": 11,
                                    "created_utc": 1652552291.0,
                                    "response": "I've used nexo for over a year now. They've provided great service and it's never been hacked/had issues taking my crypto out. This sounds like FUD.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "id": "upo75q",
            "title": "Could the fall of cryptocurrencies lead to a financial crisis?",
            "url": "https://www.reddit.com/r/CryptoCurrencies/comments/upo75q/could_the_fall_of_cryptocurrencies_lead_to_a/",
            "author": "Lyanna765",
            "created_utc": 1652555663.0,
            "score": 27,
            "num_comments": 33,
            "subreddit": "CryptoCurrencies",
            "selftext": "The cryptocurrency market has suffered a major setback this week. It seems that it all started when the stablecoin or stable cryptocurrency Luna suffered a big shock that affected TerraUSD and spread to all digital currencies. \n\nThe best known, Bitcoin, was also affected. In about 24 hours, more than 200 billion dollars were lost and many people lost everything they had invested. Panic set in among investors.\n\nHowever, to say or assert that this market is a 'money loser' or that a 'crisis' is looming is a totally wrong statement. For despite all the red panaroma, the blockchain world and development does not stop and continues to receive countless amounts of money, as is the case of Ethereum 2.0 who is still standing on the blockchain development, Solana in its technological race with the aforementioned, Zetrix in the implementation of the cross blockchian or Terra in the race for its ecosystem.\n\nThis week, Bitcoin fell below $28,000 and Ethereum (ETH) lost the $1,800 level, down about 60% from the November 2021 highs, and the tenth major correction in the last decade.\n\nBut can a crash in cryptocurrencies turn into a financial crisis? Currently, the market capitalization of the entire cryptoasset class is $1.3 trillion, which is equivalent to less than 1% of the global bond or equity markets. \nThis market marked its highs in November 2021, close to $3 trillion, but the volatility that has set in this 2022 has caused it to lose about $1.7 trillion.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8nfs8u",
                    "author": "hideousmembrane",
                    "score": 12,
                    "created_utc": 1652581980.0,
                    "response": "There is already a financial crisis. It's been getting worse for years.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8m40wz",
                    "author": "nsbruno",
                    "score": 12,
                    "created_utc": 1652558785.0,
                    "response": "Not enough financial institutions and market makers have enough capital in crypto for it to cause a financial crisis. See the 2007/2008 crisis for the recipe. All of the banks had ludicrous amounts of money tied into negligently reviewed/maintained assets and obligations and all without the appropriate hedging to offset losses. Crypto just doesn’t have the weight within the whole system right now to cause a crisis.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8m9ghl",
                    "author": "AHighFifth",
                    "score": 10,
                    "created_utc": 1652561289.0,
                    "response": "Sorry, this is a pretty narrow view on how market crises arise.\n\nThe mortgage industry directly is a few trillion dollars, but it spawned a financial collapse because of DERIVATIVES, which additionally created another 10 to 100 trillion in liabilities based on bets on the actual few trillion of mortgage securities.\n\nThe exact same thing could happen with crypto, and due to the opaque nature of the derivatives market, there is no real way to know for sure exactly how much money is riding on the crypto ecosystem. It could easily be ballooned into the 10s of trillions of dollars.\n\nAnd that's not even considered cascading leverage failures and margin calls.\n\nSo yeah, crypto could absolutely cause a financial crisis if it cascades into something larger. My bet is that tether blows up first, which provided that it makes up 60% of BTC volume, will blow up bitcoin, which will in turn blow up the entire crypto ecosystem. All the hedge funds leveraged 25:1 on the crypto space blow up next, and all the hedge funds invested in those other hedge funds blow up next, and then the banks blow up, and boom. Full blown financial crisis.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8ngvi8",
                            "author": "churninbutter",
                            "score": 7,
                            "created_utc": 1652582559.0,
                            "response": "There’s a big difference here, the banks core assumption in 2008 was basically that the price of housing wouldn’t crater, because it hadn’t ever done that. Bitcoin cratered like 4 years ago lol. No bank would put enterprise risk on something that has very recently proven to be a total loss risk.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8nn9cl",
                                    "author": "AHighFifth",
                                    "score": 4,
                                    "created_utc": 1652586162.0,
                                    "response": "That excuse only works if you buy that the cause of '08 was incompetence. I find it more likely that it was corruption.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8mhqtv",
                    "author": "sergeimedvedev",
                    "score": 9,
                    "created_utc": 1652565118.0,
                    "response": "Bro we are literally in a financial crisis... wtf are you talking about!?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8mmyec",
                    "author": "hungryforitalianfood",
                    "score": 3,
                    "created_utc": 1652567562.0,
                    "response": "Lol this is stupid. It’s the other way around.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "up8wif",
            "title": "I think Cartesi is very underrated right now",
            "url": "https://www.reddit.com/r/CryptoCurrencies/comments/up8wif/i_think_cartesi_is_very_underrated_right_now/",
            "author": "calisthenicslb",
            "created_utc": 1652500466.0,
            "score": 9,
            "num_comments": 16,
            "subreddit": "CryptoCurrencies",
            "selftext": "While it is starting to gain traction and hype right now, I still think that it deserves to be talked about more and this is for one simple reason.\n\nAside from the fact that they’re deploying some of the best scalability-based technologies right now, I want to focus on how they’re actually building their engine using Linux.For those of you that don’t know, Linux is by far the most widely used OS in the entire world. You’re most probably using Linux right now cause almost 85% of all smartphones are based on Linus and around 96% of the top 1,000,000 servers in the world run on Linux.\n\nWhat this means exactly is that Cartesi might be one of the top contenders in the crypto market to make it to the mainstream.\n\nHaving an engine that operates on Linux will give developers the opportunity to builds crypto dApps on Linux for the first time and give Cartesi (along with the rest of the crypto market) a ton of exposure.\n\nThis alone, in my opinion, is exactly why I think Cartesi is so underrated right now and is bound for a huge pump pretty soon.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8l45ip",
                    "author": "Blocks_and_Chains",
                    "score": 2,
                    "created_utc": 1652542401.0,
                    "response": "Cartesi is a solution for developers, that’s why I think it’s underrated. It doesn’t speak to the average crypto enthusiast, instead they are building the tools needed for the mainstream software developers to join the blockchain, bridging Web2 to Web3. Once their BlockchainOS will become functional, we’ll get to see the real price, in my opinion!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8lda3f",
                            "author": "PsychologicalSong661",
                            "score": 1,
                            "created_utc": 1652546487.0,
                            "response": "Any project that's focuses on crypto adoption is bound to rise. Since Cartesi allows developers to build good Blockchain apps, thesame way that the CASIMIR from the creator economy protocol allows developers to build web3 apps. Once developers starts using those tools, we will see price movement on the tokens ..",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8l591i",
                    "author": "Asher_TC",
                    "score": 2,
                    "created_utc": 1652542897.0,
                    "response": "Anything that makes mainstream adoption possible is welcomed",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8l8chl",
                    "author": "Suzxy",
                    "score": 1,
                    "created_utc": 1652544297.0,
                    "response": "It's a matter of time before it gets the deserved attention. Too many things are happening in the space that's taking up most of the attention right now.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8m7yol",
                    "author": "Future-Goose7",
                    "score": 1,
                    "created_utc": 1652560598.0,
                    "response": "It is not underrated in my opinion, but it is still in its early stages.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8mls89",
                    "author": "catcher_in_the-pie",
                    "score": 1,
                    "created_utc": 1652567012.0,
                    "response": "Buying more thanks for the reminder",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8okhp7",
                    "author": "CartographerWorth649",
                    "score": 1,
                    "created_utc": 1652611779.0,
                    "response": "Ethereum scaling problems are often translated into low transaction speed and high transaction fees which smoothers and slows it's growth and broader adoption.  \nThis problem is easily fixed with L2 solutions as mentioned above which is a win win for both ethereum and all the emerging protocols and that's why I have over 10 different scaling solutions on my bag from broader Matic to niche Unique Network, and obviously Cartesi...",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8p3uq3",
                    "author": "Umarzy",
                    "score": 1,
                    "created_utc": 1652623663.0,
                    "response": ">is bound for a huge pump pretty soon.\n\nDepends on BTC tbh. Not sure bottom is in",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8q5swi",
                    "author": "stormingaround10",
                    "score": 1,
                    "created_utc": 1652640484.0,
                    "response": "Definitely, it is underrated!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8t6rqx",
                    "author": "iamjide91",
                    "score": 1,
                    "created_utc": 1652703044.0,
                    "response": "I think cartesi is undervalued too.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "upisqd",
            "title": "Question regarding prices on bittrex vs displayed prices on coinmarkedcap",
            "url": "https://www.reddit.com/r/CryptoCurrencies/comments/upisqd/question_regarding_prices_on_bittrex_vs_displayed/",
            "author": "dankmemelord4headXD",
            "created_utc": 1652539747.0,
            "score": 3,
            "num_comments": 3,
            "subreddit": "CryptoCurrencies",
            "selftext": " Hello crypto community,\n\nwhen i checked the price for luna on coinmarkedcap it states that its around $0.0007/coin on bittrex\n\nBut on Bittrex it is sold for around $0.07.\n\n&#x200B;\n\nCan someone explain to me why there is such a wide difference and why does coinmarkedcap even show the wrong value here?\n\n​\n\nI am asking because I bought at the bottom for $10 which is now worth around $400. But on Bittrex i only got around 5k Coins which would be around 2 Dollars worth on any other exchange. Is there something i simply dont understand?",
            "stickied": false,
            "comments": []
        }
    ]
}