{
    "subreddit": "CryptoMarkets",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uyiqzr",
            "title": "If you truly believe in this market then stop focusing so hard on the prices and pay a bit more attention to development instead",
            "url": "https://www.reddit.com/r/CryptoMarkets/comments/uyiqzr/if_you_truly_believe_in_this_market_then_stop/",
            "author": "DeliciousNectarine8",
            "created_utc": 1653602606.0,
            "score": 17,
            "num_comments": 6,
            "subreddit": "CryptoMarkets",
            "selftext": "I know, our main goal here is to make money from our investments. However, if you’re someone that truly believes in the concept of crypto and what it has to offer for humanity then this shouldn’t be your sole focus.\n\nDevelopment if a much more reliable indicator of how a market is heading rather than short term prices. And right now, there’s a ton of development going on in the market honestly.\n\nThere are now giants like Apple and GameStop entering the crypto scene and making waves. That alone will bring tons of new blood to the market along with the fresh money.\n\nAlso, chains are starting to become a lot more sustainable which also means that adoption will become more and more prominent over the up coming years. Ethereum is moving over to PoS and new L1s like Concordium learned from the mistakes of Ethereum and implemented ZK proofs directly onto the chain for scaling it. Other chains like Cardano are also focusing on carbon negativity.\n\nLet’s also not forget that governments are starting to accept Bitcoin as legal tender and many companies and businesses are now accepting crypto payments as well.\n\nAnd I could keep going on and on about the developments we’re seeing in the market right now but the post would go on forever.\n\nDon’t ever lose hope of become frustrated cause of a bear market. As long as the fundamentals are there, you’re safe for the long term.",
            "stickied": false,
            "comments": [
                {
                    "id": "ia60mad",
                    "author": "G3STO3RT",
                    "score": 1,
                    "created_utc": 1653635583.0,
                    "response": "I usually find all info I need on crypto exchanges like BFX",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia75lem",
                    "author": "Umarzy",
                    "score": 1,
                    "created_utc": 1653662539.0,
                    "response": "It's understandable that the market is like that; after every pump comes a corrective phase. Seeing GameStop building its NFT marketplace on Loopring is actually interesting. \n\nNew tech will continue to enter the space as always, we might even see NFTs with order books \\[who knows\\] or perhaps more liquidity aggregators like FLUID ensuring users get the best & most favorable prices for trades.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia853c2",
                    "author": "Suzxy",
                    "score": 1,
                    "created_utc": 1653677362.0,
                    "response": "Why is there so much panic about prices, I though we were all here for the tech lol. Just kidding\n\nSolid projects are using this time to focus on building and development. I like to go for projects that are doing something unique, like FLUID Liquidity that's building an AI quant based crypto liquidity aggregation system or TEAMDAO that's building the first DeFi eSport gaming dao or OCEAN that's building the Web 3 data economy or CTSI that's building the first blockchain OS. I could go on but you get the point.\n\nIndeed, tons of development are happening in the crypto space on a daily basis, we really just have to pay attention to see that and stop crying over short term prices, for those that believe and are invested in real projects with long term viability.\n\nGiants like Apple and Gamestop coming into crypto is just the tip of the iceberg, imo. We are damn early.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}