{
    "subreddit": "CryptoTechnology",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uxs1pw",
            "title": "Why the world will become multi-chain IMO.",
            "url": "https://www.reddit.com/r/CryptoTechnology/comments/uxs1pw/why_the_world_will_become_multichain_imo/",
            "author": "Alecaria",
            "created_utc": 1653515357.0,
            "score": 35,
            "num_comments": 17,
            "subreddit": "CryptoTechnology",
            "selftext": "Some context: I recently watched Economics Explained latest [video](https://www.youtube.com/watch?v=S-6WNmL26wE) on YouTube. TLDR: One single hard currency can't stabilize our complex global economic system (unfortunately).\n\nThe problem isn't that a hard currency is bad, the problem is that we need several hard currencies that can compliment and compete against each other the way modern currencies do. I'll explain my hypothesis using two countries, Turkey and Norway. Turkey's average annual inflation for [April 2022 is 69.9%](https://tradingeconomics.com/turkey/inflation-cpi). Norway's average annual inflation for [April 2022 is 5.4%](https://tradingeconomics.com/norway/inflation-cpi).\n\nSay Turkey and Norway compete on exporting maritime ships to the EU. With ≈ 70% inflation in Turkey their ships would theoretically be more competitive than Norway because of lower prices, but since Turkish businesses can't buy the most [advanced, expensive foreign tech anymore](https://www.businessinsider.com/lira-plunge-turks-cant-buy-iphones-other-electronics-2021-11?r=US&IR=T), their ships lose quality and competetiveness long-term. If all parties exclusively traded in Bitcoin every nation would try to export as much as possible while importing as little as possible, so they have BTC net inflows that they can stack to keep their economy running. The moment Turkey's economy is disrupted into a trade deficit, it will cause a slow-but-inevetable death sprial of BTC net outflows. Workers (rightfully) demand the same pay as last month, but as companies gradually drain their own wallets they simply run out of Sats to pay their employees without enormous layoffs.\n\nHowever, employees and Turkey can be saved from this death-spiral by using their own hard currency that competes against Norway and the EU's individual hard currencies. Say Turkey's fictional \"TurkCoin\" follows [Bitcoin's current annual inflation rate of 1.7%](https://charts.woobull.com/bitcoin-inflation/), Turkey's currency would forever be saved from hyperinflation, unsustainable leverage and losing international buying-power. Each hard currency represents the value and strength of the country using it, so if Turkey ended up in a trade deficit, TurkCoin would temporarily devalue against Norway's NorCoin due to less demand.\n\nLess demand with 1.7% inflation will cause a slight (manageable) devaluation, but make Turkish companies temporarily more competitive against Norway. They can increase exports as their products become cheaper internationally, and the economy will grow organically again - regaining its valuation after demand picks back up. TurkCoin, NorCoin and EuroCoin would act like pendulums that naturally balance each other out during hard times - providing relief for the disrupted economy while making sure no single nation can debt-fuel itself unsustainably past the others and exporting its own inflation internationally. \\*looking at you [USA](https://www.usdebtclock.org/)\\*\n\nThe problem even with low modern inflation is its creation through debt, giving us the classic boom and bust cycles. Even with demand and inflation being equal and the currency not devaluing, we would still end up in a highly leveraged position after some time. Zombie companies would outcompete solid companies, not by having a sustainable business model but by leveraging themselves beyond reason like [Evergrande Group](https://www.nytimes.com/2021/12/09/business/china-evergrande-default.html). This robs rational planners while benefitting the short-sighted risk takers.\n\nClosing words: Only with predictable inflation created by mining/staking can we achieve fair market competition across the globe. What coins do you think will become the next international currencies and why?\n\nEdit: Grammar",
            "stickied": false,
            "comments": [
                {
                    "id": "i9zw06b",
                    "author": "eunit250",
                    "score": 3,
                    "created_utc": 1653519248.0,
                    "response": "> Only with predictable inflation created by mining/staking can we achieve fair market competition across the globe.\n\nDoesn't this just achieve the same issues we have already with our system with inequality? Where people with more money and resources and opportunities have more influence on the system? Seems to be an issue with systems where with little effort the people with more resources can create more currency. I think the only way this is solved is with chains that have a finite supply.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia06ef6",
                            "author": "89Hopper",
                            "score": 7,
                            "created_utc": 1653524154.0,
                            "response": "Finite supply currency is probably worse in this respect.\n\nThink of this really simple case. Imagine there are 1M in a country and there are 1M coin X. On average, everyone could have 1 coin. Everyone needs to spend a certain base amount to survive (housing/food/whatever). Anyone with slightly more than this base amount can easily accumulate. Now fast forward 50 years and the population is now 2M people, but we have the same amount of coin. This is a system that punishes those who get in later, whether it be late adopters when it was created or people not even born yet. This is how generational wealth is locked in. Not to mention the currency supply will actually decrease due to things like lost coins.\n\nPeople complain this is a problem today with the current economic situation, I agree it is. This idea of fixed coin tokens doesn't fix it, it potentially makes it worse but people are hoping they can become the new elite.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia0dlq1",
                                    "author": "eunit250",
                                    "score": 3,
                                    "created_utc": 1653527522.0,
                                    "response": "Yeah, good point and kind of depressing.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "ia1dsks",
                                    "author": "Alecaria",
                                    "score": 1,
                                    "created_utc": 1653548901.0,
                                    "response": "Yes I agree with you, finite supply will lead to great inequality. Taking your example of 1 coin per person with 1 million people: With a strictly limited inflation of 1.7% per year, after 50 years we would have 2 338 234 coins. If the population doubles this means there is still enough supply/liquidity for everyone - even those who \"get in\" late. Those who saved from the beginning will not lose buying power, but they will not gain anything either as the market is always fully saturated. And if the entire country just stacks up Sats instead of spending, the currency will simply devalue internationally due to little usage - which incentivices the people to start spending again.\n\nI truly believe this will become the norm in say 50 years. But there will be a lot of turbulence, over-corrections between high inflation and severe deflation to get to that point.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "ia1ef5a",
                                    "author": "not-mork",
                                    "score": 1,
                                    "created_utc": 1653549427.0,
                                    "response": "In terms of lost coins, a possible solution is storage-rent [link](https://ergoplatform.org/en/blog/2022-02-18-ergo-explainer-storage-rent/)",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "ia1k3j1",
                                    "author": "EuphoricBasil1",
                                    "score": 1,
                                    "created_utc": 1653554473.0,
                                    "response": "You’ve made a massive assumption - that no one spends, and those with the most up front will be those with the most at some future point in time. \n\nIf the population grows but the money supply does not, the price of goods and services will decrease over time. This is neither a good thing or a bad thing. \n\nI’d encourage you to consider the history of bitcoin wallets over time. Are the largest wallets from 2010 still the largest today? I think you’ll find that a very high percentage of those OG wallets now contain a tiny fraction of their original BTC. Why? They sold them for goods and services. They sold them because the price of BTC rose as demand for it increased and they went and purchased things they wanted. \n\nThere is no reason to believe that this distribution of BTC amongst the people will continue to occur as the price rises.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "ia1fd13",
                            "author": "Alecaria",
                            "score": 1,
                            "created_utc": 1653550239.0,
                            "response": "Good point. Mining... will likely become more and more centralized, unless the coin utilizes Helium's (HNT) type of mining architecture. However, staking can be done by anyone, rich and poor. As long as the currency is limited to ≈ 1.7% annual inflation, the newly created coins will be divided fairly among the population. To print more, 51% of all participants would agree to devalue their own money. I don't think that will happen, but any decision agreed by the majority is just a well-functioning democracy if you ask me. \n\nGreater inflation would actually devalue Whale wallets greater than it would devalue Shrimp wallets. If a shrimp went from 1 coin to 2 coins, thats a 200% increase, with inflation at 1.7%. But a whale with 1000 coins recieving 1 coin would only gain 0.1%; much less than inflation.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia0x04x",
                    "author": "Treyzania",
                    "score": 3,
                    "created_utc": 1653536982.0,
                    "response": "Generally speaking I agree with what you're saying, but you take a logical jump from \"multiple currencies\" to \"multiple chains\" here.  It's totally possible that your claims are exactly correct but everyone ends up using the same couple of ledgers but using dozens of different currencies issued on them.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia10624",
                    "author": "rustlesg",
                    "score": 2,
                    "created_utc": 1653538891.0,
                    "response": "Like what another commenter said, though we probably will see a multi-chain crypto / payments ecosystem, your points are about multi-currencies and not multi-chains.\n\nI agree with your points, and we'll likely see most countries issue their own CBDCs for the reasons you wrote above.\n\nI wrote an article previously that you may find useful as well, and covered what I think we'll see in how Bitcoin will interact with these CBDCs.\n\nWe'll likely see Bitcoin as a big part of a countries national reserves, and CBDCs will be issued sort of as a derivative of the underlying reserves (like what Singapore does currently, just that BTC would be a big part of the reserves instead of US Treasury Notes).\n\nHere's an excerpt:\n\n*\"If countries held Bitcoin as reserves, they could use it to back their national currencies and protect their currency. This can be done by selling some of their Bitcoin reserves for their own currency in the event of a currency attack.*\n\n*As central banks start adopting their own digital currencies, it could even be possible to peg the value of their currencies in relation to another currency or basket of other CBDCs algorithmically and allow redemption of the currency in exchange for Bitcoin and vice versa. Any deviation from peg would allow triangular arbitrage between Bitcoin, the pegged price, and the trading price of the national currency to keep its peg. Fees can be earned by the central bank for currency redemption, which could form another revenue stream for the country.\"*\n\nFor some additional context, Singapore's currency is fully backed by its reserves, unlike US, it can't just print SGD without any underlying reserves to support it. The SGD is pegged to a basket of currencies, based on how strong / weak it wants to be in relation to other currencies to maintain trade competitiveness, and they use their reserves to maintain the peg.\n\nHere's the full article in case you're interested: [https://russellgomes.medium.com/the-future-of-bitcoin-as-part-of-a-nations-reserves-f851c0da0a28](https://russellgomes.medium.com/the-future-of-bitcoin-as-part-of-a-nations-reserves-f851c0da0a28)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia1eiy7",
                    "author": "pro-NFT",
                    "score": 2,
                    "created_utc": 1653549518.0,
                    "response": "Hmm, I agree with what you are saying.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9zoe91",
                    "author": "Hodl_Deez_0o",
                    "score": 5,
                    "created_utc": 1653515820.0,
                    "response": "Such a good and insightful read.\n\n\nTruly.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9zuh9g",
                            "author": "Alecaria",
                            "score": 2,
                            "created_utc": 1653518545.0,
                            "response": "Thank you, means a lot to hear!",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia0ejzu",
                                    "author": "Hodl_Deez_0o",
                                    "score": 2,
                                    "created_utc": 1653527957.0,
                                    "response": "Pleasure mate. Well thought out, if this come to be frame this.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}