{
    "subreddit": "CryptoMarkets",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ut6l65",
            "title": "The Litecoin network activates the “MimbleWimble” update",
            "url": "https://medium.com/@unclefibonacci/the-litecoin-network-activates-the-mimblewimble-update-2721b70a8feb",
            "author": "btcxlab",
            "created_utc": 1652975960.0,
            "score": 1,
            "num_comments": 4,
            "subreddit": "CryptoMarkets",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i97tx4p",
                    "author": "CointestAdmin",
                    "score": 1,
                    "created_utc": 1652976575.0,
                    "response": "Litecoin [pros](/r/CryptoMarkets/comments/ut6l65/the_litecoin_network_activates_the_mimblewimble/i97tydp/) & [cons](/r/CryptoMarkets/comments/ut6l65/the_litecoin_network_activates_the_mimblewimble/i97tyz6/) and related info are in the collapsed comments below. Pros and cons will change for every new post.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "ut6bp9",
            "title": "USDT- Is it safer than algorithmic stable coins like UST?",
            "url": "https://www.reddit.com/r/CryptoMarkets/comments/ut6bp9/usdt_is_it_safer_than_algorithmic_stable_coins/",
            "author": "predictany007",
            "created_utc": 1652975197.0,
            "score": 2,
            "num_comments": 7,
            "subreddit": "CryptoMarkets",
            "selftext": "Investors have withdrawn over $9 billion from Tether USDT over the past week. The recent UST de-peg has stoked fear among investors who hold stablecoins. USDT is supposedly 70% backed by cash & cash equivalents. \n\nDo you think USDT is safer than algorithmic stablecoins like UST?",
            "stickied": false,
            "comments": [
                {
                    "id": "i97r2tu",
                    "author": "CointestAdmin",
                    "score": 1,
                    "created_utc": 1652975426.0,
                    "response": "Tether [pros](/r/CryptoMarkets/comments/ut6bp9/usdt_is_it_safer_than_algorithmic_stable_coins/i97r43e/) & [cons](/r/CryptoMarkets/comments/ut6bp9/usdt_is_it_safer_than_algorithmic_stable_coins/i97r4p1/) and related info are in the collapsed comments below. Pros and cons will change for every new post.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i97s4ij",
                    "author": "comandershepperd",
                    "score": 4,
                    "created_utc": 1652975851.0,
                    "response": "Usdt is likely backed by nothing, maybe 10% of actual money. Based on the Tron blockchain which is Heavily controlled by the Chinese, its not even remotely safe, it isn’t a question of if it will collapse its when. Also run by bitfinex which is a criminal entity. Anyone who has been in crypto since the beginning all knows what tron, tether and bitfinex are up too.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i981ye0",
                    "author": "talixan666",
                    "score": 0,
                    "created_utc": 1652979795.0,
                    "response": "There is nothing safe right now, but if I had to choose, I would definitely choose USDT.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i98t61o",
                    "author": "eight-none-one",
                    "score": 1,
                    "created_utc": 1652990868.0,
                    "response": "Ironically, the more people dump the higher the backing percentage becomes.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "ut6ecm",
            "title": "My brother messed up",
            "url": "https://www.reddit.com/r/CryptoMarkets/comments/ut6ecm/my_brother_messed_up/",
            "author": "Nightmares57",
            "created_utc": 1652975407.0,
            "score": 0,
            "num_comments": 8,
            "subreddit": "CryptoMarkets",
            "selftext": "For context : My brother and I are crypto traders for more than a year now. I know it's not much but we have some good knowledge about crypto, we also do a lot of research before investing.\n\nA couple of months ago, we both bought Fantom. We strongly believe in it and it's project so we put the majority of our money in it.\n\nYesterday, while we were having dinner, my brother told me that he sold all his crypto. I was really surprised to hear that because he never sold at loss. I tried to know why and he told me that he didn't panic sell, he got tired of trading and that it's so stressing so he ended the bullshit. He invested about 17k and now was left with 2k.\n\nI think that he got out in the worst possible moment and that he should wait for market recovery before quitting. I am thinking of advising him to buy again, what do you guys think?",
            "stickied": false,
            "comments": [
                {
                    "id": "i97rgdf",
                    "author": "Eurymemdon",
                    "score": 11,
                    "created_utc": 1652975578.0,
                    "response": "I think that since he indicated that it was bad for his memtal health he made the right choice for himself and you should let him.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i97rwlx",
                    "author": "056Oct90",
                    "score": 6,
                    "created_utc": 1652975761.0,
                    "response": "Your brother is going through what so many others are. I got into crypto during the bull run and noticed it’s very stressful and time consuming",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i97s9ii",
                            "author": "Nightmares57",
                            "score": 2,
                            "created_utc": 1652975908.0,
                            "response": "Yeah that's exactly what happened to us and what he told me yesterday",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i97smtu",
                                    "author": "056Oct90",
                                    "score": 2,
                                    "created_utc": 1652976054.0,
                                    "response": "It’s been nothing but a horror show for me and I honestly think I would have done gambling at the local casino",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i97uz58",
                    "author": "mrdeezy",
                    "score": 1,
                    "created_utc": 1652977004.0,
                    "response": "If you guys are actually \"traders\" just stop now. You don't now what you are doing. FTM is fully retracing, it doesn't matter what you \"believe in\". The market is going to bounce on the way down. We are in a recession now, none of these crypto assets are going to do anything until maybe the end of the year. You bought Fantom with zero signs of reversal 2 months ago after 7 out of 8 red weekly candles? Seriously, just stop.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i98bun1",
                    "author": "Nature_-1",
                    "score": 1,
                    "created_utc": 1652983782.0,
                    "response": "Not everyone has the mental toughness to hold losses   \nI’ve also had a couple of my friends out the market at incredibly low price. Not me. I had bought some ALBT right before the dip. Price dropped significantly because of the market situation but they’ve been working hard to improve their products and use cases making long term profits possible. \n\nIt boils down to how well you know a particular project that you’ve invested in.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i98n7ws",
                    "author": "Sorry_Attitude_",
                    "score": 1,
                    "created_utc": 1652988423.0,
                    "response": "You say traders and lost that much.\n\nI am sorry but no\n\nIf you want to do anything serious, you have to invest smart and don't puss foot around \n\nYou'd probably have a better time working and investing Mid-Long term, there are enough ways to do that and make more money than stressing yourself over a 1% gain\n\nESPECIALLY in a bear market\n\nIf you like risk, get into Crowdfunding, there are enough platforms\n\nCrowdCube is not focused on crypto but it has crypto opportunities, a lot of banks actually,\n\nAngelBlock is focused on crypto and you can fund through Eth, \n\nWant safer? Get Bitcoin as it is basically the S&P500 of the market and HODL\n\nThere are so many possibilities and you stress yourself over things that don't beat hodling",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i98thhw",
                            "author": "Nightmares57",
                            "score": 1,
                            "created_utc": 1652991001.0,
                            "response": "Well, we're more like long term traders. We don't mind hodling for months.\n\nHere's basically what we were doing : \nWe would wait for the market to go down heavily, like 15% to 20% on the last 24h and we would enter with a part of our money and put a sell a limit at about 8% or 10%. If the market goes down more, we would enter with another part of the money and set another sell limit for 10%. With this technique, we almost never sold at loss. We were basically doing dollar cost averaging, it didn't require much time and it was working quite well, but that was in a bull market. Our strategy If the bear market came was to just hodl and wait for the bull run again, we don't mind waiting for months, but now my brother got tired of all this and told me that the money is not worth the time and the stress so he just quit.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}