{
    "subreddit": "CryptoMarkets",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uqi22y",
            "title": "For Anyone Who Lost $ in LUNA;",
            "url": "https://www.reddit.com/r/CryptoMarkets/comments/uqi22y/for_anyone_who_lost_in_luna/",
            "author": "FitRecognition5037",
            "created_utc": 1652656285.0,
            "score": 7,
            "num_comments": 4,
            "subreddit": "CryptoMarkets",
            "selftext": "First, BEWARE of any other uses posting with links for compensation for LUNA. They are ALL scams and it’s so unfortunate that there are human beings out there who have no sense of morals. NEVER CONNECT YOUR WALLET TO A LINK FROM SOMEONE YOU DONT KNOW.\n\nFor those who lost money in LUNA…understand, this was not a scam. LUNA was an experimental crypto in decentralized finance. The concept was vetted by many and carried risk. Those risks were publicized by many if you spent any time doing research. There were many however who believed in the project and the basis of the concept. This a a very unfortunate event. And my heart goes out to anyone who lost money in LUNA (which includes myself). However, this happens. This happens in the stock market (think 2008 / Lehman Brothers ENRON, etc.), and this happens in crypto. ALL investments carry risk. And some more than others. The more risk you take on the more reward. And the more risk. That’s how the system has always been set up. In any market. Note that there were extremely wealthy investors including the CEO of Galaxy Digital, Mike N., who lost billions in LUNA.\n\nMike is a very saavy, ex Goldman Sacks exec who founded Galaxy Digital. He went so far as to get a tattoo of LUNA recently. My heart goes out to Mike and I hope he regains himself after this and is successful in the many other projects he still has investments in. Just because he still is wealthy doesn’t take away from my compassion for him. I feel for anyone who lost any amount of money.\n\nFor anyone who is distraught. Please please please don’t let yourself be taken further advantage of, whether through scams like this poster above asking for your wallets to “compensate you”, or by taking on further risks to make up for it. Regain, rebuild, reinvigorate yourself. Life moves on. And so will you. It might be hard. Very hard. Extremely hard. But I can promise you one thing. This will pass with time.\n\nI wish everyone here all the best. And I sincerely hope everyone is successful and regains what they lost. This was an unfortunate event, but again, it happens. No one is at fault. This was an experimental project that went south. That’s all.\n\nSo let’s all take a deep breath. Try to regain our composures. And let’s learn from this. Because every mistake is also a lesson. So let’s learn from this in anyway we can. For some it will mean to assess risk differently. For others it will mean to not risk or invest more than you can afford to lose. For others it will be to not hold onto assets for longer ithan you should. And yet for others, it will mean learning to get up in the morning again and realizing life is NOT over. It’s just another day, another lesson learnt.\n\nLove & peace to all, -A fellow LUNA investor",
            "stickied": false,
            "comments": [
                {
                    "id": "i8r5zhk",
                    "author": "CointestAdmin",
                    "score": 1,
                    "created_utc": 1652656703.0,
                    "response": "Terra(LUNA) {{pros}} & {{cons}} and related info are in the collapsed comments below. Pros and cons will change for every new post.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8r5h01",
                    "author": "bpo87",
                    "score": 1,
                    "created_utc": 1652656449.0,
                    "response": "Thank you for your post brother.\n\nWell said 👍",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8r838m",
                    "author": "StarWarsTrekGate",
                    "score": 1,
                    "created_utc": 1652657732.0,
                    "response": "I mean, my 175$ is now like 3 cents. This is why we only invest what you could lose. Same things I do in penny stocks and risky small caps. Paid off with shib and doge... They'll be another coin. And if you are freaking out just walk awayfor a day or week and revisit later.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uqhu0z",
            "title": "Enter team and JPO talks on Twitter",
            "url": "https://i.redd.it/6liwem7fynz81.png",
            "author": "freeman_lxg",
            "created_utc": 1652655570.0,
            "score": 2,
            "num_comments": 0,
            "subreddit": "CryptoMarkets",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uqhq60",
            "title": "Down turn in the markets is the time to focus on fundamentals, some good content from Zenon Network explaining the new tech.",
            "url": "https://v.redd.it/mdlwvm5xypz81",
            "author": "drinkmoreapples",
            "created_utc": 1652655217.0,
            "score": 2,
            "num_comments": 0,
            "subreddit": "CryptoMarkets",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uqihav",
            "title": "□□□□■■ CRYPTO FUCKERY LOADING□□□□□□■■■",
            "url": "https://v.redd.it/y4hdsxhn3qz81",
            "author": "HEDGEDHOMELESS",
            "created_utc": 1652657679.0,
            "score": 0,
            "num_comments": 0,
            "subreddit": "CryptoMarkets",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uqib8c",
            "title": "UST and LUNA Update - May 15, 2022 - Crypto JBro",
            "url": "https://youtu.be/lLAB27CwW6o",
            "author": "JaredB136",
            "created_utc": 1652657130.0,
            "score": 1,
            "num_comments": 2,
            "subreddit": "CryptoMarkets",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8r9liy",
                    "author": "CointestAdmin",
                    "score": 1,
                    "created_utc": 1652658480.0,
                    "response": "Terra(LUNA) {{pros}} & {{cons}} and related info are in the collapsed comments below. Pros and cons will change for every new post.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uqib13",
            "title": "Results of the week of the blockchain industry",
            "url": "https://medium.com/@unclefibonacci/results-of-the-week-of-the-blockchain-industry-cea4aef589cc",
            "author": "btcxlab",
            "created_utc": 1652657112.0,
            "score": 1,
            "num_comments": 0,
            "subreddit": "CryptoMarkets",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uqiak8",
            "title": "eQardCoin",
            "url": "https://www.reddit.com/r/CryptoMarkets/comments/uqiak8/eqardcoin/",
            "author": "lalalalikethis",
            "created_utc": 1652657072.0,
            "score": 1,
            "num_comments": 1,
            "subreddit": "CryptoMarkets",
            "selftext": "So, I have been researching about blockchain for a while now, in some posts I have read people talking about how this token, in theory, has the “potential” to be used in many contexts besides the speculation and that was many big names behind it, however I haven’t found any sources confirming theres legit people behind this, do you have any sources about ir or do you know if this is just other dead end project?",
            "stickied": false,
            "comments": []
        }
    ]
}