{
    "subreddit": "CryptoTechnology",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uybyh5",
            "title": "Chaos is a ladder, if you have the stomach to climb on it",
            "url": "https://www.reddit.com/r/CryptoTechnology/comments/uybyh5/chaos_is_a_ladder_if_you_have_the_stomach_to/",
            "author": "Burdrgts",
            "created_utc": 1653583767.0,
            "score": 0,
            "num_comments": 1,
            "subreddit": "CryptoTechnology",
            "selftext": "As once said by someone very smart in a show that used to be very good. \n\n Right now chaos is an excellent term to describe what's going on in the world, looming recession, prices of food that are sky high and gas prices that I don't even need to comment things are not looking good.  \n\n\nCrypto has also been affected, entering a period of stagnation of its own. BTC and ETH are on the low side, people have been losing money left and right and although we do sympathize we also need to see the opportunity that arises with prices being so low.   \n\n\nOf course this is no financial advice only my personal observation and always do your own research but I believe that investing right now when the prices are at their lowest can be a very smart move, of course only if you believe that they will jump again.  \n\n\nThat's how the rich always emerge richer after crisis situations because they buy things when they cost less instead of selling them (I understand of course that some people can't afford to  do this and must sell things in order to survive, not trying to be insensitive).  \n\n\nMy two ideas on how to profit from this situation are to either invest in good Crypto like ETH that will probably rebound ( This kind of market will probably clear out all the worthless shitcoins) or invest in strong NFT communities like Cryptopunk, High Sloth Society, BAYC etc when the price for entering them is not so steep.   \n\n\nSo what do you think about my opinion does it pay off to make a risk in promise of a greater reward and trying to take advantage of this situation.",
            "stickied": false,
            "comments": [
                {
                    "id": "ia33n8y",
                    "author": "Dormage",
                    "score": 1,
                    "created_utc": 1653584016.0,
                    "response": "I think you should post this on r/cryptocurrency. This sub is for discussing the technology, not the financial aspects of it. \n\nAs a sidenote, dont take financial advice from pseudonymous people on the internets.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}