{
    "subreddit": "CryptoMarkets",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uvi1bb",
            "title": "CZ: If Binance Goes Bankrupt, Users Would Be Refunded First Before Shareholders",
            "url": "https://timestabloid.com/cz-if-binance-goes-bankrupt-users-would-be-refunded-first-before-shareholders/",
            "author": "Solodeji",
            "created_utc": 1653247218.0,
            "score": 237,
            "num_comments": 37,
            "subreddit": "CryptoMarkets",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9loxj9",
                    "author": "DietUnicornFarts",
                    "score": 54,
                    "created_utc": 1653250031.0,
                    "response": "Riiiiiiiight",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9mfi38",
                            "author": "Brushermans",
                            "score": 14,
                            "created_utc": 1653262896.0,
                            "response": "an honest business should do this - IIRC from accounting 101, deposits are considered a liability on the balance sheet, so they should be paid off before equity holders.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9mux9b",
                                    "author": "ScientificBeastMode",
                                    "score": 4,
                                    "created_utc": 1653270854.0,
                                    "response": "Which is also true of Coinbase, btw. Everyone is freaking out about Coinbase’s statement, but it’s actually not a bad deal for users.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9nb9f7",
                                            "author": "jasonalexander1977",
                                            "score": 1,
                                            "created_utc": 1653279809.0,
                                            "response": "Because Coinbase has been so righteous to their users in the past? Have you read about the things they have pulled and people they have screwed over with zero repercussions? Coinbase will screw over their users without batting an eye. History proves it.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9n41ts",
                                    "author": "hastybet2023",
                                    "score": 3,
                                    "created_utc": 1653275604.0,
                                    "response": "What part of this industry gave you the impression that it’s run by upstanding people?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9n4vqo",
                                            "author": "Brushermans",
                                            "score": 1,
                                            "created_utc": 1653276037.0,
                                            "response": "fair point, i'd trust coinbase to do this more (as another user mentioned here) since they're a public company that follows american rules",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9n5uic",
                                                    "author": "hastybet2023",
                                                    "score": 1,
                                                    "created_utc": 1653276568.0,
                                                    "response": "Oh they are the worst of all.\n\nThe shit they’ve pulled over the past 9 years? That bald headed ceo deserves prison time. \n\nBesides selling the data to fincen and any other organization that wants to track transactions, they are always their business above all else.\n\nIf they don’t have the coin in cold storage, they won’t have enough to cover a bank run.\n\nUSD? They have plenty of that, but they won’t be able to make good on coin withdrawals if people do a bank run on them.\n\nOther exchanges won’t sell them coin.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9n6tdl",
                                                            "author": "Tapputi",
                                                            "score": 2,
                                                            "created_utc": 1653277116.0,
                                                            "response": "Ok, but if there is a bank run then having USD would actually be the best case scenario.  In a sell side run users are selling crypto to purchase dollars.  \n\nIt’s if they have a security issue and everyone withdraws their coins to private wallets that would be the issue, or if the coins skyrocketed and they didn’t have reserves…which they do.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9nbrrh",
                            "author": "Womec",
                            "score": 1,
                            "created_utc": 1653280134.0,
                            "response": "They've proven that is probably case unlike many other exchanges. \n\nCredit where credit is due.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9lp7xj",
                    "author": "ahpek99",
                    "score": 9,
                    "created_utc": 1653250164.0,
                    "response": "With Shiba, mixed with Luna backed by UST. LFG boys!!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9m991e",
                    "author": "Sulla_The_God",
                    "score": 5,
                    "created_utc": 1653259653.0,
                    "response": "His $1.6 billion is now under $3k. He has to be mad.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9nbutj",
                            "author": "tastehbacon",
                            "score": 3,
                            "created_utc": 1653280190.0,
                            "response": "I think he had only originally spent 10k on it.\n\nPlus he still has 11B.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9lrcxl",
                    "author": "ifsavage",
                    "score": 16,
                    "created_utc": 1653251152.0,
                    "response": "You mean they get their own money back. Wow. That’s so generous. (S)",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9m05qd",
                            "author": "w3dxl",
                            "score": 13,
                            "created_utc": 1653255224.0,
                            "response": "Most banks won’t so it’s sort of a win.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9nlha5",
                                    "author": "marineabcd",
                                    "score": 2,
                                    "created_utc": 1653287086.0,
                                    "response": "Well it depends, but at least in the U.K. you have FSCS protection which protects deposits of up to £85k in the case the bank goes under. Investments and pensions have some protections too but I don’t know off top of head.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9mv2gy",
                            "author": "ScientificBeastMode",
                            "score": 0,
                            "created_utc": 1653270927.0,
                            "response": "To be fair, investors would be asking for essentially the same thing. At that point, their share price would be in the toilet, so they would be begging just to get their money back in the event of a bankruptcy.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9myqkw",
                                    "author": "ifsavage",
                                    "score": 2,
                                    "created_utc": 1653272804.0,
                                    "response": "In a normal brokerage say with stocks or bonds the clients money should be segregated and not mixed with the operations budget ever. They aren’t invested in the company. They are clients of the company.  Their money is not by definition the companies. It is merely held by that company. \n\nIf you had a storage space and the storage company went out of business you wouldn’t think it was ok for the investors in the storage company to take your stuff if they were going broke right? It would be stealing.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9n54p0",
                                            "author": "ScientificBeastMode",
                                            "score": 1,
                                            "created_utc": 1653276168.0,
                                            "response": "That’s sort of true. Rehypothecation is very common among financial institutions, including banks that hold customer deposits. That’s why the FDIC exists in the US. Before the government decided to create an institution to cover customer deposit losses (through bond issuance and ultimately money-printing), customers just lost their money whenever a bank failed and they didn’t have enough capital to cover all the deposits. That’s just the nature of a financial institution.\n\nStock brokerages are slightly different in the sense that they don’t lend your money out. They make money on trading fees and other services. But they still have issues with liquidity that can complicate that a little bit.\n\nThis is especially true in crypto markets. If you’re Binance.US, and you have millions of customers making millions of trades every day, then you can send a million Ethereum transactions individually. Instead, you have your own liquidity pool of Ethereum that you earmark for specific accounts, and when people withdraw their Ethereum or trade it, then they allocate it (on paper) back to the liquidity pool.\n\nThis is totally fine most of the time, but in periods of high volatility and high transaction throughput, they can find themselves in a position where their total asset value is less than the total value of their user accounts on paper. And at some point they have to make up the difference out of their own profits.\n\nIn an extreme case, they might hit a situation where they cannot possibly cover the deposits.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9mc539",
                    "author": "FreeFactoid",
                    "score": 3,
                    "created_utc": 1653261140.0,
                    "response": "Your funds are SAFU",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9lr1b6",
                    "author": "C30s",
                    "score": 3,
                    "created_utc": 1653250998.0,
                    "response": "https://www.verif.com/societe/BINANCE-FRANCE-SAS-905060109/ maybe this explains that",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9m72pj",
                    "author": "RookieRamen",
                    "score": 2,
                    "created_utc": 1653258553.0,
                    "response": "Doubt it",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9mruae",
                    "author": "TripleReward",
                    "score": 2,
                    "created_utc": 1653269331.0,
                    "response": "They wont go bankrupt",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9mha8n",
                    "author": "pierreman",
                    "score": 1,
                    "created_utc": 1653263840.0,
                    "response": "If it's too good to be true.....",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9mlo1e",
                    "author": "phltakahashi",
                    "score": 1,
                    "created_utc": 1653266153.0,
                    "response": "Maybe we should diversify on some DeFi exchanges and launchpads in order to save some incase of this kind of market factor that can affect our assets in the near future. We should consider also having [**PGEN**](https://polygen.io/) in our bag to learn more about the new potential moonshot being launch in the crypto space.👌🏻",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9n25lr",
                    "author": "dotcomslashwhatever",
                    "score": 1,
                    "created_utc": 1653274579.0,
                    "response": "they don't even let you withdraw your shit if you don't give them proof of your income. if you deposited from another account and you have no access to it, you're fucked, account blocked until some monkey deems it ok to unblock. all CEX are the same. don't believe anything they say. and always make sure to only have tradable coins in it. otherwise more to your cold wallet. you have been warned",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9n375w",
                    "author": "takatori",
                    "score": 1,
                    "created_utc": 1653275135.0,
                    "response": "They say that, but where are the binding contracts, and how do they avoid the ire of shareholders? This would immediately be challenged in court, I expect.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9n3uvs",
                    "author": "hastybet2023",
                    "score": 1,
                    "created_utc": 1653275494.0,
                    "response": "Because that’s how it works… lmao.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9nfq00",
                    "author": "nocommentallowed",
                    "score": 1,
                    "created_utc": 1653282797.0,
                    "response": "Sure. Already moved my shit to cold storage.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9njakw",
                    "author": "checkyourfallacy",
                    "score": 1,
                    "created_utc": 1653285383.0,
                    "response": "There are shareholders?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9nnr15",
                    "author": "mrotz",
                    "score": 1,
                    "created_utc": 1653288924.0,
                    "response": "Yes I belive him……..",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9mii1t",
                    "author": "Admirable_Sugar_4227",
                    "score": -1,
                    "created_utc": 1653264483.0,
                    "response": "How tf is Binance bankrupt this doesn’t make sense",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9mm3bm",
                            "author": "droidtime",
                            "score": 1,
                            "created_utc": 1653266383.0,
                            "response": "No one said this",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "uvi21l",
            "title": "No matter how cool your L1 blockchain sounds, maybe don’t release it until you figure out scaling!",
            "url": "https://www.reddit.com/r/CryptoMarkets/comments/uvi21l/no_matter_how_cool_your_l1_blockchain_sounds/",
            "author": "moheni52",
            "created_utc": 1653247276.0,
            "score": 30,
            "num_comments": 11,
            "subreddit": "CryptoMarkets",
            "selftext": "It’s really frustrating to promise mass adoption on-chain then make people wait 8 hours for either stuck or failed transactions as soon as a good NFT project is minting or when a P2E gains wide popularity. And after the problems people had with Cosmos, Solana, and many others.\n\nI think scaling optimistically will have a few issues, Optimism in its current state might get too expensive once serious activity hits the chain. So for the most part, I think ZK-Proofs will be the next big thing. Starknet and ZKSync sound extremely exciting, but I think the future will lean more towards L1s that have ZK-Proofs built in them. Polygon and Concordium are working towards this at the moment, but Polygon is yet to transition into its own L1 with the fear of a community turning against them for betraying the ETH maxis they’re siding with by choosing Ethereum as the settlement layer.\n\nAs this bear market hits, take the opportunity to see what’s being in the works. Your voice as a community member in crypto matters; don’t cheer for the earliest ICO date if the project sounds cool, demand more development, and most importantly, demand ultimate scalability so that your investment doesn’t go from long to short term.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9m10go",
                    "author": "Nearby_You_313",
                    "score": 1,
                    "created_utc": 1653255628.0,
                    "response": "While the price action has been shit lately and there's some drama, I've followed MTV for a long time and I'm surprised so few L1s have nowhere near it's scalability. I sold most of mine but hold onto some since the tech is neat and works well.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9n88ir",
                    "author": "ScientificBeastMode",
                    "score": 1,
                    "created_utc": 1653277935.0,
                    "response": "Right now, it seems like the only thing that will still work with decentralization is something using PoS consensus, bare-metal software execution (no VM, so nothing Ethereum-based), with L2 ZK rollups.\n\nIMO I think the best candidate for that is Solana, but they need to develop their L2 ecosystem to achieve that. Even now, without any L2’s they are still beating just about everything in the Ethereum ecosystem using just their L1. And they’re doing this because they have those first two pieces of the puzzle sufficiently solved.\n\nI’m open-minded, but that just seems like the most obvious path forward.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9of9j9",
                    "author": "FanNo62",
                    "score": 1,
                    "created_utc": 1653310576.0,
                    "response": "Kadex is primarily a network that combines both Layer-1 public chain protocol with Layer-2 network, which allows developers to build smart contracts and other blockchain-based solutions\n\nKadena’s unique mechanism allows it to be a platform, which can deliver greater transactions per second (TPS) scales\n\nAs for me, the Kadena blockchain is the best L1 which solves the problem of scaling.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}