{
    "subreddit": "CryptoMarkets",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ut4kdp",
            "title": "Ric Edelman Interview - The Truth About Crypto Book - Bitcoin 401K - Crypto Regulations - NFTs",
            "url": "https://www.youtube.com/watch?v=z9WnZ_ab59k",
            "author": "PrimeCoinz",
            "created_utc": 1652970236.0,
            "score": 1,
            "num_comments": 0,
            "subreddit": "CryptoMarkets",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "ut4pb5",
            "title": "Do you have any idea where blockchain will go next ?",
            "url": "https://www.reddit.com/r/CryptoMarkets/comments/ut4pb5/do_you_have_any_idea_where_blockchain_will_go_next/",
            "author": "Ok-Historian-7314",
            "created_utc": 1652970623.0,
            "score": 2,
            "num_comments": 4,
            "subreddit": "CryptoMarkets",
            "selftext": "How far can blockchain actually penetrate all the spheres of life  \n\n\nNow I've seen some wild cases of application for blockchain tech.  \nBut the question is where else can it go and should we follow its footsteps ?  \nHere is my reasoning. Blockchain's original use was to create cryptocurrency and because of the complexity and the security that the tech provides it actually gave value to crypto that is now measured in billions of dollars.  \nThat is not where its' application can end.  \n\n\nWhere do you think we will see blockchain implemented next ?  \n\n\nNow I've seen some examples where some companies like Giant, Telcoin, World Mobile Token seek to implement the tech in spheres like Telecommunications,  \nMicrosoft using blockchain for the purposes of creating Digital ID, even monitoring supply chains, is there no end in site.  \n\n\nNow would you invest in some enterprises that bring blockchain application to new spheres of life, do you believe that this can be profitable ?  \n\n\nI would also like to hear your opinions where it might go next or some examples that you have heard of it's usage.",
            "stickied": false,
            "comments": [
                {
                    "id": "i97ig52",
                    "author": "NiceFetishMeToo",
                    "score": 2,
                    "created_utc": 1652971875.0,
                    "response": "Not an expert, but we’ve been evaluating blockchain in a number of real-world industries. I’m interested in other opinions, but so far the benefits are outweighed by the risks/cost. It still appears best suited for transaction-based currencies. There does seem to be some drive to establish digital tokens (like NFTs) for physical items such as expensive fashion/accessories. The next 12-18 months will most likely include broad experimentation.\n\nSome of my notes:\n\n* Blockchain provides a combination of technologies — PKI, P2P, etc. — but not all are valuable for every scenario and serve only to add complexity\n* Distributed architecture requires all participants to provide platform/storage/etc.\n* Transparency is most beneficial when exchange/transaction history must be available\n* Real-World transaction limits are still low for high-volumes\n\nPublic/Government components seem like good candidates. Things like permits, real-estate transactions, licensure, etc. But, there is a ton of variability in these across different jurisdictions and adoption is a high bar to cross. Some would require actual laws/regulations to change to adopt blockchain and there’s no rush to do that. (It isn’t essential and doesn’t make financial sense.)\n\nEncrypted payloads on the chain are useful. But, really, we’re just using the blockchain framework to push around paper. It has to be a use case that actually requires the combination of technologies.\n\nI’m not certain I see profitability — at least not now. But, you mentioned a few opportunities in your post. If one of them gains traction, it could very well be the pivot. God knows, everyone has at least looked at it. ;)\n\nLooking forward to other comments.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i98cie4",
                    "author": "Nature_-1",
                    "score": 1,
                    "created_utc": 1652984053.0,
                    "response": "In my opinion, I’ll say very far. They’re lots of significant upgrades and opportunities being created daily. \nOne of my favorite is how creators can build their businesses on web3 using Deip protocols. This one will definitely bring mass adoption the interest in web3 have been rising",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "ut4kli",
            "title": "Ethereum’s Vitalik Buterin Explains How to Prevent Whales from Dominating ETH2 Staking",
            "url": "https://timestabloid.com/ethereum-vitalik-buterin-explains-how-to-prevent-whales-from-dominating-eth2-staking/",
            "author": "Solodeji",
            "created_utc": 1652970254.0,
            "score": 48,
            "num_comments": 10,
            "subreddit": "CryptoMarkets",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i997i9d",
                    "author": "globzski",
                    "score": 3,
                    "created_utc": 1652997884.0,
                    "response": "rich get richer",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9b2f2q",
                    "author": "Grey_Morals",
                    "score": 1,
                    "created_utc": 1653038211.0,
                    "response": "So. If I own let's say 16% of the eth supply. And I'm staked by my self? How would this be enforced? Is it even possible to stake by yourself with such a rule? What's to stop a really large whale to stake 14% for the majority of the time. And then stake  another 5% they had in reserve suddenly before an EIP is being voted on?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9b5bpt",
                    "author": "juanbeaut",
                    "score": 1,
                    "created_utc": 1653040450.0,
                    "response": "He… looks almost healthy here?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i983w6q",
                    "author": "dropcodex",
                    "score": -3,
                    "created_utc": 1652980577.0,
                    "response": "No.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i97ruzd",
                    "author": "Fuzzy_Detective_4178",
                    "score": -2,
                    "created_utc": 1652975742.0,
                    "response": "You’ll never catch us",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}