{
    "subreddit": "CryptoTechnology",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uvpmc1",
            "title": "polygon or phantom",
            "url": "https://www.reddit.com/r/CryptoTechnology/comments/uvpmc1/polygon_or_phantom/",
            "author": "poor_doc_pure",
            "created_utc": 1653271055.0,
            "score": 1,
            "num_comments": 14,
            "subreddit": "CryptoTechnology",
            "selftext": "This is mostly a discussion. Since this is mostly a technical thread and doesn't have to do with prices I would like your opinion on which you consider the better coin and why. I have no technical background myself and I would like to have the opinion of people that are more knowledgeable about the technology of those coins.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9nfwp0",
                    "author": "Dormage",
                    "score": 3,
                    "created_utc": 1653282925.0,
                    "response": "A coin is a coin, therenis no metric given by which one would rank a coin. I guess the better coin is the one that serves you better then the other. \n\nUsualy we rank coins by using a common denominator called USD. Absent of that, you need to find another representation of value.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9nkrr2",
                            "author": "poor_doc_pure",
                            "score": 1,
                            "created_utc": 1653286530.0,
                            "response": "Oh you're right 😂 I mean which is better compared to the technology of each coin",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9nrifr",
                    "author": "cryptoskillz",
                    "score": 1,
                    "created_utc": 1653292228.0,
                    "response": "If you mean Fantom. Then both are centralised shitcoins. With polygon probably being more useful right now. If you are looking for security and decentralisation though, both addresses are wrong. Both coins are not what they pretend to be.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9nro4h",
                            "author": "poor_doc_pure",
                            "score": 2,
                            "created_utc": 1653292377.0,
                            "response": "What do they pretend to be, and what are they exactly ? Thanks for all your comments please keep up.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9nsk4j",
                                    "author": "cryptoskillz",
                                    "score": 2,
                                    "created_utc": 1653293206.0,
                                    "response": "Polygon is marketing itself as a Layer2, as a „Ethereum complementary“ when it’s another centralised L1, selling its native tokens at dumb Ethereum fanboys. Fraud.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9p9kks",
                                            "author": "BarSensitive8513",
                                            "score": 1,
                                            "created_utc": 1653324234.0,
                                            "response": "Oh you're right 😂 I mean which is better compared to the technology of each coin",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9o7b10",
                    "author": "Born_Slice_7809",
                    "score": 1,
                    "created_utc": 1653305761.0,
                    "response": "From a user's perspective, they are two separate networks that are used in the same way, offering the same experience considering they are both EVM compatible and have similar applications.\n\nFrom a technical side, on a high level, Polygon is a layer 2 scaling solution on Ethereum, while Fantom is its own independent network. Which approach is better is hard to say at this point in time.\n\nWith regard to their reputation, both projects had their ups, downs, and criticisms. With some questioning the Polygon's security model (Vitalik). While on Fantom side we had some drama in the past with one of the most popular dev leaving the project and the space in general (Andre).\n\nI hope this helps you get some direction.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9oaiof",
                            "author": "poor_doc_pure",
                            "score": 1,
                            "created_utc": 1653307839.0,
                            "response": "I know that Andre got burned out and quit",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9on8h4",
                    "author": "DigitalInvestments2",
                    "score": 0,
                    "created_utc": 1653314568.0,
                    "response": "I'm already invested in Polygon and Fantom but unfortunately I am in the red because I bought each around 1usd. Both are good buys IMO but if you want to 10x, you need to invest in new L1 chains before they get popular, like UTNP and CNDL. CNDL is also a metaverse project, which should pump well later this year when Facebook META launches.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}