{
    "subreddit": "CryptoCurrencies",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uxg919",
            "title": "DeFi Platform Lido Votes Against Supporting New Terra Blockchain",
            "url": "https://www.coindesk.com/business/2022/05/25/defi-platform-lido-votes-against-supporting-new-terra-blockchain/",
            "author": "Some_won",
            "created_utc": 1653481636.0,
            "score": 1,
            "num_comments": 1,
            "subreddit": "CryptoCurrencies",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uxgim9",
            "title": "Ethereum is widely known as the world computer, yet it still has almost the exact same block time as when it launched, this is like having a 2015 GPU trying to run CyberPunk 2077",
            "url": "https://www.reddit.com/r/CryptoCurrencies/comments/uxgim9/ethereum_is_widely_known_as_the_world_computer/",
            "author": "calisthenicslb",
            "created_utc": 1653482544.0,
            "score": 1,
            "num_comments": 0,
            "subreddit": "CryptoCurrencies",
            "selftext": "The otherside mint taught me and many others a few lessons; Ethereum is not ready for mass adoption, L2 rollups are the only thing helping it survive and people are sick of paying their kidneys in fees for the sake of good security. Good security should never cost this much, if it does, it means that your “World Computer” needs upgrades. And every singe upgrade needs 8 years of purity testing to go forward, and it’s not like Ethereum will get cheaper with the merge. \n\nThis has led many people, even Yuga Labs who dropped the otherside mint on ETH, to consider other chains, chains that will not break when you’re minting a 100,000 NFTs all at once. How do we fix this? We explore better alternatives until Ethereum catches up, and if it doesn’t, we’ll just congratulate it on the good run. I’ve been exploring AVAX since it launched, LUNA till it crashed, Polygon, and now Cartesi as they’ve literally built a blockchain OS on Linux VM. \n\nit’s super fun to see where crypto is heading, everyone is exploring literally every single coding language to build the perfect chain. This is great, it brings more people to the space, more institutional money for big firms that missed out on ETH, and will be a great catalyst to kicking off the bull market sooner than ever.",
            "stickied": false,
            "comments": []
        }
    ]
}