{
    "subreddit": "CryptoMarkets",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uxbe81",
            "title": "New startups are adopting DAOs due to their unconventional administrative structure",
            "url": "https://www.reddit.com/r/CryptoMarkets/comments/uxbe81/new_startups_are_adopting_daos_due_to_their/",
            "author": "totallyfvckedup",
            "created_utc": 1653460997.0,
            "score": 3,
            "num_comments": 8,
            "subreddit": "CryptoMarkets",
            "selftext": "DAOs are structured in a way that makes raising capital simple, transparent, and secure, and its mechanism gives investors the chance to support early-stage decentralized startup projects while sharing risks and profits collectively.\n\n\nNew companies can focus on growing and scaling their business, while also raising funds worldwide, onboarding new employees from everywhere across the globe. \n\n\nAs an investor, I would much rather put my money into a DAO based project over any other types of projects, because I have voting powers to choose where my funds should be invested, and community members collectively decide what’s the future of this project. \n\n\nThere’s a significant growth in the number of DAOs this year, and BitDAO is one of the contributors to this rise, because its community owns the world’s largest DAO directed treasury, and is using this treasury to support developers in building their DAOs. \n\n\nLooking at it, DAOs will be the driving force of decisions in the Web3 economy, and will soon democratize the internet.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9wsut9",
                    "author": "mr_birrd",
                    "score": 3,
                    "created_utc": 1653465584.0,
                    "response": "So you would rather let random guys who are in it for the money decide on a company's future than a group of people there with  business degree?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9yuodc",
                            "author": "sibov8",
                            "score": 1,
                            "created_utc": 1653503629.0,
                            "response": "lol because guys with business degrees aren't in it for the money? Let's be incredibly honest with ourselves here. Anyway with that being said the DAO OP mentioned is pretty solid.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9yxznl",
                                    "author": "mr_birrd",
                                    "score": 1,
                                    "created_utc": 1653504929.0,
                                    "response": "Noone would work like you have to usually without payment anyways that's not the point. I always found most arguments for DAOs pretty bad actually. I know there exist many companies with reckless people but thinking you can outsmart the internet and all businesses with a DAO run by \"to the moon\" mindset people who have no idea about law or economy sounds like a childs cute but stupid dream.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}