{
    "subreddit": "CryptoTechnology",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ut89z5",
            "title": "Market conditions aside, with the amount of money coming into crypto every single day. Money doesn’t matter nor does it make you special. We should be focusing on the tech and the talent instead.",
            "url": "https://www.reddit.com/r/CryptoTechnology/comments/ut89z5/market_conditions_aside_with_the_amount_of_money/",
            "author": "sibov8",
            "created_utc": 1652980612.0,
            "score": 1,
            "num_comments": 11,
            "subreddit": "CryptoTechnology",
            "selftext": "Why do we continue to focus on money inside the crypto space? DeFi has reached a point where there’s an absolute metric shit ton of money flowing through it. Having money doesn’t make you special and you know what the funny part is? Focusing on talent, building a sustainable project with people who know what the hell they’re doing is what’s going to be making you way more money than any get rich scheme. Way more money than the random VC who hit up a round of funding and made some money.\n\nI’d rather get into a proper damn project that has went through hackathons like bitDAO’s latest one over a random pump and dump project any damn day. Even if the former makes me more money in the short term. Money doesn’t mean shit anymore in this space. Since we’re on the topic of DAO’s I think they are the superior way of getting investment for your project, these places become a hub for talent, builders and community. To actually get to that point your project actually needs to be sustainable in the first place. Way too many fools are out here trying to make a quick buck when I’d rather support the long term. Would you rather make some money right now or an absolute metric shit ton of money later? I know what I’m going for.\n\nI'm sorry if my post seems a bit too ranty but I am quite frankly incredibly frustrated at everyone not being able to look past their own noses. Personally to me, the technology is insanely more important than any amount of money out there. The better we focus on building, the more money is going to naturally flow in. Please do correct me if I'm wrong, I'd love to hear it.",
            "stickied": false,
            "comments": [
                {
                    "id": "i98ngyx",
                    "author": "frank__costello",
                    "score": 7,
                    "created_utc": 1652988524.0,
                    "response": "Seems like lots of paid shilling for BitDAO these days...",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i993mso",
                    "author": "foozeball2468",
                    "score": 3,
                    "created_utc": 1652996120.0,
                    "response": "Money is all that's ever mattered. You want to give me yours?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i995x9l",
                    "author": "who-evun_karezz",
                    "score": 2,
                    "created_utc": 1652997156.0,
                    "response": "Money DOES matter. Wtf lol",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i98v1ix",
                    "author": "Nature_-1",
                    "score": 1,
                    "created_utc": 1652991645.0,
                    "response": "I couldn’t agree more. They’re lots of DeFi upgrades coming up daily and it’ll be easier if we focus on how well it can affect our life’s. \nOne fascinating upgrade is DEIP helping creators build business on web3",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9914nm",
                    "author": "RandomUser03",
                    "score": 1,
                    "created_utc": 1652994976.0,
                    "response": "What a revelation!  If only someone had mentioned this original thought before.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9abhzz",
                    "author": "Russianbot123234",
                    "score": 1,
                    "created_utc": 1653017930.0,
                    "response": "Because people invest for money ?? Like wtf are you even saying. People don't get into this for the tech. Maybe they stick around because they believe in the tech but everyone gets into crypto for money.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9aq1nf",
                    "author": "gumbangww",
                    "score": 1,
                    "created_utc": 1653027627.0,
                    "response": "There are a whole lot of developments in DeFi that deserve a lot of applause for their delivery. A good example is the smart contract Spool put in place to connect several yield protocols to a single user and deposit. I'm yet to initiate my yield farming strategies there, but it's really impressed me, most especially for its utilities and prominent pluses it brought into the space.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9b1djt",
                    "author": "pillow91aussie",
                    "score": 1,
                    "created_utc": 1653037400.0,
                    "response": "Enter ergo :)\nHttps://ergoplatform.org",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}