{
    "subreddit": "CryptoMarkets",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "usepta",
            "title": "Have you ever thought about what happens to your crypto when you pass away?",
            "url": "https://simpleswap.io/blog/what-happens-to-your-crypto-when-you-pass-away/?utm_source=reddit&utm_medium=social&utm_campaign=blog_cryptowhenyoupassaway_180522",
            "author": "SimpleSwapExchange",
            "created_utc": 1652885515.0,
            "score": 3,
            "num_comments": 1,
            "subreddit": "CryptoMarkets",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i93z8ln",
                    "author": "Frogmangy",
                    "score": 1,
                    "created_utc": 1652901561.0,
                    "response": "You take it with you like the egyptians did",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "usensp",
            "title": "Is it time to buy the dip?",
            "url": "https://www.newbiescrypto.com/p/time-buy-dip",
            "author": "SuDa2104",
            "created_utc": 1652885360.0,
            "score": 13,
            "num_comments": 15,
            "subreddit": "CryptoMarkets",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i92vyr9",
                    "author": "Ediotic12",
                    "score": 2,
                    "created_utc": 1652885617.0,
                    "response": "If you believe in something to invest in then the most reliable approach is dollar cost averaging. Otherwise, it’s really more of a gamble considering all the data points to more errors in prediction amongst analysts and financial gurus than successes.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i937gr8",
                            "author": "mrdeezy",
                            "score": 1,
                            "created_utc": 1652890341.0,
                            "response": "It depends who you are listening too. I never really understood reddits hate for technical analysis. My guess is that they are listening to idiot influencers instead of people who actually know what they are talking about.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i93a6du",
                                    "author": "Ediotic12",
                                    "score": 1,
                                    "created_utc": 1652891438.0,
                                    "response": "The data I’m referring to extends to less volatile financial markets. Humans aren’t really good at it",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i93bw9c",
                                            "author": "mrdeezy",
                                            "score": 1,
                                            "created_utc": 1652892128.0,
                                            "response": "its about  probabilities , some are better than others.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i96ufxd",
                    "author": "dvodelenup",
                    "score": 2,
                    "created_utc": 1652959882.0,
                    "response": "We may never have the right time to buy the dip because we all see things differently. However, before buying the dip, the project use case should be considered because not all projects have a good use case in the ecosystem. Railgun, for example, has been consistently innovative despite the market situation and still maintains a price range that makes it significant due to its strong fundamentals. If there are no hiccups in the way, ZEC might start a bullish run, and it wouldn't hurt to look at projects with strong fundamentals before buying.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i93nw57",
                    "author": "SN0WEAGLE73",
                    "score": 1,
                    "created_utc": 1652896933.0,
                    "response": "Nope",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i94ypmb",
                    "author": "adgebush",
                    "score": 1,
                    "created_utc": 1652916749.0,
                    "response": "It's the beat time to invest in upcoming and new projects.\n\nMy money is on KOL ,the token of an upcoming project called KOLnet that monetizes influencers through whitelists and token swaps for their social media marketing services.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i96v24e",
                            "author": "6uRku2va",
                            "score": 2,
                            "created_utc": 1652960272.0,
                            "response": "You have a valid point about investing in new and upcoming projects but the major challenge most time is the sustainability of those projects and that's why I did rather convert that money to stables and diversify them for yields at a minimized risk just as Spool does it and earn optimally while I use the returns to probably invest new and upcoming projects, but then, your opinion is still a good idea.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i97ascf",
                            "author": "nicholaux",
                            "score": 1,
                            "created_utc": 1652968555.0,
                            "response": "Getting early into any project is the best. At the moment, my focus is on Honeyland, and I'm trying to be as early as possible with it. I'm trying to get in on their genesis mint happening soon. What actually piqued my interest about this is the fact that it's risk free.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i953xcw",
                    "author": "dashingsweater",
                    "score": 1,
                    "created_utc": 1652919228.0,
                    "response": "Bear markets are made to DCA!   \n\n\nSmaller, regular investments will get you better average entry points than throwing all your money at this market thats swinging like a tether ball on a rope in zero gravity.   \n...tether reference intentional...",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i965imd",
                            "author": "geistirnd",
                            "score": 1,
                            "created_utc": 1652939261.0,
                            "response": "Indeed, DCA is more or less one of the best strategies in bear market. But I consider the strategies on Spool to be quite more beneficial: yield farming with stable coins in a diversified manner. Nothing to lose, yet steady returns.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9657sf",
                    "author": "Jacobsendy",
                    "score": 1,
                    "created_utc": 1652939040.0,
                    "response": "Buying the dip means different thing to different people. DCAing is still the best strategy to make the best out of bear markets like this. Interestingly, some altcoins seem to be doing quite well in terms of price actions. A good example is Railgun which has maintained a consistent price over the month. I believe it has something to do with innovations it just introduced to privacy in decentralized finance. MKR is another one that has stood out in the market. I believe it is more reasonable to spend on dips when a good resistance has been exhibited to an extent, especially for low and mid caps.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i96bhg6",
                    "author": "ActionParticular7697",
                    "score": 1,
                    "created_utc": 1652943972.0,
                    "response": "Access to good information is what we investors needs to progress financially and generally in life.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i96jbl4",
                    "author": "ShabbySuburb",
                    "score": 1,
                    "created_utc": 1652950997.0,
                    "response": "DCA I think at these levels is an ideal strategy   \n\n\n  \nI held a short position on bitcoin from 40k level and made several thousand on it on wowswap using 5x leverage. Nevertheless it was just a fiction to earn $$. I am a supporter of bitcoin and crypto in general and I continue to accumulate assets at current prices",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}