{
    "subreddit": "CryptoMarkets",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uxfzlc",
            "title": "Ripple’s CEO Explains What Crypto Needs Most to Survive After the UST Meltdown",
            "url": "https://www.reddit.com/r/CryptoMarkets/comments/uxfzlc/ripples_ceo_explains_what_crypto_needs_most_to/",
            "author": "SwapzoneIO",
            "created_utc": 1653480724.0,
            "score": 0,
            "num_comments": 6,
            "subreddit": "CryptoMarkets",
            "selftext": "The CEO of cross-border remittance company Ripple has shared some of the crucial roles of crypto and how the industry could stay afloat. He stated that transparency has become even more important with the recent “meltdown” of the UST stablecoin, Ripple CEO Brad Garlinghouse has pointed out. \n\nHe gave [Ripple and XRP](https://swapzone.io/currencies/ripple) as an example of transparent players in the industry, saying the two have done their best to be the “adult” in the financial sector.\n\nNow the crypto sector has, more than ever, attracted regulators’ scrutiny. Gary Gensler, chair of the US Securities and Exchange Commission (SEC), recently warned investors that other crypto assets could mimic Terra’s downfall. \n\nOn the other hand, Ripple, along with its executives Garlinghouse and Chris Larsen, continue to engage with the SEC in the one-and-a-half years-long law lawsuit. \n\nDo you believe that other crypto could follow the suit of Terra? \n\n[Source: blazetrends.com](https://preview.redd.it/hj63rj8h5m191.png?width=980&format=png&auto=webp&s=7975851c430e3203df0310cc8857209dd3ec8c55)",
            "stickied": false,
            "comments": [
                {
                    "id": "i9xcu64",
                    "author": "CointestAdmin",
                    "score": 1,
                    "created_utc": 1653481003.0,
                    "response": "XRP {{pros}} & {{cons}} and related info are in the collapsed comments below. Pros and cons will change for every new post.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}