{
    "subreddit": "CryptoTechnology",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uvlkuv",
            "title": "Blockcahin is pseudonymous, not anonymous and there’s a big difference",
            "url": "https://www.reddit.com/r/CryptoTechnology/comments/uvlkuv/blockcahin_is_pseudonymous_not_anonymous_and/",
            "author": "AdhesivenessDue652",
            "created_utc": 1653257568.0,
            "score": 49,
            "num_comments": 8,
            "subreddit": "CryptoTechnology",
            "selftext": "A lot of people, especially the newer crypto audience, are under the notion that crypto as a whole is anonymous and is that you can technically do whatever you want using crypto.\n\nI blame this on how Bitcoin was very popular back in the day with dr#g dealers and how it was basically the main currency used on Silk Road.\n\nBut the reality is, crypto is a VERY transparent market. In fact it’s even more transparent than banking considering that a lot of bank have bank secrecy like in Switzerland.\n\nCrypto is in fact, pseudonymous. Meaning that every single transaction you make can be traced back to your wallet, however no one can technically know who that wallet is for unless you accidentally make it identifiable or unless you use a platform with KYC.\n\nCrypto was created to enable fully transparent transactions yet protect the identity of users. And with Zero-knowledge technology seemingly taking over now, this couldn’t be closer than the truth.  \nZksync and Loopring have been focusing a lot of zero-knowledge and even new L1s like Concordium are focusing a lot on their users’ privacy through integration zk proofs directly onto their chain.  \nHbar has been focusing a lot of protecting their users identity as well\n\nBlockchain technology can’t be a thing if addresses are anonymous cause then consensus can’t be achieved. You have to always keep track of all transactions or else there’s no use for crypto.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9mad0r",
                    "author": "Gonbatfire",
                    "score": 11,
                    "created_utc": 1653260220.0,
                    "response": ">Blockchain technology can’t be a thing if addresses are anonymous cause then consensus can’t be achieved. You have to always keep track of all transactions or else there’s no use for crypto.\n\nSo wrong, Monero (XMR) is a completely opaque blockchain that's been around for 8 years, and it's the #1 currency on the dark net (so that gives you an idea of how private it really is hah!)\n\n[What is Monero? by Whiteboard Crypto](https://www.youtube.com/watch?v=B7sLnmlZ-kU&t=310s)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9m8ghv",
                    "author": "DragonSided-D",
                    "score": 15,
                    "created_utc": 1653259250.0,
                    "response": "One word: **Monero**\n\nIt’s anonymous, not pseudo.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9mkh2u",
                            "author": "holomntn",
                            "score": 5,
                            "created_utc": 1653265520.0,
                            "response": "Technically it isn't.\n\nTechnically Monero is polypseudonymous. \n\nBasically Monero relies on not being able to link the polynyms. Making it anonymous for some purposes. \n\nTo see how such polypseudonymous behavior is different from anonymous, picture yourself standing in a shop, on camera, transacting with Monero. Doing that you are very clearly NOT anonymous.\n\nIt is a subtle distinction, but when it comes down to the very limit, that difference can make a difference.\n\nEdit: this is the same kind of distinction as TOR and other onion routing systems actually being group pseudonymous, rather than anonymous. The distinction matters, but only when it matters.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9mq4br",
                                    "author": "Gonbatfire",
                                    "score": 1,
                                    "created_utc": 1653268465.0,
                                    "response": "What would be an example of true anonymousness? Because by that logic, cash is not anonymous either as you can be seen using it",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9mr2re",
                                            "author": "holomntn",
                                            "score": 1,
                                            "created_utc": 1653268949.0,
                                            "response": "That's always a struggle because true anonymity may not be possible. \n\nTrue anonymity would mean that it could be truly any person. But if something is written then obviously it is someone that can write and that isn't everyone. \n\nThat's a continual problem. \n\nWe commonly think of anonymity in loose terms, so DB Cooper is \"anonymous\" but Wikipedia has a relatively short list of suspects. The zodiac killer is \"anonymous\", but there's a short list of potential people (although it could be argued pseudonymous since they gave their name in code).\n\nOn a more positive note the Federalist Papers were published \"anonymously\" but the authors are now known to be Hamilton, Madison, and Jay, in spite of an earlier effort to make them pseudonymous.\n\nIt's not until you get to things so old that the records have been lost to time that anonymity exists. So the first farmer is anonymous, but only because there is no way of tracking anything about them.\n\nTrue anonymity is really hard and may be impossible.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9mlpqx",
                    "author": "yersinia_p3st1s",
                    "score": 2,
                    "created_utc": 1653266179.0,
                    "response": "Correction, most blockchains are not anonymous. Definitely not all.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}