{
    "subreddit": "CryptoTechnology",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uzpxbm",
            "title": "Zero-Knowledge Proofs are taking privacy on blockchain to the next level",
            "url": "https://www.reddit.com/r/CryptoTechnology/comments/uzpxbm/zeroknowledge_proofs_are_taking_privacy_on/",
            "author": "J-59",
            "created_utc": 1653752611.0,
            "score": 1,
            "num_comments": 8,
            "subreddit": "CryptoTechnology",
            "selftext": "One of the most prominent solutions to achieve the requirements for transaction confidentiality, are ZK Proofs, since they can prove to the verifier that they know the value x in the world of cryptography, without disclosing any other information apart from the fact that they know the value of x.\n\n\nZero-Knowledge proof is able to transmit information like authentication with better security, to build a secure channel for the users without revealing anything unnecessary to avoid data leakage. \n\n\nPolygon is one of the first blockchains to integrate ZKP by introducing Polygon ID,  scalable blockchain ID with ZK-based privacy. Polygon ID is decentralized, private by default, offers on-chain verification and permissionless attestation. \n\n\nI personally think that blockchains with ZK Proofs are the perfect fit for enterprise use, mainly because they can do business and conduct transactions without revealing any type of info. \n\n\nAfter doing some research I learned that ZK Rollup is actually better than Optimistic Rollup, since they’re solving fundamentals issues with Optimistic like eliminating a nasty tail risk, reducing withdrawal times, enabling fast transaction confirmations and exits in practically unlimited volumes, and introducing privacy by default.",
            "stickied": false,
            "comments": [
                {
                    "id": "iabsd28",
                    "author": "Simple_Yam",
                    "score": 26,
                    "created_utc": 1653754801.0,
                    "response": "Please god someone stop the polygon bots that spam this sub with posts.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iach20u",
                            "author": "Mathie7",
                            "score": 4,
                            "created_utc": 1653766517.0,
                            "response": "yup. one look at his comment history is allllll about MATIC",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iadih3k",
                    "author": "dvodelenup",
                    "score": 1,
                    "created_utc": 1653785112.0,
                    "response": "Privacy is something all humans instinctually value and I love the fact that through zero-knowledge proof tech, projects are making sure that users enjoy privacy when making transfers, trading, using leverage platforms, adding liquidity, or using dApps, Railgun really makes this more realistic and workable after it's recent launch on Polygon, Ethereum and BSC mainets. Great innovation that I will really love to see more of it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iac1zh0",
                    "author": "Sorry_Attitude_",
                    "score": -5,
                    "created_utc": 1653759305.0,
                    "response": "Okay but do we really want a privacy rollup shit in a chain meant to be permissionless and that should requires no trust ?\n\nYou literally take the \"no need to trust it\" part out of the equation, it requires trust to use a privacy chain, no one knows who and what they accumulate, it just becomes the USD all over again, no one knowing how much anyone owns, just speculations, the one day they drop a bag and ruin you because you didnt know they could\n\nPrivacy shit is so ridiculous, Hope Ethereum, Kadena and Algorand never pick this up as a basis\n\nGoes against anything blockchain, making a trustless system need trust",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iac3xtf",
                            "author": "Hippyx420x",
                            "score": 1,
                            "created_utc": 1653760239.0,
                            "response": "\"Trust\" the blockchain if you know how to use its features.  \n\nI wouldn't trust you.\n\nI trust myself more even with all my faults.\n\nI only do transactions with people I know or Dexes (that I trust).  \n\nIf I don't trust you why the fuck would you care if I want all my assets hidden?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iafwl9x",
                                    "author": "Sorry_Attitude_",
                                    "score": 1,
                                    "created_utc": 1653841082.0,
                                    "response": "how would you know the chain works as intended?\n\nHow would you know the chain did not get hijacked?\n\nHow do you know that a whale isn't using the chain just to dump on you?\n\nYou cannot trust something you cannot see, which the rollup hides\n\nYou end up with a game of hope and belief instead of \"trustlessness\" that someone isnt big enough to throw it on you or use you and the chain maliciously \n\nPeople cried about the lack of transparency of the government and started using crypto for it's very transparent technology that you don't need to hope in to not crash you\n\nthen created privacy chains that have the exact same problem as the government, the lack of transparency to check what is happening. Or what the true numbers and statistics are\n\nYou can boo as much as you want. It doesn't make it any less true\n\nIf you want any kind of trustless system, stick with L1's. Hope Ethereum sticks to full transparency along with all other chains like Kadena, Algorand, Near and whatever other new gen stuff there is",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}