{
    "subreddit": "CryptoMarkets",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "utbcxb",
            "title": "Do you think there's any chance of LUNA/UST rebounding from the latest situation?",
            "url": "https://www.reddit.com/r/CryptoMarkets/comments/utbcxb/do_you_think_theres_any_chance_of_lunaust/",
            "author": "Huge-Paint4923",
            "created_utc": 1652989147.0,
            "score": 1,
            "num_comments": 8,
            "subreddit": "CryptoMarkets",
            "selftext": "Do Kwon, the CEO of Terralabs, the company that created the terra blockchain, UST, and Luna, believes he has a solution. He recently proposed a Terra blockchain hardfork, which requires creating a new copy of the network with significant upgrades. The new blockchain will be absent of the algorithmic stablecoin and will feature a billion Luna tokens, which will be issued to current Luna and UST holders and used to encourage the development of new Terra apps. Do you even know what's the difference between algorithmic and non-algorithmic stablecoins? I'll link it [here](https://www.coindesk.com/learn/algorithmic-stablecoins-what-they-are-and-how-they-can-go-terribly-wrong/).  \n\n\nThey lost a lot of money in the crisis, which exposed the weakness of various cryptocurrencies and algorithmic stablecoins. Although the proposed approach may help Terra, many investors are already doubting the credibility of other stablecoins. They still have a long way to go before garnering the trust of the public. Do you think this could be the end of stablecoins?  \n\n\nOther algorithmic stablecoin initiatives may have learned something from the disaster. Other initiatives are taking precautions to avoid ending up in the same situation as Terra. The Tron DAO Reserve, for example, increased its reserves by purchasing millions in TRX, Bitcoin, and Tether to defend USDD, its stablecoin. Is it the time for exchanging your stablecoins for other currencies like ETH, BTC, etc? ETH can always be used for NFTs from communities like BAYC, High Sloth Society, etc. so it seems like a good option. BTC on the other hand is the currency that keeps driving the whole market with it, so it can be a good option too. Do you believe in stablecoins, or will you switch to other currencies considering the situation?",
            "stickied": false,
            "comments": [
                {
                    "id": "i98pl0k",
                    "author": "CointestAdmin",
                    "score": 1,
                    "created_utc": 1652989402.0,
                    "response": "Terra(LUNA) {{pros}} & {{cons}} and related info are in the collapsed comments below. Pros and cons will change for every new post.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9a1mvy",
                    "author": "KryptoSC",
                    "score": 1,
                    "created_utc": 1653012801.0,
                    "response": "No. Many people are going to stay away from any crypto project he touches.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9adtur",
                    "author": "JayAkeemtheProfit",
                    "score": 1,
                    "created_utc": 1653019282.0,
                    "response": "I think so. A cent is possible but there's too much conflicting information on what they're going to do as far as fork or burn. I don't think it'll ever get back to it's former glory but it might make a decent rally to recoup some losses for old investors and a pump and dump for the new investors.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9asqsw",
                    "author": "totallyfvckedup",
                    "score": 1,
                    "created_utc": 1653029777.0,
                    "response": "not really, but this should teach other projects about the importance of diversifying their treasury, take BitDAO as an example, since its holding BIT, ETH, SUSHI, USDC, USDT, and FTT in its treasury",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9b5cnw",
                    "author": "SkiZer0",
                    "score": 1,
                    "created_utc": 1653040472.0,
                    "response": "Yes, because people are fucking idiots.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}