{
    "subreddit": "CryptoMarkets",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "trrc1h",
            "title": "Most innovative crypto projects. What's piquing your interest rn fellas?",
            "url": "https://www.reddit.com/r/CryptoMarkets/comments/trrc1h/most_innovative_crypto_projects_whats_piquing/",
            "author": "PurpleCold5905",
            "created_utc": 1648592916.0,
            "score": 72,
            "num_comments": 182,
            "subreddit": "CryptoMarkets",
            "selftext": "In building a bullish case for a crypto company most people tend to start (and stop) with whitepapers and roadmaps. A new project gets launched and pumped up by a couple whales, speculation gets amplified, personalities are hyped along with their projects, and a few months down the line it usually all ends up in tears ($TIME, et al.)\n\nBeyond all the mess and fake hype, I believe there are innovative projects with ironclad fundamentals that tend to fly under most people's radars.\n\nAmong my new favorites, I'm bullish on [Zebec.io](https://Zebec.io) , a continuous settlement protocol that allows for real-time continuous streams of payments. Also very bullish on [liquality.io](https://liquality.io), a multi-chain \"superwallet\" with one-lick atomic swaps that makes Metamask (and their support team) look like hot gabage.\n\nCurious to find out what under-the-radar projects everyone is currently bullish on.\n\n&#x200B;\n\nPlease, no nft's or \"node\" projects\n\nEdit: Ty so much for all the suggestions. Lots of great projects to go through!",
            "stickied": false,
            "comments": [
                {
                    "id": "i2nxe25",
                    "author": "atlaswingpasaway",
                    "score": 22,
                    "created_utc": 1648606257.0,
                    "response": "I'm a software engineer (but a beginner in blockchain development) and interested in new ideas on digital wallets.\n\nThis lead me to RadixDLT (XRD). Since the project allows developers to use XRD's defi libraries and the Radix Engine to build their own DApps, it opens up a world of innovation from people with ideas. More developers contributing, more potential to find gems. I like to use Scrypto (to learn for now) for accessing Radix engine because it is written in Rust language and documentation is just \\[chef's kiss\\].\n\nThis is just an oversimplification but it is very robust and I'm definitely looking forward to that project's future and the developers using their ecosystem like myself.\n\nAnother gem which is very new but will offer another neat wallet idea is RoboInu Finance (RBIF). The person who started it was an ex-Google developer, and passed to an experienced software project lead, and she's been kicking ass, in my opinion. Since I'm really into community and collaboration, RBIF's culture has captured my interest. It's not about hyping, it's not about pumping, but about nourishing the community by continued support and offering solutions. RBIF has a special place in my heart. lol\n\nThe 2 products/solutions I'm very interested about are their flagship RoboWallet and RoboLaunchpad (which aligns with my interest for collaboration).\n\nRadixDLT is already a mature project while RoboInu Finance is still very very new. I think financially, you can gain a lot from RBIF in a year or 2. ;)",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i2pl030",
                            "author": "nzubemush",
                            "score": 3,
                            "created_utc": 1648645658.0,
                            "response": "Did they really have to name is roboINU🙈",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i2q9bhk",
                                    "author": "Locko_O",
                                    "score": 3,
                                    "created_utc": 1648655918.0,
                                    "response": "With a meme name I instantly think that coin has no tech value and is just a money grab",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i2rcu7z",
                                            "author": "atlaswingpasaway",
                                            "score": 3,
                                            "created_utc": 1648671469.0,
                                            "response": "understandable. inu is very overused by projects that end up being cash grabs, that people will instantly dismiss new coins with inu in the name.\n\ni'm pretty ok with my investment on it, but from what i've seen so far, it is really different. i am currently learning blockchain dev and soon i'll reach out to them to see if i can contribute to the project and i will let you know how it goes.\n\nRemindMe! 3 months",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i2rczhu",
                                                    "author": "RemindMeBot",
                                                    "score": 1,
                                                    "created_utc": 1648671526.0,
                                                    "response": "I will be messaging you in 3 months on [**2022-06-30 20:17:49 UTC**](http://www.wolframalpha.com/input/?i=2022-06-30%2020:17:49%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/CryptoMarkets/comments/trrc1h/most_innovative_crypto_projects_whats_piquing/i2rcu7z/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2FCryptoMarkets%2Fcomments%2Ftrrc1h%2Fmost_innovative_crypto_projects_whats_piquing%2Fi2rcu7z%2F%5D%0A%0ARemindMe%21%202022-06-30%2020%3A17%3A49%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20trrc1h)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i2qxu1v",
                                            "author": "leon6677",
                                            "score": 2,
                                            "created_utc": 1648665595.0,
                                            "response": "This",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i2qszno",
                            "author": "JAK1988",
                            "score": 1,
                            "created_utc": 1648663682.0,
                            "response": "Do you have opinions on RAD? I recall this has a large developer use case and following. Curious.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i2rd1v5",
                                    "author": "atlaswingpasaway",
                                    "score": 1,
                                    "created_utc": 1648671553.0,
                                    "response": "no i don't, but i will look into that as well. thank you!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i2oi1kh",
                    "author": "datrunig",
                    "score": 12,
                    "created_utc": 1648617433.0,
                    "response": "IOTA.\n\nAll I can say for certainty is It's not some Shiba or Inu spin-off. The amount of different Inu shill posts in here is crazy.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i2z83y6",
                            "author": "tojasma",
                            "score": 2,
                            "created_utc": 1648818095.0,
                            "response": "i thought i was the only dude who frowned at memes and the current trend in Inu clones. I would opt time and time again for projects with great USPs or hit launchpads like KOLnet which are credible for launching projects that will go parabolic and maintain same trend.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i2q4syt",
                            "author": "BHN1618",
                            "score": 1,
                            "created_utc": 1648654093.0,
                            "response": "What does it do?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i2s8hiw",
                                    "author": "Russianbot123234",
                                    "score": 1,
                                    "created_utc": 1648685065.0,
                                    "response": "It aims to be a smart contract L1 chain similar to Ethereum except it uses a different consensus mechanism called DAG. Currently, it's centralized and working to become decentralized. I don't know a ton about it but I know those things. If it works it should be able to handle a lot of TPS.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i2p21yf",
                    "author": "Cbizztho",
                    "score": 9,
                    "created_utc": 1648633618.0,
                    "response": "this thread is sketchy af.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i2nbpgi",
                    "author": "RednBlackEagle",
                    "score": 7,
                    "created_utc": 1648596252.0,
                    "response": "Zenon Network. Basically a potential new scaling layer for native Bitcoin which doesn‘t have the shortcomings of the Lightning Network",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i2ngzzz",
                            "author": "PurpleCold5905",
                            "score": 3,
                            "created_utc": 1648598659.0,
                            "response": "Wasn't the lighting network suppose to take over defi this year??",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i2q4w1y",
                                    "author": "BHN1618",
                                    "score": 2,
                                    "created_utc": 1648654129.0,
                                    "response": "They moved tether on it but really lightning will take off when RGB protocol starts being deployed",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i2opr59",
                    "author": "Adi_Gee",
                    "score": 6,
                    "created_utc": 1648623049.0,
                    "response": "rbif easy",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i2p0zes",
                    "author": "Responsible-Comb-317",
                    "score": 11,
                    "created_utc": 1648632687.0,
                    "response": "Levolution, It's a new tokenization platform. You guys should check it out",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i2nqj0r",
                    "author": "sassyfras12345",
                    "score": 25,
                    "created_utc": 1648603082.0,
                    "response": "I’m an $RBIF holder, happy to see it recommended here. Ms. Vy, the lead dev knows her stuff and has connections in all the right places. She is building utility and not interested in getting a hype pump. The hype will come when the utility is delivered and the utility will carry the project into the long term. \n\nThe first prototype of the Robo wallet is anticipated in April. The big point of differentiation with Robo wallet is that it will support cross border transactions. Send crypto and have the recipient receive fiat in their native currency!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i2o5vyx",
                            "author": "pushpraj153",
                            "score": 4,
                            "created_utc": 1648610426.0,
                            "response": "RBIF is looking great. As you mentioned pretty exciting things planned ahead. Robo Wallet is going to be a game changer.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i2p3xfn",
                            "author": "Zealousideal_Key368",
                            "score": 2,
                            "created_utc": 1648635182.0,
                            "response": "0 score on token sniffer 🧐",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i2p9wf8",
                                    "author": "dpflep",
                                    "score": 5,
                                    "created_utc": 1648639503.0,
                                    "response": "RBIF? It’s got a 100 score on token sniffer.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i2nylkt",
                    "author": "Myrefly23",
                    "score": 4,
                    "created_utc": 1648606835.0,
                    "response": "Nano is innovative. Already reached its max supply, no inflation, no transaction fees. It does its job filling the role as currency better than Bitcoin.\n\nI still think BTC will succeed, mind you, but Nano is the sleeper I dream about.\n\n* Baghold BTC because of the unreasonable hype and media attention securing it at #1.\n* Baghold Nano because it's actually what we should be using as a global currency.\n* Don't Baghold Monero. Because I don't have any. Stop asking, IRS!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i2q55ie",
                            "author": "BHN1618",
                            "score": 2,
                            "created_utc": 1648654236.0,
                            "response": "What are the improvements? Is it immutable? Is it pow or pos?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i2qu03n",
                                    "author": "Myrefly23",
                                    "score": 1,
                                    "created_utc": 1648664082.0,
                                    "response": "https://www.reddit.com/r/CryptoCurrency/comments/tp0qcc/at\\_first\\_i\\_thought\\_nano\\_was\\_too\\_good\\_to\\_be\\_true/",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i2qu3an",
                                    "author": "NanoNerd99",
                                    "score": 1,
                                    "created_utc": 1648664117.0,
                                    "response": "nano is eco-friendly (no mining), completely feeless (0 fees wallet to wallet), and transactions settle in less than a second\n\nan example of adoption happening: a cannabis payments company (the square of cannabis - Flowhub) is working on implementing nano as a base layer solution for a product they call Flowhub Cash",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i2nzp7y",
                    "author": "Extreme-Cup1969",
                    "score": 15,
                    "created_utc": 1648607363.0,
                    "response": "I too think the robowallet from RBIF will be a game changer.  I love the idea of being able to convert crypto to any native fiat without the mess of exchanges or uniswap.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i2nw6w2",
                    "author": "MisanthropeSPE",
                    "score": 3,
                    "created_utc": 1648605688.0,
                    "response": "DFK $JEWEL, Insane team and vision, about to launch onto AVAX tomorrow after a very successful time on Harmony since last August, big future in my opinion.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i2o9jyz",
                            "author": "divisionibanez",
                            "score": 3,
                            "created_utc": 1648612362.0,
                            "response": "Massive hype right now, and these guys deliver. So vocal and connected to the community. Very transparent. Rock solid development that gets constant updates, released almost entirely bug free. They’re giving out grants for developers to build on chain, etc etc. just huge.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i2o6gt7",
                            "author": "nvrwhere",
                            "score": 3,
                            "created_utc": 1648610724.0,
                            "response": "Came here to see this",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i2q51ov",
                            "author": "BHN1618",
                            "score": 2,
                            "created_utc": 1648654193.0,
                            "response": "What's their use case?",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i2okuco",
                            "author": "-malignant-",
                            "score": 1,
                            "created_utc": 1648619345.0,
                            "response": "I read of one person mentioning selling the hype and coming back on the cooldown",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i2o6n90",
                    "author": "yungaparteid",
                    "score": 4,
                    "created_utc": 1648610818.0,
                    "response": "Do you let own research and come to your own conclusions, everyone here will just shill some bullshit they have an investment in regardless of it’s legitimate or not",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i2q5h6g",
                            "author": "BHN1618",
                            "score": 1,
                            "created_utc": 1648654365.0,
                            "response": "Yeah I read a few comments that seemed too similar",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i2ojxh5",
                    "author": "Andrieu",
                    "score": 3,
                    "created_utc": 1648618708.0,
                    "response": "TRAC - Solid project, team, real deployed use cases, polkadot integration and much more, look it up.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i2nqne8",
                    "author": "Creamysense",
                    "score": 7,
                    "created_utc": 1648603139.0,
                    "response": "LUNA, KDA and Harmony ONE. All are unique in their own right and trying to solve the scalability problem.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i2pp2rq",
                            "author": "alertthenorris",
                            "score": 1,
                            "created_utc": 1648647565.0,
                            "response": "Love me some ONE, can't wait to see price movement though.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i2ndt6x",
                    "author": "Elite_rican",
                    "score": 17,
                    "created_utc": 1648597195.0,
                    "response": "Check out Robo Inu Finance! It is a solid project with LOTS of potential. The dev team is super transparent and rewards you for holding the coin. One way they reward you is through reflections, another way is by the big air drop coming when we hit 5K holders. Everyone with $500 will receive a $100 airdrop, everyone with $1000 will receive a $200 airdrop, and finally everyone with $1500 will receive a $300 airdrop. It sounds crazy but that’s just how much the developers care about the project and it’s growth. \nIn order to receive the airdrop, you must purchase RBIF through a wallet, not bitmart. There is so much more to talk about but just do your own research and feel free to ask me anything! RBIF!!!🚀🚀🚀",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i2ngseu",
                            "author": "PurpleCold5905",
                            "score": 13,
                            "created_utc": 1648598563.0,
                            "response": "Pitched received ;) However, where are they leading innovation?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i2nnmv0",
                                    "author": "Dizzy_Parsley_1648",
                                    "score": 18,
                                    "created_utc": 1648601736.0,
                                    "response": "Think about it like a built in software for managing your finances, tracking your expenses and managing crypto taxes. In addition to the innovative fintech properties allowing for cross border transfer from crypto to cash.\n\nWe are leading innovation also in being the first coin to exclusively donate toward NASA and SpaceX exploration projects. \n\nRobo Inu is where Fintech Innovation Meets Space Exploration. 🚀🌚 \n\n“RoboWallet is a mixed concept of Venmo and SAP concur platforms, which is developed to allow users to send cryptocurrency from one country to another while also helping users track and manage these transactions as a type of expense. They often mention the term \"financial freedom\"; however, the meaning of financial freedom is sometimes forgotten. With Robo Inu Finance, to achieve financial freedom, they must track all their daily expenses ranging from food, travel or gas, etc.”",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i2nlesk",
                                    "author": "Elite_rican",
                                    "score": 14,
                                    "created_utc": 1648600713.0,
                                    "response": "I like to think this project has lots of innovation! We have many new things coming such as robo wallet, robo launchpad, roboventures, roboNFT marketplace, partnerships and so much more. In our white paper you can find a roadmap with all sorts new things coming that will help the project grow. Like I said above, the dev team is very transparent and listen to the communities wants and needs! It’s an amazing project.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i2nmuoo",
                                    "author": "Dizzy_Parsley_1648",
                                    "score": 15,
                                    "created_utc": 1648601373.0,
                                    "response": "Robo Inu Finance Aims to Create a New Era of Payment Methods Using the Fintech Industry\n\nhttps://finance.yahoo.com/news/robo-inu-finance-aims-create-072900231.html",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i2nqjns",
                                    "author": "412electricboogaloo",
                                    "score": 4,
                                    "created_utc": 1648603090.0,
                                    "response": "OP, I'm invested in this community. What questions/critiques would you have for the devs?",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i2o6n5l",
                                    "author": "CommanderCream314",
                                    "score": -2,
                                    "created_utc": 1648610817.0,
                                    "response": "Shitcoin",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i2ppfgy",
                            "author": "alertthenorris",
                            "score": 4,
                            "created_utc": 1648647721.0,
                            "response": "Man, everything sounds good about this coin but the name. Anything Inu is a no go for me.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i2nrna4",
                            "author": "Adventurous_War6429",
                            "score": 11,
                            "created_utc": 1648603601.0,
                            "response": "Robo inu 🚀🚀🌙",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i2nmgds",
                    "author": "Friendly_Switch_4806",
                    "score": 11,
                    "created_utc": 1648601196.0,
                    "response": "I’ve recently bought into Robo Inu. Solid organic growth over last month or so. CEO Ms Vy is top rate and keeps everyone informed of developments. Very confident on this project and would recommend people look at the AMAs they’ve done on YouTube to get an understanding of its potential.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i2njvu6",
                    "author": "PPMM95",
                    "score": 2,
                    "created_utc": 1648600007.0,
                    "response": "Navcoin's BlsCT privacy protocol",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i2sjg1p",
                            "author": "geistirnd",
                            "score": 1,
                            "created_utc": 1648690044.0,
                            "response": "Privacy protocol? Not sure I've heard of it. \n\nRailgun privacy project seems like the major PriFi project that's standing out at the moment. Most of the privacy protocols I know including Monero requires that you exchange into another token before you stay anonymous. With Railgun, you can literally decide not to buy the token, and yet, you will still get the best of the system in privately and anonymously transacting altcoins and NFTs. \n\nAny chance Navcoins does anything similar? My eyes are quite open to promising protocols at the moment",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i2tmp4u",
                                    "author": "PPMM95",
                                    "score": 1,
                                    "created_utc": 1648713759.0,
                                    "response": ">Privacy protocol? Not sure I've heard of it. \n\nYep, self developed protocol that does not require a trusted set up. Is scalable and allows for the creation of private NFT's and private custom tokens.\n\n>Railgun privacy project seems like the major PriFi project that's standing out at the moment. Most of the privacy protocols I know including Monero requires that you exchange into another token before you stay anonymous. With Railgun, you can literally decide not to buy the token, and yet, you will still get the best of the system in privately and anonymously transacting altcoins and NFTs. \n\nIt uses a zksnarks variant, thus a trusted set up. \nNot a fan of that, I like to keep my transactions trustless even more so when it comes to private transactions.\n\nIt also doesn't need it's own token, like you said it's a privacy layer on top of your 'normal' network without having to swap to another token, so why is there another token? \n\nI think we both know why.\n\n\n>Any chance Navcoins does anything similar? My eyes are quite open to promising protocols at the moment\n\nNot really, Navcoin is it's own L1 created in 2014.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i3a71vx",
                                            "author": "geistirnd",
                                            "score": 1,
                                            "created_utc": 1649027078.0,
                                            "response": "Actually, Railgun is the most trust-less and permission-less privacy protocol I have seen so far in my search. \n\nWith regards to swapping to another token, I believe you know about Monero. You literally can't keep your assets anonymous unless you swap to XMR. In Railgun, the token is a governance token and you can make transactions without buying or swapping to the token. By any chance if you are privacy enthusiast like I am, it's worth checking. \n\nYou mentioned something about private NFTs. That's super rare, even in the privacy sector at the moment.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i2qxqni",
                    "author": "leon6677",
                    "score": 2,
                    "created_utc": 1648665557.0,
                    "response": "I would never buy any coin with the word “inu” in it lol fools",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i2r3cag",
                    "author": "Blocks_and_Chains",
                    "score": 2,
                    "created_utc": 1648667754.0,
                    "response": "One of the best for innovations is the Ocean Protocol.\n\nThis DataFi project is one of the leaders in WEB3 development, the issuer of OCEAN coin and H2O stablecoin.\n\nMaybe the most important part of this project is their OceanDao, community voting, which already funded more than 200 new DeFi projects.\n\nThe Ocean is a really important crypto project with a bright future...",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i2ns77i",
                    "author": "sassyfras12345",
                    "score": 4,
                    "created_utc": 1648603851.0,
                    "response": "I’m also eagerly anticipating the launch of Coyote Coin. This project is one that everyone will wish they had gotten into early. \n\nThe utility is being kept guarded so that no one tries to steal their idea, but there have been enough hints to understand that it will revolutionize crypto. \n\nThe two big things they set out to address are. \n\n1. The complexity of entering the crypto market for someone who has no knowledge about it. They will be the Apple of crypto. Make it so that a 75year old can easily be aware of projects and invest in them. \n\n2. Whale manipulations. How frustrated are we as retail investors to see whales draining profits over and over again. They hurt the chart. Well, Coyote Coin is implementing a Harpoon Tax to discourage whale dumps. If any wallet tries to sell more than 5% of the previous 24hr trading volume, the sell tax gets ratcheted up to about 33%, with 10% of that getting redistributed to holders.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i2o6b3l",
                            "author": "CHunter_ONE",
                            "score": 6,
                            "created_utc": 1648610642.0,
                            "response": "🐺🚀",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i2q1m1x",
                            "author": "Substantial-Act-7389",
                            "score": 3,
                            "created_utc": 1648652811.0,
                            "response": "So excited for this project. The devs and community are second to none.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i2o6uv6",
                            "author": "CommanderCream314",
                            "score": -3,
                            "created_utc": 1648610931.0,
                            "response": "Shit coin",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i2nuyba",
                    "author": "cannon8195",
                    "score": 5,
                    "created_utc": 1648605107.0,
                    "response": "Omfg not a robo inu infestation",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i2nvo53",
                            "author": "RagnarsKneecap",
                            "score": 3,
                            "created_utc": 1648605444.0,
                            "response": "It's all they do lol",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i2obpzo",
                    "author": "TrippyTiger69",
                    "score": 4,
                    "created_utc": 1648613571.0,
                    "response": "LRC",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i2n85ko",
                    "author": "ribikerbf",
                    "score": 3,
                    "created_utc": 1648595725.0,
                    "response": "Venice Finance by far is the most interesting project out right now. They are working with zk proofs and developing bulletproofs. I would say they are heavily sleep on at the moment",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i2ngwa0",
                            "author": "PurpleCold5905",
                            "score": 1,
                            "created_utc": 1648598611.0,
                            "response": "Ty for the recommendation",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i2tyn2v",
                            "author": "albwmenni",
                            "score": 1,
                            "created_utc": 1648723761.0,
                            "response": "Zk proofs are really great for users that still value privacy or any degree of anonymity in this space and innovations with it always catch my attention. Another keeper for me is Railgun which uses zksnarks to give privacy on chain transactions and is working on a relayer network as well. Like you said, these platforms are still being slept on.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i2p2d7z",
                    "author": "Technical-Leg7891",
                    "score": 3,
                    "created_utc": 1648633884.0,
                    "response": "Robo inu finance",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i2nvm1c",
                    "author": "biketourthrowaway",
                    "score": 2,
                    "created_utc": 1648605417.0,
                    "response": "Holy shit, can you say paid shills?\n\nOriginTrail is my pick every time - they are building something totally unique (decentralized knowledge graph), have some of the most impressive partners in the space (DKG is being used by numerous fortune 500 companies), and they are about to hit the big stage (they will be in the next round of parachain auctions).\n\nTRAC is about to go on a LINK-tier run and no one is paying attention yet.\n\nCommunity resources explaining the project:\n\nwww.origintrailexplained.info\n\nwww.tracdeepdive.info\n\nwww.origintrail.club",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i2omx5t",
                    "author": "New_Locksmith_4725",
                    "score": 2,
                    "created_utc": 1648620873.0,
                    "response": "$AZERO - sick team pushing near zero latency finality with absurd TPS, all under a privacy layer, built on substrate for interoperability. Multiple bridges incoming etc. Whilst not a blockchain but rather a DAG, it can operate as a parathread on Polkadot ecosystem.\n\nThis is really the cutting edge in terms of speed and finality in 2022. Very exciting project.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i2oai49",
                    "author": "Dig_Bick_reread",
                    "score": 1,
                    "created_utc": 1648612890.0,
                    "response": "Scrt network",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i2pgpn8",
                            "author": "6uRku2va",
                            "score": 4,
                            "created_utc": 1648643483.0,
                            "response": "I usually look forward to Secret network and Tornado privacy protocols, but Railgun sticks out for me right now.\nWhen it comes to privacy, the project has ticked all the boxes for me, especially in terms of DeFi integration and multichain use.\n\nSo, when it comes to innovative projects Railgun privacy protocol is piquing my interest in privacy.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i2vpa67",
                                    "author": "Dig_Bick_reread",
                                    "score": 1,
                                    "created_utc": 1648751359.0,
                                    "response": "So I fn love what I’ve researched so far, what do you think the best way for me to get started in the whole governance and just overall ecosystem of railgun?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i2wysur",
                                            "author": "6uRku2va",
                                            "score": 2,
                                            "created_utc": 1648769512.0,
                                            "response": "Speaking of governance it means you will have to get RAIL token and have it staked then you gain voting rights in governance as part of the DAO. what this means is that it empowers you to participate in the future direction of RAILGUN.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i2x0bvs",
                                                    "author": "Dig_Bick_reread",
                                                    "score": 1,
                                                    "created_utc": 1648770196.0,
                                                    "response": "Dang erc tokens:/ do you think it’s worth a little investment maybe 50$ after gas fees?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i3118e5",
                                                            "author": "6uRku2va",
                                                            "score": 1,
                                                            "created_utc": 1648844860.0,
                                                            "response": "If you are talking about the DAO then a minimum of 1 Rail token is required to be staked to be part of the DAO",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i312j6n",
                                                                    "author": "Dig_Bick_reread",
                                                                    "score": 1,
                                                                    "created_utc": 1648845413.0,
                                                                    "response": "Just purchasing the coin on uniswap",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i31sknx",
                                                                            "author": "6uRku2va",
                                                                            "score": 1,
                                                                            "created_utc": 1648857433.0,
                                                                            "response": "Purchasing and having a minimum of 1 RAIL staked is all you have to do to join the DAO.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i2p0ug5",
                    "author": "apstl88",
                    "score": 1,
                    "created_utc": 1648632566.0,
                    "response": "I like what Kalmar is doing. It’s a DeFi banking project but they are also oriented on NFTs but I will skip that part since you mentioned that you don’t wanna hear about NFTs. The feature that I like the most is their leveraged yield farming. With leverage up to x6.5 your returns will be higher + you don’t need high amounts to start. They also have a good lending program.\n\nI still believe in BMI as well because I think that they can really make an impact on the market when it comes to security and preventing losses.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i2p1xji",
                            "author": "frankanags",
                            "score": 1,
                            "created_utc": 1648633514.0,
                            "response": "Sound very interesting, I honestly like the Kalmar features. It is no rocket science that lending will be taking another great turn soon with Axl also building a lending and borrowing platform for users to collateralize their assets plus a smart routing across the Eth and Bsc smart contracts.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i2v3xb2",
                                    "author": "apstl88",
                                    "score": 0,
                                    "created_utc": 1648743264.0,
                                    "response": "It's no rocket science and it shouldn't be rocket science to use it, that's what I like the most. + KALM is coming on Avalanche and Fantom soon.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i3857hp",
                                            "author": "frankanags",
                                            "score": 2,
                                            "created_utc": 1648995744.0,
                                            "response": "This is awesome.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i2nr9mm",
                    "author": "fishing_pole",
                    "score": 1,
                    "created_utc": 1648603425.0,
                    "response": "Thorchain",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i2o6u5a",
                            "author": "CommanderCream314",
                            "score": 1,
                            "created_utc": 1648610920.0,
                            "response": "About two weeks too late for OP",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i2nvket",
                    "author": "quintalunazf",
                    "score": 1,
                    "created_utc": 1648605395.0,
                    "response": "The crypto space is filled with project that claimed to be DAO but functions otherwise, Cross-chain capital has took to itself to be firm by exhiniting the true feature of a DAO system; I also like the fact that it is actually not limited to any niche in the space.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i2ny41e",
                    "author": "Etagedh",
                    "score": 1,
                    "created_utc": 1648606603.0,
                    "response": "I fancy when a project tackles a real-life problem and thats exactly what Ore Network is doing, identity managment across multiple chains and it also has a multisig asset management service built on ORE ID for business people and many more.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i2nz2hm",
                    "author": "beemerteam",
                    "score": 1,
                    "created_utc": 1648607062.0,
                    "response": "Imperial College of London has a crypto called Vector Space Biosciences VXV https://www.imperial.ac.uk/news/234034/ai-life-sciences-research-gets-boost/",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i2o1ccw",
                    "author": "vx117",
                    "score": 1,
                    "created_utc": 1648608154.0,
                    "response": "I would say Nimiq. It’s a wallet built directly into your browser and through it is actually a nano node that gives you direct access to the blockchain. This is done using zk proofs which is decentralization at its best. It will soon transition to PoS and allowing staking and faster transaction speeds.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i2o4mxt",
                    "author": "calledbluff",
                    "score": 1,
                    "created_utc": 1648609783.0,
                    "response": "KDA",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i2o5q94",
                    "author": "druggiesito",
                    "score": 1,
                    "created_utc": 1648610345.0,
                    "response": "Titano",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i2o7noa",
                    "author": "liftshootandsave",
                    "score": 1,
                    "created_utc": 1648611356.0,
                    "response": "Stargate (STG) from layer zero labs.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i2o9625",
                    "author": "divisionibanez",
                    "score": 1,
                    "created_utc": 1648612155.0,
                    "response": "DeFi Kingdoms. Mark my words, shit is about to get wild. Some incredibly innovative things in the works. They plan to be a host chain of new GameFi projects. Easy integration, their own Subnet on Avalanche, and a thriving ecosystem on Harmony. Just do yourself a favor and punch it into a search anywhere, YouTube, Twitter or even their subreddit and prepare to be impressed.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i2tvz13",
                            "author": "albwmenni",
                            "score": 1,
                            "created_utc": 1648721724.0,
                            "response": "We are yet to see the best from the gamefi sector and things might get really riled up in the coming months, the top on my watchlist is Sidus heroes, engaging game with a WebGl feature and deflationary tokens. I'm anticipating its progress over the coming months.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i2o9a3v",
                    "author": "CrippledFelon",
                    "score": 1,
                    "created_utc": 1648612213.0,
                    "response": "Haha your Mom",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i2oavr6",
                    "author": "riskbuy",
                    "score": 1,
                    "created_utc": 1648613100.0,
                    "response": "Stellar cannacoin all day!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i2odulb",
                    "author": "luckylebron",
                    "score": 1,
                    "created_utc": 1648614813.0,
                    "response": "Does anyone know what wallet I can connect to Kraken exchange?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i2ojbat",
                    "author": "Lookmountain",
                    "score": 1,
                    "created_utc": 1648618285.0,
                    "response": "Flux",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i2ok7cp",
                    "author": "ricklepicklemydickle",
                    "score": 1,
                    "created_utc": 1648618901.0,
                    "response": "If WMT is successful, all other projects listed in this thread will be  successful. Currently half the world have no internet. So we vantage really have mass adoption until they do. World Mobile Token connecting the unconnected. Look into it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i2opogv",
                    "author": "Traditional_Onion_52",
                    "score": 1,
                    "created_utc": 1648622992.0,
                    "response": "Saito",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i2ors06",
                    "author": "pazsurfingwd",
                    "score": 1,
                    "created_utc": 1648624686.0,
                    "response": "what caught my attention to investing in a project is usually the solution it brings to the space for instance TXA which provide a decentralized settlement layer to exchange which fastens transaction speed",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i2p24vd",
                    "author": "Heclalava",
                    "score": 1,
                    "created_utc": 1648633688.0,
                    "response": "I'm bullish on AIOZ long term, 19.5% APY staking rewards at the moment, dCDN for video content streaming. They have a YouTube alternative going to mainnet soon, and Netflix like streaming planned for the future. I run nodes to earn and then stake. It's a long play for me with expected massive gains in 5-8 years time.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i2p3591",
                    "author": "Sorry_Attitude_",
                    "score": 1,
                    "created_utc": 1648634545.0,
                    "response": "I think Kadena is having a really good idea with their Gas station thingy\n\nBasically dapps can run gas free and you only get charged for transfers while dapps work with no gas fees\n\nBUT also, we need modular multichain wallets.Maybe even a more \"premium one\" where you pay a subscription just so the developers can focus on the wallet and keeping it up and running instead of basically doing it for free but that idk if it's gonna happen soon",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i2p5n94",
                    "author": "calculatedfantasy",
                    "score": 1,
                    "created_utc": 1648636523.0,
                    "response": "Rubic. The site is rubic.exchange. Trade any asset across 6+ blockchains in 1 trade. Just got listed on kraken. 30M mcap",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i2pag3r",
                    "author": "MeatCrap",
                    "score": 1,
                    "created_utc": 1648639856.0,
                    "response": "For 2022 I am bullish on data protocols (Ocean, Graph, etc) and also I believe stablecoins will do good (USDC, eMoney and others.)",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i3kt27n",
                            "author": "tahuretafk",
                            "score": 1,
                            "created_utc": 1649213271.0,
                            "response": "What about the project wowed you the most? If you research on FWT you will sure like it. I can invest usd, btc or eth within the platform and I'd be getting great passive income rewards as high as 43% on usd",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i2peclz",
                    "author": "dnicastro10",
                    "score": 1,
                    "created_utc": 1648642187.0,
                    "response": "The Graph",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i2psi1f",
                    "author": "Umarzy",
                    "score": 1,
                    "created_utc": 1648649069.0,
                    "response": "Been a DeFi enthusiast since 2020. Love exploring different protocols & see the benefits they offer.\n\nEven though it might not be the best, but I like OIN Finance approach to stablecoins, as it allows users to leverage on their native assets & mint stablecoins, while having exposure.\n\nAmazing yield farming programs for every USD assets integrated, buyback & burn, governance, new partnerships keep coming.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i37dd31",
                            "author": "oxidaronvf",
                            "score": 1,
                            "created_utc": 1648977248.0,
                            "response": "Its amazing to see how far Defi has come since inception and how its changing the crypto space. I've faced the problem of decoding complexities of using yield farming protocols as a newbie then and seeing spool come with an easy user interface that can even be used by investors with no defi skill is a big innovation for me. Auto-compounders also take away the stress of risk management and re-balancing so its a win win.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i2psjom",
                    "author": "4rindam",
                    "score": 1,
                    "created_utc": 1648649089.0,
                    "response": "Looking forward to Green rebrand to greenhouse from dinoswap. Could be one to watch out for",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i2psvpc",
                    "author": "4rindam",
                    "score": 1,
                    "created_utc": 1648649235.0,
                    "response": "DAFI with their synthetic d-tokens helping inflation control in native tokens",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i2q48gh",
                    "author": "Comfortable-King242",
                    "score": 1,
                    "created_utc": 1648653866.0,
                    "response": "Zucoins wallet and coins this June , you can never lose your money transferring coins, it’s “ dummy proof, referred to as the Bitcoin killer, permission less, no energy required, it is what Facebook was trying to be, I wouldn’t be surprised if Facebook or Meta bought them out,",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i2qllu4",
                    "author": "TrickyDickky1282",
                    "score": 1,
                    "created_utc": 1648660789.0,
                    "response": "Bumpity bump",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i2quhzp",
                    "author": "MarkbutwithaK",
                    "score": 1,
                    "created_utc": 1648664279.0,
                    "response": "I've been checking out Eli Mobile that's pioneering the use of blockchain tech in telco & mobile networks. There are new ways of doing things are being created by the use of defi and blockchain technology. Using these technologies, financial systems like Elite Dao are searching for new ways to create systems .",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i2qvo1h",
                    "author": "Asher_TC",
                    "score": 1,
                    "created_utc": 1648664741.0,
                    "response": "I'm currently bullish on NGM for payment using the 5 EU currency stablecoins that's fully collaterized which the team have issues so far\n\nBullish on OCEAN protocol for data democratisation and monetization\n\nBullish on ATOM interopability. JUNO, OSMO, SCRT are all my picks with AAVE and DYDX",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i2ty0ro",
                            "author": "albwmenni",
                            "score": 1,
                            "created_utc": 1648723309.0,
                            "response": "I've taken a liking to privacy coins like scrt, although after much digging i  found railgun to offer a wider range of services such as defi integration and being multi-chain. The space is going to get more attention in the coming months as the need for privacy on transactions increases.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i2wfqdv",
                                    "author": "Asher_TC",
                                    "score": 1,
                                    "created_utc": 1648761560.0,
                                    "response": "yea right. looking forward to what comes next",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i3fylsr",
                                            "author": "albwmenni",
                                            "score": 1,
                                            "created_utc": 1649127681.0,
                                            "response": "I have a feeling that massive adoption would come sooner than later though. Do you have any experience with privacy protocols so far, what's your take on them?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i3nzd71",
                                                    "author": "Asher_TC",
                                                    "score": 1,
                                                    "created_utc": 1649272991.0,
                                                    "response": "Depends on the protocol",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i3ojidh",
                                                            "author": "albwmenni",
                                                            "score": 1,
                                                            "created_utc": 1649280472.0,
                                                            "response": "Okay, so I take it you have experience with a lot of them then.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i37cqzn",
                            "author": "oxidaronvf",
                            "score": 1,
                            "created_utc": 1648976730.0,
                            "response": "Stablecoin staking has made me loads of profit but I want to try out auto-compounders where I have the risk managed and re-balancing taken care of. I like how easy spoolfi is to set up and the break down of utilities, might as well be my next stop.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i3nzku0",
                                    "author": "Asher_TC",
                                    "score": 1,
                                    "created_utc": 1649273065.0,
                                    "response": "I like to do it myself. It helps me to know when to leave and all",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i3yldfi",
                                            "author": "oxidaronvf",
                                            "score": 1,
                                            "created_utc": 1649456392.0,
                                            "response": "You must be really good at it to take on such a crucial responsibility, its a different situation on my side as making decisions and selecting the best yield platform and management can be hectic, with spool I just choose the vault that fits my desired apy.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i2qxl97",
                    "author": "leon6677",
                    "score": 1,
                    "created_utc": 1648665498.0,
                    "response": "Looksrare",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i2qy69b",
                    "author": "GajaSabac",
                    "score": 1,
                    "created_utc": 1648665729.0,
                    "response": "I would suggest you check out the E-money project, the issuer of fully backed stablecoins for the European market. \n\nIt resembles other projects first because all the coins are backed, and second those funds are transparent and checked quarterly by Ernst & Young. \n\nAll those coins also are instant settlements with near-zero fees...",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i2r9nhi",
                    "author": "sipora_chuves",
                    "score": 1,
                    "created_utc": 1648670221.0,
                    "response": "So many projects are popping up which have no real world use case apart from  farming some sort of token.\n\nBut one project which I got caught on is [cheqd.io](https://cheqd.io). Never heard of it but received a cosmos airdrop a couple of days ago. So, I had a closer look at it what these guys are actually doing. \n\nAnd their vision is pretty impressive. Creating an ecosystem for self-sovereign identity management based on blockchain technology. It has many, many real world use cases related to identity management. Well worth a closer look! I staked my airdrop and will probably invest a couple of more dollars into this project.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i2re16c",
                    "author": "kutem",
                    "score": 1,
                    "created_utc": 1648671938.0,
                    "response": "Froggies token, metavice and Shibnobi",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i2rp2hl",
                    "author": "Piglet-Stock",
                    "score": 1,
                    "created_utc": 1648676396.0,
                    "response": "Feg. The winner of the best smartdefi project st dubsi. Crypto expo recently",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i2rs39r",
                    "author": "nicholaux",
                    "score": 1,
                    "created_utc": 1648677658.0,
                    "response": "I like what Duelist King is doing. Though a gaming project, they are revolutionizing the gaming industry, and bringing on transparency and true decentralization to the gaming space.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i2twwxu",
                            "author": "albwmenni",
                            "score": 1,
                            "created_utc": 1648722461.0,
                            "response": "Decentralization is a great innovation when it comes to crypto which also translates to gaming as well cause people like to be in charge and have full control over their assets. I have a favorite in the gaming sector as well, Sidus heroes gives me satisfaction being a lover of battle games and the WebGl feature makes it accessible with ease. gamefi is slowly taking over the crypto space.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i2sj61v",
                    "author": "geistirnd",
                    "score": 1,
                    "created_utc": 1648689916.0,
                    "response": "I think one just got launched today. Identifying the general challenge most DeFi experience with interacting with several DeFi yield generating protocols and the implications of the extra multiple fees they pay in the process. Spoolfi came on board as an automated DeFi router that takes deposits from a user, irrespective of their knowledge or skill level in DeFi, and automatically channels the users' deposit into multiple yield generators (Aave, Curve, Compound, Idle etc.). without the need for paying multiple gas fees and going through the rigors of rebalancing. If my definition of innovation isn't inaccurate, Spool fits right in.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i2sj9iu",
                    "author": "Jacobsendy",
                    "score": 1,
                    "created_utc": 1648689961.0,
                    "response": "I believe you know that there are a lot of privacy protocols in space at the moment. With increasing demand, their relevance is shining brighter. Speaking of innovation, I believe Railgun qualifies to be referenced in that regard due to the absolute inclusion of everything that can be transacted on the blockchain. Its NFT support i.e. providing the option to anonymously auction NFTs; Also, being multi-chain composable with no bridges ensures that its security is miles ahead of the conventional privacy protocols. The big innovation comes from the smart utilization of zkSNARKS technology in the design of its privacy system. The interesting part is that zksnarks has been considered by many to be revolutionary.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i2t1mtc",
                    "author": "No-Froyo3657",
                    "score": 1,
                    "created_utc": 1648698870.0,
                    "response": "The most innovative project that I've come across should be Unido. How it used the multisig wallet to reduce the cost of operating a crypto custodial solution still amazes me till today.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i2t681q",
                    "author": "Talpaccixw",
                    "score": 1,
                    "created_utc": 1648701535.0,
                    "response": "Projects with good strategic partnerships, backers, quality exchanges, active communities, and a quality development team, in my opinion, will ultimately deliver, which is why I find Duelist King innovative and proactive. I got a sense of it during the alpha testing of its game, where participants provided feedback in order to fix the bugs that were reported.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i2tee5y",
                    "author": "Ambitious-Tooth",
                    "score": 1,
                    "created_utc": 1648707026.0,
                    "response": "I'm really bullish on what Solana is doing these days, they're really giving back to the community through organizing hacker houses in NYC and teaching the up and coming developers of everything related to blockchain technology. \n\nThey've also been decreasing their carbon emissions and implementing insurance funds on their IDO incubators like SoIana prime to protect investors.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i2twe1d",
                    "author": "iamjide91",
                    "score": 1,
                    "created_utc": 1648722052.0,
                    "response": "It would be one of the best Blockchain gaming projects, Mecha Morphing for me.\n\nIt's funny how many now find crypto games \"unsustainable\" all of a sudden when actually many had wanted a means to earn while gaming when trag gaming was still in the limelight.\n\nMecha Morphing will be sustainable IMO. Gameplay, graphics, etc all superb. Team behind it are also not new to gaming or Blockchain projects. They are very much established. I think that will fly.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i2vly3w",
                    "author": "Suzxy",
                    "score": 1,
                    "created_utc": 1648750080.0,
                    "response": "Stablecoin related projects like E-money and Finance Oin piques my interest the most at the moment. Both are innovative projects that are making waves, have solid utility and unlock decent sources of passive income but are still undervalued.\n\nMainstream stablecoin adoption is coming and I'm bullish on these two under-the-radar projects. Won't hurt to check them out.\n\nZebec and liquality seems interesting enough.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i2vx5w3",
                    "author": "xangchi",
                    "score": 1,
                    "created_utc": 1648754421.0,
                    "response": "It has to be OCEAN. There's a lot we can do with our data away from it being stolen by oligarchs such as Google and Facebook. OCEAN enables us to take control of our data and monetize it while preserving its privacy.\n\nThe [OCEAN V4](https://blog.oceanprotocol.com/ocean-v4-public-testing-is-now-live-691de33b8498) public testing was announced today.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i2vyyxw",
                    "author": "unilorite",
                    "score": 1,
                    "created_utc": 1648755119.0,
                    "response": "Kalmar’s creation of a DeFi hub with NFTs and Gamifi piqued my interest, a lot of people could also find it interesting and innovative.\n\nI also think the introduction of next generation NFTs with advanced features by Unique network, to create web3 solutions in art and gaming seems to be a brilliant idea, which come from the team building the chain on substrate, which hasn’t been done before.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i2w7dt0",
                    "author": "Future-Goose7",
                    "score": 1,
                    "created_utc": 1648758375.0,
                    "response": "I like the introduction of a strong multi-chain stablecoin issuance platform on OIN and ZK proofs for privacy on SCRT and ROSE, as well as Data oracle, piqued my interest.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i2wz3mr",
                    "author": "caixabancyc",
                    "score": 1,
                    "created_utc": 1648769645.0,
                    "response": "As at now my interests is majorly in the Web3 ecosystem, with the whole crypto industry getting all excited about the decentralization that comes with Web3, i believe all eys should be on gems in the ecosystem like GRT, DEIP, FLUX etc.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i30el49",
                    "author": "royale442",
                    "score": 1,
                    "created_utc": 1648835518.0,
                    "response": "Some couple of projects are proving the fact that the fast-paced nature of the crypto is responsible for the endess innovative possibilities available within the ecosystem. \n\nPlatforms like Greenhouse rebranding strikes as innovative because it solves the previous hyperinflation problem of by making swaps 100 DINO to 1 GREEN token. The innovative ecosystems of $MATIC is also interesting.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i31dxl3",
                    "author": "Spalatinwt",
                    "score": 1,
                    "created_utc": 1648850414.0,
                    "response": "One of the most innovative project I came across was Kolnet, they will be launching their Kol coin soon. The platform debuts as the first DEX and marketing launchpad.The launchpad bridges projects owners and micro-KOLs. KOLnet is primed to put an end to flat launches.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i37a2cn",
                    "author": "GigliolaGigar",
                    "score": 1,
                    "created_utc": 1648974516.0,
                    "response": "Its $Elite for me. These are some of the perks;\n\nSharing content in a new way\nPromoting freedom of expression\nDistributing quality content from verified celebrities\nBuilding a reward system for creators\nManaging licenses and rights to pictures and videos\n\n\nFor the investor:\nSpeculating on the increase in value of $ELITE tokens\nBuying NFTs that generate passive income\nBuying exclusive products or products on sale\nFarming\n\n\nFor the influencer:\nSelling content in NFTs\nEarning money from the secondary market\n\n\nIts a bunch of good news",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i39wq8y",
                    "author": "Spalatinwt",
                    "score": 1,
                    "created_utc": 1649022488.0,
                    "response": "One of the most innovative crypto project I came across is Kolnet which try to bridges micro influencers and key opinion leaders. Kolnet being the first marketing Dex is going to be a game changer.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i3jj0el",
                    "author": "DigitalInvestments2",
                    "score": 1,
                    "created_utc": 1649193121.0,
                    "response": "The cryptos with the best tech right now IMO are NEAR, ICP, and IOTA. I don't think anyone can argue against those.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i85ahcm",
                    "author": "Bolswardoq",
                    "score": 1,
                    "created_utc": 1652244406.0,
                    "response": "The real GEM of 2022 has just launched a couple of days ago.\r  \n\r  \nThis project has a real life utility and is something trully amazing.\r  \n\r  \n\r  \n\r  \nThe Science DAO solves several problems for retail investors, institutions, and inventors. Profound scientific startups are generally not available to the public due to high barriers of entry and non existent deal flow; geography and accreditation sometimes present issues as well. For institutions, many early stage funds deal with an illiquid seed investment in which they are married to a company for many years before any liquidity event. Inventors with promising ideas are in need of expert advice, mentorship, licensing or corporate guidance, and lastly risk capital prior to proof of concept. The Science DAO will enable crypto investors to put their crypto value into a new asset. It will help funds gain access to new deal flow with the opinion of experts in those related industries without having to seek consultation. It would foster growth for inventors and entrepreneurs that are still in need for risk capital. It would take the pressure off single investors by mitigating risk through decentralized governance and fundraising.\r  \n\r  \n\r  \n\r  \nDon't miss out on this project as it will be HUGE!\r  \n\r  \n\r  \n\r  \nhttps://coinmarketcap.com/currencies/theory/\r  \n\r  \nhttps://thesciencedao.io/\r  \n\r  \nhttps://thesciencedao.io/",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i2npdkl",
                    "author": "Fabulous-Net96",
                    "score": -3,
                    "created_utc": 1648602543.0,
                    "response": "Saitama Inu!\n\nOver 350K holders, just landed an OKX listing, have their own app called Saitamask, which is a swap, exchange, NFT platform, educational platform, P2E game in Wolfcaster and even more. Already secured a partnership with Eagle FC, and more partnerships to come!\n\nFuture of DeFi, and Saitamask aims to be the one-stop-shop for crypto.\n\nCheck it out at SaitamaToken.com",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i2oejcn",
                    "author": "Technical-Leg7891",
                    "score": 0,
                    "created_utc": 1648615223.0,
                    "response": "I’m had a dream I want to start the first moonelondoge coin does anybody know Elon I need to speak to him",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}