{
    "subreddit": "CryptoMarkets",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uxcbac",
            "title": "Support for TWO New Protocols Are Coming To Uniswap...",
            "url": "https://cryptoglobalpress.blogspot.com/2022/05/support-for-two-new-protocols-are.html",
            "author": "Capulous7217",
            "created_utc": 1653465077.0,
            "score": 16,
            "num_comments": 4,
            "subreddit": "CryptoMarkets",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9wt3pe",
                    "author": "CointestAdmin",
                    "score": 1,
                    "created_utc": 1653465795.0,
                    "response": "Uniswap {{pros}} & {{cons}} and related info are in the collapsed comments below. Pros and cons will change for every new post.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uxcghl",
            "title": "Phase Four Tokenomics of Sweat Economy",
            "url": "https://www.reddit.com/r/CryptoMarkets/comments/uxcghl/phase_four_tokenomics_of_sweat_economy/",
            "author": "NonaDarden",
            "created_utc": 1653465748.0,
            "score": 13,
            "num_comments": 2,
            "subreddit": "CryptoMarkets",
            "selftext": "Today is a great day to walk and accumulate some sweatcoins along the way. With sweat economy releasing tokenomics phase 1, 2, 3 earlier, let’s talk about a little summary on the tokenomics phase 4.\n\nPhase 4 speaks about the open economy of movement. Basically a way to reward everyone in amazing ways for any form of movement. It’s going to include two key functions:\n\n- Alternative Movement Validators\n\n- Data analytics\n\n\n1- Alternative Movement Validators: As the name implies sweat economy is looking any alternative means of how movements can be validated with this the economy becomes more decentralized, powerful and as well create more forms of movement (cycle, swim, do yoga, Pilates, or gym work).\n\nThe Movement Validators can offer users SWEAT for their movement, while earning SWEAT themselves. This is considered a win-win for the community\n\n2- Data analytics: In Sweat Economy, you own the data you produce. Sweatcoin will never sell your data neither will sweat foundation but will help users monetize their own data IF they wish to.\n\n\nIn summary we all know that health data is important for some sectors to gain insights or improve a business model. Here the user gains because anyone who wants access to your data has to pay; the reward would return to you who contributed your data to the pool, while the DAO receives a fee for operating the service.\n\n\nThis and many more to read and understand from the [Sweat Economy tokenomices phase 4 ](https://medium.com/sweat-economy/sweat-the-tokenomics-phase-four-the-open-economy-of-movement-843d60962203)",
            "stickied": false,
            "comments": []
        }
    ]
}