{
    "subreddit": "CryptoMarkets",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uvvubt",
            "title": "Why does no one seem to care about tokenized stocks, despite all of their benefits?",
            "url": "https://www.reddit.com/r/CryptoMarkets/comments/uvvubt/why_does_no_one_seem_to_care_about_tokenized/",
            "author": "blank_measurement",
            "created_utc": 1653295893.0,
            "score": 16,
            "num_comments": 3,
            "subreddit": "CryptoMarkets",
            "selftext": "Stock tokenization is a relatively new phenomena in crypto, following a wave of DeFi innovation in recent years.\n\nThe beauty of cryptocurrency in general is that Tokenized stocks can be traded by anyone. There are no entrance barriers other than an internet-connected gadget and some dollars to get started.\n\nTokenized equities may be perfect for investors who wish to participate in traditional financial markets but do not have access to them. For example, someone without a bank account cannot open a stock brokerage account, but they may be able to trade tokenized equities.\n\nUpon reading this [article](https://www.financemagnates.com/thought-leadership/could-tokenized-stocks-bring-volume-to-the-market/), I’m pretty bullish that Tokenized stocks will bring more volume to the market so I would be so happy to know what is the most effective strategy to trade dependable tokenized stocks right now?",
            "stickied": false,
            "comments": [
                {
                    "id": "i9nwt7z",
                    "author": "Dekataro",
                    "score": 1,
                    "created_utc": 1653297194.0,
                    "response": "Keep in mind that not all decentralized exchanges trade tokenized stocks. Instead, they trade \"synthetic assets\" or \"synths,\" which are tokens meant to replicate the performance of existing assets.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9nw469",
                    "author": "CrosslyHysterical11",
                    "score": 1,
                    "created_utc": 1653296546.0,
                    "response": "This is my stupidity displaying, but perhaps one of you can enlighten me.\r  \n\r  \nHow can a stock be tokenized in a decentralized manner? Isn't the underlying asset that the token represents required to be held by someone?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9nyh2l",
                    "author": "Professional_Pain711",
                    "score": 1,
                    "created_utc": 1653298765.0,
                    "response": "I'm not sure, but I assume they have a lot of regulatory concerns with synthetic stocks.\r  \n\r  \nBut know this: blockchain-based equities are without a doubt the future.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uvvuws",
            "title": "The head of the ECB announced the need to regulate cryptocurrencies",
            "url": "https://medium.com/@unclefibonacci/the-head-of-the-ecb-announced-the-need-to-regulate-cryptocurrencies-b6ca480caf09",
            "author": "btcxlab",
            "created_utc": 1653295966.0,
            "score": 0,
            "num_comments": 4,
            "subreddit": "CryptoMarkets",
            "selftext": "",
            "stickied": false,
            "comments": []
        }
    ]
}