{
    "subreddit": "CryptoTechnology",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "usjtr0",
            "title": "Can cryptocurrencies ever become 100% environment-friendly?",
            "url": "https://www.reddit.com/r/CryptoTechnology/comments/usjtr0/can_cryptocurrencies_ever_become_100/",
            "author": "Braswelldj",
            "created_utc": 1652899635.0,
            "score": 21,
            "num_comments": 14,
            "subreddit": "CryptoTechnology",
            "selftext": "The story of Earth is incomplete without the vaults of Gold and other treasures. But today, about 50% of the mined gold is just stored in bank vaults. At a time when the fight against climate change requires immediate action, the mining industry continues to emit between 4-7% of global greenhouse gasses (GHG)1. In fact, scientists estimate that the industrial activity needed to mine just one ounce of gold causes the emission of up to 800 kilograms of GHG2!\n\nObviously, technological evolution brought many alternatives, one in the form of cryptocurrencies. But then, everything comes at a cost. And cryptos aren’t growing on trees.\n\nAccording to the University of Cambridge, Bitcoin mining alone generates about 132.48 terawatt-hours (TWh) annually and the CO2 emitted by this varies on how that energy was created. In fact, in 2020, the US generated 0.85 pounds of carbon dioxide per kWh, which resulted in nearly 40 billion tons of carbon dioxide produced by US Bitcoin mining alone!\n\nOpening their eyes to the harrowing impact of this “new currency”, a lot of cryptocurrencies are trying to come up with alternative mining solutions, that would require less energy and could provide solutions to problems such as the need to accelerate ESG investments that can preserve the environment or the need for a secure, net-zero bridge between a dominant real-world store of value,i.e., gold, and the crypto asset world, without the environmental and social impact of either real-world mining or Proof of Work mining.\n\nCompanies are coming up with new investment alternatives including a tokenized\nInvestments like Nature’s Vault are backed by the preservation of at least 1/100th of a gram of gold in the ground, thereby ensuring forests, ground soil, and their associated ecosystems are not disturbed by gold mines, fossil fuels are not burned in mining activities and local and indigenous communities are not harmed by collateral impacts such as heavy metals contamination of groundwater, rivers, and lakes.\n\nBut do you think it’s enough? Can cryptocurrencies ever become 100% environment-friendly?",
            "stickied": false,
            "comments": [
                {
                    "id": "i93v49r",
                    "author": "sdcvbhjz",
                    "score": 9,
                    "created_utc": 1652899874.0,
                    "response": "Why did you leave out PoS chains?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9408aj",
                            "author": "domotheus",
                            "score": 8,
                            "created_utc": 1652901962.0,
                            "response": "Because it's a bot writing organic looking paragraphs and casually slipping in the advertised product somewhere in the middle",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9b1dvh",
                                    "author": "wanglubaimu",
                                    "score": 1,
                                    "created_utc": 1653037407.0,
                                    "response": "It's sad in this context that the majority of people still doesn't understand the urgent need for Sybil resistance mechanisms in social media. They see some of the Twitter bots, they notice the most obvious spam on reddit - but somehow it does not dawn on them that they're wasting an increasing amount of their time talking to and getting influenced by algorithms. \n\nWhen you talk about the urgent need for systems that can provide Proof of (unique) Personhood/Identity, you mostly hear the chirping of crickets as a reaction.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9528wc",
                            "author": "Maleficent_Plankton",
                            "score": 3,
                            "created_utc": 1652918432.0,
                            "response": "Because it's an ad for N.V. (I'm not going to spell it out), which I'm sure no one here has ever heard of and should stay that way.\n\nName-dropped in both of his 2 most recent submissions.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i93xrdq",
                    "author": "-Jive-Turkey-",
                    "score": 0,
                    "created_utc": 1652900948.0,
                    "response": "Algorand is carbon negative.\n\nEdit: I’ll just leave this here. https://www.algorand.com/resources/blog/sustainable-blockchain-calculating-the-carbon-footprint",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i93zttf",
                            "author": "shape_shifty",
                            "score": 4,
                            "created_utc": 1652901796.0,
                            "response": "Algorand compensate for the carbon it emits, there is a big difference",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i94h051",
                                    "author": "-Jive-Turkey-",
                                    "score": 2,
                                    "created_utc": 1652908851.0,
                                    "response": "To be fair it uses a minuscule amount of energy.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i940qba",
                    "author": "Giga79",
                    "score": 1,
                    "created_utc": 1652902164.0,
                    "response": "https://ethereum.org/en/energy-consumption/\n\nETH POS is a 2000x energy reduction from ETH POW.\n\nThe photo in this article illustrates the difference what being 32500x less than BTC POW looks like by using the tallest tower in the world, the Burj Khalifa, and a household screw.\n\nBitcoin mining incentivizes the cleanest energy in multiple ways, first being economies of scale. But right now clean energy isn't being built-out because there are no customers during non-peak hours even while power is being generated, most batteries aren't environmentally friendly or ideal so instead of wasting the energy or not building at all they put it into BTC to send somewhere that needs that energy instead (like electric oil).\n\nPOW isn't used very much because it's not practical to decentralize using it anymore, the available and specialized cpu/hashrate power globally is just so high now. It's being phased out. BTC halves it's issuance every 4 years so it's incentives are being phased out too, it'll all sort itself out over time.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i962qtb",
                            "author": "89Hopper",
                            "score": 1,
                            "created_utc": 1652937316.0,
                            "response": ">Bitcoin mining incentivizes the cleanest energy in multiple ways, first being economies of scale.\n\nNo, Bitcoin mining incentivizes the cheapest form of power. It also requires a stable form of power, a mining operation is losing lots of money tied up in capital investment if it has to have half the rigs turned off because there isn't too much power being produced. This means they want an increase in base load, which is not adequately serviced purely by renewables.\n\nProof of this is mining companies buying and recommissioning coal and gas power plants purely for the purpose of BTC mining.\n\n2021 - [Stronghold Digital Mining decommissioned coal plant in PA for mining operation](https://futurism.com/bitcoin-mining-company-buys-entire-coal-power-plant)\n\n2020 - [Marathon makes deal with coal plant in Montana about to close to increase power output just for them](https://www.theguardian.com/technology/2022/feb/18/bitcoin-miners-revive-fossil-fuel-plant-co2-emissions-soared)\n\n2020 - [Greenidge Generation recommissions mothballed gas plant to run mining operation](https://apnews.com/article/bitcoin-mining-new-york-power-plant-climate-change-516dbd319394a6a30f83d94947abad20)\n\n2018 - [IOT Group try to reopen coal plant in Australia that had been shut for 4 years to mine. ](https://www.cnet.com/personal-finance/crypto/blockchain-coal-power-plant-mining-bitcoin-cryptocurrency/) It is worth noting, this never got off the ground but primarily due to environmental backlash.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i973568",
                                    "author": "Giga79",
                                    "score": 1,
                                    "created_utc": 1652964902.0,
                                    "response": "Those are all places that were just about to go bankrupt but instead started to recycle their '*waste energy*' into BTC instead of flaring it off into the sky or ground. Now they have more capitol to exist *longer* than they would've otherwise. It's one step forward and one step back I agree. \n\nThose same technologies are also being used in places with clean energy that have their own 'waste energy' and during non-peak hours. I can't be bothered to find a proper breakdown but it isn't profitable to create a new clean energy plant in most (all?) places right now, sort of a shit deal when we need to *go green* under a capatalist paradigm.\n\nThe solution was always going to be creating massive battery 'islands' that stored the solar for night time use and etc., That isn't green either or even feasible really (even Tesla is backing away from making battery promises now). Hydro batteries *might* work but water isn't accessible in the same places solar is. The tech isn't there yet. \n\nThis is a global problem right now, coal vs solar. Germany just started using coal again.. China is using so much coal. India.. The whole 3rd world is about to enter a **massive** growth phase and they have no access to renewables yet. Solar needs to be profitable to create, *more* profitable than using an existing mine.\n\nIf you hook a BTC farm up to your solar plant and used excess energy to mine BTC with, when the sun goes down you're now able to sell the BTC back and subsidize your green energy plant. Tons of places are doing this now that wouldn't have even been built otherwise. Yes some coal plants, many green plants too.\n\nCoal is more expensive than solar per unit of electricity, the only time it's not is when you already have a coal plant built but no solar infrastructure. The global aim should be to build those places solar but how do you incentivize that from all the way across the world if they're unable to bottle and sell it otherwise?\n\nThe rewards for mining BTC are reduced by half every 4 years. If it costs 20K in power to mine a BTC you sell for 30k today, in two more years it'll cost you 20K and you'll get 15K for it, and four years after it'll cost you 20K and you'll get 7.5K. I'm just assuming the price doesn't double forever because it can't. The only rational thing to do is to stop mining, instead of mine for a loss. Except clean energy costs *much* less than dirty energy, (moreso when the government subsidizes it for you like they've been with these new *green* btc farms), so anyone with access to 1c kWh power *won't* be at a loss and will continue to mine. This naturally pushes out expensive energy and fuels innovation for cheap or zero cost energy.\n\nOn its own BTC will *only* be economical to mine using clean energy in a few more halvings. If you're burning $70K in coal to mine a BTC for $60K it doesn't make sense anymore. It's a great opportunity to use this moment to bridge the old/dirty energy into the new energy paradigm otherwise they'll be stuck behind with no opportunity other than this. If India is using coal today we could send them a solar BTC farm where the investor takes the excess (BTC) and India gets the power. We have to solve this with capatalism (cash incentives) whatever we do or it won't get done at all, pointing fingers hasn't worked so far.\n\nIf we blow this opportunity in 20 years it'll cost 20K to mine a BTC (assuming it's as secure as today) and the reward will be $468 down from $30K today (assuming the price doesn't 64x by then idk I'm not a btc maxi). It's going to solve itself by becoming unsecure if people can't learn how to secure it for *free* by then or at least damn cheap. Once this incentive to build clean is gone it'll be gone forever and I haven't even heard an alternative purposed. Fees are supposed to replace any lost block reward income but no one pays for BTC blockspace (and their L2 disincentives it) so I don't know what'd need to happen to make it profitable in any circumstance again (fees would need to be like $3000+ per tx and every block full).\n\nNo one is building an energy plant TO mine BTC they're building them AND mining BTC. The plant needs to generate peak-energy all day long even if it's only necessary for 1-2 hours so they sell the excess to a miner (at a subsidy) so they have a customer ready 24/7 no matter the circumstance. The mining operation isn't losing any money when they're not receiving power the other 16 hours of the day because *during those hours energy costs are too much* that it isn't profitable mine BTC like it is during non peak hours (the hashrate really is that high right now). The costs tied up in hardware are negligible compared to the cost of electricity to run them. In another halving the miner might need to build a whole new solar plant just to maintain their income (as there's only a small amount of coal plants to *turn on* before building anew).\n\nAnd governments control all of this. If they ban mining, that's it, it's over. You can't hide a $1900 residential power bill. Governments dictate electricity costs via subsidies so they can decide who and who can't afford to mine, when and where. Instead of censoring people's right to electricity they're using free market principals to incentivize clean energy development instead. If there's ever not enough power (we run into crisis, aka Texas) crypto mines are the very first thing shut off because the gov treats them as a tool for building a lot more than a commodity. The US gov has green energy in their sights but are dependent on oil and coal themselves so it's a very nuanced progression the two each need to work through together. Banning it removes incentives for growth and only pushes it 'underground' where you can't tell how it was being generated.\n\nI think BTC uses too much bad energy today but I think it'll solve *itself* by the end of the decade via more halvings and access to even cheaper clean-energy. If it doesn't and we see people burning 200K of coal for a 400K coin then yea we're fucked but also without BTC that means they'd still be making profit using coal anyways. The game has to be to phase *out* coal but without any incentive it's never going away.\n\nI'm not convinced all of this will happen but it's beginning to now. Make lemonade when you can.. In another halving or two any elec that isn't subsidized (clean) won't be profitable to mine BTC with so I'm going to wait until then to get pissed and give this progression a chance to play out first. If the narrative changes to energy crisis people won't value BTC as much anyway so the price will go down (institutional money aka ESG compliance moves the markets), it's just the energy crisis narrative is sort of a moot point when it's still in such an abundance. I think a factory that turns power into plastic dolls is a net negative to the environment because that cannot be made renewable whereas this *can* be, it just takes time.\n\nIt's a global issue so to pick on one thing doesn't make sense to me instead of trying to make that thing work toward it instead. Crypto can be mined using proof of donating food, or a proof of cleaning street trash, it's a great way to incentivize behaviours across the world, it's just BTC's case that incentive is zero cost energy - how people utilize that or get to that point is up to them (and coal isn't zero cost). Now there's at least an incentive (steady paycheque) for trying and failing and trying again and failing and trying again, something no investor would touch otherwise. No one is picking on cargo ship bunker fuel *which is avoidable* and can't be used for good, or the other *billion* things wrong with the world today that are a net negative to the environment. The solution isn't to get rid of cargo ships and bottled water, it's to use them better or only in the places that makes sense.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i95boh7",
                    "author": "RavSammich",
                    "score": 1,
                    "created_utc": 1652922876.0,
                    "response": "I’m fairly certain fiat kills more trees than crypto, and in turn, whole ecosystems. Crypto mining also probably only takes a fraction of the energy/resources required to make a Tesla battery…I’m just speculating of course…",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9esptj",
                    "author": "0x1a3c3e7",
                    "score": 1,
                    "created_utc": 1653103517.0,
                    "response": "One of the most important mechanics of POW is how the blockchain is longer and has more work/energy put into it than what any counterfeit blockchain can match.  This is how new nodes, who have no transaction history, are able to distinguish the genuine blockchain from all counterfeits before they start to sync with it.\n\nSince POS blockchains don't have any work in them, how do new nodes distinguish the genuine blockchain from the fakes?",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}