{
    "subreddit": "CryptoMarkets",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "urtv2z",
            "title": "When I see how art and NFTs interact, it inspires me",
            "url": "https://www.reddit.com/r/CryptoMarkets/comments/urtv2z/when_i_see_how_art_and_nfts_interact_it_inspires/",
            "author": "PersonalAd7357",
            "created_utc": 1652814702.0,
            "score": 2,
            "num_comments": 8,
            "subreddit": "CryptoMarkets",
            "selftext": " In a relatively short period of time, NFTs have wreaked havoc on the crypto market.\n\nAs a large fan of art, collecting, and NFTs, this period in art when art and the NFT world collide inspires me much. NFT is reaching a wider range of enterprises, fashion houses, and designers, according to what we're hearing.  \n\nTo be honest, I began collecting at a young age, starting with marbles, sports cards, and other small items. NFT collecting attracted me as I grew older and witnessed the growth of technology, but I still wanted to keep the tactile part of collecting.\n\n I've just visited a few different markets/projects, both for gaming and art, and I must say that I really enjoy how SK8coin is going and can't wait to see all of their new collections. \n\nBut I've found that I'm always spinning the same ones, so I forced myself to go out and find some new ones to see what other options I had with new NFTs. This Ludo Showcase, which operates similarly to Instagram for NFTs, is an extremely useful searching tool when it comes to the new NFT collection. \n\n&#x200B;\n\n If you have any information about some amazing new marketplaces, I'd love to hear from you!",
            "stickied": false,
            "comments": [
                {
                    "id": "i8zeovl",
                    "author": "CointestAdmin",
                    "score": 1,
                    "created_utc": 1652815457.0,
                    "response": "NFT [pros](/r/CryptoMarkets/comments/urtv2z/when_i_see_how_art_and_nfts_interact_it_inspires/i8zeq5r/) & [cons](/r/CryptoMarkets/comments/urtv2z/when_i_see_how_art_and_nfts_interact_it_inspires/i8zeqr4/) and related info are in the collapsed comments below. Pros and cons will change for every new post. Submit a pro/con argument in the [Cointest](https://www.reddit.com/r/CointestOfficial/wiki/cointest_policy) and potentially win [Moons](https://coinmarketcap.com/currencies/moon/). Moon prizes by award for the General Concepts category are: **1st - 300, 2nd - 150, 3rd - 75, and Best Analysis - 500.** \r\n\r\n---\r\n\r\nTo submit an NFT pro-argument, [click here](https://www.reddit.com/r/CointestOfficial/comments/t5mmx5/general_concepts_nft_proarguments_march_2022/). | To submit an NFT con-argument, [click here](https://www.reddit.com/r/CointestOfficial/comments/t5mmxu/general_concepts_nft_conarguments_march_2022/).",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i90jki2",
                    "author": "caixabancyc",
                    "score": 1,
                    "created_utc": 1652833589.0,
                    "response": "I have actually been keeping my eyes on LUXY, the polygon-based NFT marketplace majorly cause of its low fees, there happens to be another one that excites me but that's not live yet, the name is DEIP it is building a marketplace for tokenized intangible assets like IPs.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i981dj5",
                    "author": "apstl88",
                    "score": 1,
                    "created_utc": 1652979563.0,
                    "response": "Artists will be able to benefit from NFTs in so many ways. It's way more than just jpegs and gifs. If you take a look at some upcoming projects you will see that there is a lot of interesting stuff to be found. I'm anticipating Unique Network's launch as a Polkadot parachain and they are actually the first one on Polkadot. Not just that you can experiment with next-gen NFTs and mint them, but you can also create your own marketplace which is a great feature, especially for the artists. They are also giving us the opportunity to create RFTs (re-fungible) which opens to way to shared ownership and a lot of other stuff.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}