{
    "subreddit": "CryptoTechnology",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ultsbf",
            "title": "A bitcoin generator from 2013",
            "url": "https://www.reddit.com/r/CryptoTechnology/comments/ultsbf/a_bitcoin_generator_from_2013/",
            "author": "habsnkush",
            "created_utc": 1652110098.0,
            "score": 47,
            "num_comments": 31,
            "subreddit": "CryptoTechnology",
            "selftext": "Before I was in high school (2013 or earlier), my dad & his 2 buddies dropped, collectively, just under $10 000 on this bitcoin generator that sits in my dads basement.\n\nI was too young to grasp the concept of it. \n\nI recently found out that bitcoin is worth about $50K Canadian for 1 coin.  \n\nRealistically speaking, how does this bitcoin generator work? Is my dad a secret millionaire? \n\nI asked my dad about bitcoin (obviously not his bank account balance - I know he’s very well off because of his job & his insanely good money habits) but he said he didn’t even have one bitcoin…. But what the fuck was the  $10000 generator doing then??\n\nGenuinely curious but I know very little about this stuff; wouldn’t that generator have generated a few bitcoins at the very least? Especially considering the price of bitcoin in 2013 vs 2022?",
            "stickied": false,
            "comments": [
                {
                    "id": "i7xjfmi",
                    "author": "hi3r0fant",
                    "score": 89,
                    "created_utc": 1652110835.0,
                    "response": "If he was mining bitcoin from 2013 probably you re millioners and he s bullshitting you for a good reason.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7xuzqa",
                            "author": "DragonSided-D",
                            "score": 26,
                            "created_utc": 1652115434.0,
                            "response": "There were generations of ASICs for BTC mining pumped out in rapid succession (<6 months) from ca. 2012 - 2017ish\n\nCompanies (primarily Chinese) would fabricate a bunch, run them while the next generation was in development, and then sell the old ones just as the new ones came online -- to help fund development of the next generation.\n\nThese were typically solo miners, so you either got lucky and found a block, or (more likely) not.\n\nSo, this is probably an ASIC that was offloaded just as it become \"obsolete\". If your Dad ran it consistently for a few years immediately after obtaining it, he may have quite a few BTC.\n\nPower it up and see if you can find the wallet address it mined to. Beautiful thing about BTC: if you know the address, you know everything that happened to the coins.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7xvmx6",
                                    "author": "hi3r0fant",
                                    "score": 13,
                                    "created_utc": 1652115687.0,
                                    "response": "Yeah but spending 10k for mining equipment on 2013 would be enough to mine a lot at least at the beggining",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i7yif2r",
                            "author": "_dekappatated",
                            "score": 14,
                            "created_utc": 1652124935.0,
                            "response": "Wrong, most likely he sold it already.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7ysddo",
                                    "author": "energetic-dad",
                                    "score": 10,
                                    "created_utc": 1652129003.0,
                                    "response": "I don't know why you got downvoted. He absolutely sold it already. No one who is good with money would not sell most of an investment that was up 25,000%",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i7ytikw",
                                            "author": "hi3r0fant",
                                            "score": 3,
                                            "created_utc": 1652129479.0,
                                            "response": "I would have also sold. No doubt about that",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i7yy0cg",
                                                    "author": "energetic-dad",
                                                    "score": 3,
                                                    "created_utc": 1652131388.0,
                                                    "response": "Honestly be stupid not to. I'll never sell all my BTC stack, but if I was ever up 25,000%, you better believe I'd sell a lot",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i7xm42x",
                    "author": "RockBlesnar",
                    "score": 26,
                    "created_utc": 1652111898.0,
                    "response": "He might have sold them off while mining. If he kept some of it he's rich as fuck right now. Back then this would have mined alot of btc",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7xm91h",
                    "author": "i_heart_dial-up",
                    "score": 29,
                    "created_utc": 1652111954.0,
                    "response": "$10,000 Bitcoin generator lol sounds like something Billy Mays would try selling to you on a late night infomercial",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7xizcd",
                    "author": "jpgoegel",
                    "score": 10,
                    "created_utc": 1652110652.0,
                    "response": "what does this device look like?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7xwbgo",
                            "author": "DragonSided-D",
                            "score": 4,
                            "created_utc": 1652115960.0,
                            "response": "Yes, OP should please post a picture of the device (especially model information, if any, and screen shots)\n\nAlso: IMO this sub's minimum post length should be decreased a little, I am being unnecessarily  verbose here.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7yucsz",
                                    "author": "habsnkush",
                                    "score": 4,
                                    "created_utc": 1652129834.0,
                                    "response": "I live in a different province but yes next time I’ll definitely take a picture & post a repost with more information… I know if I ask my dad for a picture he’ll ask too many questions & wont send it haha",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i7yqane",
                    "author": "DangKilla",
                    "score": 4,
                    "created_utc": 1652128145.0,
                    "response": "2013 was a weird time for mining. Before then you could mine on a usb stick asic for a short period.\n\nWhat probably happened is he bought a miner and it shipped a year late, hence it didnt mine anything and he lost $10,000, because the power cost was not worth it.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}