{
    "subreddit": "CryptoMarkets",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "upzi6e",
            "title": "Tethers market cap plunged. Is it time?",
            "url": "https://i.redd.it/o8owve13xkz81.jpg",
            "author": "Mannit578",
            "created_utc": 1652594060.0,
            "score": 147,
            "num_comments": 138,
            "subreddit": "CryptoMarkets",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8obb9k",
                    "author": "AdvertisingWitty4373",
                    "score": 103,
                    "created_utc": 1652603913.0,
                    "response": " the fact that this is just starting to bother people is a proof how messed up entire financial system is",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8pb59s",
                            "author": "AmericanScream",
                            "score": 23,
                            "created_utc": 1652627054.0,
                            "response": "Agreed.  The whole \"Don't trust - verify\" crowd stuck their heads in the sand the moment Tether and Circle refused to have their \"asset backed stablecoins\" properly audited.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8pirlk",
                                    "author": "OrdainedPuma",
                                    "score": 8,
                                    "created_utc": 1652630474.0,
                                    "response": "Pretty sure circle is verified.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8pnmxv",
                                            "author": "AmericanScream",
                                            "score": 10,
                                            "created_utc": 1652632560.0,
                                            "response": "You would be incorrect.  Their assets have not been formally audited. They're using attestations from the same shady firm that Tether uses.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8pucbw",
                                                    "author": "OrdainedPuma",
                                                    "score": 7,
                                                    "created_utc": 1652635467.0,
                                                    "response": "Ah, correct. Just an attestation from Grant Thornton.\n\nLol, wait, Grant Thornton, the seventh largest accounting firm in the world is \"shady\"? Aight...",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8qmlqk",
                                                            "author": "alexcmpt",
                                                            "score": 3,
                                                            "created_utc": 1652647901.0,
                                                            "response": "I worked for one of the big four coming out of Uni- you do realize that they’re the ones who totally fucked up on: Enron, Wirecard, Worldcom, etc. - so yes, entirely possible that they’re fucking up again.",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "i8qcqur",
                                                            "author": "Longjumping_Yam_5230",
                                                            "score": 1,
                                                            "created_utc": 1652643586.0,
                                                            "response": "I'm sorry but yes, all those firms are shady 🤣 \n\nBut point taken, they wouldn't openly lie. However...",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8puqc9",
                            "author": "thebig_dee",
                            "score": 3,
                            "created_utc": 1652635633.0,
                            "response": "I'd correct financial system to crypto market.\n\nThe financial system has nothing to do with tether. \n\nIf it was a JP Mogan coin or CBDC I'd say finance system",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8qzc99",
                                    "author": "DemApples4u",
                                    "score": 1,
                                    "created_utc": 1652653502.0,
                                    "response": "Who are the biggest backers of circle and tether? I think you'll have your answer\n\nhttps://markets.businessinsider.com/news/currencies/circle-crypto-digital-bank-usdc-stablecoin-goldman-sachs-backed-2021-8",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8p3ktc",
                    "author": "RedMiceBlues",
                    "score": 13,
                    "created_utc": 1652623531.0,
                    "response": "Everything looks like crap right now. Take a look to Bitcoin market cap",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8qxebf",
                            "author": "Awkward_Potential_",
                            "score": 1,
                            "created_utc": 1652652618.0,
                            "response": "Bitcoin can crash and not go to 0. If Tether even looks like it will crash there is no \"30% drawdown\". \n\nIn other words, we always say \"you don't lose untill you sell\". If Tether goes down, you lose. Death spiraling isn't easy to stop.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8p0ona",
                    "author": "georgotpyrc",
                    "score": 39,
                    "created_utc": 1652622096.0,
                    "response": "Tether is handling all the requested withdrawals without problems as far as I know. \n\nThey managed to pay out over 7 billion US Dollars in just a few days. I'd say this is very impressive and far from concerning actually.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8p4k3j",
                            "author": "Umarzy",
                            "score": 12,
                            "created_utc": 1652624009.0,
                            "response": "It's impressive, no doubt. But why is it that people are redeeming Tether for fiat USD this much the past few days. Has this huge figure ever been redeemed before? Or may be some are scared it may collapse due to UST fiasco?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8p6ysw",
                                    "author": "georgotpyrc",
                                    "score": 18,
                                    "created_utc": 1652625147.0,
                                    "response": "There always has been rumors that Tether is not fully backed, etc. My guess is, that in the light of the UST collapse a lot of people got scared and tried to get into other stables or fiat. \n\nI think it is the largest amount redeemed within a couple days so far.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8pbw56",
                                            "author": "AmericanScream",
                                            "score": 17,
                                            "created_utc": 1652627391.0,
                                            "response": "> There always has been rumors that Tether is not fully backed, etc.\n\nThey're not rumors.  They're facts.\n\nTether told everybody they were 1:1 fiat backed, and then the New York Attorney General [sued them](https://ag.ny.gov/press-release/2021/attorney-general-james-ends-virtual-currency-trading-platform-bitfinexs-illegal) and in discovery it was revealed they were lying, and only had about 3% in fiat.  If it weren't for evil government taking action they'd still be lying - and they continue to lie, and refuse to have their assets properly [audited](https://i.imgur.com/buhqFqw.jpg)",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8pfaek",
                                                    "author": "georgotpyrc",
                                                    "score": 4,
                                                    "created_utc": 1652628941.0,
                                                    "response": "Being not fully backed and not 1:1 fiat backed is two very different things.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8pnt6z",
                                                            "author": "AmericanScream",
                                                            "score": 7,
                                                            "created_utc": 1652632636.0,
                                                            "response": "The whole point of a stablecoin is to have a high degree of liquidity and the assets held in stable reserves.  It's now known that Tether is actually claiming to use other cryptos as assets backing their crypto, which is incredibly risky and anything but \"stable.\"",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8q1jez",
                                                                    "author": "never_safe_for_life",
                                                                    "score": 3,
                                                                    "created_utc": 1652638594.0,
                                                                    "response": "It's one thing to be internet outraged by their lack of transparency and another for them to be insolvent. So far they've handled a large spike in withdrawals no problem.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                },
                                                                {
                                                                    "id": "i8pur06",
                                                                    "author": "georgotpyrc",
                                                                    "score": 2,
                                                                    "created_utc": 1652635641.0,
                                                                    "response": "I think the whole point of a stable coin is to be maintain a stable price compared to it's underlying. There are multiple ways to achieve this.\nI'm not denying that Tether has behaved sketchy in the past and is operating far from transparent and that there are probably better alternatives. I'm just saying that so far they are managing the situation very well and there are no signs whatsoever that they are unable the pay out their clients, which is calming.\nAlso I think there's nothing wrong with collaterizing using cryptocurrency if it's done correctly (for reference  just look at DAI/Maker).",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "i8q0skq",
                                                            "author": "Masterzjg",
                                                            "score": 1,
                                                            "created_utc": 1652638266.0,
                                                            "response": ">In the case of Tether, the company represented that each of its stablecoins were backed one-to-one by U.S. dollars in reserve.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i8p9k00",
                                            "author": "Umarzy",
                                            "score": 3,
                                            "created_utc": 1652626336.0,
                                            "response": "Well said. Same way I thought",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i8p9z8s",
                                            "author": "Master-Monitor112",
                                            "score": 1,
                                            "created_utc": 1652626527.0,
                                            "response": "Yes and luckily not too many people 😀",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i8p9oi4",
                                    "author": "Master-Monitor112",
                                    "score": 2,
                                    "created_utc": 1652626392.0,
                                    "response": "It’s because of the UST crash. I noticed right after the crash tether dipped as low as 96 cents . It’s now nearly $1 again.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8pz3ty",
                            "author": "artmorte",
                            "score": 4,
                            "created_utc": 1652637535.0,
                            "response": "7 billion dollars is less than 10% of their market cap, 10% was hardly going to be an issue. The question is how far can they go and still find the dollars? 30%? 40%? No one believes they have 100% of their market cap in US dollars, the question is how much they've got.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8qtmvo",
                                    "author": "5823059",
                                    "score": 1,
                                    "created_utc": 1652650960.0,
                                    "response": "Your position in line for the bank run matters.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8pbmci",
                            "author": "AmericanScream",
                            "score": 7,
                            "created_utc": 1652627266.0,
                            "response": "Where is the evidence Tether is cashing people out?\n\nThey could just be burning USDT because they've been using other crypto as collateral and now the value of those assets has plummeted and they need to remove USDT from the market.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8qs7ni",
                                    "author": "PixiePooper",
                                    "score": 1,
                                    "created_utc": 1652650351.0,
                                    "response": "Could you explain what you mean here?\n\nTether can only only burn USDT that they have - so that means that people have redeemed USDT for USD which is why they have an excess.\n\nIf Tether had been buying (say) BTC with the USD and holding the BTC as collateral - then they are in trouble when the price of BTC drops, sure, but I don’t see how this means they need to burn USDT?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8ooj68",
                    "author": "CukaCora",
                    "score": 33,
                    "created_utc": 1652614883.0,
                    "response": "Just to be safe and to avoid another UST, i converted all my USDT to BUSD",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8p3xvk",
                            "author": "nitrolimitz",
                            "score": 25,
                            "created_utc": 1652623705.0,
                            "response": "BUSD is good too but tbh if I were you I'd go with DAI or USDC more decentralized from what I can tell",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8pilla",
                                    "author": "yogofubi",
                                    "score": 3,
                                    "created_utc": 1652630404.0,
                                    "response": "USDC is centralised, just sayin",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8pj5z1",
                                            "author": "nitrolimitz",
                                            "score": 2,
                                            "created_utc": 1652630646.0,
                                            "response": "Wait really? I didn’t know that, guess DAI is the best bet then?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8pjr7r",
                                                    "author": "yogofubi",
                                                    "score": 5,
                                                    "created_utc": 1652630899.0,
                                                    "response": "Well, it depends what you deem to be better. DAI is completely decentralised but does come with risks, being tied to a crypto asset (nothing like UST don't worry)\n\nUSDC is not decentralised at all but the funds are verified. The company that runs it is called Circle. USD-C.\n\nSame as Tether, although Tether are worryingly guarded and ambiguous about the funds that back the coin.\n\nPersonally I trust DAI more than any other stable",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8pnvux",
                                                            "author": "Popular-Appearance24",
                                                            "score": 2,
                                                            "created_utc": 1652632668.0,
                                                            "response": "Dai is over collateralized the reason I use it.",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "i8qjlf6",
                                                            "author": "SantiagoSchw",
                                                            "score": 1,
                                                            "created_utc": 1652646611.0,
                                                            "response": "DAI is not \\*completely\\* decentralized since a good amount of the supply is backed by centralized assets (USDC).",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i8pbrum",
                                    "author": "captainvontage801",
                                    "score": 3,
                                    "created_utc": 1652627336.0,
                                    "response": "BUSD is gonna cost way less in fees though. USDC with gas and trans fees would be higher I'm pretty sure. I still think USDC is the safest of the bunch though.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8pewko",
                                            "author": "nclark8200",
                                            "score": 4,
                                            "created_utc": 1652628770.0,
                                            "response": "What makes you say that USDC is the safest? \n\nI currently have a decent chunk of money in USDC and after all this UST stuff I've been reevaluating stable coins. The number one thing I'm concerned with is the stablecoin being backed 1:1. BUSD has monthly audits by a 3rd party proving this. USDC has some audits/publications, but don't see nearly as open of a book as BUSD. Am I wrong about that?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8pzob8",
                                                    "author": "captainvontage801",
                                                    "score": 1,
                                                    "created_utc": 1652637784.0,
                                                    "response": "I always thought USDC had more transparency. It has to comply with government regulations here in the USA. But the cool thing that I like with BUSD is that pretty much all BUSD is actually in cash reserves. I think USDC is a little more diversified.  It's something like only 60% cash reserves. USDC is basically Coinbase which makes me also feel a little safer.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i8qlhln",
                                            "author": "flamenwerger",
                                            "score": 1,
                                            "created_utc": 1652647433.0,
                                            "response": "USDC exists on a TRC20 as well ;)",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i8pesi9",
                                            "author": "Bagmasterflash",
                                            "score": -5,
                                            "created_utc": 1652628716.0,
                                            "response": "Bunance is major culprit in the USDT farce.  If Tether goes down so does Binance\n\n💪usd is far and away the best stablecoin to be in.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8p6ft4",
                            "author": "TheBigShrimp",
                            "score": 6,
                            "created_utc": 1652624898.0,
                            "response": "Someone explain to me why you'd rather hold a stablecoin than USD in and FDIC insured bank account",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8pd20v",
                                    "author": "StatisticalMan",
                                    "score": 9,
                                    "created_utc": 1652627927.0,
                                    "response": "because I can't use a dollar on the blockchain.\n\nUsing a DEX will require stablecoins (at least temporarily)\nBorrowing against crypto on defi platforms will require stablecoins (at least temporarily)\nDefi lending will require stablecoins (at least temporarily)\nDollar based liquidity pools will require stablecoins (at least temporarily)\nQuickly transfering \"dollars\" between exchanges will require stablecoins (at least temporarily)\n\nStablecoins are a tool. \n\nSure if the Federal Reserve issued tokenized dollars which could be used on Ethereum and other blockchains there would be no need for stablecoins until then:\n\nstablecoin = tokenized dollar on a blockchain",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8pf76g",
                                    "author": "Bagmasterflash",
                                    "score": 5,
                                    "created_utc": 1652628902.0,
                                    "response": "Arbitrage is the name of the game and it’s necessary for market makers that make money on those margins. USD takes time to move stablecoin is instant. Arbitrage is about being the first to the show.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8pb5np",
                                    "author": "hyperparasitism",
                                    "score": 3,
                                    "created_utc": 1652627059.0,
                                    "response": "On-ramp and off-ramp exchanging is easier with a stablecoin compared to having to go through repeated fiat to crypto exchanges.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8p709c",
                                    "author": "francesco93991",
                                    "score": 6,
                                    "created_utc": 1652625166.0,
                                    "response": "Because some people don't trust banks.\n\nAlso they might want to be ready to buy their favorite crypto asset when it's time, without having ti wait for a bank transfer to the exchange to be cleared up",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8pbfz8",
                                            "author": "AmericanScream",
                                            "score": 7,
                                            "created_utc": 1652627184.0,
                                            "response": "You don't need to trust banks.  They're regulated by law to not screw people over.  You need trust when you're dealing with CEXs because they have no oversight and no guarantee of protecting peoples' deposits.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8pm9ka",
                                                    "author": "inbeforethelube",
                                                    "score": 5,
                                                    "created_utc": 1652631977.0,
                                                    "response": "When people say they don't trust banks in crypto I take it to mean they don't want their money in the fractionalized system creating more debt, not that they think the bank is going to steal their money.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8potue",
                                                            "author": "francesco93991",
                                                            "score": 1,
                                                            "created_utc": 1652633076.0,
                                                            "response": "exactly this, thanks",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "i8pn5ye",
                                                            "author": "AmericanScream",
                                                            "score": 0,
                                                            "created_utc": 1652632360.0,
                                                            "response": "Those people should read up on the history of banking and how less stable the economy was under a pure asset-backed system.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8pysjp",
                                                                    "author": "Oneloff",
                                                                    "score": 2,
                                                                    "created_utc": 1652637396.0,
                                                                    "response": "So the economy we live in now is more stable than before?!\n\nSir this is not Wendy’s.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i8pmhdj",
                                                    "author": "jgkeeb",
                                                    "score": 2,
                                                    "created_utc": 1652632069.0,
                                                    "response": "Banks have already failed in our lifetime… anyone that didn’t learn that lesson besides “too big too fail” is naive.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8pn2mx",
                                                            "author": "AmericanScream",
                                                            "score": 1,
                                                            "created_utc": 1652632319.0,
                                                            "response": "Banks fail all the time, but there's an infrastructure to protect consumers from losses as a result, that allows the Feds to sweep in and take control of things before they get worse.  That's the beauty of the FDIC system.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8pv8y1",
                                                                    "author": "jgkeeb",
                                                                    "score": 3,
                                                                    "created_utc": 1652635858.0,
                                                                    "response": "Full faith and blind trust in the FED has been proven wrong in our very lifetime. Doubly proven out by current inflation crisis.\n\nDiversity is a foundation for any intelligent responsible investment portfolio - why then would it be irresponsible or risky to diversify risk out of bank accounts into cold wallets and personal physical safes?",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i8pl1oq",
                                                    "author": "imacomputertoo",
                                                    "score": 0,
                                                    "created_utc": 1652631457.0,
                                                    "response": "Agreed. Banks can be scummy, but the whole idea that crypto is a way to opt out of an unfair system is kinda flawed. It's like people saying we need to go to Mars to escape the climate problems on earth. Whatever problems we have here, I assure you the climate of Mars is much worse. \n\nCrypto has some amazing capabilities, and I think a huge amount of profitable businesses will be built on it. However, crypto is much riskier than any bank.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8pnbx9",
                                                            "author": "AmericanScream",
                                                            "score": -1,
                                                            "created_utc": 1652632431.0,
                                                            "response": "I agree with the first half, but not this:\n\n>Crypto has some amazing capabilities\n\nI find nothing better about crypto.  See [here](https://reddit.com/r/CryptoReality/comments/lq6xpq/the_defacto_list_of_cryptocurrencyblockchain/)",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8pogjb",
                                                                    "author": "imacomputertoo",
                                                                    "score": 3,
                                                                    "created_utc": 1652632916.0,
                                                                    "response": "In rich stable countries, crypto didn't have a lot of regular consumer use. We can still get cheap loans from the bank. But in many other countries in the world a defi loan is far superior to anything they have access to at a bank. 7, 8, or 9% rates are great for them. It's been big in south East Asia.\n\nFor rich countries you can still benefit from the 24 hour opened of blockchains. It's incredibly cheap to move lots of money on the lightning network. And there's potential for lightning to replace traditional credit and debit cards because it's so cheap and fast.\n\nHow did you end up in this sub?",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i8pe7op",
                                    "author": "Stiltzkinn",
                                    "score": 2,
                                    "created_utc": 1652628454.0,
                                    "response": "Taxes.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8p90x6",
                                    "author": "CukaCora",
                                    "score": 1,
                                    "created_utc": 1652626094.0,
                                    "response": "Well i use it to buy crypto, i dont hold it for long.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8pba90",
                            "author": "AmericanScream",
                            "score": 1,
                            "created_utc": 1652627115.0,
                            "response": "There is no safe stablecoin.  They're all co-mingled with each other, and nobody knows where the liquidity actually is.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8qfa3t",
                                    "author": "PixiePooper",
                                    "score": 1,
                                    "created_utc": 1652644710.0,
                                    "response": "It’s a little disingenuous to say that they are ‘co-mingled’ USDC for example says it’s fully backed by USD and short-term US government debt - I’m not sure how this has anything to do with any other crypto stable coin?",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8pfdrg",
                                    "author": "Bagmasterflash",
                                    "score": -2,
                                    "created_utc": 1652628983.0,
                                    "response": "Coinflex is a transparent and forthright as they come.  The best product and probably the only viable one on the market.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8p7mmo",
                    "author": "Rich-Manner-818",
                    "score": 4,
                    "created_utc": 1652625455.0,
                    "response": "I converted all of my crypto to $ USD. Fuk this",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8pcjnv",
                            "author": "AmericanScream",
                            "score": 2,
                            "created_utc": 1652627694.0,
                            "response": "If that's still sitting in a CEX account, you're not safe until you put it in a FDIC insured regular bank account.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8pdzai",
                                    "author": "Rich-Manner-818",
                                    "score": 5,
                                    "created_utc": 1652628348.0,
                                    "response": "Transferred it out of Kraken into my Fidelity where its safe.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8otbkv",
                    "author": "Sorry_Attitude_",
                    "score": 7,
                    "created_utc": 1652617989.0,
                    "response": "It really means nothing, a lot of people probably just switched or they wanted to be able to hold volatility down\n\nIt is barely a hitch in the marketcap lol, I don't like USDT and i hope it dies but slow so it doesn't affect us\n\nI'm happy the Algorand market is mostly working with USDC or, at the moment, local stablecoins like STBL\n\nhope Kaddex takes this path too and not work with USDT as much as possible, DAI stablecoin type of infrastructure or USDC transparency only. Can't play with people's money like UST",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8q0gti",
                            "author": "Oneloff",
                            "score": 1,
                            "created_utc": 1652638124.0,
                            "response": "I love DAI but use USDC, don’t ask me why. 😅",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8o42ed",
                    "author": "ma0za",
                    "score": 20,
                    "created_utc": 1652597792.0,
                    "response": "You Are half a week too late and IT allready recovered?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8o46cu",
                            "author": "Mannit578",
                            "score": -56,
                            "created_utc": 1652597883.0,
                            "response": "I think your new to markets, this is market cap, it has not recovered. Do you know what a market cap is?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8obaep",
                                    "author": "LambosAndYachts",
                                    "score": 15,
                                    "created_utc": 1652603894.0,
                                    "response": "Dumb nut lmao",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8o4ls2",
                                    "author": "ma0za",
                                    "score": -25,
                                    "created_utc": 1652598227.0,
                                    "response": "Are You dense? Ofc. This is Market cap but What matters is wether It depegs or Not and IT clearly recovered Genius.\n\nMarket cap going down means Tether beeing converted back instead of printed. Tough shit welcome to Your first bear.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8o4xw0",
                                            "author": "tiltdioxide",
                                            "score": 79,
                                            "created_utc": 1652598500.0,
                                            "response": "You are both so toxic you should get married.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8oyx4p",
                                                    "author": "Apetardo",
                                                    "score": 15,
                                                    "created_utc": 1652621165.0,
                                                    "response": "Now kith",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i8o5i74",
                                                    "author": "Mannit578",
                                                    "score": -14,
                                                    "created_utc": 1652598975.0,
                                                    "response": "I already have our ring ready ;) it’s going to be beautiful",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i8ovvt1",
                                                    "author": "happybonobo1",
                                                    "score": 1,
                                                    "created_utc": 1652619493.0,
                                                    "response": "Are you sure? This is creating the anti-Christ level stuff!",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i8oge8s",
                                            "author": "jkocjan",
                                            "score": 2,
                                            "created_utc": 1652608305.0,
                                            "response": "It does matter, the USDT is major on-ramp to buy btc and the rest of the market.\nThe market cap going down implies that large players are cashing out and moving away away from the market, one can reasonably assume that prices will drop further, but it could also just be a reflection of the fact that the prices have dropped and players moved on.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8oion9",
                                                    "author": "ma0za",
                                                    "score": 2,
                                                    "created_utc": 1652610281.0,
                                                    "response": "Can you quote where i said this was bullish for crypto? I said this is irrelevant to wether tether holds its peg.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i8o5hc5",
                                            "author": "Mannit578",
                                            "score": -7,
                                            "created_utc": 1652598955.0,
                                            "response": "Yeah but this has been happeneing for the past 7 days, and yes that means they are using their reserves. I was mentioning marketcap not recovering not the peg, the thing is they have non cash reserves and commerical paper so how do they liquidate that?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8o5pv5",
                                                    "author": "ma0za",
                                                    "score": -6,
                                                    "created_utc": 1652599154.0,
                                                    "response": "There are plenty of Highly liquid Reserves they hold besides cash. There are Audit Dokumentations showing That.\n\n***Edit: to the Clowns downvoting because \"tether bad, i read it online\":***\n\n***Audit from December 2021***\n\n[https://assets.ctfassets.net/vyse88cgwfbl/4hiNJsZ98LlZqCJHKzrLpV/2b6338482ef0093382885f80ba6f1083/Tether\\_Assurance-12-31-21.pdf](https://assets.ctfassets.net/vyse88cgwfbl/4hiNJsZ98LlZqCJHKzrLpV/2b6338482ef0093382885f80ba6f1083/Tether_Assurance-12-31-21.pdf)\n\n***Edit2: for the clowns proposing this is not an audit, here the definition of what an Audit is:***\n\n>to make an official examination of the accounts of a business and produce a report\n\nSource: [https://dictionary.cambridge.org/de/worterbuch/englisch/audit](https://dictionary.cambridge.org/de/worterbuch/englisch/audit)\n\n***Tether got a shady reputation, i get it. non the less this is an audit of its reserves by a independent body.***\n\n***you dont have to like tether, i couldnt care less for a stable coin. But sometimes checking facts is better than sheepish social media crowd behaviour.***",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8o627p",
                                                            "author": "Mannit578",
                                                            "score": 2,
                                                            "created_utc": 1652599437.0,
                                                            "response": "An attestation is not an audit",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8onxoa",
                                                                    "author": "Khemul",
                                                                    "score": -3,
                                                                    "created_utc": 1652614459.0,
                                                                    "response": "While this is true, it's the closest we get to an audit. Everyone uses attestations for this type of thing in crypto. I wouldn't be surprised if the first major regulatory push is for actual audits to be used.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "i8ocg8u",
                                                            "author": "pryz33",
                                                            "score": 3,
                                                            "created_utc": 1652604892.0,
                                                            "response": "there are NOT audit documents showing that",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8ocuff",
                                                                    "author": "ma0za",
                                                                    "score": -3,
                                                                    "created_utc": 1652605235.0,
                                                                    "response": "here the link to the last audit report from December 2021 clearly showing Reserves of highly liquid cash and cash equivalents.\n\n[https://assets.ctfassets.net/vyse88cgwfbl/4hiNJsZ98LlZqCJHKzrLpV/2b6338482ef0093382885f80ba6f1083/Tether\\_Assurance-12-31-21.pdf](https://assets.ctfassets.net/vyse88cgwfbl/4hiNJsZ98LlZqCJHKzrLpV/2b6338482ef0093382885f80ba6f1083/Tether_Assurance-12-31-21.pdf)\n\n*Edit: for the clowns proposing this is not an audit, here the definition of what an Audit is. Tether got a shady reputation, i get it. non the less this is an audit of its reserves by an independent body.* \n\n[https://dictionary.cambridge.org/de/worterbuch/englisch/audit](https://dictionary.cambridge.org/de/worterbuch/englisch/audit)",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i8opel0",
                                                                            "author": "pryz33",
                                                                            "score": 2,
                                                                            "created_utc": 1652615482.0,
                                                                            "response": "that is NOT an audit",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i8oqf5d",
                                                                                    "author": "ma0za",
                                                                                    "score": -3,
                                                                                    "created_utc": 1652616150.0,
                                                                                    "response": "Educate yourself. Its the very Definition of an Audit.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i8oxmuk",
                                                                                            "author": "soooofa_king",
                                                                                            "score": 2,
                                                                                            "created_utc": 1652620467.0,
                                                                                            "response": "No.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "id": "i8p1wnl",
                                                                            "author": "areyoueatingthis",
                                                                            "score": 1,
                                                                            "created_utc": 1652622712.0,
                                                                            "response": "It's not an audit though",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i8p281i",
                                                                                    "author": "ma0za",
                                                                                    "score": -1,
                                                                                    "created_utc": 1652622872.0,
                                                                                    "response": "here is the definition of an audit\n\n[https://dictionary.cambridge.org/de/worterbuch/englisch/audit](https://dictionary.cambridge.org/de/worterbuch/englisch/audit)\n\nwhich is exactly what this is. to the dot.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i8p2u70",
                                                                                            "author": "areyoueatingthis",
                                                                                            "score": 3,
                                                                                            "created_utc": 1652623178.0,
                                                                                            "response": "it's a review, not an audit. I work in finance btw. A review provides limited assurance, while an audit provides a reasonable amount of assurance.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "i8ok2h3",
                                                            "author": "Krowbar2000",
                                                            "score": 1,
                                                            "created_utc": 1652611435.0,
                                                            "response": "Like other crypto assets :)",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8otq0h",
                    "author": "happinesssam",
                    "score": 5,
                    "created_utc": 1652618231.0,
                    "response": "Here's the question - can Bitfinex survive if they let Tether go?\n\nI'm guessing no, (though maybe someone more knowledgeable could weigh in), in which case they are going to be willing to throw a lot more resources at keeping the peg than the guys behind Terra, and they also have a functioning, extremely profitable company to back them up.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8pas3h",
                    "author": "Steering_the_Will",
                    "score": 4,
                    "created_utc": 1652626890.0,
                    "response": "Tether survived the past market crashes which were worse than what we are experiencing now.  I'm not a fan of usdt but I think they'll make it through this bear market.  If usdt tanks, the whole crypto market is going down with it.  I hold usdc or busd until I need to buy something that requires usdt just in case.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8p69fu",
                    "author": "Loose_Screw_",
                    "score": 2,
                    "created_utc": 1652624816.0,
                    "response": "Looks like a small amount of tether holders chose to redeem, thus reducing tether in circulation. Is that a problem?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8qezyl",
                    "author": "lucidvein",
                    "score": 2,
                    "created_utc": 1652644586.0,
                    "response": "is it time.. for what? to switch to usdc?  yeah.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ofyzi",
                    "author": "allbirdssongs",
                    "score": 3,
                    "created_utc": 1652607933.0,
                    "response": "Explain me like im a 6 years old",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8opm9s",
                            "author": "xQx1",
                            "score": 19,
                            "created_utc": 1652615626.0,
                            "response": "Since 2017 a lot of people (myself included) have looked at USDT (Tether) and said \"that ain't stable. They are printing money out of thin air, and if there's a run on that 'coin' it'll collapse.\"\n\nThere's a prevailing view that Bitcoin's price has been manipulated relentlessly by USDT, in the same way that the US stock market was inflated by quantitative easing by the Fed.\n\nTether collapsing would be spectacular. It'd make the UST thing look like a speed bump.\n\nEdit: here's a discussion dedicated to it https://www.reddit.com/r/CryptoCurrency/comments/upuach/discussion_about_usdt_crashing_behind_the_scenes/?utm_medium=android_app&utm_source=share",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8pdt8n",
                            "author": "Crully",
                            "score": 3,
                            "created_utc": 1652628270.0,
                            "response": "When you give them $1, they create 1 token (USDT) and send it to you.\n\nWhen you want your dollar back, you send them the token, they give you your $1, and burn the token.\n\nIn this case, people sent them 3 billion tokens, they gave people back $3 billion dollars, and burned 3 billion tokens.  This reduces the total amount of tokens (USDT) out there, so reduces their Market Cap (total number of tokens \\* price) by the same amount.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8peh9m",
                                    "author": "allbirdssongs",
                                    "score": 3,
                                    "created_utc": 1652628575.0,
                                    "response": "So nothing wrong with it, its just people removing their usdt due to the ust awful mess\n\nBtw where does usdt stores the dollars they use for backup? Now im intrigued, what if that money gets hacked",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8pl6rd",
                                            "author": "Crully",
                                            "score": 3,
                                            "created_utc": 1652631517.0,
                                            "response": "No, it's perfectly normal for this to happen. Quite likely some big players shorted bitcoin when UST crashed (since LFG had a bag they needed to sell so it would drive the price down), and made a fortune, so they closed their shorts, had a lot of USDT and decided to cash it out.\n\nTether appear to have investments in US gov treasuries, \"commercial paper\", and cash in banks.  So if you send them $1, they may put it into various different things in order to generate some interest/earnings that they keep as part of their business model. \n\nBasically it will work as long as people don't ask for more than they have readily available, since they might take a hit to liquidate enough assets to cover a lot of USDT redemptions. So if they kept 10% liquid, then they could cover $7.5 billion in redemptions, but what if someone tries to redeem $10 billion?\n\nTether is also centralised, so they would just freeze the funds if you hacked them directly. They could (and have I believe) had their bank accounts frozen or funds blocked, but that's for them to sort out, it shouldn't affect their business even if they need to hire some lawyers to get it back.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8pltkw",
                                                    "author": "allbirdssongs",
                                                    "score": 2,
                                                    "created_utc": 1652631788.0,
                                                    "response": "Omg what a bloody mess... let us hope they are cool and controlled. But centralization always puts me on my toes...",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8pcdov",
                            "author": "AmericanScream",
                            "score": 1,
                            "created_utc": 1652627619.0,
                            "response": "Read [The Bitcoin Tether Bedtime story](https://old.reddit.com/r/CryptoReality/comments/lrfdpb/the_bitcointether_bedtime_story_an_eli5_version/)",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8peoow",
                                    "author": "allbirdssongs",
                                    "score": 3,
                                    "created_utc": 1652628670.0,
                                    "response": "Thx daddy wish you could read it to me tonight",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8ontdu",
                            "author": "graben_",
                            "score": 1,
                            "created_utc": 1652614374.0,
                            "response": "I second this",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8oy98p",
                    "author": "ThePerfectMatter",
                    "score": 2,
                    "created_utc": 1652620810.0,
                    "response": "USDT is being redeemed, every stablecoin market cap is the same as its circulating supply (duh)\nLast few days was pure panic plebs selling USDT at a slight loss, meanwhile VCs and MM arb the shit out of it to restore the peg and make bank",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8pc7ee",
                            "author": "AmericanScream",
                            "score": 4,
                            "created_utc": 1652627538.0,
                            "response": "There is no evidence there's anywhere near enough liquidity to cash out even 10% of stablecoin holders.\n\nhttps://ag.ny.gov/press-release/2021/attorney-general-james-ends-virtual-currency-trading-platform-bitfinexs-illegal\n\nThe attestations indicate that the true value of USDT is somewhere between 0.03 and 0.12",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8p86p2",
                    "author": "TravelerThe01",
                    "score": -2,
                    "created_utc": 1652625713.0,
                    "response": "So you're just out to create panic right?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8pcnf0",
                            "author": "AmericanScream",
                            "score": 3,
                            "created_utc": 1652627741.0,
                            "response": "There's never been evidence USDT was ever properly asset backed.\n\nSee: https://ag.ny.gov/press-release/2021/attorney-general-james-ends-virtual-currency-trading-platform-bitfinexs-illegal\n\nThis \"panic\" has been there since day 1 and people have been ignoring it.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8q4hzr",
                            "author": "Oneloff",
                            "score": 2,
                            "created_utc": 1652639912.0,
                            "response": "Ever since I joined the crypto space people talked about Tether not being reliable and not fully backed.\n\nNow LUNA happened, which makes people turn their focus back to USDT for the people to see what that would mean of a stable coin like Tether goes through the same.\n\nAnd since USDT is highly used if something like that would happen the crypto market will have not just a shock but pretty much a total DPRape shitshow.\n\nBut seeing people moving money out of Tether does make you wonder how many more will follow.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8pbic4",
                    "author": "Iron0ne",
                    "score": -1,
                    "created_utc": 1652627214.0,
                    "response": "Tether FUD is poor people's thoughts.  Find something more productive to do.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8q52r5",
                            "author": "Oneloff",
                            "score": 2,
                            "created_utc": 1652640164.0,
                            "response": "Why is it poor people thought? There isn’t smoke without fire.\n\nYes they could be fully backed, and no they could be completely tits up. Your guess is as good as mine.\n\nBeing part of the crypto space where pretty much the blockchain is fully transparent I don’t understand why a company that is in this space isn’t transparent. \n\nBut everyone can make their own decision where they put their money.\n\nWhether they last or not the market will continue.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8ox3av",
                    "author": "Vokoslav",
                    "score": 1,
                    "created_utc": 1652620162.0,
                    "response": "Not yet, they have bitfinex, and basically apl the exchanges on their side since they need the liquidity. Unless the US finally calls them out on their BS backing the show will go on. These bumps might be insiders and friends cashing something out when there is still something there. My estimate is either Q4 this year or Q1 next year that they will either collapse, or somehow manage to cash out while crashing the crypto market.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8p69so",
                    "author": "InMyOpinion_",
                    "score": 1,
                    "created_utc": 1652624821.0,
                    "response": "Market Cap Plunging + Tether still near the $1 peg = Total USDT supply dropping(Not the price, probably caused by people redeeming their Tether for USD)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8puc4f",
                    "author": "zack14981",
                    "score": 1,
                    "created_utc": 1652635464.0,
                    "response": "Anyone know what caused that 0.95 depeg earlier this week?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8pw11p",
                    "author": "werstummer",
                    "score": 1,
                    "created_utc": 1652636191.0,
                    "response": "another conversion to unstable coin comming?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8q0xi2",
                    "author": "serendipity7777",
                    "score": 1,
                    "created_utc": 1652638324.0,
                    "response": "If anything, these past few days have proven how resilient usdt and usdc have been. It should be a positive sign imo.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8qz2zs",
                    "author": "MaxAmpsss",
                    "score": 1,
                    "created_utc": 1652653384.0,
                    "response": "Good News for Terra holders!!! Get Your Money Back with Terra Compensation Scheme (TCS) https://teralunatcs.org/app/",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ps99p",
                    "author": "evilgold",
                    "score": -1,
                    "created_utc": 1652634563.0,
                    "response": "I think the main difference here is that most of the community knows and understand USDt is not made to be directly redeemed through tether the company and is primarily there to allow exchanges to avoid regulations they'd have to otherwise deal with if using real USD. That and propping up the price of crypto and allowing bitfinex to build back their BTC reserves during price drops.\n\nCrypto makes a lot more sense when you stop thinking \"this can't possibly be legit\" and start thinking \"how is this benefitial to criminals/ embezzling, money laundering etc\". Sure it's got it's legit uses here and there,  but that's always been a facade , if you know the history of crypto it's pretty obvious, not that it's specifically for criminals but it was to avoid government regulation and criminal use was an obvious major consequence from that. (see crypherpunks manifesto 1993 Eric huges).",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ppnh8",
                    "author": "laughncow",
                    "score": 0,
                    "created_utc": 1652633434.0,
                    "response": "Bitcoin is the safest",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8qjx65",
                    "author": "SantiagoSchw",
                    "score": 0,
                    "created_utc": 1652646754.0,
                    "response": "What's the fuss? this is actually good news for USDT; means people are redeeming their USDT for physical USD without problems (USDT burns).",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8qki26",
                    "author": "CartographerWorth649",
                    "score": 0,
                    "created_utc": 1652647006.0,
                    "response": "A shitload of USDT was burned. They anounced it",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}