{
    "subreddit": "CryptoTechnology",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uwxk8u",
            "title": "What the hell is up with these trading bots ?",
            "url": "https://www.reddit.com/r/CryptoTechnology/comments/uwxk8u/what_the_hell_is_up_with_these_trading_bots/",
            "author": "Burdrgts",
            "created_utc": 1653417019.0,
            "score": 43,
            "num_comments": 16,
            "subreddit": "CryptoTechnology",
            "selftext": "So what's up with all these commercials popping up  about these bots that are used to make you money on crypto exchanges ?  \n\n\nI've seen like 20 of these on a crypto related site that I follow ( I won't name the companies that offer these services because of the subreddit rules and I certainly don't want to advertise something that I don't even know how it works ).  \n\n\nCan someone explain to me how these bots work what their purpose is, or is this some sort of gimmick that is useless ?  \n\n\nI am on Binance and Dura-fi and I am not even sure that they would allow bots, I would think they have mechanisms preventing these from being utilized or I am just not understanding what the purpose for these bots is.  \n\n\nI mean doesn't it kind of destroy the concept of a market place that is shaped by our decisions, but maybe I am just being old fashioned.  \n\n\nI mean what do you guys think are these credible  ways to buy and sell crypto and if so, will they be beneficiary to the market in general ? I am not so sure.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9ufru7",
                    "author": "Dormage",
                    "score": 54,
                    "created_utc": 1653421170.0,
                    "response": "Depends on a bot, liquidity providers run them, theres trading bots, theres semi automatic bots. Theres arbitrage bots. Exchanges love bots, volume is volume, fees are fees regardless who places the orders hence they offer APIs for this.\n\nEach of these bots is a different strategy of automated earning. I could explain the basics of every one of them but unless you are particulary interested, i would just give some advice.\n\nDont trust bots on the internet, github, etc.\nIf a bot is that good, you wount see it out there and nobody will share their profits with you if they are indeed so peofitable.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9v1xqt",
                    "author": "Ok-Nefariousness1340",
                    "score": 11,
                    "created_utc": 1653430682.0,
                    "response": ">I mean doesn't it kind of destroy the concept of a market place that is shaped by our decisions\n\nMaybe but what can you do. All trading, crypto or not, is full of bots now. There have been situations where whole markets crashed because of bots reacting to other bots in a feedback loop.\n\nThe point of a bot is if you have some idea for a trading strategy, but it would require you to spend all day watching and waiting for particular circumstances and then react very quickly, a bot is a way to use that strategy without putting in the work. Or to make decisions based on logic you believe in, but can't bring yourself to stick with because your emotions get the better of you. Having a bot doesn't mean the strategy is good or will make money though. Unless you are already able to be successful with trading and understand it really well there isn't much point in using a bot. Check out r/algotrading for people discussing what works and what realistic expectations might be.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9v4fgd",
                    "author": "somatic_will",
                    "score": 7,
                    "created_utc": 1653431804.0,
                    "response": "My personal theory is they're offering these services to collect free strategies from their customers and to then trade against them.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9vb4js",
                    "author": "djaxial",
                    "score": 5,
                    "created_utc": 1653434928.0,
                    "response": "I’d suggest reading Flash Boys by Micheal Lewis. The majority of trading traffic is automated and the extent to which is automated is astounding. Your not trading against people, you’re trading against machines.\n\nThe Man Who Solved The Market is also a worthwhile read regarding Renaissance Technologies.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9u6rde",
                    "author": "PhrygianGorilla",
                    "score": 12,
                    "created_utc": 1653417371.0,
                    "response": "They just automate trading. Basically letting you place buy / sell orders at different prices or % changes so that you can profit from price movements. Obviously it's risky as the market can be unpredictable and drop 20% as soon as you place a buy order. The bots just increase your chance of success.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9vn1li",
                    "author": "stealthgerbil",
                    "score": 1,
                    "created_utc": 1653440600.0,
                    "response": "I tried a trading bot and it worked ok. Then bitcoin crashed and so did any profit it had made.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9y68kw",
                    "author": "Western_Helicopter_6",
                    "score": 1,
                    "created_utc": 1653494097.0,
                    "response": "They’re usually pretty useless and only work profitably in very predictable sideways markets. Recommend staying away. One of the main reason is, nobody sells a very successful bot (they use it themselves for profit) - the bots you see marketed to you are likely not great.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}