{
    "subreddit": "CryptoMarkets",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "utbrnd",
            "title": "I believe that the importance of performance indicators in everyday decision-making is self-evident!",
            "url": "https://www.reddit.com/r/CryptoMarkets/comments/utbrnd/i_believe_that_the_importance_of_performance/",
            "author": "Huge-Paint4923",
            "created_utc": 1652990280.0,
            "score": 3,
            "num_comments": 1,
            "subreddit": "CryptoMarkets",
            "selftext": " A performance indicator, also known as a key performance indicator, is a metric that is used to assess performance. KPIs are used to evaluate a company's performance or a specific activity that it participates in. \n\nThe value of such performance metrics may be demonstrated in the regular decision-making processes of business leaders. A decision-maker must have a thorough understanding of the current situation in order to foresee the consequences of future actions while weighing a variety of possibilities. As a result, using performance indicators to reduce risk and eliminate errors is necessary. \n\nI discovered a fantastic firm that uses behavioral data to assist businesses in identifying target groups across many blockchains in order to provide the best possible user experience. I believe that more precisely targeted marketing to certain segments will help Ludo's clients.\n\n They'll be able to track their development over time using KPIs from their creator's analytics dashboard. I'm delighted that they've partnered up with Miko Matsumura; it's a huge step forward for both parties.",
            "stickied": false,
            "comments": []
        },
        {
            "id": "utbkpr",
            "title": "When Will the Crypto Bear Market End? - Cryptohopper",
            "url": "https://www.cryptohopper.com/blog/6444-when-will-the-crypto-bear-market-end?atid=15567",
            "author": "shitcoining2themoon",
            "created_utc": 1652989756.0,
            "score": 2,
            "num_comments": 4,
            "subreddit": "CryptoMarkets",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9a8to5",
                    "author": "GlazedPannis",
                    "score": 2,
                    "created_utc": 1653016458.0,
                    "response": "Tomorrow.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9alekx",
                            "author": "shitcoining2themoon",
                            "score": 1,
                            "created_utc": 1653024188.0,
                            "response": "The Hopium is strong in this one",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9bqnan",
                    "author": "6uRku2va",
                    "score": 1,
                    "created_utc": 1653052870.0,
                    "response": "That's a question many will not have an answer to buddy, The best you can do now is find a means to keep generating passive income while the market situation tries to stabilize.  You can do that by Splitting your money across different yield protocols using platforms like Compound, Aave, and Spoolfi especially to be on the safe side and to seek more huge returns at a minimized risk.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}