{
    "subreddit": "CryptoMarkets",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uwpbbc",
            "title": "Nobody should pay more than they have to for an asset",
            "url": "https://www.reddit.com/r/CryptoMarkets/comments/uwpbbc/nobody_should_pay_more_than_they_have_to_for_an/",
            "author": "Future-Goose7",
            "created_utc": 1653394093.0,
            "score": 2,
            "num_comments": 2,
            "subreddit": "CryptoMarkets",
            "selftext": "Whether you're a retail or institutional virtual asset trader, you want to be sure the platform you're using has the lowest latency and fees, as well as the greatest security standards. Unfortunately, this is no longer the case.\n\nThe virtual asset markets suffer from different issue such as exchange-to-exchange liquidity fragmentation, lack of best price discovery and execution, market manipulation, interoperability between venues, thin volume across trading pairs, price disparity between venues, major counterparty risks, high latency trades and wide spreads due to lack of liquidity, spreads can be vast.\n\nThese are issues that the industry faces and are being solved uniquely by FLUID, a proprietary liquidity ensures that you obtain optimum rates for your transactions, assuring the best execution, ultra-low fees, and zero counterparty risk. It's run by a seasoned senior team with over 40 years of combined and diversified experience in tier-one financial institutions and has been building since 2019.\n\nThe Solution\n\nFLUID combines resources across member exchanges, connecting institutions and retail users with a universal order book.​ ​ The technical architecture provides seamless interoperability between member exchanges, resulting in unified global liquidity and a stabilized market. ​ ​Thanks to the latest technology, multi-party transactions are settled instantly across all chains, exchanges, and trading pairs using a blockchain-based solution overlaying an MPC wallet architecture.​\n\nI believe this will help us save time, money, and assets, as well as facilitate widespread adoption of cryptocurrencies and blockchain technology, by combining the best of the traditional finance industry and the crypto space. What do you think, fellas? Are there any other projects with similar utility that are helping users in obtaining the best price for their assets?",
            "stickied": false,
            "comments": [
                {
                    "id": "i9swrpb",
                    "author": "nzubemush",
                    "score": 1,
                    "created_utc": 1653397713.0,
                    "response": "Been a while a new defi project caught my eyes, but fluid got that pull🤔",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9t98wc",
                    "author": "Umarzy",
                    "score": 1,
                    "created_utc": 1653403500.0,
                    "response": "Orion does something similar to that. There's the likes of Rango exchange as well doing that for Dexes; routing through Thorchain & Cosmos DEXs alike.\n\nBut I await FLUID product launch, probably could be better than both. Would also makes sense if there's a beta product before going Mainnet as I think those two had it.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uwpakz",
            "title": "Crypto begins week Constructive, Bitcoin Bulls Prep For A Breakout",
            "url": "https://cryptospacey.com/crypto-starts-week-positive-bitcoin-bulls-prep-for-a-breakout/",
            "author": "Robert-Kenneth508",
            "created_utc": 1653394025.0,
            "score": 8,
            "num_comments": 8,
            "subreddit": "CryptoMarkets",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9sr733",
                    "author": "CointestAdmin",
                    "score": 1,
                    "created_utc": 1653394655.0,
                    "response": "Bitcoin [pros](/r/CryptoMarkets/comments/uwpakz/crypto_begins_week_constructive_bitcoin_bulls/i9sr7l8/) & [cons](/r/CryptoMarkets/comments/uwpakz/crypto_begins_week_constructive_bitcoin_bulls/i9sr7yn/) and related info are in the collapsed comments below. Pros and cons will change for every new post.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9stqnu",
                    "author": "Stone_Hobbit",
                    "score": 1,
                    "created_utc": 1653396103.0,
                    "response": "I don't think so, in any case we expect either consolidation or a bullish trap in the case of fulfillment of which I will open a short bitcoin on wowswap with the targets of updating the local minimum",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}