{
    "subreddit": "CryptoMarkets",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uqihav",
            "title": "□□□□■■ CRYPTO FUCKERY LOADING□□□□□□■■■",
            "url": "https://v.redd.it/y4hdsxhn3qz81",
            "author": "HEDGEDHOMELESS",
            "created_utc": 1652657679.0,
            "score": 0,
            "num_comments": 0,
            "subreddit": "CryptoMarkets",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uqib8c",
            "title": "UST and LUNA Update - May 15, 2022 - Crypto JBro",
            "url": "https://youtu.be/lLAB27CwW6o",
            "author": "JaredB136",
            "created_utc": 1652657130.0,
            "score": 1,
            "num_comments": 2,
            "subreddit": "CryptoMarkets",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8r9liy",
                    "author": "CointestAdmin",
                    "score": 1,
                    "created_utc": 1652658480.0,
                    "response": "Terra(LUNA) {{pros}} & {{cons}} and related info are in the collapsed comments below. Pros and cons will change for every new post.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uqib13",
            "title": "Results of the week of the blockchain industry",
            "url": "https://medium.com/@unclefibonacci/results-of-the-week-of-the-blockchain-industry-cea4aef589cc",
            "author": "btcxlab",
            "created_utc": 1652657112.0,
            "score": 1,
            "num_comments": 0,
            "subreddit": "CryptoMarkets",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uqiak8",
            "title": "eQardCoin",
            "url": "https://www.reddit.com/r/CryptoMarkets/comments/uqiak8/eqardcoin/",
            "author": "lalalalikethis",
            "created_utc": 1652657072.0,
            "score": 1,
            "num_comments": 1,
            "subreddit": "CryptoMarkets",
            "selftext": "So, I have been researching about blockchain for a while now, in some posts I have read people talking about how this token, in theory, has the “potential” to be used in many contexts besides the speculation and that was many big names behind it, however I haven’t found any sources confirming theres legit people behind this, do you have any sources about ir or do you know if this is just other dead end project?",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uqhq60",
            "title": "Down turn in the markets is the time to focus on fundamentals, some good content from Zenon Network explaining the new tech.",
            "url": "https://v.redd.it/mdlwvm5xypz81",
            "author": "drinkmoreapples",
            "created_utc": 1652655217.0,
            "score": 6,
            "num_comments": 1,
            "subreddit": "CryptoMarkets",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8shux7",
                    "author": "G3STO3RT",
                    "score": 1,
                    "created_utc": 1652682960.0,
                    "response": "I'd like to know how much usdt people can spend on it in general",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uqhu0z",
            "title": "Enter team and JPO talks on Twitter",
            "url": "https://i.redd.it/6liwem7fynz81.png",
            "author": "freeman_lxg",
            "created_utc": 1652655570.0,
            "score": 3,
            "num_comments": 1,
            "subreddit": "CryptoMarkets",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8snpga",
                    "author": "freeman_lxg",
                    "score": 1,
                    "created_utc": 1652687864.0,
                    "response": "[https://twitter.com/EnterNFT/status/1525853197633478658](https://twitter.com/EnterNFT/status/1525853197633478658)",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uqi22y",
            "title": "For Anyone Who Lost $ in LUNA;",
            "url": "https://www.reddit.com/r/CryptoMarkets/comments/uqi22y/for_anyone_who_lost_in_luna/",
            "author": "FitRecognition5037",
            "created_utc": 1652656285.0,
            "score": 127,
            "num_comments": 29,
            "subreddit": "CryptoMarkets",
            "selftext": "First, BEWARE of any other uses posting with links for compensation for LUNA. They are ALL scams and it’s so unfortunate that there are human beings out there who have no sense of morals. NEVER CONNECT YOUR WALLET TO A LINK FROM SOMEONE YOU DONT KNOW.\n\nFor those who lost money in LUNA…understand, this was not a scam. LUNA was an experimental crypto in decentralized finance. The concept was vetted by many and carried risk. Those risks were publicized by many if you spent any time doing research. There were many however who believed in the project and the basis of the concept. This a a very unfortunate event. And my heart goes out to anyone who lost money in LUNA (which includes myself). However, this happens. This happens in the stock market (think 2008 / Lehman Brothers ENRON, etc.), and this happens in crypto. ALL investments carry risk. And some more than others. The more risk you take on the more reward. And the more risk. That’s how the system has always been set up. In any market. Note that there were extremely wealthy investors including the CEO of Galaxy Digital, Mike N., who lost billions in LUNA.\n\nMike is a very saavy, ex Goldman Sacks exec who founded Galaxy Digital. He went so far as to get a tattoo of LUNA recently. My heart goes out to Mike and I hope he regains himself after this and is successful in the many other projects he still has investments in. Just because he still is wealthy doesn’t take away from my compassion for him. I feel for anyone who lost any amount of money.\n\nFor anyone who is distraught. Please please please don’t let yourself be taken further advantage of, whether through scams like this poster above asking for your wallets to “compensate you”, or by taking on further risks to make up for it. Regain, rebuild, reinvigorate yourself. Life moves on. And so will you. It might be hard. Very hard. Extremely hard. But I can promise you one thing. This will pass with time.\n\nI wish everyone here all the best. And I sincerely hope everyone is successful and regains what they lost. This was an unfortunate event, but again, it happens. No one is at fault. This was an experimental project that went south. That’s all.\n\nSo let’s all take a deep breath. Try to regain our composures. And let’s learn from this. Because every mistake is also a lesson. So let’s learn from this in anyway we can. For some it will mean to assess risk differently. For others it will mean to not risk or invest more than you can afford to lose. For others it will be to not hold onto assets for longer ithan you should. And yet for others, it will mean learning to get up in the morning again and realizing life is NOT over. It’s just another day, another lesson learnt.\n\nLove & peace to all, -A fellow LUNA investor",
            "stickied": false,
            "comments": [
                {
                    "id": "i8r5zhk",
                    "author": "CointestAdmin",
                    "score": 1,
                    "created_utc": 1652656703.0,
                    "response": "Terra(LUNA) {{pros}} & {{cons}} and related info are in the collapsed comments below. Pros and cons will change for every new post.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8r838m",
                    "author": "StarWarsTrekGate",
                    "score": 35,
                    "created_utc": 1652657732.0,
                    "response": "I mean, my 175$ is now like 3 cents. This is why we only invest what you could lose. Same things I do in penny stocks and risky small caps. Paid off with shib and doge... They'll be another coin. And if you are freaking out just walk awayfor a day or week and revisit later.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8shfi8",
                            "author": "silencemax",
                            "score": 2,
                            "created_utc": 1652682619.0,
                            "response": "all my 5k now are like not even a dollar anymore, \nAll I can say is that I'm really really sad and dunno what to do.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8sipgs",
                                    "author": "gotbeefpudding",
                                    "score": 5,
                                    "created_utc": 1652683632.0,
                                    "response": "Just continue on bro. Nothing to lose. This is the unfortunate side of crypto. \n\nMy trick is when I invest, I pretend it's gone until it's back in my bank account. \n\nHelps loses hurt less and helps me not panic sell on the way up too.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8sisi8",
                                            "author": "silencemax",
                                            "score": 1,
                                            "created_utc": 1652683700.0,
                                            "response": "I need to start taking classes, because my money never saw gains",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i8smwps",
                                    "author": "korvanc",
                                    "score": 1,
                                    "created_utc": 1652687157.0,
                                    "response": "Sorry for your loss, bro.  \nI also lost 10k USD in LUNA.  \nWell, I am at home playing family feud on Gamestarplus platform with my family to forget my sorrow.  \nJust glad that I also earn while playing it.  \nWe will rise again, buddy.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8ra42z",
                    "author": "TripleReward",
                    "score": 5,
                    "created_utc": 1652658734.0,
                    "response": "https://twitter.com/stablekwon/status/1525238418812178432\n\nThe whole thread reads like: its over for luna/ust, write it off as a loss.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8rvmvn",
                    "author": "CollapsingPally",
                    "score": 6,
                    "created_utc": 1652668894.0,
                    "response": "I really needed to read this. My lost isn’t as bad as some people on here and I’m trying to learn a lesson from it. \n\nI’m grateful to have a good support system and I’m starting to realize only invest what you really can afford to lose.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8r5h01",
                    "author": "bpo87",
                    "score": 18,
                    "created_utc": 1652656449.0,
                    "response": "Thank you for your post brother.\n\nWell said 👍",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8sbja8",
                    "author": "Yodel_And_Hodl_Mode",
                    "score": 12,
                    "created_utc": 1652678274.0,
                    "response": "I'm sorry, but Luna was a scam.\n\nI feel bad for people who didn't do their homework and got sucked into it, but all you had to do to know it was a scam was answer this question: \"Where did the money to pay 20% interest come from?\"  The money came from bringing in more buyers to prop up the existing holders.  That's a ponzi scheme.\n\nThey were minting and burning coins to keep UST at $1 while boosting the price of Luna while paying out 20% interest, all at the same time, with nothing to back any of it up until it was already starting to collapse.  The idea was that if they could keep bringing in more people to buy more Luna and get them to trade it for UST, nobody would realize it wasn't sustainable since everybody was in profit.  That's a ponzi scheme.\n\nIn this case, it was a Do Kwonzi Scheme.\n\nAnd it collapsed, as all ponzi schemes do.  In two days, the supply of Luna went from 377 million to 6.5 trillion.  And now they're trying to lure in more suckers with a promise to save it?  To get Luna back to a price of just $1, it would have to have a market cap of 6.5 trillion dollars, and even then, it would still be down massively, from $116 last month.\n\nRight now, the market cap of ALL crypto, combined, is 1.3 trillion dollars, so the idea of getting Luna back to even just a dollar is silly.\n\nI love crypto, but I think this entire community has too many scammers and too few people willing to call them out.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8soksz",
                    "author": "SlingDNM",
                    "score": 1,
                    "created_utc": 1652688636.0,
                    "response": "Imagine being the idiot with a Luna tattoo now tho lmao",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8spmhb",
                            "author": "Zhai",
                            "score": 1,
                            "created_utc": 1652689597.0,
                            "response": "Now he is desperately looking for a latino stripper with the same name to fall in love with.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8sp1ls",
                    "author": "killzenth",
                    "score": 1,
                    "created_utc": 1652689069.0,
                    "response": "An experiment that resulted to be a scam, scam with extra steps",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ru3wx",
                    "author": "WillStripForCrypto",
                    "score": 5,
                    "created_utc": 1652668134.0,
                    "response": "I bought 20 coins back when LUNA started pumping. Cost me almost 2000. I recently commented on a post people were commenting on about buying millions of LUNA at under a penny. It upsets me that they want compensation if LUNA is forked. People that lost real money should be the ones compensated and not the people who took advantage of a broken system. They need to halt the chain and stop all trading. It’s like a kick to the nuts the longer it goes in. I don’t even like reading the posts about it but it’s everywhere.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8rzpyi",
                            "author": "FitRecognition5037",
                            "score": 5,
                            "created_utc": 1652671050.0,
                            "response": "-(**my reply below the quite**)-\n\nLet’s take a moment to reflect;\n\n“The greatest glory in living lies not in never falling, but in rising every time we fall.”\n\n-Nelson Mandela\n\nBuddy, I feel for you. I almost had a similar experience to you. I’m fact I lost more than $2,000 in LUNA. On top of that, I also purchased more as LUNA was falling in an effort to average down my costs.\n\nI have so many questions, including;\n\n• What did Do Kwan do with the BTC in reserve? I saw that the CEO of Binance asked the same question. It seems the BTC was sent to one wallet that was traceable but then it went to an exchange. While Do said in his tweet that he didn’t sell any of his LUNA, nor profit from LUNA. I am very skeptical about that BTC. I strongly believe he has it somewhere.\n\nI keep thinking perhaps he’ll wait till all the selling in LUNA capitulates and then use the BTC to purchase the trillions of LUNA that were minted, and burn them, drop USDT (no more dollar peg), and completely focus on the LUNA eco-system with LUNA.\n\nThat would be the best case scenario in my opinion and allow all holders of LUNA to benefit from that, by essentially then keeping the whole LUNA infrastructure as it was.\n\nAll that being said, I also know I have no control over what happens at this point, so have come to the conclusion that I accept my loss, and am willing to move on. I do hope I learn from this mistake and while I intend to continue to invest in various crypto currency projects, I want to see a real team with a care for the community that shines through since I feel Do was extremely arrogant, selfish, and he kept many investors and even new buyers with hopes that LUNA would recover tweeting about a “new plan” and other statements seemingly making it seem like it might, thereby causing much more losses than it would have been.\n\nWhile my heart goes out to all LUNA investors who lost any amount. I have very little compassion for Do, since I believe he maliciously caused more harm, which is unforgivable.\n\nThat being said, IF he ends up doing what I suggested above and that was the plan, I’ll eat my words and write an apology. But until that happens, I can’t wish him well, as much as I try to have compassion on every human being.\n\nScammers and those that take advantage of others, I have a very hard time forgiving. Unfortunately there are many of them. It’s sad.\n\nWishing everyone great fortunes going forward!\n\n-A Recovering LUNAtic",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8sougj",
                            "author": "SlingDNM",
                            "score": 1,
                            "created_utc": 1652688885.0,
                            "response": "\"I want decentralised money but I want there to be a central authority that decides the correct chain\"",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8rmdur",
                    "author": "ionsafari",
                    "score": -5,
                    "created_utc": 1652664578.0,
                    "response": "Not a SCAM 😂😂😂😂",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8rpe9m",
                            "author": "Yoloballsdeep",
                            "score": 7,
                            "created_utc": 1652665950.0,
                            "response": "20% APY on UST in Anchor is the exact definition of a Ponzi. I knew it and took advantage of the situation knowing that I was playing with fire but as soon as the markets started tanking I GTFO and sold everything.\n\nIn crypto if you think something is too good to be true, it probably is. Trust your instincts",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8rf5l2",
                    "author": "I_am_ChristianDick",
                    "score": 1,
                    "created_utc": 1652661236.0,
                    "response": "What’s going on next?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8s5s7v",
                    "author": "1HappyGuy1",
                    "score": 1,
                    "created_utc": 1652674617.0,
                    "response": "I was going to invest on Coinbase, but oh my goodness you can’t buy it there.  I would have probably lost a lot.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8s9ror",
                    "author": "greenappletree",
                    "score": 1,
                    "created_utc": 1652677124.0,
                    "response": "Well put. Thank you.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8shcdc",
                    "author": "dobrecata",
                    "score": 1,
                    "created_utc": 1652682549.0,
                    "response": "Yeah, some people have lost really a lot of usdt",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8sr4w3",
                    "author": "Charming_Sheepherder",
                    "score": 1,
                    "created_utc": 1652690971.0,
                    "response": "Until Do becomes transparent on where the btc went, its not only a ponzi but an exit scam too.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8sr6a5",
                    "author": "Tometic",
                    "score": 1,
                    "created_utc": 1652691007.0,
                    "response": "So, What does the future of LUNA hold?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8sr91c",
                    "author": "Tometic",
                    "score": 1,
                    "created_utc": 1652691079.0,
                    "response": "Thank you! Sometimes I think the Crypto community is very selfish, but this is is something different!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8rgh8r",
                    "author": "su5577",
                    "score": -5,
                    "created_utc": 1652661859.0,
                    "response": "This shows next Coin about to hit low - for as we know it could be cardano… this is why stay the course and only invest too 5 coins..",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8rp14e",
                    "author": "Lubicchi",
                    "score": -5,
                    "created_utc": 1652665780.0,
                    "response": "Thank me later ❤️🙏 https://www.youtube.com/watch?v=tDZtBzqow6Q",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}