{
    "subreddit": "CryptoCurrencies",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ushz92",
            "title": "Russia could legalise cryptocurrencies as means of payment - industry minister",
            "url": "https://www.reuters.com/article/idUSR4N2WG04U",
            "author": "ledonskim754",
            "created_utc": 1652894491.0,
            "score": 3,
            "num_comments": 6,
            "subreddit": "CryptoCurrencies",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i93t62f",
                    "author": "Sourdoughsucker",
                    "score": 1,
                    "created_utc": 1652899070.0,
                    "response": "Crypto should also cut them off. Complete block of access to the internet. Keep the insane, the scammers and hackers in the asylum",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i93vi7s",
                            "author": "UnlimitedlyLimited",
                            "score": 2,
                            "created_utc": 1652900030.0,
                            "response": "yea that is not how crypto is meant to work, or how it can work.  Russia is a government, crypto is not made for government convivence and or guidance on who can and can not use the systems.  Crypto is about an absolute leveling that makes it so the motivation of rules is irrelevant to my money.  Crypto is about consent, and about ending the ability of terrible governments to take our money to uselessly kill people for no real gains.\n\nI hope Russia moves to crypto, so the people can stop suffering under terrible people.  I hope the same for all our brothers and sisters world wide.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i967je8",
                    "author": "adm928",
                    "score": 1,
                    "created_utc": 1652940797.0,
                    "response": "While the \"free\" world blocks and bans almost everything that doesn't fit their agenda, in \"totalitarian cruel\" Russia you can freely mine, and soon you will be able to pay cryptos. I envy them a little.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i96d5j5",
                    "author": "dobrecata",
                    "score": 1,
                    "created_utc": 1652945403.0,
                    "response": "Would be good if they also could use usdt freely",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}