{
    "subreddit": "CryptoTechnology",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "pou4uw",
            "title": "Is there a reason a product for shorting an arbitrary asset doesn't exist?",
            "url": "https://www.reddit.com/r/CryptoTechnology/comments/pou4uw/is_there_a_reason_a_product_for_shorting_an/",
            "author": "The-Tots",
            "created_utc": 1631725095.0,
            "score": 3,
            "num_comments": 31,
            "subreddit": "CryptoTechnology",
            "selftext": "I'm wondering if there is some obvious impediment that I'm not thinking of.\n\nIf someone is willing to supply an asset which they can earn a borrowing fee from, and someone else is willing to provide collateral to borrow that asset then this should be pretty easily done, no?\n\nThe only issue I can think of is regarding when asset suppliers can recall the asset that they've loaned, but I think this can be handled through time locked vaults. E.g., you're not allowed to recall your asset before 30 days.\n\nI think this would be a service that would have demand. SafeMoon HODLers could collect interest on their asset which they're apparently planning to hold for years. The rest of /r/cc could short the asset.\n\nWhat am I missing?",
            "stickied": false,
            "comments": []
        },
        {
            "id": "nkis1b",
            "title": "Looking to create a charity token with 5% given to a charity and 5% distributed to existing holders",
            "url": "https://www.reddit.com/r/CryptoTechnology/comments/nkis1b/looking_to_create_a_charity_token_with_5_given_to/",
            "author": "Heartyprofitcalm",
            "created_utc": 1621923212.0,
            "score": 3,
            "num_comments": 7,
            "subreddit": "CryptoTechnology",
            "selftext": "Hello amazing people of he cryptoworld,     \n\nI’m a beginner with a basic understanding of crypto and the blockchain technology. \n\n\nI’m looking to create a deflationary charity token, and I’m looking for a basic guide,\n\nI cannot find the code for redistribution or I don’t understand it yet. What is better in this case, to make a token on the binance chain or the ethereum chain?\n\nWhat are the benefits of either?\n\nI’m hoping to either post it on Uniswap or Pancake swap. I do want people to make money on it, and be a force for good. \n\nHow many total tokens should be there? And how many decimal points? What are the basic criteria you look for when buying a token, and how can I earn your trust?\n\nSince I’m a little bit poor, I am looking for the most effective and the cheapest way to publish it on the blockchain, I heard ethereum has high gas fees.\n\nSo fellow people of the crypto world,\n\nPlease help?",
            "stickied": false,
            "comments": [
                {
                    "id": "gzd9iwd",
                    "author": "Karyo_Ten",
                    "score": 10,
                    "created_utc": 1621928639.0,
                    "response": "The first question to ask is what's the intrinsic value of your token? You seem to be obsessed by price and redistribution and not by your business model and how to create value.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gzdcnqv",
                    "author": "Ok_Listen_now",
                    "score": 3,
                    "created_utc": 1621931674.0,
                    "response": "There is already one with this concept exactly, it's HAPPY coin. Did you get the idea from them? In any case if you join their telegram group chat you should be able to ask questions to the creator there",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gzt3j2a",
                    "author": "0JesseJStacks0",
                    "score": 3,
                    "created_utc": 1622238623.0,
                    "response": "What is this safemoon 2.0?",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}