{
    "subreddit": "CryptoMarkets",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "upllo6",
            "title": "Will USDN and Waves be next to collapse?",
            "url": "https://www.reddit.com/r/CryptoMarkets/comments/upllo6/will_usdn_and_waves_be_next_to_collapse/",
            "author": "ZombieSlayer83",
            "created_utc": 1652547919.0,
            "score": 3,
            "num_comments": 1,
            "subreddit": "CryptoMarkets",
            "selftext": "This algo stable has a very similar mechanism to Terra. There are reports on Reddit that they are blocking withdrawals from the waves chain right now. USDN has lost peg. Waves is a Russian chain so there is added geopolitical problems. The only reason I see right now that it hasn't collapsed is that it doesn't have as wide of a distribution as UST so they are able to block withdrawals from waves chain and isolate the problem.  It looks like they are in full panic mode though and trying to get liquidity with insane APR's. But trust in algo stables is completely gone at this point. Who is going to supply the capital they need?\n\nhttps://imgur.com/gallery/4zr4Uz9",
            "stickied": false,
            "comments": []
        },
        {
            "id": "upk7fs",
            "title": "Congressman Pete Sessions Interview - Bitcoin Mining & Crypto in Texas - Crypto Regulations & CBDCs",
            "url": "https://www.youtube.com/watch?v=ZYai76m3RZI",
            "author": "PrimeCoinz",
            "created_utc": 1652543927.0,
            "score": 3,
            "num_comments": 2,
            "subreddit": "CryptoMarkets",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "upk1eo",
            "title": "USTanked - the Fall of UST and Luna",
            "url": "https://www.newbiescrypto.com/p/ustanked",
            "author": "SuDa2104",
            "created_utc": 1652543424.0,
            "score": 3,
            "num_comments": 0,
            "subreddit": "CryptoMarkets",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uper8b",
            "title": "LUNA and Crypto Crash - lessons learned and where to find opportunities.",
            "url": "https://www.reddit.com/r/CryptoMarkets/comments/uper8b/luna_and_crypto_crash_lessons_learned_and_where/",
            "author": "Cryptic_88",
            "created_utc": 1652525507.0,
            "score": 4,
            "num_comments": 4,
            "subreddit": "CryptoMarkets",
            "selftext": "I feel sorry for all the people who lost their lifesavings due to recent LUNA implosion, be save and stay strong. But what are the take aways?\n\nFirst thing that comes to mind: there is NO free lunch. If a project is offering you a very high APY, that is not backed by actual revenue/fees you are looking at a ponzi.\n\nThere are just too many scam projects out there promising everything, but it has no real right to exist. I think we are about to enter a new era for crypto, where a lot of projects will basically fail and the ones that survive will be here for the next decades. So how to spot these?\n\nLook for REAL utility, which developers are actually buidling something that will be here in 10 years. Don't be fooled by all the copycats, just copying a project on another chain.\n\nTry to understand where the value of the token would come from. Ideally this is linked to something tangible, so you could actually run a valuation.\n\nDon't get me wrong, these projects will also go down when Bitcoin crashes. But at those times it would be perfect to add, I know I am doing that to my favorite projects. If you are disciplined and retest your investment case over and over again, you will make it!",
            "stickied": false,
            "comments": []
        },
        {
            "id": "upf8bb",
            "title": "FTX CEO Sam Bankman-Fried Buys 7.6% Stake in Robinhood Markets; Sends Shares Surging",
            "url": "/r/ftx/comments/upf6dt/ftx_ceo_sam_bankmanfried_buys_76_stake_in/",
            "author": "unitys2011",
            "created_utc": 1652527462.0,
            "score": 3,
            "num_comments": 0,
            "subreddit": "CryptoMarkets",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "upd6xp",
            "title": "Phemex Will Support the Ellipsis (EPS) Token Migration, Redenomination & Ticker Change to EPX",
            "url": "/r/phemex_global/comments/uom3q2/phemex_will_support_the_ellipsis_eps_token/",
            "author": "Starbimlaw1",
            "created_utc": 1652518495.0,
            "score": 5,
            "num_comments": 6,
            "subreddit": "CryptoMarkets",
            "selftext": "",
            "stickied": false,
            "comments": []
        }
    ]
}