{
    "subreddit": "CryptoTechnology",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uvy80c",
            "title": "How do we achieve greater adoption of NFT technology?",
            "url": "https://www.reddit.com/r/CryptoTechnology/comments/uvy80c/how_do_we_achieve_greater_adoption_of_nft/",
            "author": "LouieR99",
            "created_utc": 1653305960.0,
            "score": 0,
            "num_comments": 1,
            "subreddit": "CryptoTechnology",
            "selftext": "Hey everyone,\n\nI'm currently a freelance front-end developer who's picked up curiosity into the web3 space.\n\nWith so many industries blockchain technology can disrupt, NFT's have caught my attention.\n\nI am new to this space, so please do correct me if any assumptions I make are wrong!\n\nI'm seeing some really impressive artwork being created as NFT's, but my question is, how do we bridge the gap to full scale adoption in other industries. I don't feel like NFT's at the minute are leveraging the full power of their capabilities. That's one thing that put me off NFT's before diving deeper into the space, because all I could think of when I heard the word \"NFT\", was a .jpeg of a bored ape.\n\nAs someone who resonates with complete ownership of physical/digital assets, how do we move closer to achieving the goal of NFT'ing the following:\n\n* Medical Records\n* Land Registry\n* Vehicle ownership?\n* Tickets for concerts/events.\n\nI love the idea of being able to own these assets, instead of having to trust a third party with our assets/data, which is what blockchain is all about.\n\nLet's take the example of medical records, how do we start to move forward with adoption in this industry, so people can really gain full ownership.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9oanne",
                    "author": "jetomics",
                    "score": 1,
                    "created_utc": 1653307924.0,
                    "response": "What is the pain of all those users for \"Medical Records, Land Registry, Vehicle ownership, Tickets for concerts/events.\" you are solving?",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}