{
    "subreddit": "CryptoCurrencies",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uucir7",
            "title": "I’m a bit concerned about Instagram interacting with NFTs",
            "url": "https://www.reddit.com/r/CryptoCurrencies/comments/uucir7/im_a_bit_concerned_about_instagram_interacting/",
            "author": "calisthenicslb",
            "created_utc": 1653096012.0,
            "score": 5,
            "num_comments": 15,
            "subreddit": "CryptoCurrencies",
            "selftext": "Anything related to Facebook or Mark Zuckerberg in anyway possible shouldn’t come anywhere near the crypto market.\n\nThis market is very sensitive when it comes to privacy and identity preservation and anything that would compromise that maliciously is VERY unwelcomed.\n\nKnowing the past behind Faceboon and its ways of acquiring private information without consent, I wouldn’t want it anywhere near this market.\n\nI know this might sounds like a reach but it always starts out slow with companies like this one, and slowly but surely they’ll end up with basically all our private info and activity.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9f74dk",
                    "author": "daryledesilva",
                    "score": 7,
                    "created_utc": 1653113152.0,
                    "response": "So should anything related to Facebook or Mark Zuckerberg be in anyway possible come anywhere near the crypto market?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9equcc",
                    "author": "SquatchLiquor31",
                    "score": 10,
                    "created_utc": 1653102478.0,
                    "response": "As much as I hate Meta, integration and interaction with big tech is going to be necessary for mainstream adoption of the crypto space.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9eqtpk",
                    "author": "sangderenard",
                    "score": 3,
                    "created_utc": 1653102469.0,
                    "response": "Anything related to Facebook or Mark Zuckerberg in anyway possible shouldn’t come anywhere near the crypto market.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9evziq",
                    "author": "hoppyandbitter",
                    "score": 3,
                    "created_utc": 1653105407.0,
                    "response": "Anything related to Facebook or Mark Zuckerberg in anyway possible shouldn’t come anywhere near the crypto market.\n\nEdit: Anything related to Facebook or Mark Zuckerberg in anyway possible shouldn’t come anywhere near the crypto market.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9flonb",
                    "author": "krimmelnnd",
                    "score": 1,
                    "created_utc": 1653126174.0,
                    "response": "Well, if there's anything we could do about it, let's do it. What I get from this post is that NFTs are gaining even more traction, and platforms like nFLARE dao where you could lease and borrow NFTs couldn't have come at a better time.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9fqozq",
                    "author": "CartographerWorth649",
                    "score": 1,
                    "created_utc": 1653130648.0,
                    "response": "Facebook has power because people give it to them! There were options before and now there are more options than even, from Ocean to Brave in terms of monetising our data, but NFTs can be ours, don't need to go public or anything with them... just keep them on your wallet and one's free to have them on Ethereum, Solana, Unique Network, Wax Labs, BSC... anything really!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9eszit",
                    "author": "Myrefly23",
                    "score": 0,
                    "created_utc": 1653103668.0,
                    "response": "Mark's last name is completely coincidental he turned out the way he did, and you shouldn't associate a pattern with that sur name because of his actions, just saying. : )",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}