{
    "subreddit": "CryptoTechnology",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uw7n7r",
            "title": "But will we ever be able to forego our obsessiveness with gold and adapt to any of these new alternatives?",
            "url": "https://www.reddit.com/r/CryptoTechnology/comments/uw7n7r/but_will_we_ever_be_able_to_forego_our/",
            "author": "Bourneser",
            "created_utc": 1653332605.0,
            "score": 6,
            "num_comments": 10,
            "subreddit": "CryptoTechnology",
            "selftext": "Did you know that mining just one ounce of gold from ore can produce around 20 tons of solid waste?!\n\nIn fact, just the daily activity of a mine and any possible mishaps or leaks in it can cause a significant hazard to the nearby land and water resources. Also, since most gold mining methods involve using moving enormous amounts of dirt and rock, it is also harmful to the local biodiversity. Similarly, the operation of massive fossil fuel-powered mining equipment results in immense greenhouse gas emissions. \n\nFurthermore, the mercury used in artisanal and small-scale gold mining activities and even using sodium cyanide to extract gold from ore without being adequately confined can damage air and water. \n\nGold mining can also cause a long-term continuing effect on the environment as acid mine drainage is closely associated with gold mining. Chemical reactions between sulfides and surface elements result in sulfuric acid being released into the environment. This chemical reaction can enter a feedback loop and continue for hundreds of years.\n\nHowever, the awareness about this destructive saga of mining assets is spreading vastly, with major businesses taking the lead to come up with alternatives, among which is the latest blockchain technology. For instance, a company called Nature’s Vault has come up with a unique solution in the form of tokenization of gold preservation and letting users invest in preserving actual gold in the ground.\n\nBut will we ever be able to forego our obsessiveness with gold and adapt to any of these new alternatives?",
            "stickied": false,
            "comments": [
                {
                    "id": "i9pvtll",
                    "author": "sangderenard",
                    "score": 7,
                    "created_utc": 1653333676.0,
                    "response": "None of this shit has inherent value, it's all a game.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9q8lvj",
                    "author": "Everythings",
                    "score": 1,
                    "created_utc": 1653339179.0,
                    "response": "Do you understand why gold is the money of choice across recorded history?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9qn160",
                            "author": "sangderenard",
                            "score": 1,
                            "created_utc": 1653345837.0,
                            "response": "because it's dense enough to compare volume by weight without needing a refined scale to differentiate hand holdable quantities and it doesn't require especially durable tools or high heat to work with as well as its resistance to tarnish? A host of things that are arbitrary, not entirely relevant anymore, and not unique to gold?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9qxcsu",
                                    "author": "Everythings",
                                    "score": 1,
                                    "created_utc": 1653350911.0,
                                    "response": "Almost\n\nFungible divisible portable durable scarce and a few others I can’t think of off the top of my head are core requirements for hard money",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9rbu5k",
                                            "author": "ShaughnDBL",
                                            "score": 1,
                                            "created_utc": 1653357931.0,
                                            "response": "It's also highly conductive FWIW",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9qg2fu",
                    "author": "KoppleForce",
                    "score": 1,
                    "created_utc": 1653342545.0,
                    "response": "Gold has no intrinsic value. Gold standard maxis are frankly strange fellows.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9r8u9l",
                            "author": "icest0",
                            "score": 1,
                            "created_utc": 1653356508.0,
                            "response": "Ironic. Considering that you're holding gold on your smartphone.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9r0wxs",
                    "author": "hackersid",
                    "score": 1,
                    "created_utc": 1653352696.0,
                    "response": "Well as the old saying goes, old is gold. Humans by nature are attracted to shiny things. Women will not stop wearing it and men will not stop mining it.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}