{
    "subreddit": "CryptoCurrencies",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uuerv1",
            "title": "The reason I think crypto payments will end up going mainstream is cause they’re so secure and cheap at the same time",
            "url": "https://www.reddit.com/r/CryptoCurrencies/comments/uuerv1/the_reason_i_think_crypto_payments_will_end_up/",
            "author": "calisthenicslb",
            "created_utc": 1653104154.0,
            "score": 0,
            "num_comments": 16,
            "subreddit": "CryptoCurrencies",
            "selftext": "We all know how unsafe credit card payments can be sometimes if you entrust the wrong party with it.\n\nThere have been countless incidents where people who didnt know any better had their funds drained by a malicious website after entrusting it with their card.\n\nCrypto payments on the other hand can never face this problem. You account can never be compromised the way a bank account can.\n\nAlso, these crypto payments services are becoming faster and cheaper by the day to the point where some crypto payment services like e-money offer lightning fast transactions are near zero fees.\n\nThis is the kind of convenience that will drive people to slowly but surely end up adopting crypto payments in order to secure and more private and assure themselves a method of payment without ever having to worry about the account being undermined.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9fe4x8",
                    "author": "rogpar23",
                    "score": 2,
                    "created_utc": 1653119172.0,
                    "response": "i think paying for making a payment is just wrong, in real life and in crypto.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9l0fse",
                            "author": "PsychologicalSong661",
                            "score": 1,
                            "created_utc": 1653239125.0,
                            "response": "Yeah... It's because some persons are using it as business. It's wrong anyway. But not just crypto payment, the whole DeFi will definitely go mainstream since there are projects like ONE and ALBT that has DeFi gateway...",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9mfg4t",
                    "author": "alltalknolube",
                    "score": 1,
                    "created_utc": 1653262868.0,
                    "response": "If I use a credit card and it is used in fraudulent activity it is the banks problem. \n\nIf I am the victim of a crypto scam i lose my coins forever. Honestly, you're glossing over this simple argument.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}