{
    "subreddit": "CryptoMarkets",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uqaqo6",
            "title": "CZ Binance Shows Support for Terra, Points out Potential Issues with Forking Terra Blockchain",
            "url": "https://timestabloid.com/cz-binance-shows-support-for-terra-points-out-potential-issues-with-forking-terra-blockchain/",
            "author": "Solodeji",
            "created_utc": 1652635080.0,
            "score": 4,
            "num_comments": 4,
            "subreddit": "CryptoMarkets",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uq7lyq",
            "title": "99% of FOMO is just greed.",
            "url": "https://www.reddit.com/r/CryptoMarkets/comments/uq7lyq/99_of_fomo_is_just_greed/",
            "author": "ImmediateAnywhere8",
            "created_utc": 1652625992.0,
            "score": 3,
            "num_comments": 8,
            "subreddit": "CryptoMarkets",
            "selftext": "We all know the feeling when FOMO kicks in on a certain coin when its pumping hard, but by then it’s most probably too late to put money into it yet we still feel the urge to ride the hype train even though we know very well it left the station a long time ago.\n\nIt’s hard for a lot of investors (myself alike) to take the L and wait for another opportunity to invest in a coin before it pumps.\n\nThis greed usually kicks in much harder when its a project like a memecoin cause those usually pump real hard one time and it becomes a missed opportunity.\n\nThis isn’t the case when it comes to projects like Ethereum which is most likely to keep pumping as time goes by or Hedera since they actually have technology and the ecosystem keeps on growing with Hbar Foundation investing hundreds of millions of dollars into it.\n\nIt’s pretty hard to ignore greed especially when this market has historically made people millions of dollars for thousand-dollar worth investments but eventually it all catches up to you so be careful when and what to invest in.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8pbdu8",
                    "author": "Perfect-Ad-7429",
                    "score": 8,
                    "created_utc": 1652627158.0,
                    "response": "Yea no shit. Missing out...on money. What did you think the fear of missing out was? Fear of missing out on the genuine fun of a crypto project? Lol",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8pbsn9",
                    "author": "prolemango",
                    "score": 4,
                    "created_utc": 1652627346.0,
                    "response": "Obviously. That’s the literal definition of FOMO.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8pc2qb",
                    "author": "crestarthegreat",
                    "score": 4,
                    "created_utc": 1652627477.0,
                    "response": "And? It’s all greed. What are you doing here unless you are trying to make gains?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8pelgq",
                    "author": "SirMrManFish",
                    "score": 3,
                    "created_utc": 1652628629.0,
                    "response": "Shilling Hedera disguised as discussion, tsk tsk",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}