{
    "subreddit": "CryptoTechnology",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uvt4tn",
            "title": "Will all other chains “die off” once we find the perfect consensus mechanism?",
            "url": "https://www.reddit.com/r/CryptoTechnology/comments/uvt4tn/will_all_other_chains_die_off_once_we_find_the/",
            "author": "Interested-Investor",
            "created_utc": 1653283919.0,
            "score": 13,
            "num_comments": 15,
            "subreddit": "CryptoTechnology",
            "selftext": "I’ve always been fascinated by different projects consensus mechanisms and how vastly different their approaches are.\n\nOne thing I’ve always wondered is let’s say, hypothetically, we find the perfect consensus protocol.\n\nIt’s fast, extremely safe, and anyone and everyone can be a validator.\n\nWhat then?\n\nI mean do all of these other chains and organizations and projects just die? It seems like most L1s aren’t that innovative anyhow. They’re just slight variations of each other.\n\nFurthermore, will the best technology even win out? Or will good marketing and funding of crappier projects that are “too big to fail” (Ethereum) just squash radical innovation early?",
            "stickied": false,
            "comments": [
                {
                    "id": "i9nuoqt",
                    "author": "diradder",
                    "score": 5,
                    "created_utc": 1653295230.0,
                    "response": "Why wouldn't the other chains you qualify as \"crappy\" just adopt this \"perfect\" consensus mechanism?\n\nYou have to remember that one of the great aspect of cryptocurrencies is their upgradability. On the largest and most decentralized projects the task is harder because it is actually guarded/driven by consensus of course, but far from impossible.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9o841b",
                            "author": "Dr_I_Abnomeel",
                            "score": 5,
                            "created_utc": 1653306295.0,
                            "response": "I’m not so sure. E.g. several years of attempts to get ETH 2.0 out is proof that it’s not easy. Plus they haven’t _actually_ done it yet. The repercussions of going from PoW to PoS are already causing debate.\n\nTechnology that has strong foundations, especially regarding security is something you really need to get right from the start. \n\nI agree that it’s not impossible, but leaving things to later is possibly one of the worse aspects of crypto.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9oax6u",
                                    "author": "diradder",
                                    "score": 7,
                                    "created_utc": 1653308088.0,
                                    "response": "> I’m not so sure. E.g. several years of attempts to get ETH 2.0 out is proof that it’s not easy. Plus they haven’t actually done it yet. The repercussions of going from PoW to PoS are already causing debate.\n\nThey are trying to switch to a mechanism that has not a proven track record at scale. The PoS experiments in other chains aren't very promising in my book, even if some work (for now), some miserably fail to all sorts of factors.\n\n> Technology that has strong foundations, especially regarding security is something you really need to get right from the start. \n\nAgreed.\n\n> I agree that it’s not impossible, but leaving things to later is possibly one of the worse aspects of crypto.\n\nMaybe I'm attributing too much weight to the word \"perfect\" here, but in the case of a really perfect mechanism that we can't doubt in terms of security and that would preserve the properties of say Bitcoin, what would be the arguments miners could put forth to convince users/exchanges/developers to not use the hardfork in which their mining became obsolete for example? I don't think there's any and since Bitcoin is permissionnless the fork would happen. Obviously this is all hypothetical, and lies on \"perfection\" existing... still an interesting thought experiment.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9q34gc",
                    "author": "mikaball",
                    "score": 2,
                    "created_utc": 1653336795.0,
                    "response": "Throwing a hint here. If such a thing exists, it's probably constructed on quantum entanglement.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ojia7",
                    "author": "Dr_I_Abnomeel",
                    "score": 2,
                    "created_utc": 1653312763.0,
                    "response": "As far as I’m concerned the perfect consensus algorithm has already been created (operating at the limits of what’s possible in a distributed network). It had little effect on the rest of the industry when it went public partly because it was patented, but the patent has now been lifted.\n\nSaying that, I believe there is plenty of room for existing networks to push forward and carve a space for themselves without being washed away by newer generations. But the thing that will determine any network’s growth and longevity is its practicality - Can it be hacked? Does it serve a purpose (trivial or otherwise)? \n\nSome won’t make it, others will. But they’ll survive on their own merits, not simply because something better is out there.\n\nThis space is no different to any other, look at the history of computing for the last several decade - old ideas that have long been “superseded” are still playing a role.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9op939",
                    "author": "misanagiee",
                    "score": 1,
                    "created_utc": 1653315506.0,
                    "response": "with good projects introduced daily, I don't think they'll die off... they might need to make some changes... one of these projects with enjoyable applications is Allianceblock, and its bridge, connecting several blockchains together.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9pqsc1",
                    "author": "Sharkytrs",
                    "score": 1,
                    "created_utc": 1653331517.0,
                    "response": "nah, I reckon that just like there isn't one global currency, we will have a currency for specific use cases in the end.\n\nneed to pay rent? that would be most efficient with rent coin\n\nneed to use a cloud computer to process some computation? most likely ETH\n\nneed to send value across borders? XLM\n\nneed to pay for entertainment? Movie Coin\n\netc\n\netc",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9quxyz",
                    "author": "Sabast-",
                    "score": 0,
                    "created_utc": 1653349719.0,
                    "response": "Well, Cardano already exists, and yet all the others haven't died off.\n\nErgo, the answer to your question is objectively, \"no\". ;-)",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}