{
    "subreddit": "Dogecoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ut2amo",
            "title": "Never Let a Crisis go to waste",
            "url": "https://www.reddit.com/r/dogecoin/comments/ut2amo/never_let_a_crisis_go_to_waste/",
            "author": "CFC1983",
            "created_utc": 1652963201.0,
            "score": 4,
            "num_comments": 4,
            "subreddit": "dogecoin",
            "selftext": "This could be great for Doge as it would stabilize the panic in the market\n\n \n\nJust something I have been thinking about in light of this whole Luna disaster wondering if anyone else is thinking the same have seen some other theories similar to this\n\n1. Most of the exchanges halt trading LUNA to \"protect their customers\". This is the biggest line of bull I have ever heard. If they legitimately wanted to \"protect\" customers why would they offer have the bs obvious scam / no future coins (like Doge knockoffs trying to ride its coattails) that if anyone read the whitepaper they would laugh. Doing alot of day trading some of these coins that seems to be the only purpose is a day trading. They have no future as there is no utility ( I by no means and stating this is Doge as I am a big fan of Doge and think it has a great future just to claify )\n2. Crypto news sites who are in bed with the wales as we all know release their fake news that luna is DEAD, say the fork is happening when it hasn't even been voted on yada yada just like how when there are a bunch of open shorts you see the \"Breaking NEWS China bans Bitcoin\" to cause a market panic even though its been banned for years now\n3. White the exchanges are closed the whales/ exchanges themselves ect load their bags. As the OP mentioned there have been reports of exchanges buying big bags, well I witnessed one. I am a big watcher of the order book right in front of my eyes I saw someone literally wipe out all the sell orders on Gemini to the tune of about 2 billion Luna coins in one order at around .0001. Well thats 200k even at that price and no one with that kinda cash laying around is going to risk it on a \"surely dead coin\" as they news portrays. They know something or are involved or aware of the FUD.\n4. While all this is happening buyer enthusiasm builds due to insanely low prices on Luna\n5. Now as the news goes on with the FUD the voting ends on the fork and it fails and a new proposal of the burn gets released and passed Only after it actually does does the news start portraying a future for Luna\n6. With this good news all the exchanges reopen trading on LUNA. By doing this you essentially create a double surge. You have all the people that have been chomping at the bit to buy at the super low prices combined with all the people rushing back with the release of good news and a viable recovery plan. (Great example of a chart that shows just the exchange opening surge look at MCO2 every time it gets listed on a new exchange it goes parabolic and doubles in price then slowly comes right back down to where it was over the next few weeks because there is no good news or added utility to go along with it)\n7. Luna price goes parabolic into the low cents range (.01-.05) whales dump gradually they make  \ntheir millions and life goes on and Luna recovers in a few years. I say they will dump  \ngradually as with the legitimacy/viability of the project they don't have to worry about  \ncatching the one solo spike so they gradually do it to maximize profits",
            "stickied": false,
            "comments": [
                {
                    "id": "i97zpbv",
                    "author": "shattypantsMcGee",
                    "score": 1,
                    "created_utc": 1652978896.0,
                    "response": "I cannot support Do Kwon.  He is to douche’",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}