{
    "subreddit": "Dogecoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uv7bq8",
            "title": "Can someone explain why having my coins in Mydoge would be better for me that robinhood?",
            "url": "https://www.reddit.com/r/dogecoin/comments/uv7bq8/can_someone_explain_why_having_my_coins_in_mydoge/",
            "author": "prenebean",
            "created_utc": 1653211104.0,
            "score": 1,
            "num_comments": 17,
            "subreddit": "dogecoin",
            "selftext": "Title basically explains it all, I’ve been thinking recently. Please convince me.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9jncck",
                    "author": "sg-doge",
                    "score": 1,
                    "created_utc": 1653211303.0,
                    "response": "what you need is a cold wallet not connected to an online device (only if needed)",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9jndv1",
                            "author": "prenebean",
                            "score": 1,
                            "created_utc": 1653211345.0,
                            "response": "Is Mydoge a cold wallet?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9jni8i",
                                    "author": "sg-doge",
                                    "score": 1,
                                    "created_utc": 1653211460.0,
                                    "response": "it's an app. so for me it's a hot wallet, unless you use a phone which is not connected to the internet",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9jnmo7",
                                            "author": "prenebean",
                                            "score": 1,
                                            "created_utc": 1653211577.0,
                                            "response": "Would you like some doge I just transferred to Mydoge",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9joftl",
                                                    "author": "sg-doge",
                                                    "score": 1,
                                                    "created_utc": 1653212327.0,
                                                    "response": "donate it to Ukraine",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9johef",
                                                            "author": "prenebean",
                                                            "score": 1,
                                                            "created_utc": 1653212366.0,
                                                            "response": "Send the address plz, I remember sending some from the ambassadors Twitter. I don’t have it anymore.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9jopx8",
                                                                    "author": "sg-doge",
                                                                    "score": 1,
                                                                    "created_utc": 1653212577.0,
                                                                    "response": "go from here:\n\n[https://www.coindesk\\[dot\\]com/markets/2022/03/02/ukraine-expands-crypto-donations-to-accept-dogecoin/](https://www.coindesk.com/markets/2022/03/02/ukraine-expands-crypto-donations-to-accept-dogecoin/)\n\ni dont guarantee for the correctness of the content. do your research, when you find an address wether it could be a valid address",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9jq2nr",
                                            "author": "Fulvio55",
                                            "score": 1,
                                            "created_utc": 1653213818.0,
                                            "response": "All clients contain hot wallets. They have to, in order to function.\n\nWhich is a great reason not to use them, especially on a mobile device.\n\nCold storage in offline text wallets is the only way to go.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9jnhvq",
                    "author": "Reality-Bytez",
                    "score": 1,
                    "created_utc": 1653211451.0,
                    "response": "People are just going to claim \" shorts \" and act like that's a real answer.  \n\n\nMy doge never increased or decreased in value by moving it.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9jnngu",
                            "author": "prenebean",
                            "score": 1,
                            "created_utc": 1653211599.0,
                            "response": "Would you like some doge I just transferred?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9jnxqn",
                                    "author": "Reality-Bytez",
                                    "score": 1,
                                    "created_utc": 1653211869.0,
                                    "response": "I'm not registered on the tip thing. Quite honestly never even noticed how to be. lol",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9jnzxt",
                                            "author": "prenebean",
                                            "score": 1,
                                            "created_utc": 1653211926.0,
                                            "response": "I could just send to a doge address brother",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9joz0d",
                                                    "author": "Reality-Bytez",
                                                    "score": 1,
                                                    "created_utc": 1653212810.0,
                                                    "response": "I'm good! No need for a tip! just have faith through this temporary dip and know it isn't just doge. lol",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9jpylw",
                                            "author": "Fulvio55",
                                            "score": 1,
                                            "created_utc": 1653213717.0,
                                            "response": "Go to the sodogetip website or subreddit, or send a message to the bot to get help and directions.\n\nRegister, and make sure you get your keys from the website.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9jpvy8",
                    "author": "Fulvio55",
                    "score": 1,
                    "created_utc": 1653213652.0,
                    "response": "Ideally, don’t use any client. Especially on a mobile device.\n\nBecause hot wallets are risky. Devices can be lost, stolen or hacked. Many people have had coins disappear without their knowledge over the years.\n\nA much better approach is cold storage. In the form of text wallets, with multiple copies on removable media you can put in safe places so they don’t all get destroyed at once. Search for ‘text wallet’ and have a read.\n\nAs for why to move your coins, it’s quite simple.\n\nDon’t listen to the ‘short’ people. They’re spreading misinformation based on lack of knowledge of how things actually work. It’s always easier to make up imaginary threats than to educate yourself after all. And haven’t we seen many examples in the real world, in so many fields?\n\nNo, the real reason again comes down to risk. If you don’t have the keys, then you don’t control the coins. And you are at risk of losing them if the people holding them manage to lose them.\n\nThis has happened many, many times, in all sorts of ways. Some exchanges were elaborate scams. Some failed. Some had technical issues. Some were hacked. Some were robbed by their own employees. And in every case, the losers were the customers.\n\nThis is why we keep repeating ***”Not your Keys, NOT your Coins”***. You really don’t want to leave your money in someone else’s pocket and then hope they give it back when you ask.\n\nPlus, specifically with RH, they put a variety of hurdles in your way. You have to meet their demands to be allowed to request that they send your coins to you. They charge fees, which although admittedly very low, are still twenty times higher than they should be. They have arbitrary limits on how much you can withdraw. They take hours to fill requests. And they have outages especially when things are hopping.\n\nReally, do yourself a favour and get your coins while you can. And stay away from any client, including this new one that everybody is hyping up.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9jqd1j",
                    "author": "VloooolV",
                    "score": 1,
                    "created_utc": 1653214069.0,
                    "response": "It’s not safe.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}