{
    "subreddit": "Dogecoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "v137pb",
            "title": "Did we get Pumped and Dumped?",
            "url": "https://www.reddit.com/r/dogecoin/comments/v137pb/did_we_get_pumped_and_dumped/",
            "author": "MrSirDrDudeBro",
            "created_utc": 1653925980.0,
            "score": 0,
            "num_comments": 15,
            "subreddit": "dogecoin",
            "selftext": "Iv been holding for over a year now. Although I have profited from Doge, My reinvestment has tanked. I reinvested, like everyone else, thinking the trend was not over until the now delayed doge-one satellite and hoping it brought amazing news with it. \n\nAt this point it just seems doge was pumped and dumped and im stuck holding bags",
            "stickied": false,
            "comments": [
                {
                    "id": "iak3w48",
                    "author": "WicasaNapayshni",
                    "score": 5,
                    "created_utc": 1653927075.0,
                    "response": "Starlink is just getting started, and RadioDoge is around the corner.\n\nhttps://foundation.dogecoin.com/blog/2022-04-11-shanty/\n\nIce Cube just accepted tons of Dogecoin for one on his basketball teams. They will have Dogecoin logos on their jerseys. BIG3, 3vs3 pro basketball league. \n\nNew Twitter Dogecoin tipping wallet was just created. @MyDogeTip\n\nJeff Bezos now follows the creator of Dogecoin. Praised him the other day. Elon said Billy is the best, only a few weeks ago. \n\nSpaceX will make Dogecoin the official currency of Mars and only those who adhere to the principal of 'do only good everyday' will be allowed to fly...\n\nBinance creator agreed to look into their Dogecoin 'proof of asset' holding, and to report to the community soon. \n\nVitalik, Creator of Ethereum donated tons of Ether to the Dogecoin Foundation, recently confirmed.\n\nA new developer, @inevitable360, just minted some NFTs on the Dogecoin Blockchain, once thought impossible.\n\nProbably even more stuff going on we'll find out about later...",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iak220p",
                    "author": "Pelthail",
                    "score": 6,
                    "created_utc": 1653926262.0,
                    "response": "I think all crypto is affected by all crypto. It seems everything moves in tandem, and everything is down right now. I think there’s something more going on that I just don’t know or can’t see.\n\nRemember that BC hit $20K and everyone said it was a sham. Then it dropped to $3K and everyone was laughing at the bag holders. And then it launched to $65K. Sometimes it simply takes time to make money.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iak28rk",
                    "author": "atypicalAtom",
                    "score": 5,
                    "created_utc": 1653926346.0,
                    "response": "You must not have been around very long. We've had much larger ups and downs before...the ups will come again.\n\nAlso, look around. The entire crypto market, stock market, us economy, eu economy, Chinese economy, world economy is down. Disease, inflation, war, etc. The good times will come back.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iak50qy",
                    "author": "bmanski22",
                    "score": 2,
                    "created_utc": 1653927575.0,
                    "response": "Yes",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iak5hoq",
                    "author": "nameischeekz",
                    "score": 2,
                    "created_utc": 1653927778.0,
                    "response": "Seems like doge is getting accepted more and more as one of the comments above stated. It’s just a matter of time when the coin stabilizes itself and eventually reach $1. \n\nI been buying doge since 0.02c all the way to its high and all between and buy $5 every day, I believe the coin will get there - long term play from my end.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iak96sj",
                    "author": "Dapper_Hat3161",
                    "score": 2,
                    "created_utc": 1653929400.0,
                    "response": "People need to use the coin Also it seems like everyone post everyday about when it’s going to go up .. \nlike it’s some get rich quick scheme . \nTransaction fees are “low” \nBut now that I think about it if doge goes up to $1 \nWill the fees still be low ?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iak1qea",
                    "author": "I_C_da_G",
                    "score": 3,
                    "created_utc": 1653926118.0,
                    "response": "Yes",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iak9u65",
                    "author": "GoingMenthol",
                    "score": 2,
                    "created_utc": 1653929686.0,
                    "response": ">Iv been holding for over a year now\n\n[Have a look at this chart](https://www.tradingview.com/x/gC17mbeh/), the giant white line would be where you entered if you started exactly 1 year ago. You bought in at more or less the peak\n\n>I reinvested, like everyone else\n\nDon't get swept up in the hype. There's a lot of people saying they're buying the dip, but in reality, nobody knows how far the dip will go. This is the reason why so many people lose money in the stock market, and it's the same reason why people lose money in crypto. Always take a step back and assess the situation\n\n>doge-one satellite and hoping it brought amazing news with it\n\nBe aware of the phrase \"buy the rumour, sell the news\". A lot of people were expecting doge to spike during SNL. Instead it fell. There will always be someone trying to front-run on certain dates to leave others holding the bag\n\n>At this point it just seems doge was pumped and dumped\n\nYes and no. Doge is, was, and will always be, pumped and dumped. But look at the chart again. Dogecoin has reached a new all time high on a roughly 4 year cycle like bitcoin. The problem is that there will always be someone who will buy when it's cheap, and hype everyone when the price hits the peak in order to leave someone else holding the bag\n\n>im stuck holding bags\n\nA lot of people are. It's up to you if you want to wait for 4 years or so for the next all time high, wait for a rally that won't hit an ATH but is enough to cash out in profit, or cash out your losses. It's a bit of a cold response, but like I said earlier, sometimes you need to take a step back and assess the situation",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iak2q68",
                    "author": "OpticallyMosache",
                    "score": 1,
                    "created_utc": 1653926559.0,
                    "response": "It has a huge group of devoted followers and Elon's support which gives it a very good chance of sticking around through the next bull cycle. But right now, converting to BTC is the best risk/reward decision. When the market recovers, BTC will pump first. So what most people are doing is selling their DOGE for BTC to buy back after we see what the market does. BTC will be the indicator. No point in holding DOGE while waiting to find out, unless you are too attached. Good luck bro.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iak66qk",
                    "author": "Reasonable-Name2977",
                    "score": 1,
                    "created_utc": 1653928079.0,
                    "response": "What're you gonna do after the next pump?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iakg9kp",
                    "author": "ReasonedJet99",
                    "score": 1,
                    "created_utc": 1653932526.0,
                    "response": "Don’t miss the opportunity of a lifetime because of a little fear .",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iak72pq",
                    "author": "djchrist15",
                    "score": -2,
                    "created_utc": 1653928468.0,
                    "response": "This is the wrong group of people to ask. They honestly believe dogecoin to be the way of the future. I'll keep saying what I've always said (proud seller of doge at. 69 cents).\n\nProfit is king. That's what we're here to do. Make money. Sell if you're in the green.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iakifm1",
                            "author": "Overall-Address-3446",
                            "score": 1,
                            "created_utc": 1653933505.0,
                            "response": "You sold at. 69 but here you are happy to be back at 50's and looking for .60's\nhttps://www.reddit.com/r/dogecoin/comments/nbubh9/other_side_of_the_globe/?utm_medium=android_app&utm_source=share",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iak67tv",
                    "author": "DavefromCA",
                    "score": -1,
                    "created_utc": 1653928092.0,
                    "response": "Yes 5 times at least. The only remaining value in Doge is people buying drugs or people",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iak4vbc",
                    "author": "liquid_at",
                    "score": 0,
                    "created_utc": 1653927509.0,
                    "response": "Have you taken a look at the entire market?\n\nWhat financial entity do you think is rich enough to pump&dump all of stocks and all of crypto at the same time? \n\nDo you think that story makes sense? \n\nI mean... you could say the FED pumped and dumped the markets... but that's kind of their job... they pump money into the markets so the rich can get richer but when the US debt becomes a problem, they dump the shares of the small investors to pay for it.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "v132jv",
            "title": "Why isn't it possible?",
            "url": "https://v.redd.it/0m90peycwm291",
            "author": "Shivrajtanna",
            "created_utc": 1653925580.0,
            "score": 2,
            "num_comments": 1,
            "subreddit": "dogecoin",
            "selftext": "",
            "stickied": false,
            "comments": []
        }
    ]
}