{
    "subreddit": "Dogecoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uvxr0o",
            "title": "Why do I believe on doge is the future... instead of other cryptocurrency",
            "url": "https://www.reddit.com/r/dogecoin/comments/uvxr0o/why_do_i_believe_on_doge_is_the_future_instead_of/",
            "author": "joeloh96",
            "created_utc": 1653304155.0,
            "score": 10,
            "num_comments": 8,
            "subreddit": "dogecoin",
            "selftext": "Just my 2 cents that why Doge is the future...   \n\n\n1. Fully decentralized. Just like bitcoin. Unlike the other coins who have a co-founder in which the founder usually hold a large amount of coins. A centralized coin will not provide much stability etc collapse of LUNA  \n\n2. There are only 2 coins in the world that provide bond between people. Doge & bitcoin. Bitcoin is for investment whereas doge is for the currency. A coin needs a strong community to support. A diamond remains diamond because people think it is worth  \n\n3. Support of elon musk. He is the legend. He created paypal whereas other people are still paying with cash. Basically he knows more  about currency than others did. Look at the company he created. Most of it are for humankind & changed the rules of games in this world. He has a very clear vision & a strong determination  \n\n4. Crypto is the future. Within 50 years if humankind does not find any civilization outside the space. We either nuclear/destroy ourselves or we will create another parallel world which is the metaverse. The metaverse needs 1 currency  \n\n5. Bitcoin is not suitable for payment. Because it takes 1 hour to process & it has to be divided into 0.000001 bitcoin in order to pay. Doge will be remain as 1 Doge = 1 Doge. It is a natural currency, unlike the others which is created intentionally.  \n\n6. Doge has survived 9 years. It will not die. This creates more stability.  \n\n7. Whenever i see dogecoin, i always feel like it is the early stage of bitcoin. Both of them has too much of similarity except amounts/volume.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9oaxy9",
                    "author": "tall-not-small",
                    "score": 1,
                    "created_utc": 1653308102.0,
                    "response": "Elon bought PayPal. Plus please educate yourself on how many transactions would be possible at maximum. Definitely not enough for for widespread use",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9pnuw0",
                            "author": "ginsengtea3",
                            "score": 1,
                            "created_utc": 1653330254.0,
                            "response": "he co-founded a company that was bought by what would become paypal, not the other way around.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9ocksn",
                    "author": "hodgsonnn",
                    "score": -1,
                    "created_utc": 1653309071.0,
                    "response": "just accept its over mate hahaha",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9pdnuk",
                    "author": "sangderenard",
                    "score": 1,
                    "created_utc": 1653325948.0,
                    "response": "I transfer Bitcoin to God, Litecoin to women, Monero to men and Dogecoin to my horse!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9o7yja",
                    "author": "xXB0SSXx",
                    "score": -3,
                    "created_utc": 1653306194.0,
                    "response": "I drank too much whiskey to read this sh it, sorry shibe.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9o7ni9",
                    "author": "Agreeable-Apricot-36",
                    "score": -2,
                    "created_utc": 1653305995.0,
                    "response": "Don’t mention Elon on here joe, you will get your butt slapped 😂😂😂😂😂",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}