{
    "subreddit": "Dogecoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ushu7e",
            "title": "check this out!!",
            "url": "https://muskscrypt.org",
            "author": "fish_swim_shady",
            "created_utc": 1652894101.0,
            "score": 0,
            "num_comments": 1,
            "subreddit": "dogecoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i93gzaa",
                    "author": "liquid_at",
                    "score": 1,
                    "created_utc": 1652894159.0,
                    "response": "Still a Scam.\n\nGet a real job loser.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "ushod7",
            "title": "Does DogeCoin Still Have As Much Potential As Elon Musk Claims?",
            "url": "https://www.reddit.com/r/dogecoin/comments/ushod7/does_dogecoin_still_have_as_much_potential_as/",
            "author": "Bowserdku",
            "created_utc": 1652893643.0,
            "score": 126,
            "num_comments": 76,
            "subreddit": "dogecoin",
            "selftext": "CoinQuora talked about Tesla and SpaceX CEO, Elon Musk, affirming an already said statement of his regarding DogeCoin, where he said that the coin “has potential as a currency”.\n\n The statement came first in a tweet from the creator of DogeCoin, Billy Markus, yet Musk reaffirmed this statement as he guested on the All-In Summit.  The tweet started with Markus saying “the reason I like DogeCoin is because it knows it is stupid,” Musk replied saying “it has potential as a currency.” But looking at the project it's potential is simply the effect of Musk unlike with projects like Hyve solving the current problems in the global freelance and workforce market, BobEco creating thousands of jobs through the fight against pollution and Aventus, a scaling solution for Ethereum that aims to provide faster and cheaper transactions.\n\n  However, on May 16, another tweet was shared by Dr. \nJulian Hosp, the CEO of CakeDeFi. The tweet said that Musk talked about the possibility of integrating DogeCoin with a social media app to create “Wechat-like super app.”  In other news, Musk announced that his plans to buy Twitter, the social network, were put off until Twitter’s CEO comes forward with real numbers of the fake, spam, or bot accounts, this happened after the CEO refused to show proof of their claims which state that only 5% of their users are fake/scam accounts. \n\n\n Could Twitter be the social network that musk integrates Dogecoin to? Would this skyrocket its potential even more?  Let's watch and see.",
            "stickied": false,
            "comments": [
                {
                    "id": "i93glws",
                    "author": "liquid_at",
                    "score": 58,
                    "created_utc": 1652894007.0,
                    "response": "Doge still has the same potential it had before musk found out about it and if anything, the stuff he has planned adds to that. \n\nBut the benefits of doge outweigh anything Musk could ever do. He's just one of many who support doge and him having more cash to do projects faster than others is his only advantage over others.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i94t1hx",
                            "author": "TouchMyTumor",
                            "score": 14,
                            "created_utc": 1652914109.0,
                            "response": "The Dogecoin Foundation needs to hire you as their remote Reddit PR person 😂",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i952h6e",
                            "author": "AccomplishedBat4658",
                            "score": 6,
                            "created_utc": 1652918541.0,
                            "response": "What is one benefit?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i96m5if",
                                    "author": "liquid_at",
                                    "score": 1,
                                    "created_utc": 1652953563.0,
                                    "response": "being focused on being a currency and nothing but a currency.\n\nfast, cheap transactions and nothing to clog up the blockchain. \n\nCommunity centric development is also something the centralized coins that like to be hyped lack.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i949khr",
                            "author": "irResist",
                            "score": 4,
                            "created_utc": 1652905764.0,
                            "response": "Absolutely! Doge was around way before musk got on board and did perfectly fine without him thank you very much.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i93twwj",
                    "author": "friedguy898",
                    "score": 23,
                    "created_utc": 1652899377.0,
                    "response": "Used it to buy a couple tesla merch and was very efficient",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i94ws7f",
                            "author": "VladTheImpaler77",
                            "score": 4,
                            "created_utc": 1652915848.0,
                            "response": "Same here! I use my Tesla coffee mug every morning.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i946k6c",
                    "author": "sangderenard",
                    "score": 7,
                    "created_utc": 1652904534.0,
                    "response": "I may be oversimplifying it but I think cryptocurrency in general has potential, and the on-ramps and off-ramps could become so effortless, that the use of cryptocurrency or fiat could be a trivial choice. Once it is a trivial choice, an absurd but functional form of currency exists as a vote of no confidence in the status quo as well as a creative expression, no less than having a visa with a picture of a doge on it.\n\nThings don't necessarily have to have a wholly different function to be partly adopted by a large number of people, it just has to be easy enough and has to have an [ a e s t h e t i c ].",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i93wj15",
                    "author": "Monte_20",
                    "score": 5,
                    "created_utc": 1652900447.0,
                    "response": "Idk but hodl",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i93z2gm",
                            "author": "givemethescrip",
                            "score": 2,
                            "created_utc": 1652901491.0,
                            "response": "HOPE IT DOES NOT GO DOWN LIKE LUNA",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i94c3qr",
                                    "author": "BritasticUK",
                                    "score": 6,
                                    "created_utc": 1652906796.0,
                                    "response": "Luna/TerraUSD was a ponzi and there were serious errors in the system that had been set up too (Do Kwon had been told about them on Twitter but he chose to call the person trying to warn him stupid instead of doing anything about it.) Doge doesn't have any problems like that",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i95w9ev",
                    "author": "babyYoda865",
                    "score": 2,
                    "created_utc": 1652933135.0,
                    "response": "Add it to Apple Pay bam\nProblem solved lol",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i95xvh2",
                    "author": "Aardy_ed",
                    "score": 2,
                    "created_utc": 1652934102.0,
                    "response": "YES! Everybody go buy more Doge!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i93gveh",
                    "author": "neomancr",
                    "score": 6,
                    "created_utc": 1652894114.0,
                    "response": "This is the true potential of doge and what makes it effectively the crypto reserve currency.\n\nhttps://www.reddit.com/r/dogecoin/comments/ushs72/to_those_who_are_new_if_you_want_to_understand\n\nElon never had any true influence except over chatter bots and exchange bots manipulating values no different than how we can.\n\nDoge will fail of Elon successfully steals credit for it just like he did for tesla PayPal expired patents to old inventions like the hyper doot etc.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i93kp2w",
                    "author": "NotPresidentChump",
                    "score": 4,
                    "created_utc": 1652895661.0,
                    "response": "Yes",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i93n7x9",
                    "author": "AdNorth965",
                    "score": 2,
                    "created_utc": 1652896663.0,
                    "response": "good",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i93vpsw",
                    "author": "Nornorttle",
                    "score": 2,
                    "created_utc": 1652900117.0,
                    "response": "Billy said we can’t be greedy. If all of us are greedy enough, they are hard to get more rich. They want us just for fun like get a coke fun. You get your doge and fun, they get money and be greedy for money.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9684a4",
                            "author": "South-Bug138",
                            "score": 1,
                            "created_utc": 1652941249.0,
                            "response": "Perfect",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i94dsjq",
                    "author": "Ok-Picture6245",
                    "score": 2,
                    "created_utc": 1652907496.0,
                    "response": "Wait and see as soon as the day comes Doge1 is going to the moon so are we 🚀",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i952zkj",
                    "author": "notso96",
                    "score": 2,
                    "created_utc": 1652918778.0,
                    "response": "If musk thinks dogecoin is good its good.\nId bet my tesla roadster on that",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i95e6nx",
                    "author": "Taronyu019",
                    "score": 2,
                    "created_utc": 1652924031.0,
                    "response": "This is the process from bartering to fiat/banking to the new phase, so yes this here to stay.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i942urs",
                    "author": "Pooshonmyhazeer",
                    "score": 1,
                    "created_utc": 1652903028.0,
                    "response": "Dogecoin has potential. \n\n&&&& because Elon musk is just as much of an expert as I am on Dogecoin, please make a new  Thread with my name too. 🙄 \n\nGet off his high horse homie. If things like this cross your mind, ya probably should learn What actually matters lol.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i93m0bk",
                    "author": "Available_Plenty_143",
                    "score": 0,
                    "created_utc": 1652896181.0,
                    "response": "Doge does NOT have a potential regular day to day currency.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i93yy64",
                            "author": "calimonk323",
                            "score": 5,
                            "created_utc": 1652901443.0,
                            "response": "Please Elaborate",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i93vb76",
                            "author": "masterbatesAlot",
                            "score": 5,
                            "created_utc": 1652899951.0,
                            "response": "Can you provide a reason why?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i941nrr",
                                    "author": "Available_Plenty_143",
                                    "score": 1,
                                    "created_utc": 1652902545.0,
                                    "response": "First off, what’s the reason of converting fiat into Doge to make a purchase when you can just use fiat. Second, and this is probably the biggest reason.  The block chain is public knowledge. So if A sends to B, they would be able to see each other financial history of those wallets. People are very private about their finances. Why would the masses like to switch to a public format?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i943b2n",
                                            "author": "Key-Attention-5547",
                                            "score": 8,
                                            "created_utc": 1652903210.0,
                                            "response": "This guy doesn’t get it",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i943h2e",
                                                    "author": "Available_Plenty_143",
                                                    "score": 1,
                                                    "created_utc": 1652903276.0,
                                                    "response": "What I’m I missing?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i94bhmx",
                                                            "author": "GoingMenthol",
                                                            "score": 7,
                                                            "created_utc": 1652906543.0,
                                                            "response": "Sending money from one country to another is expensive\n\nJust found out that if my mother wanted to send money to another family member abroad, it will involve a fee of £25 for every £1000 send, plus an additional exchange fee\n\nSo sending £250 will cost £25 and a percentage extra\n\nAt that point, it's cheaper to buy dogecoin, send to the family member, and let them use or exchange into their local currency\n\nBtw, hard wallets like Trezor let you generate a new wallet address whenever you want. You're not tied to a single identifiable wallet unless you want to be",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i94cfog",
                                                                    "author": "Available_Plenty_143",
                                                                    "score": 2,
                                                                    "created_utc": 1652906933.0,
                                                                    "response": "This I completely agree with! It easier to send money via crypto to another country!!! We are talking about day to day use. I know you can make new wallets but we live in a connivence driven society. What’s the point of constantly making new wallets when you can just stick the same bank account.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i94g4sm",
                                                                            "author": "GoingMenthol",
                                                                            "score": 6,
                                                                            "created_utc": 1652908482.0,
                                                                            "response": "> We are talking about day to day use\n\nCrypto is still not massively adopted across the world. Technically speaking, no cryptocurrency is useful for day to day use because of this\n\nThat being said, I used to use dogecoin as the \"fiat\" currency back when the price was $0.003 as the spread was much lower than using GBP when exchanging from one crypto to another. In order for me to do the same thing again, dogecoin needs to stay at a consistent price, or fluctuate minimally\n\n> What’s the point of constantly making new wallets when you can just stick the same bank account\n\nIf I want someone to send me crypto, there's 1 single button to generate a QR code for me to receive. The wallet does everything else for me. I get a new wallet address to keep some anonymity, I get the money in seconds, and the person sending it only needs to scan a QR code\n\nThat's easier than my bank account requesting a person's account number and sort code, or having to write an entire IBAN by hand, or sending money on the weekend and waiting for it to arrive Monday morning. All of these options from my bank are immediately identifiable and I have no say on that matter\n\n> Why would the masses like to switch to a public format?\n\nIt's not public, it's pseudonymous, which is more than what the public have already\n\n> The point of credit cards are to either build credit or to borrow capital that one does not have\n\nDogecoin is debit only. If you want credit, remain with a bank\n\n> It’s not accessible to the public unlike the blockchain\n\nThe entire point of a publicly accessible blockchain is to ensure that money doesn't appear out of nowhere, like how banks literally make money out of nowhere by creating loans for clients. The concept is that no single institution can be trusted, so every transaction must be validated by the community\n\nYou cannot have a subprime lending crisis with dogecoin because you cannot make loans with money that came from nowhere. You cannot have rising inflation with dogecoin because it's a fixed amount of minted coins per year. But you can have it all and more with traditional banking",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i966pc1",
                                                                                    "author": "neomancr",
                                                                                    "score": 1,
                                                                                    "created_utc": 1652940155.0,
                                                                                    "response": "Good answer. I'm surprised he didn't respond. Just letting you know people are reading.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i96snfx",
                                                                                            "author": "GoingMenthol",
                                                                                            "score": 1,
                                                                                            "created_utc": 1652958679.0,
                                                                                            "response": "I don't think they'll respond because they're only looking for a confirmation bias; trying to give questions to people who don't have an answer as a way to prove themselves right\n\nThe community is brought together by memes and light-heartedness. But it also means that many don't know the reality of how the global financial systems work, the ever-present risk of the rich exploiting the poor, or what ways people try and escape it. All while they have money in crypto",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "i948f20",
                                                            "author": "masterbatesAlot",
                                                            "score": 4,
                                                            "created_utc": 1652905295.0,
                                                            "response": "Regarding privacy, the blockchain only shows a wallet address.  There is nothing that ties that transaction back to you.  However, your bank/credit card statement will.\n\nWhy would people want to switch to crypto over fiat?   The fees!   Dogecoin fees are a fraction of a penny.  Much cheaper than credit card transactions for the merchant.\n\nAlso turn around time.  Most credit card settlements happen in batch overnight.   Crypto payments happen more real time.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i94arxh",
                                                                    "author": "Available_Plenty_143",
                                                                    "score": 2,
                                                                    "created_utc": 1652906253.0,
                                                                    "response": "The Blockchain shows wallet addresses AND there history of transactions. Like I said, if I give my fiend my wallet address, that can look up my history.  Also, I have done transactions that are $10k+ and didn’t pay any fees. They were done with a bank that offers protection.  And lastly. The point of credit cards are to either build credit or to borrow capital that one does not have. Either which Doge can’t do. I use a credit with no fees. I pay my credit card on time and improve credit score. My brother pays a 50$ fee a year to use his credit card which he doesn’t mine since it improves his credit.\nAlso, my bank/credit statement is between me and my bank.  It’s not accessible to the public unlike the blockchain.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i94hcup",
                                                                            "author": "masterbatesAlot",
                                                                            "score": 4,
                                                                            "created_utc": 1652909001.0,
                                                                            "response": "It is true that crypto won't boost your credit score and it won't allow you to float money like credit cards do.  This would be more like an electronic cash payment system over a credit card system.\n\nAs for fees, every credit card/Debit card transaction is subject to their processing fees.  The fees are paid by the merchant though.  Some credit card companies kick a portion of that back to the card holders as \"cash back\".  However, you are paying for credit card fees indirectly as mechants have to increase the price to cover the fees.  There was a post a while back that did the math and showed that  Walmart could save millions a day by using crypto over credit cards as a means for electronic payments.   We can only hope that if they do Dogecoin becomes one that they do accept!",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "id": "i949tda",
                                                                    "author": "powerisntknowledge",
                                                                    "score": 2,
                                                                    "created_utc": 1652905866.0,
                                                                    "response": "![gif](giphy|26FLgGTPUDH6UGAbm)",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i94n0ac",
                                            "author": "FaceBillions24",
                                            "score": 1,
                                            "created_utc": 1652911413.0,
                                            "response": "using your argument yesterday i went into 7-11 for a pack of cigs the older guy infront of me handed the cashier a 10 bill with his phone out and said put this on my 7-11 app. the cashier said the app is slow right now but the guy didnt care he wanted it done. in his other hand was a small fing coffee. this guy made us all wait till the 10$ showed up on his app that he just handed the guy so he could pay for his coffee using the app. how is that different.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i965p3v",
                                            "author": "neomancr",
                                            "score": 1,
                                            "created_utc": 1652939391.0,
                                            "response": "Do you not understand CRYPTO currencies at all? what about a public ledger is deanonymizing? You know you can create a new wallet anytime you want and there's no user ID data store right? Compare that to a credit card. I don't even use cash tbf. I use my phone for 99 percent of purchases.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i941hl1",
                    "author": "buwefy",
                    "score": 2,
                    "created_utc": 1652902475.0,
                    "response": "Doeg coin still has potential... All crypts are a scam, but the bubble isn't bursting anytime soon, Elon Musk is going bananas and becoming dangerous, maybe best to stop following him...\nThat's my prediction and like another prediction in cryptos, it has no value..",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i966y0r",
                            "author": "neomancr",
                            "score": 1,
                            "created_utc": 1652940335.0,
                            "response": "You: You get it.\n\nAll others: this guy gets it",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i94duiu",
                    "author": "Fasterthanyounow",
                    "score": 1,
                    "created_utc": 1652907519.0,
                    "response": "He told the world what he thinks of doge on SNL",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i94f1mk",
                    "author": "whambamthankyoumane",
                    "score": 1,
                    "created_utc": 1652908017.0,
                    "response": "HAHAHAHAHHAHAHAHAHAHAHAHAHHAHA",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i93tkwz",
                    "author": "Responsible-Toe-2918",
                    "score": 1,
                    "created_utc": 1652899243.0,
                    "response": "OK",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i93tvh9",
                    "author": "Responsible-Toe-2918",
                    "score": 1,
                    "created_utc": 1652899361.0,
                    "response": "OK",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i93ul9d",
                    "author": "replaysMike",
                    "score": 1,
                    "created_utc": 1652899658.0,
                    "response": "Yes my friend",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i93xqw9",
                            "author": "CYBERTRUCKSHIBDOG",
                            "score": 0,
                            "created_utc": 1652900943.0,
                            "response": "Fine!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i94swuc",
                    "author": "FractalsAndPDEs",
                    "score": 1,
                    "created_utc": 1652914051.0,
                    "response": "The potential of doge is the potential of meme. You believe in meme, you believe in doge. No price guarantees",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i95sfzt",
                            "author": "The_Peacock_King",
                            "score": 1,
                            "created_utc": 1652931006.0,
                            "response": "MemeKanggg",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i95cfau",
                    "author": "an0ner",
                    "score": 1,
                    "created_utc": 1652923224.0,
                    "response": "What color lambo should I get should be your only question.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i95ld5m",
                    "author": "JitWeasel",
                    "score": 1,
                    "created_utc": 1652927406.0,
                    "response": "Lol. Potential to make him tons of money every time he pumps it.\n\nI mean right now seriously who knows. All crypto is down. If you believe in crypto in general, might as well diversity and buy the huge dip. Buy some doge and other stuff too.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i94i9ds",
                    "author": "GoingMenthol",
                    "score": -1,
                    "created_utc": 1652909393.0,
                    "response": "Gonna be honest, I don't trust Elon. I find it more likely that he's looking for ways to sell Tesla stock while it's high and stash the money somewhere else\n\nMaybe he'd use Tesla stocks to buy twitter, say that it's a bad deal and withdraw the money tax free, or place it into dogecoin and force a pump to new highs. Yes, we would benefit from a pump, but it will most certainly cause a dump back down, and there will always be someone left holding the bag. That's no bueno\n\nThe WeChat idea is a really good idea for the following reason: There is no western equivalent to WeChat for payments. Cashapp exists but is still small. PayPal isn't used as a regular app and isn't a social media platform. Whatsapp has been trying to get this running for at least a year and has been failing (especially with the stuff they tried doing in India). Facebook/Meta failed with their Diem coin. If Elon is actually going to do this then he needs to do it quick and do it right the first time before someone beats him to the punch\n\nEdit: For those who downvoted, think of the reasons why Billy and the developers for dogecoin aren't taking a commanding, figurehead role. Musk hasn't added anything that dogecoin doesn't already have. The only thing he provides is capital, and that capital hasn't shown any realistic change to dogecoin's development. I am pro dogecoin but distrustful of Elon Musk",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i94b2lm",
                    "author": "Grand_Towel_5071",
                    "score": -1,
                    "created_utc": 1652906377.0,
                    "response": "When you need 100k dollars to buy a loaf of bread.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i95fjbf",
                    "author": "p3ni5wrinkl3",
                    "score": -1,
                    "created_utc": 1652924653.0,
                    "response": "Nope",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i96r10q",
                    "author": "DogeNoob3000",
                    "score": 1,
                    "created_utc": 1652957527.0,
                    "response": "Its all about timing",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i94hedg",
                    "author": "adeezy58",
                    "score": -2,
                    "created_utc": 1652909019.0,
                    "response": "No.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i93v9t3",
                    "author": "SquashedBerries4",
                    "score": -7,
                    "created_utc": 1652899936.0,
                    "response": "Lol you asked this on the wrong sub. This is like going to a right wing subreddit and asking “Do you think we should execute women for making decisions with their own body?”",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9436ib",
                            "author": "Pooshonmyhazeer",
                            "score": 6,
                            "created_utc": 1652903159.0,
                            "response": "Wrong. Please see my reply. \n\nYour welcome.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i96gw03",
                            "author": "neomancr",
                            "score": 1,
                            "created_utc": 1652948766.0,
                            "response": "This sub used to be and still is anti Elon. You can find articles of how the doge crew reacted to his manipulation. No one actually likes that he destroys doge's stability with constant manipulation. It's his manipulation via his b'oughts that tarnish doge's reputation and destroys its stability making it seem more and more like a pump and dump which if anything is what he is actually known for.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i957pok",
                    "author": "ResponsibilityOk9913",
                    "score": 0,
                    "created_utc": 1652921012.0,
                    "response": "Nope",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i95cb33",
                    "author": "an0ner",
                    "score": 0,
                    "created_utc": 1652923172.0,
                    "response": "Yes.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i965god",
                    "author": "Phaze_One",
                    "score": 0,
                    "created_utc": 1652939221.0,
                    "response": "NOPE. In the words of Regina George from “MEAN GIRLS”. “  QUIT TRYING TO MAKE IT HAPPEN ITS NOT GONNA HAPPEN”.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "ushlo8",
            "title": "Moving off Robinhood milestone",
            "url": "https://i.redd.it/v9k66zman9091.jpg",
            "author": "SkywordBound",
            "created_utc": 1652893439.0,
            "score": 26,
            "num_comments": 6,
            "subreddit": "dogecoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i93g89b",
                    "author": "Battletoad507",
                    "score": 2,
                    "created_utc": 1652893852.0,
                    "response": "Such a great feeling, I really enjoyed deleting the app as well.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}