{
    "subreddit": "Dogecoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uvhgrm",
            "title": "what it feels like to listen to this thread and HODL in May 2022",
            "url": "https://youtu.be/W6qWnmb_22s",
            "author": "Ryluv2surf",
            "created_utc": 1653245594.0,
            "score": 4,
            "num_comments": 1,
            "subreddit": "dogecoin",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uvh7y2",
            "title": "Transferring",
            "url": "https://www.reddit.com/r/dogecoin/comments/uvh7y2/transferring/",
            "author": "Archangel02150",
            "created_utc": 1653244872.0,
            "score": 0,
            "num_comments": 10,
            "subreddit": "dogecoin",
            "selftext": "Can some one please direct me on how I can move my coins to a wallet. I have a MetaMask wallet. Is that good. If there’s something more secured, please help a fellow doge out? Thanks",
            "stickied": false,
            "comments": [
                {
                    "id": "i9lg9s0",
                    "author": "Taronyu019",
                    "score": 3,
                    "created_utc": 1653246080.0,
                    "response": "Any wallet away from the exchange is a good wallet. What I learned is that hardware wallets is the best way to go. Also, be careful with [Hot wallets per Micro$oft](https://www.zdnet.com/finance/blockchain/malware-is-targeting-crypto-wallets-says-microsoft-heres-how-to-protect-yourself-better/).\n\nWe are a Doge Nation and we do only good.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9llygy",
                    "author": "dvs6371",
                    "score": 3,
                    "created_utc": 1653248677.0,
                    "response": "All you have to do is find your wallet's ID. I'm currently using MyDoge until I get a hardware wallet this Fall, and in my wallet there's a feature that allows your wallet to receive funds. Somewhere in that feature should be a QR code and/or an alphanumeric code that you can copy.\n\nI dont know where your Doge is, but if you have a wallet on Robinhood, when you select Doge to view it on RH, there should be a button that says SEND. If you click that and it will prompt you to enter the amount of Doge to send. Currently (at least for me), you can only transfer 5000 Doge at a time, with a network fee surcharge of 0.02 Doge. Then it'll prompt you for the QR code or the code you copied to your clipboard. Either scan or paste the code, confirm it, and wait about 5 to 10 minutes for it to pop up in your wallet. Repeat until all your Doge is off the exchanges. If you are using RH, the max you can transfer in a 24 hour period is 50k Doge, since the max you can transfer is 5k and the max transfers you can do in 24 hours is 10.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ln46u",
                            "author": "mehmehmeh888",
                            "score": 2,
                            "created_utc": 1653249206.0,
                            "response": "Nice breakdown 😊",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9lq04l",
                                    "author": "dvs6371",
                                    "score": 2,
                                    "created_utc": 1653250529.0,
                                    "response": "I'll do a better one in a few days! I just bought another 50k Doge last week, as soon as the funds are collected from my bank account (I'm assuming that's why RH isn't letting me transfer any of it right now), I'll do a full step-by-step guide with pictures to help our fellow Shibes break free from Robinhood!",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9lrgk2",
                                            "author": "mehmehmeh888",
                                            "score": 2,
                                            "created_utc": 1653251199.0,
                                            "response": "Love it! I got 130K so far",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9mroxc",
                            "author": "Fulvio55",
                            "score": 1,
                            "created_utc": 1653269259.0,
                            "response": "Why wait? You can have thousands of text wallets in seconds, right now.\n\nThey’re free, and they’re arguably safer than a slab of hardware you can easily lose or destroy.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9msol5",
                                    "author": "dvs6371",
                                    "score": 1,
                                    "created_utc": 1653269741.0,
                                    "response": "Because that's how I want to store mine? I'm pretty responsible with the things I own, not terribly worried about losing or breaking a hardware wallet.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9lfif6",
                    "author": "RubberyTheology",
                    "score": 1,
                    "created_utc": 1653245740.0,
                    "response": "Yeah Metamask is good and you will be sure you’re not sharing your seed phrase with anyone",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ln29k",
                    "author": "mehmehmeh888",
                    "score": 1,
                    "created_utc": 1653249182.0,
                    "response": "Mine is in MyDoge wallet too! Though I’ve heard it’s better to put in a cold wallet but if you don’t have one hot wallet it is lol",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9mrwxw",
                    "author": "Fulvio55",
                    "score": 1,
                    "created_utc": 1653269368.0,
                    "response": "The sending part you’ll have to work out for yourself.\n\nFor where to send them, text wallets are the go. Just make sure you save multiple copies of the text file and coinb.in, on removable media to keep them safe.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}