{
    "subreddit": "Dogecoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uwm7gt",
            "title": "Don't give up DOGIENAUTS!!!!!",
            "url": "https://i.redd.it/znp1g940zd191.png",
            "author": "sivard_official",
            "created_utc": 1653381742.0,
            "score": 41,
            "num_comments": 3,
            "subreddit": "dogecoin",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uwm8gt",
            "title": "DOGECOIN DAILY DISUCSSION",
            "url": "https://www.reddit.com/r/dogecoin/comments/uwm8gt/dogecoin_daily_disucssion/",
            "author": "42points",
            "created_utc": 1653381879.0,
            "score": 27,
            "num_comments": 57,
            "subreddit": "dogecoin",
            "selftext": "Hi Shibes,\n\nWelcome to todays Daily Discussion post. **YOU ARE DOGECOIN!**\n\n\n---\n\nI just want to quickly remind people that this subreddit does have a tipbot where you can give each other dogecoins.   \n\n-->> [Click on this link for instructions on how to start a tipbot account](https://www.reddit.com/r/sodogetip/wiki/index) <<---  \n\nOnce you sign up you will get an on-chain wallet address where you can track your coins. You can also get the private key for this wallet from the SoDogeTip website. You can transfer dogecoins into this wallet address and begin giving dogecoin to other people on reddit! And using your key you can also send coins yourself, even if the tipbot is down\nMaybe you see a meme that made you laugh? Give them a few dogecoin.\nMaybe you see an insightful post that helped you understand something better? Give them a few dogecoin.\nMaybe you see a charity you'd like to donate to. Do it with sodogetip. \n\nYou can also get the latest version of the dogecoin wallet (version  1.14.5) from www.dogecoin.com \n\n---\n\nHere are some links and topics that people have wanted me to post here. Please take a look!\n\n* [HOW TO BUY DOGECOIN GUIDE UPDATED](https://redd.it/qrhcs5/) - https://redd.it/qrhcs5\n\n* [[Guide] How to create and redeem paper wallets! ](https://redd.it/r7cg2e)   \n\n* [[Guide] Extract the recovery phrase from the Android apappp Dogecoin Wallet created by langerhans](https://redd.it/rcvzw4) \n\n* [[Guide] A quick comparison of Dogecoin wallets](https://redd.it/rd8hya) \n\n* [Such News! Are we ready for our tipbot keys?](https://www.reddit.com/r/dogecoin/comments/nw6okq/such_news_are_we_ready_for_our_tipbot_keys_ive/)\n\n* [Cryptwerk.com is a list of many many many places you can spend dogecoin.](https://cryptwerk.com/pay-with/doge/)\n\n* [Advice from a Gambling Counsellor](https://www.reddit.com/r/dogecoin/comments/mwrltk/advice_from_a_gambling_counsellor/) - https://redd.it/mwrltk\n\n* [Looking after your mental health](https://reddit.com/r/dogecoin/comments/mtf2ym/reminder_that_dogecoin_is_awesome_but_its_not/) - https://redd.it/mtf2ym\n\n* [Being aware of scammers](https://www.reddit.com/r/dogeducation/comments/n9nwfc/scammers/)\n\n* [Another Shibe wrote a post about being aware of scams.](https://redd.it/mrq5c9) - https://redd.it/mrq5c9\n\n* [F@H (Folding@Home) and GitHub are NOT Doge helplines!](https://www.reddit.com/r/dogecoin/comments/n6wtnr/fh_foldinghome_and_github_are_not_doge_helplines/)\n\n* [From 7 years ago. An open letter to the Dogecoin community from co-founder Billy Markus](https://www.reddit.com/r/dogecoin/comments/1xaeue/enjoy_this_moment_an_open_letter_to_the_dogecoin/)\n\n* [Had a few people ask me to mention this petition to get Amazon to accept dogecoin](http://chng.it/R48d6XYwMr)\n\nSome Shibes have reported issues with getting their dogecoins out of binance.us (maybe binance.com as well). /u/patricklodder created an informative post recently that shows people just how to do this if you have an Android phone. Check it out here. https://www.reddit.com/r/dogecoin/comments/rxhefe/guide_how_to_get_your_doge_out_of_binance_android/\n\n\n---\n\n\nFor more technical discussions about dogecoin please visit /r/dogecoindev \n\n---\n\n\nDon't forget to report posts and comments you think are not appropriate for the subreddit. If you want to discuss something specific please [message the moderators](https://www.reddit.com/message/compose/?to=/r/dogecoin)\n\nDo you want something added here? Send the moderators modmail to discuss. Do you want something removed from here? Well send modmail too. You all make this post together and your help is always appreciated. \n\nYou are loved, \n\n42\n\n___\n\n**D**o **O**nly **G**ood **E**veryday\n\nJust keep on dancing!",
            "stickied": true,
            "comments": [
                {
                    "id": "i9tpxg9",
                    "author": "AmbitiousWest1074",
                    "score": 17,
                    "created_utc": 1653410415.0,
                    "response": "So it will mean nothing. But from this community I quit smoking cigarettes. In New York it’s 17 dollars a pack. I was a pack a day smoker. My 17 dollars now goes into doge everyday. I did it for me. Doge still represents something good. I was literally killing myself. This is not financial advice. But we need to remember why we are here. Yes I want money too. But this community, this coin, is what brought us together. I don’t know what anyone can afford. But I do know we all have a vice that we can quit and invest in ourselves. Our children, and our future. I am nothing but a tear in the ocean, and I don’t want to be anymore than that. But this is our coin, our future. We create the value. It is now time.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9tyyzd",
                            "author": "Effective_Pin_90",
                            "score": 6,
                            "created_utc": 1653414125.0,
                            "response": "Congrats shibe! I've done just about everything under the sun and nicotines the only thing I've ever been addicted to.  Stay strong.\n\nThis is the way.\n\nEdit:  it has come to my attention, I MIGHHTT be addicted to doge too 😅🤷‍♂️ 🐕🐕🐕",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9tztdr",
                    "author": "tatyanad99",
                    "score": 6,
                    "created_utc": 1653414475.0,
                    "response": "A bought Doge on Robinhood, was that a bad idea? Should I have used a different app?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9u2py8",
                            "author": "MokolokoPlus",
                            "score": 9,
                            "created_utc": 1653415671.0,
                            "response": "Use the app you like, but at the end, it’s better to have your assets on your own wallet :)",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9umz40",
                                    "author": "tatyanad99",
                                    "score": 4,
                                    "created_utc": 1653424197.0,
                                    "response": "How do I get my own wallet? Also, can you transfer your crypto from one wallet to another? I’m very new to this😅",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9und5x",
                                            "author": "MokolokoPlus",
                                            "score": 4,
                                            "created_utc": 1653424362.0,
                                            "response": "Yes, while your own that wallets yes you can, you need to create one, on my doge app is a wallet special for doge, it’s a hot wallet, or you can purchase a ledger wallet and that it’s a cold storage, cold storage it’s the most safe wallet to keep you’re cripto assets",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9umo9h",
                            "author": "TheDoge420",
                            "score": 8,
                            "created_utc": 1653424070.0,
                            "response": "robinhood is cool, i started with them and i have a coinbase (pro) account as well, many people gave robinhood a hard time because they didn't have crypto wallets, now they do have wallets, so you can move your coins on and off their exchange",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9ul2fh",
                            "author": "LRTISTA",
                            "score": 6,
                            "created_utc": 1653423396.0,
                            "response": "Mydoge seems cool",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9uypyw",
                            "author": "masterbatesAlot",
                            "score": 5,
                            "created_utc": 1653429265.0,
                            "response": "There are a lot of Robinhood haters since the GME event, but Robinhood is the cheapest place to buy Dogecoin right now.  It's where I make my doge purchases!",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9v8ddj",
                            "author": "regularqualitysound",
                            "score": 3,
                            "created_utc": 1653433626.0,
                            "response": "Robinhood is a good app. There are no trading fees, it offers a wallet, plus you can also buy traditional stocks, ETF's, etc. and they offer a checking account with a cash back debit card. Plus advanced options like stock lending. \n\nIt's the only Brokerage in the US that I am aware of that does all of the above in one account. \n\nIt doesn't hurt to move some of your coins off a brokerage if you do not plan on selling into a cold wallet. A cold wallet is a hard drive for crypto that does not connect to the internet. Leger is a good one available on Amazon.\n\n If you want your own keys but also want a wallet on your phone MyDogeWallet and Coinbase wallet are very good. Be aware as it is connected to the internet, it has slightly higher risk, although you do keep your own keys.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9v944s",
                                    "author": "regularqualitysound",
                                    "score": 3,
                                    "created_utc": 1653433976.0,
                                    "response": "Robinhood is working on a separate stand alone wallet where you have your own keys, similar to Mydogewallet and Coinbase wallet. There is a waitlist now and it is supposed to be available later this year. \n\nI just got my debit card and they match cash back and invest it. I have my set to invest automatically in Doge.\n\nAnother feature is they will write checks for you, just put in the info and amount into the app and hit send and they auto mail the check to the recipient. \n\nNot trying to sound like a Robinhood maxi, but honestly exchanges and brokerages can be obnoxious and overwhelming. They seem to try and make things easy.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9ugpab",
                    "author": "Effective_Pin_90",
                    "score": 6,
                    "created_utc": 1653421559.0,
                    "response": "Some classical doge music to ease the mind during these uncertain economic times.  🐕🐕🐕🚀 🚀 🚀 😎\n\n[Đ is for doge](https://youtu.be/000al7ru3ms)",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9uxz7g",
                            "author": "masterbatesAlot",
                            "score": 2,
                            "created_utc": 1653428943.0,
                            "response": "Turn your 401(k) into a 401(k9).\n\nhttps://youtu.be/cbI31x3FpS0",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9unje8",
                    "author": "MokolokoPlus",
                    "score": 4,
                    "created_utc": 1653424434.0,
                    "response": "Buenas tardes amigos shibes, otro lindo día holdeando Doge",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9uxuvt",
                            "author": "masterbatesAlot",
                            "score": 3,
                            "created_utc": 1653428891.0,
                            "response": "Yo Quiero Dogecoin",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9v2llz",
                    "author": "Agitated_Bend_5441",
                    "score": 4,
                    "created_utc": 1653430973.0,
                    "response": "![gif](giphy|3o7aDfgnYnifx09JwQ)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9sbo9w",
                    "author": "Necessary-Pension224",
                    "score": 10,
                    "created_utc": 1653382772.0,
                    "response": "![gif](giphy|8L0wVdFsLWeLcFj5Fx)\n\nHey Shibes ♥️ Have a nice Day !",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9sfg36",
                            "author": "KovaCap2",
                            "score": 5,
                            "created_utc": 1653386247.0,
                            "response": "And you my fellow Shibe!",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9ttyou",
                                    "author": "GAMEJUNKYZ007",
                                    "score": 2,
                                    "created_utc": 1653412062.0,
                                    "response": "![gif](giphy|icUEIrjnUuFCWDxFpU)",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9sfoka",
                            "author": "Random-Gif-Bot",
                            "score": 4,
                            "created_utc": 1653386455.0,
                            "response": "&#x200B;\n\n![gif](giphy|a5lHu3aae9AtyE9urT)",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9sp12t",
                    "author": "I-Respect-You",
                    "score": 7,
                    "created_utc": 1653393336.0,
                    "response": "Any resources available to assist startups using dogcoin? Wouldn't this kind of thing help with natural integration of a doge based economy?\n\n\n(This is outside my knowlage base)\n\nDOGE",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9thtw7",
                            "author": "liquid_at",
                            "score": 4,
                            "created_utc": 1653407111.0,
                            "response": "developers are working on API and doge-lib (c-library for doge). Wiki and website are being worked on. some projects like a wordpress-plugin have just been released.\n\nI'd say we see a lot of improvement in that area within the next year. \n\nStill only very few people working on doge so you can't expect that things are done in a couple days.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9twvrt",
                                    "author": "I-Respect-You",
                                    "score": 3,
                                    "created_utc": 1653413263.0,
                                    "response": "True, thanks for the insight!",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9txam0",
                                            "author": "liquid_at",
                                            "score": 4,
                                            "created_utc": 1653413433.0,
                                            "response": "Personally, I'm very bullish on the dogelib. Every C-Programmer being able to just import a library and start writing apps for the doge blockchain is going to be huge.\n\nDevelopers want to get the community more involved in development and imho that's the best thing coming up for doge. The more people join the process, the more output doge will have and the more attention it will get. \n\nSuper-Excited for it.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9v21d8",
                                                    "author": "I-Respect-You",
                                                    "score": 2,
                                                    "created_utc": 1653430728.0,
                                                    "response": "That sounds like it has explosive potential,  I don't know any programming languages except for ladder (used python for a project once) but we have some mighty minds on this planet and I look forward to see what fruits of these endeavors.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9tpcxt",
                    "author": "masterbatesAlot",
                    "score": 7,
                    "created_utc": 1653410185.0,
                    "response": "Happy Vibes, Happy Shibes\n\n![gif](giphy|9dPDN0CDo9WY0aeQb4|downsized)\n\n\\+u/sodogetip 1 doge verify",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9uorby",
                            "author": "AssociationNo7431",
                            "score": 2,
                            "created_utc": 1653424950.0,
                            "response": "All aboard…",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9sjsfh",
                    "author": "DavidBeeby",
                    "score": 6,
                    "created_utc": 1653389787.0,
                    "response": "&#x200B;\n\n![gif](giphy|28GHfhGFWpFgsQB4wR|downsized)",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9smrag",
                            "author": "liquid_at",
                            "score": 6,
                            "created_utc": 1653391875.0,
                            "response": "&#x200B;\n\n![gif](giphy|xT9IgG50Fb7Mi0prBC)",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9sz8ce",
                    "author": "Otherwise_Baby_6930",
                    "score": 5,
                    "created_utc": 1653398937.0,
                    "response": "We are buying dogecoins for a living.  That is our future.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9tkdhx",
                    "author": "Afraid_Function3590",
                    "score": 4,
                    "created_utc": 1653408156.0,
                    "response": "Dose putting my doge in a doge core wallet keep it off the  exchange or do I need physical wallet",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9toq4j",
                            "author": "masterbatesAlot",
                            "score": 6,
                            "created_utc": 1653409930.0,
                            "response": "Doge core wallet is fine.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9tou79",
                                    "author": "Afraid_Function3590",
                                    "score": 4,
                                    "created_utc": 1653409976.0,
                                    "response": "Ok thanks",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9tod10",
                    "author": "Mundane_Ad_3106",
                    "score": 5,
                    "created_utc": 1653409783.0,
                    "response": "Đ",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9tzhlh",
                            "author": "LRTISTA",
                            "score": 4,
                            "created_utc": 1653414339.0,
                            "response": "O",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9u1y8g",
                                    "author": "Agitated_Bend_5441",
                                    "score": 3,
                                    "created_utc": 1653415348.0,
                                    "response": "G",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9u2w3z",
                                            "author": "MokolokoPlus",
                                            "score": 3,
                                            "created_utc": 1653415744.0,
                                            "response": "E",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9sv4t4",
                    "author": "regularqualitysound",
                    "score": 5,
                    "created_utc": 1653396861.0,
                    "response": "![gif](giphy|S1YVlFY74PCs0CLGfK|downsized)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9sxcmv",
                    "author": "ABAistheBEST",
                    "score": 3,
                    "created_utc": 1653398011.0,
                    "response": "Felt good. Put myself over 66k doge. 👍🏼🚀",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ug8hq",
                            "author": "Effective_Pin_90",
                            "score": 2,
                            "created_utc": 1653421363.0,
                            "response": "Next stop, 69,420!   Get it shibe!\n\n![gif](giphy|KYf4aKM1pIGvXxW07V)",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9uroy4",
                    "author": "ApoliticalAth3ist",
                    "score": 3,
                    "created_utc": 1653426200.0,
                    "response": "To the moooooon 😂",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ukc40",
                    "author": "BatmanBornAgain",
                    "score": 4,
                    "created_utc": 1653423083.0,
                    "response": "Keep buying Dogecoin guys. Bring it up the moon lol",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9tsob3",
                    "author": "TouchMyTumor",
                    "score": 4,
                    "created_utc": 1653411539.0,
                    "response": "#DOGE",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9tu4ct",
                            "author": "GAMEJUNKYZ007",
                            "score": 3,
                            "created_utc": 1653412127.0,
                            "response": "MOON",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9vhmdk",
                                    "author": "Effective_Pin_90",
                                    "score": 1,
                                    "created_utc": 1653438024.0,
                                    "response": "#LAMBO",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9t9yqe",
                    "author": "redarkane",
                    "score": 2,
                    "created_utc": 1653403807.0,
                    "response": "What's with the sudden drop?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9thk36",
                            "author": "liquid_at",
                            "score": 4,
                            "created_utc": 1653406998.0,
                            "response": "pretty much what the market, including bitcoin is doing.\n\nSlowly creeping up over hours followed by one big red candle undoing it all.\n\nSomeone with a ton of money knows how to spend it to dump the price and there are no laws preventing them from doing so.\n\nSince the world is scared and poor now, there just isn't enough buying-pressure to push it back up.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9tgr5e",
                    "author": "BatmanBornAgain",
                    "score": -5,
                    "created_utc": 1653406663.0,
                    "response": "Keep buying Doge guys. Keep it up lol",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9vmgsi",
                    "author": "ApartDisaster",
                    "score": 1,
                    "created_utc": 1653440333.0,
                    "response": "Doge is still the best :) I am accumulating",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}