{
    "subreddit": "Dogecoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "v04srj",
            "title": "2% Doge Rewards with Gemini Card",
            "url": "https://i.redd.it/ajsmijsltc291.jpg",
            "author": "DeepFuckingVision",
            "created_utc": 1653803577.0,
            "score": 25,
            "num_comments": 12,
            "subreddit": "dogecoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "iaetclw",
                    "author": "Emperors_Finest",
                    "score": 9,
                    "created_utc": 1653818510.0,
                    "response": "Make sure whatever you do, you pull your coins/rewards off the exchange to a cold wallet. \n\nGemini is basically where Barry takes doge to short",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaeclug",
                    "author": "DeepFuckingVision",
                    "score": 7,
                    "created_utc": 1653803853.0,
                    "response": "Anyone else get a Gemini Master Card for crypto rewards? \n\nI was skeptical of reward cards at first, but this is in lieu of \"cash back\" rewards like a regular credit card. Best thing is, \"rewards\" aren't taxable events. You only pay tax on the gains made after getting the reward.\n\nYou can choose whichever crypto you want for the reward as long as it's on Gemini, you can switch it whenever you want to another coin. I'm going with Doge rather than Bitcoin for now. I believe they go directly to your account immediately after your purchases, either that or after each statement. It's also nice that the card number is not on the card, you can only get it digitally.\n\nIt's hella thick metal, can barely bend it. You can choose black, silver, or rose gold for the color.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iafugze",
                            "author": "not_into_that",
                            "score": 2,
                            "created_utc": 1653840164.0,
                            "response": "Hi commercial, I'm human. \n\nNot so nice to meet yaz.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iaeh454",
                    "author": "Fulvio55",
                    "score": 4,
                    "created_utc": 1653807563.0,
                    "response": "Might want to check the fine print and see where the ‘rewards’ come from.\n\nIt may be a slice of the merchant fees, but it may also be a part of interest charged on your coins being lent out to shorters.\n\nIf it’s the latter, then this is a really really bad idea.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaeiz0o",
                            "author": "DeepFuckingVision",
                            "score": 5,
                            "created_utc": 1653809171.0,
                            "response": "Not sure how that would work. I just assume it comes from master card similar to my visa credit card that gives me cash back. The real key is to pay off the balance every month to avoid interest. Instead of getting cash directly, I think it just goes to gemini and gets me the 2% cash equivalent value in whichever coin you have set, at the current market price.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iaenzod",
                                    "author": "Fulvio55",
                                    "score": 6,
                                    "created_utc": 1653813639.0,
                                    "response": "Credit cards charge interest. Debit cards don’t.\n\nBut both charge the merchants fees, which range depending on the volume they put through.\n\nPart of these fees are paid to banks and the networks which facilitate transactions. And it’s quite complicated, with fees flowing in multiple directions throughout the network.\n\nCard issuers end up with a piece of the pie. And some choose to offer rebates to customers to use them rather than a competitor.\n\nSo, if this is how your rebates arrive, all well and good.\n\nBut, this is crypto. And we know that so-called ‘staking’ income actually comes from unsecured lending to people who use the coins to short the currency and drive prices down. And, according to /u/liquid_at, some exchanges have it in their fine print that they can do this without additional permissions.\n\nIf that’s the funding model for this card, then run away, very very fast.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iafuco9",
                    "author": "not_into_that",
                    "score": 1,
                    "created_utc": 1653840113.0,
                    "response": "How is that 2% generated?",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}