{
    "subreddit": "Dogecoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "v06273",
            "title": "In light of another post here, let’s not forget what DOGE stands for",
            "url": "https://www.reddit.com/r/dogecoin/comments/v06273/in_light_of_another_post_here_lets_not_forget/",
            "author": "lemond4455",
            "created_utc": 1653809253.0,
            "score": 1,
            "num_comments": 0,
            "subreddit": "dogecoin",
            "selftext": "Dine On Grapes Everyday",
            "stickied": false,
            "comments": []
        },
        {
            "id": "v066e7",
            "title": "Tell me when to Doge doge doge doge doge doge doge doge",
            "url": "https://i.redd.it/z0o7coe4cd291.jpg",
            "author": "bUDZ1113",
            "created_utc": 1653809804.0,
            "score": 27,
            "num_comments": 12,
            "subreddit": "dogecoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "iaen7r0",
                    "author": "xXB0SSXx",
                    "score": 2,
                    "created_utc": 1653812935.0,
                    "response": "SnoopDoge to da moooooon with extra bacon 🥂🥓🥓🥓",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaetxaz",
                    "author": "Wammakko",
                    "score": 2,
                    "created_utc": 1653819016.0,
                    "response": "For your own sake, please do not ever create orders for market buys/sells. Always limit orders.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaevhg5",
                            "author": "xpatbrit",
                            "score": 2,
                            "created_utc": 1653820413.0,
                            "response": "Sometimes I want to buy doge right now. Change my mind.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iaf064v",
                                    "author": "Wammakko",
                                    "score": 3,
                                    "created_utc": 1653824250.0,
                                    "response": "In certain conditions you may end up with a bad trade when using market order due to slippage or difference in bid versus ask prices.\n\nLimit order ensures full control of the trade and you can still buy doge pretty much \"right now\" if you set your to current price to match or just slightly lower.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iaf91wd",
                                            "author": "xpatbrit",
                                            "score": 3,
                                            "created_utc": 1653829932.0,
                                            "response": "I missed by a few hundredths and wound up getting left behind on a couple of limits, other things to mind. I appreciate your time and thank you for the pointers. I just don't have the time to watch so closely when I get the itch. Usually I itch after lack of support lasts a couple days or more, and I catch it still struggling. Not the most scientific I know but really my patience with all of the specs runs out pretty fast and as a small bit player, it just doesn't hurt too bad. Over the term of my hold it will get washed away. Ive only sold twice, once to dump Robinhood (lucked into a dip when I got Coinbase sorted), then I pushed everything into Exodus. On research, I sold everything before we moved to Luxembourg, and I lucked into another even deeper dip when I bought back in once I had a Lux bank to load from. I limit bought a few times in the early days but since I got here, ive only bought twice at market. Ill hit a few more times as fast as I can just to get up to 20k. If levels hold close to here, ill be in at 20k level for less than my first 10k cost me. Not pumping and dumping or anything, just had to sell and got back in as soon as I could.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iafkez5",
                                                    "author": "Wammakko",
                                                    "score": 3,
                                                    "created_utc": 1653835641.0,
                                                    "response": "I think you can set your limit buy price higher than the current price, and then it would work like a market order, meaning your order starts filling at best available price and all the way up to, but not exceeding, the limit you set up.\n\n\nYou should also check with your broker whether they have different fees for market and limit orders. Limit orders may have lower fees.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iafmnjq",
                                                            "author": "xpatbrit",
                                                            "score": 2,
                                                            "created_utc": 1653836640.0,
                                                            "response": "I'm on Coinbase Pro, Ill take a look. Sounds like a legit way to ensure the best buy, ill weigh it against the rest of what I have going on. May come in handy as I get more gravity in crypto.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "iagys00",
                            "author": "bUDZ1113",
                            "score": 1,
                            "created_utc": 1653858889.0,
                            "response": "Thanks for the input appreciate that",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iag7u8n",
                    "author": "svjugs",
                    "score": 2,
                    "created_utc": 1653846149.0,
                    "response": "7 PM",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}