{
    "subreddit": "Dogecoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uthpm9",
            "title": "Can what happened to Terra Luna happen to Doge? If so, how likely?",
            "url": "https://www.reddit.com/r/dogecoin/comments/uthpm9/can_what_happened_to_terra_luna_happen_to_doge_if/",
            "author": "KepesiKepesi",
            "created_utc": 1653008434.0,
            "score": 0,
            "num_comments": 19,
            "subreddit": "dogecoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i99t299",
                    "author": "RobCali509",
                    "score": 7,
                    "created_utc": 1653008614.0,
                    "response": "No",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i99u2xz",
                    "author": "Zrateristhegamertag",
                    "score": 4,
                    "created_utc": 1653009112.0,
                    "response": "First off terra luna is a backing coin to the stable coin ust and second off it was backed by collaterals like bitcoin, avalanche and different fiat currency’s and when they tried to stabilize the coin by selling bitcoin to back the price it caused bitcoin to crash causing the crypto market to crash some also say it was an alleged attack but at the end of the day the pair\n ust/terra and doge are two different cryptocurrency’s with different technologies and purpose",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i99x8su",
                            "author": "Bigdaddy0769420",
                            "score": 4,
                            "created_utc": 1653010649.0,
                            "response": "Lmfao well that explains it. Figured it was related to the stock market plunging",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i99z2ee",
                                    "author": "Zrateristhegamertag",
                                    "score": 3,
                                    "created_utc": 1653011530.0,
                                    "response": "Actually it correlates to the stock market and the stock market correlates to the crypto market mostly due to the same demographic of investors but this time in particularly the stock market felt some consolidation due to the extreme level of fear felt in the crypto market although the stock market was coming down slowly after the crypto crash started it really dropped the stock market even lower now many companies with decent earnings reports are not moving in price",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i99zb7o",
                            "author": "KepesiKepesi",
                            "score": 3,
                            "created_utc": 1653011651.0,
                            "response": "Thank you! This helped me understand the scene more.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9a2k5r",
                                    "author": "Zrateristhegamertag",
                                    "score": 3,
                                    "created_utc": 1653013256.0,
                                    "response": "No problem I would still recommend just doing some research on a topic you are interested in even if it’s just the crypto market in general even a half hour a day could make you way more informed and open tons of plays you can make to profit from since I knew terra was one of the largest bitcoin holders as soon as I seen the ust stable coin start to de-peg I knew there was going to be a bitcoin sell off",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i99vpax",
                    "author": "CapivaraMan",
                    "score": 4,
                    "created_utc": 1653009903.0,
                    "response": "Man, you haven't done your homework.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i99td7x",
                    "author": "WiscoBids",
                    "score": 2,
                    "created_utc": 1653008759.0,
                    "response": "Oh no 🙈",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i99z105",
                    "author": "Jimbo4901",
                    "score": 2,
                    "created_utc": 1653011511.0,
                    "response": "![gif](giphy|3o7TKwmnDgQb5jemjK)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9a0rpb",
                    "author": "No_Possibility_1665",
                    "score": 2,
                    "created_utc": 1653012372.0,
                    "response": "No.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9a4x60",
                    "author": "Bullet_InUr_Head",
                    "score": 2,
                    "created_utc": 1653014434.0,
                    "response": "No because doge doesn’t mint based off UST stability or stable coin. \nDoge is fixed inflation and will decrease over time.\n\nLuna went on a hyper inflating rampage because it’s stable coin UST wasn’t so stable.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9a9o2c",
                    "author": "Jonalethelete",
                    "score": 2,
                    "created_utc": 1653016919.0,
                    "response": "Lol no\n\nThere is no algo for minting new doge in the trillions",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i99ufsj",
                    "author": "Thebrain3-5-0",
                    "score": 3,
                    "created_utc": 1653009285.0,
                    "response": "What are you talking about. With all due respect start with learning what happened to Luna. Then maybe brush up on what dogecoin is",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9a1qnr",
                    "author": "dogedeephouse",
                    "score": 1,
                    "created_utc": 1653012853.0,
                    "response": "NO likely NO Luna Doge to the Moon Shortly",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9aofj5",
                    "author": "Fulvio55",
                    "score": 1,
                    "created_utc": 1653026410.0,
                    "response": "#Yes and No.\n\nIt depends on what you mean by the question though.\n\nCan the exact same thing happen? No. Because as others have pointed out, the structure and mechanisms are completely different. We have nothing remotely like their model for price controls. Which, given the spectacular failure, is a very good thing.\n\nCan the price crash to near zero, or even zero with no chance of recovery? Absolutely yes. And there are two scenarios where this could happen.\n\nIn the mild case, people can simply decide en-masse that Doge is no longer worth being involved in, and all cash out simultaneously. With all sellers and no buyers, the price would tank all the way to fractions of a cent. And it would keep falling until someone decided it was time to buy. This happens, to a point, from time to time. It’s happening right now, in fact, thanks to global concerns.\n\nThe terminal case is another matter. Suppose the price did tank. To a point that the mining rewards became so worthless that there was no point mining. Then people would simply unplug their miners. Maybe sell them, maybe find some other coin to mine instead, maybe just put them in the cupboard. This HAS happened. In fact, it was the reason why Charlie Lee came up with AuxPoW to save us from a certain death. And the fact that our mining is now done by LTC pools goes a long way to making a repetition unlikely. But not impossible.\n\nIf the hashrate did drop off a cliff, we could reach a point where it was economically viable for someone to buy or rent enough hashpower to gain 51% of the total, and thereby the ability to rewrite the blockchain at will. They could literally spend coins then immediately steal them back. If this were to happen, it would completely destroy all trust. The price would plunge to zero and never recover. It would be the death of Dogecoin.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9b27zk",
                            "author": "Necessary-Pension224",
                            "score": 1,
                            "created_utc": 1653038057.0,
                            "response": "Sometimes i think u shouldn be honest😅\n\n+u/sodogetip 1 doge verify",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9b3bx3",
                                    "author": "Fulvio55",
                                    "score": 1,
                                    "created_utc": 1653038917.0,
                                    "response": "Sometimes I’d agree with you.\n\nBut then I look at the massive walls of disinformation all over pretty much everything, and I figure somebody has to put up a fight.\n\nIf not me, who? You? Him? Them? 🤷‍♂️",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "id": "uthdzr",
            "title": "Found a USB stick with dogecoin wallets..",
            "url": "https://www.reddit.com/r/dogecoin/comments/uthdzr/found_a_usb_stick_with_dogecoin_wallets/",
            "author": "DeusExRobotics",
            "created_utc": 1653007387.0,
            "score": 11,
            "num_comments": 28,
            "subreddit": "dogecoin",
            "selftext": "There's 8 folders all with folders inside. How do I load this?\n\nI've discovered my old files on a usb stick shoved far far into a filing cabinet.   \nIf I'm right, these are the files when I was a nerd and did nothing but mine crypto all day.   \nI just don't know how to load this?  \n\n\n&#x200B;\n\nFolder 1:\n\ndodge.wallet\n\nFolder 2 (name Dogecoin Core)  \nDogecoinCoreWallet.dat  \n\n\nFolder 3 Dogecoin Vault  \nkey-backup  \nrolling-backup  \nwallet-backup  \nwallet-unenc-backup\n\n&#x200B;\n\nFolder 4: Dogecoin Wallet\n\nFolder Dogecoin Core\n\ndoge.info\n\ndoge.wallet \n\nsparevault.info\n\nsparevault.wallet\n\n&#x200B;\n\nFolder 5\n\n[doge.info](https://doge.info)\n\ndoge.wallet\n\n&#x200B;\n\nFolder 6\n\ndoge-data contains\n\nkey-backup\n\nrolling-backup\n\nwallet-backup\n\nwallet-unenc-backup\n\n&#x200B;\n\nFolder 7 (sum more dogecoin)\n\nsparevualt-data\n\n&#x200B;\n\n&#x200B;\n\nFolder 8 (QuakiKoko)\n\ndoge (2).wallet\n\ndoge.info\n\ndoge.wallet",
            "stickied": false,
            "comments": [
                {
                    "id": "i99rz41",
                    "author": "MNReddit_Lurker2",
                    "score": 5,
                    "created_utc": 1653008069.0,
                    "response": "Download the core wallet. Go to your dogecoin folder in appdata under roaming. Insert the .Dat file in place of the one that exist, keep a copy as well. You may still need a password if it's encrypted, and it will need to sync before you can do anything",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9anl92",
                            "author": "Nickonashi69",
                            "score": 3,
                            "created_utc": 1653025778.0,
                            "response": "+u/sodogetip 1 doge verify",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9anyap",
                                    "author": "sodogetip",
                                    "score": 2,
                                    "created_utc": 1653026046.0,
                                    "response": "\n__^[wow ^so ^verify]__: ^/u/nickonashi69 ^-> ^/u/mnreddit_lurker2 ^__1.0__ ^__doge__ ^__($0.09)__ ^[[help]](https://sodogetip.xyz/)  ^[[transaction]](https://bitinfocharts.com/dogecoin/tx/d908d22f935e706c5251b1dc0e087efa9792ce347145528fcbbc9d8cdf8a1476)",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9a1ylj",
                            "author": "DeusExRobotics",
                            "score": 1,
                            "created_utc": 1653012962.0,
                            "response": "this makes perfect sense, BRB",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9a50ut",
                                    "author": "DeusExRobotics",
                                    "score": 1,
                                    "created_utc": 1653014485.0,
                                    "response": "is there any way to do this without syncing everything?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9a5jg9",
                                            "author": "Saxbonsai",
                                            "score": 1,
                                            "created_utc": 1653014743.0,
                                            "response": "It takes hard drive space, but if the wallet is old, it’s best to resync from the beginning.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9aq3qn",
                                                    "author": "Fulvio55",
                                                    "score": 2,
                                                    "created_utc": 1653027668.0,
                                                    "response": "Totally unnecessary. See my comment above. There is no need to sync at all to extract keys.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9atmsz",
                                                            "author": "Saxbonsai",
                                                            "score": 1,
                                                            "created_utc": 1653030512.0,
                                                            "response": "Yeah but to see the balance wouldn’t it be best to resync from scratch?",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9b2u14",
                                                                    "author": "Fulvio55",
                                                                    "score": 1,
                                                                    "created_utc": 1653038529.0,
                                                                    "response": "Just look up the wallets on bitinfocharts.\n\nApart from anything else, the blockchain never lies, even when clients do.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9aq2en",
                                            "author": "Fulvio55",
                                            "score": 1,
                                            "created_utc": 1653027640.0,
                                            "response": "See my reply above.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9aps5g",
                    "author": "Fulvio55",
                    "score": 5,
                    "created_utc": 1653027427.0,
                    "response": "You have two different types of files there.\n\nCore uses wallet.dat. MultiDoge uses .wallet files.\n\nAssuming Core contained most of your coins, you can recover pretty easily.\n\n1. Instal a fresh copy of the latest Core. Fire it up, let it build its files, then quit.\n2. Swap in a copy of your wallet.dat, replacing the new one.\n3. Fire it up again. There is no need to let it sync though.\n4. Go into the console and use the DUMPWALLET command to create a text file with all your wallets in it.\n5. Look at this text file. You will see at least a hundred wallets, in three groups. Named wallets are the ones you knew about. Change wallets are where any change was sent to when you spent coins. Reserve wallets are unused spares.\n6. Save this text file to a USB stick. Grab a copy of the coinb.in website and put that on the stick too. Make copies. Put them in safe places\n7. Throw away Core. You don’t need it at all, because you now have safe, secure, cold storage.\n\nNow, as to MD. I’m not the right guy to ask for details, but the process is sort of similar. Except that there’s a button that will export your keys. It gives two options, and you want the plaintext, not the encrypted one. Once you have wallets you can read, add them to the file you got from Core.\n\nRinse and repeat for any other data files. Most are likely backup copies, but you never know, so it’s worth checking. Of course you can delete any duplicates. Easiest way to do this is to make sure you’ve added a comment to any wallets that have coins in them (or which had coins but now have zero balances), then sort the file which will gather the duplicates together. You may need to play with formatting first though.\n\nOnce you’ve got your wallet masterfile, you can add any other wallets to it. Like for example your SoDogeTip wallet. Any wallets you’re currently using. Or a batch of new wallets to keep as spares. For example, you can export the new wallets from core back in step 1.\n\nWhy have all these wallets, I hear you ask? Because for privacy, security and auditability, you really want a separate wallet for each entity or purpose you interact with. And you never want to mix coins between them, because once linked in the blockchain, you can never unlink them.\n\nHope this helps.\n\nEdit: Forgot to say, search for ‘text wallet’ and have a read.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9aqcw7",
                            "author": "Nickonashi69",
                            "score": 1,
                            "created_utc": 1653027867.0,
                            "response": "+u/sodogetip 1 doge verify     Wake up bot! ;)",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9aqrqj",
                                    "author": "Fulvio55",
                                    "score": 2,
                                    "created_utc": 1653028192.0,
                                    "response": "Hahaha… that’ll do it, yeah. If not, go round and kick him in the goolies. 😜",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9arj4r",
                                            "author": "Nickonashi69",
                                            "score": 1,
                                            "created_utc": 1653028797.0,
                                            "response": "![gif](giphy|RN96CaqhRoRHk4DlLV|downsized)",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9b2rna",
                                                    "author": "Fulvio55",
                                                    "score": 2,
                                                    "created_utc": 1653038475.0,
                                                    "response": "Works for me. 👍😜",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9avduq",
                            "author": "DeusExRobotics",
                            "score": 1,
                            "created_utc": 1653032031.0,
                            "response": ">DUMPWALLET\n\nso..I downloaded core, installed it quit and found the files inC:\\\\Users\\\\PCNAME\\\\AppData\\\\Roaming\\\\DogecoinDeleted the wallet file, added one of the wallet.dat files and closed.\n\nReopened core, hid the syncing windowFound this ELI5 tut\n\n[https://www.reddit.com/r/dogecoin/comments/kuftro/eli5\\_dumping\\_your\\_wallet\\_from\\_dogecoin\\_core/](https://www.reddit.com/r/dogecoin/comments/kuftro/eli5_dumping_your_wallet_from_dogecoin_core/)\n\nUsing that opened the consol (help > debug window> console )\n\ntyped in\n\ndumpwallet dumpfolder1.txt  \n\n\nGot error\n\n>Cannot open wallet dump file (code -8)",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9b32xm",
                                    "author": "Fulvio55",
                                    "score": 1,
                                    "created_utc": 1653038725.0,
                                    "response": "There’s a gotcha for PCs especially. Sorry, I got lazy and stopped pointing it out every time.\n\nIt’s very picky about the destination. It wants the entire explicit path, and capitalisation matters. So C:, not c: for example.\n\nAlso, the file can’t already exist.\n\nHope this helps.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9c3b6j",
                                            "author": "DeusExRobotics",
                                            "score": 1,
                                            "created_utc": 1653058179.0,
                                            "response": "Ahh I see, should have been able to figure that out.   \nLooks like I also have to have \" \" marks around the path.   \n\n\nI've used \n\ndumpwallet \"C:\\\\Users\\\\NAME\\\\Desktop dumpfolder1.txt\"  \nand got \"empty response\" \n\nThis also created a .txt file on desktop\n\nDoes empty response mean no Dogecoins in wallet?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9em9j0",
                                                    "author": "Fulvio55",
                                                    "score": 1,
                                                    "created_utc": 1653099993.0,
                                                    "response": "I’ve never encountered that one before.\n\nUmmm…\n\nWhat’s in the file? And no, it has no idea what coins any wallet contains. All you’re doing is dumping the entire list of wallets to a file.\n\nHmmm….\n\nYou can go old school for a quickie check, but it’s much more tedious.\n\nBack before DUMPWALLET, the only option was to use DUMPPRIVKEY. Give it a wallet address and it will return the key in the console window. Then you need to copy paste both to a text file, rinse and repeat, and finally edit the file to clean up the structure into something more usable.\n\nYou could do this for a wallet you know has coins. But there is a limitation, in that you must know the addresses first. And of course you don’t know about the change wallets. That can be gotten around too, by turning on coin control and going to the send tab, but you must have at least one block loaded for every wallet that has coins in it, so it requires at least a partial sync.\n\nLike I said, messy, but it is a backstop.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9ankwf",
                    "author": "Nickonashi69",
                    "score": 1,
                    "created_utc": 1653025771.0,
                    "response": "+u/sodogetip 1 doge verify",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9aq10b",
                            "author": "Fulvio55",
                            "score": 1,
                            "created_utc": 1653027614.0,
                            "response": "Looks like the bot is asleep again. /u/just-an-dev did say there were some issues at the moment. 🤷‍♂️",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9b5xd0",
                    "author": "Cakee7837436",
                    "score": 1,
                    "created_utc": 1653040956.0,
                    "response": "I hope this work out good. :)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9b77iw",
                    "author": "And-Bee",
                    "score": 1,
                    "created_utc": 1653042003.0,
                    "response": "You can get a python script that extracts the private key from wallet files. It’s mega easy.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9cjjxa",
                            "author": "DeusExRobotics",
                            "score": 1,
                            "created_utc": 1653064600.0,
                            "response": "yeah but then I've gotta set up python!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9d6jeo",
                    "author": "Dogeahkiin69",
                    "score": 1,
                    "created_utc": 1653074592.0,
                    "response": "Update? How much was in it shibi?",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}