{
    "subreddit": "Dogecoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uutk3b",
            "title": "I don't get the whole \"no utility\" argument that keeps being said about dogecoin?",
            "url": "https://www.reddit.com/r/dogecoin/comments/uutk3b/i_dont_get_the_whole_no_utility_argument_that/",
            "author": "TheChristianAsian",
            "created_utc": 1653159432.0,
            "score": 19,
            "num_comments": 16,
            "subreddit": "dogecoin",
            "selftext": "Dogecoin already has many retailers that accept it from small business across the world that I think surpasses bitcoin cause it is cheap enough to be practical payment method rather than doing complicated math on how to divide a bitcoin many decimal places to try pay for a $5 dollar meal?",
            "stickied": false,
            "comments": [
                {
                    "id": "i9hcgte",
                    "author": "Jimbo4901",
                    "score": 5,
                    "created_utc": 1653160449.0,
                    "response": "Currency of earth.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9hao0k",
                    "author": "SideOneDummy",
                    "score": 6,
                    "created_utc": 1653159579.0,
                    "response": "Dogecoin has an actual utility, not just convenience. Dogecoin provides memes and whimsy and has the support of luddites that dgaf about blockchain technology. Power of the people!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ienzw",
                    "author": "terran7777",
                    "score": 2,
                    "created_utc": 1653180225.0,
                    "response": "2021 was the year of defi.  which brought us nfts, tokens, platform coins, interest, rewards, staking,, stabke coins, at a level like never seen before.  A ridiculous war of who has the highest number of utility buzzwords sprinkled throughout their white papers snowballed.    This generated massive numbers of shills and parrots all spouting nonsensical arguments and propaganda revolving around the idea who has the most utility.  Terra UST/Luna pair has one of the longest bullet point list of utilities I have personally seen.  RIP.  It won't be the last either.   A lot of fake utility will the sink to the bottom of the ocean. Platform coins too.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ig17o",
                    "author": "buttery_butterscotch",
                    "score": 2,
                    "created_utc": 1653180972.0,
                    "response": "Programmable tokens/blockchain. That's it. Nice features, but opens a can of worms. Doesn't beat good ol' widespread value recognition that dogecoin is targeting tho. The Terra/UST fiasco probably scared retail away from the scene now.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9il1is",
                    "author": "BlueGender1",
                    "score": 2,
                    "created_utc": 1653183657.0,
                    "response": "Dogecoin is future currency",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9hrt2o",
                    "author": "lucas63",
                    "score": 1,
                    "created_utc": 1653168069.0,
                    "response": "People say it has no utility because its only used for P2P transactions",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9hu1lv",
                            "author": "TheChristianAsian",
                            "score": 1,
                            "created_utc": 1653169230.0,
                            "response": "Elaborate? Isn't that the whole point of cryptocurrency to be a valid medium for transaction?\n\nDoes ethereum have a secret feature to wirelessly scrub my butthole after doodies im not aware of?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9hur7s",
                                    "author": "lucas63",
                                    "score": 2,
                                    "created_utc": 1653169598.0,
                                    "response": "Yeah its cool to be able to send stuff to and from other people. But Ethereum for example, can have apps and smart contracts built on it which just gives it more broader uses. There’s a whole ecosystem being built on Ethereum. Do some research on some of the decentralized apps on Ethereum to find out more",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9j7dnb",
                                            "author": "Oblato",
                                            "score": 1,
                                            "created_utc": 1653197397.0,
                                            "response": "My cousin told me ETH can only process transactions veeeery slowly",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9hwpbr",
                    "author": "FaceBillions24",
                    "score": 1,
                    "created_utc": 1653170603.0,
                    "response": "its the only argument uninformed people or people that are not in the doge space hear and think is true without doing any research so it keeps getting passed on. the time to be scared is when doge has NO NEGATIVE echochambers bc that means its no longer a threat",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9janxf",
                    "author": "rizzo49er",
                    "score": 1,
                    "created_utc": 1653200030.0,
                    "response": "It's lies that why",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}