{
    "subreddit": "Dogecoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uzrv9n",
            "title": "The new Twitter board.....",
            "url": "https://i.redd.it/yfjxhw3739291.jpg",
            "author": "rizzo49er",
            "created_utc": 1653758375.0,
            "score": 1,
            "num_comments": 0,
            "subreddit": "dogecoin",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "rp9f2o",
            "title": "Remember Elon saying DOGE is a hustle on SNL? Well it is. We got to hustle the good news. Has many good reasons to be hustled /shilled",
            "url": "https://www.reddit.com/r/dogecoin/comments/rp9f2o/remember_elon_saying_doge_is_a_hustle_on_snl_well/",
            "author": "RastaOZ",
            "created_utc": 1640563261.0,
            "score": 126,
            "num_comments": 53,
            "subreddit": "dogecoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "hq335l4",
                    "author": "o0joshua0o",
                    "score": 11,
                    "created_utc": 1640563935.0,
                    "response": "Technically it was Michael Che who said it's a hustle. Musk just laughed along.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hq33gd3",
                            "author": "Free_the_Planet66",
                            "score": 10,
                            "created_utc": 1640564074.0,
                            "response": "They set him up with that question!",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hq34dgf",
                                    "author": "RastaOZ",
                                    "score": 2,
                                    "created_utc": 1640564504.0,
                                    "response": "The irony lol. It truly is a hustle at this point. I see it as a positive note",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hq32brp",
                    "author": "QuarterDoge",
                    "score": 20,
                    "created_utc": 1640563554.0,
                    "response": "The entire fantasy concept of money in its entirety is just a hustle.    You think “money” exist?    It is entirely,  100% all in our heads.\n\n\nPeople jealously consumed with envy and hate.   Entirely over a make believe concept of religious teachings that hard work and dedication will earn you more debt.    (As in owning debt (power) vs owing debt (weakness/slavery)",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hq33ory",
                            "author": "RastaOZ",
                            "score": 9,
                            "created_utc": 1640564183.0,
                            "response": "The purpose of DOGE is to stimulate inflation and serve a positive impact with its utility .",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hq32n2v",
                            "author": "rb109544",
                            "score": 3,
                            "created_utc": 1640563699.0,
                            "response": "The stock market that everyone's retirement is based on...completely a hustle that is pure luck for the average joe",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hq32wlm",
                                    "author": "QuarterDoge",
                                    "score": 4,
                                    "created_utc": 1640563819.0,
                                    "response": "Speculation Market is a gamble.   The Debt market is power.    Owning Debt is Power.    The Fed doesn’t want to share power though.    They want it all to themselves.  \n\n\nHere is a dollar,  you might get 3 back in 5 years,  or nothing.    \n  \nOr Here is a dollar,  you will certainly get 1.5 back in 5 years.   \n\nWhich is better?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hq35kui",
                                            "author": "RastaOZ",
                                            "score": 2,
                                            "created_utc": 1640565067.0,
                                            "response": "Along the same lines. It’s best to be educated then to be scammed. This is the DOGE sub. Plenty to learn on the subject. Everything takes patience and dedication.  \n\n# pro DOGE btw",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hq35ud6",
                                                    "author": "QuarterDoge",
                                                    "score": 3,
                                                    "created_utc": 1640565193.0,
                                                    "response": "It’s the best Doge sub.     Nice mix of everything.   But r/dogeducation or r/dogecoindev is better for education.      r/dogelore is rapid fire memes,  some good,  most,  meh.       This sub represents the chaotic anarchy that is reality and the best of everything.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "hq36s33",
                                                            "author": "RastaOZ",
                                                            "score": 2,
                                                            "created_utc": 1640565634.0,
                                                            "response": "Lol I stick to this one for the most part . Since it has the actual full name. That’s cool there is more movement out there though lol  nice",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "hq3owit",
                            "author": "Dogekaliber",
                            "score": 2,
                            "created_utc": 1640574397.0,
                            "response": "![gif](giphy|XqZXG9Wdm020U)",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hq3cyi9",
                    "author": "non-spesifics",
                    "score": 5,
                    "created_utc": 1640568619.0,
                    "response": "Money as in fiat currency is a long con ponzi scheme. Money as in gold/bitcoin is a pyramid scheme. Dogecoin is a combination of both only better",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hq44nia",
                            "author": "RastaOZ",
                            "score": 2,
                            "created_utc": 1640582707.0,
                            "response": "![gif](giphy|qIXVd1RoKGqlO)\n\nYou got it!! That’s right",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hq3fb03",
                            "author": "carsongwalker",
                            "score": 1,
                            "created_utc": 1640569755.0,
                            "response": "Yeah? Gold/Bitcoin are pyramid schemes? I would LOVE to hear why that is, and how an infinite supply memecoin fixes these problems 😂",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hq3q8y1",
                                    "author": "non-spesifics",
                                    "score": 4,
                                    "created_utc": 1640575066.0,
                                    "response": "Ok hear me out🤣 Scarcity based assets will always end up owned/controlled by richest and largest nations, and they can never sustain an economy longterm. We have 5000 years of monetary history using the gold standard to attest to and especilly from 1800-1970s. Bitcoin is actually even worse because of its hard cap. Making it even more unusable as currency and unusable as standard for an economy because an economy grows. Like how people are born and die everyday but population keeps growing, new businesses rize/fall but wealth keeps growing, such is the way of the global economy. It will forever keep growing. Even worse than gold it will never be able to sustain and meet economical obligations. But it did introduce the decentralized concept of money and that is what the world trully needs. But it's not money, it's a speculative asset. Scarcity based assets are at its core pyramid schemes. \n\nNow money, Fiat currency, is a long con ponzi scheme as it follows the growth of the economy and sustain economical obligation. New money NEEDS to be pumped in. The main issue with it is that it's controlled by banks and governments. They choose to issue more or less $ whenever they want to and feel like it for whatever reason. \n\nNow here's where dogecoin comes in and accidentally hits the sweet spot. Unlimited supply is the wrong word. Limited/locked growth=dis-inflation is the correct term. Yes it will grow forever(so will the economy and population) but the main point is to have that growth limited and out of any 1 entity or a groups control because then it becomes unlimited supply pretty quickly. They can choose to issue as much as they want whenever they want. With a limited/locked supply growth the percentage inflation rate will forever be decreasing. So it's able to sustain economical growth/ obligations and be a better store of value. This supply growth fixes several things, people die/born everyday, supply is lost everyday, cost of mining goes down keeping mining from becoming centralized and anyone can mine, the more miners the better, fees are kept low and can go even lower, encourages spending giving it utility as currency and at the same time being an excellent store of value as the economy is bigger than any scarcity based asset. The currency should be the ultimate store of value. All of this in a layer 1 solution. \n\nI swear, listen to what elon says about dogecoin, the guy not only knows money he understands how it actually works. And it's ironic that a decentralized coin with a dog on it has this kind of setup.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hq3wetv",
                    "author": "PopSubstantial987",
                    "score": 3,
                    "created_utc": 1640578143.0,
                    "response": "That was in a context of a joke. Elon wants it to be a fast and reliable form of money transfer for all the Billions that are  un-banked via Starlink.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hq3r066",
                    "author": "Smackithackett",
                    "score": 2,
                    "created_utc": 1640575436.0,
                    "response": "Life’s  a hustle..  see ya",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hq3wh4p",
                    "author": "GlasnostBusters",
                    "score": 2,
                    "created_utc": 1640578176.0,
                    "response": "Isn't the most recent update on the dogecoin site that there is work being done with starlink nodes? This would be a feature no other currency in the world has to offer.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hq42u93",
                            "author": "RastaOZ",
                            "score": 1,
                            "created_utc": 1640581648.0,
                            "response": "Yes that is one notable addition  compared to many other cryptos. It is set to be real currency",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hq3elu3",
                    "author": "Eastern-Appeal-8747",
                    "score": 1,
                    "created_utc": 1640569418.0,
                    "response": "Who's gona get the last 😂",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hq44bgn",
                            "author": "RastaOZ",
                            "score": 1,
                            "created_utc": 1640582510.0,
                            "response": "It’s an ongoing cycle. With a beneficial flow. It’s about efficiency the price is an influx in time",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hq44n9j",
                                    "author": "Eastern-Appeal-8747",
                                    "score": 2,
                                    "created_utc": 1640582703.0,
                                    "response": "Good answer",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hq4lypz",
                    "author": "ConceptualWeeb",
                    "score": 1,
                    "created_utc": 1640595152.0,
                    "response": "I literally just unjoined this sub partially because of this post and comments. Smh. What happened to **ONLY DO GOOD EVERYDAY?**",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hq4vhs0",
                    "author": "One_Scratcho",
                    "score": 1,
                    "created_utc": 1640603219.0,
                    "response": "He was hustling, now look at him...",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hq54fcd",
                            "author": "RastaOZ",
                            "score": 2,
                            "created_utc": 1640609889.0,
                            "response": "Still hustlin?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hq56khx",
                                    "author": "One_Scratcho",
                                    "score": 2,
                                    "created_utc": 1640611237.0,
                                    "response": "Sure, he was maybe still  is top hustler of our planet",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hq57q6j",
                                            "author": "RastaOZ",
                                            "score": 2,
                                            "created_utc": 1640611942.0,
                                            "response": "Yeah he does for sure 👍",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hq54xyb",
                    "author": "DistinctEngineering2",
                    "score": 1,
                    "created_utc": 1640610222.0,
                    "response": "He was referring to crypto as a whole from my understanding?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hq57i8a",
                            "author": "RastaOZ",
                            "score": 1,
                            "created_utc": 1640611808.0,
                            "response": "I got to watch the show again I can’t confirm that part. I know they asked about DOGE for sure since it was the main subject",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}