{
    "subreddit": "Dogecoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uw3uou",
            "title": "Come Together as a Community.",
            "url": "https://www.reddit.com/r/dogecoin/comments/uw3uou/come_together_as_a_community/",
            "author": "Farscape1231",
            "created_utc": 1653322464.0,
            "score": 6,
            "num_comments": 23,
            "subreddit": "dogecoin",
            "selftext": "Intro:\nHey all, I'm fairly new to this community, Reddit, and the Crypto scene. So I apologize if this post comes off a bit  dumb.\n\n(Edit)\nRemoved Musk theory on currency since responses focused on Musk over ideas to improve Dogecoin.\n\nCommunity Value:\nI was pondering about the definition of value and what that is and how value happens ect. This led me on to how Dogecoin is widely known (nearly a household name now because of Musk and the get-rich-quick schemers trying to ride the gravy train.) And everyone has seen how decent sized coordinated communities are able to make impacts. So my question to this community is, how can this community go about making Dogecoin competitive and more valuable? \n\nA few interdependent points that I found on google:\n1. Increase demand.\n2. Be miner friendly, while the demand increases value to offset miner costs.\n3. Listed on more crypto exchanges. (Musk helped this out)\n4. Beating out competition. This is based of the community.\n5. Internal governance. The coin would need to strike a balance between stability and projects/upgrades.\n6. Regulation and legal. So this is regarding the SEC and the CFTC both claiming crypto belongs in there perspective areas. \n\nClosing: \nDogecoin is the coin of the people; people create value through supply and demand. So what are your thoughts?",
            "stickied": false,
            "comments": [
                {
                    "id": "i9pqdya",
                    "author": "Workingclassherois",
                    "score": 2,
                    "created_utc": 1653331344.0,
                    "response": "Crypto may very well be used on Mars. Being used in exchange between Mars and Earth would have to be handled slowly and differently because of the time lag. Maybe with deposit and withdrawals that take a few minutes. I’m sure Musk knows this and has his reasons for dampening the DOGE-Mars exchange idea. It doesn’t mean crypto, maybe even DOGE won’t be used “ON” Mars same as on Earth and near Earth orbit.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9p5n8b",
                    "author": "liquid_at",
                    "score": 2,
                    "created_utc": 1653322606.0,
                    "response": "The fun thing about musk-theories is that people who make them rarely listen to elon musk himself and just make up things.\n\nHe has already publicly declared that he does not think that doge will be the currency of mars because he understands that the limitation that is the speed of light would make it impossible for any blockchain to sync between earth and mars (40min delay is too much)\n\nSo if all the \"Musk will do\"-theorists would just start to watch actual interviews with their beloved musk instead of making up things, they might actually learn something.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9p8i67",
                            "author": "Agreeable-Apricot-36",
                            "score": 2,
                            "created_utc": 1653323793.0,
                            "response": "👌👌",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9poge7",
                            "author": "BeliusTheDemon",
                            "score": 1,
                            "created_utc": 1653330511.0,
                            "response": "But this does not rule out that quantum communication will not be able to do it, therefore we can't say it won't be possible at some point in the fairly near future.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9ppjjb",
                                    "author": "Farscape1231",
                                    "score": 1,
                                    "created_utc": 1653330979.0,
                                    "response": "Bingo. Entangled particles I believe... Anyways, what ideas do you have for improving dogecoin presently?",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9ppqps",
                                    "author": "liquid_at",
                                    "score": 1,
                                    "created_utc": 1653331066.0,
                                    "response": "We can say, that at the current point in time, at the current state of scientific discovery, it is not possible.\n\nUnless some way to overcome the limitations of space-time is found, there is no way. So far there hasn't even been a proposal for one.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9q6w76",
                                            "author": "shattypantsMcGee",
                                            "score": 1,
                                            "created_utc": 1653338435.0,
                                            "response": "You could do something similar to lightening.  Off chain resolution of transactions, that get updated on chain later.  I think there is a work around with current technology.  You’d just need to reconcile the Martian Ledger with the Earth Ledger periodically.\n\nI think Musk has plans for a different type of society on mars initially though.  One that may not need meaningful amounts of monetary transactions…",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9qaeqy",
                                                    "author": "liquid_at",
                                                    "score": 1,
                                                    "created_utc": 1653339970.0,
                                                    "response": "ok, let me specify further: \n\nThe current version of dogecoin, as it is written in the current code is not compatible to the current knowledge about our universe.\n\nIf any dramatic change to either of the two happens, the situation has to be reevaluated. There is no such change foreseeable in the near future. \n\n&#x200B;\n\nThere is no theory on the horizon that could change space-time and there are no fundamental changes planned to dogecoin. Given those, that's what it is. \n\nIf anything changes, we can talk again. Hypotheticals about the fundamental laws of physics being broken won't get anyone anywhere... other than theoretical physicists.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9qaom9",
                                                            "author": "shattypantsMcGee",
                                                            "score": 1,
                                                            "created_utc": 1653340094.0,
                                                            "response": "I’m with you.  Really, we should be focused on present immediate needs not theoretical Martian civilizations.  😉\n\nBesides, there isn’t sufficient supply of dogecoin imho for that much transactional volume.  Maybe we’re at 500bn doge by the time a Martian civilization exists.  That is barely enough for earth.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9qc36k",
                                                                    "author": "liquid_at",
                                                                    "score": 1,
                                                                    "created_utc": 1653340734.0,
                                                                    "response": "Imho, the only real solution would be 2 different blockchains on the 2 planets with a bridge for interplanetary transfers.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9p5nz1",
                    "author": "DoubleAd397",
                    "score": 1,
                    "created_utc": 1653322615.0,
                    "response": "Is the Doge coin in the room with you right now?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9p72qv",
                            "author": "Farscape1231",
                            "score": 2,
                            "created_utc": 1653323197.0,
                            "response": "Ya sure.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9p6ohh",
                    "author": "TheCrudBin",
                    "score": 1,
                    "created_utc": 1653323033.0,
                    "response": "Smokes pcp once",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9p7dlp",
                            "author": "Farscape1231",
                            "score": 2,
                            "created_utc": 1653323323.0,
                            "response": "LOL! Government Property, such as myself, is prohibited from your drugs sir.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9pkwcs",
                    "author": "Superr_Steve",
                    "score": 1,
                    "created_utc": 1653328991.0,
                    "response": "musk already said in an interview with lex that any crypto in its current form wouldnt be a good currency on mars because the latency would be too great.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9pn5jb",
                            "author": "Farscape1231",
                            "score": 1,
                            "created_utc": 1653329958.0,
                            "response": "It's ashame you and most others are only focusing on Musk here. The point was to encourage idea sharing for the community to help make Dogecoin more competitive. For instance, a group of people requesting that a retailer or fast food chain accepts a certain crypto currency as payment would increase use... \n\nNow to address everyone's comments about latency. How long would you suppose it might take to create a civilization on Mars? Probably not going to be fully realized in some of our lives? I can definitely tell you it isnt going to be tomorrow. So why would you consider current technology? Hmmm? \n\nAdditionally, I've worked with satellites and I'm familiar with them. So I can tell you right now, latency and data isn't an actual excuse... especially not in our near future.  Please research LCRD and TBIRD off of some government sites. Yes, those are all about gig and terabyte infrared laser satellite communications and there are more light to laser data communications coming. \n\nThanks for the post.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9pqcjw",
                                    "author": "Superr_Steve",
                                    "score": 1,
                                    "created_utc": 1653331328.0,
                                    "response": "You said your theory is that musk is considering dogecoin as a currency on mars and i am telling you that he has said the opposite.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9pscxw",
                                            "author": "Farscape1231",
                                            "score": 1,
                                            "created_utc": 1653332199.0,
                                            "response": "Does that mean the guy cannot say a thing, yet later do another? \nAny ways I appreciate the post. Was hoping more for discussion on dogecoin improvement over Musk and theories.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9pnrpm",
                    "author": "BeliusTheDemon",
                    "score": 1,
                    "created_utc": 1653330216.0,
                    "response": "Although Musk did state doge wouldn't be the currency on Mars, you could likely find something to convert it to, perhaps you will be able to trade it on earth directly for the Mars currency into a Mars based banking account.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9poyjl",
                            "author": "Farscape1231",
                            "score": 1,
                            "created_utc": 1653330729.0,
                            "response": "You're not wrong. Their are currently minutes in the delay of communications. That isn't necessarily going to remain an issue forever and may stop crypto from leave earth in the begining. It'll be interesting to see what happens over time. \nDo you think dogecoin and its remaining community are dead or dying? I'm starting to wonder if the community is more followers of Musk than the currency itself. I was trying to see how this currency could be improved really regardless of Musk and more via the community.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}