{
    "subreddit": "Dogecoin",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uq2qko",
            "title": "I'm down 65%",
            "url": "https://www.reddit.com/r/dogecoin/comments/uq2qko/im_down_65/",
            "author": "yonas852",
            "created_utc": 1652608280.0,
            "score": 0,
            "num_comments": 34,
            "subreddit": "dogecoin",
            "selftext": "I am sick and tired of holding the bag, I've been DCA for the entire time, and it keeps dipping, and dipping. IDK what to do, it seems, it's not gonna get better, because of the whole macro situation.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8p0icq",
                    "author": "GretaTheJetta",
                    "score": 3,
                    "created_utc": 1652622007.0,
                    "response": "More bearish and hopeless posts = bullish",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8qjgct",
                            "author": "waterboy69_",
                            "score": 2,
                            "created_utc": 1652646551.0,
                            "response": "😂😂😂😂",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8ontqe",
                    "author": "dogeimistic",
                    "score": 12,
                    "created_utc": 1652614380.0,
                    "response": "Literally no point selling at a 65% loss, I'd rather hodl and hope in the next 10 years I get my investment back or lose every penny instead of giving 65% of my money away to someone playing the markets.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8prwz6",
                            "author": "MC_Dub",
                            "score": 0,
                            "created_utc": 1652634413.0,
                            "response": "you know nothing about his financial situation.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8oj83v",
                    "author": "MNReddit_Lurker2",
                    "score": 4,
                    "created_utc": 1652610739.0,
                    "response": "This is crypto though, and still a fairly small one at that even as one of the largest in the space. Being down 50% + was always likely to happen if you got in during an uptrend. This is a long game, most assets themselves still in their early stages. If you don't believe doge will stick around it is what it is",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8owq5w",
                    "author": "NickySoftshoes",
                    "score": 2,
                    "created_utc": 1652619957.0,
                    "response": "Let the current news on DOGE play out before selling at least.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8q8hvh",
                    "author": "No_Patience2428",
                    "score": 2,
                    "created_utc": 1652641680.0,
                    "response": "Hey OP. I understand your frustration in a way. Bought at .0035 and have been holding ever since. I could have made a 100k profit at peak, but held. I held because I really do think in 10 years it can be worth 3-10 dollars per Doge. Not that the price matters (1 Doge = 1 Doge). Point is crypto is still an early speculation. Hodl or don’t hodl, the choice is yours!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8oggfu",
                    "author": "prenebean",
                    "score": 3,
                    "created_utc": 1652608358.0,
                    "response": "Dcaing right there with you, 1doge = 1doge and the dollar is dirty 🤮",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8oghgv",
                    "author": "prenebean",
                    "score": 2,
                    "created_utc": 1652608383.0,
                    "response": "More coins too, can’t complain about that",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8oqh76",
                    "author": "Scrooge27x27x27",
                    "score": 3,
                    "created_utc": 1652616187.0,
                    "response": "Buy more and average cost down",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8p7n7q",
                            "author": "Available_Plenty_143",
                            "score": 2,
                            "created_utc": 1652625463.0,
                            "response": "People who have been doing that, have just been losing more and more money. Horrible advice.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8pstwr",
                                    "author": "AdorablePound2",
                                    "score": 2,
                                    "created_utc": 1652634813.0,
                                    "response": "It's actually a very good strategy depending on your situation. If it's something you think will be around for years to come, you don't need the money from the investment for a while, and you believe it will be successful, then it's a great idea to average down. You're not losing money until you sell, and by averaging down your lowering your break even point. Again, not for everyone, and you need to do DD, but it's not 'horrible advice'.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8pv0li",
                                            "author": "Available_Plenty_143",
                                            "score": 2,
                                            "created_utc": 1652635757.0,
                                            "response": "Also the term “not losing money until you sell” is toxic. You also haven’t made any money. You might technically not have lost any money, but you’re net worth has shrunk.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8q7cu4",
                                                    "author": "AdorablePound2",
                                                    "score": 1,
                                                    "created_utc": 1652641174.0,
                                                    "response": "Toxic.... Smh. Maybe you would be better off keeping your money instead of investing. You seem either incapable or unwilling to learn and understand a very basic investing strategy as well as learning that not all strategies fit everyone's financial situation.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8q832o",
                                                            "author": "Available_Plenty_143",
                                                            "score": 0,
                                                            "created_utc": 1652641498.0,
                                                            "response": "Talk to any financial professionals and they’ll tell you that averaging down is a not legitimate strategy. You didn’t address anything I said especially where averaging down any point since last year would have left you in a worse position.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8q93ow",
                                                                    "author": "AdorablePound2",
                                                                    "score": 1,
                                                                    "created_utc": 1652641953.0,
                                                                    "response": "If you read what I posted I actually did address everything. \n\n1. Not for everyone depending on their financial situation\n\n2. Have not lost money until you sell. \n\n3. Don't average down based on some random price someone told you to online. Do your own DD\n\n4. Averaging down puts you in a better position as outlined in my example. \n\nIt's honestly like talking to a brick wall and I'm done. I'm just trying to help you and explain that averaging down is a good idea sometime but not always. You are instant on arguing it's always a 'horrible idea' which is just plain wrong and I've told you why it can be a good idea. Good luck on your future investments.....",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i8qa1hc",
                                                                            "author": "Available_Plenty_143",
                                                                            "score": 1,
                                                                            "created_utc": 1652642373.0,
                                                                            "response": "Averaging down is such a good idea that you can’t show me just one instance where it paid off since the Doge community started talking about averaging down. I’m just to understand if it’s a good idea sometimes. Show me it paying of them. You can’t. End of discussion lol",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i8qcf88",
                                                                                    "author": "AdorablePound2",
                                                                                    "score": 1,
                                                                                    "created_utc": 1652643439.0,
                                                                                    "response": "Again, stop comparing this to doge. I never specifically isolated doge in this conversation. I said decide if the investment is worth it to average down a stock verses putting it in another investment. \n\nOk, I'll show you can example. I bought EFL at $1.26 8 months ago. Looking at the financials for the company I thought they had a ways to go but they have a good product. As such I did a smaller investment. Over the next two months I watched the stock fall to high 90's then bounce right back up to my break even point. Sometimes going just higher but not high enough to make selling worth it. I then started averaging down to 0.90. The price bounced up and I sold it at 1.09 and made a good profit on it. I sold it at that point because the financials weren't supporting the current price and I felt it would soon fall (which it did).\n\nHad I not started averaging down I would have lost money but because I averaged down I made profit. I'm NOT saying to average down on Doge and have never said or argued that. I'm saying don't say averaging down doesn't work because it can depending on the investment but you have to do your own DD to see if a stock or crypto is worth it. \n\nLike I said. Best of luck.....",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i8pur61",
                                            "author": "Available_Plenty_143",
                                            "score": 0,
                                            "created_utc": 1652635643.0,
                                            "response": "When Doge crashed to .50, you guys said average down. When it hit .30, you guys said average down. When it hit .15, you guys said it’s the perfect time to average down. At any point, you would have lost money trying to average down. If at any point you would have lost money, it’s horrible advice. You would have been off just keeping cash.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8ojm95",
                    "author": "FulcrumPhase",
                    "score": 1,
                    "created_utc": 1652611071.0,
                    "response": "I bought at the top  everybody feel sorry for me lol   if you don't sell at a loss why are you even here ;)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ohjlq",
                    "author": "NoWaltz6374",
                    "score": 1,
                    "created_utc": 1652609297.0,
                    "response": "That why i always recomend starting slow when you invest.  Buy intervals spread around a period of a year at least.  Specially when you decided to buy coins after they broken the ath.  I personally dont touch coins that broken its all time high untill months after. Like doge. I saw it go all the way up to .70. I started buying in intervals after it reach bellow .15 cents.  Still have money left to buy more dips",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8oisxx",
                    "author": "DogeGod_Ricky-C",
                    "score": 1,
                    "created_utc": 1652610385.0,
                    "response": "Join the club",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8oopfm",
                    "author": "DeathCoreGuitar",
                    "score": 1,
                    "created_utc": 1652615006.0,
                    "response": "I feel you, i'm down the same %, but i stopped checking every day, i buy \"dips\" with mining money to reduce average and just waiting not hoping too much",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8owr2a",
                    "author": "SilverSt0ner",
                    "score": 1,
                    "created_utc": 1652619971.0,
                    "response": "Maybe try buying something else? Averaging down only helps out when the asset is actually expected to return to ath.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8p0881",
                    "author": "Darth_Laidher",
                    "score": 1,
                    "created_utc": 1652621859.0,
                    "response": "Just spend more time working on eating spinnage and training them arm muscles, helps when LTBH. :)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8peq35",
                    "author": "Fasterthanyounow",
                    "score": 1,
                    "created_utc": 1652628687.0,
                    "response": "The idea is to buy low and sell high.  That ship has set sail.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8pfjmd",
                    "author": "Long-Secret5284",
                    "score": 1,
                    "created_utc": 1652629056.0,
                    "response": "+u/sodogetip 1 doge verify",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8pj64c",
                    "author": "HighlyIlliquid",
                    "score": 1,
                    "created_utc": 1652630648.0,
                    "response": "Maybe you should reassess whether DOGE is a viable investment worth “DCAing” into. 🤣💀🤣💀",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8q3yoy",
                    "author": "DonRuben92",
                    "score": 1,
                    "created_utc": 1652639673.0,
                    "response": "Why DCA if you just plan on selling for a loss? Unless you need the money to help your current financial situation, I wouldn’t sell. I would just stop investing if you don’t feel comfortable. Just remember that if you DCA, many consider it a long term investing strategy, not a way to get rich quickly.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8qch8d",
                    "author": "DeadlyViperSquad",
                    "score": 1,
                    "created_utc": 1652643464.0,
                    "response": "wojak",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8qijqz",
                    "author": "ElectricalIons",
                    "score": 1,
                    "created_utc": 1652646150.0,
                    "response": "I'm choosing to Hodl and average down, but my strategy is entirely geared towards the long term. I believe it will get better, this has just been a wild year in general with interest rate hikes, the invasion of Ukraine, etc. Just don't put more in than you can afford/are willing to lose.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}