{
    "subreddit": "Dogecoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uurq2w",
            "title": "All my Doge is officially on my cold storage!",
            "url": "https://www.reddit.com/r/dogecoin/comments/uurq2w/all_my_doge_is_officially_on_my_cold_storage/",
            "author": "OtherDetective",
            "created_utc": 1653153839.0,
            "score": 49,
            "num_comments": 20,
            "subreddit": "dogecoin",
            "selftext": "I hold about 40,000 Doge and now it’s officially all on my cold storage. Do the same! Not your keys, not your coins.\n\nThis community is beautiful.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9h28zd",
                    "author": "myironcity",
                    "score": 4,
                    "created_utc": 1653155555.0,
                    "response": "![gif](giphy|11sG4llQDAipGw)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9h657g",
                    "author": "Extremely-Bad-Idea",
                    "score": 4,
                    "created_utc": 1653157385.0,
                    "response": "Congratulations.  You are now officially a long term hodler.\n\nJust don't let your hard wallet fall into your dog's food dish.  You don't want to be the guy saying, \"My dog ate my Dogecoins\"",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9hetua",
                    "author": "Fulvio55",
                    "score": 4,
                    "created_utc": 1653161606.0,
                    "response": "Hopefully you have several copies of your wallet masterfile on media stored in separate secure locations so one disaster won’t wipe them all out. Because climate change isn’t going away anytime soon and it’s only gonna get worse.\n\nAnd I hope your coins are split between multiple wallets.\n\nAlso, never tell the whole world about your personal finances. Imagine if you published the fact you had 40,000 BTC back in the day. Just think how many random criminals and government people would be hunting for you to take it away now.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9nrmpl",
                            "author": "SaMuVII",
                            "score": 1,
                            "created_utc": 1653292340.0,
                            "response": "why should they be split into multiple wallets?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9o01yk",
                                    "author": "Fulvio55",
                                    "score": 1,
                                    "created_utc": 1653300150.0,
                                    "response": "It basically boils down to three reasons.\n\n1. Privacy\n2. Security\n3. Auditability\n\nThe blockchain is forever. Everything you do can be traced both backwards and forwards. And despite the belief people have about anonymity, it’s only pseudonymous. Once you expose a wallet as being yours, it is permanently identified as such.\n\nClients will happily mix coins from multiple wallets when they’re choosing which UTXOs to spend. Likewise, when they send change to new wallets, that is also visible in the blockchain.\n\nThis cross linking vastly reduces privacy. Over time, all your coins can be identified unless you take steps to avoid that.\n\nPlus, try looking at a wallet and figure out what those coins you spent six years ago was for. It can be a hugely onerous task.\n\nSo, if you allocate a single wallet to each entity or purpose you interact with, you limit exposure to that one wallet. If you tip me now, you will see the transaction published by the tipbot. In there you will see my tipbot wallet. You will also see every tip I’ve made, and also every withdrawal and deposit. But guess what? If you track those external transactions, you will find they all had a single counterparty. My text wallet allocated to sodogetip. I also have another such wallet allocated to the now defunct dogetipbot, but nothing to link the two together.\n\nAnd as for security, if a key is compromised, all the coins in that wallet are at risk. So let’s say you carry coins around on a phone so you can spend them or show people how Doge works. If someone steals your phone, you’ve lost your coins. But if you have a wallet specifically allocated for that purpose, then the rest of your coins are safe in their own, separate wallets. In my case, I have a wallet in Notes on my iPhone, and it has about ten bucks in it. If I lose it, big deal. And since I have a copy of the wallet in my masterfile, I stand an even chance of rescuing my coins before they can be stolen anyway.\n\nMake sense?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9o0w6v",
                                            "author": "SaMuVII",
                                            "score": 1,
                                            "created_utc": 1653300883.0,
                                            "response": "yes, however, I think it would be enough to have a few wallets, a couple for daily transactions and one important as a \"bank\". having multiple wallets increases the risk of losing backups. However, the \"bank\" wallet must have more physical backups, in order to be able to reach it unexpectedly in many ways, dividing one's doge into many \"banking\" wallets I think becomes risky.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9h05ey",
                    "author": "ElonaMusk212",
                    "score": 3,
                    "created_utc": 1653154596.0,
                    "response": "YES!!!!\n\nThis is how we do it!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ixeww",
                    "author": "CartridgeGaming",
                    "score": 3,
                    "created_utc": 1653190543.0,
                    "response": "Every single cold stored Dogecoin is important.\n\nAnother 40k Dogecoins rescued from the exchange void.  \n\nProud of you Doge Army!\n\n![gif](giphy|pynZagVcYxVUk)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9j8cla",
                    "author": "purpleefilthh",
                    "score": 3,
                    "created_utc": 1653198149.0,
                    "response": "That's not true.\n\n\\+/u/sodogetip 5 doge verify",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9h4s25",
                    "author": "shanr1225",
                    "score": 2,
                    "created_utc": 1653156735.0,
                    "response": "🥰🥰",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9i4gul",
                    "author": "ApricotAcrobatic7761",
                    "score": 2,
                    "created_utc": 1653174656.0,
                    "response": "Congrats OP! I hold my Doge on Guarda wallet. No hardware storage available in my country to pair it with (Ledger Nano S can be paired with it) but using Guarda also allows to own my private keys and keep them away from nosy third parties. \nHopefully I'll get to have one cold storage someday, too!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9jeneh",
                    "author": "jvsephii",
                    "score": 2,
                    "created_utc": 1653203416.0,
                    "response": "Hodling all of mine on Guarda wallet for ages.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9he70v",
                    "author": "OrangeHODLr",
                    "score": 1,
                    "created_utc": 1653161294.0,
                    "response": "Yasss! Congratulations sovereign!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9i4in5",
                    "author": "I-Know-What-To-Do",
                    "score": 1,
                    "created_utc": 1653174682.0,
                    "response": "Now give me that wallet and seeds. You've got nothing to worry about.\n\n![gif](emote|free_emotes_pack|wink)",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ipo5w",
                            "author": "OtherDetective",
                            "score": 1,
                            "created_utc": 1653186172.0,
                            "response": "🥸",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}