{
    "subreddit": "Dogecoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uuex5l",
            "title": "Remove your Dogecoins from the exchanges, this will keep the shorts away from manipulating and keeping the price down",
            "url": "https://www.reddit.com/r/dogecoin/comments/uuex5l/remove_your_dogecoins_from_the_exchanges_this/",
            "author": "SpiritLeading9926",
            "created_utc": 1653104696.0,
            "score": 44,
            "num_comments": 43,
            "subreddit": "dogecoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9ewuwc",
                    "author": "Taronyu019",
                    "score": 8,
                    "created_utc": 1653105934.0,
                    "response": "The fastest way to get to the moon and beyond is by moving our coin to a wallet away from the exchange. Also, more the network is active the easier it will be for more acceptance so small tips, purchasing merchandise, donation and anything that will keep the network active is good. \n\nRegarding wallets, for me the best wallet to store your hard earn coin is in a hardware wallet; you can store your coin in your wallet of preference but [hot wallets are an issue](https://www.zdnet.com/finance/blockchain/malware-is-targeting-crypto-wallets-says-microsoft-heres-how-to-protect-yourself-better/). You can read about it in the link provided.\n\nLet's get to the moon faster and happy trails.\n\nWe are a Doge Nation and we do only good.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9gld32",
                            "author": "puprandom",
                            "score": 1,
                            "created_utc": 1653147846.0,
                            "response": "Hi, I’m new to the crypto world and learning. How does one go about that?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9gsyws",
                                    "author": "Taronyu019",
                                    "score": 3,
                                    "created_utc": 1653151331.0,
                                    "response": "If you some information regarding your question, you can look for David Mitchell Jr in youtube. I don't provide a link because I've accuse by the haters to push nonsense.\n\nWe are a Doge Nation and we do only good.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9f0c90",
                    "author": "SpiritLeading9926",
                    "score": 6,
                    "created_utc": 1653108202.0,
                    "response": "Guys, follow David Mitchell, he explains it better than I do on how shorts work\n\nhttps://youtu.be/DlQJtzJhpA0",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9gh6bm",
                            "author": "Ike_Huminspurts",
                            "score": 1,
                            "created_utc": 1653145905.0,
                            "response": "I'm no jeanus. But shorts just cover less of your legs than pants. Correct?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9f2jse",
                    "author": "IcyLingonberry5007",
                    "score": 6,
                    "created_utc": 1653109751.0,
                    "response": "Not your keys.. Not your crypto.. Exchanges can and will use your crypto..",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ev2j8",
                    "author": "hyenatoots",
                    "score": 4,
                    "created_utc": 1653104854.0,
                    "response": "Probably sound advice in general.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9g51ln",
                    "author": "Vinny_DelVecchio",
                    "score": 3,
                    "created_utc": 1653140038.0,
                    "response": "Transfers initiated... only 3,664 Doge left to go...(daily transfer limits)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9eysvi",
                    "author": "bigbodyboy90",
                    "score": 2,
                    "created_utc": 1653107179.0,
                    "response": "I have 50k doge coins on RH I been holding for a year. I’d like to do this but I need a little direction. Not sure exactly how wallets work an what wallets are secure. Nervous to send them anywhere an make some kind of mistake that screws me over. Can you elaborate on a safe way to go about this process? I see that Robinhood allows the transfers now, but I have not set it up yet. I’d appreciate any advice",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9f29ea",
                            "author": "IcyLingonberry5007",
                            "score": 4,
                            "created_utc": 1653109544.0,
                            "response": "Test transfer just a few at first to make sure you are comfortable in what you are doing.. Its easy once you adjust.. Pretty much just copying and pasting your wallet address or using a QR method when available.. Remember always keep a secure copy of your seed phrase.. Absolutely crucial",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9f2q4o",
                                    "author": "bigbodyboy90",
                                    "score": 3,
                                    "created_utc": 1653109881.0,
                                    "response": "Don’t know why I didn’t think of that as an option. Little test transfer. I feel dumb now haha. Thank you!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9f0g9v",
                            "author": "SpiritLeading9926",
                            "score": 3,
                            "created_utc": 1653108278.0,
                            "response": "I recommend you to follow David Mitchell on YouTube, I believe he has a video on how to do this step by step",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9f3knm",
                                    "author": "IcyLingonberry5007",
                                    "score": 1,
                                    "created_utc": 1653110464.0,
                                    "response": "Check out yieldly the ASA version on the algorand block chain.. Its like buying doge in 2018.. Cheap and you can stake it.. Max supply 10b.. Its under a lot of inflationary pressure atm but i think.. Hope anyways.. It survives.. Plus of course the general market is probably going to keep us down for a bit.. Its worth checking out some of the smaller tokens on different chains sometimes.. Just can't jump in though with all the rug pulls out there..",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9g4vsf",
                            "author": "Vinny_DelVecchio",
                            "score": 2,
                            "created_utc": 1653139951.0,
                            "response": "Im getting  a \"cold wallet\" (removes from internet completely, stored on a USB drive that should only connected during a transaction  then unplugged; the most safe), but for a quick way off RH, I got trust wallet app.  Setup multifactor authentication (like Microsoft authenticator) and transfer.  Can transfer from here to cold wallet once it's in my hands.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9gedzg",
                                    "author": "Fulvio55",
                                    "score": 1,
                                    "created_utc": 1653144626.0,
                                    "response": "Getting?\n\nYou can have thousands of text wallets in seconds. For free. And they’re the most secure cold storage you can get.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9evrev",
                    "author": "jojodmilkman",
                    "score": 1,
                    "created_utc": 1653105273.0,
                    "response": "I heard coinbase doesn’t short with any coin. Is this true?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ew17h",
                            "author": "SpiritLeading9926",
                            "score": 3,
                            "created_utc": 1653105436.0,
                            "response": "False, all exchanges do it….especially Coinbase….I got out of coinbase as soon as I found out they will keep your money and coins in case they go bankrupt",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9exfxp",
                                    "author": "jojodmilkman",
                                    "score": 1,
                                    "created_utc": 1653106304.0,
                                    "response": "They do?!?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9fxczj",
                            "author": "liquid_at",
                            "score": 4,
                            "created_utc": 1653135519.0,
                            "response": "yeah... exchanges don't short. They lend out to shorters who short. The exchange just takes the fee from the shorters. \n\nCommon rate for Doge was 5% paid by the borrower, 3% kept by the exchange and 2% paid to the owner... \n\nOr, if they lend it out without the users approval, 5% paid by the borrower, 5% kept by the exchange.\n\nIt's essentially free money for them. They don't care what happens to the price. They don't care if the short-position is profitable for them or not. They just get their fees.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9g5oul",
                                    "author": "jojodmilkman",
                                    "score": 1,
                                    "created_utc": 1653140380.0,
                                    "response": "Where is link to this source/discovery",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9g63kh",
                                            "author": "liquid_at",
                                            "score": 3,
                                            "created_utc": 1653140589.0,
                                            "response": "the internet.\n\nJust go to various sites that offer \"liquidity providing\" and check their rates.\n\nlook up what the terms they advertise with mean... they tell you what they do. People just don't read it...\n\nAll it takes is listening to what the exchanges admit to. Not really any sources needed for that... Unlike for the claim that exchanges actively use your coins themselves to short, which is something they all actively deny and that would require proof on your side to be taken seriously.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9h0qii",
                            "author": "4w0k3",
                            "score": 1,
                            "created_utc": 1653154861.0,
                            "response": "I use three exchanges to buy my crypto, Coinbase being one of them. But as soon as I receive the email telling me that I’m free to use or move that purchased crypto I immediately pull it out and into Kepler. (Nano S)",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9exn3f",
                    "author": "White_Buffalo_307",
                    "score": 1,
                    "created_utc": 1653106433.0,
                    "response": "How do they short it?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9exvil",
                            "author": "SpiritLeading9926",
                            "score": 4,
                            "created_utc": 1653106583.0,
                            "response": "By lending your coins to people and institutions who leverage",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9ey272",
                                    "author": "White_Buffalo_307",
                                    "score": 1,
                                    "created_utc": 1653106703.0,
                                    "response": "Forgive my ignorance but how do they lend my coins? And how does it drive the price down?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9ez9ds",
                                            "author": "SpiritLeading9926",
                                            "score": 4,
                                            "created_utc": 1653107485.0,
                                            "response": "They lend your coins expecting the profits made to be greater than the interest payable.  They create fake sell orders (because it’s not theirs) bringing the price down creating a downward pressure and they making money off your coins….not sure if that makes sense…you can research how leverage works",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9f1pl0",
                                                    "author": "White_Buffalo_307",
                                                    "score": 2,
                                                    "created_utc": 1653109167.0,
                                                    "response": "It's a good start thanks",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9fx7k7",
                                            "author": "liquid_at",
                                            "score": 3,
                                            "created_utc": 1653135417.0,
                                            "response": "Most basic is just lending out your coins to someone who sells them. They then owe coins, but hope that they get to buy them back at a lower price to make a profit.\n\nBut there are also derivatives that you can buy that need those coins to hedge the risk. So if you buy a -1x token for a coin, that token will borrow a coin from a lender and when you sell that -1x token back, they will return it. The money you use to pay for the token is your security here. \n\nThe markets do not care if you bought or borrowed a coin. A sale is a sale. \n\nThe more lent out coins there are, the more sales can happen that dump the price down. They have to buy it back eventually, but temporarily that dumps the price.\n\nFewer coins lent out = less dumping and shorter time for each short-position. More coins lent out = shorters can do whatever they want because there is enough supply.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9fkvei",
                    "author": "Biscotti_Pleasant",
                    "score": 1,
                    "created_utc": 1653125403.0,
                    "response": "Not the same DRS bs here, time to leave, the rats already got their island.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9fwrs6",
                            "author": "liquid_at",
                            "score": 3,
                            "created_utc": 1653135128.0,
                            "response": "If you do not understand the difference between stocks and crypto, it might be time for you to leave, yes.\n\nTreating crypto like stocks is a fools errant and you'll only hurt yourself. Learn the difference and then look into crypto again.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9fytcs",
                                    "author": "Biscotti_Pleasant",
                                    "score": 0,
                                    "created_utc": 1653136458.0,
                                    "response": "Thanks for your friendly and helpful advice.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9ftgtg",
                    "author": "tall-not-small",
                    "score": 1,
                    "created_utc": 1653132818.0,
                    "response": "If you honestly think that's the main reason prices are down, then you are in for a big surprise",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9fwph2",
                            "author": "liquid_at",
                            "score": 3,
                            "created_utc": 1653135086.0,
                            "response": "Not the main reason prices are down but adding to the pressure.\n\nThe fewer coins there are available for shorting, the fewer short-positions are opened and the better doge can resist market-moves.\n\nIf you honestly think there is anything in the world that is just based on one single factor and nothing else, you're oversimplifying the world by a lot... It's hundreds of factors and the existence of other factors is never a reason not to improve on the one you can improve on.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9h1d8i",
                                    "author": "4w0k3",
                                    "score": 3,
                                    "created_utc": 1653155149.0,
                                    "response": "Very well said!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9gf08m",
                    "author": "Fulvio55",
                    "score": 1,
                    "created_utc": 1653144910.0,
                    "response": "#Is this bullsh!t STILL doing the rounds? Seriously?\n\nExchanges don’t lend out your coins without your knowledge. You have to opt in, usually by accepting ‘interest’ on your coins. Sometimes simply by not reading the fine print.\n\nAnd if you choose to feed the shorters, well, that’s on you, innit?\n\nNeedlessly scaring people with misinformation is not helpful. By all means tell people to get their coins off exchanges because exchanges can collapse and your coins are only safe in your own wallets. But if you spread lies, that’s not doing anyone any favours.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}