{
    "subreddit": "Dogecoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uqnluv",
            "title": "cold wallet information",
            "url": "https://www.reddit.com/r/dogecoin/comments/uqnluv/cold_wallet_information/",
            "author": "Cbuzo86",
            "created_utc": 1652675315.0,
            "score": 3,
            "num_comments": 10,
            "subreddit": "dogecoin",
            "selftext": "I've been in the crypto community for a little over a year now and I've seen posts here and there regarding cold wallets. I've done some research and from what I've seen, its just an external hard drive that you are able to store your crypto on. I still feel confused as to how the whole process works. Any information would be greatly appreciated. Thanks.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8s7mte",
                    "author": "Direct_Difficulty610",
                    "score": 3,
                    "created_utc": 1652675769.0,
                    "response": "Order a “Ledger Nano X”  or S from ledger.com. Do not order from Amazon or other retailers - get it from the manufacturer. Send your coins save the 24 word phrase. Wait.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8s824z",
                            "author": "Cbuzo86",
                            "score": 2,
                            "created_utc": 1652676035.0,
                            "response": "I saw that brand in a few articles. Thank you for your time.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8sbi1t",
                                    "author": "5afie",
                                    "score": 2,
                                    "created_utc": 1652678252.0,
                                    "response": "I have a Ledger Nano also really simple and I think great way to store crypto but hold it in your own hands like a PM and not have it stored elsewhere.   Buy crypto send to or from your device.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8sgzo2",
                            "author": "Fulvio55",
                            "score": 1,
                            "created_utc": 1652682269.0,
                            "response": "Bollocks. Generate text wallets for free in under thirty seconds. Right now.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8s91hb",
                    "author": "soft-serve69",
                    "score": 2,
                    "created_utc": 1652676655.0,
                    "response": "Your crypto is not stored as memory on a device like a hard drive, instead, these are like keys for security deposite box in digital space called the Blockchain.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8s951j",
                            "author": "soft-serve69",
                            "score": 2,
                            "created_utc": 1652676721.0,
                            "response": "The difference here is that if you loose your cold wallet you didn't lose your crypto you just lost the keys to access it on the Blockchain, you can duplicate a key if you know what the source seed phrase is.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8sh57k",
                            "author": "Fulvio55",
                            "score": 1,
                            "created_utc": 1652682393.0,
                            "response": "Yessssss…. But… it’s even simpler than that.\n\nThe key IS the wallet. Store it someplace safe and you’re done. Whether that’s a text file on a USB stick or diskette, a piece of paper or chiselled into a rock buried in the back yard, it’s all the same.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8s9coi",
                    "author": "Primary_Syrup_6412",
                    "score": 2,
                    "created_utc": 1652676858.0,
                    "response": "I got the Ledger Nano S Plus. i got it from amazon for 80$ it is very simple to set up and to transfer ur crypto from the exchange to the cold wallet. lots of videos on youtube that go into great step by step process. i just recently took all my doge off robinhood and onto my ledger. i highly recommend the rest of the shibes do so as well. we might soon have confirmation if exchanges like binance have been double dipping and lending our own coins to short doge. so lets not give them that option and take ur doge off all exchanges!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8s9dwg",
                    "author": "Taronyu019",
                    "score": 2,
                    "created_utc": 1652676881.0,
                    "response": "In plain simple words, the coin in the balance sheet in the network. The wallet has the private and public to access your coin in the network. Basically what you are doing is to transfer your coin from the wallet of the exchange to your wallet/private and public keys. Who owns the keys to the coin, owns the coin therefore able to [short the coin](https://youtu.be/zvF5vGMuNWw).",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8sgycn",
                    "author": "Fulvio55",
                    "score": 1,
                    "created_utc": 1652682241.0,
                    "response": "#Cold Wallets are neither Hardware nor Software!\n\nAll they are are keys stored offline, that’s all.\n\nAll wallets are identical. They are numbers. As in the private keys.\n\nStick these in a text file and store it on removable media of some sort, and you’ve got cold wallets. It’s as simple as that. Which I explain several times a day, every day, for the past eight years. But does anybody read? Seems not, because these posts just keep on coming.\n\nMaybe read the more detailed reply I gave a couple of hours ago, eh?",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uqnjdt",
            "title": "Day 116: Telling everybody I love them everyday forever. I LOVE YOU Dogecoin community!",
            "url": "https://www.reddit.com/r/dogecoin/comments/uqnjdt/day_116_telling_everybody_i_love_them_everyday/",
            "author": "Griffinmh",
            "created_utc": 1652675057.0,
            "score": 13,
            "num_comments": 4,
            "subreddit": "dogecoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8s7acp",
                    "author": "natasevres",
                    "score": 3,
                    "created_utc": 1652675552.0,
                    "response": "Welcome to costco - i love you",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8s7s6x",
                    "author": "Mananimalism",
                    "score": 1,
                    "created_utc": 1652675866.0,
                    "response": "&#x200B;\n\n![gif](giphy|l0ExwW5yCqhsX566I|downsized)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8sadil",
                    "author": "myironcity",
                    "score": 1,
                    "created_utc": 1652677501.0,
                    "response": "![gif](giphy|EbaEWv3icphQI)",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}