{
    "subreddit": "Dogecoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uto4lz",
            "title": "starting a company in my country",
            "url": "https://www.reddit.com/r/dogecoin/comments/uto4lz/starting_a_company_in_my_country/",
            "author": "blanchedbrocolli",
            "created_utc": 1653032902.0,
            "score": 1,
            "num_comments": 0,
            "subreddit": "dogecoin",
            "selftext": "DOGE FAM!\n\nI am starting an EV charging company in my country. \n\ni believe that the doge community has given a lot to the world ( mostly fun, laughter, memes and lotsa love)   \nhence, i am going to accept DOGE as a form of payment! \n\nany ideas on what else i should do? all comments are accepted! \n\nthanks and hoping to hear more from the community. \n\nDo Only Good Everyday",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uto8y5",
            "title": "If your custodian goes bankrupt, your coins are forfeit, people! Stack onchain into your wallet. Not your keys, not your crypto.",
            "url": "https://i.redd.it/g8v49qir7l091.jpg",
            "author": "EmperorCip",
            "created_utc": 1653033499.0,
            "score": 3,
            "num_comments": 11,
            "subreddit": "dogecoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9axl5j",
                    "author": "adam11919",
                    "score": 2,
                    "created_utc": 1653034006.0,
                    "response": "You really think robinhood is going to go bankrupt?….",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9axx4i",
                            "author": "EmperorCip",
                            "score": 1,
                            "created_utc": 1653034307.0,
                            "response": "It may or it may not. Right now, its situation is not so rosy. But if it goes bust, all doge holders will lose their coins. Your exchange owns the coins. You just own their YOU.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9ay1re",
                                    "author": "adam11919",
                                    "score": 0,
                                    "created_utc": 1653034427.0,
                                    "response": "No, everyone would lose everything if they did, crypto, stocks etc. do you know how many people use RH? I don’t see that happening…..",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9ayhjp",
                                            "author": "liquid_at",
                                            "score": 2,
                                            "created_utc": 1653034824.0,
                                            "response": "no... because Stocks are securities regulated by the SEC and if RH goes bankrupt, they will be transferred to a different broker who then has to treat them as your property. You do not lose anything.\n\nMeanwhile, crypto is on the regulatory level of them debating whether Exchanges can store your coins in the same wallets as their own. \n\nThere is no regulation that protects your crypto. Zero. None. \n\nMoney on bank accounts is protected. Stocks on Broker-accounts are protected. Crypto on exchanges is not. That's the entire point. They are not the same even if noobie-traders think it's the same because it has a familiar shape.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i9ayhrh",
                                            "author": "EmperorCip",
                                            "score": 1,
                                            "created_utc": 1653034829.0,
                                            "response": "And that's why it can be a juicy target for hungry mouths. I don't think you quite realize how vicious the markets can get during a prolongued bear market. During the 2000's DOTCOM bubble, internet stocks fell by over 99%. What happenned to Luna last week is an appetizer for what's to come. DOGE is the thirdmost secure coin by hashrate, but you only benefit from that security if you keep your coins onchain. If you keep them with a custodian, well.... may Satoshi have mercy on your soul!",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9azzs8",
                                                    "author": "adam11919",
                                                    "score": 1,
                                                    "created_utc": 1653036192.0,
                                                    "response": "Luna was a pump and dump, calm down there. You’re going to be just fine and so is RH",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9azjvr",
                            "author": "ZanlanOnReddit",
                            "score": 1,
                            "created_utc": 1653035786.0,
                            "response": "I do believe it. \n\nr/superstonk",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9b0il1",
                    "author": "AdSea3516",
                    "score": 1,
                    "created_utc": 1653036661.0,
                    "response": "Only the crypto is the risk. Stocks and money in the bank will be protected.   Even if doge falls back to it's humble beginnings the value in your hard wallet will also decrease",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}