{
    "subreddit": "Dogecoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "up9nt5",
            "title": "D.O.G.E. Inspired - Self Cooling Drill Bit Concept",
            "url": "https://i.redd.it/niw8tr3cfdz81.jpg",
            "author": "I-Respect-You",
            "created_utc": 1652503342.0,
            "score": 1,
            "num_comments": 1,
            "subreddit": "dogecoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8jwwj0",
                    "author": "I-Respect-You",
                    "score": 1,
                    "created_utc": 1652513519.0,
                    "response": "Such efficiency! Much revolutionary! Many cost reductions! Very D.O.G.E.!",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uw75hf",
            "title": "Sit.",
            "url": "https://i.redd.it/u0q61ti8t9191.jpg",
            "author": "Justindviolin",
            "created_utc": 1653331284.0,
            "score": 2,
            "num_comments": 3,
            "subreddit": "dogecoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9pt1jm",
                    "author": "No-Camel2984",
                    "score": 2,
                    "created_utc": 1653332485.0,
                    "response": "Ahhh RuneScape how I miss thy!",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uw7euz",
            "title": "Before knowing Dogecoin i didn't like it.",
            "url": "https://www.reddit.com/r/dogecoin/comments/uw7euz/before_knowing_dogecoin_i_didnt_like_it/",
            "author": "SventuraOscura",
            "created_utc": 1653331999.0,
            "score": 31,
            "num_comments": 43,
            "subreddit": "dogecoin",
            "selftext": "Yeah, as title says, before knowing how Doge works, i didn't like it at all, for me was like a \"shitcoin\" as many others, i was thinking \"how a cryptocurrency with a dog logo could perform better than a project with a real utility?\" , damn if i was wrong, at the surface, the dogecoin community seems like one of many of the pump and dumb crypto subs, the \"when moon\" \"lambo\" etc, to me were like silly memes (but still funny af) , then, digging around in my free time, and exploring a bit, i discovered so many things, that were unique to doge.\n\n\\- Is a Crypto that is born in 2013, as a meme, and is still ACTIVE and running (we are speaking of nearly 10 YEARS of activity)\n\n\\- Low Fees , No seriously, i bought some doges just for the fun, and, i noticed that for transfering them, i pay low to no fees at all. I pay way more with other cryptos, and i never cared enough to check the difference. is BIG.\n\n\\- Coin, not a token. Since i am a newbie in Doge story, i always thinked that was like an ethereum token, just like Shib (FEES, ouch). Registered on binance, i noticed in address \"Dogecoin\", and i was like \"is a bug or what?\", truth is, that dogecoin have HIS OWN chain, a freaking \"meme\" coin, have a chain for itself. WHAT!?!\n\n\\- Community, except the \"when lambo\" \"when moon\" posts, is more friendly and not depressing like other cryptos. you lost 500$ on this crypto? HODL, memes, moon soon etc. in another crypto sub?, depression, rage, \"i quit\" posts etc. Is a big difference.\n\n\\- Real use on Internet Donations and tipping. I am a BAT user, and i mostly use BAT to tip content creators, and i was thinking this thing was innovative... turns out, Dogecoin did this WAY BEFORE (What in the actual Quack), even if for now is only on reddit (checked and registered with sodogetip). \n\n&#x200B;\n\nHOW MANY MORE THINGS I MISSED OUT?, i feel like an uga buga neanderthal man.\n\n&#x200B;\n\nThanks for making me discovering this.\n\n&#x200B;\n\n\\-A Fellow BAT user.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9pw9dr",
                    "author": "liquid_at",
                    "score": 13,
                    "created_utc": 1653333862.0,
                    "response": "Most people do not realize that the \"wen lambo\" and \"wen moon\" memes came from other alt-coins... the ones that were the reason for doge to be created in the first place.\n\nDoge was there to make fun of their attitudes, asking for pump&dump schemes instead of real investing. \n\nHaters usually think that it is what the community believes in, but it's actually just a meme... a meme to make fun of people who consider crypto a gamble. \n\nWelcome to the community",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9q1450",
                            "author": "SventuraOscura",
                            "score": 4,
                            "created_utc": 1653335932.0,
                            "response": "Thanks, another thing that i missed to add in the original post.\n\nWith Brave Browser, you can tip content creators with BAT Tokens on youtube, website or reddit.\n\nchecking dogecoin, this thing existed WAY BEFORE Bat was even created (even if only on reddit). i am gonna update it, now that i noticed it.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9q2b1f",
                                    "author": "liquid_at",
                                    "score": 1,
                                    "created_utc": 1653336438.0,
                                    "response": "Love the idea of bat but I haven't seen a lot of opportunities to use it yet.\n\nNot sure why.... I have the tip with BAT buttons on reddit but always get \"user cannot receive because they have not signed up\" ...",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9q4w0p",
                                            "author": "SventuraOscura",
                                            "score": 1,
                                            "created_utc": 1653337559.0,
                                            "response": "Yeah, is because they are not registered for reddit, with brave creators.\n\nTo receive donations, you need to be registered, but nobody does so, idk why.\n\nAlso, BAT on exchanges can't go in liquidity staking, can't stake, you can only \"hold\" in savings, with a low percentage on binance. is a real niche token use.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9q610r",
                                                    "author": "liquid_at",
                                                    "score": 1,
                                                    "created_utc": 1653338058.0,
                                                    "response": "so far I have yet to figure out how to actually use them.\n\n\"Exchanges want your KYC so do that first\" is not really a conclusive statement...\n\nWell... Don't have a lot of them either. But if it ever becomes useful, I still have 100 Tokens on my exchange-wallet. Hoping for better times.\n\nSo far not even newspapers, the true professionals of begging for money, have it enabled... great idea but adoption is lacking.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9q8erm",
                                                            "author": "SventuraOscura",
                                                            "score": 1,
                                                            "created_utc": 1653339092.0,
                                                            "response": "Yeah, no one really uses it, and is strange, because with brave browser you get free tokens anyway, so, is not like you spend money.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9qboo6",
                                                                    "author": "liquid_at",
                                                                    "score": 1,
                                                                    "created_utc": 1653340551.0,
                                                                    "response": "brave still could be made simpler... the whole wallet unlocking thing isn't that straight forward for people with limited experience in crypto.\n\nAnd the killer-feature that is missing is the browser-plugins for all other browsers. \n\nIt hast to become the defacto standard for in-browser payments to have a chance.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9u1fwk",
                                                                            "author": "SventuraOscura",
                                                                            "score": 1,
                                                                            "created_utc": 1653415142.0,
                                                                            "response": "about plugins, what do you mean?, Brave is based con chronium, so, all plugins that work on Chrome, works on Brave (as i know).",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i9u3gty",
                                                                                    "author": "liquid_at",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653415989.0,
                                                                                    "response": "I think they switched to a plugin-based wallet system now, but it's been a while where you could only use BAT in Brave.\n\nI don't have any issues with brave, I use it myself... but most people never install a browser and always use the one that comes with their OS, so it'd be important to have it available everywhere. \n\nJust checked the store and so far there is no BAT-Plugin for Chrome...\n\nBut as you say, Brave is based on Chromium so there shouldn't be any technical issues with implementing it. it just doesn't seem to exist yet.",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9rr68m",
                            "author": "DankShibe",
                            "score": 2,
                            "created_utc": 1653366193.0,
                            "response": "Lambo meme comes from btc I think",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9q1i8o",
                    "author": "Ihavelostmytowel",
                    "score": 5,
                    "created_utc": 1653336098.0,
                    "response": "Dogecoin is a currency. That's it, that's the show. One trick doge. It's money.\n\nPeople fail to realize how extraordinarily useful that is. How fast and secure doge is. \n\nIt's the only coin that I know of that has deflationary inflation. The reward blocks are static, so the more coins in existence the lower the inflation rate becomes. \n\nThe static rewards incentivises miners to mine, so we don't have to add a bunch of arbitrary fees to make the chain go. This leads to a much more democratic blockchain with FIFO being the default for transactions rather than \"highest paid fee goes first\".\n\nSo money. Much wow!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9q5jlm",
                            "author": "SventuraOscura",
                            "score": 5,
                            "created_utc": 1653337846.0,
                            "response": "miners of dogecoin?\n\nFifo?\n\ni need to learn a lot on cryptos then ![gif](emote|free_emotes_pack|flip_out)",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9qr5fi",
                                    "author": "Dogekaliber",
                                    "score": 2,
                                    "created_utc": 1653347848.0,
                                    "response": "r/dogemining",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9qr6l0",
                                            "author": "sneakpeekbot",
                                            "score": 1,
                                            "created_utc": 1653347864.0,
                                            "response": "Here's a sneak peek of /r/dogemining using the [top posts](https://np.reddit.com/r/dogemining/top/?sort=top&t=year) of the year!\n\n\\#1: [Second life for old office laptops!](https://www.reddit.com/gallery/ns38pf) | [39 comments](https://np.reddit.com/r/dogemining/comments/ns38pf/second_life_for_old_office_laptops/)  \n\\#2: [I'm gonna make you mine](https://i.redd.it/71xebph6px771.jpg) | [4 comments](https://np.reddit.com/r/dogemining/comments/o9cwu7/im_gonna_make_you_mine/)  \n\\#3: [Who’s still holding $DOGE? 🚀 🚀 🚀](https://i.redd.it/807vuc23u7671.png) | [28 comments](https://np.reddit.com/r/dogemining/comments/o3gpnq/whos_still_holding_doge/)\n\n----\n^^I'm ^^a ^^bot, ^^beep ^^boop ^^| ^^Downvote ^^to ^^remove ^^| ^^[Contact](https://www.reddit.com/message/compose/?to=sneakpeekbot) ^^| ^^[Info](https://np.reddit.com/r/sneakpeekbot/) ^^| ^^[Opt-out](https://np.reddit.com/r/sneakpeekbot/comments/o8wk1r/blacklist_ix/) ^^| ^^[GitHub](https://github.com/ghnr/sneakpeekbot)",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9qih1v",
                    "author": "shattypantsMcGee",
                    "score": 4,
                    "created_utc": 1653343664.0,
                    "response": "What a great thread man.  Thanks for posting.  Lots of awesome Doge knowledge on display.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9scv0d",
                            "author": "purpleefilthh",
                            "score": 2,
                            "created_utc": 1653383878.0,
                            "response": "FACTS\n\n\\+/u/sodogetip 1 doge verify",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9scrji",
                    "author": "purpleefilthh",
                    "score": 2,
                    "created_utc": 1653383784.0,
                    "response": "Awesome to have you here! Well written.\n\n\\+/u/sodogetip 10 doge verify",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9t6y0l",
                    "author": "never-give-up-every1",
                    "score": 1,
                    "created_utc": 1653402503.0,
                    "response": "Yeah me too, I thought Before that the DOGE coin is nothing but when I try to take it seriously I see the potential on it. Now I am a Holder at Netcoins in Canada and still hold it for the future. I hope people will take it seriously also.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9t7kjb",
                    "author": "83nno",
                    "score": 1,
                    "created_utc": 1653402775.0,
                    "response": "Yep it is a decent project if people take the time to look into it! It also has a lot of adoption with people buying stuff with it more than I’ve seen  with other crypto coins.\n\nFYI there is also tipping on Twitter using both sodogetip and mydogewallet. 👍",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9tuapx",
                    "author": "Pale-Capital-4680",
                    "score": 1,
                    "created_utc": 1653412200.0,
                    "response": "i love you!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9pulzt",
                    "author": "OrangeHODLr",
                    "score": -6,
                    "created_utc": 1653333163.0,
                    "response": "Wait until he finds out about the no limit market cap and downward pressure price stability.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9pwdg8",
                            "author": "liquid_at",
                            "score": 7,
                            "created_utc": 1653333909.0,
                            "response": "Wait until you find out about math and how under 5% per year is an absolutely perfect inflation-value for a currency like doge.\n\nThe \"no limit market cap\"-argument only says one thing... that you do not understand what a currency is.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9q5k2b",
                                    "author": "OrangeHODLr",
                                    "score": -4,
                                    "created_utc": 1653337852.0,
                                    "response": "There is no implemented hard cap on the total supply of Dogecoins. Nonetheless, in February 2014, Dogecoin founder Jackson Palmer announced that the limit would be removed in an effort to create a consistent reduction of its inflation rate over time.\n\nPretty sure I understand math. I think you’ve misunderstood what I said.  Feel free to enjoy your negative feelings though.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9q6ry4",
                                            "author": "liquid_at",
                                            "score": 5,
                                            "created_utc": 1653338384.0,
                                            "response": "sure... so over an infinity of years there might be an infinite supply.\n\nOver finite years the supply isn't only finite, you can calculate the exact amount of coins that will be in circulation, just like the effective inflation-rate that will cause.\n\nOther than literally every single fiat-CURRENCY out there that is also inflationary, but in contrast to doge not growing at a fixed rate that is not changeable...\n\nThe only difference between bitcoins \"limited\" and doges \"unlimited\" supply is that bitcoin has a fixed year where they will stop making new coins... They have about 100 years to change their mind on that and become like doge. \n\nIf you do understand math, then do the math... Calculate how many new coins will be created each year and compare it to the historic USD-Inflation to figure out why doge will always increase in price over the USD that devalues itself much faster...\n\n\"unlimited supply is a problem\" is a meme by haters that don't understand math. If you do understand math, it will only take you 5 minutes or less to figure out why this hater-meme is stupider than a monkey after a lobotomy...",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9q6yi3",
                                                    "author": "OrangeHODLr",
                                                    "score": -2,
                                                    "created_utc": 1653338462.0,
                                                    "response": "I never said it was a problem you did.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9qau5d",
                                                            "author": "liquid_at",
                                                            "score": 2,
                                                            "created_utc": 1653340164.0,
                                                            "response": "you just threw trigger words into the conversation without saying or explaining anything.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9qb7rd",
                                                                    "author": "OrangeHODLr",
                                                                    "score": 1,
                                                                    "created_utc": 1653340336.0,
                                                                    "response": "I don’t know anything about what I said being trigger words.   Not sure what your problem is tbh.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i9q725k",
                                                    "author": "OrangeHODLr",
                                                    "score": 0,
                                                    "created_utc": 1653338506.0,
                                                    "response": "We are literally in agreement but here you are arguing with me. Makes no sense.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9q1u9p",
                            "author": "SventuraOscura",
                            "score": 2,
                            "created_utc": 1653336239.0,
                            "response": "Well, checking many subreddits, i found Luna ..\n\nWhat was that?, Suicide hotlines, a 7 BILLION market cap, and that thing was 80$ before?, how was possible?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9q6gca",
                                    "author": "OrangeHODLr",
                                    "score": 5,
                                    "created_utc": 1653338243.0,
                                    "response": "To be clear this isn’t an argument against doge. I hold two coins Bitcoin and Doge.  I believe LUNA had a massive premine and a fake market cap.  Not sure I’m not a LUNA expert.  Dogecoin has no theoretical upper bound.  However it is issued by the algorithm over a long period of time. This will produce deflationary action in its price over time at a consistent rate. THIS IS A GOOD THING.  It means it’s stable money.  Not sure why this other guy is so angry but he seems to have his own issues going on.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9rrity",
                                            "author": "DankShibe",
                                            "score": 1,
                                            "created_utc": 1653366412.0,
                                            "response": "It appeared as a negative with how you have worded it, hence the dislikes. But yeah, they can't print trilions of doges at once since there is a cap in how many can be mined per year. This is something that many crypto noobs miss.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9sz7zp",
                                                    "author": "OrangeHODLr",
                                                    "score": 1,
                                                    "created_utc": 1653398932.0,
                                                    "response": "Sorry it never occurred to me that it would be taken negatively. To me that downward price pressure is what’s great about it.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9u195r",
                                                            "author": "DankShibe",
                                                            "score": 1,
                                                            "created_utc": 1653415065.0,
                                                            "response": "Yeah, written stuff can be interpreted in different ways since there is no tone or expression",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9u2h9s",
                                                                    "author": "OrangeHODLr",
                                                                    "score": 1,
                                                                    "created_utc": 1653415570.0,
                                                                    "response": "Me and my flat affect will leave now.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9s1vpn",
                            "author": "Monkey_1505",
                            "score": 2,
                            "created_utc": 1653373966.0,
                            "response": "He should be pleased when he does. Doge is similar to gold in this respect, whereas the rest of crypto is extremely experimental economically.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9syjcq",
                                    "author": "OrangeHODLr",
                                    "score": 1,
                                    "created_utc": 1653398600.0,
                                    "response": "Ya absolutely it’s why I hold doge.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}