{
    "subreddit": "Dogecoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uyu27i",
            "title": "I'm learning how to dip. Just outbid Elon's 69420 orders",
            "url": "https://i.redd.it/fizvrkgfhz191.jpg",
            "author": "DeepFuckingVision",
            "created_utc": 1653642093.0,
            "score": 12,
            "num_comments": 8,
            "subreddit": "dogecoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "ia7633b",
                    "author": "SnowMaidenJunmai",
                    "score": 1,
                    "created_utc": 1653662748.0,
                    "response": "Yep. Learned that in the mayhem of the big run up last year.\n\nIn short, think of your number like a line, or queue. Each trailing digit puts you in a different line. \n\nThe more specific you are, the more likely to be in a shorter line, getting your request processed by the system when the price meets your specificity.\n\nThat's why 69420, being so popular (not to mention immature 🙄) will have a SUPER long request queue, and depending on when you put in your limit order, and how fast the system processes requests, you might miss out, until the price hits it again, and more limits are processed.\n\nThat said, 69418, 19, 22, 23, etc, will arguably have a shorter queue, thus, getting your request processed sooner.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia8a9e5",
                            "author": "DeepFuckingVision",
                            "score": 1,
                            "created_utc": 1653679659.0,
                            "response": "Oh crazy, so essentially a cheaper price could go through first simply because there's less people on it?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia8ijbm",
                                    "author": "SnowMaidenJunmai",
                                    "score": 1,
                                    "created_utc": 1653683410.0,
                                    "response": "Any limit order - buy or sell - if you set it at a number that every Tom, Dick and Harry wants, too, you're in line with them, in whatever order, and only so many orders can be processed in the time it takes for the price to change, depending on the action.\n\nSo, in order to get yourself in a shorter line, stretch your limit out as many decimal places as will allow, and try not to use numbers other people would use.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iaabdna",
                                            "author": "DeepFuckingVision",
                                            "score": 1,
                                            "created_utc": 1653719308.0,
                                            "response": "That is some pretty awesome info, thanks!",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}