{
    "subreddit": "Dogecoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uyr34u",
            "title": "[Android] Liberate your DOGE from Robinhood! Follow my step-by-step instructions!",
            "url": "https://www.reddit.com/gallery/uyr34u",
            "author": "sg1250808",
            "created_utc": 1653629587.0,
            "score": 19,
            "num_comments": 8,
            "subreddit": "dogecoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "ia5tvo3",
                    "author": "outk8st",
                    "score": 5,
                    "created_utc": 1653630376.0,
                    "response": "F U C K     R O B I N H O O D",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia5vkfb",
                            "author": "sg1250808",
                            "score": 2,
                            "created_utc": 1653631599.0,
                            "response": "Exactly! This is why I created this post - to liberate our DOGE from Robinhood!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia5vebd",
                    "author": "sg1250808",
                    "score": 3,
                    "created_utc": 1653631477.0,
                    "response": "Fellow Shibes! The time has come to liberate your DOGE from the clutches of Robinhood! You may use any wallet (software or hardware), but I will show you with the MyDoge wallet app, since it's free and accessible to anyone who can download it on their device.\n\nNOTE: iPhone users, the instructions will likely be a little different depending on the wallet app and 3rd party authentication service you use.\n\nYou can follow the screenshots which details each step in the captions, or you can just read the step-by-step instructions below:\n\nSTEP 0: Download and set up your wallet app. My instructions uses MyDoge, so if you use something different, it may vary slightly.\n\nSTEP 1: Click the PAW button. This opens a menu of different features (send, receive, etc.)\n\nSTEP 2: Click the RECEIVE button. This takes you to the screen to prepare your wallet to receive funds.\n\nSTEP 3: Click the COPY button. This copies your wallet's address to your clipboard.\n\nSTEP 4: Go to Robinhood. Click on DOGE to access your Dogecoin.\n\nSTEP 5: Click the SEND button. NOTE: If you don't have this button, it means you haven't set up your wallet on Robinhood. Do this ASAP!!!\n\nSTEP 6: Enter the amount of DOGE to send to your wallet. NOTE: Robinhood limits your DOGE transfers to a max of 5000 DOGE per transfer, and a max of 10 transfers in a 24 hour period. This means you can only transfer a max of 50000 DOGE per day from Robinhood.\n\nSTEP 7: Paste your wallet address in the box and click the REVIEW button.\n\nSTEP 8: Click the SUBMIT button. This takes you to an authenticator screen. On my mobile Android device, this was the Microsoft Authenticator app. Access the 3rd party app for the 6-digit authenticator code (the app wouldn't let me screen shot it for security reasons)\n\nSTEP 9: Enter the 6-digit code from the 3rd party authenticator app. Successfully doing so authorizes and completes the transfer.\n\nSTEP 10: If everything is done correctly, you will be redirected to a confirmation screen that shows the DOGE was sent to the listed wallet address.\n\nSTEP 11: Celebrate your liberation from Robinhood! Your DOGE is now 100% yours! NOTE: Be patient. It can take up to an hour for the transfer to complete and show up in your wallet.\n\nHope this helps! If others have additional tips or advice to add, please chime in! I'm only trying to do my small part!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia5vjax",
                            "author": "javierjjm522",
                            "score": 3,
                            "created_utc": 1653631576.0,
                            "response": "Thank you for sharing! this is the way! 💎🐾",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia63emk",
                    "author": "Richy247",
                    "score": 3,
                    "created_utc": 1653638044.0,
                    "response": "I actually did this because they liquidated my portfolio for a complete transfer. I did not know they would sell all my doge so I quickly moved it to a wallet. I avoided them and they got mad no doubt. I was on the on the phone with customer service an when I asked about transferring to a Wallet they hung up immediately. I outplayed them and closed my account for good",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}