{
    "subreddit": "Dogecoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uqsv67",
            "title": "If Doge dips down this week to 0.04-0.02 cents, I'm taking Bitcoin chart from 2018 as an example for future Dogecoin chart. Maybe I've lost my mind but right not that's the only explanation of Dogecoin violence!",
            "url": "https://www.reddit.com/gallery/uqsv67",
            "author": "VanguardManwild",
            "created_utc": 1652697321.0,
            "score": 6,
            "num_comments": 15,
            "subreddit": "dogecoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8t0zki",
                    "author": "BurnerMcBoatFace",
                    "score": 3,
                    "created_utc": 1652699318.0,
                    "response": "There's a wall @ 5 cents but Doge has a way of violently boring through resistance levels.🤣",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8t1mhb",
                            "author": "VanguardManwild",
                            "score": 0,
                            "created_utc": 1652699767.0,
                            "response": "If there's a manipulation, there as no such wall that couldn't be broken :)",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8t76s1",
                    "author": "mikeausprung",
                    "score": 2,
                    "created_utc": 1652703297.0,
                    "response": "Yep. Every 4 years",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8t9m2g",
                    "author": "Defiant_Affect_2925",
                    "score": 2,
                    "created_utc": 1652704685.0,
                    "response": "bruh It’s just following bitcoin right now not sure what type of hopeium you’re on",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8tb15d",
                            "author": "VanguardManwild",
                            "score": 0,
                            "created_utc": 1652705442.0,
                            "response": "The hopeium I'm on is that in 2024 Dogecoin might reach approximately 2,5 USD",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8txfqv",
                                    "author": "FaceBillions24",
                                    "score": 1,
                                    "created_utc": 1652715559.0,
                                    "response": "is that a 2.50$ or a 2,500$ bc it looks like a comma to me making it 2,500$. Im all for that dont get me wrong and i do think doge will battle ETH for number 2 but not for a long long time and im not sure at what price. Thanks for putting this out into the universe though so mabey it will manifest if enough of us try.![gif](emote|free_emotes_pack|money_face)",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8u5fup",
                                            "author": "JohnCena_770",
                                            "score": 1,
                                            "created_utc": 1652718799.0,
                                            "response": "I think almost everyone in the world, except the US, uses Commas as in \"two dollars and fify cents\" and dots for \"twothousandfivehundred\"",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i8uhtew",
                                            "author": "VanguardManwild",
                                            "score": 1,
                                            "created_utc": 1652723692.0,
                                            "response": "2.50$ And don't forget that ETH price doesn't stay the same. In 2 years the market cap can change so Doge doesn't have to compete for 2nd place",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8uitiz",
                                                    "author": "FaceBillions24",
                                                    "score": 1,
                                                    "created_utc": 1652724078.0,
                                                    "response": "I was hoping it was 2,500$ lol I agree about market cap. Look atb luna 6.something trillion in a day or 2 lol. The argument not from you but that most people say first when hating Doge is the market cap. what about the us dollar? moron politicians just print more money and eventually we all decided well its ok its still worth 1 dollar in essence. I know thats not 100% true but there is some credit to that.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8uodm9",
                                                            "author": "VanguardManwild",
                                                            "score": 1,
                                                            "created_utc": 1652726303.0,
                                                            "response": "Well, that's the reality right now. And another thing about market cap is that, for example, Dogecoin reaches 100$, market cap is unexplainably high, but it doesn't stay the same forever, from the moment the first person sells Dogecoins with the price of 100$, the market cap begins to go down, because the price will go down, so there is no chance that the world will be filled with amount of USD equal to the market cap of Dogecoin. Only of all the people who hold Dogecoin will sell at the same time, and then the market cap will be equal to 0.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8th5a0",
                    "author": "Lonewolfblack",
                    "score": 1,
                    "created_utc": 1652708512.0,
                    "response": "It's literally seen on most crypto the only thing is they run on different time stamps it's almost impossible for me to find a trend ATM\nSome purge and accumulate quicker some trend sideways I know that doge one rumoured for 21st of June which would tie nicely with this second ath",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ti9oy",
                    "author": "PerfectBake420",
                    "score": 1,
                    "created_utc": 1652709038.0,
                    "response": "if this hits 2 cents, I am throwing everything i have left at it. The auto buy each payday just wont cut it at those prices",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8tu2np",
                    "author": "junnys0129",
                    "score": 1,
                    "created_utc": 1652714166.0,
                    "response": "multiple threads were made (I am one of them) with that graph comparing it with doge... if history repeats there is still a lot to dump... and surely there is some scamwick at $0.01",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8umrts",
                    "author": "GroundbreakingSky169",
                    "score": 1,
                    "created_utc": 1652725655.0,
                    "response": "Time to load up!",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}