{
    "subreddit": "Dogecoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uzk3x5",
            "title": "Paper wallet",
            "url": "https://www.reddit.com/r/dogecoin/comments/uzk3x5/paper_wallet/",
            "author": "QuantumMorpheus",
            "created_utc": 1653731587.0,
            "score": 0,
            "num_comments": 9,
            "subreddit": "dogecoin",
            "selftext": "Dogechain.info has changed a lot since I last logged in. Earlier I was able to migrate my funds to paper wallet but now I could not find the option to create paper wallet. Can anyone please advise?",
            "stickied": false,
            "comments": [
                {
                    "id": "iaazxpd",
                    "author": "Fulvio55",
                    "score": 3,
                    "created_utc": 1653740122.0,
                    "response": "You don’t want dogechain anyway.\n\nBecause given the other ‘features’ they offer, most people fail to take a copy of their keys. And then when they inevitably get locked out by the 2FA failures, they lose access to their coins. And there’s no support to speak of.\n\nSearch here for ‘text wallet’ and have a read.\n\nThere are a number of ways to generate wallets.\n\nFor singles, coinb.in will do that. And since you want to grab a copy of the site anyway, you can do this offline.\n\nWalletgenerator.net will do bulk batches of thousands or even more. Which is a good move, since there have been concerns raised about the security of the site from time to time. Just run off a few thousand and put them on ice till you need them\n\nYou always spin up a fresh copy of Core, let it generate its files, and then use the DUMPWALLET command to create a text file with all your wallets in it. A hundred of them by default. And there’s no need to sync the client first either. Just throw it away when you’re done\n\nYou can even use https://privatekeys.pw/keys/dogecoin/1192823076327875903496734298758521961826531160253833807780858347507850668059 to get some wallets. Just be sure to hit the random button a few times first. And again, let them mellow like fine wine.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iac1xgq",
                            "author": "QuantumMorpheus",
                            "score": 1,
                            "created_utc": 1653759279.0,
                            "response": "Thanks a lot..!",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iaegf6k",
                                    "author": "Fulvio55",
                                    "score": 1,
                                    "created_utc": 1653806968.0,
                                    "response": "NP",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iaaqlmv",
                    "author": "liquid_at",
                    "score": 2,
                    "created_utc": 1653733058.0,
                    "response": "a paper wallet can be any wallet.\n\nthere is no special type for \"paper wallet\"... it's just how you store your key.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaar3y0",
                            "author": "QuantumMorpheus",
                            "score": 2,
                            "created_utc": 1653733511.0,
                            "response": "I understand. But earlier i was able to create one directly from dogechain.info. but now I cant find that option",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "uzk3vk",
            "title": "Best & safe interest rate for doge",
            "url": "https://www.reddit.com/r/dogecoin/comments/uzk3vk/best_safe_interest_rate_for_doge/",
            "author": "mmajass",
            "created_utc": 1653731582.0,
            "score": 0,
            "num_comments": 38,
            "subreddit": "dogecoin",
            "selftext": "What’s the best way to make your Doge earn interest? \n\nI’ve tried Binance Flexible savings but the APY is only 0.5% (1% for up to 5k Doge). \n\nI’m now looking at Nexo, they offer 1% if you hold some Nexo tokens and take out your earnings in Doge or 3% if you take your earnings in Nexo token. \n\nAny other comparable options without having to swap Doge to something else ( I don’t want to create another taxable event)?",
            "stickied": false,
            "comments": [
                {
                    "id": "iaap99y",
                    "author": "liquid_at",
                    "score": 3,
                    "created_utc": 1653731815.0,
                    "response": "If you get interest for doge you always have a risk of loss. so there is no safe way to do it.\n\nIf you want passive income, pick a true Proof of Stake coin that you can stake from your cold wallet and do that. \n\nIf that's a taxable event in your country it's a taxable event. What you pay taxes for and what you don't pay taxes for should always influence your investment decisions. Not everything that is possible has to make sense for you in your situation.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iab0c9f",
                            "author": "Fulvio55",
                            "score": 2,
                            "created_utc": 1653740381.0,
                            "response": "You can’t stake cold wallets. Only hot wallets. Which is a huge negative for those things.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iab0w5x",
                                    "author": "mmajass",
                                    "score": 1,
                                    "created_utc": 1653740746.0,
                                    "response": "Yes, that’s true, I’m not suggesting to risk everything, just have a portion that earns some interest, that’s all",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iab1hao",
                                            "author": "Fulvio55",
                                            "score": 2,
                                            "created_utc": 1653741117.0,
                                            "response": "There’s nothing wrong with having some PoS coins. I’ve even got some Clams around someplace, but they haven’t been online in years, so they’re not earning anything at all.\n\nJust don’t expect miracles.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "iab0yjx",
                                    "author": "liquid_at",
                                    "score": 1,
                                    "created_utc": 1653740791.0,
                                    "response": "afaik, there are some chains that allow it. \n\nFrom what I found, AVAX, EGLD, ONE, MATIC among them.\n\n Ledger even supports some of them.\n\nNot standard yet, but imho the only reasonable way to do it.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iab1j6v",
                                            "author": "Fulvio55",
                                            "score": 1,
                                            "created_utc": 1653741150.0,
                                            "response": "I wouldn’t touch sh!tcoins with a barge pole though.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iab1w7r",
                                                    "author": "liquid_at",
                                                    "score": 1,
                                                    "created_utc": 1653741370.0,
                                                    "response": "i read somewhere that eth2 might also support it, but not sure about that. \n\nbut true... 10% staking rewards are pointless when the coin is only worth 10% after a year...",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iab2d1r",
                                                            "author": "Fulvio55",
                                                            "score": 2,
                                                            "created_utc": 1653741658.0,
                                                            "response": "Yeah.",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "iab34y7",
                                                            "author": "mmajass",
                                                            "score": 1,
                                                            "created_utc": 1653742113.0,
                                                            "response": "Do yo think that would apply to eth after the merge? Loosing 10% value per year?",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "iaappc8",
                            "author": "mmajass",
                            "score": 1,
                            "created_utc": 1653732223.0,
                            "response": "Thanks yes, ok , this is crypto, it’s all risky. There are some relatively safe(ish) ways you can make some earnings on your assets. Keeping part of your assets in “savings “ or “locked savings “ or liquidity mining” could be considered safer than lending directly. \n\nBut I was hoping the discussion is not about if one should do it or not but rather experiences of what has worked and what not.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iaaqbyu",
                                    "author": "liquid_at",
                                    "score": 1,
                                    "created_utc": 1653732808.0,
                                    "response": "Unless you provide liquidity to a DEX by giving them 2 different coins, whatever you do, the exchange will use the \"liquidity\" you provided them with to give \"liquidity\" to short-sellers who want to make a buck on the way down.\n\nEither way, you give your coins out of your own hands and no longer have control over them. If the exchange chooses to not pay you back, they won't pay you back. \n\nFeel free to make the experience yourself but do not cry that you haven't been warned when it's gone.\n\nEven at 10% a year it would take you 7 years to double your money and during those 7 years you always have a risk of a 100% loss.. If that's worth it for you, go for it. But be aware of the risk.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iaarw2b",
                                            "author": "mmajass",
                                            "score": 1,
                                            "created_utc": 1653734174.0,
                                            "response": "I have been mining for liquidity for about 18 months with pretty good results. It is better to enter the pool somewhere in the approximate middle, not the top or the bottom to avoid high slippage.\n\nAll in all I have increased my Doge by around 10% without trading.\n\nSo I’m curious who’s done what and what works for some.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "iab0g9s",
                                    "author": "Fulvio55",
                                    "score": 1,
                                    "created_utc": 1653740450.0,
                                    "response": "What has worked?\n\nWell, I lost 11 BTC plus 15 million Doge doing this.\n\nDon’t be me. Really.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iab0mnb",
                                            "author": "mmajass",
                                            "score": 1,
                                            "created_utc": 1653740568.0,
                                            "response": "Wow, liquidity mining? Or how? The specifics could help many.\n\nThanks",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iab1d04",
                                                    "author": "Fulvio55",
                                                    "score": 1,
                                                    "created_utc": 1653741041.0,
                                                    "response": "Lending them out to people.\n\nWho then used the coins to do real world stuff. So when the price exploded, they all imploded. Pretty much the same way Mohland lost the 900+ million in dogetipbot.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iab21lv",
                                                            "author": "mmajass",
                                                            "score": 1,
                                                            "created_utc": 1653741465.0,
                                                            "response": "Interesting, did you use a specific platform for lending directly?",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "iab2ee3",
                                                                    "author": "Fulvio55",
                                                                    "score": 1,
                                                                    "created_utc": 1653741679.0,
                                                                    "response": "BTCjam.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "iab2w8g",
                                                                            "author": "mmajass",
                                                                            "score": 1,
                                                                            "created_utc": 1653741973.0,
                                                                            "response": "Oh, yes, I’ve heard about them but I think they went offline like 2016 or something. \n\nI’m sorry to hear you lost your funds.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "iab3aiq",
                                                                                    "author": "Fulvio55",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653742203.0,
                                                                                    "response": "Thanks. But it’s just money, y’know?\n\nI’d happily swap that and a lot more for this pain to go away. 🤷‍♂️",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iab092j",
                    "author": "Fulvio55",
                    "score": 2,
                    "created_utc": 1653740325.0,
                    "response": "#This is a spectacularly bad idea!\n\nWhat’s on offer is unsecured lending. With YOU carrying all the risk when borrowers default. Many people have lost fortunes this way, and you really don’t want to join them.\n\nPlus, what on earth do you imagine people would borrow your coins FOR, exactly? Why, to short the coin and thereby drive the price down.\n\nIs this really what you want in a misguided attempt to make a few pennies? Absolutely not worth it!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iab1krw",
                            "author": "liquid_at",
                            "score": 1,
                            "created_utc": 1653741176.0,
                            "response": "tell people to send you their coins on the empty promise of you paying them back... they call you a scammer.\n\ngive them a website where they can pay with visa and they transfer their life savings...",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iab27cr",
                                    "author": "Fulvio55",
                                    "score": 2,
                                    "created_utc": 1653741561.0,
                                    "response": "Yep. That’s exactly how it works.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iabqmw5",
                                            "author": "Agreeable-Apricot-36",
                                            "score": 2,
                                            "created_utc": 1653753990.0,
                                            "response": "Love it when you 2 talk some good stuff 👏👏👏👏",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iaegesm",
                                                    "author": "Fulvio55",
                                                    "score": 1,
                                                    "created_utc": 1653806959.0,
                                                    "response": "Hehe. 😎",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "iab1ra9",
                            "author": "mmajass",
                            "score": 1,
                            "created_utc": 1653741283.0,
                            "response": "For the sake of argument, I don’t necessarily think that shorting is the reason for lending.\n\nGiven how easy it is for hedge to borrow against collateral (mostly crypto assets) and move it to traditional financial instruments.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iab2bxo",
                                    "author": "Fulvio55",
                                    "score": 1,
                                    "created_utc": 1653741639.0,
                                    "response": "Because when the price drops, they buy it back at a discount and pocket the profits.\n\nUntil the price goes up instead of down of course. That’s when the wheels fall off.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iac84au",
                    "author": "Successful-Whole4307",
                    "score": 2,
                    "created_utc": 1653762254.0,
                    "response": "This sub is trying to get doge out of the hands of shorters and then someone asks this question...",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}