{
    "subreddit": "Dogecoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uxyei3",
            "title": "Doge",
            "url": "https://i.redd.it/54s9k723oq191.jpg",
            "author": "Economicgod",
            "created_utc": 1653535369.0,
            "score": 130,
            "num_comments": 50,
            "subreddit": "dogecoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "ia0yd2r",
                    "author": "Bar_Mitzvah_MC",
                    "score": 21,
                    "created_utc": 1653537787.0,
                    "response": "Will do nothing. Exchanges have their own massive reserves of coins to lend out if need be. Shorts will still happen without your coins. Use common sense here. Why would an exchange solely rely on users coins to make money on shorts? They keep a stash for this very reason. People can move off the exchange, sell etc and then their ability to provide coins for shorts goes away…no way in hell that is gonna happen. \n\nMove your coins to a cold wallet, ledger if you don’t don’t want to trade. Keep in mind that investors look at number of users that hold a particular coin as a metric to invest. Taking coins off will affect this and could affect price action in dogecoin. Exchanges are a double edged sword.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia13z8s",
                            "author": "Taronyu019",
                            "score": 8,
                            "created_utc": 1653541402.0,
                            "response": "If they want to short the coin then they better buy their own coin to short and not use our coin. At this moment they are using our coins against us.\n\nLet's move our coin to cold storage.\n\nWe are a Doge Nation and we do only good.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia16jct",
                                    "author": "happy2kill4u",
                                    "score": 0,
                                    "created_utc": 1653543213.0,
                                    "response": "That's not why it's going down....... Lol where do u get the idea that the price drop has anything to do with them shorting it????",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia17cg6",
                                            "author": "Taronyu019",
                                            "score": 7,
                                            "created_utc": 1653543797.0,
                                            "response": "The only beings that I know that contradict the fact that exchanges are shorting Doge are those employed by the exchanges or shorting Dogecoin.\n\nWhich one are you?",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "ia10p4s",
                            "author": "Workingclassherois",
                            "score": 2,
                            "created_utc": 1653539227.0,
                            "response": "And Robinhood keeps the “vast majority” of the crypto they hold in cold wallets.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia116we",
                                    "author": "Bar_Mitzvah_MC",
                                    "score": 0,
                                    "created_utc": 1653539545.0,
                                    "response": "Is that still the case now that they allow people to move their coins off? A cold wallet is just a way of saying that there are few transactions in and out. That can certainly change.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "ia12f6s",
                            "author": "Economicgod",
                            "score": -2,
                            "created_utc": 1653540344.0,
                            "response": "OK Mr. genius explain to me mathematically How supply and demand can take an asset that is 80% held . And drop it by 80% mathematically explain to me how supply and demand does that without artificial sale orders. Since you know so much sir. You guys always talk about oh there’s 20 Wallets. But you don’t tell other people to create their own wallets cold wallets and such. I think you cannot answer my question I’m waiting",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia1y4cf",
                                    "author": "comfortablynumb0629",
                                    "score": 3,
                                    "created_utc": 1653565512.0,
                                    "response": "How many new DOGE are created a day? Around 14.4million? So over the last year that’s approximately 5.2Billion new DOGE. Looks like supply is constantly inflating but demand is going no where right now.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia2tcjs",
                                            "author": "HardtoHandle13",
                                            "score": 2,
                                            "created_utc": 1653579976.0,
                                            "response": "Thank you - I never understand this argument about supply and demand, if supply is constantly going up and demand remains stagnant then of course the price will drop. DOGE needs to cultivate more demand and unfortunately, the only real way to do that is to show people there is money to be made.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "ia16o6k",
                                    "author": "happy2kill4u",
                                    "score": 5,
                                    "created_utc": 1653543306.0,
                                    "response": "Did u not see the shells selling off?  All of their doge? Did u not see the market sell off millions and millions??? U don't think that has anything to do with it??? Maybe u should understand how trends work..... And realize it's not a stock it's crypto .......",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia1ovz4",
                                            "author": "liquid_at",
                                            "score": 3,
                                            "created_utc": 1653558744.0,
                                            "response": "If someone sold it, someone else bought it.\n\n100% of all trades are 1 buyer meeting 1 seller.\n\nYou could just as well say millions and millions of coins have been bought... Same thing... \n\nYou cannot sell unless you have a buyer and you cannot buy unless you have a seller...",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia0w9em",
                    "author": "Economicgod",
                    "score": 5,
                    "created_utc": 1653536553.0,
                    "response": "Cold wallet",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia10h84",
                    "author": "FaceBillions24",
                    "score": 2,
                    "created_utc": 1653539086.0,
                    "response": "ok so i see the discussion on both sides here and would add an antidote. When things become more rare bc of scarcity the value increases to collectors. if there where 3 million Mantle rookie cards no one new about and people dump all at once they would be a few dollars but if it trickled there could be some value over time ahaha",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia1a0sa",
                            "author": "shattypantsMcGee",
                            "score": 1,
                            "created_utc": 1653545860.0,
                            "response": "Bitcoin Maxis pulled a similar move.  Exchanges are still whiny about it.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia0uq1r",
                    "author": "MrPunkerton",
                    "score": 2,
                    "created_utc": 1653535696.0,
                    "response": "If you were trying to legitimize a currency….. help cultivate its use and value…… and everyone removed said currency from circulation all at once…… what would happen?? Would said currency begin to crash?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia0vixe",
                            "author": "donkeykongcrusha",
                            "score": 4,
                            "created_utc": 1653536138.0,
                            "response": "If you take $100 out of your checking account and put it into your wallet/purse, are you removing that money from circulation?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia0wohv",
                                    "author": "hello-popleap",
                                    "score": 6,
                                    "created_utc": 1653536795.0,
                                    "response": "That's a false equivalency because if you remove fiat currency from your account the only options are to get money in paper notes which still have redeemable value for goods and services or move it to another bank account.  If you take doge off the exchanges it has no other real world application. I mean what's your long term strategy here? Outside of doge becoming a spendable currency the only value it has is as a speculative token which the exchanges provide a platform for.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia0xcu8",
                                            "author": "donkeykongcrusha",
                                            "score": 2,
                                            "created_utc": 1653537189.0,
                                            "response": "Its not my strategy. Im not the op. But the thought that moving coins onto a private wallet, of any type, would essentially remove them from circulation is just incorrect. All blockchain transactions are traceable.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "ia20bgx",
                                    "author": "JuanLowTechie",
                                    "score": 1,
                                    "created_utc": 1653566857.0,
                                    "response": "Only if you put it in a piggy bank and don't spend it.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia20rod",
                                            "author": "donkeykongcrusha",
                                            "score": 2,
                                            "created_utc": 1653567124.0,
                                            "response": "I still disagree. This logic only makes sense to me, if you render it unusable. Because in a piggy bank, it will eventually be used. So, its still in circulation.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia24nof",
                                                    "author": "JuanLowTechie",
                                                    "score": 1,
                                                    "created_utc": 1653569249.0,
                                                    "response": "Sadly even if you render it unusable, the gov will still print money like there's no tomorrow and dump it into circulation",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "ia0wfg8",
                                    "author": "MrPunkerton",
                                    "score": 0,
                                    "created_utc": 1653536649.0,
                                    "response": "Removing it from a system accounting for its existence?? Yes……. If everyone removed their doge, without putting it into a place that accounts for its existence having the entirety of it on private ledgers/ wallets/ purses would be the same as it not existing at all….. the systems value would be zero…… sure we would know it exists somewhere, but where?? Without a working system that holds value the coins themselves would be worthless",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia0wo8e",
                                            "author": "donkeykongcrusha",
                                            "score": 4,
                                            "created_utc": 1653536790.0,
                                            "response": "That system that accounts for its existence is called the blockchain.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia0x9ju",
                                                    "author": "MrPunkerton",
                                                    "score": 1,
                                                    "created_utc": 1653537135.0,
                                                    "response": "And I get that, again… yes we would know there are amounts places, we could know the potential size of the system in doge coins……. If you removed all the US dollars tomorrow and we all buried them in our backyards what would be the value of the system? We’re all hoarding the dollars and the system isn’t flowing or growing or anything…… my point is for a system to be a system is has to function, not just exist , a systems value is on its perceived function or collectively perceived value, what’s the value of a thing we all effectively throw into a dark hole , the system becomes less valuable, no one’s actually using it in that case…. In that sense a dogecoin would be worth no more than a Beanie Baby",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "ia0y05i",
                                                            "author": "donkeykongcrusha",
                                                            "score": 2,
                                                            "created_utc": 1653537576.0,
                                                            "response": "How many people do you know that are actively making purchases, etc. with any crypto they have sitting in a centralized exchange wallet?",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "ia1rvea",
                                            "author": "yinThebean",
                                            "score": 1,
                                            "created_utc": 1653561186.0,
                                            "response": "It you out it in a non-custodial wallet it will not be taken off of circulation. I have my doge Trust Wallet (it's off of exchanges) yet I still send and receive doge daily. It doesn't have to be a cold storage just simply not left on the exchanges.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "ia148fb",
                            "author": "Taronyu019",
                            "score": 1,
                            "created_utc": 1653541575.0,
                            "response": "So if we keep fiat at home in a shoe box never to be use, fiat will lose its value?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia14t9i",
                                    "author": "MrPunkerton",
                                    "score": 0,
                                    "created_utc": 1653541985.0,
                                    "response": "listen, i'm merely going by the silly post, on June 1st we remove all the doge etc....... and I merely brought it to its logical conclusion..........if it was all removed, the functionality or what little it has, would be halted indefinitely.........this would give its useful value a strictly perceived value.... when a things perceived value is only connected to it's popularity or hype then I postulate that it's as worthless as a beanie baby",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia15c77",
                                            "author": "Taronyu019",
                                            "score": 3,
                                            "created_utc": 1653542361.0,
                                            "response": "I believe you and I know who you are and who you represent but I will give you the benefit of the doubt.\n\nIf you have 500M coins, you can leave 1% in your BNB wallet for any transactions you might want to do and as you need you can transfer from your cold storage to your BNB wallet the same way you always share your coins with the rest of us.\n\nJust saying, unless you don't know how to transfer, send and receive coins. And for that I will share a Youtube video so you can learn.\n\n[https://www.youtube.com/watch?v=53vN-VmFdi0](https://www.youtube.com/watch?v=53vN-VmFdi0)",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia1s8lr",
                                                    "author": "yinThebean",
                                                    "score": 2,
                                                    "created_utc": 1653561467.0,
                                                    "response": "A better option than BNB is to have a non-custodial wallet and a cold storage. No need to use BNB other than to buy and sell your Doge. The big idea is to use a non-custodial wallet and make purchases directly from there transferring from wallet to wallet.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "ia1s29e",
                                            "author": "yinThebean",
                                            "score": 1,
                                            "created_utc": 1653561332.0,
                                            "response": "Removing it from exchanges doesn't mean it wont be usable. Transfers from wallet to wallet still happen. The exchanges are only good to buy and sell your doge. If you are a true believer you will USE Doge directly from your non-custodial wallet.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia0vv3j",
                    "author": "Segi-pump",
                    "score": 1,
                    "created_utc": 1653536330.0,
                    "response": "When u remove from exchanges the shorts can’t borrow your coins and short it",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia0w5hm",
                            "author": "Economicgod",
                            "score": 1,
                            "created_utc": 1653536491.0,
                            "response": "No they can’t my friends no they can’t They are manipulating the market with our tokens you have to know how crypto works my friends they are bidding against a small guy with the small guys money",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia12lsh",
                    "author": "Economicgod",
                    "score": 1,
                    "created_utc": 1653540467.0,
                    "response": "Listen if you have gold my friend they will always tell you to make a chain. Change your perception you’re looking at it from the wrong angle.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia1bc6o",
                    "author": "NotMe01",
                    "score": 1,
                    "created_utc": 1653546906.0,
                    "response": "On May 31 at 23:59 is when bane gets a punch in the face/mouth.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia1lgcl",
                    "author": "voterosticon",
                    "score": 1,
                    "created_utc": 1653555703.0,
                    "response": "Already mine are off the exchange... let's go!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia1qc88",
                    "author": "Exciting-Detail4784",
                    "score": 1,
                    "created_utc": 1653559956.0,
                    "response": "Did that aldready",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia2ikfn",
                    "author": "Nervous_Key_4158",
                    "score": 1,
                    "created_utc": 1653575577.0,
                    "response": "Way ahead of you. Got a nanox drive for my doge and shiryo. It was pretty pricey, but it's definitely worth it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia2psw3",
                    "author": "Jonalethelete",
                    "score": 1,
                    "created_utc": 1653578545.0,
                    "response": "Up",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia2vi3z",
                    "author": "SnooBunnies5730",
                    "score": 1,
                    "created_utc": 1653580830.0,
                    "response": "If you place a rock into a box/ a drawer for an extended period of time...will it turn to gold, to diamond? Where do people come up with these outrageous ideas, what thinking drives your decisions?...🤯",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia30lht",
                    "author": "PhattBallz007",
                    "score": 1,
                    "created_utc": 1653582828.0,
                    "response": "Not your keys, not your coins.  \n\n\nPulling it all offline now. I demand pure ownership. This is going to be a long term hold, might as well keep it safe and under my sole ownership.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}