{
    "subreddit": "Dogecoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uy70tl",
            "title": "WOOOW 💕💕💕",
            "url": "https://i.redd.it/me543jucit191.png",
            "author": "Olivia_Jackson1990",
            "created_utc": 1653569805.0,
            "score": 1,
            "num_comments": 3,
            "subreddit": "dogecoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "ia25sx7",
                    "author": "Money_Hat6",
                    "score": 1,
                    "created_utc": 1653569841.0,
                    "response": "I think it's a really solid idea.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uy6u18",
            "title": "It's all about small steps",
            "url": "https://i.redd.it/bjcuny59dt191.png",
            "author": "Simple_hold_wallet",
            "created_utc": 1653569191.0,
            "score": 211,
            "num_comments": 8,
            "subreddit": "dogecoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "ia24rkx",
                    "author": "hodorlivetothemoon",
                    "score": 2,
                    "created_utc": 1653569305.0,
                    "response": "![gif](emote|free_emotes_pack|joy)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia292tu",
                    "author": "rhodesman",
                    "score": 1,
                    "created_utc": 1653571431.0,
                    "response": "My ramen will be extra tasty!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia29hfv",
                            "author": "DogeDude420",
                            "score": 1,
                            "created_utc": 1653571622.0,
                            "response": "wow u can afford ramen, i wish 😔",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia2h1rl",
                    "author": "teh-reflex",
                    "score": 1,
                    "created_utc": 1653574938.0,
                    "response": "But it tanked again.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uy6u17",
            "title": "🙋🏻‍♂️here.",
            "url": "https://i.redd.it/hv0hkjgngt191.gif",
            "author": "Whatwhat0420",
            "created_utc": 1653569191.0,
            "score": 177,
            "num_comments": 6,
            "subreddit": "dogecoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "ia2cipa",
                    "author": "driverguy8",
                    "score": 4,
                    "created_utc": 1653572998.0,
                    "response": "Hey John, will you help me make a video for Reddit? Yeah, just stand on this rug in a corner of the room, and try to pull it out from under yourself.  \n\nYes, yes you can, just go ahead and try it a few times, \nwait, I gotta start recording.......",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia3htqe",
                    "author": "sourceshrek",
                    "score": 0,
                    "created_utc": 1653589698.0,
                    "response": "Dogecoin had such a pleasant, sunny start didn’t it? ☀️",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uy6s3z",
            "title": "mmmmm",
            "url": "https://i.redd.it/cjn0q5b4gt191.jpg",
            "author": "DOGESNDL",
            "created_utc": 1653569014.0,
            "score": 41,
            "num_comments": 8,
            "subreddit": "dogecoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "ia2qs9v",
                    "author": "liquid_at",
                    "score": 2,
                    "created_utc": 1653578941.0,
                    "response": "Those are the easiest posts... you can just answer them with song-titles...\n\nNo Doubt - Don't Speak",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia2wwnn",
                    "author": "SnooBunnies5730",
                    "score": 2,
                    "created_utc": 1653581384.0,
                    "response": "Set buy at .04",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia3iz72",
                    "author": "Safe-You134",
                    "score": 2,
                    "created_utc": 1653590174.0,
                    "response": "When the markets recover things will go back up.  Duh..  people freak out to easy",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uy6s5r",
            "title": "Relatively New to Crypto - Trying to Access Dogecoin Gifted to Me in Old Wallet",
            "url": "https://www.reddit.com/r/dogecoin/comments/uy6s5r/relatively_new_to_crypto_trying_to_access/",
            "author": "tdf9000",
            "created_utc": 1653569018.0,
            "score": 2,
            "num_comments": 20,
            "subreddit": "dogecoin",
            "selftext": "Hi.\n\nCreated this reddit account to try to get some info from the community (believe me, I've checked a lot of places to try to figure this all out - but my apologies if this is retreading round here).\n\nIn 2013 or so, I'd been gifted a bunch of Dogecoin. Didn't give it another thought until recently when I began dabbling in crypto a bit.\n\nOld wallet was on an old computer, and couldn't get synced with the network. Downloaded Dogecoin Core on a brand new computer, loaded in the old wallet file, and have successfully done a couple of sends to an exchange. But I can't access the Dogecoins that were gifted to me. They show in the wallet, but I can't seem to get to them in order to send. Or withdraw. Or anything.\n\nSo, what do I do to get access to those coins? And can I withdraw to a bank account directly from Dogecoin Core?",
            "stickied": false,
            "comments": [
                {
                    "id": "ia2480l",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653569018.0,
                    "response": "WARNING. NEW ACCOUNT DETECTED. IS THIS PERSON TRYING TO SELL OR BUY DOGECOIN? Are they trying to get you to comment on a T-Shirt? Are they posting fake Twitter images containing links? BE CAREFUL. IT COULD BE A SCAM..\n\nI see you are new here, Welcome to /r/dogecoin. How did you find out about Dogecoin?\n\nDo you have any questions you need answered to help get you started?  \n\nHere are some handy links:\n\n[How to buy Dogecoin](https://www.reddit.com/r/dogecoin/comments/msp3e9/how_to_buy_dogecoin/)\n\n[Using the subreddit tipbot](/r/sodogetip/wiki/index)\n\n[Wallet Help - ELI5](https://redd.it/3b3h5d/)\n\nPlease check the information on the sidebar -->>\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/dogecoin) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia28be6",
                    "author": "tdf9000",
                    "score": 1,
                    "created_utc": 1653571071.0,
                    "response": "Also, why is this \"visible only to me and mods of this community\"?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia2fjwh",
                            "author": "Fulvio55",
                            "score": 1,
                            "created_utc": 1653574309.0,
                            "response": "Cos you’re new.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia2gsmr",
                                    "author": "tdf9000",
                                    "score": 1,
                                    "created_utc": 1653574833.0,
                                    "response": "Okay. Thx.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia2typv",
                                            "author": "Fulvio55",
                                            "score": 1,
                                            "created_utc": 1653580220.0,
                                            "response": "😜",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia2fihl",
                    "author": "Fulvio55",
                    "score": 1,
                    "created_utc": 1653574292.0,
                    "response": "Read the ELI5s. One of them specifically deals with getting keys out of Core.\n\nYou don’t actually need to sync at all BTW. All you need is to instal, run it the first time so it builds its files, then quit and replace the wallet.dat. Make sure that the one you’re swapping in is the most recent backup, because you must make a backup after every transaction, and if you didn’t, some coins may be lost.\n\nSo, having gotten this far, go into the console and use the DUMPWALLET command to create a text file with all your wallets in it.\n\nThis text file becomes your wallet masterfile, and you no longer need core at all. Just grab a copy of the coinb.in website and put it and the text file on multiple removable media stored in safe places. There are also detailed instructions for this if you do some reading in here.\n\nThe text file contains a hundred or more wallets, in three sections.\n\nNamed wallets are the ones you know about, because you requested them or imported them.\n\nChange wallets you don’t know about, and we’re created whenever you sent coins, to receive any change. These are also the reason you needed to do constant backups.\n\nReserve wallets are empty, unused new wallets. If you look them up on bitinfocharts, you will get blank pages.\n\nSo, just look up the wallets on bitinfocharts to find their balances, and comment them appropriately in the text file. Rinse and repeat.\n\nThat’s it. Those two files are all you need. And if you want to send coins, make sure you go offline to sign the transactions so as to never expose your keys to the internet.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia2hb71",
                            "author": "tdf9000",
                            "score": 1,
                            "created_utc": 1653575047.0,
                            "response": "Thanks a million for the reply. I'll look into all this later tonight. If I never \"locked\" it (or whatever the terminology is), do I need to get \"keys\" out of the original program? Btw, I don't think this old program from 13 was even called \"Core\". Just \"Dogecoin Wallet\" or something. To play it safe, I did get Core now. Took like 30+ hours to get everything all synced up. Insane.\n\nI can actually see the coins in there. Just can't seem to do anything with them.\n\nAlso, I did try this bitinfo thing. Says \"invalid wallet\" or similar.\n\nThanks again. Appreciate you guys all looking out for each other.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia2v21v",
                                    "author": "Fulvio55",
                                    "score": 1,
                                    "created_utc": 1653580653.0,
                                    "response": "If you password protected it, you would need to unlock it before you could export the keys. But you didn’t, so that’s fine.\n\nCore used to be called QT back then. And as I said, there was no need to get it synced up first.\n\nSo, the way it works is that it will add up all the balances from all the wallets it knows of, provided it can find at least one transaction from each. But because of this it often lies. Only the blockchain itself is the definitive authority.\n\nIf bitinfocharts is saying that, you may have the wrong coin selected. Bitcoin maybe. In which case it won’t recognise a doge address. Here, for example, is the #1 richest wallet:\n\nhttps://bitinfocharts.com/dogecoin/address/DBs4WcRE7eysKwRxHNX88XZVCQ9M6QSUSz\n\nYou could just swap that address with yours in the url, or put your address in the search box.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia4p3l8",
                                            "author": "tdf9000",
                                            "score": 1,
                                            "created_utc": 1653608593.0,
                                            "response": "Ugh.\n\nWhole process is a bit of a headache for me as I'm not really code-savvy. Very anxious about botching this.\n\nFor the wallet dump, I'm trying these instructions now:\n\n[https://www.reddit.com/r/dogecoin/comments/kuftro/eli5\\_dumping\\_your\\_wallet\\_from\\_dogecoin\\_core/](https://www.reddit.com/r/dogecoin/comments/kuftro/eli5_dumping_your_wallet_from_dogecoin_core/)\n\nWhen I type in the command \"dumpwallet walletdump.txt\" I get the following error:\n\n\"Cannot open wallet dump file (code -8)\"\n\nDoes this mean that I did in fact password protect it? Or is it another problem entirely?\n\nP.S. Per recommendation, I disabled internet access on that computer during this process.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia54j7e",
                                                    "author": "Fulvio55",
                                                    "score": 2,
                                                    "created_utc": 1653616146.0,
                                                    "response": "It means that it’s really really picky about the pathname. It has to be complete, and capitalisation matters. On a PC, it even has to be C:, not c:.\n\nOh, and the file can’t already exist either.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "ia7a0vx",
                                                            "author": "tdf9000",
                                                            "score": 1,
                                                            "created_utc": 1653664393.0,
                                                            "response": ">https://www.reddit.com/r/dogecoin/comments/kuftro/eli5\\_dumping\\_your\\_wallet\\_from\\_dogecoin\\_core/\n\nI don't see an existing file in any folder (assuming I was looking in the right places on this new computer). So thinking it's not that. Did try all caps in the Console command:\n\n\"DUMPWALLET walletdump.txt\"\n\nDifferent error this time: \"Method not found (code -32601)\n\nThank you for your patience on this...",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "ia9a627",
                                                                    "author": "Fulvio55",
                                                                    "score": 1,
                                                                    "created_utc": 1653696994.0,
                                                                    "response": "You didn’t specify the complete pathname.\n\nI have no idea why it’s so anal about this. It would make much more sense to have a default location like the way most things work, but there you have it.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "iadp4d6",
                                                                            "author": "tdf9000",
                                                                            "score": 1,
                                                                            "created_utc": 1653788804.0,
                                                                            "response": ">https://www.reddit.com/r/dogecoin/comments/kuftro/eli5\\_dumping\\_your\\_wallet\\_from\\_dogecoin\\_core/\n\nBecoming an epic project here. So many articles referenced (a remarkable number of them right here in Reddit).\n\nError after error in trying to the wallet dump—even with many, many tweaks of the pathname for precision. Out of curiosity, I tried this walletpassphrase release, and something actually came up. Perhaps it was password-protected all along? So then I tried \"walletpassphrase <thepassphraseitself>\" in an effort to unlock the wallet (if it was locked), and got this error:\n\n\"Error: running with an unencrypted wallet, but walletpassphrase was called (code -15)\"\n\nIf I have an unencrypted wallet, why would a private key have generated at all?\n\nP.S. If I ever manage to get access to my Doge, I'll tip you. Gah.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "iaegxmw",
                                                                                    "author": "Fulvio55",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653807405.0,
                                                                                    "response": "Doesn’t look like the wallet’s locked, so that error makes sense.\n\nI just had a look at that post by /u/digitalsteven1 and I’m surprised he didn’t mention the explicit pathname actually.\n\nDo some more searching in here, because a number of people have told me the exact syntax for a PC (I only do Apple stuff myself). Can’t recall offhand if quotes were required, but definitely it starts with C:\\whatever\n\nOr, I guess we could just bother /u/patricklodder since he’d certainly know.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "iaf38em",
                                                                                            "author": "tdf9000",
                                                                                            "score": 1,
                                                                                            "created_utc": 1653826425.0,
                                                                                            "response": "Unbelievable. The dumpwallet file was finally created (someone here on Reddit pointed out that it just gets created in a default folder—despite whatever error you may receive; evidently, this is due to some permissions setting in Core).\n\nThere seem to be dozens of options for accessing the funds from here. I'm considering using Exodus. Also interested in that [coinb.in](https://coinb.in) though. All seem to require inputting the private keys on the Internet tho. I thought that was a huge no-no.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "ia4sh58",
                                                    "author": "tdf9000",
                                                    "score": 1,
                                                    "created_utc": 1653610259.0,
                                                    "response": "Just to add:\n\nWhere the old coins are visible to me is in the \"Transactions\" display. But they don't seem to be in the home \"Wow\" window where Balances are shown. I was able to send coins to and from the current DC wallet. But those were just tiny test amounts. My mission is to access the transactions from '13.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "ia4ywv6",
                                                            "author": "tdf9000",
                                                            "score": 1,
                                                            "created_utc": 1653613401.0,
                                                            "response": "And the wallets and their values (with transaction dates and everything) do display in the bitinfocharts, btw. I feel like I'm so close on this.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}