{
    "subreddit": "Dogecoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "usvbaf",
            "title": "Soul of Doge",
            "url": "https://www.reddit.com/r/dogecoin/comments/usvbaf/soul_of_doge/",
            "author": "Coyoteaus",
            "created_utc": 1652934583.0,
            "score": 2,
            "num_comments": 3,
            "subreddit": "dogecoin",
            "selftext": "It's not all about our money or our greed , our money can support others and sustain a better world for all. Our planets economies are out of balance. Care not is your karma. Please focus Doge's power on or worlds people and their impoverished  lives and avoid promotional  1st world premotions to attract funding to Doge.  Nascar lame. We go bigger. International aspirations Elon has a plan to enable the worlds  unbanked thru Doge radio Doge, to build economy and trade to better world wide citizens lives. Doge we need to feed our worlds poorest citizens. Putin's war on the worlds most impoverished people  needs to be addressed.\n\nWe Do Only Good Every ----- Day\n\nDon't care it's all about me and what's I want, Realize that if you are living in a 1st world economy, you can go and lye down in a gutter, and your community/ government, will pick you up and feed you ,house you  and care for you.\n\nThis is not the case in the rest of the world.. you die . We can help change this.\n\nVitalik searches out causes to support and yet misses the immediate crisis facing our world. We need food for our most afflicted communities. \n\n&#x200B;\n\n&#x200B;",
            "stickied": false,
            "comments": [
                {
                    "id": "i961q7g",
                    "author": "Coyoteaus",
                    "score": 1,
                    "created_utc": 1652936607.0,
                    "response": "I am lucky to live in a society that will pick me up and feed me / house me and sustain my life.  \nto what end is a mystery, but I live unlike millions of others and thats what we need to address.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}