{
    "subreddit": "Dogecoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uriglf",
            "title": "If you still believe Ęlon has any influence at all but negative have you all forgotten snl? The anonymous vs Ęlon call? Whether doge is in the cross hairs is whether it's perceived as such.",
            "url": "https://www.reddit.com/r/dogecoin/comments/uriglf/if_you_still_believe_ęlon_has_any_influence_at/",
            "author": "neomancr",
            "created_utc": 1652779165.0,
            "score": 0,
            "num_comments": 4,
            "subreddit": "dogecoin",
            "selftext": "Reddit is cyber segregated to all hell with blocklisting and shadow banning.\n\nhttps://youtu.be/TVXtqesR29s\n\nEver notice how oddly square the charts suddenly become on the doge side? Look back at our completely transparent demos. We have never ONCE failed. If you don't believe in crowd power it's only because you've been prevented from seeing it. \n\nThis is just a tiny example of how we cracked the 9c ceiling in call. \n\n\nhttps://youtu.be/v2CCcBc5CY4\n\nCheck the description : https://i.imgur.com/WAc43Rn.jpeg\n\nIt's up to us. The only reason why anyone would believe Elon has any control or is at all working in your interest is because of the shadow banning of posts and block listing.\n\nHe was credited for the reversal recently when it was posted here and began on 5 minutes from the time the post was submitted. Typically we lay out plans an entire day in advance and have run multiple demos across multiple days.\n\nThis is the typical precision. The post warning of what would happen to LTC and the stocks citing entering market hours Monday was posted Sunday night.\n\nhttps://imgur.com/gallery/VBuTk6L\n\nAnd the subsequent reversal as well.\n\nhttps://imgur.com/a/9gnICVt\n\nThe goal was to sabotage the p and d that was planned on Monday with news such as that article dropping Monday.\n\nDoge held stable against what would have been an orchestrated p and d.\n\nThe most recent demo can be found in this handles post history stated on Sunday to ride the coins edge and consolidate since the prior action was a reversal and stability would prevent it from becoming an inadvertent p and d.\n\nhttps://www.reddit.com/r/dogecoin/comments/uq4ytd/keep_up_the_good_work_guys_its_sunday_morning_as\n\nhttps://imgur.com/a/lFUsSiH\n\nHere was the major reversal where I personally threw money in to simmer down the attack to sink 3lon since it'd gone too nutso.\n\nhttps://imgur.com/a/TFF1ZRp\n\nYou can see when we acted versus when he tweeted and was attributed credit in the bottom picture.\n\nWho would believe that his tweet did anything when it was literally 14 hours later 80 percent through. You'd only believe it if you never checked.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8xh6oy",
                    "author": "liquid_at",
                    "score": 1,
                    "created_utc": 1652783083.0,
                    "response": "We've been warning that pump&dump groups will dump after SNL a couple weeks before it happened.\n\nBitcoin started its decline a week before SNL aired.\n\nThe crypto-market dumped an hour before SNL. \n\nIf you believe the meme, you believe the meme. If you look into facts, you check your bias and don't fall for the media-BS that they try to shove down your throat.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}