{
    "subreddit": "Dogecoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uxk81e",
            "title": "I fixed his smile, better?",
            "url": "https://i.redd.it/h9jugnuf7n191.png",
            "author": "GroundbreakingSky169",
            "created_utc": 1653493497.0,
            "score": 1,
            "num_comments": 0,
            "subreddit": "dogecoin",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uxkj20",
            "title": "Dogecoin (DOGE): What You Need To Know",
            "url": "https://www.reddit.com/r/dogecoin/comments/uxkj20/dogecoin_doge_what_you_need_to_know/",
            "author": "BitcoinWide",
            "created_utc": 1653494371.0,
            "score": 4,
            "num_comments": 4,
            "subreddit": "dogecoin",
            "selftext": "**Who let the Doge out?**  \n\n\nThe price of cryptocurrency Dogecoin has risen by eye-popping amounts since the start of the year – and its rise has been given further impetus by rumours swirling around the crypto world that Elon Musk, who has supported Dogecoin in the past, might incorporate the currency into his future corporate expansion plans.  \n\n\nDoes this means investors should be piling in, even if it was originally created as a joke version of Bitcoin? Or is now the moment to steer clear in anticipation of a major price correction?  \n\n\n**But what is Dogecoin?**  \n\n\nWhich brings us on to Dogecoin, a cryptocurrency popular with amateur investors that’s based on an internet ‘meme’ (a witty or memorable online phrase or image). The meme, of a type of Japanese dog called Shibu Inu, has subsequently become the cryptocurrency’s mascot.  \n\n\n**Who created Dogecoin?**  \n\n\nDogecoin (trading ticker DOGE) was invented in 2013 by IBM software engineer Billy Markus and Adobe software engineer Jackson Palmer. Their aim was to create a joke version of the already established Bitcoin to give the public a friendly way to get to grips with the world of crypto-assets.  \n\n\nTo the engineers’ surprise, people started using Dogecoin as soon as the product was released. Crypto experts, however, claim the cryptocurrency’s underlying technology and overall usefulness is not on a par with the likes of Bitcoin and Ethereum.  \n\n\n**How has Dogecoin performed?**  \n\n\nIf Dogecoin started off as a joke, figures underpinning the cryptocurrency are deadly serious. Dogecoin’s value has risen by more than 14,000% since the start of 2021. Dogecoin’s price is currently around 0.60$, while the price tracking website CoinMarketGap puts its market capitalisation at around $78 billion, making it the fourth largest cryptocurrency. In comparative terms, however, it remains a relative minnow behind the big two: Bitcoin at $1.1trillion and Ethereum at $405billion respectively, with Binance Coin coming in at just under $100million.  \n\n\n**What’s triggered Dogecoin’s surge?**  \n\n\nDogecoin’s standing has been enhanced by tongue-in-cheek endorsements from high-profile showbusiness names including rapper Snoop Dogg and Gene Simmons, front man of rock group Kiss.  \n\n\nMore significantly, a 2019 Twitter poll decided Elon Musk should be Dogecoin’s chairman. The Tesla boss saw the funny side and, since then, has played along with the exercise, issuing supportive tweets saying Dogecoin is his favourite cryptocurrency.  \n\n\nWith his personal Twitter account boasting 53 million followers, even a fleeting pro-Dogecoin comment from Musk has the effect of bolstering the cryptocurrency’s popularity and therefore its investment appeal.  \n\n\nIn a recent tweet Musk went so far to describe himself as ‘The Dogefather’.  \n\n\n**How to buy Dogecoin?**  \n\n\nAs Dogecoin’s popularity has increased, so its availability has widened. UK investors can buy the cryptocurrency using their debit/credit card on an exchange such as Binance.  \n\n\nIn recent days, online providers Gemini and eToro have also both announced that Dogecoin can now be bought via their platforms, thus expanding the potential number of investors who may decide to get on board.  \n\n\nIn the case of eToro, investors have the option to buy Dogecoin tokens or trade derivatives based on the underlying cryptocurrency price.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9yc80h",
                    "author": "coyote1276",
                    "score": 2,
                    "created_utc": 1653496432.0,
                    "response": "To the moon...",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}