{
    "subreddit": "Dogecoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uvlmlu",
            "title": "How is doge different from pyramid scheme? [ May get flagged ]",
            "url": "https://www.reddit.com/r/dogecoin/comments/uvlmlu/how_is_doge_different_from_pyramid_scheme_may_get/",
            "author": "Ok_Tomorrow_9762",
            "created_utc": 1653257711.0,
            "score": 0,
            "num_comments": 6,
            "subreddit": "dogecoin",
            "selftext": "Those who joined on the hype early, made lot of money, the later someone join, the more they lose. The only way to keep up with it is if the hype grows forever.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9m5x5l",
                    "author": "ElonaMusk212",
                    "score": 1,
                    "created_utc": 1653257988.0,
                    "response": "Remove this post.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9m6a4l",
                    "author": "sg-doge",
                    "score": 1,
                    "created_utc": 1653258161.0,
                    "response": "so everyone who invested in a company the last century and hodled made a lot of money, the later someone join the more they have to pay for it (not lose)\n\nand the last sentence ist just wrong...you didnt say anything that qualifies doge as a pyramid scheme. your statements are wrong. of course early investors make the most profit - they also have the biggest risk. in the early days people bought graphics cards and mined doge for a long time. at this time they couldnt know where it would go.\n\nso what exactly are the features of a pyramid scheme? early investors get most return? ...that's for all investments!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9m6g4b",
                            "author": "Ok_Tomorrow_9762",
                            "score": 1,
                            "created_utc": 1653258241.0,
                            "response": "Companies have an intrinsic value they offer services, what is doge offering?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9m6ono",
                                    "author": "GretaTheJetta",
                                    "score": 1,
                                    "created_utc": 1653258358.0,
                                    "response": "Utility.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9m784e",
                    "author": "KAEA-12",
                    "score": 1,
                    "created_utc": 1653258630.0,
                    "response": "Person. Doge has been a tipping coin for years. It just so happens it’s fundamentals (135 B and yearly growth rate) make it suitable as a currency use.\n\nCrypto is about escaping taxation and universal (not government controlled) case use. A new financial system/option for all.\n\nThe adoption of such as a currency is still developing and way early in its years. \n\nTherefore, if continued growth and use in this new form of currency is successful, than yes early investors will get more value as more people want it’s use. Raising the value of the still limited (but not rare like BTC as example) 135-140B supply.\n\nAnd there is so much more to it. \n\nMonetary systems are fake. They are what people themselves value. The dollar bill value can go up and down. It’s paper you value…but not even any more. It’s all digital in your bank systems now. Just numbers on a screen.\n\nThis is not anti-government rhetoric or attitude I share. Just simple truth, briefly described in response to your post.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uvlgj1",
            "title": "No one is alone🙌🖖",
            "url": "https://i.redd.it/fmgxfjbxo3191.jpg",
            "author": "Level_Currency7450",
            "created_utc": 1653257193.0,
            "score": 16,
            "num_comments": 2,
            "subreddit": "dogecoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9nr7vf",
                    "author": "Superschanti",
                    "score": 2,
                    "created_utc": 1653291956.0,
                    "response": "Angst und Gäld hani keins",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}