{
    "subreddit": "Dogecoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "urglfl",
            "title": "Terra Founder Do Kwon Blocks Doge Founder Billy Markus, Doge Founder Responds",
            "url": "https://thecryptobasic.com/2022/05/17/terra-founder-do-kwon-blocks-doge-founder-billy-markus-doge-founder-responds/",
            "author": "HabileJ_6",
            "created_utc": 1652770683.0,
            "score": 3,
            "num_comments": 4,
            "subreddit": "dogecoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8x685o",
                    "author": "michaelburgos",
                    "score": 2,
                    "created_utc": 1652773204.0,
                    "response": "I blocked him as well 😂 I love dogecoin but the developer annoying af",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8x6be7",
                            "author": "wicked_skeng_man",
                            "score": 1,
                            "created_utc": 1652773282.0,
                            "response": "Facts. CONSTANTLY complaining about people complaining. 🤔",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8xfdpy",
                    "author": "nitesh1568855",
                    "score": 1,
                    "created_utc": 1652781570.0,
                    "response": "💋Sex2earn💋\n\n🚀Fair Launch on Thursday 3PM UTC\n🔞Live strip show by Ashley before launch\n👄Sex2earn- Blockchain Amateur Porn Platform by $SEX token\n✅Upload ur video for free & get paid in $SEX\n✅Watch ur favorite videos\n✅KYC Audit\n\n#crypto #BSC #BNB\nTG & TW: @Sex2Earn",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "urglcs",
            "title": "‎So how much influence does Flon's \"words\" have these days...",
            "url": "https://www.reddit.com/r/dogecoin/comments/urglcs/so_how_much_influence_does_flons_words_have_these/",
            "author": "neomancr",
            "created_utc": 1652770672.0,
            "score": 0,
            "num_comments": 4,
            "subreddit": "dogecoin",
            "selftext": "Reposted since the og post was shadow banned / block listed in less than a second. Then the posts within while the post was invisible were botted just the same. \n\n\nhttps://imgur.com/a/0KymbGi\n\nKinda seems like. Maybe you'll change your mind later then news bots will claim your tweet caused something. If this isn't your intention then disavow it.\n\nCheck out the comments. I went ahead and uses it as an opportunity to show how social media works. \n\nCheck the comment count. Log out and refresh.\n\nHere's how bot brigades work and how subs become spammed to oblivion.\n\nhttps://youtu.be/TVXtqesR29s\n\nComment 1: below that only appears to some (trolls usually) \n\nDuring the reversal credit was attributed to you for the reversal 14 hours after we started it which was literally less than 5 minutes after announcement.\n\nWe conducted a demo yesterday not to pump or dump but ride the coins edge and consolidate around 9c.\n\nRight at the start it shot up past 9c, it was meant to be a demo through out the entire day so I reminded everyone to \"not be icarus this was a full day demo. 6am ny crew to 6pm wc crew.\n\nhttps://imgur.com/a/lFUsSiH - again, we literally have never failed. Even though we literally publicly state our goals the day prior leaving is really vulnerable to sabotage. \n\nWithin the demo there's narration which shows what needed to happen to fulfill the goal which were sub tasked completed as called for in sequence fulfilled and it's anticipated effects happen accordingly. LTC was called out as a source of arbitrage weighing down doge... We stated that if it would persist we'd have to do something about that... So as the crew held doge steady, we slammed LTC down 2 percent in about 1 minute. \n\nhttps://imgur.com/a/31OfZe4\n\nAfter which we stated that that should lighten the load on doge since LTC's rebound would cause a rise in doge from LTC new lower position.\n\nWhich is followed up by a post of that happening just as called by the post above. \n\nThats crowd power.\n\nComment 2 (same):\n\nThe reason why we give ourselves the extra challenge of giving warning the day prior and calling all our actions before they happen is for the sake of transparency and to demonstrate how things really work.. AND to show crowd power versus billionaires. \n\nhttps://www.reddit.com/r/dogecoin/comments/uq4ytd/keep_up_the_good_work_guys_its_sunday_morning_as\n\nAll time stamped unedited and in sequence.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8x3fkr",
                    "author": "neomancr",
                    "score": 1,
                    "created_utc": 1652770765.0,
                    "response": "Original post. In case you were curious. We need to take the sub back from the bot brigading. Mods please help.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8x4bwm",
                    "author": "monkeybuttsauce",
                    "score": 1,
                    "created_utc": 1652771524.0,
                    "response": "I love flon. I can never make it right myself. Always falls down :/",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8x8u72",
                            "author": "neomancr",
                            "score": 1,
                            "created_utc": 1652775605.0,
                            "response": "It's still good. That's what the honey Carmel or coffee and condensed milk is for.\n\nLon Lon ranch has good condensed milk.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8xfe1q",
                    "author": "nitesh1568855",
                    "score": 1,
                    "created_utc": 1652781578.0,
                    "response": "💋Sex2earn💋\n\n🚀Fair Launch on Thursday 3PM UTC\n🔞Live strip show by Ashley before launch\n👄Sex2earn- Blockchain Amateur Porn Platform by $SEX token\n✅Upload ur video for free & get paid in $SEX\n✅Watch ur favorite videos\n✅KYC Audit\n\n#crypto #BSC #BNB\nTG & TW: @Sex2Earn",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "urggjn",
            "title": "Get your Doge off of the exchanges, stop the shorts!",
            "url": "https://i.redd.it/w6qu9puigzz81.png",
            "author": "Consistent-Papaya688",
            "created_utc": 1652770096.0,
            "score": 53,
            "num_comments": 11,
            "subreddit": "dogecoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8x71hn",
                    "author": "Fulvio55",
                    "score": 7,
                    "created_utc": 1652773939.0,
                    "response": "Again with the misinformation.\n\nGet your Doge off exchanges. Because Not your Keys, Not your Coins.\n\nTo stop the shorts, stop lending them coins thinking you’re somehow ‘staking’.\n\nTwo completely different things.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8xkpnz",
                            "author": "liquid_at",
                            "score": 1,
                            "created_utc": 1652785757.0,
                            "response": "some exchanges have small-print allowing them to lend out your coins in their name.\n\nThe exchange takes the risk and the reward and you often don't even know it.\n\nEither way... Not your keys, not your coins and whatever an exchange does with your coins is out of your hand. Whether they lend it out or do whatever with it... the only way to make sure you have control over your coins is to take control over your coins and move them into a proper wallet.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8xp7ff",
                                    "author": "Aaron--Wu",
                                    "score": 1,
                                    "created_utc": 1652788693.0,
                                    "response": "Hello, please ask me a question. If I don't lend out my doge, can the exchange also occupy my doge?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8xpq30",
                                            "author": "liquid_at",
                                            "score": 1,
                                            "created_utc": 1652789000.0,
                                            "response": "If you give your coins to the exchange the exchange can do with it whatever they want.\n\nIt's not a security so they are not required to care for your investments.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8xrbbc",
                                                    "author": "Aaron--Wu",
                                                    "score": 1,
                                                    "created_utc": 1652789930.0,
                                                    "response": "thank you",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8x8kgp",
                    "author": "luzer___",
                    "score": 6,
                    "created_utc": 1652775355.0,
                    "response": "But the message is good advice, get your coins off the exchanges.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8x8ydg",
                    "author": "Consistent-Papaya688",
                    "score": 2,
                    "created_utc": 1652775708.0,
                    "response": "Another recommended video:\n\nhttps://www.youtube.com/watch?v=VhFomsACduw",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8x42mz",
                    "author": "Bi0H4z4rD667",
                    "score": -1,
                    "created_utc": 1652771299.0,
                    "response": "You are not elon the puppeteer. People are not going to do what you say because you write “this is the way”.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8xaroh",
                            "author": "neomancr",
                            "score": 0,
                            "created_utc": 1652777399.0,
                            "response": "He puppeteers nothing. He literally had news bots claim credit for a reversal we started here at 530am which only took about 5 people from what I saw and 5 minutes.\n\nhttps://imgur.com/a/TFF1ZRp\n\n14+ hours later after the reversal was 80% through credit is attributed to his tweet. Lol... Anyone who has ever thought he had any real influence has been scammed. His tweets have always been late after money was already thrown in and the pump was already clearly too high anyone should buy. The only reason why he would tweet was to draw in those to be left holding the bag. \n\n\nWe ran a full day long demo that was stated before hand with the clear goal of this time not driving the value up or down but to ride the coins edge and consolidate around 9c.\n\nhttps://www.reddit.com/r/dogecoin/comments/urfipq/so_how_much_influence_does_flons_words_have_these\n\nYou can see the literal full day play by play in sequence of every action called before during and after its been completed and I don't mean his stupid fake line go up line go down bs.\n\nWe demonstrate the manipulation fully transparently to show how it really works. I. E. Spitting flow patterns then crushing a arbitraged looting valve to cause doge to rise by up from the rebound of the what was leeching.\n\nLook through our post history. I'm just a messenger. We've ran countless demos as long as 3 days and we have never once failed. Our only goal was to fulfill on what the original reaction to his attempt to exploit this sub was, to sabotage him and reveal the manipulation. Beyond that all we aim for is stability.\n\nWhen we do reversals we follow with a phase of consolidation specifically because we don't intend to pump and dump and we do it all with full transparency announcing everything before we do it. And we always follow through.\n\nReddit is cyber segregated to all hell with blocklisting and shadow banning.\n\nhttps://youtu.be/TVXtqesR29s\n\nhttps://youtu.be/v2CCcBc5CY4\n\nCheck the description : https://i.imgur.com/WAc43Rn.jpeg\n\nThe only reason why you would believe Elon has any control or is at all working in your interest is because of the shadow banning of posts and block listing.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "urgh6j",
            "title": "Meh I’ll stick with dogecoin, stocks are doodoo",
            "url": "https://i.redd.it/pya8e5orgzz81.jpg",
            "author": "hardsun_",
            "created_utc": 1652770174.0,
            "score": 5,
            "num_comments": 2,
            "subreddit": "dogecoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8xzwd3",
                    "author": "Odd-Fisherman5674",
                    "score": 1,
                    "created_utc": 1652794381.0,
                    "response": "I uh gree",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}