{
    "subreddit": "Dogecoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uw4f0l",
            "title": "Moving crypto from coinbase to coinbase wallet?",
            "url": "https://www.reddit.com/r/dogecoin/comments/uw4f0l/moving_crypto_from_coinbase_to_coinbase_wallet/",
            "author": "Ok_Jellyfish2247",
            "created_utc": 1653323981.0,
            "score": 1,
            "num_comments": 10,
            "subreddit": "dogecoin",
            "selftext": "Hi guys I just watched something about coinbase using users assets in case of bankruptcy. After watching this I want to move my crypto from a hot to cold wallet. Can I move my coins from the coinbase exchange to coinbase wallet and not have to worry about this? Or should I transfer to another wallet. What’s the way to go?",
            "stickied": false,
            "comments": [
                {
                    "id": "i9p9kp4",
                    "author": "NewConsideration3210",
                    "score": 3,
                    "created_utc": 1653324236.0,
                    "response": "Another wallet.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9p9s8c",
                            "author": "Ok_Jellyfish2247",
                            "score": 2,
                            "created_utc": 1653324321.0,
                            "response": "What would you recommend? Would there be fees associated?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9pbju5",
                                    "author": "Pooshonmyhazeer",
                                    "score": 3,
                                    "created_utc": 1653325059.0,
                                    "response": "For Dogecoin use the MyDogeWallet. \n\nCoinbase wallet is fine too as it’s your wallet and they can’t touch that crypto either. \n\nBut MyDoge for doge!\n\nAlso you should keep all your “hard savings” offline in a Hardware wallet like Trezor or Ledger",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9pcp98",
                                            "author": "Royal-Author-669",
                                            "score": 2,
                                            "created_utc": 1653325539.0,
                                            "response": "This is exactly the same thing I would have put.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9pbsad",
                                    "author": "liquid_at",
                                    "score": 2,
                                    "created_utc": 1653325158.0,
                                    "response": "A \"wallet\" is an address on the blockchain. \n\nThe only fees that exist are for transactions. \n\nthe biggest cost you will face is the fee binance takes for allowing you to move them out. (5 doge iirc)\n\ncheapest is a simple text-wallet (see pinned posts in daily thread). But any free wallet app that supports doge can create those wallets and the wallet itself is always the same thing, an address on the blockchain.\n\nThe only thing the application itself does is encrypt your key so it can't be stolen and send your transfer-requests to the blockchain. That's all. \n\nDon't think too complicated. It's about as easy to do as a free email account.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9qw45l",
                                    "author": "bricklewood",
                                    "score": 1,
                                    "created_utc": 1653350298.0,
                                    "response": "Or get Dogecoin core to run a note, and also to print a paper wallet (cold wallet) to keep it safe from the internet",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9pajyi",
                    "author": "NewConsideration3210",
                    "score": 3,
                    "created_utc": 1653324640.0,
                    "response": "Trezor or Ledger. Buy directly from the source and write your seed phrase down on a piece of paper. Store it in a safe place.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9pfj4t",
                            "author": "Disastrous-Ad6644",
                            "score": 2,
                            "created_utc": 1653326731.0,
                            "response": "This is the way",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9r0bjo",
                    "author": "Fulvio55",
                    "score": 2,
                    "created_utc": 1653352406.0,
                    "response": "#For heaven’s sake…. WHY?\n\nThat’s like putting your money in some random stranger’s pocket, then moving it from his left pocket to his right. It still isn’t your pocket.\n\nRoll yourself up a big bunch of text wallets. Put them in a text file. Go to coinb.in and grab a copy of the site. Put both files on a USB stick.\n\nThen pick one wallet, add ‘Coinbase’ as a comment, and send your coins there.\n\nAnd you’re all done. Make copies of the files on multiple removable media. Stash them in safe places so a fire or flood won’t destroy them all. Congratulate yourself on having secure, FREE cold storage. Feel free to laugh at people who buy expensive hardware devices that aren’t as good as what you now have.\n\nFeel free to play with coinb.in using any wallet at all. Maybe RH’s cold wallets even. But don’t use your own wallets live. Only sign transactions offline so you never expose your keys to the internet.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}