{
    "subreddit": "Dogecoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uw8n10",
            "title": "Technical Analysis Suggests That DOGE Price Will Fall In Next 24H: Do You See It Happening?",
            "url": "https://www.reddit.com/r/dogecoin/comments/uw8n10/technical_analysis_suggests_that_doge_price_will/",
            "author": "Bria_Hartley4567",
            "created_utc": 1653335270.0,
            "score": 11,
            "num_comments": 4,
            "subreddit": "dogecoin",
            "selftext": "The number 10 place on CoinMarketCap’s list of the biggest cryptos by market cap, Dogecoin (DOGE), has seen a slight price gain in the last 24 hours according to the crypto market tracker. \n\n At the time of writing , the price of DOGE is around $0.08699, which is a 2.52% price increase compared to what it was 24 hours ago as tokens saw a bit of an upsurge yesterday with Luna gaining over 50%, Bobcoin seeing double figures in price increase percentage as well as FTM. \n\n  Despite that, the weekly performance of Dogecoin has seen it at a loss, however, as its price dropped 4.58% over the last 7 days. This has in any case seen DOGE strengthen against Bitcoin (BTC) and Ethereum (ETH). Currently, 1 DOGE is worth 0.0.000002876 BTC and 0.0000428 ETH. This means that DOGE has strengthened 0.31% against BTC and 0.24% against ETH. \n\n A descending triangle has formed on the 4 hour chart for DOGE/USDT, which is a bearish indicator. \nThis is because the price of DOGE has posted lower highs while bouncing from the $0.0845 level in the last 2 days but has surpassed it now. Should the price of DOGE break below the $0.0845 level again, we could see DOGE drop to as low as $0.075. Do you feel it will come back?",
            "stickied": false,
            "comments": [
                {
                    "id": "i9q0g5c",
                    "author": "liquid_at",
                    "score": 10,
                    "created_utc": 1653335645.0,
                    "response": "look at bitcoin... \n\nGlobal economy is still on course to break a new record for worst time in history. We're just a few weeks out and it does not look like the financial markets want to give up on that record.\n\nGreat time to buy cheap but horrible time to watch tickers.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9qjpci",
                            "author": "JustShellz",
                            "score": 3,
                            "created_utc": 1653344251.0,
                            "response": "![gif](giphy|X6lrsqspAJIcybTo9L|downsized)",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}