{
    "subreddit": "Dogecoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uwzyq1",
            "title": "Dogecoin Creator Schooled Binance CEO on History of Cryptocurrency Market",
            "url": "https://www.reddit.com/r/dogecoin/comments/uwzyq1/dogecoin_creator_schooled_binance_ceo_on_history/",
            "author": "Megan76566",
            "created_utc": 1653423429.0,
            "score": 17,
            "num_comments": 6,
            "subreddit": "dogecoin",
            "selftext": "Billy Markus, the creator of Dogecoin, retweeted Binance CEO Changpeng Zhao's tweet about the meaning of the famous \"HODL\" internet meme. Zhao mistook HODL for \"Hold On for Dear Life,\" but the Dogecoin founder was quick to correct the CEO of one of the world's largest cryptocurrency exchanges. \n\nThe origins of the HODL meme, according to the creator of the most popular memecurrency on the market, can be traced back to the Bitcointalk forum, which served as a haven for cryptocurrency and Bitcoin enthusiasts back when crypto was not at the levels of adoption seen today.\n\nThe user \"GameKyuubi\" shared a lengthy post describing his relationship with cryptocurrency assets and why he prefers not to actively trade with them. According to Markus, the user who wrote the post was drunk at the time and misspelled \"hold\" in the title I am hodling.\" The \"hodling\" meme was then reborn as a fully developed cryptocurrency investment strategy. The strategy's name speaks for itself: traders who choose hodling are not looking for local bottoms or tops and are not trading in a rangebound market. The only operation traders employing the hodling strategy are buying.\n\nIn terms of the strategy's effectiveness, if the original poster had purchased $100 worth of BTC in 2013 and held his coins until now, Kyuubi would have increased by more than $20,000 and nearly $50,000 at the last ATH. \n\nBitcoin is currently trading at $29,314 and has yet to recover above the psychological price of $30,000. \n\nThis has led to stability in the price of most altcoins including NFT utility tokens like Plastiks which is backed by recycling data, Axie Infinity which is play to earn based and Decentraland, a play to earn based NFT.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9ulx4s",
                    "author": "Patan40",
                    "score": 6,
                    "created_utc": 1653423754.0,
                    "response": "Without reading any of this outside of the title... I'm not surprised by this.\n\nBinance has done so many illegal things over the years. With all the countries/locations that have either banned or restricted their platform.\n\nThe continuance of the US Federal Investigation on them via the Department of Justine and IRS for tax crimes and money laundering... it's the only platform that I would strongly recommend EVERY ONE to stay TF away from.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9umhmy",
                            "author": "Mudhutted",
                            "score": 1,
                            "created_utc": 1653423993.0,
                            "response": "If in a few years the Department of Justine becomes the meme Hodl has I will be a very happy crayon eating degen.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9vmpha",
                            "author": "FaceBillions24",
                            "score": 1,
                            "created_utc": 1653440446.0,
                            "response": "CZ=DicKwon. i dont see why people dont see that they are the same type of person",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}