{
    "subreddit": "Dogecoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "utkeeu",
            "title": "Stop the shorts",
            "url": "https://i.redd.it/uow2rtycwj091.jpg",
            "author": "Ok_Woodpecker_435",
            "created_utc": 1653017555.0,
            "score": 14,
            "num_comments": 7,
            "subreddit": "dogecoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9an99z",
                    "author": "Nickonashi69",
                    "score": 1,
                    "created_utc": 1653025528.0,
                    "response": "+u/sodogetip 1 doge verify",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9c9vk4",
                    "author": "MasterCan66",
                    "score": 1,
                    "created_utc": 1653060800.0,
                    "response": "How do i short sell doge ?\nWith 14 mil doge a day dumped on the market it would be ez money not gonna lie. Asking for a friend.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9cdefn",
                            "author": "Ok_Woodpecker_435",
                            "score": 1,
                            "created_utc": 1653062193.0,
                            "response": "If you have to ask you aren’t in the league",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9ce5ge",
                                    "author": "MasterCan66",
                                    "score": 1,
                                    "created_utc": 1653062485.0,
                                    "response": "Dang bro you can split profits with my friend, he said just need to tell how to do it",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9cgvsf",
                                            "author": "Ok_Woodpecker_435",
                                            "score": 1,
                                            "created_utc": 1653063562.0,
                                            "response": "🤷‍♂️ 🤷 🤷‍♀️",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "id": "utkg6w",
            "title": "Whazzzuuuup Mr. B? You can join our revolution if you wanna. Just Do Only Good Everyday, pleamse...",
            "url": "https://i.redd.it/d7gy9z1vwj091.jpg",
            "author": "voterosticon",
            "created_utc": 1653017725.0,
            "score": 476,
            "num_comments": 82,
            "subreddit": "dogecoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9ae22u",
                    "author": "aaskhic",
                    "score": 70,
                    "created_utc": 1653019418.0,
                    "response": "jeff bezos? doing good? lmfao",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9b1p6i",
                            "author": "R4pTix",
                            "score": 28,
                            "created_utc": 1653037643.0,
                            "response": "About as unlikely as Musk doing good still this sub jerks him off on a daily basis",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9b3ap7",
                                    "author": "liquid_at",
                                    "score": 7,
                                    "created_utc": 1653038891.0,
                                    "response": "\"The sub\" and \"people in the sub\" are not really the same thing...\n\nAnyone can post any opinion, whether they believe it or not, whether they researched it, whether it is true or false... \n\nMusk Fanboys having bought doge is not evidence for all Doge-Hodlers being Musk fanboys. But people jump to conclusions on both sides of the argument and just like some people think \"musk is everything\" some people with similar mental abilities think that \"the sub is shilling musk\" ...",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9bm75d",
                                            "author": "MajorWuss",
                                            "score": -3,
                                            "created_utc": 1653050799.0,
                                            "response": "I have never encountered the people you are talking about on this sub. I only see angry people who use flawed logic to attack wealthy people like musk. I just wish people would focus on being better people instead of worrying about other people and scrutinizing their actions  You can't help the world until you help yourself.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9boryq",
                                                    "author": "liquid_at",
                                                    "score": 7,
                                                    "created_utc": 1653052027.0,
                                                    "response": "so you do not see a plethora of \"musk tweets move the price\" and \"when next musk tweet\" and \"when will musk launch doge-1\" and \"musk bought twitter\" posts going around?\n\nWhat plugin are you using? I'd like to block those too.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9bq7yy",
                                                            "author": "MajorWuss",
                                                            "score": -1,
                                                            "created_utc": 1653052683.0,
                                                            "response": "1. I think you are overestimating their support for musk.\n2. Why is that bothering you?\n3. There aren't that many.\n\nMaybe take a look at why it bothers you to this point. There isn't much in life that benefits from negativity but there is a lot that can be harmed from it. For instance, a person's inner peace.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9bqooj",
                                                                    "author": "liquid_at",
                                                                    "score": 2,
                                                                    "created_utc": 1653052887.0,
                                                                    "response": "Reddit is a community of communities, where subs form around topics and people who are interested in these subjects can go the the subs that talk about them.\n\nThe problem with musk-fanboys is that they seem to have a hard time finding their sub and feel the need to talk about their daddy literally everywhere.\n\nEven the Stock-subs are already complaining about the masses of off-topic musk-posts coming up, that do not add anything to the conversation but make the subs look like morons.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9c8i6d",
                                                                            "author": "MajorWuss",
                                                                            "score": 3,
                                                                            "created_utc": 1653060256.0,
                                                                            "response": "I mean, i get what you are saying. I just have a different perspective. I view it as people identifying themselves as musk fanboys, and I don't pay attention. I don't really care what other people think of the community. I try to do my best to make good choices and I encourage other people to do the same. \n\nI think of it like this: I am a white man. Some white folks are racist. They don't speak for me, even if people perceive it that way. I am a gay man. Some gay men are feminine in manurisms. Some are very outspoken about their sexual identity. I'm neither of those, even if people perceive me this way because of the way the community I am a part of is viewed. I just keep working on being the best person I can be, regardless of how frustrating other people's actions are. Dies that make sense? \n\nYou don't have to take my advice. I'm just suggesting  an alternative viewpoint that has helped me navigate the hardships of being a human in a world of humans.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i9ca0as",
                                                                                    "author": "liquid_at",
                                                                                    "score": 2,
                                                                                    "created_utc": 1653060851.0,
                                                                                    "response": "I don't care what people think of me either... But I do care what people think of the doge-communtiy and wherever you go, those musk fanboys are considered \"what the doge sub thinks\" by most of reddit.\n\nI dislike spammers that infiltrate communities to tear them down from the inside. It does happen with every movement and they are very effective.\n\nDoes not really matter what group it is.. if they get popular they get infiltrated and taken over. I just don't want to see that with doge. That's all. \n\nMusketeers have done enough harm already.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i9d6iao",
                                                                                            "author": "voterosticon",
                                                                                            "score": 1,
                                                                                            "created_utc": 1653074578.0,
                                                                                            "response": "I think it's cool that Elon supports doge. Why wouldn't people get excited about that? \n\nSeems reasonable to me, that the average holder would get freak out level excited by the richest man in the world loving and supporting and helping to expand the use of their coin. \n\nI think the reason people are mad about Elon is that they have extreme left-leaning political views, and for this demo, Musk doesn't follow the thought police rules.\n\nWould be good for these people to look within and ask them why they get triggered by Elon.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9ap75y",
                    "author": "purpleefilthh",
                    "score": 13,
                    "created_utc": 1653026980.0,
                    "response": "Billy didn't get wealth with Dogecoin, but he got tweet power for sure.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9b5rya",
                            "author": "kingXcazam",
                            "score": -1,
                            "created_utc": 1653040831.0,
                            "response": "He's an Elon wannabe.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9dqyo8",
                                    "author": "Atsetalam",
                                    "score": 2,
                                    "created_utc": 1653083894.0,
                                    "response": "What?!?!? Why?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9drguh",
                                            "author": "kingXcazam",
                                            "score": -1,
                                            "created_utc": 1653084126.0,
                                            "response": "He tweets like he knows what he's talking about, but always misses the mark. Elon is always spot on.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9drley",
                                                    "author": "Atsetalam",
                                                    "score": 3,
                                                    "created_utc": 1653084186.0,
                                                    "response": "Then why are you on a forum about the crypto he created?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9drnip",
                                                            "author": "kingXcazam",
                                                            "score": 0,
                                                            "created_utc": 1653084214.0,
                                                            "response": "I like Doge. Doesn't mean I *have* to like the creator.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9e8p19",
                                                                    "author": "Captnblkbeard",
                                                                    "score": 2,
                                                                    "created_utc": 1653092813.0,
                                                                    "response": "I like some of his tweets, not all. Doesn’t necessarily mean I like him. Doesn’t have to be love or hate bro. O wait…your king of xcazam, never mind then.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9e939c",
                                                                            "author": "kingXcazam",
                                                                            "score": 2,
                                                                            "created_utc": 1653093028.0,
                                                                            "response": "All hail! 👑",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9e86f9",
                            "author": "Captnblkbeard",
                            "score": 1,
                            "created_utc": 1653092536.0,
                            "response": "Fo shou",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9an8qn",
                    "author": "Nickonashi69",
                    "score": 6,
                    "created_utc": 1653025517.0,
                    "response": "+u/sodogetip 1 doge verify",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9d6n67",
                            "author": "voterosticon",
                            "score": 1,
                            "created_utc": 1653074641.0,
                            "response": "Thanks bro",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9c9aip",
                    "author": "RuffCrumblebunch",
                    "score": 11,
                    "created_utc": 1653060570.0,
                    "response": "Stop praising billionaires.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9b7u8v",
                    "author": "BeliusTheDemon",
                    "score": 4,
                    "created_utc": 1653042504.0,
                    "response": "hmm doge being accepted for amazon payments would be nice.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9cvtu8",
                    "author": "MetricOutlaw",
                    "score": 4,
                    "created_utc": 1653069606.0,
                    "response": "If anyone is known for doing good, ethical deeds it's billionaires.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9d4yx2",
                            "author": "voterosticon",
                            "score": 0,
                            "created_utc": 1653073867.0,
                            "response": "Happy cake day 🎉🎉",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9abef6",
                    "author": "SpikyPickaxe",
                    "score": 15,
                    "created_utc": 1653017874.0,
                    "response": "last thing we need is the second wealthiest person in the world to also control our crypto with tweets",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9at5nt",
                            "author": "CommandChimp",
                            "score": 13,
                            "created_utc": 1653030117.0,
                            "response": "This sub is becoming next level low-iq. \n\nYa, last thing we need is the founder of the largest online retail company the world liking Dogecoin. Are ya'll mental?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9atmof",
                                    "author": "ingalman12",
                                    "score": 3,
                                    "created_utc": 1653030509.0,
                                    "response": "You sir are correct.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9af0ig",
                            "author": "voterosticon",
                            "score": -12,
                            "created_utc": 1653020000.0,
                            "response": "lol we got Bezos, Musk, Cuban.... any other billionaires?\n\nJust keep Gates away please. That guy is a creeper.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9auju1",
                                    "author": "Dogekaliber",
                                    "score": 3,
                                    "created_utc": 1653031299.0,
                                    "response": "We have Vitalik Buterin also. 👍🏻",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9eryh6",
                                            "author": "voterosticon",
                                            "score": 2,
                                            "created_utc": 1653103100.0,
                                            "response": "Yeah Vitalik is awesome.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9aniwr",
                                    "author": "monkeybuttsauce",
                                    "score": 2,
                                    "created_utc": 1653025730.0,
                                    "response": "Keep them all away good god",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9es2j6",
                                    "author": "voterosticon",
                                    "score": 1,
                                    "created_utc": 1653103164.0,
                                    "response": "Lol",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9f632w",
                            "author": "Dogekaliber",
                            "score": 1,
                            "created_utc": 1653112330.0,
                            "response": "Hey, you don’t speak for everyone in Dogecoin.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9au6zb",
                            "author": "Dogekaliber",
                            "score": -1,
                            "created_utc": 1653030995.0,
                            "response": "Yea nice post of a 30day account.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9apgc1",
                    "author": "CurryTasteSpices",
                    "score": 2,
                    "created_utc": 1653027172.0,
                    "response": "Mr. B for threee hahaha roasted.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9cfybi",
                    "author": "parlezlibrement",
                    "score": 2,
                    "created_utc": 1653063196.0,
                    "response": "Is that why independent voters never vote third party?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9c511g",
                    "author": "-ShortSqueeze-",
                    "score": 2,
                    "created_utc": 1653058868.0,
                    "response": "lol, Billy doesn't even DOGE, bro. I can understand why he is so condescending and crass considering he made something awesome and didn't even have the gumption to buy in himself early on. \n\nHe is not a leader but rather partly why DOGE hasn't crossed $1, yet.\n\nDo Only Good Everyday can be loving correcting, but not what both of these pieces of filth stand for.\n\nCheers!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9apsrp",
                    "author": "donotvotemedown",
                    "score": 1,
                    "created_utc": 1653027440.0,
                    "response": "I really would be shocked if Besos using “seen” instead of “saw” like a country hick",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9cjdi0",
                            "author": "a_duck_in_past_life",
                            "score": 2,
                            "created_utc": 1653064531.0,
                            "response": "\"[I've] seen you.... \"",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9bwxrw",
                    "author": "StopMockingMe0",
                    "score": 1,
                    "created_utc": 1653055588.0,
                    "response": "Man yall suckers never learn.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9bs77y",
                    "author": "Gone_gone_beyond",
                    "score": 1,
                    "created_utc": 1653053557.0,
                    "response": "In Billie we trust.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9c8868",
                    "author": "9PONY",
                    "score": 1,
                    "created_utc": 1653060145.0,
                    "response": "![gif](giphy|bseAWDw7m6Arm)\n\n⚡️⚡️⚡️ Do Only Good Erryday",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9e6m4j",
                    "author": "stcloudjeeper",
                    "score": 1,
                    "created_utc": 1653091704.0,
                    "response": "It just feels creepy",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9aqioz",
                    "author": "GIGurRr",
                    "score": 0,
                    "created_utc": 1653027993.0,
                    "response": "Sus",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}