{
    "subreddit": "Dogecoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uvu7kw",
            "title": "Are we paying the price for investing in Doge? Don't lose faith, we still going to the moon!",
            "url": "https://i.redd.it/b652k0mu96191.jpg",
            "author": "Icy-Smell438",
            "created_utc": 1653288460.0,
            "score": 3,
            "num_comments": 1,
            "subreddit": "dogecoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9nnhyg",
                    "author": "Icy-Smell438",
                    "score": 1,
                    "created_utc": 1653288718.0,
                    "response": "(Free 10 min mindset video!) \n\nDecentralizing is happening?!  If you feel like you are missing out on investing in Bitcoin, NOW(Summer) is the time to get prepared!\r  \nCrypto Quantum Leap brings everything you need to know and learn about this market. I started from the bottom(now we here) where I didn’t know where to put the little amount of money I had and today, I already have an awesome guarantee invested. The course will take you step by step how to start with crypto currency even if you don’t know anything about technology because this is a real course for beginners.\r  \nYou’re most likely wondering now if this course is even reliable, the answer is YES, It works. You can trust this course because it already has many people having great results with Crypto Quantum Leap as I had and continue to have.\r  \nIf this still doesn’t sounds convincing, how about I tell ya’ll a bonus feature that no one wants you to know about this amazing course.\r  \n•\tSo the bonus you don’t know unless you join the course is….(Drumroll Plz)\r  \n•\tIF for some reason you are not comfortable with the program or you don’t see results,(you must be broken tbh ) You are able to get a full refund!\r  \n\r  \nHow dope is that?! Just check it out for yourself.\r  \n\r  \nhttps://linktr.ee/sparkiichaco\r  \n \r  \nP.s; Because the table is big enough for everyone to eat..  There’s more valuable programs that I’m low-key sharing with ya’ll because I would love to be able to be a positive impact to your life, and this is a win win situation.\r  \n\r  \nOff To The Moon!\r  \n\r  \n(Stay tune for short vids)",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uvu9ii",
            "title": "Unpopularity Opinion - Dodge is here to stay but only in the form of gift cards.",
            "url": "https://www.reddit.com/r/dogecoin/comments/uvu9ii/unpopularity_opinion_dodge_is_here_to_stay_but/",
            "author": "thejburkeproject",
            "created_utc": 1653288689.0,
            "score": 0,
            "num_comments": 4,
            "subreddit": "dogecoin",
            "selftext": "These other coins are a products of community investing, promising different blockchain growth technology….\nDoge promises nothing and is not overvalued or overhyped anymore. \n \nMy nephews give each other doge for fun instead of fiat. I believe it will be a meme that solidifies.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9odci3",
                    "author": "actualjesus1",
                    "score": 2,
                    "created_utc": 1653309515.0,
                    "response": "Idk dodge makes a fine product i think they'll be alright.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9oqjlx",
                            "author": "thejburkeproject",
                            "score": 1,
                            "created_utc": 1653316092.0,
                            "response": "You thought you would point out the error but I was just too lazy to change it. This is why people like you make apps like this boring.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9nos2w",
                    "author": "Dulcar1",
                    "score": 1,
                    "created_utc": 1653289797.0,
                    "response": "That’s because it’s a currency, money doesn’t do anything. It’s meant to motivate you to get it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9npwpv",
                    "author": "Fulvio55",
                    "score": 1,
                    "created_utc": 1653290765.0,
                    "response": "It’s working precisely like it’s supposed to. Same as any other currency.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}