{
    "subreddit": "Dogecoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uydnc9",
            "title": "If you are holding onto dogecoin - What's your reasoning?",
            "url": "https://www.reddit.com/r/dogecoin/comments/uydnc9/if_you_are_holding_onto_dogecoin_whats_your/",
            "author": "MysticCoonor123",
            "created_utc": 1653588473.0,
            "score": 0,
            "num_comments": 8,
            "subreddit": "dogecoin",
            "selftext": "Hey  Guys so I bought Dogecoin at 55 cents back last April. The next couple  months I did hold on to see if it would go back up but it didn't really.  Around September that year I decided to sell my dogecoin at around 26  cents. Which means I lost half of my investment. -50%. I reinvested in a  stock called Kenon and from Sept-December made money, whereas if I held  on to dogecoin as was the consensus in this forum I would have just  bled out more money, around 88% of my money to be exact.\n\nI  ask you all at this point. Why hold dogecoin? Is it a pride thing? Why  do you think dogecoin would go back up above 30 cents if the last time  everyone invested in hopes that it would go to a dollar, they got burned  badly? It had all the hype and most people who were going to buy  dogecoin did, and they lost money. So the next time the hype comes  around you're not going to have nearly as many buyers forcing the price  up. Why hold at this point, just curious.  \nBecause when I reflect on the whole thing I truly believe that selling my dogecoin was the best financial decision I've ever made. Honest to god.   \n",
            "stickied": false,
            "comments": [
                {
                    "id": "ia3kea1",
                    "author": "ElonaMusk212",
                    "score": 1,
                    "created_utc": 1653590754.0,
                    "response": "Are you trying to convince Us or Yourself? \n\nYou're having major second thoughts...or else why would you be here???\n\nWhy the long post?    Because you care about us? \n\nDon't worry about us...we're Good...you on the other hand made a mistake...\n\nWatch and learn...![gif](emote|free_emotes_pack|kissing_heart)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia3kwxs",
                    "author": "Darth_Laidher",
                    "score": 1,
                    "created_utc": 1653590966.0,
                    "response": "Money, cold hard cash.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia3gmn4",
                    "author": "Tampka",
                    "score": 1,
                    "created_utc": 1653589216.0,
                    "response": "Doge has a lot backing and hype around it. The market as a whole is dropping and I’ve seen a lot about crashing and recession but I do believe down there road they’ll be money to be made for those who hold and lower their average. But to answer your question- I have faith in the coin and the community.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia3gsq3",
                    "author": "justthetoeofus2",
                    "score": 1,
                    "created_utc": 1653589283.0,
                    "response": "So long my friend - good luck - not needed here thanks",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia3iqn5",
                    "author": "zetsubou4",
                    "score": 1,
                    "created_utc": 1653590075.0,
                    "response": "I haven’t TECHNICALLY lost money yet so…..",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia3j3x6",
                    "author": "TomBallsHard",
                    "score": 1,
                    "created_utc": 1653590227.0,
                    "response": "I bought dogecoin with extra money ready to either head to the moon or the grave. No point for me selling. The goal was never a marginal financial gain. Plus with Elon potentially buying twitter, I could see doge being boosted through twitter. Honestly doesnt seem likely, but like I said I bought doge to either hit a home run or strike out. I would've bought an index fund if I wanted a small gain",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia3jgfg",
                    "author": "liquid_at",
                    "score": 1,
                    "created_utc": 1653590371.0,
                    "response": "Why did you get into doge at such a high price if you did not believe in it going up?\n\nBecause \"people on the internet told you\"?\n\nIf doge was worth it when you bought in at 55 cents, why do you think the project that only became better since then is now at a point where it will never reach the price it already had, when it had less to offer?\n\n&#x200B;\n\nThe reason people tell new investors to hold is because markets are highly volatile and unless you are willing to spend years learning about trading, you will never be able to consistently make money in the markets swing-trading.\n\nThe only way for someone with no understanding of the market to make any profit off stocks or crypto is the long-term growth that is historically proven to always happen.\n\nWe are going through one of the biggest, approaching to become the biggest, market-crashes in recorded history. Ignoring that fact only means that you have no idea about what trading is and that you should have never invested a single cent into anything.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uydo1t",
            "title": "Woof Weekly! With John Monarch and JokeDAO",
            "url": "https://i.redd.it/asc1x7ox1v191.png",
            "author": "TheDogeAcademy",
            "created_utc": 1653588526.0,
            "score": 1,
            "num_comments": 4,
            "subreddit": "dogecoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "ia3f629",
                    "author": "TheDogeAcademy",
                    "score": 1,
                    "created_utc": 1653588618.0,
                    "response": "We are live with our [Woof Weekly](https://twitter.com/TheDogeAcademy/status/1529885462935969792?s=20&t=taz14EJi_hWVMwss8sHVYw) on Twitter Spaces join us!",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}