{
    "subreddit": "Dogecoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uwydy4",
            "title": "Its been a year since Elon Musk announced he'd be helping Dogecoin Devs to build a better system..time to call him out?",
            "url": "https://www.reddit.com/r/dogecoin/comments/uwydy4/its_been_a_year_since_elon_musk_announced_hed_be/",
            "author": "jam-hay",
            "created_utc": 1653419194.0,
            "score": 7,
            "num_comments": 15,
            "subreddit": "dogecoin",
            "selftext": "**April 2021**\n\nSadly Sporklin a Dogecoin developer for 7 years loses her [fight against cancer](https://cryptopotato.com/dogecoin-developer-sporklin-dies-cancer/)\n\nIn one of her [last post](https://www.reddit.com/r/dogecoindev/comments/lpucjw/dogecoin_can_reach_1_with_significant_dev) she is clear on how much involvement/ impact Musk has had.\n\n*“Elon has nothing to do with Dogecoin which has been made clear repeatedly … Elon has come to play with Dogecoin for years on social media, it was only recently that people tried to turn that into something it is not … Things have not changed…Elon is not on board with anything, Elon does not have anything to do with the project, the listings, the engagements…Nothing. He memes and trolls.”*\n\n**May 2021**\n\nOn Twitter Elon the now dubbed Dogefather : \"[Working with Doge devs to improve system transaction efficiency. Potentially promising.](https://twitter.com/elonmusk/status/1392974251011895300?s=20&t=vILjxrPe0-pgjeaeWucMiw)\" ... the price of Doge surged. \n\nIn a now deleted tweet Dogecoin co-founder Jackson Palmer cautioned followers saying..  *\"Reminder: Elon Musk is and always will be a self-absorbed grifter.\"*\n\n**Nov 21**\n\nLast Dogecoin GitHub Master branch [commit](https://github.com/dogecoin/dogecoin/commits/master) was over 7 months.\n\nAlthough still signs of some life [on dev branches](https://github.com/dogecoin/dogecoin/branches)\n\nLast release, [6 months ago...](https://www.reddit.com/r/dogecoindev/comments/qpkk46/dogecoin_core_1145_released/)\n\n**Jan 22**\n\nIn a long awaited Dogecoin announcement, the headline says Tesla  [accepts Dogecoin](https://www.investopedia.com/tesla-accepts-dogecoin-for-merchandise-5216067) but the reality says its only for certain items in its shop like a belt buck and Tesla shaped whistle. \n\n**Feb 2022**\n\nCore developer Ross Nicoll [steps away](https://rnicoll.name/posts/2022-02-16-stepping-away/) from the project referring to stress, a potential lawsuit against the developers and lack of funds the foundation has to pay him anything at all despite the Billionaire supposingly having Devs back. \n\n**Apr 2022**\n\nIn a [Twitter thread](https://twitter.com/michilumin/status/1517958353024020480?s=20&t=_9ZUgcvPqct44NLcE4qKMQ) another Dogecoin developer Michi Lumin again paints a picture of an underfunded foundation....\n\n*\"When influencers say that the Foundation has tons of funding lined up, or that we're building out infrastructure - and people believe that - it actually harms the @DogecoinFdn because people who would otherwise be willing to help go \"oh, they have it all taken care of\", This bothers me because we're not actually a club full of rich people. Many of us still work day jobs to make ends meet but still want to see #dogecoin proceed and succeed. Tales of palace intrigue end up being things we have to spend time answering to, as well...and the propensity for certain sections of the community and media to be thirsty for the next scandal or conspiracy actually puts a lot of strain on an already fairly stressed crew.\"* *\"Yes, we're trying to get sustaining funding in order to do some of the 'big ideas' we want to pursue. A lot of what you read on social media in regard to this is completely made up for clicks and engagement-We still have a lot of hard work to do. Wish ppl wouldn't make it harder.\"*\n\nOn the whole after over a year there has been no dramatic revelation or support for [Dogecoin development](https://gitgitlog.com/dogecoin).. think it's safe to deduce that once again.... Elon Musk is most likely Twitters biggest spam bot 💩",
            "stickied": false,
            "comments": [
                {
                    "id": "i9wqg0q",
                    "author": "Fulvio55",
                    "score": 3,
                    "created_utc": 1653463454.0,
                    "response": "No new news here.\n\nWe called him out at the time, but nobody wanted to listen.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9v2qsh",
                    "author": "jayson031282",
                    "score": 3,
                    "created_utc": 1653431038.0,
                    "response": "Didn't Vitalik just donate a million towards the foundation?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9wqgtm",
                            "author": "Fulvio55",
                            "score": 1,
                            "created_utc": 1653463474.0,
                            "response": "So what?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9w25gl",
                    "author": "buybuybuy1950",
                    "score": 5,
                    "created_utc": 1653447777.0,
                    "response": "Dogecoin functionality is 99.9999% complete, mature and stable. We don't need centralized power or money to take it some place new.\n\nDogecoin is about community and adoption, not about the next money grubbing hype machine upgrade ala Photoshop or video games -  \"Hey look at me it's version 2.0!!!\".  We don't need that either.\n\nDogecoin devs need more compensation yes, it's a long standing challenge, I would suggest anyone who is seriously interested in that aspect but knows nothing about it, start with /u/Mishaboar.  He could probably provide a brief/primer on the subject that is more objective than most.  Follow his posts/comments/tweets.\n\nElon's contributions come in the form of attempting to implement doge in companies he's involved in.  Even him just making the attempt helps doge.  This is all we need from him. More than that, becomes heavy handed.  And heavy handedness from billionaires can ruin things.\n\nRight now the federal reserve is beating down all markets without impunity.  You will see posts like this during these times, and I urge people to take them with a pound of salt.  I do not know the motives of the OP, just that he doesn't spend much time in this sub by way of comments or posts.  But I do know when the chips are down, and people feel the need to blame someone or something, other people will look for that weakness to come knocking with \"solutions\"...",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9xgi0d",
                    "author": "BYEenbro",
                    "score": 2,
                    "created_utc": 1653482973.0,
                    "response": "FUD",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9xot34",
                    "author": "Justadudewithareddit",
                    "score": 2,
                    "created_utc": 1653486929.0,
                    "response": "Slowly day by day I believe he's a witch, it probably be wise to burn him at the stake sooner then later.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9uyp35",
                    "author": "I-Know-What-To-Do",
                    "score": 2,
                    "created_utc": 1653429255.0,
                    "response": "Did you miss the whole Twitter thing? he already promoted Doge to use for Twitter suscribption.\n\nCome on man.....he can do so much. Doge gotta find it's own move to be a sustainable in future.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9wqhvx",
                            "author": "Fulvio55",
                            "score": 3,
                            "created_utc": 1653463499.0,
                            "response": "He doesn’t own Twitter. The way things are going, he may never.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9vy9zu",
                    "author": "ElonaMusk212",
                    "score": 1,
                    "created_utc": 1653445900.0,
                    "response": "Im embarrassed for you....",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9y0mmw",
                    "author": "Safe-You134",
                    "score": 1,
                    "created_utc": 1653491875.0,
                    "response": "If he believes in it so much he needs to accept it as Tesla for vehicles.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9yzddn",
                            "author": "CyclePainter",
                            "score": 1,
                            "created_utc": 1653505479.0,
                            "response": "What-if Tesla and Amazon are \"Load-up the chips\" at low prices?...we won't know until they announce something on the balance sheet. These are fierce companies with LOTS of business smarts. The volume is very low, if they buy-in too quickly, the price will Moon too soon. Be patient. HODL - NFA",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}