{
    "subreddit": "Dogecoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uvfgay",
            "title": "True",
            "url": "https://i.redd.it/8cwrczib92191.jpg",
            "author": "KIFF_82",
            "created_utc": 1653239838.0,
            "score": 84,
            "num_comments": 3,
            "subreddit": "dogecoin",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uvf6ik",
            "title": "Dogecoin at $5! How? With the help of the new generation Starlink which I hope give network directly to your device. Dogecoin will be accessible to the worlk👍",
            "url": "https://www.reddit.com/r/dogecoin/comments/uvf6ik/dogecoin_at_5_how_with_the_help_of_the_new/",
            "author": "French-Goldorack11",
            "created_utc": 1653239061.0,
            "score": 16,
            "num_comments": 19,
            "subreddit": "dogecoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9lkygh",
                    "author": "Ecstatictobehere",
                    "score": 2,
                    "created_utc": 1653248212.0,
                    "response": "Starlink is expensive",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9nw0k6",
                            "author": "liquid_at",
                            "score": 2,
                            "created_utc": 1653296457.0,
                            "response": "which is why radiodoge is that great. You can use 1 starlink access point and use cheap radio to extend the reach.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9ma100",
                            "author": "French-Goldorack11",
                            "score": 1,
                            "created_utc": 1653260050.0,
                            "response": "Right now but with the second generation which I hope can beam directly to your device. It will be a game changer and worth paying for",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9msm4v",
                            "author": "Fulvio55",
                            "score": 0,
                            "created_utc": 1653269708.0,
                            "response": "👍",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9mskld",
                    "author": "Fulvio55",
                    "score": 1,
                    "created_utc": 1653269687.0,
                    "response": "Don’t be stupid.\n\nIt’s just another ISP. One which is much more expensive than terrestrial options, and which has ridiculous latency. Fine if you’re in the Sahara or something, but really dumb if you’re in a city like most people.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9mudan",
                            "author": "French-Goldorack11",
                            "score": 1,
                            "created_utc": 1653270578.0,
                            "response": "Actually,\ndon't be stupid!\n\nThe technology is first Gen. Like the iphone 1,  like flat screen, just like any technology it doesn't take long to improve and get better.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9mus23",
                                    "author": "Fulvio55",
                                    "score": 1,
                                    "created_utc": 1653270781.0,
                                    "response": "Technology can’t fix the laws of physics.\n\nLatency in radio signals to satellites is unavoidable. And it is a big deal in many cases.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9najrq",
                                            "author": "French-Goldorack11",
                                            "score": 1,
                                            "created_utc": 1653279358.0,
                                            "response": "The doom scenario of impossible outcome!\n\nI disagree with you 100% but only time will tell!",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9nhbv4",
                                                    "author": "Fulvio55",
                                                    "score": 2,
                                                    "created_utc": 1653283939.0,
                                                    "response": "Disagreeing with the laws of physics doesn’t have a great track record. Just ask the flat earthers.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9nkszv",
                                                            "author": "French-Goldorack11",
                                                            "score": 1,
                                                            "created_utc": 1653286558.0,
                                                            "response": "Again, just because science doesnt have an answer yet, it doesn't mean it's impossible! Btw the laws of Physics are no longer referred to as Laws (except for historical reasons) and every single one of them is inaccurate or lacking (which is one reason why we tend not to call them laws these days).",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9npiup",
                                                                    "author": "Fulvio55",
                                                                    "score": 1,
                                                                    "created_utc": 1653290430.0,
                                                                    "response": "Science can’t change natural laws.\n\nAnd there is a difference between these laws and theories.\n\nThe speed of light is a constant. It is not a theory. The amount of time it takes for it to travel a distance is fixed. We are looking at a sun that may have exploded eight minutes ago, and there is nothing whatsoever we can do to change that.\n\nBouncing a radio signal off a satellite is subject to laws which are immutable. And that’s why you have latency. Science is not going to fix that.\n\nAs I said, starlink is a great solution if you have no alternatives, or if your alternatives suck. We use it here in the outback because it performs better than SkyMuster, but both are subject to the same physical laws. And there is no fibre option out there. Unlike in cities where there are plenty of options. And all of them cheaper.\n\nThe stupid thing is, Musk could have chosen to price the service much lower, because the capital costs are the same for one customer or a billion. He didn’t. He decided to screw people, and thereby drive down usage. It may well turn out to be a white elephant in the end, just like other expensive satellite systems we’ve had for ages.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9nss3h",
                                                                            "author": "French-Goldorack11",
                                                                            "score": 1,
                                                                            "created_utc": 1653293418.0,
                                                                            "response": "No one is saying changing natural laws🤦‍♂️ Technology is adapting constantly, science makes new discovery everyday. We don't have all the science nor knowledge. 120 years ago men call it impossible to fly, \"Flight by machines heavier than air is impractical and insignificant, if not utterly impossible\" 🤷‍♂️ today flying is taken for granted. You look a distance, speed of light  with your knowledge of today and can't fathom the possibility   to travel that fast \"The amount of time it takes for it to travel a distance is fixed\" bla bla bla until proven wrong 😀 same B.S different time. We will be laugh at in the future just like these men unable to open their mind at the possibility to fly.\n\nFact!",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i9o0kjk",
                                                                                    "author": "Fulvio55",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653300599.0,
                                                                                    "response": "You seem to be confused as to what constitutes progress and what are immutable facts.\n\nIf we were arguing about increasing data rates, you would have a point, and it would be stupid to argue. I used to use a 300 baud acoustic coupler. Then a whole series of modems up to something like 56kbps. Then 10mbit HFC cable. Then 100mbit. And the state of the art is now fibre where the data rates can indeed be expected to increase in future.\n\nLikewise, my first generation analogue mobile phone was a vast improvement over the earlier carphones only billionaires used. Then GSM, 3G, 4G, now 5G.\n\nAnd yes, Starlink uses higher frequencies and data rates than earlier satellites.\n\nBut….\n\nThey can’t replace the radios on those satellites, because they would have to either go up there or replace them. Which is simply not going to happen. And even if you did replace the entire constellation and ground station network, you still wouldn't reduce the latency. It simply is not possible.\n\nDeal with it.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i9ojhiw",
                                                                                            "author": "French-Goldorack11",
                                                                                            "score": 1,
                                                                                            "created_utc": 1653312752.0,
                                                                                            "response": "Bro, you are still wrong, at the end of the day you don't have all the science nor technology and beside, the confusion is on your part, from the beginning I mentioned new Gen starlink as the Gen 2 but you couldn't resist to rush and vomit your book knowledge on some complete stranger on Reddit like you are solving Elon's \"problem\" !\n\nAsk yourself, are you solving his Starlink latency issue or just having a debate on Reddit with maybe a 18 yrs old leading you on.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9m0o0n",
                    "author": "Godhand_Phemto",
                    "score": 1,
                    "created_utc": 1653255464.0,
                    "response": "SMH",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9m1485",
                            "author": "French-Goldorack11",
                            "score": 1,
                            "created_utc": 1653255677.0,
                            "response": "SMH?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}