{
    "subreddit": "Dogecoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uvonlo",
            "title": "If the only way for dogecoin to hit an ATH was for you to trade your stake at the price right now, would you do it?",
            "url": "https://www.reddit.com/r/dogecoin/comments/uvonlo/if_the_only_way_for_dogecoin_to_hit_an_ath_was/",
            "author": "myoco",
            "created_utc": 1653267742.0,
            "score": 3,
            "num_comments": 1,
            "subreddit": "dogecoin",
            "selftext": "I have been asking friends this question for the past couple weeks. They are all crypto experts off of Reddit who get all of their news from either this platform or yahoo news, until I ask them: What do you do if somebody hands you a stack of $100 bills? “Put it in my bank obviously!” Okay true. Now what happens if someone hands you a huge stack ($100,000) of dogecoin? They ALL said “I’d trade it!” Why? Because crypto is meant to be traded. You all hold and buy and buy and expect the price to sky rocket but that’s not how this works. If you love something then let it go so it can grow and come back, that’s what this is all about. Want Doge to hit $1? Trade it… CRYPTO IS MEANT TO BE TRADED, NOT HOARDED. Thank you all for your time.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9mr5q7",
                    "author": "Fulvio55",
                    "score": 1,
                    "created_utc": 1653268991.0,
                    "response": "Some of us have been saying for years that the only way to get anywhere is to trade constantly.\n\nBut nobody wants to listen. They’re all drinking the stupid diamond hand kool-aid.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}