{
    "subreddit": "Dogecoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uqmd9a",
            "title": "Perfect guy to follow for doge info. Get on his Twitter and YouTube 🐕",
            "url": "https://i.redd.it/2q0w3yqa9rz81.jpg",
            "author": "Ok_Woodpecker_435",
            "created_utc": 1652670807.0,
            "score": 4,
            "num_comments": 8,
            "subreddit": "dogecoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8rzr79",
                    "author": "TGrundig760",
                    "score": 5,
                    "created_utc": 1652671068.0,
                    "response": "I actually do follow this guy.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8rzxj4",
                            "author": "Ok_Woodpecker_435",
                            "score": 4,
                            "created_utc": 1652671165.0,
                            "response": "The best info every time. If we follow his work as a community we would be in good shape",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8s7169",
                    "author": "neomancr",
                    "score": 1,
                    "created_utc": 1652675386.0,
                    "response": "Ie you can literally just actively become involved.\n\nhttps://www.reddit.com/r/dogecoin/comments/upvgcm/lets_tighten_it_back_up_against_9c_tomorrow_its\n\nhttps://www.reddit.com/r/dogecoin/comments/uq4ytd/keep_up_the_good_work_guys_its_sunday_morning_as\n\nWe started the reversal literally 14 hours prior to news bots citing an Elon post which was about 80 percent late.\n\nhttps://imgur.com/a/TFF1ZRp\n\nThis sub has a weird new policy to pretending like manipulation doesn't exist and shadow banning anyone who explains or demonstrates it.\n\nWe've been running demos for like a year.\n\nAlways the same format. Plan day prior. Recruit from various channels including here. Then getting it down while narrating along to demonstrate how it works.\n\nYou can literally see the time stamps of each sequential sub plan as we go. It's basically a fractal.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8sgo9l",
                            "author": "FaceBillions24",
                            "score": 3,
                            "created_utc": 1652682023.0,
                            "response": "lets let people keep in their minds elon is the doge mover so we can all continue to move freely doing the work. i rather be the one behind closed doors making greater strides then the one infront of the camera briskly walking and having to stop every minute bc praise blame and attacks have to be delt with, elon does have sway obv how could he not but hes not dumb he knows people think he makes doge move and nothing else does so he knows what role he is playing. we should move tactically as a community. the greatest threat to anything in power throughout history is organization of a majority. dont get me wrong im not talking about lets all be commies lol im saying we have an opportunity to make a difference while we can still go uncredited and off the radar as a community. sure there will be infiltrators and anyone really paying attention knows its the community holding and buying but the average person has no idea and any advantage against a much more powerful well funded and unlimited resourced foe is welcomed imo. Do Only Good Everyday!",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8sliuo",
                                    "author": "neomancr",
                                    "score": 1,
                                    "created_utc": 1652685948.0,
                                    "response": "You're absolutely right btw the only thing I feel like is a threat is \"letting people beleive Elon is the one with all the influence.\"\n\nBecause the plan is to either change him into a good man and join us of to have him go down in flames...\n\nIt's like I always said: a million sparks can light up the world or it can burn it into ashes...\n\nI'd rather the former. Elon musk has a really bad reputation and it's only getting worse. He's radioactive.\n\nSo sorry if I misread your post. You're right we are the ones who carry doge. But doge = Elon's Ego has an effect in doge as well since there are people who would beleive if Elon fell and tesla failed doge would crash too. It's a self fulfilling prophecy that we can recover from but it would be a rough ride just like I warned about a month ago about how I wasn't going to have any part in the next actions and someone else will be playing my role since I wanted to keep my hands clean... It was obvious anonymous with the Twitter thing there would be an attack an anything Elon and Doge was in the cross hairs...\n\nBtc isn't really the king of anything either. Attacking doge also causes all else to fall including the market. That's a secret I never let out but the cats kinda out of the bag.\n\nThats why I started using the darklyLlT handle instead. And we even started the reversal while I was using that handle since I still didn't really want to be involved in this whole thing. The crash was a lot worse than I even thought but I  never literally said I was going to step out and out right change names and state that I was transferring my role to a \"money ain't real type so buckle up for a bunoy ride\" before. I was hoping me doing something that drastic would be enough for people to know how serious j was. I only did that knowing full well it was gonna be bad.... \n\nI wanted to keep my hands clean but you still can't keep your conscience clean just standing by.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "id": "uqmbw8",
            "title": "My Notes On Dogecoin | 2,000% Gain Is Easy | Dogecoin Latest News Today",
            "url": "https://youtu.be/zvF5vGMuNWw",
            "author": "AOSPODCAST",
            "created_utc": 1652670675.0,
            "score": 14,
            "num_comments": 16,
            "subreddit": "dogecoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8sljk7",
                    "author": "Consistent-Papaya688",
                    "score": 3,
                    "created_utc": 1652685965.0,
                    "response": "You are a genius. Everyone needs to follow you!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8ufx2u",
                            "author": "AOSPODCAST",
                            "score": 1,
                            "created_utc": 1652722947.0,
                            "response": "Wow. Thank you 🙏",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8rz74h",
                    "author": "Ok_Woodpecker_435",
                    "score": 4,
                    "created_utc": 1652670761.0,
                    "response": "Everyone needs to follow this guys Twitter and YouTube !",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8rz91t",
                            "author": "AOSPODCAST",
                            "score": 5,
                            "created_utc": 1652670791.0,
                            "response": "🙏",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8rzpvj",
                                    "author": "Ok_Woodpecker_435",
                                    "score": 2,
                                    "created_utc": 1652671048.0,
                                    "response": "Silly question lol you aren’t him are you",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8s001h",
                                            "author": "AOSPODCAST",
                                            "score": 8,
                                            "created_utc": 1652671204.0,
                                            "response": "Lol I am him / He is I 😅",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8s042b",
                                                    "author": "Ok_Woodpecker_435",
                                                    "score": 2,
                                                    "created_utc": 1652671263.0,
                                                    "response": "Amazing! You are a true legend in my eyes!! Thanks for all the content",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i8s0ftw",
                                                    "author": "Ok_Woodpecker_435",
                                                    "score": 1,
                                                    "created_utc": 1652671448.0,
                                                    "response": "I do want to ask you something.. why not make a platform specifically for doge to buy and sell made by our devs that includes a wallet with our own keys so there is no manipulation with lending?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8s7khq",
                                                            "author": "AOSPODCAST",
                                                            "score": 7,
                                                            "created_utc": 1652675728.0,
                                                            "response": "That may be doable but I don’t think it aligns with the vision for the coin. It is suppose to grow into utility into the markets that exist. This would be building a market for utility but it wouldn’t be free range. I don’t know what we would exchange for…maybe tipping? We can do that already with MyDoge. It’s doable, but I don’t think it fits.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8tcnec",
                                                                    "author": "Ok_Woodpecker_435",
                                                                    "score": 1,
                                                                    "created_utc": 1652706283.0,
                                                                    "response": "I agree with it not aligning with the vision and I have not put much thought into this but just a shower thought but hear me out.. I use MyDoge wallet for all of my doge(I’m not sure if that’s risk/safe or not) if they simply add a buy doge button on there I wouldn’t have to buy from RobinHood and transfer. \n\nAs for the bigger picture.. even if more retail/Comercial investors get into doge and we can use it in a few stores Many investors in doge are going to want to buy and sell for profit and they can only do that on an exchange. Let’s say someone truly believes in doge and market manipulation. They are still likely to leave it on an exchange just for the peace of mind that they can sell at anytime and they disregard the fact that their very own investment contributes to that manipulation. \n\nI believe the hodl and use time for doge is in the far future (5-10years) and at that point crypto wallets will be well known and not new/confusing to the normal person. In the time being MyDoge wallet was the easiest for me to get into and if I can buy on that platform I wouldn’t need to touch an exchange again. \n\nYou can prove me wrong. It’s been an on going shower thought I’d like to put an end to!",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i8ufueh",
                                                                            "author": "AOSPODCAST",
                                                                            "score": 1,
                                                                            "created_utc": 1652722918.0,
                                                                            "response": "You’re not wrong. A lot of the community would like to make gains be use it as a currency. I do think we can see a shift sooner vs later..especially if the Twitter deals works out. Doge will lvl out one day once we have control over it. We’ll have a more calm community that only focuses on payments vs selling to jump back into fiat.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i8txqv9",
                                                    "author": "DragonWhiro",
                                                    "score": 1,
                                                    "created_utc": 1652715683.0,
                                                    "response": "![gif](giphy|Huo7qbHGNnXUVoRYL9)\n\nYou sus.\n\nPretty sure you’re the imposter.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8uf02i",
                                                            "author": "AOSPODCAST",
                                                            "score": 1,
                                                            "created_utc": 1652722586.0,
                                                            "response": "Lol",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8rzhbm",
                            "author": "shanr1225",
                            "score": 2,
                            "created_utc": 1652670918.0,
                            "response": "Agreed 👍",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8rzqxc",
                    "author": "Ok_Level_9808",
                    "score": 1,
                    "created_utc": 1652671064.0,
                    "response": "![gif](giphy|3o7aCUQfzhWgYvrHnG)",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}