{
    "subreddit": "Dogecoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uumd5b",
            "title": "👀 alright shibes, the question is begging to be asked. Live and on VC. Now is the opportunity to get a straight answer. When will binance provide proof of assets? WEN PROOF!? 🐕",
            "url": "https://i.redd.it/nu55rf6srt091.jpg",
            "author": "GretaTheJetta",
            "created_utc": 1653137085.0,
            "score": 17,
            "num_comments": 17,
            "subreddit": "dogecoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9g17l4",
                    "author": "liquid_at",
                    "score": 3,
                    "created_utc": 1653137899.0,
                    "response": "I'm just wondering why so many people care if binance cheats \"the whales that accumulate doge-token\" ...\n\nDoge-Token is not Dogecoin. Dogecoin is not Doge-Token. \n\nIf you buy doge-token you invest in binance, not in dogecoin. Only dogecoin is dogecoin.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9g1eot",
                            "author": "GretaTheJetta",
                            "score": 2,
                            "created_utc": 1653138010.0,
                            "response": "Considering how many wallets are holding doge-token. A large amount of shibes may be unaware of what asset they are hodling. Around 650k if I’m not mistaken. That’s a lot of misallocated money. Unknowingly hurting Dogecoin strength in a price sense.\n\nWithout proof of backing of the asset. I would say that is immensely important. With proof of backing then it is a non-issue and doge-token is just another cross chain bridge and actually beneficial for the ecosystem. \n\nBut without proof of backing. It’s possibly counterfeit Doge. Which is simply not ok.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9g2kj3",
                                    "author": "liquid_at",
                                    "score": 2,
                                    "created_utc": 1653138668.0,
                                    "response": "Or maybe it would help if the people asking binance for proof of asset would stop calling it \"for dogecoin\" and start calling it the \"pegged token on BNB chain\" that it is.\n\nMaybe calling it by its real name instead of suggesting to investors that it is \"the real dogecoin\" would help them not confuse the two.\n\nJust a suggestion.\n\nSomehow... I don't know... I think that's what words were made for... to tell things apart.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9g363y",
                                            "author": "GretaTheJetta",
                                            "score": 1,
                                            "created_utc": 1653139008.0,
                                            "response": "Well, i would argue that saying “for dogecoin” is more in the sense of dogecoin being a entity and not the coin. \n\nBut you also aren’t wrong. Differentiating the two be it calling it a pegged token, bnb wrapped doge, or whatever variation is an important aspect of the situation. \n\nBut, again, if there is a wallet holding real doge at 1 for 1 then the entire thing is a non issue. Bnb WDoge  just opening up the dogecoin ecosystem to another blockchains ecosystem via a crosschain bridge. Which again would be beneficial. \n\nJust provide the damn proof CZ. It’s that simple.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9g3on2",
                                                    "author": "liquid_at",
                                                    "score": 1,
                                                    "created_utc": 1653139292.0,
                                                    "response": "sure, wrapped tokens are great expansion of the ecosystem, but they are not made for hodling.\n\nIn a sense it's like converting your USD for Casino-Tokens because \"they are backed with dollars\" ... \n\nNo one calls a casino-token \"cash\" and no one should call a pegged token \"coin\".",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9g4000",
                                                            "author": "GretaTheJetta",
                                                            "score": 2,
                                                            "created_utc": 1653139467.0,
                                                            "response": "I definitely agree with this. \n\nIf anything a crosschain bridge should be used solely to simply and easily for the transference of funds so you can go from interacting with one ecosystem to another. \n\nThose tokens, at least in the form of WDoge, should then be used to to whatever transactions they were intended for. Be it investing in some other token project, or whatever else your heart desires. \n\nSimply hodling the token, in the sense for WDoge, is just silly. \n\nMuch silly.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9g4g1t",
                                                                    "author": "liquid_at",
                                                                    "score": 2,
                                                                    "created_utc": 1653139714.0,
                                                                    "response": "100%\n\nStill wondering who these \"whales\" are that allegedly buy all the wdoge... Makes literally no sense.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9g3zt6",
                    "author": "Taronyu019",
                    "score": 1,
                    "created_utc": 1653139464.0,
                    "response": "I suggest you watch as if not multiple reason at least one for Binance [not to show anything](https://youtu.be/5z1PqXf3al8). Click on the link. You can believe anything but at least if you hear from him, you will have a better understanding. Also if you are moving your coin, do not use a [Hot Wallet](https://www.zdnet.com/finance/blockchain/malware-is-targeting-crypto-wallets-says-microsoft-heres-how-to-protect-yourself-better/). Click on the link.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9g42qh",
                            "author": "GretaTheJetta",
                            "score": 0,
                            "created_utc": 1653139509.0,
                            "response": "No way I’m clicking on your links while you’re pushing your links so hard. \n\nNo one click on these links.\n\nEdit: disregard.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9g54t7",
                                    "author": "liquid_at",
                                    "score": 3,
                                    "created_utc": 1653140085.0,
                                    "response": "well... it's youtube and zdnet - a known tech news site.\n\nNot like there's a ton of risk involved...",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9g574l",
                                            "author": "GretaTheJetta",
                                            "score": 1,
                                            "created_utc": 1653140120.0,
                                            "response": "Wasn’t going to click on them to see what they were\n\nEspecially not with “click the link” being repeated.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9g5mro",
                                                    "author": "liquid_at",
                                                    "score": 2,
                                                    "created_utc": 1653140351.0,
                                                    "response": "advantage of PC... you can just hover your mouse over them and get the link xD \n\nA bit more difficult on mobile...",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i9g5iu3",
                                                    "author": "danteselv",
                                                    "score": 1,
                                                    "created_utc": 1653140295.0,
                                                    "response": "This idea that clicking a link will magically summon some demon to take away your life savings is nonsense. At best you are giving your ip away. Which is worthless..",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9g5tdw",
                                                            "author": "GretaTheJetta",
                                                            "score": 1,
                                                            "created_utc": 1653140443.0,
                                                            "response": "Eh, I would say that certain functions could be on a site with a “on-hover” or “on-click” function that initiate further functions the user is unaware of.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9g7a1v",
                                                                    "author": "liquid_at",
                                                                    "score": 1,
                                                                    "created_utc": 1653141204.0,
                                                                    "response": "as someone who has read his fair share of drive-by-attacks in code-form... most of them start with \"if browser = internetexplorer AND Version <6.0\"\n\nThey are looking for people who haven't updated their OS in a decade...",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}