{
    "subreddit": "Dogecoin",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uqeoc6",
            "title": "wow this is crazy!!!!",
            "url": "https://x2crypt.org",
            "author": "koljap7",
            "created_utc": 1652646267.0,
            "score": 106,
            "num_comments": 2,
            "subreddit": "dogecoin",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uqc8ll",
            "title": "Remove Your Coins From Exchanges To Your Personal Wallet ( This Effects Price)",
            "url": "https://www.reddit.com/r/dogecoin/comments/uqc8ll/remove_your_coins_from_exchanges_to_your_personal/",
            "author": "AOSPODCAST",
            "created_utc": 1652639361.0,
            "score": 60,
            "num_comments": 20,
            "subreddit": "dogecoin",
            "selftext": "Hello Dogecoin Reddit Community, \n\nMy name is David Mitchell Jr. This is going to be a long post but, I believe it's crucial for the health of the community. I don't have the largest platform on YT so I'm writing articles now to inform everyone this is about more than holding.  If you take a close look at the charts you'll see the strategic effort to control Dogecoin's price. Most of you may know that Dogecoin's price action has been extremely manipulated however, a lot of you may not know-how. I've been publishing my research in video form if you want to see charts but the fact is the exchanges are using our coins against us. It's become so obvious that even Gary Gensler is speaking on it. \n\nInstitutions hold about 82% of all coins on their exchanges... which is roughly 110 Billion of the 135 Billion supply. I've been doing my best to inform the community to switch to a cold wallet to restrict access. Why? \n\nExchanges are no different than banks... it's really of no benefit to them to hold your crypto if they can't use it to make money. This is where shorting comes in. An abnormal amount of shorts are present in Dogecoin. I've seen rallies of +200% on nothing but an Elon Tweet. Institutions will lend your Dogecoin to be shorted against the current demand. Yes, your crypto in a way is duplicated and used to place an immediate sell order in the market. They charge a fee for this of course, in addition, to making money on the buy/sell. \n\nFYI (Side Note): A short is a borrowed asset that is immediately sold into the market. The shorter is a guaranteed buyer at some point but the effort is to drive the price down and buy at a lower price. The gap between the borrowed sale order and the purchase price at the (hopefully) lower price is the spread. If the price increases then they will have to buy it for a higher price and thus take a loss. If the asset has become scarce, or over-leveraged this can result in a squeeze...creating an abnormal amount of buying pressure for any of the assets that hit the market, sending the price parabolic. \n\nThe crazy part about all of this is, that Dogecoin shorts always engage at the beginning of a catalyst or news. This is why I believe it's about more than money. It makes much more sense to wait for the curve and open up the gap between your sell order and a natural correction...if you're shorting for profit. The actions I'm seeing seem to be more personal. It's to curve momentum and suppress the price. \n\nWe know that Dogecoin is the most held crypto and roughly 60% of all wallets contain some Dogecoin. So, this information along with the charts allows me to believe the price action of Dogecoin has been vastly off for some time. You can find evidence of this right now by looking at the pool of liquidity surrounding Doge and the fact they can't exit their short position completely anymore, otherwise, Doge would either rally or appear as a hedge to what's going on in the market. The community did have a sell-off but not as bad as it looks. \n\nIf we remove our coins from exchanges we will limit the access they have to our coins. You can do this via a cold wallet...like Nano\n\nFYI (Side Note) It’s important to know that your crypto is not actually on the device. It’s still on the blockchain. Your Nano will help you manage your seed phrase which will give you access to your coins. They're a lot of fake sites selling Nanos, so please make sure you get one from the actual site for your crypto. [https://shop.ledger.com/?r=01f1d3f5672a](https://shop.ledger.com/?r=01f1d3f5672a)\n\nWhen you remove the coins from the exchange this will reduce a dramatic portion of the lending. If the exchanges wish to lend coins make them go on the market and buy coins to lend them for shorts. \n\nSome of you may ask, doesn't 1 Doge = 1 Doge? That's a loaded question but the truth of the matter is the market is designed to provide leverage. When leverage is involved nothing is 1=1. The principle of a short creating a negative sell order of the same Dogecoin someone is holding is manipulation, to say the least. It's like synthetic Dogecoins are created but erased when the position is covered, all in the name to extract money. \n\nThe truth is even at 10k doge a minute we don't have enough Dogecoin to become the internet currency. The inflation argument doesn't make sense mathematically. 135 Billion Coins with at least 4 Million holders ( our current wallet addresses) leaves us with about 33,750 coins each or $2,700.  These numbers alone would leave 0 Doge available to buy. This alone suggests with any form of massive utility Dogecoin will appreciate greatly due to the lack of coins. Imagine 50 million people on Twitter with 100 Doge in their wallet. It's game over, you couldn't even short it. There would be no more coins left. \n\nA prime example of this is Binance refusing to show Proof of Assets for Dogecoin. Even though, they do so for Dogecoin. They also use a wrap-around token for trading...their BSC token. Supposedly is 1=1. We have no way of knowing this because we don't know how many Dogecoin they have. So it could be 1=3 for all we know. This is how all the BS starts. It always starts with abuse to leverage. \n\nI could write a book on Reddit but I know some of you will need charts to verify etc so here are some of the videos that include the charts and break down the math. If this is received well, I'll write more in the future. \n\nWhat Are Shorts: \n\n[https://youtu.be/sVVYPRy5ovo](https://youtu.be/sVVYPRy5ovo)\n\nWe Need More Dogecoin: \n\n[https://youtu.be/NUBFbSuQMlg](https://youtu.be/NUBFbSuQMlg)\n\nEven If They Got Doge To A Penny: \n\n[https://youtu.be/\\_HD8zp2nF58](https://youtu.be/_HD8zp2nF58)\n\nThe Binance/Exchange Fake Coins : \n\n[https://youtu.be/mbj-8XnjhCA](https://youtu.be/mbj-8XnjhCA)\n\nI hope this information finds you well, \n\nDavid",
            "stickied": false,
            "comments": [
                {
                    "id": "i8quna0",
                    "author": "kbad01",
                    "score": 13,
                    "created_utc": 1652651400.0,
                    "response": "hey man .. about time everyone understands how the game worx .. thanx for the education .. keep it up .. good luck!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8qwp6x",
                            "author": "AOSPODCAST",
                            "score": 6,
                            "created_utc": 1652652305.0,
                            "response": "🙏🙏 Thank you",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8rbffo",
                    "author": "thcdumpster16",
                    "score": 3,
                    "created_utc": 1652659396.0,
                    "response": "u/AOSPODCAST is it alright to store the coins in a hot wallet instead of a cold one?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8rboer",
                            "author": "AOSPODCAST",
                            "score": 6,
                            "created_utc": 1652659520.0,
                            "response": "IMO cold wallet is more secure because it’s not connected to the internet. I keep a small amount in a “hot” wallet for transactions but if you’re not trading I don’t see the reason to take that risk of having them so accessible.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8s0y97",
                                    "author": "ColdAtTheLake",
                                    "score": 2,
                                    "created_utc": 1652671741.0,
                                    "response": "I saw a tuber with all his \"wallet apps\" that he keeps synced once a week. All his backups are on a secure key and he encrypts everything.\n\nThere are lots of other techniques that use a variation of that method, but, there is nothing gained by storing all your assets in someone else's wallet.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8sdai9",
                                    "author": "thcdumpster16",
                                    "score": 1,
                                    "created_utc": 1652679499.0,
                                    "response": "Thanks for the response man. I’m here on the long hold. So yea I’m definitely gonna look into cold wallets.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8rkk44",
                    "author": "DCM88",
                    "score": 3,
                    "created_utc": 1652663741.0,
                    "response": "+u/sodogetip 1 doge verify\n\nI think I will try to move my doge to cold storage. I want them keys. It’s about time. I’m long on doge since I bought the 10th or 20th dip! :)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8r1b9i",
                    "author": "shanr1225",
                    "score": 2,
                    "created_utc": 1652654430.0,
                    "response": "Perfect....This is the way",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8r243a",
                            "author": "AOSPODCAST",
                            "score": 1,
                            "created_utc": 1652654814.0,
                            "response": "🙏",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8rqjm7",
                    "author": "shattypantsMcGee",
                    "score": 2,
                    "created_utc": 1652666477.0,
                    "response": "I saw something on twitter about the binance situation.  Very interesting.  I wonder how much open interests in short positions there are for doge.  Do you have access to that raw data?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8v92j7",
                    "author": "GG92Easterman",
                    "score": 2,
                    "created_utc": 1652734755.0,
                    "response": "Thanks for the great write up. My nano S is on the way and I'm taking everything out of WS. 🙏Bless ya'll.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8vfmaz",
                            "author": "AOSPODCAST",
                            "score": 1,
                            "created_utc": 1652737534.0,
                            "response": "🙏🙏💪",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8s2qvx",
                    "author": "Fulvio55",
                    "score": 1,
                    "created_utc": 1652672776.0,
                    "response": "This is not actually true. Some is, but not all.\n\nExchanges do NOT lend out your coins. You can see that, because the coins are held in cold storage by them. And they do not own them.\n\nCoins which are lent come from people who specifically opt in by what they think is ‘staking’. It isn’t. It’s unsecured lending, and if they actually read the fine print before signing up, they would understand they carry ALL the risk when borrowers default.\n\nSo yes, get your coins out of exchanges and into your very own text wallets stored offline on multiple removable media. Generate your transactions with a copy of coinb.in and always sign offline so you never expose your keys to potential thieves.\n\nBut don’t for a moment think you’re doing anything whatsoever to either the shorters or the price.\n\nBecause there will always be people prepared to take huge risks to get one or two percent on their money, and they will continue to supply the coins needed by shorters.\n\nAnd because absolutely NOTHING affects prices, other than bugging and selling activity. The price is simply whatever the last trade was struck at, and is not dependent on how many coins are minted, where they’re stored or how they’re used.\n\nYou want to move the price up? Start buying and keep buying at ever-increasing prices. And be aware that the moment you stop, the price will fall again.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8s4ycl",
                            "author": "AOSPODCAST",
                            "score": 2,
                            "created_utc": 1652674103.0,
                            "response": "Shorting is a sell order for an asset they have not purchased.  A “fake” sell at that. It’s negative pressure  on an asset. Buying and selling are indeed the weights that tip the scales, but leverage is what makes it questionable.\n\nThe wrap around tokens like BSC (Binance) and hiding proof of assets can make a strong case for lending/margin on crypto that’s not staked.\n\nIt’s common practice in the markets and most industries to lend (what they don’t own) to make a profit. Then of course they’ll put extremely low daily withdrawal amounts so it’ll be difficult to catch them in accounting. \n\nUntil all brokers show proof of assets it’s safer to say they’re all lending. I’m a firm believer if we’re not careful we’re going to get a mirror image of the stock market.  \n\nIMO shorting should be illegal anyway because you’re “selling” into a market at a strategic time to buy back later. Pure manipulation and disrupts the supply and demand scale.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8sghxk",
                                    "author": "Fulvio55",
                                    "score": 1,
                                    "created_utc": 1652681889.0,
                                    "response": "I’d agree that shorting should be illegal. But naked shorting already is illegal. Not to mention that’s it’s extremely dangerous, as we saw in the GFC.\n\nI find it hard to believe that there are any exchanges that would engage in naked shorting. If it went pear shaped on them, they would be left holding a VERY large bag of grief, and probably striped outlooks on life for years to come.\n\nAnd until all shorting is made illegal, which I doubt would ever happen, given that it would be really hard to police, the advice should remain ***’Don't lend your coins’***.\n\nBut good luck getting that through some people’s skulls.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}