{
    "subreddit": "Dogecoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "v1i2s8",
            "title": "Crypto is a Grift, and Elon Musk a Grifter, says Dogecoin Co-Founder",
            "url": "https://cryptoadventure.com/crypto-is-a-grift-and-elon-musk-a-grifter-says-dogecoin-co-founder/",
            "author": "bdinu89",
            "created_utc": 1653971290.0,
            "score": 4,
            "num_comments": 7,
            "subreddit": "dogecoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "iamm298",
                    "author": "lalvapalooza",
                    "score": 1,
                    "created_utc": 1653972094.0,
                    "response": "Lol. U mad bro?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iamn5o1",
                    "author": "B1ackmath",
                    "score": -2,
                    "created_utc": 1653972835.0,
                    "response": "He's not wrong. Crypto as it is now is just a big Ponzi scheme where new money provides liquidity for old money. This is why you hear the old bag holders cry \"HODL!!!\" when markets crash. It's not for you, it's for them. \n\nAlso musk is absolutely a fraud, a fluke, a grifter and an all around bad person.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iamngp5",
                            "author": "FreeHelicopterRidez",
                            "score": 1,
                            "created_utc": 1653973046.0,
                            "response": "Great take, Now do Wall Street and endless inflation. This should be fun.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iamste0",
                            "author": "baberuthbomber",
                            "score": 1,
                            "created_utc": 1653976933.0,
                            "response": "Lmfao yes Elon has his flaws, but Elon will go down in history as someone who has done more man-kind than almost any other person in the history of it.. while you throw stones at him, what have you done even remotely close to what he has done for man-kind?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iamtqla",
                                    "author": "B1ackmath",
                                    "score": 1,
                                    "created_utc": 1653977660.0,
                                    "response": "He's a rich guy who hired smart people. He's not some genius and he's not doing anything to better mankind, he just wants to be richer.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iamu1uw",
                                            "author": "baberuthbomber",
                                            "score": 1,
                                            "created_utc": 1653977911.0,
                                            "response": "Nothing to better man kind… yet he has developed the biggest electric car company in the world… he has developed a space company that has repeatedly taken equipment into space for man kind to learn, study, along with experiments for the space station… Musk has also donated money to carbon capture programs, while also providing internet within Ukraine, and Tonga after the massive volcano eruption…\n\nYou meanwhile have accomplished nothing but look like a utter and complete moron…",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}