{
    "subreddit": "Dogecoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "urxvvh",
            "title": "Part 2 Remove Your Coins From Exchanges (How Shorts Are Manipulating The Price)",
            "url": "https://www.reddit.com/r/dogecoin/comments/urxvvh/part_2_remove_your_coins_from_exchanges_how/",
            "author": "AOSPODCAST",
            "created_utc": 1652825658.0,
            "score": 47,
            "num_comments": 20,
            "subreddit": "dogecoin",
            "selftext": "Hello #Dogecoin Community, \n\nMy name is David Mitchell Jr. and I have my second installment on shorts. This will take a deeper dive into mechanics and why it's important we work together to move your coins off of exchanges.This is a write-up from yesterday's video.  \n\nFYI (SideNote) If you see a post stating you don't need to move your coins, this is probably an institution spy account. I know it sounds crazy but Reddit and other platforms have been closely monitored since GME. Anything that will hurt their bottom line dramatically or put them in a position for a squeeze....they're going to try and prevent it.  Please bear with me.  \n\nBefore today's post, I want to thank all of you for sharing the last one on Reddit, Twitter, and Youtube. It reached over 300k people and counting. I saw so many posts & Videos over the last couple of days. The word got out quickly. \n\nWhy are #dogecoin shorts cancer to the community? Shorts within themselves are a form of leverage. With Shorts 1 Doge = 2 Doge\n\nA short is a derivative of the original asset. How? Your Dogecoin can't be positive and negative at the same time. If you purchase an asset and you're holding; it becomes positive or neutral buying pressure. If an exchange takes this asset and creates a sell order for it, they have done one of two things. They've either stolen your #Dogecoin and are hoping to put it back before you need it, or they created a synthetic #Dogecoin and they're hoping to remove it from circulation.\n\nAre you accusing exchanges of increasing the coin supply to dilute prices and encourage dips? Yes, it's basically what shorts are. You only make money when the asset goes down but you're creating the negative pressure you need within the short itself. Guess what happens, if retail buys more and they're at risk of losing money? You guess it! They short even more. \n\nI hate to be the one to say it but supply & demand don't completely set the price in the market. You have massive price interference from people who have not even purchased the asset. (Remember a short is borrowed and must be returned.) The negative pressure on a short is by something that tech doesn't exist yet, and they're using your assets to do it.\n\nFYI (Sidenote) Yes, they're different shorts and I'm not directly accusing a broker of naked shorting...(yet). Naked shorting is something Binance or any company could do as long as you don't see the proof of assets and they have a way of moving the coins undetected...like a BSC Token. \n\nThis can operate like a Dark Pool and create a mask for which coins can be exchanged at whatever rate they decide. If you can't see proof of Assets, it may very well be 3 to 1. All of the corruption we've seen in any market..comes from abuse of leverage. Right now, 2018,2008,2000 etc. \n\nSome may argue that only the #dogecoin that is staked is lent out for shorts. I have no concrete evidence of this but it makes no sense to me. Why would an exchange hold your crypto to no benefit of them for years? It's like a bank holding your money but can't use it to expand the bank...there's no point. I think until we have a proven system across the board and more regulation for transparency we must assume all exchanges lend at their discretion. The borrowing fee (lending rate) is a steady stream of income for them no matter what the economy is like.\n\nSo what happens next? \n\nThis is the good part. As #dogecoin is removed from exchanges it will become riskier to short. The proper term is easy to borrow and hard to borrow. \n\nFYI (Sidenote) Borrow fees can be as low as .3% and as high as 100% depending on the risk. Risk tolerance plays a huge role in this and will ultimately determine the lending rate (Borrow Fee). Interest is paid daily.\n\nAccess and availability determine the rate. The less access they have to #dogecoin, the more expensive it is too short. Removing mass amounts of #dogecoin will cause doge to switch to hard-to-borrow status. The exchanges will then try to extract more money from shorters by raising the rates. This cuts into the shorts profits and increases their risk of a margin call or worse.....squeeze. \n\nFYI (Sidenote) A shorter is a guaranteed buyer. You must return the share. This is different from a put option where you have a choice. Your (fake coin) must be returned to balance the books. \n\nWhat does this all mean? It means that moving your coins off of exchanges will have a deep domino effect. I do recommend the Nano wallet as I did in my last post. If you're a trader or want to have a small amount on hand for tipping etc I understand. However, for your long-term coins, it should be held privately, not only for you but for the community as well.  \n\nPlease feel free to tag me or share the content. I know this has become a popular topic now but please be careful where you get your information. YouTubers who don't fully understand this can rush you to move your coins you'll make a mistake and lose your coins. \n\nIf you're going with the ledger do not get it from 3rd party sites. People have lost access or have been scammed this way. Only go through the official website. [https://shop.ledger.com/?r=01f1d3f5672a](https://shop.ledger.com/?r=01f1d3f5672a)\n\nHere is this information in video format with charts. This is Part 2 \n\n1 Doge = 2 Doge?:\n\n[https://youtu.be/VhFomsACduw](https://youtu.be/VhFomsACduw)\n\nPart 1 of the Shorting Series:\n\n$.50 or $5.00 Doge\n\n[https://youtu.be/t\\_5P-ixjQNw](https://youtu.be/t_5P-ixjQNw)\n\nIntroduction To Shorts & Transfering Coins\n\n[https://youtu.be/nvCIbDj\\_qhA](https://youtu.be/nvCIbDj_qhA)\n\nWhat Are Shorts? \n\n[https://youtu.be/sVVYPRy5ovo](https://youtu.be/sVVYPRy5ovo)\n\nThese are my social media handles: \n\nYoutube: David Mitchell Jr\n\nTwitter: u/jrdavidmitchell\n\nReddit: AOSPODCAST",
            "stickied": false,
            "comments": [
                {
                    "id": "i90exkx",
                    "author": "Taronyu019",
                    "score": 5,
                    "created_utc": 1652831360.0,
                    "response": "That's right, who holds the keys has access to the coin and if not your keys, not your coin. Let's go to the moon faster by moving to your wallet of preference.\n\nWe are a Doge Nation and we do only good.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i911qi8",
                            "author": "AOSPODCAST",
                            "score": 2,
                            "created_utc": 1652842209.0,
                            "response": "📌",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i910w25",
                    "author": "4z5ky90d",
                    "score": 3,
                    "created_utc": 1652841789.0,
                    "response": "+u/sodogetip 4.20 doge verify",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i911ogb",
                            "author": "AOSPODCAST",
                            "score": 2,
                            "created_utc": 1652842181.0,
                            "response": "🙏",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i916ey8",
                    "author": "Igaff",
                    "score": 2,
                    "created_utc": 1652844630.0,
                    "response": "I have no idea wtf thus means but I’m gonna guess it’s not good",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i917q28",
                    "author": "shattypantsMcGee",
                    "score": 2,
                    "created_utc": 1652845359.0,
                    "response": "This could explain the withdrawal limits on RH.  They need to keep a certain amount on hand to lend out to shorts on Binance.  Can we get vlad to take a position on this?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i917vxx",
                            "author": "AOSPODCAST",
                            "score": 3,
                            "created_utc": 1652845450.0,
                            "response": "Correct, or they’re already lent and they don't want to have naked shorts. So they have to slow the bleeding",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i919f6a",
                    "author": "coolnick07",
                    "score": 2,
                    "created_utc": 1652846331.0,
                    "response": "Think of it this way. An exchange is like a shady unregulated bank that uses a single masterlock to secure their vault. If funds are stolen, you are screwed. Plus this puts a huge target on the exchange since they would have a lot of funds and because they use a lot different systems it makes them more vulnerable to hacks. Also to make things worse they don’t actually have all the funds to stay liquid so they lend out their customers money. Sometimes they don’t even have enough money and issue IOUs until you pull the money out. So if everyone pulled their money, the bank would be forced to fulfill those withdrawals and have to take out loans or buy a bigger stake in that currency.\n\nEssentially get yourself the dogecoin core wallet, paper wallet, text file, hardware wallet like a ledger, or a multi-coin wallet. Just don’t keep them on exchanges. I know they offer interest, but usually that just screws you when pumps or dumps happen because your funds are locked up until the earn time period passes or the exchange takes their sweet time to close out your earn position.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i91cktm",
                    "author": "Segi-pump",
                    "score": 2,
                    "created_utc": 1652848231.0,
                    "response": "Yes please remove your coin and store in personal wallets",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9097j8",
                    "author": "vegetablewizard",
                    "score": 1,
                    "created_utc": 1652828618.0,
                    "response": "I just keep buying Doge on Robinhood because I can purchase in any increment I want and DCA all week, but I do be hoping they create a wallet so I can HODL for real.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i912cbw",
                            "author": "FaceBillions24",
                            "score": 3,
                            "created_utc": 1652842517.0,
                            "response": "i dont think a robinhood wallet is the best idea. they can still \"lend\" your doge for shorts. why not get a wallet and move if you are only buying?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i912hwn",
                                    "author": "AOSPODCAST",
                                    "score": 2,
                                    "created_utc": 1652842596.0,
                                    "response": "📌",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i911pvc",
                            "author": "AOSPODCAST",
                            "score": 3,
                            "created_utc": 1652842200.0,
                            "response": "It needs to be your own wallet, not theirs",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i912f69",
                                    "author": "FaceBillions24",
                                    "score": 2,
                                    "created_utc": 1652842558.0,
                                    "response": "robinhood wallet still wont be completely yours thats the issue i have with it.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i90gt8h",
                            "author": "Patan40",
                            "score": 2,
                            "created_utc": 1652832279.0,
                            "response": "Why not transfer it to your wallet? Or don't you have access to transfer, yet.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i912yzr",
                            "author": "colorete26",
                            "score": 2,
                            "created_utc": 1652842841.0,
                            "response": "Move your crypto asap, before they take it from you. Get a ledger and download the app",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i91k4aq",
                    "author": "purpleefilthh",
                    "score": 1,
                    "created_utc": 1652853512.0,
                    "response": "\\+u/sodogetip 5 doge verify\n\nGreat explanation",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i91mwvc",
                    "author": "minthefield",
                    "score": 1,
                    "created_utc": 1652855718.0,
                    "response": "When you transfer from CDC what network do you use?",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "urybg9",
            "title": "Received this today. Will we be able to earn yield on our dogecoin?",
            "url": "https://i.redd.it/gyxq5dlh54091.jpg",
            "author": "Admin_Untold",
            "created_utc": 1652826915.0,
            "score": 2,
            "num_comments": 8,
            "subreddit": "dogecoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i90akls",
                    "author": "Patan40",
                    "score": 5,
                    "created_utc": 1652829265.0,
                    "response": "How many times on this sub can we explain that yielding your assets with an exchange is one of the worse things you can do?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i90dh61",
                    "author": "Silly_Dilly_94",
                    "score": 2,
                    "created_utc": 1652830655.0,
                    "response": "Don’t yield on an exchange. Similar concept of what banks do. They lend out your coins (including leverage trading), which ultimately hurts the Doge price. Leaving you with the yield percentage while they get most of the profits. Best thing to do for Doge is to get it off the exchanges and in a cold wallet.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i90m8kx",
                            "author": "wheeler748",
                            "score": 2,
                            "created_utc": 1652834845.0,
                            "response": "So what would you recommend as the better or best cold wallet?  Thx.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i90od7y",
                                    "author": "Silly_Dilly_94",
                                    "score": 2,
                                    "created_utc": 1652835848.0,
                                    "response": "Ledger is most popular and well known. I personally own a Nano X and love it. Another good brand is Trezor.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i908f2e",
                    "author": "vegetablewizard",
                    "score": 1,
                    "created_utc": 1652828246.0,
                    "response": "🅱️ased if true",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i91d28i",
                    "author": "Segi-pump",
                    "score": 1,
                    "created_utc": 1652848540.0,
                    "response": "Noooooo stay away !!! Just store your coins in cold wallet",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}