{
    "subreddit": "Dogecoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uxy20z",
            "title": "Taking my doge out of robinhood question",
            "url": "https://www.reddit.com/r/dogecoin/comments/uxy20z/taking_my_doge_out_of_robinhood_question/",
            "author": "AscendedDescent",
            "created_utc": 1653534188.0,
            "score": 2,
            "num_comments": 7,
            "subreddit": "dogecoin",
            "selftext": "So i been holding doge on RH for  more than a year and looking to take my doge out of the exchange. I signed up for their wallets so i could send it to my personal wallet out of RH. Last time I checked i was like #30,000 on the waiting list 2 months ago. Now I dont see any waitlist anymore  and still dont have the option to send my doge. Anyone facing a similar issue. Also I live in NY so not sure if there is any regulation going on in this state that may play a part.",
            "stickied": false,
            "comments": [
                {
                    "id": "ia0y8ez",
                    "author": "ElonaMusk212",
                    "score": 2,
                    "created_utc": 1653537709.0,
                    "response": "NY, Nevada, Hawaii still can't remove crypto from RH.\n\nThey say they are working on it....",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia0zdp5",
                    "author": "Taronyu019",
                    "score": 2,
                    "created_utc": 1653538405.0,
                    "response": "If you follow the steps to activate the wallet assigned to you by RH, you received an email to confirm. If you did all that and you are not in one of the states that cannot move the coin out, send an email to RH and bring to their attention that you already did your part and when are they going to give you access to the wallet.\n\nWe are a Doge Nation and we do only good.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia1ga1a",
                            "author": "Fulvio55",
                            "score": 1,
                            "created_utc": 1653551048.0,
                            "response": "Did you miss the NY part? He’s screwed.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia18sn6",
                    "author": "NorCal_925",
                    "score": 2,
                    "created_utc": 1653544903.0,
                    "response": "I just started transferring Doge from Robinhood to my Ledger wallet. I couldn’t do it on the desktop RH app. I could only transfer from my phone app. Click on Doge in your phone app and scroll down passed “Buy” “Sell” and there should be buttons for “Send” “Receive “",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia1gan9",
                            "author": "Fulvio55",
                            "score": 1,
                            "created_utc": 1653551064.0,
                            "response": "Won’t work for New Yorkers.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia1g89p",
                    "author": "Fulvio55",
                    "score": 1,
                    "created_utc": 1653551006.0,
                    "response": "They don’t have any wallets. Or rather, you don’t. All you have is permission to request that they send you coins.\n\nBut…\n\nOne of the many conditions and restrictions is that they won’t send to New Yorkers. So you’re basically screwed.\n\nMove interstate. Surely you have a friend somewhere else who’s address you can use?\n\nOtherwise, sell up, get the cash out and buy somewhere that complies with state laws.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia0ucjj",
                    "author": "Economicgod",
                    "score": 0,
                    "created_utc": 1653535490.0,
                    "response": "\nJune 1 is the day all uses of removing the coins from the exchanges we’re going to show them that they cannot show at the market in our community",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uxy294",
            "title": "If you're not already into hockey, we've got this, so check it out",
            "url": "https://v.redd.it/dl5b09nmkq191",
            "author": "cote112",
            "created_utc": 1653534208.0,
            "score": 5,
            "num_comments": 1,
            "subreddit": "dogecoin",
            "selftext": "",
            "stickied": false,
            "comments": []
        }
    ]
}