{
    "subreddit": "Dogecoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uqp3w7",
            "title": "Great work crew. Stabilizing around 9c was today's goal set out yesterday. As usual it went really well. It's Sunday night so the demo is wrapped up.",
            "url": "https://www.reddit.com/r/dogecoin/comments/uqp3w7/great_work_crew_stabilizing_around_9c_was_todays/",
            "author": "neomancr",
            "created_utc": 1652681230.0,
            "score": 0,
            "num_comments": 6,
            "subreddit": "dogecoin",
            "selftext": "https://www.reddit.com/r/dogecoin/comments/uq4ytd/keep_up_the_good_work_guys_its_sunday_morning_as\n\nThere's the play by play for informational purposes.\n\nNote as usual we are not pump and dumpers. And slow and steady growth is the plan. When things get too hot it's subject to exploitation since we literally state our plans openly the day prior and even during the demos.\n\nThat was fun. Keep it steady and slow growth is the goal. Setting doge to keep steady at around 9c today is only meant to solidify which allows for next demos... TBA.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8sgmjd",
                    "author": "DREAM_WORX",
                    "score": 1,
                    "created_utc": 1652681988.0,
                    "response": "Are you in a fantasy land or what?\n..so what do you think about charting or analytics?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8smldz",
                            "author": "neomancr",
                            "score": 1,
                            "created_utc": 1652686885.0,
                            "response": "I think it's all fake. You can literally see a play by play as we literally manipulate the market according to a plan stated literally publicly yesterday.\n\nCharting and analytics is meant to create a self fulfilling prophecy just like a \"the best part of waking up\" makes you finish the stupid spell in your head and think of coffee. \n\nPeople will scale and zoom charts to try to make it appear any way they want. That'd why I specifically only use wysiwyg charts I can't scale or zoom. \n\nThats the point of the time stamped call before action, to recruit as many hands on deck as we could, then orchestrate the /everything step by step to achieve our goal.\n\nOur goal was set for the am and was to keep doge stable at around 9c you can literally see in full transparency what that took including the sub routines like warning everyone to keep it steady and don't be icarus, that if it gets too hot looting will happen and LTC was spotted as a leech so as stated if it persisted we'd break it which we did. There'd a whole chain of stating goals and achieving them literally time stamped in sequence.\n\nThe narration doesn't just work to rally everyone but keeps a time stamped sequential record of tactics like flooring LTC once we realized it was leeching from doge while everyone else held doge steady. Typically flooring a tethered pair causes both to fall. In fact that's how you prove it. \n\nhttps://imgur.com/a/mzYVcm8\n\nThere was another example of LTC tethered to doge and a literal flip book style sequential screen shot set of our driving LTC down suddenly to prove it would cause doge to fall in tandem. \n\nWhen doge is being held steady you can quickly knock LTC down just as literally happened during the demo which has consequences pre stated and literally occurred as stated play by play.\n\nThe challenge to our plans is that although we are globally strong we have a weak zone right last prime time wear coast I. E. Australia / Hawaii time\n\nIt's been documented several times and we can't fill that gap. It's apparently too fool of btc maxis is the theory.\n\nhttps://www.reddit.com/r/dogecoin/comments/pl8pkb/time_check_wc_crew\n\nThe challenge of doing a live demo is pretty hard. But weve never failed before we prepare and we have the numbers behind us (except during our weak time zones) \n\nOur plans are always transparent and are either stated the day before clearly I e. We did not say \"we will pump doge or we will sink doge\" we said we will keep it stable around 9c\n\nWe do do quick actions like this which news bots literally stole credit from us and attributed it to a 210pm tweet which makes no sense.\n\nhttps://imgur.com/a/TFF1ZRp\n\nWhen we intend to drive things down we are also just as specific\n\nhttps://imgur.com/gallery/VBuTk6L\n\nWith exact numbers and even how it'll affect the market since it was heading into Monday market hours.\n\nThe warning is still there\n\nhttps://www.reddit.com/r/dogecoin/comments/u16ojf/remember_sometimes_the_only_way_forward_is\n\nI used the same screen shot citing the stocks sectors that'd be effect and if course tesla.\n\nThat was in response to inside word Monday would be a news drop meant to cause an Elon pump and dump.\n\nWe then reversed it and you can see exactly how it happened in reverse sequence.\n\nWe hit LTC then released it. 110 to 100 as stated exactly. Once the market began there was a sharp tear in exactly the stocks we warned about at 1130 Sunday night. \n\nhttps://imgur.com/a/9gnICVt",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8si78b",
                    "author": "vw214",
                    "score": 1,
                    "created_utc": 1652683233.0,
                    "response": "Next stop: $0.05.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8sk07m",
                            "author": "neomancr",
                            "score": 1,
                            "created_utc": 1652684677.0,
                            "response": "If you'd like. The whale struck after wrap up. Doesn't really matter. We can recoup during the AM. Run another demo if needed.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8snaof",
                    "author": "DREAM_WORX",
                    "score": 1,
                    "created_utc": 1652687496.0,
                    "response": "You missed a lot and went a wrong way but this is not a battle of anything but making things better for all!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8sft3c",
                    "author": "neomancr",
                    "score": -1,
                    "created_utc": 1652681350.0,
                    "response": "Past 5pm tj time is typically when we're weakest unfortunately and it still seems to be the case. \n\nhttps://www.reddit.com/r/dogecoin/comments/pl8pkb/time_check_wc_crew",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uqp1lx",
            "title": "Where are you HODLing your Dogecoin?",
            "url": "https://www.reddit.com/r/dogecoin/comments/uqp1lx/where_are_you_hodling_your_dogecoin/",
            "author": "hdhwhshdhdhwvwixudg",
            "created_utc": 1652680960.0,
            "score": 4,
            "num_comments": 10,
            "subreddit": "dogecoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8sfbfr",
                    "author": "908123560981309",
                    "score": 3,
                    "created_utc": 1652680984.0,
                    "response": "Dogecoin to the moon!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8sfoqy",
                            "author": "NewConsideration3210",
                            "score": 3,
                            "created_utc": 1652681257.0,
                            "response": "You're holding your Dogecoin on the moon?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8sgc3r",
                                    "author": "hdhwhshdhdhwvwixudg",
                                    "score": 1,
                                    "created_utc": 1652681762.0,
                                    "response": "🤣",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8sfmse",
                    "author": "Taronyu019",
                    "score": 2,
                    "created_utc": 1652681215.0,
                    "response": "Ledger S",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8sfxl7",
                    "author": "trashbuged",
                    "score": 2,
                    "created_utc": 1652681447.0,
                    "response": "Ledger Nano + Dogecoin core wallet",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8sgq4o",
                    "author": "cryptodagod212",
                    "score": 2,
                    "created_utc": 1652682060.0,
                    "response": "Ledger Nano X",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8siebk",
                    "author": "StonedSquirrel69",
                    "score": 2,
                    "created_utc": 1652683386.0,
                    "response": "In my wallet",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8srqry",
                    "author": "restingjay",
                    "score": 1,
                    "created_utc": 1652691542.0,
                    "response": "Gemini saving for a cold wallet... which would you guys recommend",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8srvej",
                    "author": "halker2010",
                    "score": 1,
                    "created_utc": 1652691654.0,
                    "response": "some random gambling site.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}