{
    "subreddit": "Dogecoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uyxaj3",
            "title": "Cat out of the bag... A quick refresher on why doge is so significant as to be the de facto crypto reserve currency. And why just as we called years ago crypto is no safe haven.",
            "url": "https://imgur.com/gallery/xbWJSnZ",
            "author": "neomancr",
            "created_utc": 1653654977.0,
            "score": 12,
            "num_comments": 20,
            "subreddit": "dogecoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "ia6q5ol",
                    "author": "neomancr",
                    "score": 2,
                    "created_utc": 1653655305.0,
                    "response": "That doesn't mean it's \"worthless\" it's a financial instrument to be played. The velvet glove is but a dusty iron fist that's been still for too long. And we can be the fist if we gather out efforts. But there are rules to boxing, rules to mma. The opponent isn't who you might think it is. Fine some may be obvious blakrcock is pretty bad",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia6r9we",
                            "author": "Reality-Bytez",
                            "score": 3,
                            "created_utc": 1653655897.0,
                            "response": "Blakrcock.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia8mhd8",
                                    "author": "neomancr",
                                    "score": 1,
                                    "created_utc": 1653685247.0,
                                    "response": "Yea i like that.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "ia7881q",
                            "author": "RotoscopingEyeHoles",
                            "score": 2,
                            "created_utc": 1653663640.0,
                            "response": "Cool. Wanna LARP later?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia8pong",
                                    "author": "neomancr",
                                    "score": 2,
                                    "created_utc": 1653686774.0,
                                    "response": "Yea you can dm. Either way works.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "ia6r0hs",
                            "author": "soft-serve69",
                            "score": 1,
                            "created_utc": 1653655761.0,
                            "response": "Bruh what",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia6sksg",
                    "author": "Monkey_1505",
                    "score": 1,
                    "created_utc": 1653656570.0,
                    "response": "We?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia99dcs",
                    "author": "neomancr",
                    "score": 1,
                    "created_utc": 1653696576.0,
                    "response": "And to help with the whole demystification of Hacking.\n\nAnyone IS a hacker. You just don't remember all the times you have hacked your way through something which is a good thing, it likely means you used a broad array of talents so broad you wouldn't even associate it to \"Hacking\". Hacking, cracking, phreaking(maybe making a come back but currently depricated... Or am I just saying that? =P), coding, programing, scripting, social engineering, reverse engineering, keistering plans across security zones, are actually all different things even though they often overlap they are all used like specialized tools in conjunction or in sequence. For some reason the word Hacking caught on but what people using mean when they say Hacking is cracking, I e bypassing security. Hacking is everything and everyone does it. The first guy who ddosd the hell out of a stick discovered the fire bug. That exploit led to many things good and bad. \n\nThats pretty much how Hacking world's. Curiousity begets, so what happens if... Begets many things good and bad. \n\nPsy ops whether product placement, thank you bernays, or spamming a certain minority perspective to the point it would appear on social media to be somewhat popular or even maybe a prevailing opinion where there was once a vacuum, flat earthism? Jews from space? The holocaust didn't happen.... (yet)... Are all Tay bot style cyber turfing. 70% of Elon supporters are farmed bots which is why they all share the same exact writing style opinions rapid response defensive stances, the gish gallop that's become the scorched earth policy of the alt right. (if you are gonna lose the topic, derail. Derail and derail. Make sure no topic you could lose end in anything but a vague sprawl of what about isms) \n\n\nIf you ever were too lazy to rehearse for a live performance for a cover gig and you figure \"hey I know I can play jazz I'll just do whatever\".\n\nYou play with the gusto of someone who practiced his heart out. The crowd cheers. You the entire time were just improvising and just making sure not to hit any sour notesnabd got through the set and made your 20 dollar cut. (yea we do it for the passion)\n\nThat while entire show you just out on was Hacking.\n\nYou social engineered the audience with your nice setup. You know how to move to to the music in a way that people expect a masterful guitarist to move. You knew where you can throw in a lick that you knew would always work. You know the arrangement well enough to place the lick and land it on the right note before the transition and pulled it off by the seat of your pants all the while you look like you were completely prepared.\n\nIn that one gig you hacked your way through the performance the band tells you you did a great job. Hackers usually have a sort of low self esteem since they see through their own crutches and known they're really just doing whatever they can to improvise and get through the moment and were in reality clinging on to every beat by a thread but like Spiderman you just keep slinging those webs wherever they land and go forth as you go while dodging catastrophe. If you had not worn the Spiderman suit you'd not have social engineered yourself into gaining the credibility that you're a web slinger.\n\nEveryone is a hacker.\n\nIn my generation most of us seemed to start off rom Hacking or through pirating software by bypassing copyright protection to plaster your name to the torrent.\n\nThe first time j hacked a computer was in 2nd grade. I wasn't allowed to use the computer and didn't have my own so j realized if j can sneak the case off (and j always had a screw driver and keys too all the vending machines and cabinets since I snuck in while the school was being remodeled, the keys were all in the locks, went to a friend's dad, found all the matching keys so realized I only had to copy 6, then brought the keys back which have me carte Blanche.\n\nTo cover up for my theft I learned how to pick locks. So whenever necessary they'd felt on me to open things up for them. I could have used my key if necessary but would rather just pick the lock manually... Others would say \"hey just give up already\" and I'd say \"dude this isn't a cartoon it takes time\" and either I'd manually pick the lock or if it was taking too much time I'd just sneak my key out and open it...\n\nThats the mindset of a hacker.\n\nSo back to the computer story, no I didn't guess passwords (although I worked myself into the library and literally got everyone's social security numbers since that was their student ID, my God was Kevin mitnick right)\n\nI did what anyone know knew anything about electronics did. I surreptitiously opened the computer and removed the battery and replaced it with a dead battery and bam no more cmos password and \"I have no idea why the bios keeps resetting on it'd own\"\n\nHacking is that random yet simple. Circa 1996 you can ftp into pge and go through all their account info. Their password was admin admin. That was a case of guessing passwords that I the used to extrapolate ccs (since I'm not actually a thief) so I can buy my way into irc channels to learn more since at the time a month of AOL was currency.\n\nHacking isn't at all what it's portrayed to be and it's completely improvised manner that it's applied is what makes it impossible to stop. All systems have rule sets all rule sets have vulnerabilities and learning what is possible by discovering the glitches or vulnerabilities is I guess the only metric for how \"good\" a hacker is.\n\nCase one: xda wanted to get the original pixel exclusives to work on the galaxy S7, the OG pixel was released right after.\n\nWhile they toiled through rom Hacking and rooting, I reverse engineered knox to use as a weapon to spoof the pixel and got all the pixel apps to work that way.\n\nWhich actually took more skill? I honestly think my way was easier and less destructive but I would admit the rom hackers probably applied more skill. If the amount of skill applied is a metric then they were better than I was but regardless we both ended up achieving our goals. My way required no rooting and was non destructive. Their way encouraged people to root their devices which was a victory for them.\n\nI suspect that's why the first thing they always do is encourage you to root since rooting your device makes it vulnerable. And social engineering others into granting root access to their personal devices and worse installing some dudes rom completely trusting that the dude had no ill intent at all is called social engineering with aspects of crowd anonymity by default.\n\nEveryone is a hacker. If you want to help you can..\n\nThere's nothing at all magical or hard about Hacking anymore than someone who has the random urge to do this:\n\nhttps://imgur.com/a/j7gFwJL\n\nI've heard it said that Hacking is a mind set and I'd agree but it'd also a very social mindset and it's helpful to see the world through what I call a metascope. Whatever is isn't what it is its always whatever it could be by your actions, or if not will just be left to the loving wrath of nature. Either is fine. But if you wanna have fun you wanna borrow from nature for as long as she'll permit. If all the world's a stage to an actor to a hacker all the world is a play ground. And you're allowed to have 2 Donatellos and no Leonardo if you want to play that way.\n\nWe did a call a while ago. Then another right here. If anyone is interested in learning more ask anyone is willing to help because the better off everyone else is the better off we all are.\n\nThats an axiom. Those who disagree with such a basic axiom choose to be the enemy but we don't \"make enemies\" they make themselves and even they are invited fully aware they'll take our plans spin them go to 4chan pretend to be some \"high up there Chinese business dude who will be the ones responsible\" for what we had planned to spin more hate. The plans we set in motion go as planned, the infiltrator then advances his agenda that China is attacking us. A good friend of mine whose been in a family church for something like 3 generations leaves in disgust by how racist the church has become. He's happa so \"no we don't mean you we mean the Chinese\"\n\nHaving the metascopic mindset is akin the the matrix vision or something since we're always soft pressured by agitprop. Seeing through it and from whence is it's source helps. It also inspires hope because you don't fall for the \"hey the white guy had a celtic cross he must be a nazi\" because you know nazis cooted tnsh symbol and the celtic cross has nothing to do with nazis or Hitler and there was a celtic revival in the 1990s when the celts were finally no longer officially genocided.\n\nA father figure of mine snapped sense into me as a punk rock (poser) lol since I was playing in a punk rock band and told me that those facial piercings are now used just like they always were in the past: to mark slaves, white black Asian etc.\n\nSo I took my lip and eye brow piecing out. I didn't realize it wasnt just the most annoying upkeep routine and I'd lose beads umm... In someone else's mouth all the time. It truly was a way for me to mark myself as \"trouble\" which is bad social engineering. Luckily I'm young enough the piercings vanished. If I'd have left them in for like 5 years in pretty sure I'd still have scars. Self inflicted scars I was fooled into doing to myself, and paying for it, like 200 bucks. (though honestly with my glossy crimson hair it was worth the positive attention lol.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia9t6nz",
                    "author": "Suitable_Ice_4179",
                    "score": 1,
                    "created_utc": 1653707065.0,
                    "response": "Only the people on Reddit finds this stock meaningful and I must say that was the only reason i invested too. But nothing about this stock shows it is going anywhere really. So sick of being lonely",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaa8a6o",
                            "author": "neomancr",
                            "score": 1,
                            "created_utc": 1653716834.0,
                            "response": "It's more than a \"stock\". There's a reason why we warned more than a year ago the entire market was being artificially inflated by crypto and cyrpto rather than being a safe haven that would supposedly shield from market volatility is the prime mover of volatility while each crypto is used as a shell game to pump and dump the market itself. That's why we published arbitrage data like this:\n\nAnd as recently as a few weeks ago before the crash gave a warning sign by orchestrating a drop of LTC from 110 to bounce at 100\n\nWarning the day prior: https://www.reddit.com/r/dogecoin/comments/u16ojf/remember_sometimes_the_only_way_forward_is\n\nhttps://imgur.com/gallery/IYTi3OV\n\nIn order to demonstrate the rebound as reported along here: https://www.reddit.com/r/dogecoin/comments/u22y5d/so_as_per_the_routine_heres_the_follow_up_from\n\nhttps://imgur.com/gallery/jvJw5XH\n\nThe move was timed in response to an attempted pump and dump due the following Monday that we for word of days prior that Ęlon had planned as a \"fundraising event\" which we suppressed allowing us to achieve 3 things at once.\n\n1. Sabotage the planned \"fundraising event\" that would have ripped off the community and further tarnished doge as a p and d. \n\n2. Demonstrate the flow patterns between the stocks and the cryptos cited.\n\n3. The original over arching goal started a week prior, which was to break the arbitrage that was occurring between Ðoge and LTC. Ðoge and LTC are routinely arbitraged pairs and severing them is strategic which was a goal that needed to be accomplished before the Elon Twitter thing. \n\nhttps://imgur.com/IRiEO9u\n\nhttps://imgur.com/a/C2mSScx\n\nYou might be surpised if you're new how much actually happens but isn't really said or appears or is otherwise rapidly shoved down by the meme machine. \n\nhttps://www.reddit.com/r/dogecoin/comments/tjdq4c/all_were_doing_is_exactly_what_we_say_which_is\n\nWeve been staging demos about this for more than a year.\n\nWe used to do this all live right out in the open here until the Ęłon chatter bots took over and turned it into a meme drain/abused the ratio system and report button etc with their swarm of auto generated accounts like this:\n\nhttps://imgur.com/gallery/2RGX9ij\n\nTypically we counter bot and aim for stability.\n\nhttps://imgur.com/a/Jp8yrNn\n\nBut sometimes it's necessary to warn people of things to come with larger crypto / market tumbles like a calendar year ago to spread the word.\n\nThis is MP, which pipelines out of bch\n\nhttps://imgur.com/a/XQADie4 - note MP is a stock and so it's graph only charts market hours. It'd be even more 1 to 1 as an arbitraged pair of both were 24/7.\n\nThis is the purpose of the 3 queens that are used to keep btc inflated by diverting the momentum.\n\nhttps://imgur.com/a/3tdS9JN\n\nHere's MP again since no one is Cherry picking. This is exactly how it's looted. The panel on the left is during the price sell off where wash sales are used to drive the price down. The trailing oughts are b'oughts. The panel on the left is literally right after the chart bottoms, the b'oughts proceed to doge to run a quick pump, where Ęlon then drops a tweet 99 percent after the price has always been pumped so that anyone who gets the need would have statistically no chance to actually make any gains and would just be buying high.\n\nhttps://imgur.com/IK3v8Sq\n\nThe exchange b'oughts then cash out laundering their money out tax free.\n\nEveryone else is left holding the bag.\n\nThis is why the doge committee has always been anti Ęlon but just like the Donald with enough spam bots it would appear as if this sub \"loves\" being exploited. And no one remembers SNL.\n\nBut we do... And we have it all on video.\n\nYou can find posts from like 2 years ago of us explaining the \"hyper speed musical chairs\" system sometimes called \"hyper speed shell game\".\n\nAlthough people act surprised that crypto is crashing often before the market does when it's \"supposed to be e gold and a shelter from inflation, economic down turns\" etc we've proven time and time again that it's not only nothing of the sort but quite the opposite.\n\nThe controlled drop of LTC from 110 to 100 and the subsequent fall of all the stocks only to bounce as if off an invisible floor when LTC hit 100 was just a microcosm used to demonstrate how the game works.\n\nLook at the rebound once LTC was allowed to recover. The sequence is like clock work.\n\nhttps://imgur.com/gallery/ddOaOs3",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iaavelj",
                                    "author": "Suitable_Ice_4179",
                                    "score": 1,
                                    "created_utc": 1653737003.0,
                                    "response": "So meme stocks are done?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "iaa8vgc",
                            "author": "neomancr",
                            "score": 1,
                            "created_utc": 1653717292.0,
                            "response": "I know that's a lot to read but it's worth it. I promise. For 2 years we warned about all of this and it's only become more relevant true and blatant now.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iaauhkp",
                                    "author": "Suitable_Ice_4179",
                                    "score": 1,
                                    "created_utc": 1653736306.0,
                                    "response": "What's that?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "id": "uyx3oy",
            "title": "Has anyone noticed?",
            "url": "https://www.reddit.com/r/dogecoin/comments/uyx3oy/has_anyone_noticed/",
            "author": "Automatic-Mall-3276",
            "created_utc": 1653654313.0,
            "score": 7,
            "num_comments": 7,
            "subreddit": "dogecoin",
            "selftext": "I have noticed some of the coins are changing their cap supplies from a maximum to unlimited amounts, please everyone needs to keep a close eye on these changes as they will devalue your coins next to zero, so much for decentralization 😂 . (Doge has remained legit.) I have changed my comments from before.",
            "stickied": false,
            "comments": [
                {
                    "id": "ia6onva",
                    "author": "liquid_at",
                    "score": 3,
                    "created_utc": 1653654474.0,
                    "response": "If it is a serious project, the blockchain is law and they can't just change it as they please.\n\nWhenever you see the developers of any project being able to just change things as they please, it is not a serious project.\n\nBut definitely don't trust any project to be legit just because it is crypto. That won't end well. \n\nPlenty of sketchy ones out there... Do your own research!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia6p7z3",
                    "author": "Automatic-Mall-3276",
                    "score": 2,
                    "created_utc": 1653654788.0,
                    "response": "Yeah you're correct, After Luna was able to keep adding coins way past their cap, I've seen this happening to other coins",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia6ymgi",
                            "author": "liquid_at",
                            "score": 2,
                            "created_utc": 1653659471.0,
                            "response": "luna was tied with its stable-coin and minting and destroying coins was part of the code.\n\nIf there had been a hard cap, the algo would not have been able to add more coins.\n\nLuna worked as designed... it just happened to be designed terribly.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia70czp",
                                    "author": "Automatic-Mall-3276",
                                    "score": 1,
                                    "created_utc": 1653660266.0,
                                    "response": "I guess it will be easy now to see which coins can be altered. I'm sure it'll keep happening.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia70wzb",
                                            "author": "liquid_at",
                                            "score": 2,
                                            "created_utc": 1653660515.0,
                                            "response": "oh yeah... crypto scams won't end any time soon.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}