{
    "subreddit": "Dogecoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uzd3zk",
            "title": "Bank issues",
            "url": "https://www.reddit.com/r/dogecoin/comments/uzd3zk/bank_issues/",
            "author": "INFOGAMERONLY",
            "created_utc": 1653702430.0,
            "score": 3,
            "num_comments": 33,
            "subreddit": "dogecoin",
            "selftext": "Hey guys, having issues with my bank (blackmailing me?)\n\nI withdrawed some money, a great amount. When i first withdrawed the money after like 4-5 days the bank sent me a message and asked me where the money is from. I answeared «from crypto» futher on they asked me to prove, i sent them the deposit from bank to exchange. Afterwards now they are asking for ALL the transactions and everything from when i deposited to when i sold and the wallets etc i been investing in lots of projects from memeprojects to being one of the first investor in safemoon,elongate etc \n\nI can not really give them all of this because i can not trace it neither do i want to give them all of this. I am really worried about this money, they will probably kick me out of the bank and flag me to other banks or blackmail me + report it to the police. The country is in nordic, denmark... anyone has any clue on what i should do? Can they just steal my money? I am so mad at them for all of those days...",
            "stickied": false,
            "comments": [
                {
                    "id": "ia9kvpj",
                    "author": "AdamarilloSlim24",
                    "score": 3,
                    "created_utc": 1653702670.0,
                    "response": "Sounds like you need some legal help.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia9kxda",
                    "author": "Detilly83",
                    "score": 2,
                    "created_utc": 1653702695.0,
                    "response": "I think you should call the police and sue them.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia9l56f",
                            "author": "INFOGAMERONLY",
                            "score": 0,
                            "created_utc": 1653702813.0,
                            "response": "Wont do the trick..",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia9ljzw",
                                    "author": "Detilly83",
                                    "score": 2,
                                    "created_utc": 1653703034.0,
                                    "response": "I thought Danemark was in the top ten happiest countries. But it sounds like the USA, where they want to criminalize society.\n\n\nMy bad.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia9lrar",
                                            "author": "INFOGAMERONLY",
                                            "score": 1,
                                            "created_utc": 1653703144.0,
                                            "response": "That’s what they are doing. Including sweden,norway aswell... i am fine with paying the tax, not any issues with that but they wont even let me get to that point.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia9mvmq",
                                                    "author": "Detilly83",
                                                    "score": 2,
                                                    "created_utc": 1653703739.0,
                                                    "response": "I've never been asked by my bank where my money is from. If they ask me that, I would close my account and go somewhere else. That's harassment. If they have suspicion about something, they should not investigate. That's the dumbest thing to do. What if they investigate someone from the mafia? They could be killed! If they have suspicion, they will call the police. What will the police do? If it's about a lot of money, they talk to you and they will ask you where the money is from and you will answer what you wrote in your first message. And, that's it.\n\nSeriously, find a better bank.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "ia9ncun",
                                                            "author": "INFOGAMERONLY",
                                                            "score": 0,
                                                            "created_utc": 1653704002.0,
                                                            "response": "Yeah the real issue is that they will flag me to other banks. What they are worried about is «money laundering» at my case this is not the case. But they are sucpisous... and they would mail me to the other banks and here i am left with a checknote and not anything more than that..",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "ia9ni6x",
                                                                    "author": "Detilly83",
                                                                    "score": 0,
                                                                    "created_utc": 1653704080.0,
                                                                    "response": "If they do that, you will have to sue them. Will they really try to ruin your life? If so, it's really the shittiest bank ever.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "ia9nv1c",
                                                                            "author": "INFOGAMERONLY",
                                                                            "score": 1,
                                                                            "created_utc": 1653704267.0,
                                                                            "response": "They dont really care, and yes they will do it. Because if i dont prove them enough i am long gone from their bank and need to start talking with other banks and the same process will start there aswell until i am left with no other choise than just to fight for it until the end.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iaan2pq",
                    "author": "Awkward_Teacher2553",
                    "score": 2,
                    "created_utc": 1653729813.0,
                    "response": "Crypto is used for a lot of FinCrime - the bank is just doing its job. If it was legit just provide the trail and you have nothing to worry about",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia9le3b",
                    "author": "grant570",
                    "score": 1,
                    "created_utc": 1653702947.0,
                    "response": "They are probably required to verify it is legit by your government, so you will have to disclose the transaction trail.  Eventually governments will get this all directly from the exchanges, but until they have that you will have to trace it for them.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia9m3j1",
                            "author": "INFOGAMERONLY",
                            "score": 1,
                            "created_utc": 1653703321.0,
                            "response": "Well it’s legit by law. But they want all that info, it’s just too much to deliver. I didnt do anything like money laundering etc.. this is pure investment and deposit from exchange to bank. I am not sure if they ever can get this info and not sure if i ever will be able to provide this. So in this case they will freeze this money and a lawsuit will be filed and if they cant prove anything is done illegal they should give the money back ? ? ?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia9rfvu",
                                    "author": "clisterdelister",
                                    "score": 1,
                                    "created_utc": 1653706127.0,
                                    "response": "I’d make an appointment and disclose what is necessary. When I had my first large withdrawal  from an exchange, I actually notified the bank first. I’m in Canada so it’s probably a bit different, but banks here are required to disclose large transactions. \n\nAt the end of the day, if there’s nothing illegal, they won’t be able to keep your money. Just ask for clear directions of what documentation they need and ask why.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia9x4a0",
                    "author": "NorCal_925",
                    "score": 1,
                    "created_utc": 1653709218.0,
                    "response": "If you deposit large amounts of money (usually $10k +) you will be asked to “source” the funds. They do this in USA in the interest of national security: terrorist organizations laundering money, etc.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia9x7ei",
                            "author": "INFOGAMERONLY",
                            "score": 1,
                            "created_utc": 1653709267.0,
                            "response": "Yeah, i am aware of that now. But what choise am i left with? I can not provide it all, then what?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia9y1m8",
                                    "author": "Taronyu019",
                                    "score": 1,
                                    "created_utc": 1653709764.0,
                                    "response": "Don't you have emails with the confirmation of your purchase or sell of crypto?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia9xi24",
                    "author": "NorCal_925",
                    "score": 1,
                    "created_utc": 1653709441.0,
                    "response": "Are they keeping funds you’ve already deposited? You must have some type of statement from the exchange you received the funds from. Perhaps you can make small incremental deposits of $5000 or so",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia9xmtm",
                            "author": "INFOGAMERONLY",
                            "score": 1,
                            "created_utc": 1653709518.0,
                            "response": "Well this is just the start of their «process» as for now they are not keeping it but they are keeping an eye out for every transaction and wont let me transfer them for sure.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia9xtj4",
                                    "author": "NorCal_925",
                                    "score": 1,
                                    "created_utc": 1653709632.0,
                                    "response": "Did you deposit a check? It sounds like your funds are just on hold till the funds clear. Could take up to 15 days.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia9xxkx",
                                            "author": "INFOGAMERONLY",
                                            "score": 1,
                                            "created_utc": 1653709699.0,
                                            "response": "I did SEPA deposit and it did arrive. It’s not on hold, would be better if they just sent it back tbh.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "ia9y37a",
                                    "author": "NorCal_925",
                                    "score": 1,
                                    "created_utc": 1653709790.0,
                                    "response": "Sorry. I just reread your message. That’s good they are not keeping your money. If you’re not up to any illegal activity you should have nothing to worry about and they’ll elect to not watch your transaction so closely.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia9y844",
                                            "author": "INFOGAMERONLY",
                                            "score": 1,
                                            "created_utc": 1653709872.0,
                                            "response": "Np buddy, hoping for the best expecting the worst tbh.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iaa2hz0",
                    "author": "sangderenard",
                    "score": 1,
                    "created_utc": 1653712626.0,
                    "response": "Check exchanges you've used to see if they have a function to generate tax reports for you",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaa703v",
                    "author": "shattypantsMcGee",
                    "score": 1,
                    "created_utc": 1653715869.0,
                    "response": "Sounds like you should buy Bitcoin!  We do good every day here..",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaaoh3r",
                    "author": "liquid_at",
                    "score": 1,
                    "created_utc": 1653731086.0,
                    "response": "European Banks are legally required to ensure that customers don't do tax-evasion.\n\nSome interpret it as it being ok to move money from terror organisations, others interpret it as them having to become a terror organisation against their own customers... \n\nEither way, they can do it and if you don't like it you can't be their customer.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaaqfj5",
                    "author": "netsecrobb",
                    "score": 1,
                    "created_utc": 1653732899.0,
                    "response": "I deposited $175,000\nBank wanted to know where it came from\n\nResearch money laundering reporting laws",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iabdfrw",
                            "author": "INFOGAMERONLY",
                            "score": 1,
                            "created_utc": 1653747739.0,
                            "response": "Well, i already told them where it came from tho.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iac7b1v",
                    "author": "SargoDarya",
                    "score": 1,
                    "created_utc": 1653761866.0,
                    "response": "Yo, this is common actually for 2 purposes, namely tax and anti money laundering. It's not black ailing but they are required by law to do it.\n\nThere are some tools out there which can generate a paper trail for you and document all transactions and use some existing APIs from exchanges like Binance for example. Just look around a little and don't lose hope.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}