{
    "subreddit": "Dogecoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "v0kzae",
            "title": "Say if you had a $1,069 bucks?",
            "url": "https://www.reddit.com/r/dogecoin/comments/v0kzae/say_if_you_had_a_1069_bucks/",
            "author": "Direct_Difficulty610",
            "created_utc": 1653860101.0,
            "score": 2,
            "num_comments": 0,
            "subreddit": "dogecoin",
            "selftext": "Would it go into Dodge or Shib?",
            "stickied": false,
            "comments": []
        },
        {
            "id": "v0kufc",
            "title": "SpaceX shows interest in Elon's Dogecoin payment option for its merch. What'll be the outcome? Will Elon Factor work this time for SpaceX?",
            "url": "https://www.reddit.com/r/dogecoin/comments/v0kufc/spacex_shows_interest_in_elons_dogecoin_payment/",
            "author": "Bowserdku",
            "created_utc": 1653859696.0,
            "score": 49,
            "num_comments": 8,
            "subreddit": "dogecoin",
            "selftext": "Elon made a statement a few months ago regarding accepting Dogecoin as payment for its organization's merch and confirmed it again last week. \n\nAccording to Cointelegraph, SpaceX, one of the companies managed by Elon, has given the green light to Elon's decision. \n\nElon has remained the most known personality of De-Fi space. His statements impact the community a lot. Hence, due to such influence, Elon is sometimes determined as one Factor.\n\nI thought SpaceX won't be affected even if Elon's influence works or not. However, if it works, it will support the De-Fi space and also urge other platforms to regulate token payments.\n\nIt might be this is the only reason SpaceX accepted this proposal, as it has now attracted the De-Fi community towards its merch.  \n\nPresently, web3 and De-Fi have already entered social media platforms like Twitter, Instagram, and Spotify. As DogeCoin can be now utilized in shopping merch, there are already numerous tokens present with different utilities. Sand and TokLok token are great examples. Sand allows users to purchase digital assets and land in its Metaverse. With TokLok tokens, you can enjoy paid messaging app which erases data even for its database to give your privacy all for free.",
            "stickied": false,
            "comments": [
                {
                    "id": "iah8kbt",
                    "author": "1tMySpecial1nterest",
                    "score": 2,
                    "created_utc": 1653863791.0,
                    "response": "Anyone keep track if Tesla held or sold it’s Dogecoin?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iahdmak",
                            "author": "Dogekaliber",
                            "score": 2,
                            "created_utc": 1653866425.0,
                            "response": "I think only Mishaboar would know that",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iahi63l",
                    "author": "Whatwhat0420",
                    "score": 2,
                    "created_utc": 1653868831.0,
                    "response": "If merch is moonrocks",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaiwr0z",
                    "author": "CoverPositive8639",
                    "score": 1,
                    "created_utc": 1653900561.0,
                    "response": "رابط موقع",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaj28er",
                    "author": "TopBanana312",
                    "score": 1,
                    "created_utc": 1653905541.0,
                    "response": "Yes. Definitely. Being able to buy a spaceX mug with doge will sky rockets doge value. Buy more now!! 🚀",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}