{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "v0xuxg",
            "title": "Billionaire Bill Miller Says Upcoming Ethereum Upgrade Will Leave Bitcoin With One Massive Advantage Over ETH - The Daily Hodl",
            "url": "https://dailyhodl.com/2022/05/28/billionaire-bill-miller-says-upcoming-ethereum-upgrade-will-leave-bitcoin-with-one-massive-advantage-over-eth/",
            "author": "Michellerose6834",
            "created_utc": 1653909064.0,
            "score": 0,
            "num_comments": 35,
            "subreddit": "ethereum",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "iaj89d3",
                    "author": "mathiros",
                    "score": 12,
                    "created_utc": 1653910451.0,
                    "response": "“And if you own 50% of the Ethereum, you decide what’s going to happen with it, and nobody else can say it. That’s a problem that Bitcoin doesn’t have. It’s truly democratic.”\n\nWrong. Because you cannot vote, participate in governance or influence anything, because ETH isn’t a governance token.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iajasns",
                            "author": "Kristkind",
                            "score": 2,
                            "created_utc": 1653912228.0,
                            "response": "You can stake a competing fork though, right?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iajeltl",
                                    "author": "domotheus",
                                    "score": 7,
                                    "created_utc": 1653914638.0,
                                    "response": "Yeah, just like how miners can mine of a competing fork too if they want",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "ial4m9y",
                                    "author": "Perleflamme",
                                    "score": 2,
                                    "created_utc": 1653943840.0,
                                    "response": "Which means you're leaving the main chain and not having any stake in the main chain anymore. \n\nYou'd better be very convincing about the upgrades you'd make in that fork, because that's how people will end up valuing your fork.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ial5kt1",
                                            "author": "Kristkind",
                                            "score": 1,
                                            "created_utc": 1653944301.0,
                                            "response": "Makes sense while it's being upgraded. Less important in an ossified protocol. Although tied in assets like stablecoins make it much more complicated of course. I'm just going through hypothetical scenarios of a contentious fork btw.\n\nI mean it basically goes back to the same assumption as PoW: if you owned 50%+ of the asset, is it worth risking it all?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ial6n0z",
                                                    "author": "Perleflamme",
                                                    "score": 1,
                                                    "created_utc": 1653944804.0,
                                                    "response": "How could a contentious fork arise if it's still owned by only one manager, even though decentralized? By having a fork of the decentralized manager with a copy pasta of the smart contract? Why not. \n\nIt would be great to be able to cover that case, I agree, as it would solve all issues about liquidity, as liquidity should never be owned by a decentralized manager (it provides misaligned incentives to steal this liquidity through a grab of consensus power: 51% of consensus power means grabbing 100% of liquidity).",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "iajc2v9",
                                    "author": "SuperCryptoBr0",
                                    "score": 1,
                                    "created_utc": 1653913071.0,
                                    "response": "#💀🪦",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iajdbp8",
                    "author": "KoreanJesusFTW",
                    "score": 6,
                    "created_utc": 1653913857.0,
                    "response": "I guess Bill Miller is rich enough not to care about the details.\n\nIf you got in 2009 on BTC and didn't sell - you are rich. You can use that money to make more. Nothing stops you. What's the difference with ETH switching algos?\n\nOn the comparison on the consensus participation (32 ETH), you gotta have staking on BTC first before you can compare. Oh wait... there is wBTC (Wrapped Bitcoin) then you use/stake it in DeFI - but not native to Bitcoin. Still running on Ethereum.\n\nRegardless what happens, no one can stop people from using money to make more money.\n\n#We only have 1 planet and we are fucking it up. That's what's POS is all about.\n\nInstead of morons hating on innovation, change your bags/holdings to ETH instead but you know them Billionaires, right? All they say is \"I want... I want... I want...\"\n\n#Real TLDR; Bill is a fuckwit.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iajo87y",
                            "author": "dynamicallysteadfast",
                            "score": 3,
                            "created_utc": 1653919840.0,
                            "response": "No offence but I'm surprised this has upvotes\n\n\nYou're saying, PoW is bad, and that moving to PoS will get rid of PoW.  \n\nWhilst glossing over the valid concerns of the resistance of PoS to centralising forces relative to PoW.\n\n1. Moving to PoS won't get rid of PoW. PoW is here to stay.\n2. PoS Eth should hold up... but it's certainly different to PoW.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iak5njn",
                                    "author": "songbolt",
                                    "score": 2,
                                    "created_utc": 1653927850.0,
                                    "response": "\"PoW is here to stay.\" This is a circular argument at best - or else it's not even an argument, it's merely an unsupported premise - and can be said of any technology popular in its day.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ial0idl",
                                            "author": "dynamicallysteadfast",
                                            "score": 2,
                                            "created_utc": 1653941901.0,
                                            "response": "No its not.\n\nThere will always be some people that prefer PoW over PoS. It is a fundamentally different way of securing the network, and there will always be a % of people that favor it. \n\nAs long as there are people who favor it, they will mine.\n\nThis is nothing like betamax vs VHS. It's about using energy to secure the network vs using capital. Proof os stake does not do that. Nothing besides using energy to secure the network does that.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ial55ra",
                                                    "author": "Perleflamme",
                                                    "score": 1,
                                                    "created_utc": 1653944099.0,
                                                    "response": "Just like there will always be people who use horses, even though we have cars. I agree. It seems to be what History has shown up until now, at least.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "iaju8sa",
                                    "author": "SmirkingMan",
                                    "score": 1,
                                    "created_utc": 1653922711.0,
                                    "response": "Rubbish",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iajza1l",
                                            "author": "dynamicallysteadfast",
                                            "score": 2,
                                            "created_utc": 1653925017.0,
                                            "response": "what specifically",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "iajxk64",
                                    "author": "ItsAConspiracy",
                                    "score": 1,
                                    "created_utc": 1653924239.0,
                                    "response": "Moving to PoS will at least get rid of the second biggest PoW chain.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iajzeo1",
                                            "author": "dynamicallysteadfast",
                                            "score": 2,
                                            "created_utc": 1653925075.0,
                                            "response": "There will still be a second biggest PoW chain, it just won't be Eth",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iajzncs",
                                                    "author": "ItsAConspiracy",
                                                    "score": 1,
                                                    "created_utc": 1653925185.0,
                                                    "response": "Obviously, but #3 right now is way smaller than ETH. Its market value and daily reward isn't going to go up just because the miners want it to. Total work depends on the rewards being offered, not the other way around.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "ial13t7",
                                                            "author": "dynamicallysteadfast",
                                                            "score": 1,
                                                            "created_utc": 1653942182.0,
                                                            "response": "Actually the value of the network is somewhat relative to the security it offers. It's a feedback mechanism in a way. Security gives it value, raises incentives, attracts more security.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "ial4s3t",
                                    "author": "Perleflamme",
                                    "score": 1,
                                    "created_utc": 1653943918.0,
                                    "response": ">valid concerns of the resistance of PoS to centralising forces relative to PoW.\n\nWhich concerns were valid, exactly?",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "ian43ke",
                                    "author": "KoreanJesusFTW",
                                    "score": 1,
                                    "created_utc": 1653986711.0,
                                    "response": "Nope. If I was saying anything, it would be:\n\nPOW - wasteful and inefficient use of both compute power and electricity.\n\nCentralization can happen in both POW and POS. ETH POS is far more decentralized than ETH POW or any consensus mechanism out there at the moment.\n\nAlso aware that people cannot get rid of their biases especially if they are a miner thermselves (trust me, I know). It takes genuine effort to digest things to see the better way forward. IMHO, ETH is doing just that.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "iajyfpe",
                            "author": "Mallardshead",
                            "score": -1,
                            "created_utc": 1653924637.0,
                            "response": "ETH: scam\n\n[https://twitter.com/tenderscore/status/1530790900749676544?s=20&t=fzFNzlTM8vdnQIM1tIRgIw](https://twitter.com/tenderscore/status/1530790900749676544?s=20&t=fzFNzlTM8vdnQIM1tIRgIw)",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ian4p8m",
                                    "author": "KoreanJesusFTW",
                                    "score": 1,
                                    "created_utc": 1653987263.0,
                                    "response": "Ok. Sure. Now shoo!!!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iajct0p",
                    "author": "Olmops",
                    "score": 1,
                    "created_utc": 1653913530.0,
                    "response": "In Ethereum it will be stake, for Bitcoin it will remain hashrate.\n\nIn order to have any say in the Bitcoin world, you need a significant share of hashrate - which is as expensive as owning the stake. So actually in both worlds you need a lot of money to be part of the consensus.\n\nWhere is the fundamental difference?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iajdbwr",
                            "author": "KoreanJesusFTW",
                            "score": 1,
                            "created_utc": 1653913860.0,
                            "response": "One's trying to be more efficient in terms or using resources and the other just doesn't give a shit pretty much.\n\nOnly a matter of time. BTC already exists in Ethereum as an ERC-20 for a long while now. People just need to wake up.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iak5toj",
                                    "author": "songbolt",
                                    "score": 1,
                                    "created_utc": 1653927922.0,
                                    "response": "\"People just need to wake up\" = \"People just need to agree with me\"?\n\nIt would be better to stay \"People just need to learn more facts\", specify what the facts are, and how we can share them.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ian3svz",
                                            "author": "KoreanJesusFTW",
                                            "score": 1,
                                            "created_utc": 1653986439.0,
                                            "response": "> \"People just need to wake up\" = \"People just need to agree with me\"?\n\nDidn't say anything remotely about me nor any of what said being about me but yeah... attack the guy not the point.\n\n\n> It would be better to stay \"People just need to learn more facts\", specify what the facts are, and how we can share them.\n\n... all to agree with me anyway (odd) and more words in my mouth making me sound like elitist this time around all because you didn't like me saying that people need to wake up which is a pretty valid English expression.\n\nSure.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "iak9qcd",
                            "author": "eth10kIsFUD",
                            "score": 1,
                            "created_utc": 1653929639.0,
                            "response": "The fundamental difference is what's known as \"economies of scale\".\n\nOn PoW: The more hashrate you buy the cheaper it is, this is a massively centralizing force. (if you own the power plant and the ASIC factory you will outcompete everyone, we are seeing this happen in real-time)\n\nOn PoS: The more ETH you buy the more expensive it gets, once your attack is done you will have nothing to show for it (on PoW you will still have a large amount of recyclable hardware and potentially several productive factories)",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ialn3fq",
                                    "author": "Olmops",
                                    "score": 1,
                                    "created_utc": 1653953045.0,
                                    "response": ">ou buy the cheaper it is, this is a massively centralizing force. (if you own the power plant and the ASIC factory you will outcompete everyone, we are seeing this happen in real-time)\n\nWell, that is actually an argument in contradiction to OP's quoted article.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iajlnw3",
                    "author": "Euphoric-Surprise293",
                    "score": 1,
                    "created_utc": 1653918543.0,
                    "response": "I say that is quite the opposite. He is just scared about Ethereum becoming the #1 coin. More utility and a bigger ecosystem. See you in 10 years plebs.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ian4k17",
                            "author": "KoreanJesusFTW",
                            "score": 1,
                            "created_utc": 1653987128.0,
                            "response": "What ^he said.\n\nAh fuck it! I tried being all proper and reasonable.\n\n> See you in 10 years plebs.\n\nI'd give you an award if I had one handy right now.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iajyd7u",
                    "author": "Mallardshead",
                    "score": -1,
                    "created_utc": 1653924606.0,
                    "response": "This guy knows better:\n\n[https://twitter.com/tenderscore/status/1530790900749676544?s=20&t=fzFNzlTM8vdnQIM1tIRgIw](https://twitter.com/tenderscore/status/1530790900749676544?s=20&t=fzFNzlTM8vdnQIM1tIRgIw)",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}