{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uixkzn",
            "title": "I Spent $1000 Making an NFT Project And Unfortunately Learned Some Things",
            "url": "https://www.hatingonoats.com/blog/I%20Spent%20$1000%20Making%20an%20NFT%20Project%20And%20Unfortunately%20Learned%20Some%20Things",
            "author": "0ouobatchy",
            "created_utc": 1651757704.0,
            "score": 26,
            "num_comments": 27,
            "subreddit": "ethereum",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i7fjegd",
                    "author": "Psukhe",
                    "score": 28,
                    "created_utc": 1651761832.0,
                    "response": "If the image is one color why upload a 256x256 image to ipfs? In fact why use IPFS at all, your smart contract could literally render the svg in a function, which a ton of NFTs do (e.g. wolf game)\nSometimes you just don't know there is a much easier way to accomplish the same things. IPFS isn't garbage, but certainly this was not the use case.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7feyu8",
                    "author": "jeesh",
                    "score": 81,
                    "created_utc": 1651760008.0,
                    "response": "So throughout the article he keeps referring to these people as idiots and calling the IPFS platform a piece of shit. \n\nBut… he’s the idiot that tried uploading 16 million files to IPFS through a web browser. Seriously - the project is just a color, you don’t need an image file for that. A simple square SVG would suffice and you wouldn’t have to store ANY files. \n\nI think this guy just tried to brute force a project and got mad when nobody would buy?  Yeah you may want to actually have a following and interact with the community if you want to release a project. Maybe don’t shit on the ecosystem while you're at it.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7foset",
                            "author": "Cleafonreddit",
                            "score": 18,
                            "created_utc": 1651763997.0,
                            "response": "Even the creator didnt believe his own project, what did he expect to happen? Magic? He was doomed to fail from the very beginning.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i7fy9mt",
                            "author": "nojudgment3",
                            "score": 12,
                            "created_utc": 1651767713.0,
                            "response": "This article is just an angry person who thinks the world should work the way they want it to.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7ggof2",
                                    "author": "Badgerisbest",
                                    "score": 6,
                                    "created_utc": 1651775363.0,
                                    "response": "There is  a big market for people to just click and hate on crypto or NFTs right now. As someone who used to be a crypto hater years ago, it's a lot of self-patting on back from people who don't understand the finer points of crypto but want to shit on it. Instead of anyone learning anything more, as they get concerned they are missing a boat, they can just read a few articles and feel calm going back to their ignorant existence.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i7g4hx6",
                    "author": "CorneliusFudgem",
                    "score": 15,
                    "created_utc": 1651770491.0,
                    "response": "I’m sorry OP you didn’t get rich overnight trying to utilize technology that you don’t understand. Maybe next time :)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7fy7mi",
                    "author": "Stack3",
                    "score": 14,
                    "created_utc": 1651767691.0,
                    "response": "Man, I hate learning things!\n\n\"Unfortunately Learned Some Things\" or \"learned some unfortunate things\"? Or... \"Unfortunately, I learned I had lots of things to learn\"?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7gjoe3",
                    "author": "i20d",
                    "score": 5,
                    "created_utc": 1651776582.0,
                    "response": "Wow, what a fucking idiot. Even is understanding of NTFs is wrong, LOL. Every decision he has made was dumb. Blame others, right?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7glolh",
                    "author": "ChaosUncaged",
                    "score": 3,
                    "created_utc": 1651777383.0,
                    "response": "Dudes got some mental problems. Ngmi",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7grb0c",
                    "author": "Nonocoiner",
                    "score": 3,
                    "created_utc": 1651779624.0,
                    "response": "TLDR: don't spend much time and money on things you think are stupid and don't understand.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "ui4k6m",
            "title": "Polygon's vision is to scale Ethereum in a multi-faced way and I feel like it's unfair to condemn it because of the price not moving.",
            "url": "https://www.reddit.com/r/ethereum/comments/ui4k6m/polygons_vision_is_to_scale_ethereum_in_a/",
            "author": "-Aporia",
            "created_utc": 1651664342.0,
            "score": 3,
            "num_comments": 15,
            "subreddit": "ethereum",
            "selftext": "You would be lynched for calling Polygon a L2 in this sub and it's completely understandable. It's not yet effectively a L2. What most people don't realize though or seem to downright ignore is that the PoS chain isn't Polygon's end goal. It's a multi-faced suite of Ethereum scaling solutions.\n\nI am posting this because I love Ethereum and I think it's unfair to condemn how effectively Polygon is aiming to scale Ethereum simply because \"the price doesn't move\". It's quite frankly frustrating and I don't understand it. Unless there's other reasons I am not aware of that is, then I'd be more than happy to be educated on the matter.\n\nI truly feel like we are still early and as a whole, this web3 thing is a long-term game and a long-term investment. I also feel like if everything goes well then Polygon will be making the most progress as far as scaling Ethereum and moving web3 is concerned. What other team is dropping 4+ ZK solutions and what other team is going to be allowing USDC payments on twitter via stripe? I think these are massive steps forward and I don't understand why Polygon goes ignored, is hated on and is so under-valued. I'm hoping someone could give me some insight.",
            "stickied": false,
            "comments": [
                {
                    "id": "i7a6nlp",
                    "author": "MinimalGravitas",
                    "score": 7,
                    "created_utc": 1651666312.0,
                    "response": "No one is hating on Polygon. It's currently a decent sidechain, like Gnosis. And we know that they are working on lots of rollups. We like the team, Sandeep and Jaynti in particular are regularly interviewed in Ethereum podcasts/panels/conferences etc. They are clearly well respected members of the ecosystem.\n\nWhat we don't like is the relentless shilling by MATIC bagholders, it's just as bad as what comes from LoopRing fans.\n\nWhile it's great that Polygon are working on rollups, there are plenty of other teams doing so already, and many of us are already using L2s like Arbitrum, zkSync, Optimism etc.\n\nWhenever someone mentions L1 fees are high or that we need more scaling, you can guarantee that there will be comments saying 'Polygon solves this' or whatever. The fact is that other projects solve this already, and Polygon is working on trying to solve it in the future.\n\nIf there was no MATIC token then there would be no annoying shills and I'm sure Polygon would be even more warmly regarded by Ethereum community.\n\nIf Polygon fans would acknowledge that there are other rollups much further along in development then your comments wouldn't be so misleading and might be better received.\n\nI know I've tried to explain this to you before, but I do really want to help you understand. Polygon is a decent project, but it's shills are becoming insufferable.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7aafu0",
                            "author": "Gabalpwnz",
                            "score": 3,
                            "created_utc": 1651668333.0,
                            "response": "  I hate the annoying and clueless matic fans that swarm every time ETH scalability is mentioned.\n \n If matic fees would have been paid in ETH then it would have been something else but to me it just looks like another L1.\n\n  L2 fees are low enough now and will go down even more in the future so why compromise with matic?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7ad0n1",
                                    "author": "MinimalGravitas",
                                    "score": 3,
                                    "created_utc": 1651669599.0,
                                    "response": "> If matic fees would have been paid in ETH then it would have been something else\n\nI think the funniest future for Polygon would be one where Hermes and Avail etc. use ETH for fees rather than Matic!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "id": "uhuwv2",
            "title": "Sent USDC to the router by mistake.",
            "url": "https://www.reddit.com/r/ethereum/comments/uhuwv2/sent_usdc_to_the_router_by_mistake/",
            "author": "deadlikeanangel",
            "created_utc": 1651626420.0,
            "score": 3,
            "num_comments": 12,
            "subreddit": "ethereum",
            "selftext": "Does anyone know what to do?\n\nI sent USDC to the router (BSC network) by mistake.\n\n[https://bscscan.com/tx/0xae07ba1d5cc59490bf881fa70f3fe20220dd94b204ab9b3b7b7cdcfa79a8a8ae](https://bscscan.com/tx/0xae07ba1d5cc59490bf881fa70f3fe20220dd94b204ab9b3b7b7cdcfa79a8a8ae)\n\nIf anyone can help me, I appreciate.\n\nThank you.",
            "stickied": false,
            "comments": [
                {
                    "id": "i79flou",
                    "author": "Ncookiez",
                    "score": 6,
                    "created_utc": 1651645231.0,
                    "response": "That's not a router. You sent USDC to the USDC token contract. Binance technically owns the contract, but I doubt they would ever do anything with it. I'd send their support team a message but honestly consider it gone.\n\nTriple check addresses next time, and if transferring a significant amount, ALWAYS send a test transaction first with $1 or so.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uixfzl",
            "title": "Can you explain what is the EVM in simple terms?",
            "url": "https://www.reddit.com/r/ethereum/comments/uixfzl/can_you_explain_what_is_the_evm_in_simple_terms/",
            "author": "_Whit3",
            "created_utc": 1651757282.0,
            "score": 29,
            "num_comments": 37,
            "subreddit": "ethereum",
            "selftext": "I started to learn about the Ethereum ecosystem a while ago, but it feels like I can't fully understand what the EVM is. Does somebody have a simple explenation for somebody that is not a developer?",
            "stickied": false,
            "comments": [
                {
                    "id": "i7fao8k",
                    "author": "pongvin",
                    "score": 45,
                    "created_utc": 1651758141.0,
                    "response": "It's a software execution environment. Think of it in this way: in reality, all software is executed by pieces of hardware like a processor. That processor relies on physical processes to perform operations such as addition and subtraction, and it's constrained by real world physics. It turns out though that with complex-enough circuitry, you can create a processor that is able to simulate its own operation in an abstract way. That is to say, you can create a piece of software that outputs the same output as a physical processor would for the same real world input. So like you feed a signal to a physical processor and it outputs another signal (which for example a screen could interpret as a blue pixel somewhere). Alternatively, you can create a program in the memory which accurately describe the very same rules that the physical processor has, so if you feed the same input to that program, that program outputs the same output as the real processor would.\n\nHow this connects to the EVM is that you don't necessarily need to describe the very same rules of the physical processor, you can make any kind of modifications or new rules. The EVM is a Virtual Machine (a virtual processor) that has its own custom rules that Ethereum needs to execute the special type of software that is written on it. The blockchain is the memory of this virtual processor, like the RAM is the memory for a physical processor.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7fj6p2",
                            "author": "edtiem",
                            "score": 23,
                            "created_utc": 1651761744.0,
                            "response": "this is simple terms 👆😂",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7hl15f",
                                    "author": "PostCoitalBliss",
                                    "score": 5,
                                    "created_utc": 1651792239.0,
                                    "response": "a virtual machine is software that can simulate hardware, and that simulated hardware can run other software. Computers have RAM, physical hardware plugged into the motherboard, which the computer uses as memory to hold information on active processes. For Ethereum and EVM, the blockchain acts has the RAM",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i7i1kzw",
                            "author": "Significant-Neck9605",
                            "score": 4,
                            "created_utc": 1651800532.0,
                            "response": "This guy processes",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7fvzt1",
                    "author": "javier123454321",
                    "score": 7,
                    "created_utc": 1651766821.0,
                    "response": "Its a computer program that pretends to be hardware so that the programs that you build on top of it (smart contracts) give the same output every time no matter what conditions it is running in.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7g9h7c",
                    "author": "anajoy666",
                    "score": 7,
                    "created_utc": 1651772467.0,
                    "response": "It’s an emulated computer. Think of it like a console emulator, but instend of sonic roms it’s monkey jpgs.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7fikge",
                    "author": "Olmops",
                    "score": 12,
                    "created_utc": 1651761491.0,
                    "response": "EVM = Ethereum Virtual Machine as in JVM for Java Virtual Machine.\n\nThe Virtual Machine is a simulated computer. It executes a standardized bytecode, that is a computer program translated into a language for this specific processor. The EVM opcodes are what you can \"do\" on the blockchain - like storing values or sending ETH to another account. That way, the block chain behaves like a gigantic \"world computer\". The block producers simulate it by executing all smart contract instructions according to the specification. For the user this looks like as if there was one single computer instead of this huge peer-to-peer network. Also this ensures interoperability. No matter what computer gets to execute the smart contract, the results will be the same.\n\nIt is a bit like the artificial language \"Esperanto\" that was designed as a common \"world language\". You translate your text to Esperanto (or take English as the more common example) and then anybody who can translate Esperanto to his or her native language can use the text.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uj10pk",
            "title": "Ethereum Mainnet to Undergo Shadow-Fork-3 Today. The Merge Getting Closer",
            "url": "https://timestabloid.com/ethereum-mainnet-to-undergo-shadow-fork-3-today-the-merge-getting-closer/",
            "author": "Solodeji",
            "created_utc": 1651767363.0,
            "score": 66,
            "num_comments": 16,
            "subreddit": "ethereum",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i7g5qtw",
                    "author": "PandemoniumX101",
                    "score": 5,
                    "created_utc": 1651770988.0,
                    "response": "Here is a quick summary: https://hackmd.io/@benjaminion/Hy_VXLb8q",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uj3jq5",
            "title": "scaffold-eth 🏗 Intro Workshop",
            "url": "https://youtu.be/k3Lj5FKjZeA",
            "author": "kevinjonescreates",
            "created_utc": 1651774381.0,
            "score": 7,
            "num_comments": 4,
            "subreddit": "ethereum",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uipsj8",
            "title": "Tokens vs fake internet points",
            "url": "https://www.reddit.com/r/ethereum/comments/uipsj8/tokens_vs_fake_internet_points/",
            "author": "Extension-Signal1144",
            "created_utc": 1651726734.0,
            "score": 4,
            "num_comments": 14,
            "subreddit": "ethereum",
            "selftext": "I'm thinking about different ways to do user incentives for a website. For example, rewarding someone with Reddit karma for posting something the community likes, vs learn-to-earn or play-to-earn on a web3 app where the user gets an actual currency worth monetary value after performing an action. \n\nI'm curious about how these two ways of going about things compare long term.\n\nOver time, you can have more & more fake internet points. Inflation doesn't matter. But how would you keep up with user engagement over time with currency? Wouldn't you run out eventually? \n\nAny thoughts on this?",
            "stickied": false,
            "comments": [
                {
                    "id": "i7e518w",
                    "author": "beep_bop_boop_4",
                    "score": 6,
                    "created_utc": 1651728828.0,
                    "response": "Check out r/CryptoCurrency moons",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7e4ogb",
                    "author": "Perleflamme",
                    "score": 5,
                    "created_utc": 1651728585.0,
                    "response": "Ethtrader already has a token like that, if younre interested in how it works. I'm sure they'll be willing to talk more about it there.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uj3dxb",
            "title": "Merge Resource List 🐼 & \"Path to the Merge\" Graphic",
            "url": "https://www.reddit.com/r/ethereum/comments/uj3dxb/merge_resource_list_path_to_the_merge_graphic/",
            "author": "trent_vanepps",
            "created_utc": 1651773932.0,
            "score": 101,
            "num_comments": 11,
            "subreddit": "ethereum",
            "selftext": "Spent some time with Mario Havel and Tim Beiko putting together some links for bunch of Merge topics, including what it is, when to expect, how it impacts developers, anything that changes post-Merge: \n\n🐼 [Mega Merge Resource List](https://notes.ethereum.org/@MarioHavel/merge-resources) 🐼  \n\n\nhttps://preview.redd.it/pimshxyx4px81.png?width=2152&format=png&auto=webp&s=174f8efdef295e52aebf544afa7aa3b2ca1a966f",
            "stickied": false,
            "comments": [
                {
                    "id": "i7heidp",
                    "author": "fortunate_branch",
                    "score": 7,
                    "created_utc": 1651789266.0,
                    "response": "wow, love this. thank you",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7iaoo7",
                    "author": "BigglyBillBrasky",
                    "score": 3,
                    "created_utc": 1651805009.0,
                    "response": "So close",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7iixd8",
                    "author": "Stfucarl12",
                    "score": 3,
                    "created_utc": 1651809493.0,
                    "response": "Wen merg",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}