{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uicukj",
            "title": "Point Network Introducing: The Real Web 3.0",
            "url": "https://www.newsbtc.com/news/company/introducing-the-real-web-3-0/",
            "author": "nikola28",
            "created_utc": 1651688039.0,
            "score": 8,
            "num_comments": 3,
            "subreddit": "ethereum",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "ui9cg9",
            "title": "How to calculate the \"Txn Savings Fees\" of an ethereum txn?",
            "url": "https://www.reddit.com/r/ethereum/comments/ui9cg9/how_to_calculate_the_txn_savings_fees_of_an/",
            "author": "BreadIntelligent4598",
            "created_utc": 1651678561.0,
            "score": 5,
            "num_comments": 10,
            "subreddit": "ethereum",
            "selftext": "When I view the  details of a transact record on etherscan,  I notice the Txn Savings Fees, any one know how to calculate it? \n\nhttps://preview.redd.it/69wn666a9hx81.png?width=995&format=png&auto=webp&s=0913dae73cb6bcfd53804ec2ea45741edad858b0",
            "stickied": false,
            "comments": [
                {
                    "id": "i7bojni",
                    "author": "Nonocoiner",
                    "score": 3,
                    "created_utc": 1651689039.0,
                    "response": "It's what is left over (edit: and returned to your wallet) after the priority tip and basefee are paid.\n\n (max fee - priority fee - basefee) x gas used",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "ui504b",
            "title": "Will ETH ever be depleted?",
            "url": "https://www.reddit.com/r/ethereum/comments/ui504b/will_eth_ever_be_depleted/",
            "author": "HStro",
            "created_utc": 1651665851.0,
            "score": 4,
            "num_comments": 31,
            "subreddit": "ethereum",
            "selftext": "This could be a very dumb question. \n\nSince ETH will be deflationary, won’t it eventually run out, or won’t supply at least get very low? \n\nI see many excited about this, since fewer ETH means higher value per ETH. However, if supply gets too low won’t it break the ecosystem since we all run out of gas…?\n\nThanks for all replies!",
            "stickied": false,
            "comments": [
                {
                    "id": "i7a6gxh",
                    "author": "Maswasnos",
                    "score": 8,
                    "created_utc": 1651666207.0,
                    "response": "No, ETH won't be deflationary forever. The deflation/inflation rate depends on number of validators and network usage (and sort of depends on ETH price). Under PoS, ETH will be deflationary if gas prices are over ~10-15 Gwei. This means that the supply will decrease until network traffic either falls off or the supply of liquid ETH gets low enough that  the price of ETH increases and the average price users are willing to pay for transactions is less than the 10-15 Gwei threshold. \n\nMy guess is that the supply will equalize around 100 million ETH, give or take a few million.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7ailwf",
                    "author": "harpocryptes",
                    "score": 4,
                    "created_utc": 1651672184.0,
                    "response": "**Even if ethereum stayed deflationary forever, it would never deplete**. The reason for that is that the burn is a (small) proportion of whatever is left, not of the original amount. As a very simplified example, if we started with 100M eth and burned 1% per year (1M burn the first year), once the supply reached 90M, the burn would be 1% of 90M, that is 0.9M. At 50M, the burn is \"only\" 0.5M, etc. After 100 years, there would still be 36.6M eth left (not 0!).",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "u5r6uv",
            "title": "eth staking / validator",
            "url": "https://www.reddit.com/r/ethereum/comments/u5r6uv/eth_staking_validator/",
            "author": "Standard_Lemon9496",
            "created_utc": 1650214668.0,
            "score": 3,
            "num_comments": 26,
            "subreddit": "ethereum",
            "selftext": "Is anyone here staking for the POS merge? What rewards are you getting what is the estimate on rewards once the merge happens? I currently have eth on crypto.com and they recently cut ear rates so looking for the best options",
            "stickied": false,
            "comments": [
                {
                    "id": "i53tyr9",
                    "author": "Fiscal-Freedom",
                    "score": 4,
                    "created_utc": 1650217281.0,
                    "response": "Currently with Ankr Earn Liquid Staking, getting 4.5% or so.\n\nSince the newly minted ETH & the tips post merge will be going to the stakers rather than the miners, the APR is expected to 2x or 3x from where it is today.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i53yq28",
                    "author": "paedocypriz",
                    "score": 3,
                    "created_utc": 1650219224.0,
                    "response": "I recommend rocketpool due to them being decentralized and permissionless. APR currently 4% for staking (more if you run a node), expected to rise after merge. I also have some being lended in Nexo, where the interest is pretty decent especially as platinum member (up to 8%). I prefer to stake rather than lend however.\n\nEdit: Added Nexo rate",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "ubrgps",
            "title": "Are these guys on twitter legit?",
            "url": "https://www.reddit.com/r/ethereum/comments/ubrgps/are_these_guys_on_twitter_legit/",
            "author": "Ohgoditscatzilla",
            "created_utc": 1650910218.0,
            "score": 3,
            "num_comments": 20,
            "subreddit": "ethereum",
            "selftext": "So I see a lot of people doing this where they want you to follow, retweet, like and then show proof for a chance to win some specific amount of Crypto.\n\nI see this quite often now, just wondering are these guys legit, cause I never see them announcing any winners, they just seem to repeat and repeat contests.\n\nIs this some sneaky way to get followers or something? Has anyone won anything from those fellas?",
            "stickied": false,
            "comments": [
                {
                    "id": "i65ttod",
                    "author": "wjmaher",
                    "score": 8,
                    "created_utc": 1650910765.0,
                    "response": "If it seems too good to be true...",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i65xfqd",
                    "author": "TomOkihara",
                    "score": 4,
                    "created_utc": 1650912191.0,
                    "response": "A lot of giveaways are not legit. I personally haven’t experienced any legit crypto token giveaways but that isn’t to say they’re all complete scams.\n\nI know for NFT giveaways a lot can be engagement farming. Like if someone says they’re giving away a BAYC. There are people who own like 50 BAYC so sure it’s possible someone could be that generous, but it’s just a bunch of people getting played for engagement. \n\nThere are lots of legit NFT giveaways tho but usually from smaller projects or they happen in discord servers.\n\nEdit: NFTs are crypto tokens but at first I’m referring to like a giveaway for BTC or eth or something",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i65xwxt",
                    "author": "jackdskis",
                    "score": 4,
                    "created_utc": 1650912379.0,
                    "response": "Never.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uh79ub",
            "title": "Made a dead simple price convetor based on CoinMarketCap data looking for feedbacks",
            "url": "https://coinprice.exchange/",
            "author": "symay97",
            "created_utc": 1651549044.0,
            "score": 3,
            "num_comments": 9,
            "subreddit": "ethereum",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uieqe4",
            "title": "Open Source Coding, What Is It and How Does It Benefit Crypto Long Term?",
            "url": "https://www.investingcube.com/open-source-codes-what-are-they-and-why-should-you-care/",
            "author": "eric690",
            "created_utc": 1651693223.0,
            "score": 84,
            "num_comments": 13,
            "subreddit": "ethereum",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i7cjwg3",
                    "author": "sarahhenicaxoxo",
                    "score": 10,
                    "created_utc": 1651701287.0,
                    "response": "Nice summary of what Open source is all about, this is good for newcomers. Without the use of open source I doubt Crypto would be where it is right now",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7ctpti",
                    "author": "tommyjangles22",
                    "score": 3,
                    "created_utc": 1651705426.0,
                    "response": "In my opinion this article highlights the difference between centralized and decentralized communities. With the centralized being corporations. Notice how fast the tech moves in Crypto when everyone’s involved, so many engineers, programmers and innovative minds all working on the same thing.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7c2aii",
                    "author": "coinfeeds-bot",
                    "score": 4,
                    "created_utc": 1651694404.0,
                    "response": "tldr; Open-source software allows anyone to take a peek at the code a company uses. Programmers can sometimes copy the source code from another open-source piece of software and kickstart their own program without having to write it from scratch. Open-source programs usually have entire communities of tech-savvy individuals managed by experienced developers.\n\n*This summary is auto generated by a bot and not meant to replace reading the original article. As always, DYOR.*",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uiddwc",
            "title": "Argent Wallet with Ledger Question",
            "url": "https://www.reddit.com/r/ethereum/comments/uiddwc/argent_wallet_with_ledger_question/",
            "author": "hardcoregamer84",
            "created_utc": 1651689522.0,
            "score": 5,
            "num_comments": 10,
            "subreddit": "ethereum",
            "selftext": "Hello!\nI just started playing with Argent ZKsync wallet.  I currently stake ETH using LIDO through Ledger Live, but the fees can range from $5 to $50 depending on the gas price.\n\nIs it possible to attach a Ledger wallet to the Argent App and stake ETH through the Argent app, while the ETH stays on my Ledger?\n\nThe part I am a little confused about is the Ledger ETH app would be considered an L1 Wallet, and I would have to move that to an L2 Wallet like that ZKSync wallet that Argent offers.\n\nI just wasnt sure if it was it was possbile without the ETH having to leave my ledger wallet.\n\nThank you,",
            "stickied": false,
            "comments": [
                {
                    "id": "i7cgfpy",
                    "author": "Maswasnos",
                    "score": 5,
                    "created_utc": 1651699934.0,
                    "response": "Argent isn't really designed to pair with a hardware wallet, it's supposed to be a \"social recovery wallet\". It has implementations on both ETH mainnet and on zkSync, and you can access both in the same app. The zkSync part of the app basically lets you trade certain tokens, buy crypto with fiat through Ramp Network, and get yield on certain assets through bridged Gro and Yearn tokens. \n\nLedger Live is an app interface you can use with your Ledger hardware wallet, and it does pretty much everything on mainnet- hence the high fees you mentioned. \n\nYou can transfer assets between these wallets, but you'll need to [activate your Ledger's ETH address on zkSync](https://wallet.zksync.io/) first and then bridge assets there. Then you can transfer from your Ledger's zkSync address to your Argent address. \n\nNow, technically you *can* stake ETH through Argent and then transfer to your Ledger. The process would look like this starting with ETH on mainnet:\n\n1. Bridge ETH to zkSync on your ledger\n2. Activate your address on zkSync\n3. Transfer ETH from your zkSync ledger address to your zkSync Argent address\n4. Buy wstETH or whichever staking option you prefer\n5. Transfer the wstETH or icETH from Argent to your zkSync Ledger \n\nStep 1 would cost $20-$40 in gas most likely, with the rest of the steps being pretty cheap. You're probably better off just buying ETH directly on Argent and staking in the app.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7d18ce",
                            "author": "hardcoregamer84",
                            "score": 3,
                            "created_utc": 1651708825.0,
                            "response": "I really appreciate this answer!   Thanks very much!",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i7d6aoq",
                            "author": "hardcoregamer84",
                            "score": 3,
                            "created_utc": 1651711081.0,
                            "response": "Would it be safe to say that in the future retail won’t even be on L1 mainnet anymore, so hardware wallets will be freely able to interact with different L2s or dapps that have been built on L2?  Basically how L1 works today for retail but with much lower fees, while maintaining security of a personal hardware wallet?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "ui7hn4",
            "title": "Building Through Hell - The Daily Gwei #474",
            "url": "https://thedailygwei.substack.com/p/building-through-hell-the-daily-gwei",
            "author": "DailyGweiBot",
            "created_utc": 1651673476.0,
            "score": 6,
            "num_comments": 6,
            "subreddit": "ethereum",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uiinr1",
            "title": "Wen Merge? Soon! 🍾",
            "url": "https://hackmd.io/@timbeiko/acd/https%3A%2F%2Ftim.mirror.xyz%2FPWFVaHY3Mrx7srarMmuBWya0J5kioR1l2xaH3p5APDk%3Fdisplay%3Diframe",
            "author": "kotsanto",
            "created_utc": 1651704193.0,
            "score": 115,
            "num_comments": 63,
            "subreddit": "ethereum",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i7dbj0d",
                    "author": "PandemoniumX101",
                    "score": 41,
                    "created_utc": 1651713392.0,
                    "response": "The communication of this team is just spectacular.  Really appreciate the effort that so many put into educating and keeping the community updated in such detail.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7fglaz",
                            "author": "pandem0nium1",
                            "score": 6,
                            "created_utc": 1651760681.0,
                            "response": "You must be an evolved form of myself",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7cwzw4",
                    "author": "Kimgoestoprison",
                    "score": 11,
                    "created_utc": 1651706928.0,
                    "response": "Does anybody know how fast coinbase plans to allow us stakers to claim ETH rewards after merge? I would hope they have it ready to go and also will allow unstaking.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7cy018",
                            "author": "Ok_Teacher_6834",
                            "score": 36,
                            "created_utc": 1651707380.0,
                            "response": "Technically any staked ethereum is going to have to wait till next upgrade after the merge.  Then they will slowly unlock each node supposedly so there isn’t a rush to the door.  As far as coinbase, who knows.  I imagine some time between the merge and the post merge update",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7e1et7",
                                    "author": "NotImaginary_",
                                    "score": 11,
                                    "created_utc": 1651726399.0,
                                    "response": "No it must be after the post merge upgrade. If it is technically not possible before, coinbase cannot do it.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i7eg2ol",
                                            "author": "_ArtosisCurse_",
                                            "score": 6,
                                            "created_utc": 1651737582.0,
                                            "response": "Not sure why you got downvoted you are 100% correct",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i7cyfuq",
                            "author": "Perleflamme",
                            "score": 9,
                            "created_utc": 1651707579.0,
                            "response": "Unless if they change EIPs, the merge won't allow unstaking. It will happen afterwards, in another upgrade.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i7cxxhd",
                            "author": "jflo358",
                            "score": 7,
                            "created_utc": 1651707348.0,
                            "response": "I dont know about Coinbase in particular, but I've heard staked ETH will be available 6 months after the merge and only so many nodes a day will be able to withdrawl.   I'm guessing coinbase will have enough liquidity to let people \"unstake\" or withdrawl their earnings earlier than that but who knows.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i7e7vij",
                            "author": "Nonocoiner",
                            "score": 3,
                            "created_utc": 1651730863.0,
                            "response": "Coinbase could implement this already.\n\n Since more people are staking every day, they could allow people that want to stop staking trade their ETH2 tokens with new stakers. Kraken and Binance have implemented this long ago already.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7eled3",
                    "author": "Photon120",
                    "score": 4,
                    "created_utc": 1651742377.0,
                    "response": "I cannot scroll down in this homepage. Can someone copy the text?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7crof2",
                    "author": "Live-Ad6746",
                    "score": 3,
                    "created_utc": 1651704521.0,
                    "response": "Junish",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7dk98e",
                            "author": "meastd_0",
                            "score": 9,
                            "created_utc": 1651717360.0,
                            "response": "I'd be very surprised to see it before sep this year.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i7e580b",
                            "author": "TulipTrading",
                            "score": 4,
                            "created_utc": 1651728960.0,
                            "response": "It's already may, did you miss all the things that still need to happen before the merge? I'd say late 2022/early 2023.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}