{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "lbdnqu",
            "title": "What exactly IS ethereum?",
            "url": "https://www.reddit.com/r/ethereum/comments/lbdnqu/what_exactly_is_ethereum/",
            "author": "PM_DA_BUM",
            "created_utc": 1612320432.0,
            "score": 560,
            "num_comments": 143,
            "subreddit": "ethereum",
            "selftext": "What does it do? Why is it important? What are the benefits of holding it? What is the potential of it? Is it like a decentralized global computer or something? Any information would be greatly appreciated.\n\nI'm super curious because I was looking to maybe put some money towards it.",
            "stickied": false,
            "comments": [
                {
                    "id": "gltg0je",
                    "author": "adequate_redditor",
                    "score": 45,
                    "created_utc": 1612321345.0,
                    "response": "Check this site, it should answer most of your questions. \nhttps://ethereum.org/en/what-is-ethereum/\n\nIn a nutshell, it’s more than just a currency. Developers can also use ethereum to build applications.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "gltg9g6",
                            "author": "PM_DA_BUM",
                            "score": 6,
                            "created_utc": 1612321467.0,
                            "response": "How would those applications actually utilize the ethereum coin/currency/asset though?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "glu2nrw",
                                    "author": "MrNarc",
                                    "score": 9,
                                    "created_utc": 1612334525.0,
                                    "response": "Ether is how people pay for using ethereum applications. Think of it as paying for gas to run your car, or electricity for your factory.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "glub8ob",
                                    "author": "Odds-Bodkins",
                                    "score": 3,
                                    "created_utc": 1612341650.0,
                                    "response": "Hi there. You have asked a pretty broad question in the title, but it seems like you have a good idea of what is going on. \n\nEthereum is a decentralized, distributed computing platform. Like all real computers, its resources are finite. Gas costs (paid in ETH) provide a mechanism to prevent spam attacks.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "glthnfu",
                    "author": "BanklessHQ",
                    "score": 266,
                    "created_utc": 1612322153.0,
                    "response": "It’s a triple point asset:\n\nIt’s a commodity as gas. You need to buy and own ETH to do anything in the ecosystem. \n\nIt’s a yield bearing asset with staking. In ETH2, users can stake their ETH to validate blocks and earn rewards. \n\nIt’s a store of value asset. The value built on top of ETH, married with a soon to be deflationary policy.\n\nBeyond all of that, it is like the decentralized internet. It is a computing platform that allows developers to create decentralized apps using the secure base layer.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "glus7dn",
                            "author": "Puppy_Coated_In_Beer",
                            "score": 29,
                            "created_utc": 1612356103.0,
                            "response": "I just love how this community embraces newcomers who don't know much about the coin and just want to learn.\n\nYou guys are awesome.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "gltilrf",
                            "author": "PM_DA_BUM",
                            "score": 46,
                            "created_utc": 1612322623.0,
                            "response": "I've read a little about eth 2.0! Will it become deflationary? As in have a capped production? How will it become deflationary?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "gluaadd",
                                    "author": "ec265",
                                    "score": 10,
                                    "created_utc": 1612340800.0,
                                    "response": ">Will it become deflationary?\n\nIt has the potential to be, yes. With EIP-1559 a large portion of fees will be burnt. If this exceeds issuance, then you have yourself deflation. So if the network is highly utilised, then it is likely as you will have a greater amount of fees (with issuance being predictable).\n\n>As in capped production?\n\nNo. Ethereum operates with a minimum necessary issuance policy, which is best described as the minimum issuance required without sacrificing security. This is dynamic, but as outlined above still enables deflation.\n\nProjected issuance looks like this [https://docs.ethhub.io/assets/images/issuance_graph.png](https://docs.ethhub.io/assets/images/issuance_graph.png)\n\nThrow in the fact that net issuance can actually be negative when transaction fees are burned under EIP-1559 you get deflation and something that looks like this - [https://twitter.com/drakefjustin/status/1352734923703123968?s=21](https://twitter.com/drakefjustin/status/1352734923703123968?s=21)",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "gluk44r",
                                    "author": "Perleflamme",
                                    "score": 3,
                                    "created_utc": 1612349774.0,
                                    "response": "Technically, if some current Ethereum proposal gets through, it will become less inflationary pretty soon (in a very few months at most) because transactions will burn a part of the fees (essentially giving it to everyone else) rather than giving all off the fees to the miners. \n\nThen it will become deflationary with ETH 2.0 and full PoS and shards and layers and actually any other ideas devs are getting between now and then (hopefully next year, I'd say, even though some people talk about the end of 2021). But it's not exactly deflationary. It's rather very dynamic, allowing stakers to get more ETH when needed and to get less ETH when not. I expect the quantity of ETH to adapt to market needs with time (though it will be quite slow).",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "glu1iud",
                                    "author": "Fly1n_Hawaiian",
                                    "score": 6,
                                    "created_utc": 1612333681.0,
                                    "response": "That's the idea. It will become deflationary because the Eth burned from usage will equal if not be slightly more/less than the amount given out for staking rewards. That's at least my understanding of it",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "glv3cmh",
                                    "author": "ItsAConspiracy",
                                    "score": 2,
                                    "created_utc": 1612362270.0,
                                    "response": "When it converts fully to proof-of-stake, its annual inflation from block rewards will be less than half of Bitcoin's.\n\nOn top of that, it will burn most of the transaction fees, bringing the total inflation even lower. When fees are high, the total supply may actually decrease.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "glv6tlx",
                                            "author": "iceman202",
                                            "score": 1,
                                            "created_utc": 1612363828.0,
                                            "response": ">otal supply may actually decrease.\n\nHow can it be half of Bitcoins?  Bitcoin is on a set supply.  Serious question not sure I fully understand",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "glvn62b",
                                                    "author": "ItsAConspiracy",
                                                    "score": 3,
                                                    "created_utc": 1612370635.0,
                                                    "response": "Bitcoin's ultimate cap won't be reached for over a century. For now it's inflating at about 2% annually. That will drop in half every four years.\n\nETH right now inflates at about 4% annually. That will drop below 1% with full proof-of-stake, and with fee burning it will go even lower. It may even go negative, which would be more deflationary than Bitcoin even after Bitcoin reaches its cap.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "glvt9ro",
                                                            "author": "iceman202",
                                                            "score": 2,
                                                            "created_utc": 1612373087.0,
                                                            "response": "Ahhh appreciate it",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "glvf7e5",
                                    "author": "RAFAJ2390",
                                    "score": 1,
                                    "created_utc": 1612367373.0,
                                    "response": "It can become deflationary, because if the network is saturated and there are a lot of transaction some eth will need to be burn.. not sure, hope I help",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "glvjan1",
                            "author": "Top_Secret_TerminaL",
                            "score": 4,
                            "created_utc": 1612369058.0,
                            "response": "It's truly difficult to explain this to people who have absolutely no clue what is going on (not referring to OP, because he's just wondering specifically what Ethereum's role is in all of this). I always start out explaining this shit to people around me, and I realize that I basically sound like a moron speaking an alien language. And then I feel embarrassed, because consensus of what a bunch of people around me think becomes reality and then I realize that to them...I sound like I'm making shit up.\n\nTLDR: Most of the people that \"get\" me only hang out on Reddit.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "glw4ujw",
                            "author": "EarningsPal",
                            "score": 2,
                            "created_utc": 1612377620.0,
                            "response": "Such a great and concise answer",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "glufsl3",
                            "author": "faintingoat",
                            "score": 1,
                            "created_utc": 1612345836.0,
                            "response": "it s also a data authentication system. pricey, but reliable.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "glufxuy",
                            "author": "Made-justfor1comment",
                            "score": 1,
                            "created_utc": 1612345971.0,
                            "response": "What gives ether capital?",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "gm12bi0",
                            "author": "DeviateFish_",
                            "score": 1,
                            "created_utc": 1612469290.0,
                            "response": "I see you're back to buying votes for your posts again.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "gltfyc0",
                    "author": "BawceHog",
                    "score": 54,
                    "created_utc": 1612321315.0,
                    "response": "https://thedefiant.substack.com/p/ether-is-the-best-model-for-money",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "gltge1r",
                            "author": "mary_jester",
                            "score": 7,
                            "created_utc": 1612321530.0,
                            "response": "Good read",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "glwtulu",
                            "author": "apersonnotadog",
                            "score": 2,
                            "created_utc": 1612387779.0,
                            "response": "I'm struggling to understand the \"Compound is trustless because of collateral\" section. Do you have a resource which explains this further?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "glxcuoz",
                                    "author": "alibyte",
                                    "score": 3,
                                    "created_utc": 1612396315.0,
                                    "response": "To borrow an asset from Compound you need to have deposited enough to cover your borrow, usually in a different asset.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "glxfr07",
                                            "author": "apersonnotadog",
                                            "score": 2,
                                            "created_utc": 1612397725.0,
                                            "response": "Ok. If that's the case, what's the point of borrowing? Why not just convert the collateral asset to what you're \"borrowing\"? Conversion is something that Ethereum should be able to do really well.. I'm looking forward to using it for that purpose.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "glxgds7",
                                                    "author": "alibyte",
                                                    "score": 2,
                                                    "created_utc": 1612398035.0,
                                                    "response": "In case you want to stay exposed to ETH, for instance? And borrow against it so you can leverage your position + keep ETH if you are expecting further price movement",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "glxl22b",
                                                            "author": "apersonnotadog",
                                                            "score": 2,
                                                            "created_utc": 1612400354.0,
                                                            "response": "I see. So it's not quite \"borrowing\" in the typical sense.. However, if the value of ETH drops, do you need to add ETH to increase your collateral?",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "glxmlo9",
                                                                    "author": "alibyte",
                                                                    "score": 2,
                                                                    "created_utc": 1612401107.0,
                                                                    "response": "Yes, that's the risk you take using margin. It amplifies both ways, but if you think ETH is going up, you could borrow USD against it, and buy more ETH with your borrowed money",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "gltnw35",
                    "author": "cocaineFlavoredCorn",
                    "score": 16,
                    "created_utc": 1612325324.0,
                    "response": "Ethereum is a platform to build infrastructure that allows society to scale trust in an anti-fragile way. This infrastructure can be manifested in financial markets, governance, or other models. As societies scale new forms of handling coordination are needed. Ethereum represents a new form of doing so in a world shaped by a globally connected internet.\n\nEthereum allows the manipulation of value, which allows the management of risk across people and time to preserve and build capital. Be it social, financial or cultural capital. In the financial sense, the programmable modeling and manipulation of value allows for the recreation of finance which solves age old economic needs. \n\nSince it’s programmable, Ethereum can model any subset of traditional financial applications, and expands what is possible to a greater unexplored superset of value manipulation activities. Unconstrained, Ethereum allows new types of “games” to be played with money, say a system where for every transaction, the supply increases quadratically. Contact with the real world will make some unexplored games and new types of markets more useful than others.\n\nA manifestation of this is DeFi, decentralized finance, where modern financial activities have been commodified and modeled on the network. Open, permission-less modification allows for rapid experimentation leading to new types of in the unexplored superset, financial applications like flash loans, no loss lotteries and quadratic markets.\n\nThis is a great podcast which also defines crypto economics which is the basis of the network:\nhttps://youtu.be/ycK3AUTdl1w\n\nCrypto economics can be defined as the usage of cryptography and economics to ensure trust minimized systems. Note there is probably a better articulated definition than this. \n\nWhen you can use cryptography use it. If cryptography cannot assure security properties, go a level up and use game theory and economic incentives to ensure collaboration. A common application of this is using cryptography to ensure the gardening of the blockchain. But using economics incentives to incentivize consensus of which is the correct chain aka the correct objective reality. Cryptography can give assertions in stateless world, but once time is introduce and state is necessary, we need consensus to all agree on what happens in the next state transition.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gltqmvg",
                    "author": "GeneralMort",
                    "score": 31,
                    "created_utc": 1612326816.0,
                    "response": "Ethereum is a Decentralized Network comprised of validators (computers) from across the globe.  These computers power the network, processing transactions and ensuring an incredibly high level of security.  Any type of application can be built on the network, whether it be a decentralized trading platform or a game where you can trade unique digital goods like Crypto Kitties.  Many if not most of the top projects in crypto are powered by the Ethereum blockchain (ERC20 tokens).  To put it simply, Ethereum has the potential to be the infrastructure that powers an entire new world of decentralized applications.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "glu1eg1",
                    "author": "Onetapfapnap",
                    "score": 10,
                    "created_utc": 1612333596.0,
                    "response": "ETH is internet oil",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gltibvu",
                    "author": "TheWierdGuy",
                    "score": 9,
                    "created_utc": 1612322486.0,
                    "response": "https://www.reddit.com/r/CryptoCurrency/comments/kzkdw4/a_break_down_of_the_bull_case_for_ethereum_and/\n\nI am working on a second write up:\nhttps://docs.google.com/document/d/1qjjKGdFdsyjRKEXriBoWuJdCyQlMSKsxIEDbOX0ynfc/edit",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "gltj13t",
                            "author": "PM_DA_BUM",
                            "score": 8,
                            "created_utc": 1612322832.0,
                            "response": "Awesome thank you! I'm so glad people like you are taking the time to comment",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "gltjmwp",
                                    "author": "TheWierdGuy",
                                    "score": 3,
                                    "created_utc": 1612323132.0,
                                    "response": "Ethereum is a global computer, but it is quite difficult to understand what this truly means and why it is so important. This is where Bitcoin has an advantage: the value proposition for Bitcoin is simple to understand.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "glu8l3b",
                    "author": "MerryWalrus",
                    "score": 9,
                    "created_utc": 1612339305.0,
                    "response": "Ethereum is a cloud based computer and ETH is the 'currency' used to buy run time on it.\n\nWhat makes it different from the likes of AWS is that, by design, there are no restrictions on what it can be used for and by whom. Nor are there restrictions on who can start lending their hardware to run it. There is also high levels of data security due to vast amounts of reconciliations across all hardware that supports the cloud computer.\n\nWhat makes it different from other cryptos is that it actually qualifies as a computer whereas they are just basic databases.\n\nThe downside is that this cloud computer is vastly inefficient to operate.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "glv6431",
                            "author": "PM_DA_BUM",
                            "score": 3,
                            "created_utc": 1612363519.0,
                            "response": "But over time it has the potential to be extremely efficient as ethereum is refined right?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "glvltgp",
                                    "author": "MerryWalrus",
                                    "score": 5,
                                    "created_utc": 1612370084.0,
                                    "response": "It will never be more efficient than a traditional cloud platform and there is a huge technological gap to be filled for it to even get close.\n\nCryptos fundamentally rely on processing inefficiency as their primary form of data security.\n\nHowever in exchange for that it gives features that don't exist for traditional cloud platforms.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "gmso95y",
                                            "author": "OffenRay",
                                            "score": 1,
                                            "created_utc": 1612944301.0,
                                            "response": ">Cryptos fundamentally rely on processing inefficiency as their primary form of data security.\n\nAll of them or most of them? (Regarding inefficiency) What do you think about Nano? (I'm new to crypto as well)",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "gltg6mj",
                    "author": "NASA_Lies",
                    "score": 34,
                    "created_utc": 1612321430.0,
                    "response": "Homie, it's like this. \n\nImagine everything digital we do. \n\nNow put EVERYTHING, all that stuff, on the blockchain. \n\nEthereum is the decentralized internet of everything\n\nsmart contracts are the first thing you should research so your mind is blown",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "gltj2h9",
                            "author": "simpleman_94",
                            "score": 8,
                            "created_utc": 1612322851.0,
                            "response": "Can you please give me an example that shows me THE BIG difference between a \"normal\" digital behavior and the same thing (i don't know, maybe social media apps) running in the Ethereum blockchain?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "glux5wj",
                                    "author": "BudgetLush",
                                    "score": 4,
                                    "created_utc": 1612359129.0,
                                    "response": "Right now, depending on the code being ran, transactions can easily exceed 100 bucks. Liking a friend's post is completely out of the question. As scaling solutions are implemented more will be able to be ran,  but it will be down the ladder based on a given applications willingness to pay fees .  \n  \nHowever, if you simply want to see a blockchain example of social media, that would be HIVE. peakd.com (general), 3speak.co(video) and leofinance.io (finance) are popular interfaces for the chain.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "glv95da",
                                            "author": "p_k",
                                            "score": 3,
                                            "created_utc": 1612364831.0,
                                            "response": "How can things like video sharing be decentralised? Don't you need a way and place to host and distribute content?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "glvgxor",
                                                    "author": "BudgetLush",
                                                    "score": 1,
                                                    "created_utc": 1612368081.0,
                                                    "response": "ipfs is currently the most favored in this sort of application, but as for your base question... torrents slightly predate cryptocurrency. The decentralized sharing of media is the most established form of decentralization we have.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "gltgxrd",
                            "author": "PM_DA_BUM",
                            "score": 5,
                            "created_utc": 1612321797.0,
                            "response": "Hmm I think im starting to understand but still not quite sure",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "gltkihy",
                    "author": "pringao-chevere",
                    "score": 7,
                    "created_utc": 1612323571.0,
                    "response": "This article may be useful  \n\n\n[You're new to crypto, so what's the deal with Ethereum?](https://medium.com/coinmonks/youre-new-to-crypto-so-what-s-the-deal-with-ethereum-68e488fdca10)",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "glu4w7o",
                            "author": "TheIRSEvader",
                            "score": 1,
                            "created_utc": 1612336262.0,
                            "response": "Great read, thanks!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "glu8zoc",
                    "author": "4dv4nc3d",
                    "score": 6,
                    "created_utc": 1612339662.0,
                    "response": "The future my son",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gluk4qv",
                    "author": "economicsdesign",
                    "score": 6,
                    "created_utc": 1612349790.0,
                    "response": "I'm going to answer your questions directly, bc no one else is doing it. \n\n* Currently, you use ETH to pay for transactions on ETH. E.g. defi protocols.\n* It is important because you use it to run protocols on Ethereum\n\n* Benefits of holding: holding and not using, the economics suggests that the value of ETH can increase\n\n* Potential of it: look at the amount of money and growth rate of users and money deposited into the ETH network as a whole, more people are using ETH to transact. Also, more institutional funds are allowing people to invest in ETH as an investment product\n\n* Decentralised global computer: yes that is the goal. You have apps on your android. You have apps on ETH.\n\n\n[Video explainer for 101 beginners](https://youtu.be/z23g0AJyOFo)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gltefx7",
                    "author": "BluRain508",
                    "score": 5,
                    "created_utc": 1612320577.0,
                    "response": "Bump for info as well.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "gltf6z4",
                            "author": "PM_DA_BUM",
                            "score": 8,
                            "created_utc": 1612320948.0,
                            "response": "I think the more knowledge we share as a community, the stronger and more confident people will be buying and holding for the long term.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "gltjgbs",
                                    "author": "simpleman_94",
                                    "score": 1,
                                    "created_utc": 1612323041.0,
                                    "response": "Sure. I am holding Ethereum. But what the fuck is Ethereum ma man",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "glthzs5",
                            "author": "TwistedNutsack666",
                            "score": 1,
                            "created_utc": 1612322320.0,
                            "response": "Ditto!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "glti01m",
                    "author": "domanite",
                    "score": 6,
                    "created_utc": 1612322324.0,
                    "response": "What public resources have you already looked at? Are there specific points that aren't clear?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "glu4yy2",
                    "author": "noisewar",
                    "score": 8,
                    "created_utc": 1612336321.0,
                    "response": "Imagine you had dollar bills that could magically teleport to anyone in the world, and could be told how to make deals for you like little servants.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "gludqbc",
                            "author": "nicfuecol",
                            "score": 1,
                            "created_utc": 1612343930.0,
                            "response": "This one's my favourite!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "glubjbo",
                    "author": "Tommy_C",
                    "score": 3,
                    "created_utc": 1612341920.0,
                    "response": "Are there any horse socks? Is anybody listening to me?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "glugisx",
                    "author": "Non808",
                    "score": 3,
                    "created_utc": 1612346510.0,
                    "response": "If your interested in crypto currencies don’t take analogies, here’s what they actually are: [3blue1brown’s excellent video](https://youtu.be/bBC-nXj3Ng4)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gluqnbs",
                    "author": "nelfiweezy",
                    "score": 3,
                    "created_utc": 1612355031.0,
                    "response": "As someone who started with ethereum around 1 year ago, the best way to learn about ethereum is to use it. Get on crypto twitter, follow bankless, sassal0x, hasu, follow the people they follow.\n\nEth is the most trustless asset in the ethereum network, you can use it as collateral to take out a loan (like you may use your house as collateral to get more loan in a bank) only here you take out the loan without permission from anyone. \n\nyou need it for paying for transactions\n\nyou can stake it on eth2 and earn around 10% interest right now, will go lower than that but it will still be alot better than anything you can find in traditional finance\n\nthe potential of ethereum as i personally see it is almost endless, anyone with an idea can build on top of it and integrate into ethereum. \n\nWhere ever you are in the world, you can transact with anyone, without restrictions. \n\nIts revolutionary",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "glubuql",
                    "author": "ALFAcashier",
                    "score": 4,
                    "created_utc": 1612342213.0,
                    "response": "Bitcoin allows two parties to transfer money, without needing to trust a third one.\n\nWhat if you do want a third party? eg. to escrow your money and only send it after a condition is met. \n\nEthereum introduces this third party, as smart contracts. It's 100% uptime, anyone can verify the code, and improve it.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "gluyvnt",
                            "author": "twinklehood",
                            "score": 4,
                            "created_utc": 1612360057.0,
                            "response": "This is too simplified. Bitcoin can escrow with multisig. The power of ethereum is the conditions part.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "glva4ep",
                                    "author": "ALFAcashier",
                                    "score": 3,
                                    "created_utc": 1612365238.0,
                                    "response": "Fair. I was missing the comparison to bitcoin in this thread. I guess most reddit users do have a basic understanding of bitcoin. So seems like a good place to start.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "glu64q0",
                    "author": "breefield",
                    "score": 2,
                    "created_utc": 1612337252.0,
                    "response": "Whatthefuckisethereum.com",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gluiazi",
                    "author": "Top_Secret_TerminaL",
                    "score": 2,
                    "created_utc": 1612348154.0,
                    "response": "It’s a thing, bro",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gltnn3j",
                    "author": "MainPackage",
                    "score": 1,
                    "created_utc": 1612325193.0,
                    "response": "Eth is many things. It’s the basis of crypto’s and houses many other crypto’s on its platform. I would wait a bit for it to drop the. Get in. I got in when it was around $190 in April or so. \n  Check out theta. It’s incredible. \n\nhttps://ethereum.org/en/what-is-ethereum/",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "glu6tdn",
                    "author": "jabrahamson",
                    "score": 1,
                    "created_utc": 1612337805.0,
                    "response": "It's true value comes with its ability to write smart contracts to the ethereum chain. These smart contracts allows automatic control over the chain. This gives it true business practicality!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "glu7bad",
                    "author": "natu91",
                    "score": 1,
                    "created_utc": 1612338216.0,
                    "response": "Just imagine you could program money",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "glu9mnb",
                    "author": "Negative-Cow6561",
                    "score": 1,
                    "created_utc": 1612340219.0,
                    "response": "Can you advise any binary blockchain exchanges? \n\nRecently joined Baex, a new defi platform. There are NASDAQ tools, checked Uber and Amazon, seems profitable. Is it a good idea to try this platform?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gluc1ln",
                    "author": "ALFAcashier",
                    "score": 1,
                    "created_utc": 1612342388.0,
                    "response": "Podcasts featuring Vitalik explaining Ethereum:\n\n[https://www.youtube.com/watch?v=8TwNNgiNZ7Y](https://www.youtube.com/watch?v=8TwNNgiNZ7Y)\n\n[https://www.youtube.com/watch?v=3x1b\\_S6Qp2Q](https://www.youtube.com/watch?v=3x1b_S6Qp2Q)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gluf5kl",
                    "author": "kshucker",
                    "score": 1,
                    "created_utc": 1612345248.0,
                    "response": "I show [this video](https://youtu.be/jxLkbJozKbY) to everyone that asks me Ethereum is. I think it’s the best explanation out there.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "glujbsg",
                    "author": "Jiri_M159",
                    "score": 1,
                    "created_utc": 1612349071.0,
                    "response": "I think the best thing and one of the most important things is that ETH is helping DEXes to exist. Without Ethereum things like Uniswap or  Whiteswap would not exist.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gluqg2o",
                    "author": "Menard666",
                    "score": 1,
                    "created_utc": 1612354889.0,
                    "response": "So if I own a single eth coin can I use it to safely make more eth or another currency somehow besides just holding it?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "gluz5ds",
                            "author": "twinklehood",
                            "score": 3,
                            "created_utc": 1612360201.0,
                            "response": "No. You can invest it to hope to make more, but totally safe extra money doesn't exist.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "gluwb0q",
                    "author": "i3ubbles",
                    "score": 1,
                    "created_utc": 1612358651.0,
                    "response": "Smart. Contracts. \nAny business/transaction is a form of contract. What enforces the rules? Conventionally we have our justice system; here, if the requirements of the contact are not met (if one party does not meet their requirements such as payment) then the contract is not executed. Simple. No dealing escrow title businesses that take days/weeks to certify. Trust is in the code, not fallible human judgement. \n\nThat is Ethereum. To explain it all would be like explaining what the internet is. 99% of its users do not comprehend its vast complexity nor do they care. The possibilities are endless. DYOR. \n\nGl hf.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gluypxa",
                    "author": "biffterjim",
                    "score": 1,
                    "created_utc": 1612359973.0,
                    "response": "Is it worth buying into Eth as well as / instead of other alt coins?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "glv03q0",
                    "author": "SucculentChinaMeal",
                    "score": 1,
                    "created_utc": 1612360694.0,
                    "response": "I'm confused OP, do we pm you da bum or do you pm us da bum?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "glvf9gf",
                    "author": "RAFAJ2390",
                    "score": 1,
                    "created_utc": 1612367397.0,
                    "response": "Decentralized AWS!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "glwka2l",
                    "author": "SchmuW2",
                    "score": 1,
                    "created_utc": 1612383889.0,
                    "response": "ill give you the basics: it is a network of value on which apps can be build using smart contracts. These contracts are self-executing and trustless circumventing the need for a 3rd party between transactions. This also makes it ripe to disrupt the entire financial system.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "glxc20s",
                    "author": "life_is_dumb",
                    "score": 1,
                    "created_utc": 1612395930.0,
                    "response": "In my rudimentary understanding, it's a place for decentralized transactions and contracts to be built. It's most known for its decentralized finance (DeFi) capabilities. Basically, think of any transaction and think of the third party necessary to facilitate it (loans, transfers, purchases, etc.). The Ethereum blockchain facilitates pretty much anything you can fathom without the need for a third party control. Everything is built into the code. It's also got NFTs (non fungible tokens - Google it)) and other stuff. IMO it will completely overtake the current financial system. It makes banks and so much more obsolete.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "glxc348",
                            "author": "etherium_bot",
                            "score": 1,
                            "created_utc": 1612395944.0,
                            "response": "It's spelled 'Ethereum'.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "glxqaec",
                    "author": "perseverance_116",
                    "score": 1,
                    "created_utc": 1612402921.0,
                    "response": "So i should buy some tonight? I heard Feb 4th is the kick off for bull run skyrocket cuz tons big name companys meeting up tomorrow to talk game plan for investing...thats why these big dogs coming out with 500k btc soon. if ETH gets cap then this will make price go way way up...mmmmm...hm i think im in.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "glxssr8",
                    "author": "s0hungry1",
                    "score": 1,
                    "created_utc": 1612404159.0,
                    "response": "Why doesn't bitcoin just add the programmable aspect to it?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "glxta4l",
                    "author": "s0hungry1",
                    "score": 1,
                    "created_utc": 1612404392.0,
                    "response": "I still have trouble understanding the applications of Ethereum. Most examples outside finance / payments seem to have some sort of gotcha like it requires trust in some centralized thing anyway (or like the uber example someone gave in this thread, wouldn't work practically).  \n\n\nCan a service like dropbox exist on ethereum?  \n\n\nWhere would be bits be stored? What would the cost of downloading your file be today? What could the cost be theoretically, in the future?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "glu7tqm",
                    "author": "jaumenuez",
                    "score": 0,
                    "created_utc": 1612338654.0,
                    "response": "You said you wanted to put some money while knowing nothing about it. Uhmmm, please do some serious reseach before you take any action. To have some to start with I can tell what it's not:\n\n* Not a store of value\n* Not guarante of secure contracts\n* Not as decentralize as many think it is \n* Not clear mission\n* Not a single use case that can't be done faster and more efficiently with a regular distributed database.\n* Not resistant to regulatory attacks.\n\nEthereum is well known mostly bc it's the best blockchain for most programmers to sell snakeoil.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "glu6d8n",
                    "author": "TheMeaningIsJust42",
                    "score": -1,
                    "created_utc": 1612337439.0,
                    "response": "It a money maker machine ;)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "glu9kl0",
                    "author": "PrescottX",
                    "score": -1,
                    "created_utc": 1612340169.0,
                    "response": "BTC is the gold of crypto.  ETH is the mainframe computer driving crypto transactions.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "glunyne",
                    "author": "Mordan",
                    "score": -1,
                    "created_utc": 1612353014.0,
                    "response": "its an intellectual scam that sells you something impossible.\n\nEthereum can only work if the trilemma is solved.  This is possible on Ethereum and only Ethereum because Vitalik is God\n\nTry to use any smart contract and be ready to fork out 100 USD of value just to use it.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}