{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uxctiy",
            "title": "China’s BSN to launch overseas public chain without crypto support",
            "url": "https://forkast.news/headlines/bsn-overseas-public-chain-without-crypto-support/",
            "author": "lorenzomofo",
            "created_utc": 1653467494.0,
            "score": 1,
            "num_comments": 8,
            "subreddit": "ethereum",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9yw6m7",
                    "author": "Always_Question",
                    "score": 2,
                    "created_utc": 1653504217.0,
                    "response": "This is stupid, but ok",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia1ekyd",
                            "author": "The_Cometer",
                            "score": 1,
                            "created_utc": 1653549566.0,
                            "response": "BSN is not the solution but it is proof that the cryptocurrency market needs to find a balance in order to get nations on board. It needs to be beneficial for them and there must be reassurances that they can keep an acceptable level of control over it:\n- States can accept cutting the middle man (traditional banks). \n- They can even accept that crypto becomes the main currency as long as that avoids any other competitors from taking over control.\n- They can accept decentralization as that will also limit bad actors from disrupting the network.\n- They won’t accept ways to circunvent KYC or a network being used for money laundering and other illegal activities or to give an advantage to some competitor.\n\nBSN main issue is that it is perceived as being a trojan horse created by the Chinese government to control the future of public blockchains. \nIt still doesn’t solve the real problems with the current financial system.\n- It’s a state backed solution. Not a state independent worldwide solution.\n- It still depends on fiat money. And although China (sorry BSN) is tying it to the USDC it doesn’t make it any better.\n- It claims its a no KYC network but Spartan is only part of the equation. BSN operators control KYC entirely and can stop transactions.\nThere is no direct way of transferring funds from one wallet to the other without the operators. Who controls those operators? \nhttps://www.coindesk.com/markets/2021/03/16/inside-chinas-effort-to-create-a-blockchain-it-can-control/\n\nPublic Blockchains were created based on cryptocoins to:\n- Remove the middle man. Making direct, faster transactions possible.\n- Removing currency from conflicts.\n\t-  No entity can disrupt the entire network. States could impose rules limiting transactions by forcing every citizen to declare their crypto wallets thus having a database of those addresses and controlling any transaction done from that wallet to a wallet outside their juridiction. But no single bad actor would be able to disrupt service to everyone. \n      - A global public, open cryptocurrency has one advantage over fiat money. While fiat money is backed by the full faith in the government and institutions of a nation, Bitcoin, Ethereum or whatever cryptocurrency becomes the global standard may end up being backed by the full faith of the worldwide economy and their institutions. The faith that everyone will use the public blockchain to conduct business.\n- You need ether to become a validator and are rewarded back with ether. The value of ether ensures “honesty” among validators.\nHow does BSN ensure honesty? They don’t. China UnionPay runs the clusters that provide consensus. This is a centralized system controlled by China much like SEPA, SWIFT is controlled by western nations. China would love for UnionPay to become the world standard for banking transactions. But other nations want their system to remain or become the standard. In the current model no one trusts each other and they live in fear that the other is going to disrupt the network.\nCryptomoney based blockchains solve this conflict once and for all. \n\nChina main error is that by blocking cryptos from its market and then creating their own state backed blockchain solution brings focus to the exact issues why Bitcoin, Ethereum and other cryptos were created. \nAnd that is to avoid any single actor from controlling the entire network and to break away from state owned currency. To move towards worldwide currency.\nChina, the US, EU or any other nations and states  can still pass laws and impose rules to their citizens on how they can use any cryptocurrency. (the example of forcing citizens to declare their wallets for instance). But with public crypto China also has the benefit that no other nation (the US for instance) will be able to stop the network from working and vice versa. \n\nIt is important for states to understand that crypto money like Ethereum won’t take away their control over what their citizens and competitors can do when it comes to monetary policy but it brings several benefits that will aid economic growth and stability.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia2v6gy",
                                    "author": "Always_Question",
                                    "score": 1,
                                    "created_utc": 1653580702.0,
                                    "response": "Nice writeup.  The Chinese gov is control freaky.  Once they can get over themselves, they will see the benefits of open, public, decentralized, crypto-based infrastructure.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "id": "uxcvgi",
            "title": "Crypto podcasts",
            "url": "https://www.reddit.com/r/ethereum/comments/uxcvgi/crypto_podcasts/",
            "author": "H4y3s_",
            "created_utc": 1653467752.0,
            "score": 5,
            "num_comments": 16,
            "subreddit": "ethereum",
            "selftext": "Hi all, can anyone please recommend some good crypto podcasts? I can see there’s a lot out there but would love some recommendations. Happy to give any a go. Your suggestions are very much appreciated. Thanks",
            "stickied": false,
            "comments": [
                {
                    "id": "i9wxa04",
                    "author": "MinimalGravitas",
                    "score": 6,
                    "created_utc": 1653469601.0,
                    "response": "**Ethereum specific:**\n\n* Bankless\n\n* The Daily Gwei\n\n* Into The Ether\n\n**More General Crypto**\n\n* The Defiant\n\n* Into The Bytecode\n\n* Epicenter\n\n* Unchained\n\n* Zero Knowledge\n\n**Regen/Public Goods**\n\n* Green Pill\n\n* Planet of the Klimates\n\n* ReFi Podcast",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9z0br0",
                    "author": "hanniabu",
                    "score": 4,
                    "created_utc": 1653505866.0,
                    "response": "[Wholesome Crypto](https://www.youtube.com/channel/UCOxDgUgQVNPD-cAwjHbdR3g)",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9z2ezc",
                            "author": "Wholesome_Crypto",
                            "score": 3,
                            "created_utc": 1653506709.0,
                            "response": "Thanks for the mention!\nA quick overview of my podcast is that I learn about how my guests got into crypto and what they are building for the industry.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9z34j1",
                                    "author": "H4y3s_",
                                    "score": 2,
                                    "created_utc": 1653506999.0,
                                    "response": "Thanks all. I’ll give this a listen!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9x0jn1",
                    "author": "Afar20",
                    "score": 2,
                    "created_utc": 1653472507.0,
                    "response": "Realvision is worth a listen.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9xp3dv",
                    "author": "H4y3s_",
                    "score": 2,
                    "created_utc": 1653487058.0,
                    "response": "Thanks all! I started with Bankless and that’s already sent me down a rabbit hole 😂😅",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9wwnc8",
                    "author": "RD___23",
                    "score": 1,
                    "created_utc": 1653469037.0,
                    "response": "Bad crypto podcast, lex fridman also has good guests on too if you want something lengthy - his ones with Vitalik are dope. Coinbeauro from YouTube also has a podcast. if your a new - crypto curious is also good.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9yoeo4",
                            "author": "bandoonparade",
                            "score": 1,
                            "created_utc": 1653501165.0,
                            "response": "I was listening to one of the most recent Bad Crypto Podcast pods and they started on some crazy rant about liberal California politicians and I immediately turned it off. I get that a lot of crypto true believers are libertarian in bent, but I have ZERO interest in listening to conspiracy theories about how there's a 70-80% chance of nuclear war in the next decade.\n\nBig fan of Bankless and Into the Ether. I also listen to Coindesk's Market Daily Roundup.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia5hwhz",
                    "author": "banaanigasuki",
                    "score": 1,
                    "created_utc": 1653622860.0,
                    "response": "Interesting to see few mention [Blockworks Crypto](https://youtube.com/channel/UCEOv-8wHvYC6mzsY2Gm5WcQ)",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}