{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uw2gqo",
            "title": "Coinbase Backs Enterprise-Grade ETH Liquid Staking Startup",
            "url": "https://www.thismorningonchain.com/articles/defi/coinbase-backs-enterprise-grade-ethereum-liquid-staking-startup/",
            "author": "totallynotbeyonce",
            "created_utc": 1653318771.0,
            "score": 73,
            "num_comments": 15,
            "subreddit": "ethereum",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9p16uk",
                    "author": "coinfeeds-bot",
                    "score": 5,
                    "created_utc": 1653320728.0,
                    "response": "tldr; Coinbase and Figment are investing in Alluvial, which is building a non-custodial liquid staking protocol aimed at enterprise customers. The new company will build and manage a protocol with integrated KYC and anti-money laundering checks. With normal staking, you lock up your assets to earn yield, and can't touch them while they're locked up.\n\n*This summary is auto generated by a bot and not meant to replace reading the original article. As always, DYOR.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9rxfl0",
                    "author": "elliot192",
                    "score": 1,
                    "created_utc": 1653370479.0,
                    "response": "Coinbase are in the shit and i wouldnt trust them.\nUsdt gunna rug too.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9q3gwj",
                    "author": "Zenith-Skyship",
                    "score": 1,
                    "created_utc": 1653336945.0,
                    "response": "What about non-enterprise customers?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9r3ybb",
                            "author": "domotheus",
                            "score": 4,
                            "created_utc": 1653354150.0,
                            "response": "From a quick glance at the article it seems like it will basically be the USDC of liquid staking. Only whitelisted enterprises can actually mint/burn them after passing proper KYC/AML checks, but after that the tokens make their way to DeFi where anyone can swap for them without all that KYC stuff, the same way anyone can swap ETH for USDC on Uniswap. \n\nSo it will be available for us plebs, with the usual asterisk that some central party ultimately has the control over the ERC20 smart contract and can blacklist addresses at will, the same exact way how USDC and USDT can be frozen from wallets when someone does something they don't like. \n\nAnd then there's also the added risk that all the actual ETH backing it on the beacon chain is operated by a central entity, which may mess up (or be coerced into messing up) and get slashed massively by the anti-correlation penalties. I assume they will be insured against that sorta stuff to bring more confidence for those who deem the centralization/safety tradeoff worth it, but that will ultimately also eat into the net yield of the token.\n\nIf all that sounds yucky to you, I don't blame you. Thankfully there are actually decentralized non-custodian options like Rocket Pool and that's where I'll continue putting my money.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9q91gi",
                            "author": "eat_carbs",
                            "score": 0,
                            "created_utc": 1653339369.0,
                            "response": "Lido",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9qbdhc",
                                    "author": "Electrical_Yam5077",
                                    "score": 11,
                                    "created_utc": 1653340407.0,
                                    "response": "Lido’s large market dominance is objectively bad for the health of the network. A better option is Rocket Pool. Promotes liquid staking and decentralization.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9qlc1y",
                                            "author": "eat_carbs",
                                            "score": 1,
                                            "created_utc": 1653345025.0,
                                            "response": "Sure. Hopefully post merge lidos huge stake will lessen",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9ua184",
                            "author": "cardboard86",
                            "score": 1,
                            "created_utc": 1653418753.0,
                            "response": "stakewise :)",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}