{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uqxg0b",
            "title": "Will it be possible Ethereum L1 transactions less than 0.50 usd in the future?",
            "url": "https://www.reddit.com/r/ethereum/comments/uqxg0b/will_it_be_possible_ethereum_l1_transactions_less/",
            "author": "mkiob",
            "created_utc": 1652711867.0,
            "score": 0,
            "num_comments": 19,
            "subreddit": "ethereum",
            "selftext": "I saw a quote by Vitalik saying Ethereum transactions should cost just a few cents.\n\nI'd like to know how likely it's too happen in the future in Ethereum L1. If it's likely to happen, how far we are from there and how it would be possible in L1?",
            "stickied": false,
            "comments": [
                {
                    "id": "i8tqx4v",
                    "author": "Maswasnos",
                    "score": 5,
                    "created_utc": 1652712850.0,
                    "response": "I doubt it, that would make it too easy for large entities to spam. \n\nETH mainnet is aiming to be a settlement area for other networks in the long run, mostly rollups. Rollups, validiums, and volitions are where most activity will take place while mainnet becomes a place where value is settled by these networks.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8uny1v",
                    "author": "IamAFlaw",
                    "score": 2,
                    "created_utc": 1652726127.0,
                    "response": "It is possible now in low traffic...",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8vdfun",
                    "author": "MoistConcert420",
                    "score": 2,
                    "created_utc": 1652736594.0,
                    "response": "When ETH hits sub $100 you'll have your cheap TX.\n\nETH sole design is to charge high gas and force all the poors to L2 so stakers can profit. \n\nThere is a reason they ignore and refuse to work on gas fees. It's the only reason to get people to stake and without staking there will be no network.\n\nBagholders just lie beyond reason trying to pump their heavy bags with smoke and mirrors to try to convince all the bigger fools to buying into their bags. \n\nPeople are severely delusional thinking anything is designed or implemented for them. It's sole history is: as the DEVs stated themselves \"we have to look out for investors\" \n\nPeople honestly need to stop preaching sunshine and rainbows because of their extreme greed. So funny how money brings out people's true nature. Most these bagholders would con their own grandma if it made them a dollar. \n\nHahahahahahahaha",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8vmcnm",
                            "author": "mkiob",
                            "score": 1,
                            "created_utc": 1652740534.0,
                            "response": "As far as I know the staking APR will be in a range of 8-13%, if charged higher fees are intentionally designed to benefit stakers, why that APR isn't directly related to the charged fees instead of being limited in a flat range like that? I mean, even in a low usage of the network, the APR would be at least around 8%.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8x3hz0",
                                    "author": "AESTHTK",
                                    "score": 1,
                                    "created_utc": 1652770819.0,
                                    "response": "You’re responding to a troll post 🥲",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8vpxb2",
                                    "author": "MoistConcert420",
                                    "score": -1,
                                    "created_utc": 1652742196.0,
                                    "response": "Everyone shouting random APR numbers, with no backing. Hahahahahaha. Must be trying to con the next fool to offload your bags too?\n\nCurrent APR is 4.3% and dropping. With the goal of maxing validators looking at 1% APR end result.\nhttps://ethereum.org/en/staking/\n\nPeople are just shilling their bags. Staking won't even beat monthly inflation levels. Hahahahaha\n\nAgain the sole reason they refuse to work on gas fees is because that is their revenue stream. The devs said it themselves \"we have to look out for our investors\" bagholders can spin it however they want to help themselves sleep better at night. \n\nJust can't wait to see what gimmick they role out for withdrawing stake. So far looks like a time limit and application, that way all of VBs buddies he bailed out during the DAO rollback can be first ones out. Hahahahahahahahaha",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8vrief",
                                            "author": "Normal_Cranberry_526",
                                            "score": 2,
                                            "created_utc": 1652742955.0,
                                            "response": "Any _Haha_ over 4 characters  is reserved for video game villains",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8vrua5",
                                                    "author": "MoistConcert420",
                                                    "score": -1,
                                                    "created_utc": 1652743116.0,
                                                    "response": "Nah, shows emphasis like extra !!!\n\nToo many emo people can't handle when someone doesn't do exactly as they do. \n\nSorry I don't do bandwagons. You won't find your echo chamber here.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8vr288",
                    "author": "Normal_Cranberry_526",
                    "score": 2,
                    "created_utc": 1652742739.0,
                    "response": "One argument against cheap future L1 transactions is specifically roll ups. There might com a time where roll ups are generating so much volume and dividing gas between users that it'll be almost impossible for a single user to compete, possibly forcing them to L2s too",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8wgndb",
                            "author": "mkiob",
                            "score": 1,
                            "created_utc": 1652755548.0,
                            "response": "But, per example, if a user has a NFT on Ethereum L1, can he use it on roll up or it's a different chain that require another NFT being minted there?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8trjb6",
                    "author": "majorpickle01",
                    "score": 2,
                    "created_utc": 1652713109.0,
                    "response": "At current volumes with sharding potentially, but as ETH is used more and more the limited amount of blockspace becomes more competitive. I think it's unlikely, and most future transactions will be done via a rollup centric layer 2",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8uxhbr",
                    "author": "H4y3s_",
                    "score": 1,
                    "created_utc": 1652730030.0,
                    "response": "L2’s seem to be the way forward. Vitalik is a firm believer in LRC being a big part of the future.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8u3cag",
                    "author": "SuperCryptoBr0",
                    "score": -1,
                    "created_utc": 1652717954.0,
                    "response": "#“Trust me bro”",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ugic9",
                    "author": "pihip2",
                    "score": 1,
                    "created_utc": 1652723181.0,
                    "response": "It's not in the foreseeable future.  \nVitalik made it pretty obvious that L2 and side chains are the future of Ethereum scaling. He always talks about how important Polygon is to the Ethereum ecosystem for example",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8x3e9t",
                    "author": "AESTHTK",
                    "score": 1,
                    "created_utc": 1652770734.0,
                    "response": "He was talking about Layer 2:\n\nhttp://l2fees.info",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8x7j2p",
                    "author": "Souljacker1337",
                    "score": 1,
                    "created_utc": 1652774399.0,
                    "response": "Hedera transactions are fixed at 0,0001$",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uqxeus",
            "title": "What are you doing, Stereum?",
            "url": "/r/ethstaker/comments/uqx98t/what_are_you_doing_stereum/",
            "author": "daGscheid",
            "created_utc": 1652711774.0,
            "score": 2,
            "num_comments": 3,
            "subreddit": "ethereum",
            "selftext": "",
            "stickied": false,
            "comments": []
        }
    ]
}