{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uvogco",
            "title": "Riddle me this, please",
            "url": "https://www.reddit.com/r/ethereum/comments/uvogco/riddle_me_this_please/",
            "author": "protagonist85",
            "created_utc": 1653267045.0,
            "score": 1,
            "num_comments": 4,
            "subreddit": "ethereum",
            "selftext": "Can someone explain why ethereum hashing power is at the all time high right now, DESPITE the merge announced in less than 3 months. \n\nIn POW >POS transition there is no use for all that hashing power. I find it puzzling. Thoughts?",
            "stickied": false,
            "comments": [
                {
                    "id": "i9mnk2v",
                    "author": "techie_003",
                    "score": 3,
                    "created_utc": 1653267153.0,
                    "response": "I imagine everyone is mining what they can before POS merge\n\nEdit: I can also see alot of miners switching to ETC in days/weeks to come which requires nothing more then a currency & mining pool address change.. very little effort required and avoiding new OC/strap testing etc.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9mqcsc",
                    "author": "themanndalore",
                    "score": 1,
                    "created_utc": 1653268584.0,
                    "response": "Ethereum mining is done by mostly general purpose GPU's afaik.  If the block rewards are high, they'll mine it at max power until the day it switches.  Once it switches, they'll mine the next most profitable coin or sell their GPU's if the juice ain't worth the squeeze",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9mqoot",
                    "author": "DeliberateDonkey",
                    "score": 1,
                    "created_utc": 1653268753.0,
                    "response": "ETH is still the most profitable coin to mine, so I expect people will mine it right up until the end. Smart ones might get out early to try and sell their equipment while its value is still holding up, but I think the meme that PoW has been endlessly delayed will keep folks in the pool until the bitter end.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}