{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uvtji9",
            "title": "Frequently Asked Questions + Weekly Discussion Thread",
            "url": "https://www.reddit.com/r/ethereum/comments/uvtji9/frequently_asked_questions_weekly_discussion/",
            "author": "AutoModerator",
            "created_utc": 1653285611.0,
            "score": 18,
            "num_comments": 31,
            "subreddit": "ethereum",
            "selftext": "**Welcome to the Weekly Discussion. Please read the disclaimer, guidelines, and rules before participating.**\n\nRules:\n\n* All [sub rules](https://www.reddit.com/r/Ethereum/about/rules/) apply in this thread.\n* Discussion topics must be related to Ethereum.\n* Behave with civility and politeness. Do not use offensive, racist or homophobic language.\n* Comments will be sorted by newest first.\n\nUseful Links:\n\n* [Ethereum.org](https://ethereum.org)\n* [ETHMerge.com](https://ethmerge.com/)\n\n**Reminder**\n\n/r/ethereum is a community for discussing the technology, news, applications and community of Ethereum. **Discussion of the Ether price or trading is not allowed.** Please keep those discussions to [/r/ethfinance](https://www.reddit.com/r/ethfinance) and [/r/ethstaker](https://www.reddit.com/r/ethstaker).\n\n&#x200B;\n\n**Frequently Asked Questions**\n\n**Where's the best place to buy ETH?**\n\nThere are many centralized exchanges that support Ethereum. If you live in the US, the most popular exchanges are Coinbase, Gemeni and Kraken. Coinbase users can use Coinbase Pro for lower fees.\n\n**When is Eth2 launching?**\n\nEth2 is a marketing term used to represent a number of updates to Ethereum. The Eth2 proof-of-stake chain first launched in December 2020. \"The Merge\", which is the event that will fully switch Ethereum's consensus to proof-of-stake, is estimated to be ready in early 2022, although there is no exact timeline. Other updates, such as data shards, will follow that update.\n\nVisit [ethmerge.com](https://ethmerge.com/) to learn more about \"The Merge\".\n\n**Do I need to do anything to update to Eth2? Will Eth2 create a new token?**\n\nNo, ETH holders *never* need to take any action to keep holding ETH. Ethereum users will be unaffected by the Eth2 upgrade. And the Eth2 updates will not create any new tokens.\n\n**How can I stake my ETH?**\n\nThe best way to stake your ETH: by running your own validator.\n\n* Running your own validator requires a modern computer and 32 ETH. Visit /r/ethstaker for more details\n\n**Why are Ethereum transaction fees so high?**\n\nLike most blockchains, Ethereum fees are determined by supply-and-demand. The large demand to use Ethereum has pushed transaction fees quite high (however, fees were just a few cents only 2 years ago). Fees are especially high during market volatility, and during NFT drops.\n\n**What is being done to lower Ethereum transaction fees?**\n\nEthereum fees are reduced by using layer-2 rollups. Rollups are scaling solutions that allow for significantly cheaper transactions, while still maintaining Ethereum's security.\n\nAdditionally, Eth2's data shards will make rollups even cheaper.\n\nWhile rollups are cutting-edge technology being actively developed, a number are already live on Ethereum mainnet. Visit [l2beat.com](https://l2beat.com/) to learn more about rollups.\n\n**What's the best wallet for Ethereum?**\n\nThe most popular tool for using decentralized applications is Metamask. However, for security reasons, we recommend using a hardware wallet such as a Trezor or Ledger.\n\n&#x200B;\n\nAre there questions you'd like to see added? Leave a comment below.",
            "stickied": true,
            "comments": [
                {
                    "id": "i9nlv7t",
                    "author": "domotheus",
                    "score": 5,
                    "created_utc": 1653287398.0,
                    "response": "To any mods reading this, is there any way to get quality contributors on some sort of whitelist, protected from AutoMod's aggressive auto-removals? It's really disheartening to write several paragraphs answering a question in depth only to have it immediately removed, never to be seen. Especially while there are obvious scams, trolls and misinformation constantly making their way to the top and into every thread...\n\nIf so, I nominate these people:\n\n* /u/domotheus (myself)\n\n* /u/AESTHTK \n\n* /u/frank__costello\n\n* /u/cosmic-comedy \n\n* /u/Perleflamme \n\n* /u/cryptOwOcurrency\n\n* /u/mooremo \n\n* literally anyone who frequently participates in /r/ethfinance daily threads\n\nI may have forgotten some, I just did a quick scan basing myself on my personal RES upvote counts. Whitelisting these people would be an easy step in increasing the quality of the subreddit.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9pehog",
                    "author": "StellarNoob",
                    "score": 1,
                    "created_utc": 1653326299.0,
                    "response": "Where is the best place to farm using my ETH ? There was a post here about the different options of farming ETH  but I can't find it anymore \n\nI am talking about farming and not staking",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9qqneb",
                    "author": "52134682",
                    "score": 1,
                    "created_utc": 1653347597.0,
                    "response": "I've got 1K to purchase crypto with. Should I spend it on Ethereum or Bitcoin? Or should I split it and buy 500 Ethereum and the rest Bitcoin? Plans to hold it for a decade or two.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9qxu0n",
                            "author": "Maswasnos",
                            "score": 2,
                            "created_utc": 1653351153.0,
                            "response": "I recommend you ask in the /r/ethfinance daily thread. This sub is more for tech talk and news, less for investment advice/chat.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9r5r1d",
                                    "author": "52134682",
                                    "score": 2,
                                    "created_utc": 1653355021.0,
                                    "response": "Will do. Thanks",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9qxv1s",
                                    "author": "sneakpeekbot",
                                    "score": 1,
                                    "created_utc": 1653351168.0,
                                    "response": "Here's a sneak peek of /r/ethfinance using the [top posts](https://np.reddit.com/r/ethfinance/top/?sort=top&t=year) of the year!\n\n\\#1: [🚨 BIG NEWS! 🚨 ETH will be used as crypto payments for 50,000 EV charging stations in Europe](https://i.redd.it/9jjw4hhgdg771.jpg) | [109 comments](https://np.reddit.com/r/ethfinance/comments/o7t7oc/big_news_eth_will_be_used_as_crypto_payments_for/)  \n\\#2: [I gave my dad 100 ETH 4 years ago for Father’s Day and now it’s currently worth ~$225,000 — when ETH hits $10,000 this year, I will have made my dad a millionaire.](https://i.redd.it/ua1tw2ybnh671.jpg) | [114 comments](https://np.reddit.com/r/ethfinance/comments/o4fhk3/i_gave_my_dad_100_eth_4_years_ago_for_fathers_day/)  \n\\#3: [Daily General Discussion - August 5, 2021](https://np.reddit.com/r/ethfinance/comments/oyakfh/daily_general_discussion_august_5_2021/)\n\n----\n^^I'm ^^a ^^bot, ^^beep ^^boop ^^| ^^Downvote ^^to ^^remove ^^| ^^[Contact](https://www.reddit.com/message/compose/?to=sneakpeekbot) ^^| ^^[Info](https://np.reddit.com/r/sneakpeekbot/) ^^| ^^[Opt-out](https://np.reddit.com/r/sneakpeekbot/comments/o8wk1r/blacklist_ix/) ^^| ^^[GitHub](https://github.com/ghnr/sneakpeekbot)",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9tw74e",
                    "author": "RazerPSN",
                    "score": 1,
                    "created_utc": 1653412981.0,
                    "response": "I need to store some tokens for long term, is L2 as safe as ETH chain?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ueakz",
                            "author": "Maswasnos",
                            "score": 1,
                            "created_utc": 1653420545.0,
                            "response": "I recommend you read through the warnings on https://l2beat.com/ to see what the drawbacks of current L2s are. \n\nNone of them have the same degree of security as mainnet Ethereum yet, but I would say zkSync and Loopring come fairly close.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9ueu5b",
                            "author": "domotheus",
                            "score": 1,
                            "created_utc": 1653420776.0,
                            "response": "Go over to [l2beat](https://l2beat.com/) and click on any rollups to see their security aspects as they currently are. \n\nMy personal opinion is that if you're looking for a cold storage \"set and forget\" type thing, then Layer 1 is your safest bet with the best guarantee of your tokens still being easily available years from now without having to track L2 development. This safety and convenience is well worth the money you're gonna spend on gas.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9udc3l",
                    "author": "Gabon08",
                    "score": 1,
                    "created_utc": 1653420143.0,
                    "response": "Is Kraken a good place to buy Eth?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9uedzr",
                            "author": "Maswasnos",
                            "score": 1,
                            "created_utc": 1653420585.0,
                            "response": "Kraken is OK but they don't support withdrawals via any rollups yet. FTX, Binance, and Crypto.com support Arbitrum and I think Binance supports Optimism now.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}