{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "szlauq",
            "title": "The [REDACTED] ETHDenver 2022 Report",
            "url": "https://www.reddit.com/r/ethereum/comments/szlauq/the_redacted_ethdenver_2022_report/",
            "author": "TheJammiestDodger",
            "created_utc": 1645633225.0,
            "score": 107,
            "num_comments": 86,
            "subreddit": "ethereum",
            "selftext": "The outlet for whom this article was intended got cold feet about running it, so here's my report on ETHDenver 2022...\n\n\\_\\_\\_\\_\\_\\_\\_\n\nThe first ETHDenver was in 2018, deep in bear market doldrums. Hopium was lost. There was a whiff of vapor in the ware. Rumor has it that ETHDenver programming that year was just Gitcoin founder Kevin Owocki in a rented bufficorn costume offering bounties for free hugs to an empty auditorium. Even in those salad days of free-wheeling pre-COVID physical contact, few people accepted. Oh, how things have changed.\n\nAfter surviving an existentially challenging bear market and a near apocalyptic pandemic only to emerge stronger than ever, the mood amongst ETHNerds at ETHDenver 2022 was buoyant, only a gentle caress short of euphoric. Over 20,000 applicants for an event that could comfortably have accommodated a tenth of that meant this year was always going to be an unprecedented clusterfuck. That sense of euphoria lasted only until attendees encountered the line to get in. ETHDenver’s (ostensibly noble) COVID test upon entry policy meant a three hour wait to get in as the line snaked down the block, across the street, and almost into adjacent time zones — all caked in a post-snowstorm slurry. And wait they did, in droves, and for days on end.  \n\nThat kind of excitement can only mean one thing. Lines for a COVID test. Lines for the elevator. Lines to get into talks. Lines for the bathroom. Lines *in* the bathroom. Crypto has two modes: Apocalypse and utopia. ETHDenver was firmly the latter. Self-flagellation is out. Self-congratulation is in. That’s because Web3 and DeFi and NFTs and DAOs have all achieved mainstream buzzword status, and none of those exists without Ethereum. You can tip people with ETH on Twitter. Fucky Zucky thought hijacking the metaverse could save his sinking ship. He must be sniffing metamine. Shit, Even Melania Trump bought her own NFT. And if Trump Org is grifting in your backyard, there’s gold in them hills. It’s a whole different kind of gold rush out here in Denver. \n\nThe thing is that Ethereum tech actually works now. Well, sorta. It may cost $73 and take a few hours, but if you want to spend $23 million on a jpeg of a monkey – that utopian reality is yours for the making. Do you want to loan a derivative of a derivative of a derivative of a dog-themed meme coin? Sure! Just please don’t call it a derivative or the SEC will sue everyone. APY? In this economy?! Fuck that. What’s your yield by the *nanosecond*? Imagine your favorite, most esoteric MMORPG, but with the graphics of a 16-bit Animal Crossing. Sounds not bad, right? Now imagine it with a JPMorgan Lounge. That’s Metaverse, baby!   \n\nAt any crypto event, you’re gonna hear a heap of new lingo: Ponzinomics, POAP, danksharding, pussyverse, proto-shard data-blobs. Did you know that play-to-earn can solve poverty? That must have something to do with the Doge-wrapped McLaren parked in front of the Art Hotel. It was gone by day 3, so here’s hoping that someone vandalized it. \n\nIt’s 4pm on a weekday in the Castle, in a cavernous side room shrouded in fog and laden with the rolling thud of house music. Countless exhausted future Bufficorns lay supine in beanbag chairs, staring at the canopy of lasers above them weaving cerulean and lavender spears. Excited groups of kids share shots of liquor. A one man dance party shuffles alone in the center of the room until a gaggle of girls bound into the space and join him. Is this a tech conference or a music festival? \n\nThis could be the year that ETHDenver became SXSW for Crypto. It looks like the NFT gold rush has blown the space wide open culturally. The cool kids have arrived, and en masse. You can spot them because they share the same fashion aesthetic as a bored ape: animal prints, goofy sunglasses, glittering sequins, thousand yard stare. It’s too much for some, mostly the jaded blockchain marketing vets standing confused on the outskirts of all things, wondering how they haven’t downloaded Metamask mobile yet despite working in crypto for a half decade. They’ve spent a good portion of their careers slaving for ‘blockchain adoption,’ and now that it’s staring them in the face, they have no idea how to react other than slugging liquor for brunch, dazed,  mumbling to themselves about ConsenSys equity. \n\nTheir energy is in stark contrast to the chillionaires, the very rich, very relaxed individuals with very few complaints about life. They’re the guys who bought hundreds of thousands of ETH at a fraction of a dollar. You can spot them because they’re wearing multiple rolexes on each arm, board shorts and flip flops, even in frigid-ass Denver. Nobody spots them faster than the bizdev shills, though, who are like guppies into the maw of these mega-whales. Here’s how you survive a hard sell from one of those desperate pitchmen who treat you like a microphone: smile and nod, smile and nod. Do not answer any of their rhetorical questions, because they’re all just hooks for another shill. Smile and nod. That’s how a thousandaire becomes a chillionaire.\n\nWhile incredibly well socialized Ethereum developer Danny Ryan is on stage discussing semantic mismatches in the transition to Proof of Stake, the din from the reaches of the castle is deafening. Grizzled developers in newly spangled swag sweatshirts yuk it up with NFT obsessives in bedazzled leopard print, comparing shillhaul – which this year included free weed, USB lighters, and translucent metal sporks. Tiesto is in the building. The governor of Colorado just showed up. Vitalik’s mum is holding court. Someone dressed as Boba Fett saunters through the crowd. \n\n“The merge is really, actually very close,” Ryan exhorts over the noise. That gets everyone’s attention. Ethereum Maxis talk about the merge like Heaven’s Gate members talked about the comet. It’s the second coming of Jesus and Jobs and Jehovah alike. On the day the *don’t-call-it-ETH2.0* shards enliven, Vitalik will ride into the floor of the NYSE on a pale unicorn atop a rainbow that rains coins to save us all from our current reality: the one in which we’re already in a bear market and nobody except for VC Cunts and chillionaires have the wherewithal to admit it yet. \n\nSpeaking of: Look to your left. Now look to your right. chances are that one of you is a VC cunt. The ‘VC’ stands for ‘very cunty.’ A message to your ilk from the rest of us: Take your billions of dollars, your fuckin’ social skills, your well-adjusted attachment styles, your consistent sleep habits, your workout routines, your pearly white teeth — and go copy/paste someone else’s Ponzi scheme! \n\nIn the spirit of self-congratulation, ETH devs are here to PARTY. That means drinking enough alcohol to maintain eye contact! Woo! A fresh-faced, motor-mouthed young Web3 acolyte who works for a VC —  although he promises it’s not a cunty VC — has a salient piece of advice for anyone, but especially those in crypto: Never meet your idols. He encountered one of his at an ETHDenver afterparty, a guy ‘worth a quarter of a billion at least,’ languishing in a catatonic state, mumbling about ‘the best acid in Denver.’ Apparently, that did not fit his idea of a post-millennial tech baron. He’s learned better now. \n\nAn interlude: What does a stablecoin have in common with a dominatrix? It’s all fun and games until you’re in too deep and they lose their peg. If it’s UST, you’re moving back into mom’s basement. If it’s your local Mistress, you’re going to the hospital. You’re fucked either way. \n\nSpeaking of fucked: DAOs may be both the ‘new venture capital’ and the ‘next sovereign nations,’ but you may not get that vibe from the myriad DAOs that have proliferated in recent times — BluntDAO, PartyDAO, SporkDAO, SlutDAO, for example. DAOs may change the world yet, but not until they roll a blunt, have a boogie, get the munchies, and visit a sex worker — so just like most politicians, then. \n\nWhile an opera singer takes to the stage on the upper BUIDL floors for an impromptu performance, surprise guest Andrew Yang appears on the main stage. The room is packed and the audience listens on rapt. The wider crypto industry has been waiting on tenterhooks on the promise of a damaging Executive Order from President Joe Biden, and Yang has the inside scoop. He’s bullish on the EO, saying it won’t be as bad as many fear, but bearish on the long-term prospects of governmental meddling in the space. He says it’s a call to arms moment for the industry, and that we should all take it upon ourselves to fight back. He suggests gamifying lobbying, which actually sounds like a pretty good idea. \n\nAll of this isn’t to distract from the main point here: a conference with all the Etherati in one place is totally against the ethos of decentralization. Single point of failure! That’s blockchain 101. What happens if one disgruntled Solana dev sneaks into the Castle with a bomb strapped to his back? They are capable of this. Those guys blow up their own chain on a monthly basis.\n\nThe real stuff at ETHDenver is on the upper floors of the Castle, where the devs have been at work hackathoning away since before the hordes arrived, and where they remained when the hordes left. Developers are more mythical beast than the bufficorn could ever be, and here’s where you find those rare creatures in their habitat, buried deep behind the hype machines and money printers. Rows and rows of people, heads down, headphones on. This is the actual source of the substance of the event, the whole industry even. Shit, maybe even the whole world. Every so often, they take breaks to eat stale pizza and play DDR and Mario kart in the arcade, drum and bass blasting all the while. It’s on these floors that  you’ll find anything resembling solace in the chaos. \n\nETHDenver is a place where the developers who build the stuff, the shills who sell it, the storytellers who narrate it, and now the consumers who actually use it are all there under one roof. Yeah, it’s disorganized, but this is the kind of chaos from whence *stuff* happens. When things get organized, they get lame. ETHDenver is the Birthplace of BUIDL, and it retains that accolade. Sure, 20,000 applicants and only about 150 hackathon projects offers a ratio of about 1 in 20 builders to shillers, but that’s pretty fucking good for crypto. Your average Bitcoin conference is just a mass congregation of undersexed sociopaths yelling past each other about Wikipedia-level macroeconomics. In comparison, ETHDenver is a wellspring of substance and positive energy. \n\nUnfortunately the price of ETH did not mirror the buoyancy of the energy of ETHDenver, dropping over 15% over the course of the week. But nobody talked about markets or asset prices, even as they dropped precipitously and consistently all weekend. There’s something beautiful about that. ETHDenver envisions itself as a builder of culture for Ethereum, decentralization, and the creation of value in communities, and it does come good on that promise. \n\nThere’s two surefire ways to know when a party is over. The first is when you receive a COVID exposure notification from the exclusive afterparty the night prior. The second is when fuckin’ Diplo shows up. Both happened on Sunday night. The Denver airport was apparently like an Ethereum transaction mempool on Sunday night, so most of you are using the same criteria for figuring out when it’s time to GTFO. ",
            "stickied": false,
            "comments": [
                {
                    "id": "hy4bd2b",
                    "author": "bigchief5665",
                    "score": 11,
                    "created_utc": 1645635239.0,
                    "response": "Good read, you’re a bit aggressive but I’m into it. I also ate my first jammy dodger today, it was pretty good but nothing to rave about.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hy8meo5",
                            "author": "AmunTokens",
                            "score": 1,
                            "created_utc": 1645709972.0,
                            "response": "I understand why this will never get published. Really too raw but interesting.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hy5fpwp",
                    "author": "analbeads4u2",
                    "score": 8,
                    "created_utc": 1645650535.0,
                    "response": "ser you need some mdma and a nap",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hy6p07a",
                            "author": "TheJammiestDodger",
                            "score": 4,
                            "created_utc": 1645669462.0,
                            "response": "In that order? I don’t think that’s how drugs work.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hy5jhym",
                    "author": "Redivivusllama",
                    "score": 6,
                    "created_utc": 1645651928.0,
                    "response": "This was incredible",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy4lyeq",
                    "author": "thematthews",
                    "score": 3,
                    "created_utc": 1645639293.0,
                    "response": "I am still playing the safety game and was hoping ‘22 would be my first ETHDenver. However, after reading this, I am thankful to be on track for ‘23 and absolutely love this post and research report thoroughly.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy5ny0p",
                    "author": "oldskool47",
                    "score": 3,
                    "created_utc": 1645653562.0,
                    "response": "Found this super entertaining. Thanks",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy5uuwa",
                    "author": "terminal_laziness",
                    "score": 3,
                    "created_utc": 1645656269.0,
                    "response": "Haha, great read",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy79aaw",
                    "author": "wookmaster69",
                    "score": 3,
                    "created_utc": 1645678980.0,
                    "response": "You write like hunter Thompson",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy4sbu8",
                    "author": "swap_catz",
                    "score": 2,
                    "created_utc": 1645641762.0,
                    "response": "I got my BuffiCron too. Great times.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy5nbyy",
                    "author": "Afraid-Historian-937",
                    "score": 2,
                    "created_utc": 1645653336.0,
                    "response": "How about that Tie Dye Ninja party Thursday night. Love the energy from ETH Denver all week long. 24/7. Non stop fun and learning with friends",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy5no6v",
                    "author": "DarkestChaos",
                    "score": 2,
                    "created_utc": 1645653461.0,
                    "response": "I LOVE this post, and would love to major a video, recording it with voice for people to check out while on the move (who may not have the time to read it).\n\nI hope that's cool! If the other publication wouldn't do it, I'd love to share it on YouTube.. it's insightful, fun, informative, educational, and reminds me so much of other conferences (like Devcon Prague..  oh good times in the laser castle dance party awash with shills) XD\n\n...like a simpler time  😟  lol\n\n-Omar (Crypt0)",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hy6hoqu",
                            "author": "TheJammiestDodger",
                            "score": 2,
                            "created_utc": 1645666223.0,
                            "response": "Go for it, O.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hyamhqd",
                                    "author": "DarkestChaos",
                                    "score": 1,
                                    "created_utc": 1645737766.0,
                                    "response": "Thanks, Mr. Dodger- was waiting for your blessing! Hope all is well.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hy7hgqj",
                    "author": "pryce06",
                    "score": 2,
                    "created_utc": 1645683366.0,
                    "response": "I won't touch the upvotes but that was excellent. I cackled at the stablecoin dominatrix bit 😂 losing your peg 😭😂😭",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hypvw9d",
                    "author": "fengtality",
                    "score": 2,
                    "created_utc": 1646010415.0,
                    "response": "Thanks for recapping the ETHDenver experience - I was there but stuck with side events bc I was scared by the hordes of people descending on the Art Hotel.\n\nFWIW, this was a ton of energy there focused on just building shit, irrespective of financial gain. While partying might be what attracted the laypeople, that really isn't the ethos of crypto.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy62wgd",
                    "author": "navidshrimpo",
                    "score": 4,
                    "created_utc": 1645659637.0,
                    "response": "Interesting writing style. \n\n\"Cold feet\" maybe... or maybe not.\n\nIt's not so much the content, but perhaps the voice. There's something about your writing style that feels like writing for some kind of campy sexploitation film or something else so as emotionally obtuse. The sensationalism wasn't offensive, but kind of banal. \n\nImagine yourself in the shoes of someone who wasn't there. Build up the visuals more illustratively rather than sensationally. The judgement is ok, but it can take a back seat so we can visualize the reality of the event.\n\nJust feels a bit too stubborn on proving a point that ultimately never comes through clearly.\n\nJust my $.02! I laughed more than once though, so that's good.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hy6hwyl",
                            "author": "TheJammiestDodger",
                            "score": 5,
                            "created_utc": 1645666326.0,
                            "response": "‘Campy sexploitation film’ is probably the most apt  analysis of my editorial vibe",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hy6o1wk",
                                    "author": "ThisOnePrick",
                                    "score": 3,
                                    "created_utc": 1645669036.0,
                                    "response": "Good writeup man.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hy4pu96",
                    "author": "gigabyteIO",
                    "score": 2,
                    "created_utc": 1645640818.0,
                    "response": "How were the Algorand nerds?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hy69ddr",
                            "author": "Automatic-Aerie-8988",
                            "score": 2,
                            "created_utc": 1645662480.0,
                            "response": "I kept calling them paid by the CIA, they didn't like me much heh",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hy6921k",
                    "author": "FrozenPhilosopher",
                    "score": 2,
                    "created_utc": 1645662337.0,
                    "response": "Outside of the solana joke, I don’t think this piece is as good as you think it is",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy8lti5",
                    "author": "dentonnn",
                    "score": 1,
                    "created_utc": 1645709683.0,
                    "response": "First I came for the yield , I stayed for the tech, now I'm knee deep for the prose.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i034kit",
                    "author": "torofukatasu",
                    "score": 1,
                    "created_utc": 1646902932.0,
                    "response": "mhmmmm... not bad",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hy73i6o",
                    "author": "purpledrank7855",
                    "score": 0,
                    "created_utc": 1645676147.0,
                    "response": "I can see why the intended party didn't want to run this. \nIt's rude, judgmental and wanting to stay in the past instead of create and embrace change.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hy74lyn",
                            "author": "TheJammiestDodger",
                            "score": 4,
                            "created_utc": 1645676680.0,
                            "response": "I could not agree with you more deeply.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "q964li",
            "title": "Is it safe to show my ETH wallet address to someone?",
            "url": "https://www.reddit.com/r/ethereum/comments/q964li/is_it_safe_to_show_my_eth_wallet_address_to/",
            "author": "erkale",
            "created_utc": 1634364110.0,
            "score": 80,
            "num_comments": 86,
            "subreddit": "ethereum",
            "selftext": "Rookie here. Is it safe to show my ETH wallet address to someone. Can someone steal my cryptos if they know my address?",
            "stickied": false,
            "comments": [
                {
                    "id": "hgty8zh",
                    "author": "Heyatoms1",
                    "score": 159,
                    "created_utc": 1634364255.0,
                    "response": "Wallet address safe to share to receive funds .. Private keys never leave your side.  👍🏻.. welcome my friend 🙌🏻",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hgtyvhs",
                            "author": "erkale",
                            "score": 25,
                            "created_utc": 1634364739.0,
                            "response": "Thank you for the response. What's the difference between address and private key?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hgu2tkd",
                                    "author": "Perleflamme",
                                    "score": 167,
                                    "created_utc": 1634367911.0,
                                    "response": "Your private key is like the key to your home. Your wallet address is like your home address.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hgv5m73",
                                            "author": "abarthsimpson",
                                            "score": 46,
                                            "created_utc": 1634395601.0,
                                            "response": "Wow that’s the perfect way to explain it.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hgvn1or",
                                                    "author": "TomTheTargaryen",
                                                    "score": 54,
                                                    "created_utc": 1634403484.0,
                                                    "response": "It's almost as if they were named address and key because they resemble a conventional address and key, mind-blowing.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "hgvsua3",
                                                            "author": "abarthsimpson",
                                                            "score": 26,
                                                            "created_utc": 1634405915.0,
                                                            "response": "You putting that way makes me realize how dumb I am. 😂",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "hgw2rp0",
                                                                    "author": "Perleflamme",
                                                                    "score": 7,
                                                                    "created_utc": 1634410202.0,
                                                                    "response": "Don't: it could just as well have been misleading. Just like the base fee, which definitely is misleading, since it actually is a congestion fee. \n\nBase fee makes it look like something that is a fixed cost, whatever the time, which is plain wrong.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                },
                                                                {
                                                                    "id": "hgxj3yt",
                                                                    "author": "TomTheTargaryen",
                                                                    "score": 1,
                                                                    "created_utc": 1634433875.0,
                                                                    "response": "lol, well I get \"thanks captain obvious\" myself more often than I'd like. We all have moments, at least it was good for a few laughs",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "hgwwldn",
                                                            "author": "Good_Extension_9642",
                                                            "score": 1,
                                                            "created_utc": 1634423300.0,
                                                            "response": "🤣",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "hgvph5g",
                                            "author": "thehurtoftruth",
                                            "score": 3,
                                            "created_utc": 1634404515.0,
                                            "response": "Your ether is inside the Ethereum network like a Facebook profile is inside the Facebook network.\nYour address is like the name of your profile. Private keys are the password",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hgw397j",
                                                    "author": "Perleflamme",
                                                    "score": 2,
                                                    "created_utc": 1634410410.0,
                                                    "response": "I agree. We could say your account never is with you, it's within a realm called the Ethereum network. You only have its address to reference it from anywhere in the world. And you have the key to access it from anywhere in the world, as long as you have access to the realm called the Ethereum network. \n\nAnd it is an account of glass, where anyone with a reference and an access to the Ethereum network can see everything that is inside it from the outside.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "hgxh1on",
                                            "author": "EmperorTime187",
                                            "score": 1,
                                            "created_utc": 1634432859.0,
                                            "response": "If I use Coinbase Pro, do I have ownership and access to my keys or do they?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hgy6pyh",
                                                    "author": "Perleflamme",
                                                    "score": 2,
                                                    "created_utc": 1634446322.0,
                                                    "response": "They do. They're just giving you indirect access to their keys.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "hgun4oc",
                                    "author": "Jimbotastic777",
                                    "score": 22,
                                    "created_utc": 1634385174.0,
                                    "response": "Your private keys are your secret words. The words you where told to write down when you made your wallet. Never, ever, ever give those to anyone. Never take a picture of them on your phone or send them to yourself in an email or have on your computer in a document. Write them down and keep them in a very safe place. If you loose those or give those to anyone you loose ALL your crypto.  If anyone ever asks for you to provide or enter your secret words you are about to be robbed of everything if you provide them.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hguuu26",
                                            "author": "PouItrygeist",
                                            "score": 5,
                                            "created_utc": 1634389989.0,
                                            "response": "Like they said never ever ever give it anyone ever... So many new people to the crypto space make this mistake.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hguwqpe",
                                                    "author": "Jimbotastic777",
                                                    "score": 3,
                                                    "created_utc": 1634391063.0,
                                                    "response": "Yes.  Security of wallets and the education of such must be a number one priority for us as a community to educate users with.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "hgv0bxr",
                                            "author": "Soviet_Canukistan",
                                            "score": 3,
                                            "created_utc": 1634392940.0,
                                            "response": "Oh. get a big book from the second hand store. And highlight each word of your key in the book, in order. So that it just looks like a book with some highlighted words, but used all together, they form a megazord.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "hguxh6r",
                                            "author": "cryptolicious501",
                                            "score": 1,
                                            "created_utc": 1634391458.0,
                                            "response": "What if you lost your original private key from 3 years ago?  I mean you can still stake.  Still sell.  Still transfer.  All of this on exchanges.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hguzbdr",
                                                    "author": "ElPescado94",
                                                    "score": 2,
                                                    "created_utc": 1634392400.0,
                                                    "response": "Make a new wallet. Transfer funds.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "hguzium",
                                                            "author": "cryptolicious501",
                                                            "score": 2,
                                                            "created_utc": 1634392509.0,
                                                            "response": "Ok thanks.  What would be a good wallet to use?  Metamask?",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "hgv165g",
                                                                    "author": "ElPescado94",
                                                                    "score": 3,
                                                                    "created_utc": 1634393385.0,
                                                                    "response": "I dont use a wallet for eth since i hold peanuts wich are staked on kraken. For my other Holdings i use the official wallets provided by the foundations (yoroi, algowallet,..)",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "hgv03hg",
                                                    "author": "Boys4Jesus",
                                                    "score": 2,
                                                    "created_utc": 1634392816.0,
                                                    "response": "Its like losing your house key. You're fine as long as you always have your house unlocked, but if you accidentally lock it (log out of your wallet, lose your phone/ledger, etc) then you won't be able to access it again.\n\nOf course you can keep using exchanges, they're like hotels. They're not as safe or nice as your own private wallet, but they'll do the job perfectly fine with some minor compromises.\n\nIts more if you lose your key you should probably just generate a new wallet and move your crypto to that, and stop using the old one in case, same as you should probably get a new key for your front door if you've lost them all.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "hgvahh8",
                                                            "author": "cryptolicious501",
                                                            "score": 0,
                                                            "created_utc": 1634397920.0,
                                                            "response": ">You're fine as long as you always have your house unlocked,\n\nWell my house is locked....  by 2fa.\n\nBut I still have access to my house.  Its like there are TWO ways to enter my house.\n\nAlso I log out of my metamask wallet all the time.  As long as you have your password your ok... and Im not talking about the private key.  Again there are two ways to enter the house.\n\nAlso I would lose out on staking of which Im approaching 25K.  That's 25K I would have lost so far this year if I would have had it on a ledger.  So it's not as secure as keeping it on your wallet?  That's like saying, \"Don't drive; don't leave your house as you could lose your keys...\"\n\nThere's risk in every single thing a person does.  You have to be a big boy and a big girl to manage the risk appropriately.\n\nI would ask you about the lost phone thing and how that would affect a person but everything you said above is pretty far off.  I just punched holes in your statement and cleaned it up, I guess...  It's hard to find good data on this site IM seeing...",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "hgwyp57",
                                            "author": "Elegant_Function_708",
                                            "score": 1,
                                            "created_utc": 1634424262.0,
                                            "response": "I just hate it when I “loose” things.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "hgtzn8e",
                                    "author": "MrQot",
                                    "score": 12,
                                    "created_utc": 1634365342.0,
                                    "response": "private key is what you use to prove you own the address",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hgtzu4r",
                                            "author": "erkale",
                                            "score": 6,
                                            "created_utc": 1634365489.0,
                                            "response": "Ok, it's not the string with 0x beginning?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hgu02ob",
                                                    "author": "WildRacoons",
                                                    "score": 12,
                                                    "created_utc": 1634365675.0,
                                                    "response": "Your wallet should plainly indicate which one is the public “address” and possibly private “key”",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "hgut2g6",
                                                    "author": "mattcee233",
                                                    "score": 9,
                                                    "created_utc": 1634388974.0,
                                                    "response": "0x bit is your address, the key is (for the sake of easy understanding) the 12-24 words which your wallet told you to write down when you set it up (never give these words to anyone)",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "hgur202",
                                                    "author": "terminalSiesta",
                                                    "score": 4,
                                                    "created_utc": 1634387788.0,
                                                    "response": "Usually you have to do more steps and get prompted/warned before a wallet shows you your private key. If you click \"receive\" and it displays the 0x string, that's your public address",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "hgwt7l9",
                                    "author": "Shamatix1",
                                    "score": 1,
                                    "created_utc": 1634421756.0,
                                    "response": "Basically your wallet address is your postal box where people can send you crypto. Your private keys are your keys to your own home, don't ever give those out to anyone, as in anyone. Also once you start asking questions on these subs there is a ton of bots/scammers that will send you PMs about different scams, don't ever respond to any of em.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "hgw3xe9",
                            "author": "ConsistentJacket2294",
                            "score": 1,
                            "created_utc": 1634410696.0,
                            "response": "Wallet address or deposit address .? I need to give my address to recive nfts but im scared if someone use my address... am I mistaken..? Help please",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hgzkn8e",
                    "author": "ConsciousInsects",
                    "score": 17,
                    "created_utc": 1634481006.0,
                    "response": "Your public key is, indeed, public. People can be given a code (public key) that they can only use to deposit money into. You may transmit the coins in your public key address using your private key. That is why you should never give out your private key. If you want to test out a new wallet, [ANATHA](http://anatha.io/), an omniwallet, a new type of web wallet which aims to combine security, usability and multi-currency support.\n\nYes, you may splash your public key about like there's no tomorrow, and no one will be able to steal your ETH... However, your private key should never be shared.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hgu1m2o",
                    "author": "imfluke",
                    "score": 12,
                    "created_utc": 1634366914.0,
                    "response": "Its safe regarding security of your funds. There Is a privacy issue tho, with your address one can see all your transactions and balances.\n\nMost wallets wont let you even see your private key so don't worry about accidentally sharing it.\nYour keys are derived from your seed which should never be shared with no one!!!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hgu76hc",
                    "author": "jdero",
                    "score": 9,
                    "created_utc": 1634371641.0,
                    "response": "It's like showing someone your wallet in real life.\n\n1. They now know where your wallet is (this is a piece of an attack vector)\n2. They can see how much money you have (an ill incentive if holding large funds)\n3. Unlike a normal wallet, they can also see all the addresses you've ever sent and received from. This can have consequences.\n\nJust be careful. It never hurts to create a new address entirely, and fund it from an exchange (ideally a DEX) if you're wanting to make a public address.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hgv0tpf",
                            "author": "Boys4Jesus",
                            "score": 7,
                            "created_utc": 1634393201.0,
                            "response": "Exactly this.\n\nPeople mention that it's completely safe, which is true, but showing someone the contents of your wallet or bank account is also completely safe. Yet I would only do that with people I trust, not any random that wants it.\n\nThis is also the biggest reason that most crypto will fail at being actual useable currency. Imagine if you bought a coffee from your local cafe and they could see your entire bank balance and every transaction you'd made, every payslip you earned, everything you've bought, etc. \n\nNot a world I'd like to be a part of.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hgu0fx6",
                    "author": "shrapnel189",
                    "score": 20,
                    "created_utc": 1634365965.0,
                    "response": "Sharing your public address is safe. And in case you’re feeling generous with the ETH:\n\n0x42eA37c24722f1406788A5aFE73abFE1F69E6204\n\nEdit: it’s a joke for reassurance that it’s safe",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hgu0rq5",
                            "author": "erkale",
                            "score": 15,
                            "created_utc": 1634366221.0,
                            "response": "Hahahaaa, i'm feeling generous but not ETH-generous lol. I can give you my thanks! That cleared thinks up, because i accidentally showed similar address to one guy, but apparently it's not a big deal.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hgvzt1t",
                                    "author": "haughty_thoughts",
                                    "score": 3,
                                    "created_utc": 1634408954.0,
                                    "response": "Keep in mind they can see what you own.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hgtyps3",
                    "author": "rocky61915",
                    "score": 3,
                    "created_utc": 1634364614.0,
                    "response": "Yes as long as it's the address and not the private key. Best way to think of it is like an email address. You wouldn't want to put it out in the public as you'd get spammed. Similarly, putting your eth address out there may attract hackers as people can see how much eth your address has. It's best to give it to trusted people/exchanges only for receiving crypto. If you do ever want to put your address out in public, such as forums and Reddit. Generate a new address/new eth Wallet with little to no funds in.\n\nThe private key is like your password and you should never give this to anyone.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hgtyxc0",
                            "author": "erkale",
                            "score": 1,
                            "created_utc": 1634364781.0,
                            "response": "Thank you. That's interesting.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hgu7f7r",
                    "author": "UranusisGolden",
                    "score": 3,
                    "created_utc": 1634371863.0,
                    "response": "Don't give any information to anyone. If you must use a wallet for transactions keep a hot and a cold wallet. Move the funds you intent to transfer from cold wallet to hot wallet and send away. Likewise give your hot wallet address only when you intend to receive funds and transfer from hot to cold.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hgysjtm",
                            "author": "dontatmedog",
                            "score": 2,
                            "created_utc": 1634462923.0,
                            "response": "But can't people see that you transferred to the \"cold\" account? Especially if thats where most of the money is going",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hgu8ydt",
                    "author": "JamesSpaulding",
                    "score": 2,
                    "created_utc": 1634373225.0,
                    "response": "Lol",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hgu5p2m",
                    "author": "nomennescio12345",
                    "score": 1,
                    "created_utc": 1634370353.0,
                    "response": "Show your public keys, keep your private key private.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hgu8w5s",
                    "author": "Plenty_Occasion_5491",
                    "score": 1,
                    "created_utc": 1634373170.0,
                    "response": "Be careful!!!!!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hguakoe",
                    "author": "Dieselx22",
                    "score": 1,
                    "created_utc": 1634374687.0,
                    "response": "Everyone told you it is safe and it is, but if you do not want someone to know how much you have you can easily generate a new address that has no funds in it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hgufk0l",
                    "author": "martintierney101",
                    "score": 1,
                    "created_utc": 1634379128.0,
                    "response": "They can’t steal your funds just by knowing your address but if you share your address, everyone will know that it’s your address and can monitor transactions on it so definitely don’t share it publicly.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hgulq9t",
                    "author": "AwfulViewpoint",
                    "score": 1,
                    "created_utc": 1634384170.0,
                    "response": "If we're arrogant we will say it's safe, but sharing your wallet address can be quite risky, especially if you tie it to a person.\n\nIf you make it public, it can be an incentive for crooks to map your movements and balance, gather information about you and try to build a strategy in order to compromise your wallet (targeted spam, tailored messages, phishing designed for you, etc). If it's just a random address, who cares, but if you tie that to a person, that means possibilities and money to be earned.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hgup5wa",
                    "author": "Espa-Proper",
                    "score": 1,
                    "created_utc": 1634386585.0,
                    "response": "Yes, but very important note.\n\nThere have been ingenious new scamming techniques involving tokens (erc20 or NFTs) where they are sent to you wallet. And offers are made on them so that you could interact with them - this will lead to your wallet being compromised.\n\nDo not interact with anything you did not purchase on your wallet, never!\n\nIs a brave new world- and how deep you go in the water. But the deeper you go there might be some hazard. Tread carefully! 👍",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hguq0hr",
                    "author": "Enschede2",
                    "score": 1,
                    "created_utc": 1634387132.0,
                    "response": "No they cannot, they'd need the seed for that, that being said wether it's safe to show how much funds you have (which is public if they have the wallet address) depends on the person you're showing it to..       \n        \nShowing it to your brother? Sure probably.. Showing it to your local crackhead? Probably not a good idea",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hguuy22",
                    "author": "ResistPatient",
                    "score": 1,
                    "created_utc": 1634390053.0,
                    "response": "It is not the best idea in the world to share it publicly, as there has been an NFT hack going around where your funds can be drained.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hguvnrw",
                    "author": "samuraipizzacat420",
                    "score": 1,
                    "created_utc": 1634390462.0,
                    "response": "you set yourself up as a target for a scam attack, but for the most part no you should be fine. just dont be posting it everywhere in telegrams and discords",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hgv33mp",
                    "author": "Shillofnoone",
                    "score": 1,
                    "created_utc": 1634394371.0,
                    "response": "No, people only think about cyber stealing but forget about physical stealing.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hgvfaub",
                    "author": "KaiSosceles",
                    "score": 1,
                    "created_utc": 1634400064.0,
                    "response": "They can’t steal it, but they can see all of the funds in your wallet and they can see every transaction that wallet has ever made.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hgvfkjq",
                    "author": "l1vefrom215",
                    "score": 1,
                    "created_utc": 1634400178.0,
                    "response": "It is safe to show your public address from a security standpoint. . . But doesn’t mean you should. You wouldn’t show your bank account to someone. Only bad things can come fromnit",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hgw0up1",
                    "author": "viralthis",
                    "score": 1,
                    "created_utc": 1634409390.0,
                    "response": "Public address like : email (You can share)\nPrivate key like : password (never ever to be shared)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hgw8xui",
                    "author": "Advanced-Guard-4468",
                    "score": 1,
                    "created_utc": 1634412830.0,
                    "response": "Only if you want it all taken, then by all means show people",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hgwbv8x",
                    "author": "LondonPedro",
                    "score": 1,
                    "created_utc": 1634414093.0,
                    "response": "Better to not show address though, unless a requirement. For one thing it can dox your balance. Bitcoin allows unlimited address variations which is a security advantage.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hgx8mja",
                    "author": "CarpenterBruuxx",
                    "score": 1,
                    "created_utc": 1634428896.0,
                    "response": "Address ok, public keys ok. Private keys are more private than your private parts.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hgxk3vc",
                    "author": "disloyalturtle",
                    "score": 1,
                    "created_utc": 1634434360.0,
                    "response": "you can if your okay with letting people know that you own that specific wallet. the issue with open non private blockchains is that once you can associate a name to a wallet all sense privacy goes right out the window.\n\nimagine going to a store to buy something  or paying your landlord rent and the second you did they were able to see how much you had in your bank.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hgxldun",
                    "author": "mooremo",
                    "score": 1,
                    "created_utc": 1634434974.0,
                    "response": "I have an old comment that explains a little bit about wallets, addresses, and security. It might answer some of your questions: [https://www.reddit.com/r/ethereum/comments/mr58aa/comment/gukgsd4/?utm\\_source=share&utm\\_medium=web2x&context=3](https://www.reddit.com/r/ethereum/comments/mr58aa/comment/gukgsd4/?utm_source=share&utm_medium=web2x&context=3)  \n\n\nShort answer to your question is no, they can not steal from you just by knowing your address. \n\nThe analogy to real world addresses and keys works very well actually. \n\nJust because someone can't steal from you by knowing your address doesn't mean that you should give it out to literally everyone. You might not want some people knowing where you live or how much your house is worth. So don't walk around with it printed on your T-shirt.\n\nThere are a lot of legitimate reasons to give out your address tho and plenty of people that you would share it with for those reasons.\n\nFinally, you should LITERALLY NEVER give anyone your seed phrase/key because doing so is the same giving them all of your money and trusting them not to take it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hgxqdje",
                    "author": "ImpeccableArchitect",
                    "score": 1,
                    "created_utc": 1634437467.0,
                    "response": "Public / private key encryption. Its been explained a few times, an analogy i like to use is a transparent letterbox with a lock. The public key allows anybody to deposit, see the balance, and all transactions.  The private key is a hash generated fron your seed words, these should be stored safely with a backup, and are never used unless you lose your wallet and need to reactivate it. A common scam is to direct you to a fake website and claim you need to put in seed words to reactivate your account... your wallet holds your private key and allows you to move the stuff in your letterbox, and will have a pin or password to open. Your stuff isnt in the wallet, its on the blockchain, your wallet just holds your keys. Again: you will only ever need your seed words if you lose your wallet in a boating accident and need to recreate it. Some thought should be given to how you backup seed words, they are the most important part of the whole thing.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hgxuw74",
                    "author": "cryptolamboman",
                    "score": 1,
                    "created_utc": 1634439760.0,
                    "response": "wallet address is safe, any other more information may help to compromise your wallet",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hgty909",
                    "author": "jetro30087",
                    "score": 0,
                    "created_utc": 1634364256.0,
                    "response": "Only if it's safe for them to know what your balance is. No, they can't take your funds with just your public address.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}