{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uv7dtw",
            "title": "Can someone know who I am/what I do from having my coinbase ETH address?",
            "url": "/r/CryptoCurrency/comments/uv7blp/can_someone_know_who_i_amwhat_i_do_from_having_my/",
            "author": "ThunderTM",
            "created_utc": 1653211382.0,
            "score": 4,
            "num_comments": 4,
            "subreddit": "ethereum",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9jsyd0",
                    "author": "Sorry_Attitude_",
                    "score": 3,
                    "created_utc": 1653216337.0,
                    "response": "Yes, the CEX knows everything you do because that's how it works.\n\nAnd the authorities know it also because the CEX transmits them further\n\nAnd on a private wallet, they can find you out but probably will have a hard time figuring out who you really are",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9k0da2",
                            "author": "ThunderTM",
                            "score": 1,
                            "created_utc": 1653221912.0,
                            "response": "I mean when for example I give you one of my BTC addresses on coinbase. How much can you find out about me.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9kepu7",
                                    "author": "211216819",
                                    "score": 1,
                                    "created_utc": 1653229707.0,
                                    "response": "Not much other than the amounts you move with that address. You can create multiple addresses on Coinbase to have a little bit of privacy though.\n\n(CEX and authorities know as Sorry\\_Attitude\\_ said)",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9kgewx",
                    "author": "goodbonobo",
                    "score": 2,
                    "created_utc": 1653230493.0,
                    "response": "Only Coinbase knows who you are by your address (of course).  Coinbase actually generates a new ETH address for you on each transaction (and you can request more).  You can reuse any of your old addresses (they are all yours forever).  The other advantage is nobody can use your addresses to see your balance.  \n\nHowever as they say “Not your keys not your crypto” so technically Coinbase has your money. If you moved to your wallet it’s harder to hide IMHO (not anonymity) but assets because someone can just look at your address and see how much you have and try to track what you do even though they might not know who you are.  \n\nPros and cons for each (exchange/custodial wallet vs non-custodial wallet) with regard to privacy.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}