{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "v0b7oq",
            "title": "Community Ideas for Mozilla: Sell an \"offline identity bridge to the crypto world\" by accepting donations",
            "url": "https://connect.mozilla.org/t5/ideas/sell-an-quot-offline-identity-bridge-to-the-crypto-world-quot-by/idi-p/6648",
            "author": "em_te",
            "created_utc": 1653830954.0,
            "score": 9,
            "num_comments": 8,
            "subreddit": "ethereum",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "iagqbrj",
                    "author": "Ok-Nefariousness1340",
                    "score": 3,
                    "created_utc": 1653854774.0,
                    "response": ">linking blockchain transactions to a user's real identity ... for law enforcement.\n\nA way to donate money purely to open yourself up to being sued and government harassment, don't think this is such a great idea. Actual organized criminal scammers could get around this pretty easily, all they need is to first scam someone into making a donation using their crypto address, while the well intentioned get locked out of the ecosystem or pushed around by a corrupt legal system.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iai36ys",
                            "author": "em_te",
                            "score": 1,
                            "created_utc": 1653879729.0,
                            "response": ">Actual organized criminal scammers could get around this pretty easily, all they need is to first scam someone into making a donation using their crypto address\n\nIs such a scam easy to pull off? You have to convince someone to make a donation to Mozilla while pasting in a long string of what seems to be random characters into their bank's website. I would imagine anyone would be immediately suspicious of this.\n\nThought identity theft is already a crime in and of itself regardless of channel was used to conduct it.\n\nA better way would be to pay someone in a third world country $50 (in cash to be untraceable) in exchange for them authenticating a crypto address for them. Or maybe paying a local hobo $50 in cash to open a bank account and then using the account to generate these addresses en-mass.\n\nAlthough if a scammer has already stolen one's identity, it's already the holy grail and there's already nothing much you can do about it.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iai5y9x",
                                    "author": "Ok-Nefariousness1340",
                                    "score": 2,
                                    "created_utc": 1653881099.0,
                                    "response": ">Thought identity theft is already a crime in and of itself regardless of channel was used to conduct it.\n\nThe idea is that if someone is already a criminal, they will be focusing their efforts on not getting caught, rather than not breaking more laws (whereas law abiding people are restricted by this in a real way). An anon scamdev intending to rug, who is already investing a fair bit in setting everything up and can reasonably expect hundreds of thousands to millions of dollars in illicit profits, will be able to figure out a way to get a Mozilla donation NFT.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iai81e5",
                    "author": "memotothenemo",
                    "score": 1,
                    "created_utc": 1653882197.0,
                    "response": "There is a handle full of zero knowledge proof kyc projects that I've seen floating around. I haven't followed up on researching any of them in the past 6 months but for those interested in this idea, I'd suggest doing a Google drive into such",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}