{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "utc4ww",
            "title": "Coinbase Unveils New DApp Wallet and Browser for Ethereum Network",
            "url": "https://timestabloid.com/coinbase-unveils-new-dapp-wallet-and-browser-for-ethereum-network/",
            "author": "Solodeji",
            "created_utc": 1652991234.0,
            "score": 226,
            "num_comments": 91,
            "subreddit": "ethereum",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i99yvia",
                    "author": "Ok-Nefariousness1340",
                    "score": 14,
                    "created_utc": 1653011436.0,
                    "response": ">“With today’s launch, users can explore DApps without having to manage a recovery phrase.\n\n>This innovative DApp wallet experience is powered by Multi-Party Computation (MPC) technology that enables you to have a dedicated on-chain wallet that Coinbase helps you keep secured.\n\n>This is due to the way this wallet is set up, which allows the ‘key’ to be split between you and Coinbase.\n\n>Ultimately, this means if you lose access to your device, the key to your DApp wallet is still safe and Coinbase can assist in recovery through our live support.”\n\nDoes anyone know more about this? This means that they have custody of your private keys right? I don't see any other way it would be possible to restore the wallet of someone who lost all their info.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9a4gr9",
                            "author": "jathanism",
                            "score": 8,
                            "created_utc": 1653014203.0,
                            "response": "That is exactly what that means. Sounds like they will be leveraging a form of a multi-sig wallet.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9aqvo0",
                            "author": "Nonocoiner",
                            "score": 6,
                            "created_utc": 1653028280.0,
                            "response": "I **suspect** it works with guardians, like Argent wallet does.\n\nIn that case Coinbase does \nnot control your funds, but they can be one of your guardians to help you if you lost your key file.\n\nYou'll need at the least two guardians to recover. So if you lose your key, and access your other guardians, Coinbase wouldn't be able to help you either.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9aejsv",
                            "author": "PoPoChao",
                            "score": 1,
                            "created_utc": 1653019714.0,
                            "response": "On this topic. Doesnt ledger or Trezor give this same functionality?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9c0txm",
                                    "author": "Hang10Dude",
                                    "score": 2,
                                    "created_utc": 1653057191.0,
                                    "response": "To some extent yes. But the truth is that decentralization isn't for normies. They don't care about it and frankly they would just end up losing their money. In 99% of practical real world use cases, a degree of centralization is a good thing.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9anety",
                    "author": "shyscope1234",
                    "score": 10,
                    "created_utc": 1653025644.0,
                    "response": "What’s with so many people obsessed with coinbase hate? They’re just a normal company like all the others to me",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9awigp",
                            "author": "mcgravier",
                            "score": 2,
                            "created_utc": 1653033036.0,
                            "response": "Their stock falling 80% from the debut resulted in a lot of salt. But to be honest, theyre one of more expensive platforms to trade and they refuse the business with you if you use coin mixers",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9bjwnh",
                                    "author": "htmLMAO",
                                    "score": 0,
                                    "created_utc": 1653049669.0,
                                    "response": "Absolutely not why the stock fell 80%",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9b3s5j",
                            "author": "towjamb",
                            "score": 1,
                            "created_utc": 1653039264.0,
                            "response": "Crypto has extremists, too, and they seem to be the loudest talkers.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9e0sxs",
                            "author": "Schwickity",
                            "score": 1,
                            "created_utc": 1653088704.0,
                            "response": "Had a terrible experience with their customer support for an issue that went on for months. I finally had to make a post about it on Reddit, and the money was magically restored to my account the same day! A miracle.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i99octi",
                    "author": "tangywangyrealtor",
                    "score": 25,
                    "created_utc": 1653006244.0,
                    "response": "Doesn't sound like YOUR wallet, sounds like it belongs to coinbase.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i99rijc",
                            "author": "Remarkable_News2455",
                            "score": 3,
                            "created_utc": 1653007840.0,
                            "response": "The mainnet has not changed, the gas is still the same and very expensive",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i99yzid",
                                    "author": "KINGGS",
                                    "score": 6,
                                    "created_utc": 1653011491.0,
                                    "response": "Expensive for what? My transfers lately have been like a dollar lol",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9aa0h9",
                                            "author": "Fig_da_Great",
                                            "score": 3,
                                            "created_utc": 1653017107.0,
                                            "response": "Interacting with contracts are far more expensive then just a transfer",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9aa5cw",
                                                    "author": "KINGGS",
                                                    "score": 1,
                                                    "created_utc": 1653017181.0,
                                                    "response": "As they should be, and even those interactions are far less expensive than they were a few months ago. Like $30 down from $150+",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9a810u",
                            "author": "cosmic-comedy",
                            "score": 1,
                            "created_utc": 1653016027.0,
                            "response": "Coinbase Wallet uses MPC now, soooo...",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9ar8hz",
                            "author": "Nonocoiner",
                            "score": 0,
                            "created_utc": 1653028560.0,
                            "response": "It actually sounds like they will utilize so called \"guardians\", like Argent wallet does.\n\nSo Coinbase would be one of your two (or more) guardians to help you out if you lost your key.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i99kihy",
                    "author": "Schwickity",
                    "score": 47,
                    "created_utc": 1653004278.0,
                    "response": "Wallet.GameStop.com will be better. Nft.GameStop.com will 💩 on Coinbase’s NFT Marketplace",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9a2nzg",
                            "author": "dopamine_dream_",
                            "score": 13,
                            "created_utc": 1653013308.0,
                            "response": "Ya man, the company with double the market cap and a massive cornering of the crypto market will be absolutely destroyed by the used game retailer! Cope harder.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9acqyo",
                                    "author": "csmrh",
                                    "score": 24,
                                    "created_utc": 1653018640.0,
                                    "response": "Isn’t Coinbase’s market cap down about 81% since November?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9alii5",
                                            "author": "DemonFaceHUN",
                                            "score": 12,
                                            "created_utc": 1653024266.0,
                                            "response": "It has still the double of market cap as GameStop",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9b4dyn",
                                                    "author": "moonpumper",
                                                    "score": -1,
                                                    "created_utc": 1653039733.0,
                                                    "response": "Market cap isn't a good indicator for determining how good a product/service that hasn't even been released will be. Especially with the GS Blockchain stuff being spearheaded by a completely different chairman and c suite that barely has a year at the company under their belt.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9bckab",
                                                            "author": "grays55",
                                                            "score": 5,
                                                            "created_utc": 1653045668.0,
                                                            "response": "Ok fine, look at track record. Coinbase is a leading platform in an emerging new technology who is constantly innovating and releasing new features. Gamestop was on life support for a literal decade due to absolutely zero innovation until they got memed out of the grave as a joke. Which one do you honestly think is more likely to get it right.\n\nEDIT: I get it. Ya’ll own GME. Dont burn calories typing silly responses",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9d1f27",
                                                                    "author": "moonpumper",
                                                                    "score": 1,
                                                                    "created_utc": 1653072183.0,
                                                                    "response": "I laid out the thesis with factual information and your refutation is \"Don't burn calories typing silly responses,\" in an edit and not a response no less.  At least make a convincing counterargument before telling someone their response is silly. \n\nGS head of Blockchain is a founding member of Loopring and since when has anyone in the crypto space thought Coinbase was a great exchange doing top notch work?",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9djmzl",
                                                                            "author": "grays55",
                                                                            "score": 1,
                                                                            "created_utc": 1653080492.0,
                                                                            "response": "I didnt respond because your “thesis” wasnt compelling. Hiring lots of talent doesnt mean anything, ask Meta how thats working out for them right now. There are no fundamentals there, they have no tangible ways of making money to support their valuations, and the market has transitioned to fundamentals this year more than any time in the last 20 years. There’s a reason 99.9% of the people who do this professionally aren’t interested in GME, and its not because they hate money.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "id": "i9bnpfz",
                                                                    "author": "moonpumper",
                                                                    "score": -2,
                                                                    "created_utc": 1653051528.0,
                                                                    "response": "Track record means dick, the people running the company are completely new, they're not the same people who ran it the last 10 years. They've been pulling talent from Facebook, Google, Amazon. Literally hundreds of new hires. They paid down almost all of their outstanding debt. It's like you're saying a basketball team that just traded up players for a killer line up will never win because because their team name is still the same.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9e0yqg",
                                                                            "author": "Schwickity",
                                                                            "score": 1,
                                                                            "created_utc": 1653088785.0,
                                                                            "response": "They don’t wanna hear it. We’re early, not wrong.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "id": "i9bnm5f",
                                                                    "author": "Schwickity",
                                                                    "score": -2,
                                                                    "created_utc": 1653051484.0,
                                                                    "response": "Meme stock is a misnomer. Highly undervalued and most heavily shorted with a solid turn around plan and new leadership was the original investment thesis in GME. Corporate media controlled by hedgefunds spun the Meme Stock narrative to discredit the legitimacy for the long term bull case for GameStop. Remember you read this here.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i9b6o55",
                                                    "author": "yoyoJ",
                                                    "score": 1,
                                                    "created_utc": 1653041569.0,
                                                    "response": "Double the trouble if you ask me!",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9alj1r",
                                            "author": "dopamine_dream_",
                                            "score": 3,
                                            "created_utc": 1653024277.0,
                                            "response": "Ya it's down about 80% from its ATH, as opposed to GME which is.... about 80% down from its ATH. Which one of these two companies has a better footing and more room for growth in this industry? The 80% price drop has Coinbase sitting at a P/E of 7.1, GME is currently sitting at -18.3.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9aszst",
                                                    "author": "_JohnWisdom",
                                                    "score": 0,
                                                    "created_utc": 1653029984.0,
                                                    "response": "Coinbase stock is strongly connected to the crypto market. You can easily overlay their stock performance to total market cap and see just that.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9b20qr",
                                                            "author": "idiot382",
                                                            "score": 3,
                                                            "created_utc": 1653037897.0,
                                                            "response": "If GameStop enters the market to the degree Coinbase is, their stock price would also be tied to the crypto market.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9b62vq",
                                                                    "author": "_JohnWisdom",
                                                                    "score": 1,
                                                                    "created_utc": 1653041083.0,
                                                                    "response": "If GME pivoted completely to crypto I would agree. NFT marketplace and loopring collaboration won’t tie all it’s stock to crypto market cap, there certainly is already a correlation between loopring price and gme stock, but not the entire crypto market cap. Where coinbase is clearly tied to the crypto market, just as microstrategy is. \n\nWhat I was stating is that gme being down 80% from ATH has little to do with crypto market, and more with “apes strong together”",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9b79lf",
                                                                            "author": "edL222",
                                                                            "score": 2,
                                                                            "created_utc": 1653042046.0,
                                                                            "response": "It’s all about perspective . Look at gme vs Coinbase year over year",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i9b8emg",
                                                                                    "author": "_JohnWisdom",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653042938.0,
                                                                                    "response": "Impossible. Coinbase has been public for 6 months…",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i9b8gc3",
                                                                                            "author": "edL222",
                                                                                            "score": 2,
                                                                                            "created_utc": 1653042973.0,
                                                                                            "response": "Exactly, ones falling from the start , ones growing. Fact is , anyone not in GameStop today is gonna be really sad one day. Roll over your gme gains to crypto later after the tether bomb goes off",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i9bmdsk",
                                                    "author": "csmrh",
                                                    "score": 1,
                                                    "created_utc": 1653050887.0,
                                                    "response": "I wasn’t really commenting on GME. You brought up market cap as a reason to trust Coinbase and their implementation of this new DApp, while it seems like Coinbase stock has been tanking, they’ve been having liquidity issues and stopping withdrawals of certain cryptos recently, they had a filing that basically said they’ll use customers assets to pay their debts in the event of bankruptcy, etc.\n\nThey’ve lost a lot of trust in the past couple months. The public sentiment on crypto subreddits seems to be get your coins out of Coinbase as fast as you can.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9d9drl",
                                                            "author": "dopamine_dream_",
                                                            "score": 1,
                                                            "created_utc": 1653075868.0,
                                                            "response": "I was using market cap and their existing position as a giant in the cryptoverse as examples of why they are better positioned than GME is in this space, not saying they’re some amazing company. Personally I don’t hold my coins on any exchanges, but afaik the whole “use your coins to pay their debts” was a complete misunderstanding of the filing which actually states that they would turn over your coins to any appropriate authorities in the event of YOUR bankruptcy.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i9a4256",
                                    "author": "Leo_Yoshimura",
                                    "score": 6,
                                    "created_utc": 1653014005.0,
                                    "response": "A safe place where fees are negligible or non-existent will win in the longrun.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9aiiag",
                                    "author": "francis_wilson",
                                    "score": 7,
                                    "created_utc": 1653022203.0,
                                    "response": "This is gonna age like milk.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9ajhj4",
                                            "author": "Pies_14",
                                            "score": 5,
                                            "created_utc": 1653022864.0,
                                            "response": "“Used game retailer” I love seeing just how hard people have to try and shit on the company without being aware of anything they’re doing.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9b1eew",
                                                    "author": "dopamine_dream_",
                                                    "score": 0,
                                                    "created_utc": 1653037418.0,
                                                    "response": "Also your cost average is $200 even after averaging down? You literally bought the peak eh? Good luck man.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i9amixn",
                                                    "author": "dopamine_dream_",
                                                    "score": -6,
                                                    "created_utc": 1653024997.0,
                                                    "response": "I'm aware of the Supercult talking points about the amazing transformation the company is making which has amounted to...\n\nI just call it the \"used game retailer\" to trigger baggies, and it's probably the one area where they actually turn a profit given their dogshit turn in rates.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9b5oql",
                                            "author": "Representative-Try50",
                                            "score": 1,
                                            "created_utc": 1653040758.0,
                                            "response": "For real",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9ax34q",
                                    "author": "Crazy95jack",
                                    "score": 2,
                                    "created_utc": 1653033561.0,
                                    "response": "You mean coibase that withheld my account with my money for over 6 months. Their customer service is none existent, just automated replies. Terrible customer experience.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9b6n3m",
                                    "author": "yoyoJ",
                                    "score": 1,
                                    "created_utc": 1653041545.0,
                                    "response": "BrUh now Come onnnn Brah",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9bc0np",
                                    "author": "TekRantGaming",
                                    "score": 1,
                                    "created_utc": 1653045347.0,
                                    "response": "you have no idea ........no idea whats coming or how wrong you are. i dont blame you i was the same until i looked for myself",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9d8vqv",
                                            "author": "dopamine_dream_",
                                            "score": 1,
                                            "created_utc": 1653075647.0,
                                            "response": "Bro come on, this is literally something a cultist would say verbatim lol.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9d96th",
                                                    "author": "TekRantGaming",
                                                    "score": 1,
                                                    "created_utc": 1653075783.0,
                                                    "response": "Cult 😂 nah simply do your own research come to your own opinion keep to yourself and get on with it if you don’t agree that’s fine by me",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i9a2vv8",
                                    "author": "Schwickity",
                                    "score": 0,
                                    "created_utc": 1653013416.0,
                                    "response": "Nobody is going to give a shit about what coinbase will offer. GameStop is going to get all the top IP on there. Gaming nfts will trade there too. Call of Duty and all of those franchise games are going to incorporate nfts, and GameStop marketplace will be the hub.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9dvga5",
                                            "author": "dopamine_dream_",
                                            "score": 1,
                                            "created_utc": 1653086049.0,
                                            "response": "Literally nobody in gaming wants gaming NFTs, ask any gaming community how they feel about NFTs and you'll be booed out the door. Even if gaming NFTs did become a thing, publishers and studios have ZERO reason to cut GME in on the profits associated with trading them. Same goes for the idea that games will become tokenized and tradeable via NFT, why would the publishers and studios ever do this? It does nothing but hurt their bottom line.\n\nA lot of these companies are better positioned than GME is to launch their own NFT trading hubs in the extremely unlikely scenario that they even do catch on.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9amcm6",
                                    "author": "suckercuck",
                                    "score": 0,
                                    "created_utc": 1653024873.0,
                                    "response": "This comment will age like milk in the Tuscan sun ☀️",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9a2ksl",
                            "author": "LayingWaste",
                            "score": -2,
                            "created_utc": 1653013264.0,
                            "response": "No it wont.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9a2nsp",
                                    "author": "Schwickity",
                                    "score": 9,
                                    "created_utc": 1653013305.0,
                                    "response": "!remindme! 8months",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9ajj3r",
                                            "author": "Pies_14",
                                            "score": 2,
                                            "created_utc": 1653022894.0,
                                            "response": "!remindme! Tomorrow",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i9a30wc",
                                            "author": "LayingWaste",
                                            "score": -8,
                                            "created_utc": 1653013485.0,
                                            "response": "Gme squeeze is over bro stop trying to cling to dreams of past.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9a3el2",
                                                    "author": "stayyfr0styy",
                                                    "score": 18,
                                                    "created_utc": 1653013674.0,
                                                    "response": "Imagine watching Melvin Capital shutting down this week and then think the short squeeze is over.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9a46c1",
                                                            "author": "Leo_Yoshimura",
                                                            "score": 11,
                                                            "created_utc": 1653014062.0,
                                                            "response": "People like that watch mainstream media. Just leave them to their opinions and smile silently.",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "i9amiu0",
                                                            "author": "suckercuck",
                                                            "score": 1,
                                                            "created_utc": 1653024995.0,
                                                            "response": "Derpers gonna derp",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i9a3ahd",
                                                    "author": "Schwickity",
                                                    "score": 7,
                                                    "created_utc": 1653013617.0,
                                                    "response": "Nah it was suppressed and is still a ticking time bomb. Thanks though.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9ah0ip",
                                                            "author": "I_Envy_Sisyphus_",
                                                            "score": 3,
                                                            "created_utc": 1653021241.0,
                                                            "response": "!RemindMe Two years",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9a2slc",
                                            "author": "RemindMeBot",
                                            "score": 1,
                                            "created_utc": 1653013371.0,
                                            "response": "I will be messaging you in 8 months on [**2023-01-20 02:21:45 UTC**](http://www.wolframalpha.com/input/?i=2023-01-20%2002:21:45%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/ethereum/comments/utc4ww/coinbase_unveils_new_dapp_wallet_and_browser_for/i9a2nsp/?context=3)\n\n[**1 OTHERS CLICKED THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fethereum%2Fcomments%2Futc4ww%2Fcoinbase_unveils_new_dapp_wallet_and_browser_for%2Fi9a2nsp%2F%5D%0A%0ARemindMe%21%202023-01-20%2002%3A21%3A45%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20utc4ww)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i99ovsy",
                            "author": "lostharbor",
                            "score": -19,
                            "created_utc": 1653006513.0,
                            "response": "Both are terrible.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9a8u4t",
                                    "author": "sevee77",
                                    "score": 1,
                                    "created_utc": 1653016465.0,
                                    "response": "🤡",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9a8zvr",
                                            "author": "lostharbor",
                                            "score": 0,
                                            "created_utc": 1653016553.0,
                                            "response": "Yea, you definitely are. Mature as well.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9ae9ro",
                    "author": "Concealus",
                    "score": 2,
                    "created_utc": 1653019542.0,
                    "response": "Not your keys, not your crypto.\n\nSaying that, I like having this as an option for beginners. Like it or not, onboarding and learning about web3 & defi needs to be easier and more user friendly.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9c115s",
                            "author": "Hang10Dude",
                            "score": 2,
                            "created_utc": 1653057271.0,
                            "response": "Normies aren't ready for decentralization. They don't care about it and frankly it isn't safe for them.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i99ovlu",
                    "author": "Schwickity",
                    "score": 1,
                    "created_utc": 1653006511.0,
                    "response": "Conbase with their Fictional Reserves",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9axill",
                            "author": "Effective_Variation4",
                            "score": 4,
                            "created_utc": 1653033941.0,
                            "response": "Something something no sources",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9balvs",
                                    "author": "Schwickity",
                                    "score": 1,
                                    "created_utc": 1653044456.0,
                                    "response": "I’m playing on Fractional reserves, which is a thing.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i996ndv",
                    "author": "Dry-Hurry-7598",
                    "score": -22,
                    "created_utc": 1652997493.0,
                    "response": "Yh all great and all until Coinbase becomes bankrupt and now owns all your defi tokens too 😂😂😂",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i99a0wl",
                            "author": "yadude11",
                            "score": 14,
                            "created_utc": 1652999062.0,
                            "response": "Please read this thread before spreading misinformation and causing unnecessary panic https://mobile.twitter.com/brian_armstrong/status/1524233480040710144",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9a6mjd",
                                    "author": "vampiire",
                                    "score": -2,
                                    "created_utc": 1653015296.0,
                                    "response": "I’m not entirely convinced. The language here is “funds” [fiat] not “crypto”. Additionally further down the thread he states that “retail” customers do not yet have even these “funds” protections but they are working towards it. \n\nCan you clarify if you feel I have misunderstood?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i99omd1",
                            "author": "Im-a_dinosaur",
                            "score": -4,
                            "created_utc": 1653006380.0,
                            "response": "You're getting downvoted like they didn't say they'd use customer crypto to cover possible bankruptcy",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i99pph5",
                                    "author": "Dry-Hurry-7598",
                                    "score": -1,
                                    "created_utc": 1653006931.0,
                                    "response": "It was a joke 😂😂 but like honestly nothing stoping them from using your crypto",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i98ub6k",
                    "author": "coinfeeds-bot",
                    "score": 1,
                    "created_utc": 1652991343.0,
                    "response": "tldr; Coinbase is launching a new DApp wallet and browser that will enable users to purchase digital collectibles, trade digital assets on decentralized exchanges (DEXs), and participate in decentralized finance (DeFI) space. The wallet will be made available to a few users in the United States at launch.\n\n*This summary is auto generated by a bot and not meant to replace reading the original article. As always, DYOR.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9azfer",
                    "author": "Homewardment",
                    "score": 0,
                    "created_utc": 1653035675.0,
                    "response": "Lmao Coinbase doing everything but unlocking everyone’s ethereum",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "utc942",
            "title": "An Intro to Ethereum",
            "url": "https://www.newbiescrypto.com/p/ethereum",
            "author": "SuDa2104",
            "created_utc": 1652991550.0,
            "score": 2,
            "num_comments": 6,
            "subreddit": "ethereum",
            "selftext": "",
            "stickied": false,
            "comments": []
        }
    ]
}