{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uuc59y",
            "title": "Ethereum 2.0 (The Official Merge of Blockchains) Launch in AUGUST!? \"Stars are aligned\" Says Ethereum Foundation Team Member...",
            "url": "https://www.globalcryptopress.com/2022/05/ethereum-20-official-merge-of.html?=watch?=new",
            "author": "Digitallifeworks",
            "created_utc": 1653094761.0,
            "score": 266,
            "num_comments": 67,
            "subreddit": "ethereum",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9f7el2",
                    "author": "CryptoMonger",
                    "score": 10,
                    "created_utc": 1653113388.0,
                    "response": "The salt is already flowing I see.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9flekj",
                    "author": "PinkPuppyBall",
                    "score": 22,
                    "created_utc": 1653125911.0,
                    "response": "To the \"delay\" crowd:\n\nCrypto news are not reliable sources. When they say \"2.0 soon\" for years, that's on them, not Ethereum development.\n\nIn 2016 the developers thought it could be done easily, and where building towards Casper FFG. [In 2018 they realized that it wasnt feasible and scrapped it](https://twitter.com/VitalikButerin/status/1029905990085357568). Between 2018 and 2021 there was never any delays - they had more or less started over. \n\nIn December 2020 the beacon chain launched. At that point the launchpad specifically warned that funds could be locked 2+ years - it wasn't close. No date was set. \n\nNow, 4 shadow forks have been successful. [The 3 main testnets are merging, Ropsten is first in 29 days](https://wenmerge.com/). It's actually close. All the code is done, and its proven to be working.\n\nOnly people uninterested in Ethereum development are crying about delays. Thats the only way to miss what has happened, and why this particular \"merge soon\" headline is different. I get it, we want it all, we want it now. We want Ether to pump while the only thing we do is hodl.\n\nThe biggest game changer for Ethereum users is layer2 rollups. They scale Ethereum. They make the fees cheaper than other L1's. They are already live. They are constantly improving.\nThe wait was over 6 months ago, people just didn't get the memo. \n\nhttps://l2beat.com/\n\nhttp://ethl2s.com",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9emjkh",
                    "author": "SenorElPresidente",
                    "score": 27,
                    "created_utc": 1653100144.0,
                    "response": "How long and how many times are we gonna keep saying THERE IS NO F***ING ETHEREUM 2.0? Drop it for f***s sake! There is no product 2.0 and the merge is CERTAINLY not what 2.0 refer to or even USED to refer to. Ethereum 2.0 WILL NOT \"launch August\".\n\nThe merge, is possible in August, IF everything goes according to plan.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9f65w0",
                            "author": "Karyo_Ten",
                            "score": 5,
                            "created_utc": 1653112393.0,
                            "response": "Well from a marketing POV Eth2.0 was what it was for 3 years.\n\nIt's also a strong brand.\n\nThere is an Eth2.0: a series of upgrades starting with the merge and ending with sharding.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9fk5hl",
                                    "author": "SenorElPresidente",
                                    "score": 5,
                                    "created_utc": 1653124727.0,
                                    "response": "No, there is no ETH 2.0 it is completely depreciated. It was indeed a series of upgrades, but even when we had 2.0 it was NOT going to start with merge and NOT end with sharding. \n\nIt ***was*** a strong branding play because people are used to distinct software versions which was also the reason why it was depreciated",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9gitef",
                                            "author": "FaceDeer",
                                            "score": 2,
                                            "created_utc": 1653146665.0,
                                            "response": "It also led to endless confusion by people asking whether they had to \"convert\" their Ether into Ether 2.0.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9flxzn",
                            "author": "saddit42",
                            "score": -2,
                            "created_utc": 1653126414.0,
                            "response": "Well.. it's a decentralized ecosystem. If some people like to use the term Ethereum 2.0 then there's noone who has the authority to say they're not free to do that. Even Teku's lead dev still uses eth2... eth2.news (\"What's new in Eth2\").\n\nSo deal with it.. Ethereum 2.0 is coming",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9g466l",
                                    "author": "SenorElPresidente",
                                    "score": -7,
                                    "created_utc": 1653139563.0,
                                    "response": "No one has the authority to stop people from saying pedophilia is OK, it doesn't make it right. Just because no one has the ***authority*** to stop something, it doesn't make that thing OK. Decentralised doesn't mean anarchy or deliberate ignorance  is OK. It doesn't even mean different views are all equal and any bs is acceptable. \n\nEthereum 2.0 was used by the Ethereum Foundation and the core developers. It changed  not just because of branding issues, but because ***the actual roadmap*** changed ***COMPLETELY***. What people expected from 2.0 will not be delivered and the focus has shifted completely from monolithic to modular design. There is no longer a point in time where we can say \"aaahhh we're done, 2.0 is finally shipped\". The whole concept is gone.\n\nBut if it makes you feel good about yourself being contrarian despite being factually wrong, please go ahead. No one has the *authority* to stop you, so it's ok.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9gg8u8",
                                            "author": "Chewbarkbiglog",
                                            "score": 5,
                                            "created_utc": 1653145480.0,
                                            "response": "Take a deep breath. There are things worth getting upset about. This isn't them.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i9h8gld",
                                            "author": "saddit42",
                                            "score": 1,
                                            "created_utc": 1653158501.0,
                                            "response": "I think we mostly agree. great",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i9hvs8k",
                                            "author": "KingKongOfSilver",
                                            "score": 1,
                                            "created_utc": 1653170129.0,
                                            "response": "You are sick",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9gpn4z",
                            "author": "Pookadog",
                            "score": -3,
                            "created_utc": 1653149811.0,
                            "response": "I bet you’re fun at parties",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9gx34y",
                                    "author": "SenorElPresidente",
                                    "score": 1,
                                    "created_utc": 1653153201.0,
                                    "response": "Aaaah yes, the eternal truth that you cannot be both sociable/likable in real life AND speak freely with strangers online to point out mistakes. You got me. Not everyone is as clever as you are with your original jokes (did you just come up with this? Never heard this before. Much wow) and personal attacks out of nowhere.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9hvupw",
                                            "author": "KingKongOfSilver",
                                            "score": 1,
                                            "created_utc": 1653170164.0,
                                            "response": "You just proved his point",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i9hata3",
                                            "author": "Pookadog",
                                            "score": -1,
                                            "created_utc": 1653159648.0,
                                            "response": "You just proved my point ty. No further questions",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9hgm6f",
                                                    "author": "SenorElPresidente",
                                                    "score": 1,
                                                    "created_utc": 1653162483.0,
                                                    "response": "I'm glad you feel that way. Seems important to you.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9hhctf",
                                                            "author": "Pookadog",
                                                            "score": 1,
                                                            "created_utc": 1653162848.0,
                                                            "response": "The 4 seconds it took for each comment are very important to me yes. I’m balding so there’s your win buddy gl",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9fycxf",
                            "author": "Schwickity",
                            "score": 0,
                            "created_utc": 1653136165.0,
                            "response": "But but but marketing and clicks",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9eeeyy",
                    "author": "SAGA_EJ1",
                    "score": 65,
                    "created_utc": 1653095889.0,
                    "response": "Postponed I guarantee 💯",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9fvzdt",
                            "author": "Sweet-Zookeepergame",
                            "score": 20,
                            "created_utc": 1653134608.0,
                            "response": "If something comes up during testing, it HAS to be postponed. Do you understand how complex this merge is? Postponing is a GOOD thing, because the devs are not rushing to implement something which doesn’t work flawlessly.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9fgdl0",
                            "author": "thomas_m_k",
                            "score": 11,
                            "created_utc": 1653121200.0,
                            "response": "If you're so sure, bet your money here: https://polymarket.com/market/will-the-ethereum-merge-eip-3675-occur-by-september-1-2022\n\nDisclaimer: I have bought Yes shares in that market.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9en7kw",
                            "author": "domotheus",
                            "score": 41,
                            "created_utc": 1653100517.0,
                            "response": "unless something goes extremely wrong you can expect the biggest \"delay\" to be a month and a half at most\n\nin fact anyone with half a brain can notice that the witty \"haha it's always 12 months away\" became \"haha it's always 6 months away\" and then \"haha it's always 3 months away\"\n\ny'all gonna be like \"haha it's always 1 day away\" til the very end lol",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9ff5a1",
                            "author": "MyzMyz1995",
                            "score": 4,
                            "created_utc": 1653120082.0,
                            "response": "I wish. I want to mine 1 ETH before the marge 😭",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9ee2gt",
                    "author": "coinfeeds-bot",
                    "score": 18,
                    "created_utc": 1653095703.0,
                    "response": "tldr; Ethereum 2.0 is scheduled to launch in August 2020, Vitalik Buterin has said. The delay is due to the difficulty bomb, which will increase the difficulty level of puzzles required for proof of work mining. The difficulty bomb is intended to act as a deterrent for miners who wish to continue mining the Ethereum 1.0 chain.\n\n*This summary is auto generated by a bot and not meant to replace reading the original article. As always, DYOR.*",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ep3nq",
                            "author": "techma2019",
                            "score": 48,
                            "created_utc": 1653101535.0,
                            "response": "2020, eh? Even the bot is getting in on the fun?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9f0vph",
                    "author": "austininlaw",
                    "score": 12,
                    "created_utc": 1653108577.0,
                    "response": "I love Eth 2.0. It is my favorite. I hope Coinbase never lets my have my Eth 2.0 back.\n\nEth 2.0.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9fti0p",
                    "author": "anaf28",
                    "score": 5,
                    "created_utc": 1653132843.0,
                    "response": "Please stfu until there is an official guaranteed announcement that it’s coming out on a specific date. These posts do nothing but make things worse.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9fobv1",
                    "author": "T0Bii",
                    "score": 3,
                    "created_utc": 1653128589.0,
                    "response": "*if* everything goes as planned.  \n\nThat's a big **if**.  \n\nBut you'll continue to post and upvote shitty click bait articles and the complain when something gets 'delayed' that hasn't been confirmed.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9f2asb",
                    "author": "hoovana",
                    "score": 4,
                    "created_utc": 1653109571.0,
                    "response": "People getting downvoted for being frustrated. I don’t get it. It has been postponed for a few years now. Of course such a complex project is not easy and requires lots of components to go correctly, but honestly I’m starting to wonder myself if it will happen this year. There have been lots of dates that have all come and gone and without any clear explanation or reasoning, one can only sit back and hope.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9gj9i5",
                            "author": "FaceDeer",
                            "score": 4,
                            "created_utc": 1653146876.0,
                            "response": "They are being downvoted for whinging ignorantly. Being frustrated doesn't give free license to spread false narratives without being called out for it.\n\nThere actually are reasons for the delays PoS has had over the years, but the complainers either don't accept them or never bother to actually go looking for them.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9hjt8x",
                                    "author": "NozzlerE2",
                                    "score": 2,
                                    "created_utc": 1653164065.0,
                                    "response": "Eth has continually delayed, over promised and under delivered. If this were a housing remodel, car repair or project bid, anyone with capital locked up would have every reason to be upset. Saying that people with locked up capital are spreading \"false narratives\" is baloney. Either deliver, or let me out of the lock up. Oh yeah, the gas fees are outrageous.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9hoqoz",
                                            "author": "FaceDeer",
                                            "score": 1,
                                            "created_utc": 1653166518.0,
                                            "response": "There has been no overpromising because there have been no *promises*. People have imagined they were promised things because they wanted to be promised those things. They deluded themselves and now they want to blame everyone else for it.\n\nThe conditions of stake withdrawal were always clearly stated. Again, you have nobody to blame but yourself if you think your Ether is \"trapped\". Withdrawal will be implemented after the merge is done, and the merge will be done when it is completely ready.\n\n[Fees are actually quite reasonable right now](https://l2fees.info/), and have been for a while. As layer 2 rollups continue to see increased development and adoption that will only get better. More complaining about imagined slights.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9gtisa",
                                    "author": "hoovana",
                                    "score": 1,
                                    "created_utc": 1653151585.0,
                                    "response": "I don’t actually disagree with some of what you’re saying. This is extremely complex work and complaining is bad.\n\nHowever, many, including myself, are frustrated by lack of clear communication and postponed timelines.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9gaqau",
                    "author": "socalquest",
                    "score": 2,
                    "created_utc": 1653142909.0,
                    "response": "I’m earning about 5+ ETH a year at the current yield of 3.68% APR. Imaging ETH staking yield doubles after The Merge? That’s 10+ ETH annually after that!!! ETH is a cash flow generating digital asset to be held long-term!!! GLTA!!!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9f7c5k",
                    "author": "ykcir23",
                    "score": 1,
                    "created_utc": 1653113331.0,
                    "response": "BOOOO",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9fcaho",
                    "author": "Stfucarl12",
                    "score": 0,
                    "created_utc": 1653117524.0,
                    "response": "WEN MERGE",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9gjht8",
                            "author": "FaceDeer",
                            "score": 1,
                            "created_utc": 1653146983.0,
                            "response": "Did you read the ~~article~~ headline?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9gpwli",
                                    "author": "Stfucarl12",
                                    "score": 2,
                                    "created_utc": 1653149929.0,
                                    "response": "No. Am simple human. Wen merge",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9efu74",
                    "author": "StudentWonderful6155",
                    "score": -9,
                    "created_utc": 1653096641.0,
                    "response": "I have never seen a project get pushed back so much, this is hard to believe",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9errmv",
                            "author": "bugger_allz",
                            "score": 12,
                            "created_utc": 1653102988.0,
                            "response": "I work in software project management and this seems to be the norm unfortunately",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9fj46d",
                            "author": "Itchybootyholes",
                            "score": 1,
                            "created_utc": 1653123749.0,
                            "response": "Yeah most software projects are like this",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9ev22g",
                    "author": "enterdoki",
                    "score": -5,
                    "created_utc": 1653104846.0,
                    "response": "And then come August, they delay again.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9hdsme",
                            "author": "domotheus",
                            "score": 2,
                            "created_utc": 1653161095.0,
                            "response": "There can be infinite delays if every delay is half as long as the previous delay, that way we get a merge and you people are happy fudding every single delay. Win win!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9ej8hp",
                    "author": "NozzlerE2",
                    "score": -18,
                    "created_utc": 1653098376.0,
                    "response": "I'll believe it when I see it. Once I get my ETH out of coinbase lock up(BIG MISTAKE, I know) , it's getting switched to BTC. I've been through to much of the stress and BS. Ridicule me, educate me, I don't care. Bitcoin is the only one worth having.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9fp92x",
                            "author": "JBudz",
                            "score": 4,
                            "created_utc": 1653129422.0,
                            "response": "🤣",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9g8g9h",
                    "author": "BlankEris",
                    "score": -3,
                    "created_utc": 1653141798.0,
                    "response": "Meanwhile the Ethereum foundation will continue to dump their premined coin while yours are locked up in the 2.0 smart contact only to be released in the depths of a bear market. Brilliant ponzi. Send it to $100.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9hdn5g",
                            "author": "domotheus",
                            "score": 2,
                            "created_utc": 1653161019.0,
                            "response": "I thought they were using their premined coins to stake and have total control after PoS?\n\nBut on a serious note, the EF holds like 0.5% of the supply. Get real.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9f4v91",
                    "author": "CarterCat04",
                    "score": 1,
                    "created_utc": 1653111408.0,
                    "response": "I don’t exactly believe this, however I’m soooo excited for the merge.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9fw0cs",
                    "author": "Nervous_Key_4158",
                    "score": 1,
                    "created_utc": 1653134625.0,
                    "response": "The plus side of this delay is I've been forced to stale my ETH. At this point, they should only speak up when the merge finally happens, till then I'd be playing p2e like shiryo and axie infinity",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9gjpwa",
                            "author": "FaceDeer",
                            "score": 1,
                            "created_utc": 1653147086.0,
                            "response": "If they don't speak up, do you think the endless parade of \"wen merge?\" demands for predictions will stop as well?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9gqi54",
                                    "author": "Nervous_Key_4158",
                                    "score": 1,
                                    "created_utc": 1653150200.0,
                                    "response": "Either ways  we're all going to whine until the merge happens",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9g3r0y",
                    "author": "S0litaire",
                    "score": 1,
                    "created_utc": 1653139329.0,
                    "response": "Only issue left is ETH PoS integration into the larger ecosystem.  \n\n\nTechnically the dapps should be agnostic when it comes to PoW or PoS, but... there's been no actual testing of PoS and it's interaction with dapps like OpenSea or UniSwap (to my knowledge).   \n\n\nThe ETH Devs have said : \"It's not our problem!\"  \n\n\nHopefully their won't be an issue, but we all know \"Sh!t happens\" if we're lucky the issue will be with a smaller dapp that few use. but if a site like OpenSea or UniSwap goes down due to the merge then a large double figure % drop is likely in both $ and confidence of the network and dev teams.  \n\n\nThen what do the devs do?   \nKeep on truckin' with the merge and hope the devs of the effected dapps can fix things quickly. (with the massive hit to the larger ecosystem and the value of ETH).  \nOR   \nRoll back the merge and work with dapps to test and make sure the next merge works. (Large hit in confidence around the dev teams and the merge delayed again!.)",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9gb8g7",
                            "author": "SilkTouchm",
                            "score": 3,
                            "created_utc": 1653143146.0,
                            "response": ">Technically the dapps should be agnostic when it comes to PoW or PoS, but... there's been no actual testing of PoS and it's interaction with dapps like OpenSea or UniSwap (to my knowledge).\n\nThere will be PoS testnets before the merge, that will be their own issue for not testing enough.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9hdk44",
                            "author": "domotheus",
                            "score": 2,
                            "created_utc": 1653160978.0,
                            "response": "OpenSea and UniSwap will keep working as-is, on the exact same code as before which has been battletested for years. It's still Geth, Nethermind, etc. running the execution layer after all. \n\nThe two differences as far as dapps are concerned is consistent block time at exactly 12 seconds and DIFFICULTY opcode now providing beacon chain's randomness.\n\nBut yeah, still a good idea to test dapp integration with PoS regardless, which is exactly what is being done by having testnets like Kiln open since december, and now ropsen, goerli and sepolia each getting merged one by one to allow all those dapps currently deployed and running on them to test their configs and workflows properly in an environment where shit breaking is acceptable and even welcomed.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9g8bpn",
                    "author": "xiaro1",
                    "score": 1,
                    "created_utc": 1653141734.0,
                    "response": "Are they sure?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9gjzpl",
                            "author": "FaceDeer",
                            "score": 3,
                            "created_utc": 1653147214.0,
                            "response": "It's a prediction, not a promise. It's never been a promise, if it *were* a promise that would be a sign of bad development practices.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9gk0ek",
                    "author": "Gain-Fit",
                    "score": 1,
                    "created_utc": 1653147223.0,
                    "response": "Def at least September prob October",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9frl4c",
                    "author": "_Commando_",
                    "score": -4,
                    "created_utc": 1653131365.0,
                    "response": "That's what they said for June 2022.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9fubvd",
                            "author": "T0Bii",
                            "score": 3,
                            "created_utc": 1653133446.0,
                            "response": "That's what the bullshit click bait articles said. Just like this one. There's still no official date for the merge and there never has been.  \n\nMaybe start reading more than the headlines.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}