{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uppre5",
            "title": "Vitalik himself said that the goal of Ethereum isn’t million-dollar pictures of monkeys, it’s to accomplish meaningful things in the world.",
            "url": "https://www.reddit.com/r/ethereum/comments/uppre5/vitalik_himself_said_that_the_goal_of_ethereum/",
            "author": "DeliciousNectarine8",
            "created_utc": 1652560336.0,
            "score": 1032,
            "num_comments": 141,
            "subreddit": "ethereum",
            "selftext": "I’m not against NFT art, after all its another integral part of the Ethereum ecosystem. However, I am against the HUGE amounts of resources that are being poured in the NFT market. Resources that will not result in anything of real utility or impact in the real world.\n\nVitalik’s vision is for Ethereum to be the portal which people will use to integrate themselves and their lifestyle into the digital world. His vision is for Ethereum to be able to solve real world problems and eventually, down the line, make decentralization the norm and end the tyranny of centralized authorities over our lives. I know this may sound a bit “poetic” right now but this is the real long term vision.\n\nThis is exactly why I love to see that there are indeed a select few projects that have been following this vision, a lot of which are DAOs which fits great with Vitalik's ideals. There are DAOs out there like BitDAO aiding this vision with more than $500 million ETH in their treasury being allocated toward expanding the DeFi space on Ethereum and improving its adoption rates. Crazy to think that a DAO is the 43rd largest ETH holder meaning that they truly do believe in the long term vision of Ethereum.\n\nHopefully we keep seeing more resources being allocated toward the utilitarian side of Ethereum cause this is the only way to prove that crypto will indeed solve everyday problems and make life all the better. All these billions of dollars combined can be put into much better use. But that's just my (and Vitalik's) personal opinion.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8nhfjm",
                    "author": "FaceDeer",
                    "score": 28,
                    "created_utc": 1652582866.0,
                    "response": "Okay, so there's an application of Ethereum that you're not fond of. That Vitalik is not fond of.\n\nThe fact that neither you nor Vitalik can stop people from using Ethereum for that application is *exactly* what Ethereum was meant to accomplish.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8mkxxj",
                    "author": "Simple_Yam",
                    "score": 256,
                    "created_utc": 1652566616.0,
                    "response": "Yeah but one person will not decide how 1 billion people use a permissionless system. \nIf the endgoal of Ethereum is to host expensive monkey pictures, so be it, after all it's the userbase that decides its purpose.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8mn61r",
                            "author": "OB1182",
                            "score": 57,
                            "created_utc": 1652567660.0,
                            "response": "This is the most important and interesting part.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8o0dth",
                            "author": "Lightspeedius",
                            "score": 6,
                            "created_utc": 1652594870.0,
                            "response": "No decision is being made.\n\nAnd it's not like there has to be one end goal. There can be endless different Ethereum platforms.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8mzm9p",
                            "author": "wind_dude",
                            "score": 13,
                            "created_utc": 1652573619.0,
                            "response": ">BitDAO\n\nIs it? Or is the monkey trainers? VCs, founders leading people down paths of easy rewards.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8p26wy",
                            "author": "mindoflines",
                            "score": 3,
                            "created_utc": 1652622856.0,
                            "response": ">If the endgoal of Ethereum is to host expensive monkey pictures, ~~so be it, after all it's the userbase that decides its purpose.~~ then Ethereum has no real use in the real world and will fail miserably.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8nslx9",
                            "author": "TeutonicTitan",
                            "score": 6,
                            "created_utc": 1652589418.0,
                            "response": "Based response.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8nuw2b",
                            "author": "morningbreakfast1",
                            "score": 6,
                            "created_utc": 1652590888.0,
                            "response": "Exactly, if million dollar monkeys is what people find useful in eth than so be it.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8ofb4j",
                            "author": "DisorientedPanda",
                            "score": 3,
                            "created_utc": 1652607355.0,
                            "response": "Seems like not a lot of people get this. They want a permissions system but then get so wound up by JPEGs",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8nihgp",
                    "author": "Aeon_Nine",
                    "score": 8,
                    "created_utc": 1652583448.0,
                    "response": "It's not like we need his permission. 🤷🏻‍♂️",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8nvo1o",
                    "author": "g_squidman",
                    "score": 3,
                    "created_utc": 1652591417.0,
                    "response": "I think you can love NFTs and crypto art and all that stuff and still hate BAYC. What BAYC represents is kind of disgusting. All my NFTs are supporting artists I enjoy. It's not about being in an exclusive club that's locked to people who only have a lot of money. It's not a *licheral yacht club.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8nr4yw",
                    "author": "xGsGt",
                    "score": 10,
                    "created_utc": 1652588501.0,
                    "response": "Ens are nfts\nMonkeys are not pictures, they are membership to a club\nYou can do software license with nfts.\n\nStop throwing shades to a market you don't know about",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8mdseb",
                    "author": "H4y3s_",
                    "score": 30,
                    "created_utc": 1652563294.0,
                    "response": "I think NFT’s with useable applications are going to change the landscape of the world but yeh, an expensive picture of a monkey doesn’t make a whole lot of sense to me.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8mf5ps",
                            "author": "DeliciousNectarine8",
                            "score": 19,
                            "created_utc": 1652563921.0,
                            "response": "I mean, NFT technology is actually very exciting. It has some of the most diverse use cases out of all other blockchain tehcnologies.  \n\n\nHowever, its kinda sad how that technology is being used just for hyperinflated JPEGs of monkey and pixels.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8nh3ol",
                                    "author": "Stiltzkinn",
                                    "score": 7,
                                    "created_utc": 1652582683.0,
                                    "response": "> However, its kinda sad how that technology is being used just for hyperinflated JPEGs of monkey and pixels.\n\nI agree these avatars NFTs are trash but there are already other uses cases of NFTs in the wild, not wild popular but ENS is one.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8o9ism",
                                            "author": "KingInvalid96",
                                            "score": 3,
                                            "created_utc": 1652602375.0,
                                            "response": "Had the idea to mint NFTs out of color codes. Saw Vitalik shitting on the idea big time a couple months back.. kinda hard to guage the socially acceptable use cases.\n\nPeople shit on NFTs not realizing that websites, bar codes, tickets and social security numbers are just rudimentary NFTs.\n\nMy buddy spent an hour in Home Depot downloading the app just to get a lil military discount. A cryptographically secure military designation seems massively important, ubiquitous and pretty easy to implement",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i8nht31",
                                    "author": "Keegan1948",
                                    "score": 4,
                                    "created_utc": 1652583071.0,
                                    "response": "Marl Cuban has some good thoights on this subject. He owns a few BAYC (you can find his wallet on opensea), and he's said in interviews that a lot of the popular NFTs we see today are proof of concept.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8mfdq5",
                                    "author": "H4y3s_",
                                    "score": 13,
                                    "created_utc": 1652564020.0,
                                    "response": "But it’s a start! A year ago hardly anyone outside of the cyptoverse knew what nft meant. It will grow fast and be adapted widely! Exciting time ahead!",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8omfmt",
                                            "author": "Gaff_Gafgarion",
                                            "score": 7,
                                            "created_utc": 1652613333.0,
                                            "response": "it also could be that the current hype and bubble about NFT ape pictures and stuff could forever sour people to the NFT technology as a whole once the whole thing crashes down",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8nqjfy",
                            "author": "ShowerWide7800",
                            "score": 3,
                            "created_utc": 1652588130.0,
                            "response": "What is the difference between an NFt and a QR code?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8mpe77",
                    "author": "ahungrylilsandwhich",
                    "score": 55,
                    "created_utc": 1652568702.0,
                    "response": "The only thing dumb about nfts is that people can't understand they're more than monkey pictures.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8n4rdf",
                            "author": "BestCelery263",
                            "score": 19,
                            "created_utc": 1652576228.0,
                            "response": "They’re currently only used for monkey pictures.  If they have other uses, we haven’t seen the application yet.\n\nNo, counties are not switching their Recorder of Deeds to NFT’s.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8nrcrq",
                                    "author": "xGsGt",
                                    "score": 26,
                                    "created_utc": 1652588632.0,
                                    "response": "Ens, software license, memberships, liquidity pool in uniswap, there are tons of great use cases for nfts",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8p359n",
                                            "author": "spicybright",
                                            "score": 11,
                                            "created_utc": 1652623325.0,
                                            "response": "Software and memberships are silly though, outside of the typical crypto-grift schemes.\n\nSoftware licenses are only recognized by the company that produces the software. And they can choose to honor it or give out new ones  to customers that lose it (as happens all the time). That doesn't need to be decentralized.\n\nMemberships have the same issue, unless it's some smart contract based thing.\n\nEverything I've seen so far is Elon Musk style futurism but with more scams.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i8nh6si",
                                    "author": "FaceDeer",
                                    "score": 12,
                                    "created_utc": 1652582731.0,
                                    "response": "[Ethereum Name Service names are NFTs](https://docs.ens.domains/dapp-developer-guide/ens-as-nft).",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8niux9",
                    "author": "Keegan1948",
                    "score": 3,
                    "created_utc": 1652583653.0,
                    "response": "This post would be a lot stronger with quotes. It sounds like you're just putting a bunch of words into Vitalik's mouth without citing anything.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8nytm9",
                    "author": "LEO_TROLLSTOY",
                    "score": 3,
                    "created_utc": 1652593681.0,
                    "response": "Its like bitching in the early days of cars that they are loud and completely missing the big picture. Just quit complaining and wait it out",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8o4soq",
                    "author": "Shadowys",
                    "score": 3,
                    "created_utc": 1652598380.0,
                    "response": "NFT are usable, its just that theres little people with real world experience working on it. \n\nNFTs can be used for online memberships, for recording purchase history, for customer loyalty programmes, insurance, etc theres a whole sector of fintech that can be used",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8oide9",
                    "author": "The_Avocado_Constant",
                    "score": 3,
                    "created_utc": 1652610011.0,
                    "response": "\"But, but, this isn't what Vitalik wanted!\"\n\nOh noooo! So, anyway...\n\nVitalik made something for anyone and everyone to build on. It doesn't matter one bit if someone makes something that he didn't envision as \"the goal.\"",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8nd2ax",
                    "author": "RangersNation",
                    "score": 12,
                    "created_utc": 1652580538.0,
                    "response": "NFTs do solve real world problems. Their utility doesn’t just stop with digital art.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8ob0n5",
                            "author": "saintPirelli",
                            "score": 3,
                            "created_utc": 1652603665.0,
                            "response": "Name one that isn't a problem within the ecosystem itself.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8oxxpt",
                                    "author": "Stiltzkinn",
                                    "score": 4,
                                    "created_utc": 1652620637.0,
                                    "response": "There are already mentioned in other comments, but even Vitalik has his own NFT as vitalik.eth",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8mt8ox",
                    "author": "UnkutThaLyrikal",
                    "score": 4,
                    "created_utc": 1652570489.0,
                    "response": "Life is what happens when you're making plans.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8n29am",
                    "author": "TheMessenger18",
                    "score": 6,
                    "created_utc": 1652574959.0,
                    "response": "Nfts were this cycles icos. Most everyone knew it was a scam but so many bought in anyways thinking they would dump before it all collapsed.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8na5q5",
                    "author": "shala0",
                    "score": 4,
                    "created_utc": 1652579063.0,
                    "response": "and the million dollar monkey pics signify exactly that - a meaningful project. look up what Yuga Labs (BAYC) is trying to do. the owners of those pics know this too. the objective is to decentralize all industries by introducing NFTs/blockchain",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "upkvf5",
            "title": "the only way the Ethereum would ever accomplish mainstream status is through this merge. Energy consumption will go down by 99% meaning that Ethereum will finally be able to experience mass mainstream adoption.",
            "url": "https://www.reddit.com/r/ethereum/comments/upkvf5/the_only_way_the_ethereum_would_ever_accomplish/",
            "author": "pihip2",
            "created_utc": 1652545826.0,
            "score": 500,
            "num_comments": 274,
            "subreddit": "ethereum",
            "selftext": "Some people are really underestimating what this merge means exactly. A lot of people know that it will definitely drive consumption WAY lower, but not many realize that this means Ethereum is going one step forward towards attaining mainstream status.\n\nAside from the fact that retail companies are pushing all in for eco-friendliness, these companies can’t operate on Ethereum as long as it's PoW.\n\nOf course, we still need to wait for sharding for Ethereum to actually start showing its real efficiency, but there are already enough scaling solutions to compensate for that in my opinion.\n\nThese scaling solutions and L2s aren’t playing. Polygon alone has already partnered with so many mainstream traditional companies like Ernst & Young, Dolce & Gabbana, Twitter, Instagram and most importantly Stripe which is a BIG step for crypto as a whole considering Stripe is the 6th largest Fintech company in the world and the 5th most used payment app in the US.\n\nAnd the fact that this company is using Ethereum (even if it’s through an EVM chain like Polygon) insights a lot of hope that Ethereum is on the right path toward mainstream adoption.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8lkjgu",
                    "author": "Thin-Course-4054",
                    "score": 299,
                    "created_utc": 1652549792.0,
                    "response": "I honestly don't think energy consumption was/is the barrier against mass mainstream adoption",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8lnkp3",
                            "author": "Dry-Hurry-7598",
                            "score": 102,
                            "created_utc": 1652551175.0,
                            "response": "Lol it’s more like wtf does eth do for the general public right now. But most off all developement of legitimate projects can’t commence whilst gas fees are this high",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8ly8c6",
                                    "author": "Thin-Course-4054",
                                    "score": 25,
                                    "created_utc": 1652556075.0,
                                    "response": "lol kind of a good point. My best answer would be that Eth runs other popular layer 2 networks. If you like transacting with eth you should be using those instead of the L1 chain. I paid almost 200 to move 2k worth of eth yesterday 😅. I had no other option though cause i had to get it bridged off the terra network. RIP.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8m9adi",
                                            "author": "SirRandyMarsh",
                                            "score": 18,
                                            "created_utc": 1652561209.0,
                                            "response": "wtf I remember only paying .10 to send like 2k a few years ago… when did it get this bad?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8mfxw6",
                                                    "author": "epicoliver3",
                                                    "score": 5,
                                                    "created_utc": 1652564278.0,
                                                    "response": "When ppl started using it more but only so many transactions could go through",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i8mjh07",
                                                    "author": "917redditor",
                                                    "score": 14,
                                                    "created_utc": 1652565920.0,
                                                    "response": "It's usually way cheaper, like $5-10. Gas prices get crazy during busy market days at peak times. \n\nEdit: currently $2",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i8np1bm",
                                                    "author": "jcm2606",
                                                    "score": 3,
                                                    "created_utc": 1652587218.0,
                                                    "response": "It depends on if they actually just transferred ETH, or if they called into a smart contract and had the smart contract transfer ETH.\n\nNot every transaction on the Ethereum network is the same, different transactions require the network to perform different amounts of work to process, and so the fees that you end up paying for them will be different.\n\nTransferring ETH is one of the simplest types of transactions you can perform, and will generally be the cheapest. Calling into a smart contract is one of the more complex types of transactions you can perform, as you're having the network execute code for your transaction.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8nqcl2",
                                                            "author": "drugv2",
                                                            "score": 3,
                                                            "created_utc": 1652588011.0,
                                                            "response": ">nsactions you can perform, as you're having the network execute code for your transaction.\n\nDo you know an effective way to calculate transaction costs for liquidity providing of ETH in Uniswap? Do the fees scale, for example, would moving/approving $50k worth of ETH cost the same as $50 worth of ETH? \n\nSorry for the questions, couldn't find a concrete enough source, hoping someone with more knowledge may know.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8nt1rt",
                                                                    "author": "jcm2606",
                                                                    "score": 3,
                                                                    "created_utc": 1652589692.0,
                                                                    "response": "> Do you know an effective way to calculate transaction costs for liquidity providing of ETH in Uniswap?\n\nYour wallet should estimate how much gas is required for a successful transaction, and there are sites out there that also provide estimates (such as [crypto.com's defi dashboard gas fee estimator](https://crypto.com/defi/dashboard/gas-fees)).\n\nIf you want a more concrete answer, then the best way is to just look at how much gas other users had to provide and pay for, by looking at the transactions being sent to the contract on Etherscan, and filtering by completed transactions.\n\nThat definitely isn't an easy process, you'll need to know what address you're interacting with, what function(s) you're calling into, what internal transactions are going on, etc, but it gives a good overview of what other people had to pay.\n\n> Do the fees scale, for example, would moving/approving $50k worth of ETH cost the same as $50 worth of ETH?\n\nGenerally no, the fee will always be the same, regardless of how much you're actually moving, as the network is having to perform the same amount of work to process your transaction, whether you're moving $50 worth of ETH, or $50k worth of ETH.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i8nzeus",
                                                                            "author": "drugv2",
                                                                            "score": 2,
                                                                            "created_utc": 1652594125.0,
                                                                            "response": "Thank you very much for your detailed answers.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i8m2rfr",
                                            "author": "Dry-Hurry-7598",
                                            "score": 4,
                                            "created_utc": 1652558208.0,
                                            "response": "Damn Yh I can definitely see some good projects built once’s that happens that actually can be used by everyone cause quite frankly I can’t imagine say my parents paying $1.00 + $35 gas fee for a banana 😂😂 if they used a stablecoin for example",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8mjrzk",
                                                    "author": "917redditor",
                                                    "score": 5,
                                                    "created_utc": 1652566063.0,
                                                    "response": "Nobody's going to be using L1, that's the whole point. You'll use a regular debit card that's tied to an L2 stablecoin, **fees will be lower than VISA.**",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8nelaf",
                                                            "author": "lorenzomofo",
                                                            "score": 3,
                                                            "created_utc": 1652581343.0,
                                                            "response": "But currently different L2's cannot communicate with each other. If company A sells NFTs on Polygon and transaction fees are in MATIC and my wallet is on Loopring which accepts LRC, then I effectively cannot buy those NFTs without jumping through a bunch of hoops. This wasn't a problem before when everything was on L1.\n\nIt's the same situation on the web when eBay requires a Paypal account but I only have an Amazon wallet. But at least there was a common denominator which was Credit Cards that both accept.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8njez9",
                                                                    "author": "user260421",
                                                                    "score": 1,
                                                                    "created_utc": 1652583959.0,
                                                                    "response": "I'm sure there will come the time for the bridge for all bridges",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i8nmutd",
                                                                            "author": "lorenzomofo",
                                                                            "score": 2,
                                                                            "created_utc": 1652585926.0,
                                                                            "response": "I think we need a solution beyond bridges. Yesterday's hack of Web 2.0 bridges have caused a lot of people to loose funds. One of the attacks involved redirecting traffic by taking over their GoDaddy domain and cloning the website.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "id": "i8ocqqf",
                                                                    "author": "AESTHTK",
                                                                    "score": 1,
                                                                    "created_utc": 1652605147.0,
                                                                    "response": "This will be solved.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "i8nuz7w",
                                                            "author": "t00rshell",
                                                            "score": 2,
                                                            "created_utc": 1652590950.0,
                                                            "response": "No one in their right mind will keep their cash in stable coins after what’s happened recently.\n\nI really don’t see this fantasy coming to fruition.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i8m71ff",
                                                    "author": "Thin-Course-4054",
                                                    "score": 1,
                                                    "created_utc": 1652560169.0,
                                                    "response": "Good projects are already built but theres always room for more. Polygon for example has been around for years already and works great.\n\nIMO a combination of fees and volitility are def whats keeping grandparents from buying those bananas hahaha",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i8njbk4",
                                                    "author": "user260421",
                                                    "score": 1,
                                                    "created_utc": 1652583906.0,
                                                    "response": "lol you're acting like you would pay that much for a banana\n\nno one will be in the situation to do that",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i8ocog7",
                                                    "author": "AESTHTK",
                                                    "score": 1,
                                                    "created_utc": 1652605091.0,
                                                    "response": "http://l2fees.info",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i8naboq",
                                            "author": "Apetardo",
                                            "score": 1,
                                            "created_utc": 1652579149.0,
                                            "response": "Ever checked out Loopring's L2?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8new3g",
                                                    "author": "lorenzomofo",
                                                    "score": 3,
                                                    "created_utc": 1652581503.0,
                                                    "response": "But most of the NFTs being sold are still only offered on L1.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8njlre",
                                                            "author": "user260421",
                                                            "score": 3,
                                                            "created_utc": 1652584066.0,
                                                            "response": "This is really interesting to me. The people I follow were very hyped about L2s but it looks like there isn't so much adoption. Like BAYC could work with L2s for example, but they still choose the mainnet. I really don't get why. No one wins. \n\n\nI guess time is the answer, people need time to see the L2s battle tested before they start using them?",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8nv2ni",
                                                                    "author": "t00rshell",
                                                                    "score": 1,
                                                                    "created_utc": 1652591015.0,
                                                                    "response": "You’re isolated on the L2, main net has a far bigger audience",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i8mqy7h",
                                    "author": "meregizzardavowal",
                                    "score": 5,
                                    "created_utc": 1652569425.0,
                                    "response": "I was under the impression that the merge doesn’t purport to reduce gas fees.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8nfdus",
                                            "author": "lorenzomofo",
                                            "score": 3,
                                            "created_utc": 1652581766.0,
                                            "response": "So you mean transaction fees will never fall below Visa/Mastercard fees?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8njxhb",
                                                    "author": "user260421",
                                                    "score": 1,
                                                    "created_utc": 1652584252.0,
                                                    "response": "Not right now, most probably after sharding.\n\nThe merge is the \"switch\" between PoW and PoS, while Sharding is a later phase in which the chain will grow and the transactions will automatically cost less because the demand will be lower (because there will be enough space for everyone)\n\n\nAnyways, Ethereum isn't supposed to be used by consumers, but by L2s. It would be like an underlying chain which most users don't even know exists, but everything will run on top of Ethereum.\n\nSo the gas fees being lower than Visa/Mastercard will most likely happen on L2s.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8nkflu",
                                                            "author": "raphanum",
                                                            "score": 1,
                                                            "created_utc": 1652584535.0,
                                                            "response": "Didn’t Vitalik say he doesn’t care about fees being high or something?",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8nkr6t",
                                                                    "author": "user260421",
                                                                    "score": 1,
                                                                    "created_utc": 1652584721.0,
                                                                    "response": "I don't recall him saying that. There was a post a week ago with him saying that the fees must pe lower on L2s (even lower than they are now).",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i8nsrqe",
                                                                            "author": "raphanum",
                                                                            "score": 1,
                                                                            "created_utc": 1652589519.0,
                                                                            "response": "I think it was from last year or 2020, I’ll try to find it",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "id": "i8ocwzl",
                                                                    "author": "AESTHTK",
                                                                    "score": 1,
                                                                    "created_utc": 1652605292.0,
                                                                    "response": "That was in a different context - related to the ice age and timing The Merge.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "i8ocv1g",
                                                            "author": "AESTHTK",
                                                            "score": 1,
                                                            "created_utc": 1652605248.0,
                                                            "response": "You’re looking at an old roadmap from a few years ago.\n\nComputational sharding was dropped a few years ago for L2 scaling via roll ups instead.\n\nYou can use them today. 👍",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i8o0cxg",
                                                    "author": "meregizzardavowal",
                                                    "score": 1,
                                                    "created_utc": 1652594851.0,
                                                    "response": "Well as I said, I keep reading the merge isn’t meant to lower fees. So they may one day drop, but it (if the people I read here are to be believed) won’t be because of the merge.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i8ocm7j",
                                    "author": "AESTHTK",
                                    "score": 2,
                                    "created_utc": 1652605038.0,
                                    "response": "Ethereum L1 is a settlement layer.\n\nLayer 2 gas fees are cheap and getting cheaper every day.\n\nIf you aren’t using Optimism or Arbitrum, you’re doing it wrong.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8lvcxr",
                            "author": "frank__costello",
                            "score": 48,
                            "created_utc": 1652554731.0,
                            "response": "The people who hate crypto & NFTs because of the \"energy consumption\" will just move on to another reason to hate them\n\nIt's just an excuse",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8lw85h",
                                    "author": "FaceDeer",
                                    "score": 22,
                                    "created_utc": 1652555132.0,
                                    "response": "Some of them, maybe. Others are genuine. And regardless, the other major PoW cryptocurrencies will continue to draw fire that Ethereum will no longer be receiving.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8nk85p",
                                            "author": "user260421",
                                            "score": 2,
                                            "created_utc": 1652584419.0,
                                            "response": "I think the majority of them will continue with the critics, but surely there will be a small percentage (people who actually have principles and live by them) that will stop complaining when this is solved.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i8mmamb",
                                    "author": "domotheus",
                                    "score": 5,
                                    "created_utc": 1652567252.0,
                                    "response": "The evolution of arguments surrounding crypto is a series of \"but it can theoretically do X in a few years\" on one side and a series of \"Yeah, well,\" ad hoc rebuttals on the other side when it's been a few years and X is here\n\nAnd the inevitable uninformed people who think crypto is no different than it was in 2013 when the only utility was buy low, hold and sell higher",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8nae2k",
                                    "author": "david-song",
                                    "score": 5,
                                    "created_utc": 1652579183.0,
                                    "response": "There will be plenty more excuses once decentralised systems are cheap and available enough. \"My kids bought Xanax through this website we can't block\", \"my partner spent our money on this unregulated gambling network\", \"someone stole all my videos and put them on this unblockable P2P hosting site\", \"this distributed Al Qaeda dapp is crowd-sourcing car bombs\", \"my tween is selling nudes to a paedo site that can't be blocked because it's an HTML doc that someone sent her\", \"our military secrets are up for sale to the highest bidder and nobody knows who is buying or selling them\", \"this dapp is a sophisticated organised criminal network that pays untraceable dividends to its shareholders, we're not even sure if it's the people or the code are the criminals\"\n\nWeb 3 be a long and bumpy road filled with all kinds of ills.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8nkdxi",
                                            "author": "user260421",
                                            "score": 3,
                                            "created_utc": 1652584509.0,
                                            "response": "Sounds like a regular morning in 2030",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i8nlsy7",
                                            "author": "pokemonisok",
                                            "score": 3,
                                            "created_utc": 1652585321.0,
                                            "response": "Oh god that's actually quite scary",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i8p1es8",
                                            "author": "DarkChocolatRaisinet",
                                            "score": 2,
                                            "created_utc": 1652622466.0,
                                            "response": "You should write sci-fi lol that comment was terrifying",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i8otsbk",
                                            "author": "Perleflamme",
                                            "score": 1,
                                            "created_utc": 1652618270.0,
                                            "response": "So, basically, all they're saying is they should go after the person who voluntarily misbehaved, but would instead want to go after the neutral service provider and are infuriated that they can't. \n\nEnsuring they go after the person really responsible for these negative externalities instead of a scapegoat seems to be a pretty strong improvement, compared to nowadays.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8r2nau",
                                                    "author": "david-song",
                                                    "score": 1,
                                                    "created_utc": 1652655072.0,
                                                    "response": "The thing about companies that provide services is they can be controlled by governments, payment providers, landlords, local authorities etc, and the establishment can put the thumb screws on them without intruding too deeply into regular people's lives.\n\nThat's not really possible in a P2P environment. So when they inevitability tackle bad behaviour by peers, everyone will likely be subject to the same government overreach.\n\nIf the internet has taught us anything it's that first a new technology first seems like a new route to freedom, but once the dust settles it turns out to be another boot on your face. It's gonna take a lot of fight to find a middle ground that strikes a healthy balance, and there's not many people with a fight in them.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8r425h",
                                                            "author": "Perleflamme",
                                                            "score": 2,
                                                            "created_utc": 1652655755.0,
                                                            "response": "The thing is P2P environments don't ask the permission to states. If states want to prevent people from having fiat-crypto transfers, they'd need to forbid all types of bank transfers that exist, aka literally shut down their own banking networks. \n\nAfter all, we already have decentralized fiat-crypto exchanges using peer-to-peer transfers.\n\nBesides, it would require collusion between all states to actually work. It's the same setup of Prisoner's dilemma than the one that ensured Bitcoin worked in the first place. If states can pull that one, they'd disprove the Prisoner's dilemma conclusions. I'm yet to see such a thing happen.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8r9y7b",
                                                                    "author": "david-song",
                                                                    "score": 1,
                                                                    "created_utc": 1652658654.0,
                                                                    "response": "Yeah so authorities can't put pressure on businesses while leaving people alone, so have to remove people's rights instead.\n\nSay people in a democracy don't want alcohol or tobacco to be sold to kids, so authorities act on their behalf and make a rule prohibiting it. They enforce it by demanding that shops get a license to sell booze, and they punish businesses that don't check ID.\n\nThe license application process means that can also put more tax on these products, they can refuse to give licenses to the \"wrong\" people, stores that open too late or are in the wrong location. You can look at this two ways - either social ills are avoided but the people still feel free, or the people's freedoms are violated by proxy. There's an argument for each of these but it's really somewhere in the middle.\n\nIn a P2P environment you can only enforce it by draconian controls over individuals. Make everyone report all their financial transactions, look in every parcel for contraband and have steep punishments for lawbreakers. Without structural oppression you need direct oppression of individuals to have the same levels of control.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i8rafla",
                                                                            "author": "Perleflamme",
                                                                            "score": 1,
                                                                            "created_utc": 1652658895.0,
                                                                            "response": "Indeed. Yet it's going to cost so much to control everything that it wouldn't be feasible. Even China isn't succeeding that well in such endeavor.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i8relei",
                                    "author": "dwdwfeefwffffwef",
                                    "score": 1,
                                    "created_utc": 1652660965.0,
                                    "response": "> It's just an excuse\n\nIt's a completely valid and big issue with crypto. \n\nYes, true haters will find whatever excuse to hate on crypto. But let's not disregard true criticism because it comes from haters.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8nk3me",
                                    "author": "user260421",
                                    "score": 0,
                                    "created_utc": 1652584348.0,
                                    "response": "Exactly! This just proves how full of hatred humanity is. Instead of seeing the full half of the glass they try to find the empty one. If the empty one isn't there, they'll create it or generate it.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8revxr",
                                            "author": "dwdwfeefwffffwef",
                                            "score": 1,
                                            "created_utc": 1652661109.0,
                                            "response": "It's completely valid to be more interested in CO2 emissions or energy waste, than decentralized currencies. That doesn't make someone a hater.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8lsqb4",
                            "author": "Simple_Yam",
                            "score": 9,
                            "created_utc": 1652553523.0,
                            "response": "I would say that $50 fees are the barrier 😂 but I get what OP means.\n\nThe merge will open the doors for many wealthy investors that were either:\n- seeing the merge as very dangerous and wanted to wait on the sidelines until it happens, just to be sure\n- were under peer pressure to not be associated with eco-damaging industries",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8lw0u8",
                                    "author": "FaceDeer",
                                    "score": 13,
                                    "created_utc": 1652555039.0,
                                    "response": "Good news, then. [L1 fees are $1.44 as of this writing, and L2 fees are as low as $0.01](https://l2fees.info/).",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8rf11w",
                                            "author": "dwdwfeefwffffwef",
                                            "score": 1,
                                            "created_utc": 1652661177.0,
                                            "response": "Only because ETH is being used less now. And L2 is not viable yet.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i8nkmfa",
                                            "author": "Marc4770",
                                            "score": 0,
                                            "created_utc": 1652584644.0,
                                            "response": "Why it cost me 200 to bridge between mainnet and polygon then?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8ocze2",
                                                    "author": "AESTHTK",
                                                    "score": 3,
                                                    "created_utc": 1652605348.0,
                                                    "response": "Polygon PoS is a side chain, not an L2.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i8ou0pn",
                                                    "author": "Perleflamme",
                                                    "score": 2,
                                                    "created_utc": 1652618409.0,
                                                    "response": "Why using a bridge, when you can instead have used your CeFi platform to directly withdraw to the chain you wanted to use? Some CeFi platforms already provide such direct withdrawals.\n\nThough, Polygon PoS isn't an L2, it's a sidechain. Be careful, out there.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8p2ukl",
                                                            "author": "Marc4770",
                                                            "score": 1,
                                                            "created_utc": 1652623183.0,
                                                            "response": "I haven't found any CeFi I trust that can withdraw to L2",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8qplsb",
                                                                    "author": "Perleflamme",
                                                                    "score": 1,
                                                                    "created_utc": 1652649212.0,
                                                                    "response": "Wait, that you trust? You don't really need to keep your tokens in the CeFi for this kind of operations, so trust requirements are way lower than when it's to keep your funds in long term custody. But I guess it depends on your specifics needs and requirements to trust people you interact with. \n\nThere is crypto.com that allows for direct withdrawal to some L2s. Binance too (maybe not the same L2). They're both quite big. \n\nThe only thing you'd probably have to worry about is regarding your ability to justify your source of funds, if it's for lots of money. But you'd have to worry about it whatever the CeFi exchange and you'd probably wouldn't be caring about bridge fees if you've got lots of funds to transfer anyway.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i8qpv3p",
                                                                            "author": "Marc4770",
                                                                            "score": 1,
                                                                            "created_utc": 1652649328.0,
                                                                            "response": "I sent a big transaction to poloniex once and they never added it to my account.\non the blockchain they even transfered it from my deposit address to their poloniex storage, it just was never added to my account.\n\nso yeah trust is needed",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i8qsnn8",
                                                                                    "author": "Perleflamme",
                                                                                    "score": 1,
                                                                                    "created_utc": 1652650541.0,
                                                                                    "response": "Always start with a small transfer to ne sure you're doing things right. Sometimes, you need to follow a procedure and ensure everything's fine before sending the transaction. Some CeFi exchanges also change the address to which to send your tokens after each transfer (for privacy reasons), which can end up with funds being sent to a wallet not linked to your account there. \n\nI don't know about Poloniex, though. There are sketchy CeFi exchanges and there are ones which have procedures.\n\nMost CeFi exchanges can look for such mistakes and solve the problem if you ask them. Though, it can sometimes take a few months, as your transfer may point to a cold wallet they'd need to transform into a hot wallet (which they can't do quickly, for security reasons).",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i8npooc",
                                                    "author": "FaceDeer",
                                                    "score": 1,
                                                    "created_utc": 1652587602.0,
                                                    "response": "The cost of a transaction depends on both the price of the gas and how much gas it consumes. I'm not familiar with the polygon bridge contract in particular, but perhaps it's doing a lot of complicated work (or is inefficiently written) and so is consuming an inordinate amount of gas?",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i8lvkto",
                                    "author": "Thin-Course-4054",
                                    "score": 6,
                                    "created_utc": 1652554833.0,
                                    "response": "Eth 2.0 is still going to have high fees. That's a fact. L2 networks are still the only real solution to have low fees and still be on the Ethereum network.   \n\n\nAlso, I don't think wealthy investors are concerned with being associated with eco-damaging industries lol. \n\nI'm bullish as ever on eth but I don't agree with OP on 2.0 being the catalyst for mainstream adoption.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8nfrtg",
                                            "author": "lorenzomofo",
                                            "score": 1,
                                            "created_utc": 1652581974.0,
                                            "response": ">L2 networks are still the only real solution to have low fees and still be on the Ethereum network.\n\nBut you can't buy NFTs hosted on L1 by sending transactions on an L2 network, right? They're completely separate, right?\n\nAnd if your friend is on an L1 network you can send funds to their wallet from the L2 network, right? Your friend would need to get a wallet on the L2 network, then use a bridge to transfer it to their L1 network's wallet, right?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8oui8a",
                                                    "author": "Perleflamme",
                                                    "score": 1,
                                                    "created_utc": 1652618694.0,
                                                    "response": "If your NFT provider creates these NFTs on an L2, they exist on the L2. And specific bridges can then technically let these NFTs go to the L1. \n\nIf your NFT provider insists on existing only on the L1, it means he's telling you he's not willing to deal with anyone who'd be out priced by L1 transaction fees. It's the choice of NFT managers, because some L2s already support NFTs, like ZkSync (probably others too). \n\nYou can use CeFi platforms to directly send your funds to an L2, instead of sending funds to the L1 to then bridge them to an L2. It's way, way cheaper than using a bridge yourself. Most bridges are cheaper for very big transfers only.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i8lwstu",
                                    "author": "Rin-Tohsaka-is-hot",
                                    "score": -2,
                                    "created_utc": 1652555403.0,
                                    "response": "Correct me if I'm wrong, but aren't the $50 fees a product of the carbon footprint?\n\nLike, isn't gas pretty much paying miners in return for their power?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8lxkxi",
                                            "author": "IAMAdot2",
                                            "score": 8,
                                            "created_utc": 1652555773.0,
                                            "response": "No, it's not. You are paying to fit your transaction into the next block. With the merge, block sizes aren't increasing and block times are going to stay relatively the same (consistent ~12 sec, I think, so a bit faster but about the same as currently). It is simply supply and demand for block space. You are really just bidding to fit your tx into the next block. Has nothing to do with PoW, mining costs, or PoS.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i8lzaqm",
                                            "author": "h_nn_n",
                                            "score": 2,
                                            "created_utc": 1652556583.0,
                                            "response": "No",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8msbp5",
                            "author": "Westbrook_Level",
                            "score": 4,
                            "created_utc": 1652570058.0,
                            "response": "I disagree, there are a lot of people concerned about btc energy usage, as they should be.  At least that is the impression I get in real life and on the web outside of the cryptosphere.  I myself am certainly concerned about it.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8n3ckl",
                                    "author": "Thin-Course-4054",
                                    "score": 1,
                                    "created_utc": 1652575496.0,
                                    "response": "agree to disagree",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8mgkyp",
                            "author": "sharkhuh",
                            "score": 2,
                            "created_utc": 1652564575.0,
                            "response": "There's lots of funds that have \"ESG\" initiatives, where they can't invest in stuff that's not viewed as green. That includes BTC/ETH because they are PoW. \n\nIt's theorized that by going to PoS, ETH at least is green now, and open to a wider scope of investments by companies.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8oadt6",
                            "author": "SuddenMight6",
                            "score": 2,
                            "created_utc": 1652603122.0,
                            "response": ">to\n\nTRUE! Let's be honest most people don't care at all about something like this. Personally, I think it is a important step to make ETH esg-friendly",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8ob0mt",
                            "author": "Jacobgraham1738",
                            "score": 2,
                            "created_utc": 1652603665.0,
                            "response": "Energy Consumtpion is a very silly argument. The reality is we need more energy (hopefully renewable), but at the end of the day miners are just purchase of electricity on a grid like anyone else. The grid produces the pollution.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8oyys9",
                                    "author": "Thin-Course-4054",
                                    "score": 1,
                                    "created_utc": 1652621190.0,
                                    "response": "Agree.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8n27aa",
                            "author": "never_safe_for_life",
                            "score": 3,
                            "created_utc": 1652574930.0,
                            "response": "New technologies are often attacked for their energy use before it becomes clear what their value is. \n\nThere is no better example than early criticisms of the internet. “A lump of coal is burned every time a book is sold online” proclaimed Forbes:\n\nhttps://reddit.com/r/Bitcoin/comments/ubqdei/in_1999_media_attacked_the_internet_a_lump_of/\n\nThe problem is most people don’t see why cryptocurrencies have any value at all. Many think they are a scam, and one that burns a lot of energy to boot!\n\nI believe this changes when the world sees the benefit of a global, internet native, neutral money that can’t be controlled or corrupted. Most didn’t see the benefit of the internet until applications they used were built on top of it. Same with crypto.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8mji0i",
                            "author": "psxndc",
                            "score": 2,
                            "created_utc": 1652565932.0,
                            "response": "It's not *not* a factor though. My company is looking at doing NFTs as promotional items.  Eco-friendliness is part of my company's brand, so anything based on a PoW Blockchain is basically a non-starter.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8m2b42",
                            "author": "4022a",
                            "score": 1,
                            "created_utc": 1652557996.0,
                            "response": "Normies bring the energy consumption up all the time. It's a big deal.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8myfte",
                            "author": "stKKd",
                            "score": 1,
                            "created_utc": 1652573018.0,
                            "response": "Exactly.. The mainstream media doesn't reflect the actual people concerns and a climate change is not on most people list of worries",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8n821f",
                            "author": "prototype__",
                            "score": 1,
                            "created_utc": 1652577946.0,
                            "response": "Yep. If it was, ETH and Bitcoin would have been dropped some time ago.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8nff9a",
                            "author": "johnfromberkeley",
                            "score": 1,
                            "created_utc": 1652581786.0,
                            "response": "You may be alluding to other factors, but sticking with “energy” for a moment, it’s not the ethical issue of consumption, but the gas fees. There are plenty of people who wouldn’t care that they’re destroying the environment if it was cheap.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8ocx65",
                            "author": "jlevy1126",
                            "score": 1,
                            "created_utc": 1652605296.0,
                            "response": "It is for me. It's why eth isn't my #1.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8me56m",
                            "author": "-MartinKeamy-",
                            "score": -1,
                            "created_utc": 1652563452.0,
                            "response": "Lol. No shit.  Let him yack",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8nix54",
                            "author": "user260421",
                            "score": 0,
                            "created_utc": 1652583687.0,
                            "response": "From my humble knowledge on big companies I know that one of their purposes is to have as many licenses as possible. The one that everyone wants to get is the eco-friendly \"badge\" - I'm sure there are some companies that considered Ethereum, but then had second thoughts because of this.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8nlnwv",
                            "author": "pokemonisok",
                            "score": 0,
                            "created_utc": 1652585241.0,
                            "response": "It is. Besides being eco friendly is just good policy and good for the earth",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8lzi7f",
                    "author": "steevo",
                    "score": 9,
                    "created_utc": 1652556680.0,
                    "response": "When will this happen? Hearing about this since 2 years",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8pk02p",
                            "author": "alabamaCupcakeTeam",
                            "score": 1,
                            "created_utc": 1652631006.0,
                            "response": "Exactly lol, this is nothing new, honestly I’ll believe it when I see at this rate",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8ltn8h",
                    "author": "OrigamiMax",
                    "score": 39,
                    "created_utc": 1652553938.0,
                    "response": "If you think energy consumption is what’s stopping the average person on the street from adopting ethereum, I’ve got a bridge right over here to sell you",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8mc6ty",
                            "author": "PrawnTyas",
                            "score": 5,
                            "created_utc": 1652562547.0,
                            "response": "Agreed, people think NFT’s are bad for the environment. Most of those have no idea what Ethereum is.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8njp7t",
                            "author": "lorenzomofo",
                            "score": 2,
                            "created_utc": 1652584121.0,
                            "response": "But unfortunately it's the most talked about barrier and the one which non-technical people can understand and sympathize with.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8pe7vx",
                                    "author": "80percentofme",
                                    "score": 1,
                                    "created_utc": 1652628457.0,
                                    "response": "I’m a non-technical person and don’t care about energy consumption.  I wonder why it’s WAY more expensive to buy than stocks and if it will vanish or be stolen from me with no recourse.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8rfng1",
                                            "author": "dwdwfeefwffffwef",
                                            "score": 1,
                                            "created_utc": 1652661464.0,
                                            "response": "Maybe you. But there is definitely a sizeable chunk of people who care a lot about energy consumption.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8mtq90",
                    "author": "GeneticsGuy",
                    "score": 5,
                    "created_utc": 1652570721.0,
                    "response": "The main barrier of entry is that you can accidentally lose all of your money easily. The biggest barrier of entry is the fact that  you can have a small clerical error with 1 number off and wire away the funda and have them gone forever.\n\nCrypto's barrier for entry has little to do with energy costs, imo.\n\nI get the point here, but this only solves the 1 social complaint about eco waste of crypto, nothing else. The mainstream not only won't care, they might not even be aware of the nature of mining.\n\nCrypto needs to be as easy as sending money to each other as services like Venmo and Zelle, without fear you might accidentally lose all your money. That's when madd market can happen. If it was that easy, people wouldn't care about the energy costs.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ltyjp",
                    "author": "Shaitan87",
                    "score": 18,
                    "created_utc": 1652554084.0,
                    "response": "It will solve some of the loudest fud at least, though I imagine the haters will just move on to a different aspect they don't like.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8lwsnp",
                            "author": "FaceDeer",
                            "score": -2,
                            "created_utc": 1652555401.0,
                            "response": "If they move on to other cryptos then that's a benefit for Ethereum.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8n3jzn",
                                    "author": "bluehoneydew",
                                    "score": 3,
                                    "created_utc": 1652575601.0,
                                    "response": "You completely missed the point",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8n5ot2",
                                            "author": "FaceDeer",
                                            "score": 1,
                                            "created_utc": 1652576707.0,
                                            "response": "In what way? If haters who have been griping about Ethereum's power consumption switch to griping about Bitcoin's power consumption, that gets them off Ethereum's case. It's good for Ethereum.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8lc5z8",
                    "author": "homrqt",
                    "score": 51,
                    "created_utc": 1652545998.0,
                    "response": "And the gas fees? That has certainly hindered adoption as well.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8llrxg",
                            "author": "pyr0phelia",
                            "score": 12,
                            "created_utc": 1652550357.0,
                            "response": "POS will do very little, if anything, to reduce the gas fees.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8lnb10",
                                    "author": "Dry-Hurry-7598",
                                    "score": 3,
                                    "created_utc": 1652551048.0,
                                    "response": "If it’s taking this long to merge then I wonder how long sharding will take to come",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8lv65t",
                                            "author": "frank__costello",
                                            "score": 7,
                                            "created_utc": 1652554642.0,
                                            "response": "Executable sharding has been removed from the roadmap, replaced by data availability sharding, which will make L2s orders-of-magnitude cheaper",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8n9ys6",
                                                    "author": "eugay",
                                                    "score": 2,
                                                    "created_utc": 1652578958.0,
                                                    "response": "The original goal was 64 shards. I recall the new target number being  much lower. This would mean the capacity would increase at most 64x, but will realistically be much more modest. Maybe an order of magnitude.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8nblo6",
                                                            "author": "domotheus",
                                                            "score": 3,
                                                            "created_utc": 1652579785.0,
                                                            "response": "But again, those shards won't provide *execution*, just *data*. If you insist on continuing to do your swaps on Layer 1, you will still pay high fees from that main execution chain being just as congested as today if not more.\n\nRollups on the other hand will be able to use the cheap data provided by layer 1 to securely batch transactions for very little costs, spread out over many many users. So individual users on L2 will get to pay very little fees (like a hundredth of a penny kind of cheap) while still getting L1's underlying security guarantees.\n\nAnd getting slightly pedantic here, it's not really about *shards* anyone, in that the idea of \"several blockchains running in parallel\" isn't accurate anymore. It's just the one blockchain with data blobs that only a subset of validators have to store and provide, with data availability sampling keeping them in check to make sure the data is truly available. This simplifies the design massively.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i8ni14n",
                                                    "author": "lorenzomofo",
                                                    "score": 1,
                                                    "created_utc": 1652583196.0,
                                                    "response": "Does that mean they are starting all over again which will push out the roadmap even more?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8nqpeb",
                                                            "author": "jcm2606",
                                                            "score": 1,
                                                            "created_utc": 1652588234.0,
                                                            "response": "As far as I know, the roadmap is currently about as long as it would have been with execution sharding. They did have to throw out the old execution sharding plan and start over again, but the new data availability sharding is, comparatively, a *much* simpler plan that won't take as long in absolute terms.\n\nData availability sharding is currently planned to roll out in two phases: proto-danksharding and danksharding.\n\nProto-danksharding basically gets the \"front end\" of the new data availability sharding model implemented, but will use the beacon chain (the PoS consensus chain) as the \"back end\", rather than actual shards. This should allow L2s to get themselves ready for when the actual shards come online, and should help partially reduce their operating costs and by extension user fees, but it won't be as big of a reduction, as shards haven't actually come online yet.\n\nDanksharding will keep the \"front end\" introduced by proto-danksharding, but will replace the \"back end\" of proto-danksharding with actual shards, bringing the massive L2 operating cost and user fee reduction in, without needing L2s to do much to support it.\n\nThey're currently looking at launching proto-danksharding with the Shanghai hard fork (the next upgrade following the merge, which should be around 6-12 months after), but it may be pushed back if something prevents it from launching. Danksharding isn't expected to launch until a year or more following the merge, as they're still doing some research on how to best implement and launch it.",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "i8p5yi4",
                                                            "author": "frank__costello",
                                                            "score": 1,
                                                            "created_utc": 1652624675.0,
                                                            "response": "Nope, data sharding builds upon the existing sharding research, but is much simpler.\n\nIf anything, it should accelerate things.\n\nAlso, the roadmap change happened almost 2 years ago, this isn't anything new",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i8lv7v1",
                                            "author": "frank__costello",
                                            "score": 2,
                                            "created_utc": 1652554664.0,
                                            "response": "Executable sharding has been removed from the roadmap, replaced by data availability sharding, which will make L2s orders-of-magnitude cheaper",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8lon9u",
                            "author": "lostharbor",
                            "score": 4,
                            "created_utc": 1652551652.0,
                            "response": "layer 2 solves that",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8lcrn2",
                            "author": "pihip2",
                            "score": 39,
                            "created_utc": 1652546261.0,
                            "response": "I actually addressed that in the post...  \nAs I said, L2s are taking care of that plus sharding is on the way. It's a process",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8ln7g4",
                                    "author": "Dry-Hurry-7598",
                                    "score": 5,
                                    "created_utc": 1652551003.0,
                                    "response": "Is on the way is a big understatement like a 7 year understatement",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8nl02z",
                                    "author": "Marc4770",
                                    "score": 3,
                                    "created_utc": 1652584859.0,
                                    "response": "it cost me too much to transfer to L2",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8ld2nq",
                                    "author": "homrqt",
                                    "score": 15,
                                    "created_utc": 1652546400.0,
                                    "response": "Sorry, I meant that the gas fees will have to come down first. The energy efficiencies alone will not allow mass mainstream adoption.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8ln4id",
                                            "author": "TenBillionDollHairs",
                                            "score": 6,
                                            "created_utc": 1652550965.0,
                                            "response": "Mainstream won't use L1. Mainstream will use L2, so even if L1 gas fees remain high (which they should because there's a lot of demand), they don't notice because they are only paying for their tiny share of the L1 fees. \n\nL1 will have high fees, but it will be processing exponentially greater volumes of business on those same fees. User fees will decrease, but you want L1 fees to be high so people run nodes and so people can't clog or attack the network.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i8lv1mv",
                                            "author": "frank__costello",
                                            "score": 5,
                                            "created_utc": 1652554583.0,
                                            "response": "L1 gas fees will never come down, L2 is the future (and the present) for cheap transactions",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i8lk98z",
                                            "author": "DavidKens",
                                            "score": 8,
                                            "created_utc": 1652549662.0,
                                            "response": "Why does L1 gas matter for L2s?\n\nIn a mass adoption scenario CEXes have liquidity on L2s",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8ln9xs",
                                                    "author": "OTK22",
                                                    "score": 5,
                                                    "created_utc": 1652551034.0,
                                                    "response": "We need DEX’s, not CEX’s for mass adoption. Time and time again CEX’s have let their users down during bank runs. This delays mass adoption because it increase fear of system failure for the average person who doesn’t really understand the difference",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8lnl8d",
                                                            "author": "DavidKens",
                                                            "score": 6,
                                                            "created_utc": 1652551181.0,
                                                            "response": "I mean - we obviously need both CEXes and DEXes. \n\nMy point was that the on ramp to L2 does not require L1. The masses will be able to use their fiat to buy L2 tokens directly.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8lnu8a",
                                                                    "author": "OTK22",
                                                                    "score": 2,
                                                                    "created_utc": 1652551292.0,
                                                                    "response": "What advantage does a centralized exchange have over a decentralized or non custodial exchange? Fractional reserve banking practices for the sake of liquidity? Not your keys, not your coins",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i8lnzv6",
                                                                            "author": "DavidKens",
                                                                            "score": 6,
                                                                            "created_utc": 1652551361.0,
                                                                            "response": "The advantage is accepting fiat. Is there a DEX that accepts fiat?\n\nAre you arguing that the road to mass adoption does not include fiat on ramps?",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i8lo1zj",
                                                                                    "author": "OTK22",
                                                                                    "score": 1,
                                                                                    "created_utc": 1652551389.0,
                                                                                    "response": "Checkout Loopring wallet. Has two different on-ramps for its non-custodial wallet. It’s still in beta but the off-ramp is in progress. Oh yea and they also have similar gas fees on their L2 to polygon, but instead of optimistic roll ups, they use zero knowledge proofs",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i8lojyb",
                                                                                            "author": "DavidKens",
                                                                                            "score": 4,
                                                                                            "created_utc": 1652551611.0,
                                                                                            "response": "This is a silly game of semantics. This is not a DEX. This on ramp is not trustless.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i8m86ab",
                                                    "author": "Thin-Course-4054",
                                                    "score": 1,
                                                    "created_utc": 1652560697.0,
                                                    "response": "in a mass adoption scenario regular joes also use DEX's",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8m8dhq",
                                                            "author": "DavidKens",
                                                            "score": 1,
                                                            "created_utc": 1652560792.0,
                                                            "response": "Sure, if they’re already on L2. If not, they can buy L2 tokens with fiat. Either way, why worry about L1 gas fees?",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8m94by",
                                                                    "author": "Thin-Course-4054",
                                                                    "score": 1,
                                                                    "created_utc": 1652561129.0,
                                                                    "response": "They don't need to buy L1 tokens at all. Holding ETH would be an investment only and have zero utility for regular joes. (kind of like its current state)",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i8nl9e5",
                                                    "author": "Marc4770",
                                                    "score": 1,
                                                    "created_utc": 1652585009.0,
                                                    "response": "I haven't found a cex that can give me matic token on the polygon network",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8ouloy",
                                                            "author": "DavidKens",
                                                            "score": 1,
                                                            "created_utc": 1652618751.0,
                                                            "response": "Try Kucoin",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8p2olj",
                                                                    "author": "Marc4770",
                                                                    "score": 1,
                                                                    "created_utc": 1652623102.0,
                                                                    "response": "Kukoin is in Seychelles and I already got scammed by poloniex that didn't credit a deposit and stole my money .\nWas hoping for a more regulated exchange like kraken or coinbase",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i8p3jov",
                                                                            "author": "DavidKens",
                                                                            "score": 2,
                                                                            "created_utc": 1652623516.0,
                                                                            "response": "I think FTX might? I think they power the Exodus wallet trading, which does support it.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i8ldtf4",
                                            "author": "pihip2",
                                            "score": 5,
                                            "created_utc": 1652546726.0,
                                            "response": "Oh okay. yeah, I get you but as I said it's all a process and we're already on the right path. The merge is a necessary part",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8lj0q1",
                                                    "author": "Zellenial",
                                                    "score": -18,
                                                    "created_utc": 1652549097.0,
                                                    "response": "These are all bandaids. They can’t fix throughout that’s the real  bottle neck",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8lkuet",
                                                            "author": "Hanzburger",
                                                            "score": 12,
                                                            "created_utc": 1652549934.0,
                                                            "response": "L2 + sharding is a bandaid?",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8loov5",
                                                                    "author": "Zellenial",
                                                                    "score": -18,
                                                                    "created_utc": 1652551671.0,
                                                                    "response": "Yep it still doesn’t fix throughput which is the crux of ethereum",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i8lsft3",
                                                                            "author": "espresso_chain",
                                                                            "score": 13,
                                                                            "created_utc": 1652553394.0,
                                                                            "response": "then you have no idea what L2+sharding is",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        },
                                                                        {
                                                                            "id": "i8nfg9a",
                                                                            "author": "gcsabbagh",
                                                                            "score": 1,
                                                                            "created_utc": 1652581802.0,
                                                                            "response": "Of course it does. If you can batch thousands of transactions together into a single layer 1 tx then you effectively multiply your throughput by the thousands.\n\nIt's only gonna get better, and eventually if we get transaction sharding in the future, then that's another order of magnitude increase in throughput",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i8mjlss",
                                    "author": "iamiamwhoami",
                                    "score": 1,
                                    "created_utc": 1652565982.0,
                                    "response": "There’s no L2 solution that brings transaction costs down to be negligible. \n\nFor example I’m working on an NFT app. The best Ethereum solution I found for minting was LoopRing. With that minting an NFT costs about $3. That’s too much $ to support any sort of micro transaction. The cost needs to be on the order of pennies. \n\nI’m thinking about using solana for this reason.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8n77rz",
                                            "author": "Giga79",
                                            "score": 2,
                                            "created_utc": 1652577508.0,
                                            "response": "Look into Danksharding and [EIP4844](https://www.eip4844.com/) aka Proto-Danksharding. Either of these solutions will bring L2 fees down drastically..\n\nThere are even more upgrades on the roadmap poised to happen around the merge that further help L2's out. When LRC has a Zkevm for example you should be able to mint an NFT a lot cheaper on their chain.\n\nIt is going to be a Rollup Centric Ethereum but it can't be without helping the rollups first, which hasn't begun yet.\n\nIf you do want to use Solana just check out their status page or status-Twitter account to see their uptime, lately the joke is they only run during bank hours. I think there are better chains (even matic) to trust your assets with but that's just my opinion. Solana is cheap for a reason, to pay back VCs. The last time it crashed all dozen node operators (in Discord) talked about censoring the NFT project that crashed the network - and you had the dev on Twitter begging them to not turn off their business. It's a novel chain that's for sure.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8nga1b",
                                                    "author": "lorenzomofo",
                                                    "score": 2,
                                                    "created_utc": 1652582243.0,
                                                    "response": ">Look into Danksharding and EIP4844 aka Proto-Danksharding. Either of these solutions will bring L2 fees down drastically..  \n>  \n>There are even more upgrades on the roadmap poised to happen around the merge that further help L2's out. When LRC has a Zkevm for example you should be able to mint an NFT a lot cheaper on their chain.\n\nBut when will it be available to the masses?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8oh7mz",
                                                            "author": "Giga79",
                                                            "score": 1,
                                                            "created_utc": 1652609014.0,
                                                            "response": "Danksharding is expected to be implemented in the next 18-24 months and EIP4844 hopefully 6 months after the merge. 4844 offers about half as much scaling as complete sharding will, *so much* that even if sharding *never* happens it doesn't really matter.\n\nDanksharding will use 4844 as its standard also so when that comes our apps and L2's won't have to change a thing, that will make it sharding way more seamless and easy to implement.\n\n6 months *ETH time* but it seems quite far along already, unless there are any unseen hiccups along the way I think they'll have no problems with it.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i8lyahk",
                                    "author": "IAMAdot2",
                                    "score": 1,
                                    "created_utc": 1652556103.0,
                                    "response": "I think people are overly hopeful that sharding is going to happen soon. It is very much in its infancy. As we've seen in the crypto space, things take a longggg time. Sharding when? 5 years?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8lgkg2",
                            "author": "OtherDetective",
                            "score": 5,
                            "created_utc": 1652547975.0,
                            "response": "They will go down slightly after merge and drop drastically after sharding.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8lvgz5",
                                    "author": "frank__costello",
                                    "score": 7,
                                    "created_utc": 1652554785.0,
                                    "response": "> They will go down slightly after merge\n\nThe increase in throughput will be so small, it won't be noticeable\n\nLet's not give people false hope\n\n> and drop drastically after sharding\n\nData sharding will make L2s cheaper, but won't affect L1 fees",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8lwix2",
                                            "author": "OtherDetective",
                                            "score": -1,
                                            "created_utc": 1652555274.0,
                                            "response": "Sharing will be in L1",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8m2tqf",
                                                    "author": "KlopKlop10293",
                                                    "score": 7,
                                                    "created_utc": 1652558238.0,
                                                    "response": "it’s just to make l2 cheaper",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8m5fb4",
                                                            "author": "OtherDetective",
                                                            "score": 3,
                                                            "created_utc": 1652559429.0,
                                                            "response": "Oh heh I didn’t know that",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i8m31e6",
                                                    "author": "frank__costello",
                                                    "score": 2,
                                                    "created_utc": 1652558335.0,
                                                    "response": "https://ethereum.org/en/upgrades/shard-chains/\n\n> Shard chains provide extra, cheaper, storage layers for applications and rollups to store data.  \n> They enable layer 2 solutions to offer low transaction fees while leveraging the security of Ethereum.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8m3sji",
                                                            "author": "OtherDetective",
                                                            "score": 1,
                                                            "created_utc": 1652558679.0,
                                                            "response": "It won’t affect L1 at all?",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8m9cq1",
                                                                    "author": "frank__costello",
                                                                    "score": 3,
                                                                    "created_utc": 1652561239.0,
                                                                    "response": "Nope\n\nBut it won't matter, in the future, 95% of users will never need to touch L1. L2 will be fast, cheap, and have all the apps you want to use.\n\nArbitrum already has a pretty solid ecosystem, and Optimism's OP token launch will attract a ton of usage to their ecosystem.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i8ma78s",
                                                                            "author": "OtherDetective",
                                                                            "score": 2,
                                                                            "created_utc": 1652561631.0,
                                                                            "response": "Super interesting. So there one will be mainly a security layer and everything will be built on top of that? What would a layer three look like?",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i8mbk9p",
                                                                                    "author": "frank__costello",
                                                                                    "score": 3,
                                                                                    "created_utc": 1652562261.0,
                                                                                    "response": "Security, settlement, and core application-level infrastructure.\n\nL3 could be a number of things, the Starkware team has already discussed L3s on top of Starknet that are other chains with increased throughput and lower fees. There's also things like state-channels that can be implemented on top of L2",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i8mbqw3",
                                                                                            "author": "OtherDetective",
                                                                                            "score": 1,
                                                                                            "created_utc": 1652562341.0,
                                                                                            "response": "Interesting. I need to catch up lol. 🙏",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "id": "i8maw3p",
                                                                            "author": "OtherDetective",
                                                                            "score": 1,
                                                                            "created_utc": 1652561955.0,
                                                                            "response": "I’m watching https://m.youtube.com/watch?v=N5p0TB77flM and they said what you said. You smart.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i8mbl68",
                                                                                    "author": "frank__costello",
                                                                                    "score": 2,
                                                                                    "created_utc": 1652562272.0,
                                                                                    "response": "Gracias amigo!",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "id": "i8njgp8",
                                                                            "author": "lorenzomofo",
                                                                            "score": 1,
                                                                            "created_utc": 1652583986.0,
                                                                            "response": "How about the legacy apps and NFTs still on L1? Will these automatically be accessible on all L2s?\n\nIf I send someone funds on one L2 and they have a wallet on another L2, how would they get it or does one have to switch L2 networks to get it?",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i8nr1ai",
                                                                                    "author": "jcm2606",
                                                                                    "score": 1,
                                                                                    "created_utc": 1652588437.0,
                                                                                    "response": "There have been a few methods proposed for allowing L2 users/contracts to interact with L1 users/contracts by basically using the L2 operator(s) as mediators, but these aren't feasible with optimistic rollups and ZK rollups currently don't support the EVM (outside of testnets), so there hasn't been much work done on these, beyond the theory.",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                },
                                                                                {
                                                                                    "id": "i8p5v4c",
                                                                                    "author": "frank__costello",
                                                                                    "score": 1,
                                                                                    "created_utc": 1652624631.0,
                                                                                    "response": "> How about the legacy apps and NFTs still on L1? Will these automatically be accessible on all L2s?\n\nApps, no, they'll need to be re-deployed on L2\n\nBut it's pretty simple to bridge an NFT to L2\n\n> If I send someone funds on one L2 and they have a wallet on another L2, how would they get it or does one have to switch L2 networks to get it?\n\nRight now, yes they'd need to switch networks.\n\nBut I expect the L2 UX to get a lot better over time. Eventually, users won't even know which L2 their funds are on or which L2 they're interacting with",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8lu6jm",
                    "author": "esotericunicornz",
                    "score": 3,
                    "created_utc": 1652554184.0,
                    "response": "Low energy consumption does nothing to guarantee mass adoption 🧐",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8m0vv4",
                    "author": "combocookie",
                    "score": 3,
                    "created_utc": 1652557325.0,
                    "response": "False, the first killer dapps and low gas fees through danksharding will trigger mass adaption",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8lim3t",
                    "author": "Boxman212",
                    "score": 11,
                    "created_utc": 1652548912.0,
                    "response": "The digital USD does pretty well.  Also I have a layer 2 protection  (if you will) in the form of what they call an American express card.  If I say ANYTHING is fraud they refund me.  Also I have what is called FDIC insurance with my bank and that helps too.  Oh yeah best of all I never have any transaction fees or failed transaction fees.  Also USD is pretty damn stable.  You should check it out.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8n2shd",
                            "author": "never_safe_for_life",
                            "score": 3,
                            "created_utc": 1652575223.0,
                            "response": "Amex charges merchants 3% and they pass that cost on to you. Strike is building the same service on the lightning network but only charging 0.1%. That’s 2.9% back in your pocket.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8n349r",
                                    "author": "Boxman212",
                                    "score": 5,
                                    "created_utc": 1652575383.0,
                                    "response": "Well I guess you win.  Well unless the ETH price winterizes.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8n3nwt",
                                            "author": "never_safe_for_life",
                                            "score": 1,
                                            "created_utc": 1652575658.0,
                                            "response": "Do I win? I don’t think so, there are a lot of problems that need to be solved. Chargebacks are important and that needs to be built. Federal insurance is important and that’s likely years away. Price stability is important, that comes with time but not until we exhaust the adoption curve. \n\nBut I think the fact that it’s cheaper to transact on (certain) blockchains is a killer feature. It’s enough to give them serious consideration. Heck, we know Visa is building on Ethereum. I think they see the writing on the wall.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8n4tkf",
                                                    "author": "Boxman212",
                                                    "score": 0,
                                                    "created_utc": 1652576260.0,
                                                    "response": "The real problem honestly will be the SEC.  Just watch.  They will not class cyrpto as an asset.  They gone screw it all up just wait.  No one is over them on this.  They will say it is all securities and arrest some Coinbase people etc.  Just wait.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8n5i4r",
                                                            "author": "never_safe_for_life",
                                                            "score": 1,
                                                            "created_utc": 1652576612.0,
                                                            "response": "Well I certainly understand the distrust of government. But the head of the SEC Gary Gensler, the Secretary of the Treasury Janet Yellen, and the president of the United States have all come out on the side of cryptocurrencies. Every government agency is currently tasked with developing legislation to make them safe for US citizens. The government sees the massive potential of the technology and is afraid to be left behind. Just wait, in a years time Gensler will approve a spot bitcoin ETF. More and more senators will be fighting for better crypto legislation in an attempt to bring in more jobs for their constituents.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8ll9j1",
                            "author": "Hanzburger",
                            "score": 1,
                            "created_utc": 1652550125.0,
                            "response": "Has FDIC insurance ever been tested? It's also only up to $250k and that number hasn't been updated in 20 years",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8lomv0",
                                    "author": "Boxman212",
                                    "score": 5,
                                    "created_utc": 1652551646.0,
                                    "response": "It is that much per bank per reg account.  You can get a larger deposit with a larger FDIC amount.  Also if you are married you get 500k.  P.S. I have mine spread over about 10 banks and the rest is in paid for real estate.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8lwt9t",
                                            "author": "Hanzburger",
                                            "score": -1,
                                            "created_utc": 1652555409.0,
                                            "response": "I have a hard time believing that they would actually insure, which is why I'm asking if this has been tested on a large scale in the past.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8lx5nt",
                                                    "author": "Boxman212",
                                                    "score": 7,
                                                    "created_utc": 1652555573.0,
                                                    "response": "You can't be serious.....right?  As long as the USD stays the global currency it just doesn't matter how much they print really.  Now if that changes we are all 3rd world country screwed.  P.S. they are in the process of tightening / reducing our money supply.  That is why everything is going to go to shit for the next 15 yrs or so.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i8nf92x",
                                                    "author": "this_place_stinks",
                                                    "score": 3,
                                                    "created_utc": 1652581695.0,
                                                    "response": "Yes there have been bank failures in the billions of dollars.  Depositors are made whole",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i8mtnjm",
                                    "author": "Darius510",
                                    "score": 2,
                                    "created_utc": 1652570685.0,
                                    "response": "The fact that you can’t even think of an instance where it’s been tested is kind of the point",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8n2oye",
                                            "author": "Hanzburger",
                                            "score": 0,
                                            "created_utc": 1652575175.0,
                                            "response": "Sooooooo has it?",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i8lnfsv",
                                    "author": "Dry-Hurry-7598",
                                    "score": 1,
                                    "created_utc": 1652551110.0,
                                    "response": "Why does it need to be tested it’s not like anyone can stop them printing",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8loudb",
                                            "author": "Boxman212",
                                            "score": 1,
                                            "created_utc": 1652551743.0,
                                            "response": "Nope that is what is so cool.  We have the global currency.  Now Tether printing.  That is stopping.  SEC will make sure of it.  P.S. look at their market cap.  They just burned 7 billion of their fake money.  I wonder what will happen when a real audit from the SEC happens.  Any guesses?",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i8lwn2t",
                                            "author": "Hanzburger",
                                            "score": 0,
                                            "created_utc": 1652555328.0,
                                            "response": "Because it could not actually be insured",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i8peudu",
                                    "author": "80percentofme",
                                    "score": 1,
                                    "created_utc": 1652628741.0,
                                    "response": "When the banks crashed in 2008, I wrote checks on my Washington Mutual (which was bankrupt) checkbook for about 2 years.  Worked then!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8m6355",
                    "author": "StreeterGM",
                    "score": 2,
                    "created_utc": 1652559729.0,
                    "response": "Scaling I think is the biggest obstacle for mass adoption but the narrative of it being a green Blockchain certainly helps getting mass adoption.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8mtxjc",
                            "author": "Darius510",
                            "score": 1,
                            "created_utc": 1652570817.0,
                            "response": "Doubt it. It’s not like anything more interesting is happening on more scalable blockchains. Still just jpegs and shitcoins all the way down.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8mhvcn",
                    "author": "n8dahwgg",
                    "score": 2,
                    "created_utc": 1652565177.0,
                    "response": "What’s funny is you think energy consumption is correlated to scaling and adoption.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8mrzcr",
                    "author": "Lifeofahero",
                    "score": 2,
                    "created_utc": 1652569894.0,
                    "response": "The merge is just part of Ethereum’s upgrade process. More importantly is sharding, which reduces data availability for layer 2 rollups and will usher Ethereum into a similar competitive status as Solana & Avalanche with regards to fees. Optimistic rollups still cost around $1 today.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8mxqvd",
                    "author": "Salt_Adhesiveness161",
                    "score": 2,
                    "created_utc": 1652572671.0,
                    "response": "I think what most misunderstand about the merge is they think its going to bring transaction cost down (gas).  Its not at all.  People will still get pissed off at the insane tx fees just like before.  As for \"Eco friendly\", its buzz word bullshit.  Nobody cares really.  People care how much money they will lose trying to transfer funds or communicate with a smart contract.   \nMass adoption will come when users of the chain don't even have to think about transaction costs as its so nominal. Until Ethereum can do that, it will not reach full mainstream adoption.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8nio4n",
                    "author": "user260421",
                    "score": 2,
                    "created_utc": 1652583552.0,
                    "response": "The merge is totally underestimated and some uninformed or misinformed people think only about the gas fees going down and think that this is what the merge is supposed to do. I expect them to complain before, during and after the merge. Also blame someone else for their misinformation and wrong expectations.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8m0te1",
                    "author": "TrymWS",
                    "score": 6,
                    "created_utc": 1652557294.0,
                    "response": "Energy consumption is not the problem with eco-friendlyness, that’s just a marketing tactic and diversion from the real culprits, the fossil fuel industry burning coal and gas for electricity and heat. Oil for cars, etc.\n\nWe don’t demand fossil fuels, we demand energy and transportation. It can be clean, and we can use orders of magnitude more energy with clean energy.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8nljzm",
                            "author": "raphanum",
                            "score": 2,
                            "created_utc": 1652585177.0,
                            "response": "So, it’s not crypto’s fault for using fossil fuel energy, it’s the energy suppliers fault for supplying it?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8ong8b",
                                    "author": "TrymWS",
                                    "score": 1,
                                    "created_utc": 1652614103.0,
                                    "response": "Yes. Crypto does not demand electricity made from a certain source, it just demands electricity.\n\nWe have technology for nuclear and renewables, and long term nuclear is even the cheapest electricity.\n\nIt’s just producers not willing to take the upfront cost, and government not willing to focus on it.\n\nPlenty of places don’t have a choice where their power comes from.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8o4h05",
                            "author": "sven_adams",
                            "score": -1,
                            "created_utc": 1652598120.0,
                            "response": "Why is coal and oil considered dirty? They are literally natural resources",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8onvnc",
                                    "author": "TrymWS",
                                    "score": 1,
                                    "created_utc": 1652614419.0,
                                    "response": "Why? Do you live under a rock?\n\nCoal has 68x the emissions per kWh compared to nuclear, and is with oil a main reason for climate change.\n\n“Natural” doesn’t mean jack shit about being good, what kinda argument is that?\n\nhttps://www.world-nuclear.org/information-library/energy-and-the-environment/carbon-dioxide-emissions-from-electricity.aspx",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8p2dx5",
                                    "author": "DarkChocolatRaisinet",
                                    "score": 1,
                                    "created_utc": 1652622954.0,
                                    "response": "Is this an honest question? Like I don't want to waste my time if you're just fucking around, but if you're honestly asking...\n\nIt has to do with the *burning* of these resources for fuel and the amount of greenhouse gasses that are produced in those reactions (mainly carbon dioxide and methane).\n\nLearn some new stuff, it'll feel good! (and then it'll fill you with existential dread when you realize we're all going to die)\n\nhttps://en.wikipedia.org/wiki/Greenhouse_effect\n\nhttps://en.wikipedia.org/wiki/Greenhouse_gas\n\nhttps://en.wikipedia.org/wiki/Climate_change\n\n**Edit:** That's what I get for giving someone the benefit of the doubt on reddit. \n\n>Do you know why in college i was not allowed to use wikipedia as a source?\n\n\nOh shit never heard that one.... I guess I didn't realize I was writing a formal essay for you, you disingenuous piece of shit. Seems like *someone's* never heard of the \"References\" section (and as a side note for any onlookers, take a look at the shear **size** of the \"References\" section on the Climate Change wiki page. I challenge anyone to show me a page with more evidence than that. It's fucking massive).\n\nDon't want to accidentally actually learn something right?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8p7xok",
                                            "author": "sven_adams",
                                            "score": 0,
                                            "created_utc": 1652625601.0,
                                            "response": "Do you know why in college i was not allowed to use wikipedia as a source?\n\nOn-topic: The amount of greenhouse gasses created from coal and oil is low when you factor in the amount of energy it produces. By the time you have built enough solar panels, windmills and batteries to produce as much reliable energy as coal and oil you have emitted MORE greenhouse gasses than if you would have just used coal and oil directly",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8qmg29",
                                                    "author": "Cthulhooo",
                                                    "score": 2,
                                                    "created_utc": 1652647835.0,
                                                    "response": "Wow, good point. If only some credible institution calculated life-cycle greenhouse gas emissions of various energy sources and compiled their emissions per kWh. That rigorous enough?\n\nhttps://www.ipcc.ch/site/assets/uploads/2018/02/ipcc_wg3_ar5_annex-iii.pdf#page=7",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8r4hun",
                                                            "author": "DarkChocolatRaisinet",
                                                            "score": 1,
                                                            "created_utc": 1652655966.0,
                                                            "response": "Yeah don't waste your time like I did. They acted like they actually cared to  learn something. They're full of shit.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i8r44fn",
                                                    "author": "DarkChocolatRaisinet",
                                                    "score": 1,
                                                    "created_utc": 1652655785.0,
                                                    "response": "Oh so you're just a lying asshole and you weren't actually trying to learn something. Silly me.\n\n>Do you know why in college i was not allowed to use wikipedia as a source?\n\nOh wow so clever. Never heard that one. You have me **dead to rights**. That, or maybe...\n\nWikipedia is a place that brings all sorts of sources together in an easy place. I  wasn't writing a fucking research paper, I was trying to inform someone that I thought was genuinely interested in learning something.\n\nIf I were to write a fucking essay about it, what I would do is what I always did in college: **scroll down to the \"References\" section** of the wiki page and find the **primary sources** that are being cited for every argument and statement made on that wiki page. Becuase that's how Wikipedia works. Stop repeating boomer talking points when someone shows you something you don't like.\n\nAnd this is literally the longest list of sources I have ever seen on a wiki page... weird how that works isn't it? Almost like it's the most widely studied topic in the history of science:\n\nhttps://en.wikipedia.org/wiki/Climate_change#References\n\nImagine denying the existence of climate change, in 2022, and your argument is \"lol you tried to use Wikipedia as a source\". Clown.\n\nThat's what I get for giving someone the benefit of the doubt on reddit.\n\nFuck you.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8mke59",
                    "author": "HeadMembership",
                    "score": 2,
                    "created_utc": 1652566355.0,
                    "response": "The whole \"energy consumption\" is a bullshit red-herring. \n\nElon Musk manipulated the Bitcoin market to stack his BTC bags with the whole story.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8lhwxz",
                    "author": "LuisNaldo7",
                    "score": 0,
                    "created_utc": 1652548596.0,
                    "response": "TBH for me as a user lower energy consumption has zero benefit.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8lmdjg",
                            "author": "bobby_zamora",
                            "score": 15,
                            "created_utc": 1652550624.0,
                            "response": "But as a human who lives on the planet it has a lot of benefit.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8o7ei4",
                                    "author": "LuisNaldo7",
                                    "score": 2,
                                    "created_utc": 1652600572.0,
                                    "response": "Sure. I just thought about me sending a transaction. PoW or PoS, it won’t be different.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8llnct",
                            "author": "sadwetsoap",
                            "score": 20,
                            "created_utc": 1652550298.0,
                            "response": "Do you live on Mars?",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8lkz8s",
                            "author": "Hanzburger",
                            "score": 15,
                            "created_utc": 1652549997.0,
                            "response": "But it matters for industry adoption, which trickles down to consumer adoption",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8lwp1p",
                                    "author": "FaceDeer",
                                    "score": 2,
                                    "created_utc": 1652555354.0,
                                    "response": "And it means miners don't have huge fixed costs, meaning they don't need to be paid nearly as much. Lots of people obsess over issuance, this will help a lot with reducing that.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8ltixc",
                    "author": "Misfit_Sally",
                    "score": 0,
                    "created_utc": 1652553881.0,
                    "response": "I had put some Ethereum on Metamask to play around with. Trying to swap $50 of Ethereum for Solana and Metamask is seriously wanting over $35 to swap it for me. Its a fucking joke basically trash. Never should of put it in Metamask to begin with.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8lzm3i",
                            "author": "ballsonyah",
                            "score": 3,
                            "created_utc": 1652556731.0,
                            "response": "You are paying for block space on the most in demand network. Cheap fees are what ethereum layer 2’s are for. If your playing around with $50 and thought ethereum layer 1 was where to be you really should take some more time to read and research. Not all blockchains are equal. Low fees on another L1 come with trade offs, namely security.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8lcbk4",
                    "author": "AbbreviationsLevel73",
                    "score": 0,
                    "created_utc": 1652546066.0,
                    "response": "arent L2s just smart contracts ?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8lgopf",
                            "author": "OtherDetective",
                            "score": 8,
                            "created_utc": 1652548030.0,
                            "response": "No.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8nl3ad",
                                    "author": "lorenzomofo",
                                    "score": 1,
                                    "created_utc": 1652584910.0,
                                    "response": "[I like to think of rollups like Arbitrum or zkSync as blockchains within a blockchain- they're basically just smart contracts living in Ethereum. The off-chain rollup network processes transactions quickly and then just posts the results to Ethereum.](https://www.reddit.com/r/ethereum/comments/ugr772/comment/i718dl8/)",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8luk75",
                            "author": "oxyeth",
                            "score": 5,
                            "created_utc": 1652554358.0,
                            "response": "Technically they are. But that’s like saying: “Isn’t a computer just a rock with lightning in it?”",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8lwf2c",
                                    "author": "AbbreviationsLevel73",
                                    "score": -4,
                                    "created_utc": 1652555223.0,
                                    "response": "have you taken a look at dot ? there are actual blockchains working on dot, pft by the time the merge happens dot will be a player, also dot is forkless, see ya",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8lvfew",
                                    "author": "H4y3s_",
                                    "score": 0,
                                    "created_utc": 1652554764.0,
                                    "response": "What’s a laptop?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8lv8d5",
                            "author": "frank__costello",
                            "score": 3,
                            "created_utc": 1652554671.0,
                            "response": "Aren't websites just code?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8mijio",
                    "author": "BlankEris",
                    "score": 1,
                    "created_utc": 1652565493.0,
                    "response": "I think it needs a real world use case before it can be mass adopted. It really has none.. \n\n\nit was worldcomputer, that flopped.\n\nthen it was dapps, that flopped. \n\nthen it was defi, that flopped.\n\nthen it was tripple halving/ultrasound money, that flopped.\n\nthen it's trading jpeg receipts, that flopped.\n\nnow it's on to internet bond/guaranteed interest narrative, that will ???????",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8mu05o",
                            "author": "Darius510",
                            "score": 5,
                            "created_utc": 1652570851.0,
                            "response": "We saw how well that idea worked out with terra/Luna",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8lwlfr",
                    "author": "GhabageMan",
                    "score": 1,
                    "created_utc": 1652555306.0,
                    "response": "Gas fees….",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8od60o",
                            "author": "AESTHTK",
                            "score": 1,
                            "created_utc": 1652605500.0,
                            "response": "http://l2fees.info",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8mgfup",
                    "author": "Mestyo",
                    "score": 1,
                    "created_utc": 1652564509.0,
                    "response": "Decentralization is—and will always be—the primary selling point of crypto. It's an absolutely fantastic quality, but simultaneously very difficult to sell.\n\nThe people who understand the issues it solves are unfortunately also typically people who benefit from the status quo.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ljkkj",
                    "author": "Darius510",
                    "score": -7,
                    "created_utc": 1652549350.0,
                    "response": "Maybe you should come up with a use case first that isn't ape jpegs and shitcoin derivatives",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8lo2xe",
                            "author": "Dry-Hurry-7598",
                            "score": 0,
                            "created_utc": 1652551401.0,
                            "response": "You’re getting downvoted but it’s a serious criticism, even if gas fees become pennies to the average person eth or any crypto is just a new payment method at most, and most of the projects built on any l1 or l2 etc are built for this echo chamber community, such as yield farming, NFTs etc. nothing on any platform right now I’d say my parents would want to use, or care for. Until a real project that actually has utility outside of crypto is made no crypto is being mass adopted and will only be used to make a quick buck",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8luavc",
                                    "author": "oxyeth",
                                    "score": 2,
                                    "created_utc": 1652554238.0,
                                    "response": "Global cooperation tools are extremely valuable and necessary. There are DAO’s that will change the world.\n\nDAO’s bring the tools that we need to combat climate change for example, but any public good can be achieved through DAO’s.\n\nSpeaking of public goods.. Quadratic funding will change the way we can vote with our money. Look at gitcoin grants. Sure, they are mostly focused on funding blockchain related narratives, but that will likely expand to other sectors. For example; Maybe we can finally finance a continuation of firefly..\n\nPasswords will be a thing of the past once wallet tooling improves. Just sign in with ethereum.\n\nTokenization has HUGE potential for things like supply chain tracking, digital ownership, rights management.\n\nThere is tons of things to look forward to, which is the reason why that post is getting downvoted.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8mqebs",
                                            "author": "Darius510",
                                            "score": -1,
                                            "created_utc": 1652569176.0,
                                            "response": "Its been like 7 years, if that was going to happen it would have already happened",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8lf7q8",
                    "author": "Just-Blow-Into-It",
                    "score": -17,
                    "created_utc": 1652547359.0,
                    "response": "Proof of stake is just fiat 2.0 don't be tricked by these shrills",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8ljsj1",
                            "author": "rdogstyle",
                            "score": 6,
                            "created_utc": 1652549450.0,
                            "response": "Care to explain? They are just different ways to establish trust for the block proposer by needing to spend a lot of money. What is more like fiat than pow?",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8lfyly",
                            "author": "ronnyFUT",
                            "score": 4,
                            "created_utc": 1652547699.0,
                            "response": "Says the “FUCK PROOF OF STAKE” guy lol move along clown",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8m5931",
                    "author": "Stiltzkinn",
                    "score": 0,
                    "created_utc": 1652559351.0,
                    "response": "At least this can shut up the anti-crypto naysayers of crypto energy consumption.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8n3yvb",
                            "author": "never_safe_for_life",
                            "score": 1,
                            "created_utc": 1652575813.0,
                            "response": "But they will just conflate all cryptos so the objection won’t go away.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8lvumu",
                    "author": "zerosdontcount",
                    "score": 1,
                    "created_utc": 1652554959.0,
                    "response": "I don't think the scaling solutions make up for sharding in the least. They exist but are not really used by the large players.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8nb7jt",
                    "author": "raelDonaldTrump",
                    "score": 1,
                    "created_utc": 1652579590.0,
                    "response": "Incites, not insights",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8nl16r",
                    "author": "hypokrios",
                    "score": 1,
                    "created_utc": 1652584876.0,
                    "response": "That's a non sequitur",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8nl5nk",
                    "author": "chillinewman",
                    "score": 1,
                    "created_utc": 1652584948.0,
                    "response": "Gas fees more like it",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8nxui3",
                    "author": "tekproxy",
                    "score": 1,
                    "created_utc": 1652592968.0,
                    "response": "Bitcoin mining is liberating trapped energy, greatly improving grid stability by allowing power producers to control demand, providing flexible base load to justify large Capex for new plants, and is 60% unreliable power that all the esg communists are pushing for. Power companies love bitcoin. Energy companies love bitcoin.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8o2x87",
                    "author": "BlockChainR3volution",
                    "score": 1,
                    "created_utc": 1652596871.0,
                    "response": "Ur really saying accomplish mainstream status. To the number 2 crypto 🙄🙄. Its already won. The mainstream status coin ur referring too. Probably hasn’t even been created yet",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8o3vz9",
                    "author": "Dplayerx",
                    "score": 1,
                    "created_utc": 1652597648.0,
                    "response": "I think that ETH going POS will kill it because everyone around here is mining it… no miners, nobody to talk about it, nobody uses it",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ohnit",
                    "author": "cookie-timer",
                    "score": 1,
                    "created_utc": 1652609396.0,
                    "response": "Fees are the barrier for mass adoption. 20 bucks in fees is too damn high",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8okri1",
                    "author": "pondwond",
                    "score": 1,
                    "created_utc": 1652612007.0,
                    "response": "Still don't know how they choose validators decentralized?!?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8on8vp",
                    "author": "ivgur",
                    "score": 1,
                    "created_utc": 1652613948.0,
                    "response": "Well let’s get to the merge and how it goes. All the speculation beforehand is useless. Just like people speculated in the issue date. If it’s difficult to stick to the plan on a release we can only guess in how tough it is to speculate on the outcome. I’m totally for eth but we need to wait and see",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8oqtyv",
                    "author": "_LordOfLochaber",
                    "score": 1,
                    "created_utc": 1652616410.0,
                    "response": "mainstream adoption will come once we solve the UI/UX problem web3 apps are having.\n\nthe whole \"address creation + wallet connection + network selection\" process and the messed up and/or missleading UI/UX is the real problem we are facing.\n\nwhen someone talks about mass mainstream adoption he should think about an average joe with no tech knowledge trying to navigate the dapps and dexes.\n\nblockchain should not be the focus or the unique selling point but the tech that \"happens\" to solve average joes problems.\n\n&#x200B;\n\nanyway, don't forget to click the notifcation bell, hit like and subscribe and see you next week",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8qpegs",
                    "author": "Crypto_Economist42",
                    "score": 1,
                    "created_utc": 1652649118.0,
                    "response": "Polygon is not Ethereum. It has its own token. It's not an L2. It's a side-chain with completely seperate economics. It doesn't burn ETH for its transactions. It uses MATIC.\n\nWhy does everyone keep spamming Polygon / Matic in this sub?\n\nWhat's next. Avalanche and Solana?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8qrlen",
                    "author": "Stffnpeter",
                    "score": 1,
                    "created_utc": 1652650080.0,
                    "response": "\\-99% Energy consumption is not enough to compete against server based structures and its services. everything u can do on a blockchain can already be archived much more cost, fees and energy efficient with current infrastructures, who are already legally controlled, having much more user protections and rights even on global scale.\n\nAnd even if -99% Energy is saved, lifting ETH up to mainstream level (up to the traffic of wikipedia or banking services scales) it would mean at least 1 million % more workload and traffic on the chain if billions of people use it daily for what ever reasons to come.\n\nAND Cutting 1$ gas down to 1 Cent is nice for the current few people using it, but if it gets mainstreamed fees would average of 1000$ again, cause PoS will not be enough to handle the bottle neck of mainstream traffic. (those high numbers will never be reached cause no mainstream would pay such high fees for shit so no mainstream-level will ever be reached with the current changes). \n\n&#x200B;\n\nstill in cause line goes up. ty",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8llklx",
                    "author": "pyr0phelia",
                    "score": -6,
                    "created_utc": 1652550264.0,
                    "response": "The only thing the lower energy consumption does is makes Ethereum more marketable to companies who bicker over ESG funding. Ethereum does not need Identity politics anywhere near its mission objective. If the people who complain about crypto’s power consumption were serious about their concern they would be just as angry at visa for all their power consumption, same with Mastercard and the data centers responsible for ACH transactions. Give me a fucking break.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8loha9",
                    "author": "lordytoo",
                    "score": -2,
                    "created_utc": 1652551577.0,
                    "response": "Merge will happen at the start of the next bull run. And no it wont be better for it to start sooner.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8lxuqd",
                    "author": "MisterYumYum8",
                    "score": -3,
                    "created_utc": 1652555901.0,
                    "response": "Doesnt matter if its pos or pow. Yes pos is much better but no one cares about the environmental impact since its so minuscule. So many people dont know wtf eth is or what it does, scaling with level 2’s are the future",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8mtn6e",
                    "author": "Mallardshead",
                    "score": -2,
                    "created_utc": 1652570680.0,
                    "response": "The Merge will be a major sell the news event, and the only way any cryptocurrency goes \"mainstream\" is by controlling its issuance and enforcing rules with one-directional entropy with energy from PoW. The future of PoS looks like LUNA. If your project isn't subsidizing green energy and has several \"assets\" that travel on its base layer, it's a scam.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8mymf5",
                    "author": "mathaiser",
                    "score": 0,
                    "created_utc": 1652573106.0,
                    "response": "Energy consumption is a stupid talking point made up by people against Crytpo.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "upml2a",
            "title": "Can what happened to Luna, happen to Ethereum?",
            "url": "https://www.reddit.com/r/ethereum/comments/upml2a/can_what_happened_to_luna_happen_to_ethereum/",
            "author": "slotia92",
            "created_utc": 1652550844.0,
            "score": 7,
            "num_comments": 82,
            "subreddit": "ethereum",
            "selftext": "Ive never owned any Luna and I'm not exactly sure what happened with but on the Luna sub, the attempted suicide posts are rising.\n\nI've always considered UST a scan and have a bit more trust in USDC. Not sure if what happened to Luna was direct effect of something sketchy happening with UST.\n\nWhile I understand that the basic principle of crypto is to only invest what you can afford to lose, it is still horrifying, the thought of an investment being wiped out overnight.\n\nMy question and please ELI5 is, can this happen to Ethereum? And this may be a very complex answer but I'm trying to have a conversation.\n\nTIA.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8lvte4",
                    "author": "frank__costello",
                    "score": 61,
                    "created_utc": 1652554942.0,
                    "response": "No, not possible\n\nLuna was an L1 blockchain with an algo-stablecoin built in\n\nEthereum is a neutral blockchain. People can build algo-stablecoins on top, but it doesn't affect the blockchain itself\n\nAlso, the LUNA token was designed in a way that it would inflate if the price of UST dropped, which is what lead to the crazy hyperinflation that drove the token to $0.\n\nEther is predictably issues, unplanned inflation of ETH is not possible",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8lyt5f",
                            "author": "atrizzle",
                            "score": 2,
                            "created_utc": 1652556350.0,
                            "response": "I could be wrong, but LUNA doesn’t inflate if the price of UST drops. It inflates when people cash in 1 UST for $1 worth of LUNA (which is minted on the spot). So the recent inflation, I believe, was due to the bank run on UST.\n\nPlease correct me if I have this wrong 🙏",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8m3efw",
                                    "author": "frank__costello",
                                    "score": 11,
                                    "created_utc": 1652558501.0,
                                    "response": "We're both right\n\nThe mechanism of swapping UST & LUNA is used to maintain the peg\n\nLUNA is burned when UST is above a dollar and minted when it's below a dollar, allowing the supply to expand and contract with demand\n\nThe problem in this case was the price of LUNA dropped too quickly for it to be redeemed in time, so the system had a \"death spiral\"",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8lzui3",
                                    "author": "never_safe_for_life",
                                    "score": 6,
                                    "created_utc": 1652556840.0,
                                    "response": "It's the same thing, you've just broken the steps. LUNA's only purpose was to act as an arbitrage mechanism for UST. UST only had value because people believed the arbitrage mechanism worked. So if UST goes down the first thing arbitragers are going to do is cash out through that mechanism.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8my7tl",
                            "author": "NimChimspky",
                            "score": 1,
                            "created_utc": 1652572908.0,
                            "response": "Everyone could sell. Its very possible.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8njt14",
                                    "author": "FaceDeer",
                                    "score": 5,
                                    "created_utc": 1652584181.0,
                                    "response": "Sure, but as long as people want to use any of the dapps that are built on Ethereum there's going to be at least *some* demand keeping the price above zero.\n\nIt could drop quite far, but there's a floor.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8njxby",
                                            "author": "NimChimspky",
                                            "score": 1,
                                            "created_utc": 1652584249.0,
                                            "response": "I'm not expecting it to go to zero. But there is a chance it would, just denying it is possible is ridiculous.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8npkhy",
                                                    "author": "FaceDeer",
                                                    "score": 6,
                                                    "created_utc": 1652587535.0,
                                                    "response": "It requires that there be zero demand for *any and all* dapps running on Ethereum. Every last one of them.\n\nIt's theoretically possible, sure. Humanity could die out, or lose its technology, or a successor to Ethereum could come along that is superior in every concievable way but is not derived from it, starting from a new genesis block. None of these seem particularly likely, certainly not without a little forewarning.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8okj1k",
                                                            "author": "NimChimspky",
                                                            "score": 1,
                                                            "created_utc": 1652611809.0,
                                                            "response": "Eth being superseded by a better option is much more likely than humanity dieing out.\n\nEth maxis, of which to be fair I am, think btc will be flipped. Btc supporters probably find that ridiculous.\n\nI could see some tech bug or legislation pushing eth to near zero - I'm not betting it will happen. But it honestly wouldn't surprise me that much.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8osn9z",
                                                                    "author": "Perleflamme",
                                                                    "score": 2,
                                                                    "created_utc": 1652617572.0,
                                                                    "response": "There are reasons to believe BTC will be flipped, notably the delusion many BTC devs have that the Bitcoin network provides what it's supposed to provide right now and that nothing else is doing better on all criteria. \n\nI'm yet to see a project that provides the services Ethereum provides. There are some centralized network providing services to niche markets, for the moment, but that's all. Some projects are becoming promising, but that's all there is to it, right now, without any implemented push for properly decentralized networks. Maybe in the future we'll see actual competition regarding decentralization. But it's not yet the case.\n\nBTC devs would do something to show they're acknowledging their network weaknesses and doing something to solve them, I wouldn't be that expecting a flip at all. And I'd really hope they'd do that. But hope doesn't take me away from the harsh reality that they're just past the veil of their own delusions. It would be extremely surprising they'd wake up now and change their decisions, even though it would be for the best.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i8ozlpl",
                                    "author": "hblask",
                                    "score": 3,
                                    "created_utc": 1652621532.0,
                                    "response": "It is two different cases.\n\nLuna:\n\n1. Demand goes down, price drops, supply goes up to offset demand decrease\n2.  Bigger supply = less demand = lower price\n3. Go to 1, increasing rate each time through this loop.\n\nETH:\n\n1. Demand goes down, price drops, supply remains on same course as always\n2. Lower price + same supply = more demand, price stabilizes\n3. Exit loop",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8p63mi",
                                    "author": "frank__costello",
                                    "score": 3,
                                    "created_utc": 1652624743.0,
                                    "response": "Well, that's true about any asset in the world. Everybody could sell USD and the price would go down.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8sct69",
                                            "author": "NimChimspky",
                                            "score": 1,
                                            "created_utc": 1652679161.0,
                                            "response": "I know. That's why I'm surprised you said it couldn't happen to eth",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8svyfh",
                                                    "author": "frank__costello",
                                                    "score": 1,
                                                    "created_utc": 1652695351.0,
                                                    "response": "The death spiral can't happen to ETH, which I believe was what OP was asking",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8swf58",
                                                            "author": "NimChimspky",
                                                            "score": 1,
                                                            "created_utc": 1652695751.0,
                                                            "response": "The \"death spiral\" is just people selling. The whole of crypto is purely speculative. It absolutely could happen to eth.\n\nCould be a bug with the merge, a big player or two could easily tank it still, or it could be superseded by a superior chain.  I dread to think how much eth some of these mining orgs hold.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8syr1q",
                                                                    "author": "frank__costello",
                                                                    "score": 1,
                                                                    "created_utc": 1652697657.0,
                                                                    "response": "No, the death spiral is LUNA being hyper-inflated to infinity\n\nLots of other projects have gone down, but none have ever crashed as dramatically as LUNA, because LUNA has this reflexive token model.\n\nNo other major cryptocurrency has this mechanism, so they're not vulnerable to this type of crash",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i8sz5kb",
                                                                            "author": "NimChimspky",
                                                                            "score": 1,
                                                                            "created_utc": 1652697973.0,
                                                                            "response": "I don't think the op is concerned with the exact \"mechanism\" of why it's gone to zero.  Just that it went to zero really fast.\n\nI'm not arguing it is likely to happen, but I get annoyed when people say it can't happen - btc itself has lost over 50%.\n\nThe first rules are don't gamble with more than you can afford to lose, and it could all go to zero.\n\nWhether it's an exploit, hack, market conditions - doesn't really matter.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8lwubn",
                    "author": "Silver-Contribution9",
                    "score": 23,
                    "created_utc": 1652555423.0,
                    "response": "If you mean “can ETH go to zero” the answer is 100% yes, but yea it would be a different root cause",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8m5ee7",
                            "author": "bandoonparade",
                            "score": 10,
                            "created_utc": 1652559417.0,
                            "response": "This is the correct answer. It's highly unlikely, though. Luna is the first CC to complete collapse like this in over a decade of the industry existing, and it was at least somewhat predictable. ETH would have to have a crazy macro event occur for something like that to happen. Like the Merge would have to burn everyone's staked ETH or something else crazy.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8njzyq",
                                    "author": "FaceDeer",
                                    "score": 3,
                                    "created_utc": 1652584291.0,
                                    "response": "Even then I doubt Ethereum would go all the way to zero. A catastrophic merge would be rolled back and Ethereum would continue functioning as PoW while everyone tried to figure out what had gone wrong and how to fix it for next time. It would be a catastrophic drop for the price, but as long as Ethereum's dapps are still in demand it wouldn't go to zero.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8ntrte",
                                            "author": "lorenzomofo",
                                            "score": 1,
                                            "created_utc": 1652590149.0,
                                            "response": "That depends on if the \"catastrophic\" event was fully detrimental. If there were some benefits then a vote may not result in full agreement to roll back.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8ossml",
                                                    "author": "Perleflamme",
                                                    "score": 2,
                                                    "created_utc": 1652617664.0,
                                                    "response": "Though no one ever needs a full agreement to roll back. That's why it's so interesting. You could always have a fork similar to ETH/ETC. Both chains still exist.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8m6cqj",
                            "author": "Normal_Cranberry_526",
                            "score": 1,
                            "created_utc": 1652559852.0,
                            "response": "ETH has proven utility, UST/LUNA not much (and now for sure not lol)",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8or945",
                            "author": "type_error",
                            "score": 1,
                            "created_utc": 1652616684.0,
                            "response": "Most likely all crypto would go to 0, including bitcoin in most scenarios where ETH goes to 0 IMO",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8lw29l",
                    "author": "Vigilias",
                    "score": 9,
                    "created_utc": 1652555057.0,
                    "response": "Not quite. \n\nHowever this was a well thought out attack by one of the biggest investment firms in existence. \n\nIf they threw their weight at anything they could do some short term damage. Can they take Eth with them like LUNA, probably not.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8lz5c5",
                    "author": "nelusbelus",
                    "score": 3,
                    "created_utc": 1652556513.0,
                    "response": "No because luna literally has a death spiral built in",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8md6j8",
                    "author": "road22",
                    "score": 5,
                    "created_utc": 1652563009.0,
                    "response": ">And this may be a very complex answer but I'm trying to have a conversation.\n\nConversation you shall have.\n\n3 Terminators from the future will come to our time and take over the bodies of Gary Gensler, Janet Yellen, and Jerome Powell.   They will have Quantum computing power and use the Ethereum network to control all futuristic weapons against us. \n\nIt is the OP destiny to create the resistance save us all.  The OP, will go to Korea, find Do Kwan playing some Squid Game in effort to save himself.  Do Kwan will do what he does best... crash things.  He will insert some malicious code that will crash the whole Ethereum network.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8lzgyy",
                    "author": "rnbwzrd",
                    "score": 2,
                    "created_utc": 1652556664.0,
                    "response": "No man , ETH is not a stable and the founder isn’t a sociopath egomaniac.. well , maybe a sociopath yes but don’t worry , it’s not gonna happen anyway",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8lzpr4",
                    "author": "TenBillionDollHairs",
                    "score": 2,
                    "created_utc": 1652556779.0,
                    "response": "UST was backed by 1) let's be nice and call it cleverness in the form of the LUNA mechanism and 2) eventually a paltry $2.5B in bitcoin which had fallen to $1.6B by the time they needed to use it. and that wasn't nearly enough to prop up a run on the bank by the $50B of value the Terra/Luna network represented at peak.\n\nUSDT, which has obviously suffered an attack this week as well but survived with only a blip down to .95, allegedly owns at least $18B in assets to back up the face value of circulating tokens (I think). USDC is backed up by investors with pockets to the tunes of hundreds of billions. In other words, you can't pull the same trick on them they pulled on Terra/Luna, because they're not bullshitting the world the way Do Kwon was with Luna.\n\nUltimately, ETH is not a stablecoin that you can depeg, thereby destroying its business. To prove ETH invalid, you'd have to take control of the blockchain and vote to change things unilaterally. To do so would involve orders of magnitude more capital than the LUNA attack, and without the LUNA/Terra exchange feature to exploit, the cost of attacking the network increases exponentially because you drive the price of the asset *up* as you attack it.\n\nAlso, unlike most layer ones, it's 8 years old and its ownership is spread out. It's concentrated among the rich like everything, but it's also not a chain with lots of VCs holding vested tokens they can't sell yet.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8m8kib",
                    "author": "coranos2",
                    "score": 2,
                    "created_utc": 1652560877.0,
                    "response": "Can eth go to zero? No, because I will buy the entire supply of 120 million coins for $30 (total, not each) if I was offered it.\n\nCan eth go to near zero by minting 6.5 trillion eth, like Luna minted 6.5 trillion Luna? Yes, but at 13,000 eth per day, it will take a while. \n\nCould some token like dai go to zero? Yes, but dai’s algorithm is more resistant to attacks than luna’s, as dai doesn’t let maker extract the collateral.\n\nIn my opinion, the big scam with Luna is that they used the UST to buy BTC, but didn’t have an automatic transparent process of selling the BTC to buy UST to keep the peg.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8olzn5",
                    "author": "ItsAConspiracy",
                    "score": 2,
                    "created_utc": 1652612984.0,
                    "response": "The supply of LUNA increased by one million percent in three days.\n\nThe supply of ETH is increasing by four percent per year. There is no mechanism in place that can cause the supply to increase any more than that.  After the merge, issuance will drop by about a factor of ten, and overall supply will *decrease* as long as users keep burning enough gas.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ltqan",
                    "author": "sefka",
                    "score": 3,
                    "created_utc": 1652553976.0,
                    "response": "I know this was an Ethereum-specific question, but it’s best to assume that any investment has the possibility of blowing up (albeit some with much less or near zero likelihood) and investing accordingly ie diversify.\n\nDiversification: https://www.investopedia.com/investing/importance-diversification/\nRisk of ruin: https://www.investopedia.com/terms/r/risk-of-ruin.asp\n\nAs for Ethereum, well, it’s not a literal checklist of the dictionary definition of “Ponzi scheme” as other coins and projects in the space are and have been, but that still doesn’t mean there isn’t some level of risk and there is not a good enough reason (that I’m aware of) to ever put all your eggs in one basket if you can avoid it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8lw3te",
                    "author": "majorpickle01",
                    "score": 3,
                    "created_utc": 1652555077.0,
                    "response": "short answer - No  \n\n\nLong answer - Ethereum isn't a stablecoin. It's value comes from it's utility. It's theoretically possible that over the long term ETH is outcompeted but it's won't 100-0 in one day.  \n\n\nETH has similar risks to a tech stock, Luna is the kind of risk on a 10x ETF tracking tech",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8myu0b",
                            "author": "NimChimspky",
                            "score": -1,
                            "created_utc": 1652573213.0,
                            "response": "Of course it's possible. I don't know why people are saying it's not possible.\n\nIs it likely, no.  But its very much possible.  The merge could introduce a bug, and the steth peg is already acting weird.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8mzqyg",
                                    "author": "majorpickle01",
                                    "score": 3,
                                    "created_utc": 1652573686.0,
                                    "response": "The problem is OP asked \"can what happened to luna happen to eth\" which the answer is No, because the type of attack is purely due to it being an algo stable.  \n\n\nCan it go to zero? well sure. But so can stocks, bonds, commodity prices.... in order of decreasing likelyhood but theoretically possible.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8mztei",
                                            "author": "NimChimspky",
                                            "score": -1,
                                            "created_utc": 1652573722.0,
                                            "response": "The only thing that happened was people sold",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8n06mz",
                                                    "author": "majorpickle01",
                                                    "score": 3,
                                                    "created_utc": 1652573911.0,
                                                    "response": "ok.... but you appreciate that the price decrease of luna being so drastic is specifically because it was being hyperinflated to bring UST back to peg, right?  \n\n\nSelling was the base cause, but the mechanism that so completely destroyed the project just isn't possible on ETH",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8n64ui",
                                                            "author": "NimChimspky",
                                                            "score": 1,
                                                            "created_utc": 1652576941.0,
                                                            "response": "I think it went to about five bucks before they started inflating. So list 95% of it's value.\n\nBut yeah, they are not the same risks.\n\nJust wanted to emphasize that eth could crash very low very quick, there is nothing inherent in stopping that happening.  Most of my bag is eth, like 95%.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8m7ikm",
                    "author": "SuperCryptoBr0",
                    "score": 2,
                    "created_utc": 1652560393.0,
                    "response": "#SCAN",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8mjxaw",
                            "author": "LukyLukyLu",
                            "score": 1,
                            "created_utc": 1652566134.0,
                            "response": ":D",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8mscfc",
                    "author": "Chris198O",
                    "score": 1,
                    "created_utc": 1652570068.0,
                    "response": "Well I never understood the objective of a stable coin. I mean if I want to change btw or ethereum to something worth a dollar I would sell it for dollar. Why would I exchange it for a stable coin instead?\n\nPlease someone enlighten me :p",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8nlea7",
                            "author": "FaceDeer",
                            "score": 3,
                            "created_utc": 1652585087.0,
                            "response": "Let's say you want to place a bet using a decentralized prediction market like Augur. You're betting on an event that's going to happen one year from now. The odds currently say that if you win your bet you'll get back 20% more than what you put up. If you place your bet in Ether, that Ether is going to sit in the prediction market for a year before it comes back to you. In that time Ether's likely to have changed its value dramatically. Maybe it's gone up, maybe it's gone down. Regardless, the value of the payout is going to be almost completely disconnected from what those odds were.\n\nOr, let's say that a data storage dapp akin to Swarm is developed that lets you create a contract that pays cloud storage providers to keep your data online. You want your data to be available for twenty years, and are willing to pay a hundred dollars a year over that period. If you use Ether for that then who knows what's going to be going on twenty years from now? Your contract might be only paying the equivalent of a pittance (in installments of 1/20th of a pittance), resulting in your data being lost. Or it could be paying the equivalent of a million dollars a year to ensure that your NFTs of interesting-looking twigs are accessible.\n\nIn a nutshell, stablecoins let you put value into a contract and let the contract hold that value without it changing much. Very handy for lots of applications.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8lnqrl",
                    "author": "A6174",
                    "score": -22,
                    "created_utc": 1652551249.0,
                    "response": "I have problems with Proof of Stake as that gives awards in the same crypto based on the amount you stake. The more people buying the crypto to stake, its price goes up and so on. To me that's a Ponzi scheme.\n\nWhile in anything that is proof of work, the miners give strength and stability to the network while deciding when sell or hodl the awarded crypto for their work. miners tend to be long term Hodl'ers and very directly affected by price action.\n\nTo me (being a miner), don't feel confident to direction ETH as PoS is going.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8lrjba",
                            "author": "babossa77",
                            "score": 18,
                            "created_utc": 1652552972.0,
                            "response": ">To me that's a Ponzi scheme\n\nThen you have no idea what a ponzi scheme is.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8o667x",
                                    "author": "A6174",
                                    "score": 0,
                                    "created_utc": 1652599530.0,
                                    "response": "The thought is reciprocal.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8lqfyt",
                            "author": "NabyK8ta",
                            "score": 6,
                            "created_utc": 1652552464.0,
                            "response": "What if this is balanced by burning fees people pay to use the network?\n\nIf the network is deflationary after rewarding stakers then surely that is the opposite of a Ponzi?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8lwuon",
                                    "author": "AbbreviationsLevel73",
                                    "score": -1,
                                    "created_utc": 1652555428.0,
                                    "response": "bros no proof of stake is deflationary, it makes no sense from an economics standpoint",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8m0nw5",
                                            "author": "NabyK8ta",
                                            "score": 4,
                                            "created_utc": 1652557224.0,
                                            "response": "Seriously, educate yourself on EIP1559.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8nv14r",
                                                    "author": "AbbreviationsLevel73",
                                                    "score": -1,
                                                    "created_utc": 1652590988.0,
                                                    "response": "thats not what deflationary means jesus christ",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8o5mvr",
                                                            "author": "NabyK8ta",
                                                            "score": 3,
                                                            "created_utc": 1652599085.0,
                                                            "response": "I have no words to describe your lack of intellect. Just wow.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i8o6dq0",
                                    "author": "A6174",
                                    "score": 0,
                                    "created_utc": 1652599706.0,
                                    "response": "That's a very good argument, but to me it's always hard to see PoS (even in a deflationary ecosystem) not different from a Ponzi, because in order to increase the value of the token more people needs to buy in and/or stake in order to get a reward, which let's be honest is quite low considering the risk involved.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8lv01c",
                            "author": "cosmic-comedy",
                            "score": 4,
                            "created_utc": 1652554562.0,
                            "response": "By that logic, PoW that allows ASICs is a ponzi scheme, because you get special rights to mine by investing in ASICs and ASIC farms. GPU miners at home can't even compete anymore or make enough profit to recoup the costs of mining Bitcoin.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8o64rn",
                                    "author": "A6174",
                                    "score": 1,
                                    "created_utc": 1652599495.0,
                                    "response": "That's your logic, not mine and it's definitely not what I said.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8m4dik",
                            "author": "wind_dude",
                            "score": 2,
                            "created_utc": 1652558947.0,
                            "response": ">To me that's a Ponzi scheme.\n\nNo, that's the basics of a market price set by supply and demand.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8o5qrw",
                                    "author": "A6174",
                                    "score": -2,
                                    "created_utc": 1652599176.0,
                                    "response": "That argument is correct when price discovery is left entirely to the markets. when the price action is derived from reducing availability by staking, you have an artificial reduced supply.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8pucff",
                                            "author": "PinkPuppyBall",
                                            "score": 1,
                                            "created_utc": 1652635468.0,
                                            "response": "How is it artificial? To have proof of stake you need stake. Its sibyl protection, not an excuse to lock up coins. Besides, staked ETH once its full PoS is relatively quick to unlock.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8qb7w0",
                                                    "author": "A6174",
                                                    "score": -1,
                                                    "created_utc": 1652642902.0,
                                                    "response": "When something is not available because is locked, if there's a lot of locked positions and demand increases, price action will move more violently. It's somewhat similar concept there are less taxis or Uber available in rainy day. The difference is taxis have fixed tariffs while über has a floating tariff.\n\nNote that stake eth won't be easily available to be withdrawn.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8lwaui",
                            "author": "iMHackeRPiratE",
                            "score": 1,
                            "created_utc": 1652555167.0,
                            "response": "seems kind ah valid point, instead of explaining or answering his/her question why you guys are downvoting ? not everyone afford to buy 23ETH.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8o5zj3",
                                    "author": "A6174",
                                    "score": 1,
                                    "created_utc": 1652599375.0,
                                    "response": "That's ok mate. Truth is like poetry, everyone hates poetry. \n\nNo one talks that 32 ETH will give - gross - about 4-5% ROI per year. Add running costs, taxes, etc you will be left with very little net returns. There's something seriously wrong and no one is challenging it.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8o6nfp",
                                            "author": "Gumba_Hasselhoff",
                                            "score": 2,
                                            "created_utc": 1652599937.0,
                                            "response": "I don't understand what you are trying to say",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8p7v8i",
                                                    "author": "A6174",
                                                    "score": 0,
                                                    "created_utc": 1652625569.0,
                                                    "response": "I'm sorry i can't understand it for you",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i8ozrus",
                                            "author": "nixorokish",
                                            "score": 1,
                                            "created_utc": 1652621622.0,
                                            "response": "running costs are about $2-3/month in electricity. Taxes are dependent on your jurisdiction but always a percentage of only your profit.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8ls41d",
                    "author": "Godz1lla1",
                    "score": 1,
                    "created_utc": 1652553243.0,
                    "response": "No, the mechanism of the attack on Terra/Luna does not exist on Ethereum.  The only real risk of attack is if a bad actor controls 50% of the network.  Given the size already, and the fact that it is growing, it is less likely every day.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8m41u7",
                    "author": "Dennisaryu",
                    "score": 1,
                    "created_utc": 1652558797.0,
                    "response": "I think the main problem right now could be Lido. Lido is currently pretty much controlling Ethereum staking (30%+) and that could be a problem in case somehow something were to happen to Lido. This number is expected to grow to over 50% at some point down the line.\n\nIf I’m mistaken about this I’m open to learning.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8m4cut",
                    "author": "YaBastaaa",
                    "score": 1,
                    "created_utc": 1652558939.0,
                    "response": "Is etherum pegged to a stable coin , my I understand is no .  So I do not think what happen to Luna could happen to ETHERUM 🤷🏻‍♂️.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8mk6op",
                    "author": "LukyLukyLu",
                    "score": 1,
                    "created_utc": 1652566258.0,
                    "response": "lol i remember in luna subbredit few months ago, someone was explaining how it is genial that burning UST increases the Luna price, so it is designed so soar up. then someone naive but smart asked in comments if is it possible that also the other way may happen.. that the price of luna would go lower. and the answer was that not, that it can go only one way ahahaha.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8mtvjo",
                    "author": "305_tilidie",
                    "score": 1,
                    "created_utc": 1652570791.0,
                    "response": "Yes, but only if Tether dies completely which will also take out the vast majority of tokens with it too.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8n51p0",
                    "author": "CurrentlyLucid",
                    "score": 1,
                    "created_utc": 1652576378.0,
                    "response": "Is eth bouncing as much as Jaxx is telling me? My value of held eth jumps up and down almost 50% through the last few days.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8navm6",
                            "author": "roox911",
                            "score": 1,
                            "created_utc": 1652579426.0,
                            "response": "No.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8n5t9o",
                    "author": "Kellan111",
                    "score": 1,
                    "created_utc": 1652576769.0,
                    "response": "Yes, absolutely. If the US dollar or any other currency can collapse, then so can ETH. Dont let these ppl tell you otherwise. Is it likely to happen however? No. Can it happen? Yes.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8nbonr",
                    "author": "mouawad23",
                    "score": 1,
                    "created_utc": 1652579828.0,
                    "response": "Same same but different, short answer = no",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8osswx",
                    "author": "sven_adams",
                    "score": 1,
                    "created_utc": 1652617669.0,
                    "response": "Yes but it cannot happen as fast as it did on Luna. But basically if after the merge people keep withdrawing their stake, and if the price of ETH drops low enough, they may be forced to increase the amount of ETH stakers earn, to keep them staked and/or attract new ones. But that could create the hyper inflationary scenario that luna saw, but over a longer time frame.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8ozc24",
                            "author": "nixorokish",
                            "score": 1,
                            "created_utc": 1652621389.0,
                            "response": "no. if people keep withdrawing their eth, APR for staking increases. The APR is always a function of how many people are staked. afaik, there are no plans and no mechanism to manually change the amount of ETH that stakers earn based on the *price* of ETH.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8pnm67",
                    "author": "espresso_chain",
                    "score": 1,
                    "created_utc": 1652632551.0,
                    "response": "depends what you mean. to a project built on Ethereum? 100% yes. to Ethereum itself? not really.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8m139c",
                    "author": "RogerWilco357",
                    "score": -3,
                    "created_utc": 1652557423.0,
                    "response": "If your question is can ethereum fail and ether go to zero?\n\nYes.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8m3h5r",
                            "author": "stickmanDave",
                            "score": 2,
                            "created_utc": 1652558535.0,
                            "response": "He didn't ask if Ether could fail.  Of course, ether can fail, just like the US dollar could fail.\n\nBut \"the same thing that happened to Luna\" can't happen to Ether or dollars.\n\nEDIT: the same mechanism that caused Luna to fail couldn't happen to ether or dollars, because they don't work the same way.  If ether or dollars fail, they will do so in a completely different way than luna did.  The specific weakness that caused Luna to fail doesn't exist in ether or dollars.\n\nBrake failure can make your car crash.  Airplanes and ships can crash too, but not from brake failure.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8m3szh",
                                    "author": "RogerWilco357",
                                    "score": -4,
                                    "created_utc": 1652558685.0,
                                    "response": "But that's what happened to Luna, it failed.\n\nFeel free to have a different interpretation of the question if you would like, and provide your corresponding answer.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8m4025",
                    "author": "wind_dude",
                    "score": 0,
                    "created_utc": 1652558774.0,
                    "response": "No.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8muice",
                    "author": "Pixeltoir",
                    "score": 0,
                    "created_utc": 1652571088.0,
                    "response": "YES, Don't listen to the other people here. YES IT WILL HAPPEN, you will lose all gains. If you did read how Ethereum works, you won't lose all gains.  \n\n\nDid people who \"INVEST\" (GAMBLE at this point), actually do DYOR??????  \n\n\nand it's sad that there are people those who committed suicide, but I have no sympathy for them, they knew what they were getting into and been told multiple times to do DYOR and INVEST what you can afford to lose",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uplzsw",
            "title": "dapp creator forum?",
            "url": "https://www.reddit.com/r/ethereum/comments/uplzsw/dapp_creator_forum/",
            "author": "Sagan-Man",
            "created_utc": 1652549058.0,
            "score": 4,
            "num_comments": 6,
            "subreddit": "ethereum",
            "selftext": "Hi, I'm a person who makes eth dapps.  \nBut, nobody here cares about or wants my self-promotion.  \n\n\nWanted to see if someone would point me to a community that wants to hear about the things eth dapp creators make. thanks!",
            "stickied": false,
            "comments": [
                {
                    "id": "i8lpakc",
                    "author": "YourBluntFriend",
                    "score": 3,
                    "created_utc": 1652551948.0,
                    "response": "Maybe r/ethdev is what you’re looking for?",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}