{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uqofyl",
            "title": "TA Accuracy",
            "url": "https://www.reddit.com/r/ethereum/comments/uqofyl/ta_accuracy/",
            "author": "sonofabitch246",
            "created_utc": 1652678519.0,
            "score": 1,
            "num_comments": 4,
            "subreddit": "ethereum",
            "selftext": "What makes technical analysis on crypto charts a reliable source? Did TA predict the fall of Luna and UST? Did TA even predict the beat market that we are in? Maybe it’s just for day traders but even so, if TA was accurate every investor would be making millions. Also how does TA predict when bulls and whales are buying and when bears are selling? Wouldn’t everyone be able to play the market and be profitable if TA worked? Disclaimer, I don’t know much but ik a lot of people that talk about it and they are usually wrong.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8scwj8",
                    "author": "vjfilms",
                    "score": 1,
                    "created_utc": 1652679225.0,
                    "response": "Good TA actually did predict the bear market we are in. Problem is that many sources of TA come from influencers who benefit more from telling you the price is going to $100k rather than $30k. TA is analyzing current trends and comparing them to how the market reacted in past history. Just don’t watch the people who are playing guessing games. I like BC Backer, but many don’t because he has been telling us that $69k was the top for months.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8sd4op",
                            "author": "CryptoAnarchyst",
                            "score": 1,
                            "created_utc": 1652679381.0,
                            "response": "No, and you're full of shit\n\nGood TA predicted none of this because good TA doesn't take into the account 9% inflation, or a fucking war between Ukraine and Russia.\n\nIf you knew what TA was, you'd understand it a bit more.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8sdf14",
                                    "author": "vjfilms",
                                    "score": 1,
                                    "created_utc": 1652679591.0,
                                    "response": "Who pissed in your cheerios?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8sd01f",
                    "author": "CryptoAnarchyst",
                    "score": 1,
                    "created_utc": 1652679292.0,
                    "response": "it doesn't\r  \n\r  \nTA is only one part of an analysis that needs to occur in order to get a view into the market.\r  \n\r  \nTA is the psychology of the hive mind of investors through PRICE ACTION and VOLUME... that's it. All of the indicators like RSI, Bollinger Bands, EMA, MA... whatever the fuck you want... they are all PRICE ACTION and VOLUME over time information.\r  \n\r  \nThe second aspect of viewing the market is the FUNDAMENTAL ANALYSIS, or FA... In that data you look at the underlying dynamics of the asset. In case of BTC, network usage, Exchange ratio, Whale ratios, Hash Rate... and so on... many numbers go into it.\r  \n\r  \nFinally, you get the third piece and that is your own perception of the market and how YOU interpret the data.\r  \n\r  \nIt's an art form and I know many artists that paint wonderful market analyses... one's that I hope to get to one day.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}