{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "s4yww6",
            "title": "What actually happens if Ethereum is classified as a security?",
            "url": "https://www.reddit.com/r/ethereum/comments/s4yww6/what_actually_happens_if_ethereum_is_classified/",
            "author": "mybed54",
            "created_utc": 1642293449.0,
            "score": 28,
            "num_comments": 127,
            "subreddit": "ethereum",
            "selftext": "Does anything actually change? What realistically will the US government do if this is the case?",
            "stickied": false,
            "comments": [
                {
                    "id": "hsu8490",
                    "author": "nodedude7",
                    "score": 47,
                    "created_utc": 1642294329.0,
                    "response": "My guess is delisted from US exchange’s while a lawsuit ensues that will take longer than the merge to eth2.0",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hsv4lx7",
                            "author": "eastsideski",
                            "score": 6,
                            "created_utc": 1642308973.0,
                            "response": "I disagree\n\nIf ETH is classified as a security, then pretty much every asset except Bitcoin could be considered a security\n\nExchanges can't exist off only selling Bitcoin, they'd have no choice but to keep selling ETH while fighting the SEC",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hsv5ab8",
                                    "author": "nodedude7",
                                    "score": 4,
                                    "created_utc": 1642309347.0,
                                    "response": "That sounds like a wet dream for the US Gov… “You mean we can wipe out the entire shitcoin market in one cataclysmic swoop and then let Eth and a few other select digital assets back in the house under our rules… stop I can only get so hard!”",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "hsuie09",
                            "author": "HospitalQuirky",
                            "score": 17,
                            "created_utc": 1642298712.0,
                            "response": "Which is why I have hardware and software wallets...",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hsujifb",
                                    "author": "nodedude7",
                                    "score": 4,
                                    "created_utc": 1642299179.0,
                                    "response": "This is the way",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "hsu8yjh",
                            "author": "mybed54",
                            "score": 12,
                            "created_utc": 1642294677.0,
                            "response": "No way US delists ETH",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hsuc1jb",
                                    "author": "nodedude7",
                                    "score": 37,
                                    "created_utc": 1642295999.0,
                                    "response": "Sorry I didn’t realize you’re Gary Gensler. I’m just saying it’s a possibility since it’s the SECURITIES and exchange Commissions job to regulate these things. Don’t ask questions you only wanna hear the answer you want to.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hsucxax",
                                            "author": "pcakes13",
                                            "score": 4,
                                            "created_utc": 1642296371.0,
                                            "response": "The same Gary Gensler at the same SEC that is suing Ripple labs and having their asses handed to them, partially because Gary’s predecessor William Hinman said ETH and BTC aren’t securities?  Is it THAT SEC or is there a totally different one I’m not aware of to cause you to talk completely out of your ass about things you know nothing about. Safe equine consulate?  Sordid erotic compilation?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hsudb4t",
                                                    "author": "nodedude7",
                                                    "score": 14,
                                                    "created_utc": 1642296533.0,
                                                    "response": "Bro the question is what would happen IF eth got classified as a security, Im well aware of the history of Gary Gensler in this space",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "hsue3qw",
                                                            "author": "pcakes13",
                                                            "score": 10,
                                                            "created_utc": 1642296868.0,
                                                            "response": "and I’m saying it wouldn’t even get delisted. The former head of the SEC was recorded as saying ETH is not a security and that’s causing problems for them in suits against other cryptos. Visa. Mastercard. There are HUGE players already committed to ETH. Not only would it never be declared a security, it’s never, not ever, gonna be delisted.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "hsufjeq",
                                                                    "author": "nodedude7",
                                                                    "score": 5,
                                                                    "created_utc": 1642297490.0,
                                                                    "response": "While I agree with you that I don’t see it getting classified as a security, none the less the question was what if. There are more people that decide regulations at the SEC than just Gary Gensler. It doesn’t matter how you slice it but Eth being classified as a security would not be good for atleast short to medium term for people in the US",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "hsuky36",
                                                                            "author": "Finsterjaeger",
                                                                            "score": 8,
                                                                            "created_utc": 1642299786.0,
                                                                            "response": "The SEC doesn’t just choose what is or isn’t a security. There is a legal test used to determine that question.  Pretty much everything about ETH and BTC makes it a cut and dry analysis that they are not a security. Am a securities and corporate lawyer in the United States. I am not just blowing smoke.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "hsumlwc",
                                                                                    "author": "nodedude7",
                                                                                    "score": 5,
                                                                                    "created_utc": 1642300470.0,
                                                                                    "response": "I agree they both pass the Howey test and are not securities. I am speculating what would happen according to OPs original question. I am by no means an expert in this area and this is my opinion of what would happen if it did get classified as a security, I would be interested to hear your take on it tho being someone in the area of expertise. If ETH got classified as a security tomorrow by the SEC, I would assume the US exchanges would have to halt trading until it's registered with SEC?",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "hsx6vj2",
                                                                                            "author": "blurp123456789",
                                                                                            "score": 4,
                                                                                            "created_utc": 1642353519.0,
                                                                                            "response": "Haha what a convo, took for ever for this big shot lawyer to understand you’re answering a hypothetical and then ghosts you when you ask for some good perspective.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        },
                                                                                        {
                                                                                            "id": "hsw0j97",
                                                                                            "author": "Hycin20",
                                                                                            "score": 3,
                                                                                            "created_utc": 1642331644.0,
                                                                                            "response": "Halt trading where? Across the universe? Does germany follow? Does England Singapore etc follow? U get the complication right……. Crypto is not controlled by the United States bro…",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "hszu90w",
                                    "author": "KaiSosceles",
                                    "score": 1,
                                    "created_utc": 1642391481.0,
                                    "response": "You asked what happens...thats what happens. 🤷‍♂️",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "hsucxe0",
                            "author": "DemApples4u",
                            "score": 2,
                            "created_utc": 1642296372.0,
                            "response": "Wrong, brokers will get licenses to sell securities and sell eth and others",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hsudj4c",
                                    "author": "nodedude7",
                                    "score": 1,
                                    "created_utc": 1642296628.0,
                                    "response": "Sure, but it would be an UNlicense security until it got approval from the SEC",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hsue57t",
                                            "author": "DemApples4u",
                                            "score": 2,
                                            "created_utc": 1642296885.0,
                                            "response": "Ah then the question is \"how would eth get registered since who would file to register?\" OK I see the issue now. Thank you!",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "hsu920n",
                            "author": "FrickGoogle",
                            "score": 1,
                            "created_utc": 1642294717.0,
                            "response": "Who would they sue?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hsua9uw",
                                    "author": "nodedude7",
                                    "score": 6,
                                    "created_utc": 1642295237.0,
                                    "response": "Ethereum foundation would sue SEC",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hsudz40",
                                            "author": "edmundedgar",
                                            "score": 2,
                                            "created_utc": 1642296815.0,
                                            "response": "That would kind of make the SEC's hypothetical point for them about how ETH investors are reliant on the efforts of others...",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hsuec9u",
                                                    "author": "nodedude7",
                                                    "score": 1,
                                                    "created_utc": 1642296964.0,
                                                    "response": "Howey Test, exactly",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "hsu99yy",
                                    "author": "mybed54",
                                    "score": 14,
                                    "created_utc": 1642294810.0,
                                    "response": "ETH is too big. Too many US companies and the economy is using ETH based solutions.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hsu9dki",
                                            "author": "FrickGoogle",
                                            "score": 5,
                                            "created_utc": 1642294852.0,
                                            "response": "Exactly. Plus if ETH is still POW then people would just keep mining it anyway.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hsub653",
                                                    "author": "nodedude7",
                                                    "score": 5,
                                                    "created_utc": 1642295625.0,
                                                    "response": "Of course, I’m only talking about in the US. Mining and/or staking has nothing to do with US exchanges listing a coin. Eth mining happens all over the world",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "hsuavs8",
                                            "author": "nodedude7",
                                            "score": 2,
                                            "created_utc": 1642295501.0,
                                            "response": "A lot of US companies were using Ripple… this is my guess at what would happen but I’m no expert by any means. And a lot of people thought internet companies were too big to fail in 1999…",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "hsucdbb",
                                            "author": "TimeGrifter",
                                            "score": 1,
                                            "created_utc": 1642296140.0,
                                            "response": "And big whales in politics you don't know",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "hsw0mmr",
                            "author": "manucule",
                            "score": 1,
                            "created_utc": 1642331717.0,
                            "response": "Longer than the merge that’s been happening since 2016?",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hsucyly",
                            "author": "_jt",
                            "score": 0,
                            "created_utc": 1642296386.0,
                            "response": "Why would a security get delisted from an exchange? Are you aware of the stock market?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hsudz32",
                                    "author": "nodedude7",
                                    "score": 3,
                                    "created_utc": 1642296815.0,
                                    "response": "Those are registered securities… so probably wouldn’t fly until Ether is registered as a security with SEC",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hsufpqe",
                                            "author": "_jt",
                                            "score": 0,
                                            "created_utc": 1642297565.0,
                                            "response": "So why are you assuming ethereum wouldn’t get approved by SEC like any other company that IPOs for the stock exchanges? In this scenario they’ve already ruled it as a security",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hsugp6c",
                                                    "author": "nodedude7",
                                                    "score": 3,
                                                    "created_utc": 1642297987.0,
                                                    "response": "Order of operation, for it to register as a security it would have to be classified as a security which would make it an unregistered security currently. This is the whole thing with ripple that has been going on for years.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "hsvc27x",
                                                            "author": "_jt",
                                                            "score": 0,
                                                            "created_utc": 1642313309.0,
                                                            "response": "Ripple’s issue is that it’s a scam. I have no reason to think ethereum couldn’t get approved by the SEC as a legit tradable security",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "hsuom32",
                            "author": "ZiltoidM56",
                            "score": 0,
                            "created_utc": 1642301329.0,
                            "response": "Price go way down",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hsuam0t",
                    "author": "forkknife777",
                    "score": 21,
                    "created_utc": 1642295385.0,
                    "response": "There's two separate determinations the SEC can make.  \n\n#1 The initial sale was a sale of securities.  \n\n#2 Ethereum is currently a security.\n\nI personally find it likely that they could end up finding that the initial sale was a sale of securities and assess a fine similar to the one they assessed to Block.one for the EOS crowd sale.  \n\nI find it incredibly unlikely that they will classify ETH in its current form as a security given how much more decentralized it has become.  \n\nTake this with a grain of salt, but I'm really not very worried about this.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hsusjnu",
                            "author": "frank__costello",
                            "score": 16,
                            "created_utc": 1642303109.0,
                            "response": "The statute of limitations is 5 years\n\nThe initial sale was in 2014 and the network launched in 2015, so it's well past the statute of limitations.\n\nAnd as you said, as the 2nd most decentralized network, it's incredibly unlikely that it would be classified as a security _today_.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hsutk2m",
                                    "author": "forkknife777",
                                    "score": 5,
                                    "created_utc": 1642303568.0,
                                    "response": "Good to know!  I didn't realize we were past the statute of limitations for the initial sale.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "hsw8etq",
                                    "author": "tipstony59",
                                    "score": 1,
                                    "created_utc": 1642337434.0,
                                    "response": "No Ripple would be using this then for there defence",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ht0ssq2",
                                            "author": "frank__costello",
                                            "score": 3,
                                            "created_utc": 1642413457.0,
                                            "response": "The SEC is asserting that XRP is _still_ a security, meaning each time Ripple sells more XRP, it's another security sale.\n\nEthereum was probably a security when it launched, but it's very hard to make the case that it's still a security today.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "hszxro9",
                                    "author": "polar_nopposite",
                                    "score": 1,
                                    "created_utc": 1642393148.0,
                                    "response": "What blockchain is more decentralized than Ethereum?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ht0soik",
                                            "author": "frank__costello",
                                            "score": 1,
                                            "created_utc": 1642413361.0,
                                            "response": "Bitcoin",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ht1bg3h",
                                                    "author": "polar_nopposite",
                                                    "score": 1,
                                                    "created_utc": 1642426702.0,
                                                    "response": "Bitcoin has a higher marketcap but it is far more centralized. The hashing power of the network is concentrated among much fewer miners than with Ethereum.\n\nThat is, it would take far fewer miners to collaborate to attack the Bitcoin network than it would for Ethereum",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "hsuee8y",
                            "author": "ElPatronDelDesierto",
                            "score": 4,
                            "created_utc": 1642296986.0,
                            "response": "Good take. I agree with this",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hsvpcbv",
                            "author": "FreeFactoid",
                            "score": -2,
                            "created_utc": 1642322681.0,
                            "response": "Why vitalik lives in Singapore",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hsvn30t",
                    "author": "Leading_Blackberry15",
                    "score": 5,
                    "created_utc": 1642320932.0,
                    "response": "former SEC Director William Hinman said both Bitcoin and Ethereum are not securities. This essentially gave both the green light to operate unimpeded, as far as securities compliance is concerned",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hsw8ioa",
                            "author": "tipstony59",
                            "score": 2,
                            "created_utc": 1642337505.0,
                            "response": "He signed a document claiming it was his own personal views this has been in the ripple case so this can't be used",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hsu9zrt",
                    "author": "Guol",
                    "score": 12,
                    "created_utc": 1642295118.0,
                    "response": "Number go down. Number go down biiiiig.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hsucuwg",
                            "author": "DemApples4u",
                            "score": 7,
                            "created_utc": 1642296344.0,
                            "response": "You forget crypto is global... Although us is a big part, the rest of the world will still be fine. Not to mention, so what? Being a security affects nothing. Brokers will get the licenses they need. Prices will go up after a quick shake because what everyone wants is certainty now. Nobody cares if it's (a) or (b), just pick one so we can build around it safely without risk.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hsuf68e",
                    "author": "jvman934",
                    "score": 2,
                    "created_utc": 1642297330.0,
                    "response": "A buying opportunity",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hsvb1bp",
                    "author": "No-Significance-1581",
                    "score": 2,
                    "created_utc": 1642312687.0,
                    "response": "Who cares what the government classifies it as, if the government classified Bitcoin a security what you gonna do shit your pants? No one cares what they classify it as.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hsvc8p1",
                            "author": "mybed54",
                            "score": 3,
                            "created_utc": 1642313426.0,
                            "response": "Agreed but unfortunately whales and funds will care especially if they delist",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hsvgwgd",
                                    "author": "No-Significance-1581",
                                    "score": 1,
                                    "created_utc": 1642316489.0,
                                    "response": "Doesnt matter to me nor does it matter to people who live in lebanon who are buying because their currency tanked due to their corrupt government and banks. Same goes for people in Venezuela, Iran, Russia, China, Hong kong, Zimbabewae, Turkey, USA... I can keep going.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hsvh094",
                                            "author": "mybed54",
                                            "score": 2,
                                            "created_utc": 1642316560.0,
                                            "response": "Yeah but the gains are not made from retail investors.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hsvk61o",
                                                    "author": "No-Significance-1581",
                                                    "score": 0,
                                                    "created_utc": 1642318767.0,
                                                    "response": "Who do you think propped up the price for the last decade before institutional investors could jump in? People who ask \"what if xxxx is declared illegal or a security\" do not understand the essence of Crypto or decentralization.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "hsvlhys",
                                                            "author": "mybed54",
                                                            "score": 1,
                                                            "created_utc": 1642319743.0,
                                                            "response": "You can only go so far without institutional investors. Once you start getting past the tens of billions of dollars.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "hsvpgea",
                                                                    "author": "No-Significance-1581",
                                                                    "score": 1,
                                                                    "created_utc": 1642322771.0,
                                                                    "response": "You can go infinitely as fiat is infinite and retail investors have access to fiat.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hsu9qyk",
                    "author": "edmundedgar",
                    "score": 3,
                    "created_utc": 1642295013.0,
                    "response": "If Ethereum is classified as a security then the crypto exchanges will delist it, while since nobody is in charge of it, it won't be able to meet the requirements for a normal security so it won't be listed on securities exchanges either.\n\nSo to buy ETH you'll have to buy some other token that isn't considered a security, then go to uniswap or wherever and trade it for ETH. This will accelerate one of the various account abstraction techniques, as people who don't yet have any ETH will have to pay for their gas in the token they bought.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hsuafn3",
                            "author": "mybed54",
                            "score": 4,
                            "created_utc": 1642295308.0,
                            "response": "If ETH is a security literally everything besides BTC and LTC would be delisted too then wtf",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hsueael",
                                    "author": "ElPatronDelDesierto",
                                    "score": 6,
                                    "created_utc": 1642296943.0,
                                    "response": "It will only hurt CEXs. You think people will stop buying ETH everywhere else? No chance. When it comes to crypto, the US govt has a lot less power than it and everyone on this thread thinks",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "hsucotq",
                                    "author": "edmundedgar",
                                    "score": 2,
                                    "created_utc": 1642296272.0,
                                    "response": "I don't think that's true. Potentially you'd delist anything with a *team*, which would be *almost* all existing tokens, but there would be nothing stopping someone making a simple token with a predefined supply and no governance, marketing or future development, which would be not-a-security for the same reasons as BTC.\n\nAlso the backed stablecoins would be non-securities for a different reason (no expectation of profit) although if ETH had been deemed a security as part of a general regulatory crackdown it's obviously possible that stablecoins would be banned for a different reason.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "hsud0mt",
                            "author": "DemApples4u",
                            "score": 1,
                            "created_utc": 1642296410.0,
                            "response": "Wrong, brokers will get licenses and be fine after the dust settles. Just need clarity",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hsudo2f",
                                    "author": "edmundedgar",
                                    "score": 3,
                                    "created_utc": 1642296686.0,
                                    "response": "IANAL but as I understand it for a security to be legal for licensed brokers to trade the company that issues it has to meet a bunch of regulatory requirements. The Ethereum Corporation can't meet those requirements, because it doesn't exist, and even if it did exist the requirements aren't compatible with an anonymously-owned token, which is why big projects in the US aren't following the \"register the token as a security with the SEC\" route.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hsue7ws",
                                            "author": "DemApples4u",
                                            "score": 1,
                                            "created_utc": 1642296916.0,
                                            "response": "That makes sense. I understand the issue now. Thank you!",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hsu64el",
                    "author": "PMcNutt",
                    "score": 1,
                    "created_utc": 1642293490.0,
                    "response": "I go broke",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hsu6cuq",
                            "author": "seltzershark",
                            "score": 1,
                            "created_utc": 1642293591.0,
                            "response": "Why? What will change? Genuine question",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hsulsv0",
                    "author": "Lhadar31",
                    "score": 1,
                    "created_utc": 1642300140.0,
                    "response": "I don’t think they will go after Ethereum as it has become too big now,",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hsuptc8",
                    "author": "bbsdave",
                    "score": 1,
                    "created_utc": 1642301854.0,
                    "response": "Didn’t ripple just get awarded a judgment on how the US already ruled that ethereum wasn’t a security and ripple wants to know why and how they came to that conclusion?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hsupvc3",
                            "author": "mybed54",
                            "score": 2,
                            "created_utc": 1642301879.0,
                            "response": "It's cause eth is pow",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hsur4n7",
                                    "author": "bbsdave",
                                    "score": 1,
                                    "created_utc": 1642302428.0,
                                    "response": "Gotcha.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "hswc8b4",
                                    "author": "Locko_O",
                                    "score": 1,
                                    "created_utc": 1642339815.0,
                                    "response": "That changes soon tho?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hsv1d12",
                    "author": "Visible-Ad743",
                    "score": 1,
                    "created_utc": 1642307239.0,
                    "response": "You would not be to buy or sell eth in the US as the SEC would prohibit exchanges from offering it. The price would drop significantly and a lawsuit would take years to have an outcome. A lot of resources and energy would be wasted.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hsvz7ah",
                    "author": "saddit42",
                    "score": 1,
                    "created_utc": 1642330595.0,
                    "response": "Here's the number one reason they won't label Ethereum a security:\n\nIf they did the whole world would see that they're incapable of really doing anything impactful about it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hswa5my",
                    "author": "MoreCowbellMofo",
                    "score": 1,
                    "created_utc": 1642338556.0,
                    "response": "I’ve looked at the toxic security that is ripple and the non-security of ethereum… here’s what I think happened…\n\nethereum initially mined and sold *might* have been a security more than 2 years ago… but since statute of limitations if 5 yrs unless intentionally sold as a security, then it’s no longer a security.. why because not only is ethereum not a single entity, many people bought ethereum to run smart contracts and pay for gas… if your not investing in a single common enterprise (which ethereum is not), you can’t expect to make a profit passively from buying ethereum… especially if you’re just paying for gas and expect to lose some portion of it.\n\nWith ripple the token sale has gone on indefinitely. Almost anyone that bought xrp bought into the idea ripple might carve out a huge chunk of the market for itself in the banking/financial sector. Xrp was given to ripple, ripple then sold it to fund their own business operations (a single common enterprise) to the general public, indiscriminately. I won’t get into how that makes no sense since their product was for banks and not the general public. But suffice to say most people didn’t consider their purchase a charitable donation. Most people purchased with the expectation of a return through no effort of their own (passive returns). The exchange of money for passive returns in a single enterprise that ripple execs heavily promoted as a successful investment following their price manipulation tactics and tv interviews that followed… it’s a security. Ripple is not at all decentralised. They claim it is decentralised and open source but only ripple employed developers are making 99% of the code changes .. so If ripple dies, xrpl dies with it which is the opposite of what has been claimed all along .. that it would continue to survive and thrive without them. Blatantly it would not. It would fall by the wayside and die.\n\nDon’t listen to all the shills saying otherwise.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hswa9dv",
                    "author": "ksiazek7",
                    "score": 1,
                    "created_utc": 1642338622.0,
                    "response": "If they were to classify Ethereum as a security they would basically be classifying almost every crypto coin or token as a security.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hswaqoc",
                    "author": "JP4G",
                    "score": 1,
                    "created_utc": 1642338920.0,
                    "response": "I move",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hswxfxu",
                    "author": "SecretaryImaginary44",
                    "score": 1,
                    "created_utc": 1642349786.0,
                    "response": "We wait until EIP1559. It will fix this",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hsy6g2s",
                    "author": "vacerias",
                    "score": 1,
                    "created_utc": 1642366897.0,
                    "response": "In one of his MIT class videos on YouTube Gensler said that Ethereum when it started was a security but today it's not anymore. So I think the scientist Gensler says Ethereum nowadays is not a security and the politician Gensler says it is a security. The scientist Gensler might change his opinion if ETH 2.0 will be released.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ht0nsrh",
                    "author": "Banelel",
                    "score": 1,
                    "created_utc": 1642409465.0,
                    "response": "Majority of cryptos are classed as securities except for Bitcoin possibly. \n\nSo does that mean all cryptos are delisted? \n\nI don't think this will be the case otherwise many VC's wouldn't haven't invested into cryptos like ETH.\n\nBut who knows at the end of the day. VC's have money to burn and retail love risk.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hsucj6f",
                    "author": "_jt",
                    "score": 0,
                    "created_utc": 1642296207.0,
                    "response": "Hopefully someone with actual expertise will jump in bc this is a good question,\n\nI’m no expert \n\nBut 2 things that come to my mind are ICOs & tax schemes;\n\nIf ETH is a security then its likely most new crypto projects planning to capitalize via ICO would fall into that classification too, so as a security they’d need to now register with the SEC before launching. I doubt anything would happen here with ETH though bc ethereum played by the rules of the time when it ICO’d\n\n& then a good tax scheme to pull with crypto is loss harvesting. Currently you can cash out your stash, if you’re down u can apply that loss against tax obligations, & then instantly buy it all back. With securities u must wait 30 days",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hsudeaf",
                            "author": "mybed54",
                            "score": 1,
                            "created_utc": 1642296571.0,
                            "response": "So why don't any ICOs just register with the SEC before so US investors can participate?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hsue1hx",
                                    "author": "_jt",
                                    "score": 1,
                                    "created_utc": 1642296842.0,
                                    "response": "Probably not a can of worms you want to open if it’s not a necessity. & of course if you’re trying to run an ICO scam you wouldn’t invite the SEC to take a look",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}