{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "v0a9gr",
            "title": "Ceci n'est pas une non fungible token",
            "url": "https://timdaub.github.io/2022/05/27/Ceci-n-est-pas-une-non-fungible-token/",
            "author": "TimDaub",
            "created_utc": 1653827679.0,
            "score": 24,
            "num_comments": 15,
            "subreddit": "ethereum",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "iafhx3b",
                    "author": "zagaberoo",
                    "score": 6,
                    "created_utc": 1653834445.0,
                    "response": "I don't follow the argument that they aren't certificates of authenticity.  The meaningful authenticity that they certify depends on the issuer, but they are verifiably authentic.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iafuain",
                            "author": "TimDaub",
                            "score": 3,
                            "created_utc": 1653840087.0,
                            "response": "> I don't follow the argument that they aren't certificates of authenticity.\n\nFair. Maybe I should add a section where I detail why they aren't authentic. E.g. here's one example where I describe why NFTs aren't necessarily authentic: https://timdaub.github.io/2021/04/22/nft-sleepminting-beeple-provenance/\nAnother one is that e.g. while beeple.eth may be a well-known name within the space, e.g. beeple could just publish a stolen Banksy piece as an NFT and there'd be nothing stopping him from doing so. There's no magic that authenticates who publishes what is intrinsic to NFTs. But it's true that I don't explain that in the article...",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iafxliu",
                                    "author": "zagaberoo",
                                    "score": 2,
                                    "created_utc": 1653841518.0,
                                    "response": "Absolutely; I see it like those companies that 'let' you name stars and issue certificates to that effect.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iaf7byq",
                    "author": "Perleflamme",
                    "score": 7,
                    "created_utc": 1653828997.0,
                    "response": "\"*une* NFT? \" First time I see a token described as a feminine name in French. Well, why not. I guess it was a way to keep the most of the original artist's message, but it feels odd to read. I'd rather write \"un NFT\". \n\nPretty good article overall. There's just one part I'd see as not really on point, but it's only marginal: the point regarding likes and messages sent from computer to computer. Communication is a tool of social standards. Whatever we use, even our voices and sounds and languages, are symbols articulated to convey meanings. It can't be anything but symbols ans these complex symbols themselves are exactly what we're trying to convey, because it entirely carries the meaning we can share with others (even though the meaning we think about is generally even more complex, our tools can only convey so much complexity). As such, to me, communication wasn't a good example, because it's one where the symbol is the object. This is very different from NFTs, where the symbol isn't what's represented by it.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iafeqoy",
                            "author": "TimDaub",
                            "score": 4,
                            "created_utc": 1653832879.0,
                            "response": "> I'd rather write \"un NFT\". \n\nFair! Actually, ignorant as I am, I just found and replaced \"pipe\" with \"non fungible token\" but if you say \"un\" fits better I'm happy to edit it :)",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iahw0q3",
                    "author": "lard-blaster",
                    "score": 1,
                    "created_utc": 1653876047.0,
                    "response": "Thank you, it's difficult to find people who are actually being thoughtful about this stuff",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iai7nym",
                    "author": "W944",
                    "score": 1,
                    "created_utc": 1653882002.0,
                    "response": "“Ceci n’est pas un jeton non fongible”\n\nMan that sounds odd. Glad we use English online.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaf9df7",
                    "author": "coinfeeds-bot",
                    "score": -1,
                    "created_utc": 1653830108.0,
                    "response": "tldr; Artist Hito Steyerl, in an attempt to squat the German exhibition hall Bundeskunsthalle, had symbolically bought \"Bundes Kunsthalle.eth\" as a claim to use it for running governance experiments, not to claim it as her property. \"I was trying to roll all of it into one by minting the whole institution as an NFT and giving it to the students in exchange for a larp. Transforming it into a worker, self-managed institution,\" she said.\n\n*This summary is auto generated by a bot and not meant to replace reading the original article. As always, DYOR.*",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}