{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "usgqse",
            "title": "Is this the right way to diversify ?",
            "url": "https://www.reddit.com/r/ethereum/comments/usgqse/is_this_the_right_way_to_diversify/",
            "author": "Huge-Paint4923",
            "created_utc": 1652891067.0,
            "score": 0,
            "num_comments": 6,
            "subreddit": "ethereum",
            "selftext": "So I'm thinking about diversifying, I've until recently had an only buy ETHEREUM and BTC mentality but then something happened ( I wonder what that might be) and I realized that when a crisis hits having all of your eggs in one basket might not be the smartest thing that a man can do.  \n\n\nRight now I'm looking for new opportunities to invest, and I've decided to invest in companies that have this revolutionary idea to implement blockchain tech in the telecommunications sector, the reason why I started contemplating this, is the fact that this sector is in a dire need of an overhaul but is also a vital one and it wont be going away any time soon or ever and new and innovative solutions have a strong opportunity to succedd.   \n\n\nFor these reasons I started thinking about investing in some new projects like World Mobile Token and Giant and I would love to hear your sincere opinions about them, do you think they could succedd and do they have a future. Looking forward to your comments.",
            "stickied": false,
            "comments": [
                {
                    "id": "i93cvtt",
                    "author": "Ok-Imagination-7014",
                    "score": 1,
                    "created_utc": 1652892517.0,
                    "response": "The best why of investing is to put your money into btc. Then when you get more money put that money into btc. Then and only then when you get more money put it into Eth lol. dude I’ve been look for this answer for a long time. My end conclusion always come back to btc and Eth. that’s just my opinion. Iv drop the idea of stocks, gold, silver, real estate etc. because out of those it’s still tied to one system. I’m gonna do the opposite of what the government is telling me is safe and a good investment and I’m sure I don’t have to explain myself. Tried “shitcoins” as well. But 98 percent of coins that we see now will be no longer in 10+ years in my opinion. Don’t chase hype and greed that all these other coins are unfolding, because in the end everyone wants to be like btc and Eth.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i93zkpb",
                            "author": "lib3rty47",
                            "score": 1,
                            "created_utc": 1652901693.0,
                            "response": "I'm very surprised to see this post in this sub lol.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9409x7",
                                    "author": "Ok-Imagination-7014",
                                    "score": 1,
                                    "created_utc": 1652901980.0,
                                    "response": "Why? lol",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i939q2k",
                    "author": "Daan1234567",
                    "score": -1,
                    "created_utc": 1652891257.0,
                    "response": "Loopring is the way",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}