{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ujayub",
            "title": "PostPlaza, a web3 social network on Polygon, is launching the next couple of days!",
            "url": "https://twitter.com/postplaza_eth/status/1522366415830798337",
            "author": "ahomentc",
            "created_utc": 1651795704.0,
            "score": 153,
            "num_comments": 33,
            "subreddit": "ethereum",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i7iae9i",
                    "author": "watchinggodbleed",
                    "score": 22,
                    "created_utc": 1651804862.0,
                    "response": "Where is the money to cover all the gas coming from? What are the plans to make this a sustainable model?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7hsi2b",
                    "author": "ahomentc",
                    "score": 13,
                    "created_utc": 1651795758.0,
                    "response": "PostPlaza is a Web3 social network on the Polygon blockchain. Every post is an NFT, and every profile is a collection of NFT posts. \n\nAll of the data, including the social graph, is stored on-chain. It is designed to enable users to own their own data... so different frontends can use the same data. \n\nAll the gas fees are covered so it's fully usable with an empty wallet.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7j0li8",
                            "author": "espresso_chain",
                            "score": 4,
                            "created_utc": 1651821955.0,
                            "response": "what's the value of owning your posts? the shit posting I do on Twitter doesn't seem valuable to me.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7i0wef",
                    "author": "ahomentc",
                    "score": 4,
                    "created_utc": 1651800193.0,
                    "response": "How gas free minting works: \n\n[https://postplaza.notion.site/Gas-free-interactions-6108a94e83cf4ca39cc49b1c202a0eec](https://postplaza.notion.site/Gas-free-interactions-6108a94e83cf4ca39cc49b1c202a0eec)",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7iacyr",
                            "author": "boptom",
                            "score": 4,
                            "created_utc": 1651804844.0,
                            "response": "Do you have more details about this? If post plaza is paying for the gas eventually it’ll run out of funds?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7i5emu",
                    "author": "gnojjong",
                    "score": 4,
                    "created_utc": 1651802396.0,
                    "response": "this project is awesome and very promising, just created my postplaza account, just waiting for the mainnet launch.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7i4lzj",
                    "author": "Serious-Anteater-331",
                    "score": 3,
                    "created_utc": 1651802017.0,
                    "response": "Cool concept! 👍🏻",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "ujkaow",
            "title": "How to stake less than 32 ETH in your own wallet, no lockup, mininal fees",
            "url": "https://www.reddit.com/r/ethereum/comments/ujkaow/how_to_stake_less_than_32_eth_in_your_own_wallet/",
            "author": "babossa77",
            "created_utc": 1651832508.0,
            "score": 8,
            "num_comments": 8,
            "subreddit": "ethereum",
            "selftext": "A lot of people use centralized exchanges to stake small amount of ETH, but thereby they give them custody over their coins.\n\nThere is actually a very easy way to stake ETH in your own wallet decentralized, without any lockup and with mininal fees of only a few dollars. \n\nIt works through layer 2 Arbitrum and the decentralized staking pool Rocket Pool!\n\nFirst you need to get ETH to your Arbitrum account. Most big centralized exchanges support withdrawals to Arbitrum, for example Binance or Crypto.com. If you have ETH on mainnet, there is also a bridge from Ethereum mainnet to Arbitrum, but using centralized exchanges to bridge will be cheaper for gas.\n\nYou can now use metamask to access your arbitrum account. [Here](https://help.uniswap.org/en/articles/5538707-how-to-connect-to-arbitrum) is a tutorial on how to connect your metamask to the arbitrum network.\n\nAfter you can access your Arbitrum funds on metamask, there is only one thing left to do: Go to Uniswap and swap your ETH to rETH (Rocket Pool ETH) \n\nYou can do that through this link: [Uniswap](https://app.uniswap.org/#/swap?inputCurrency=ETH&outputCurrency=0xec70dcb4a1efa46b8f2d97c310c9c4790ba5ffa8&chain=arbitrum). (You might have to switch the network to Arbitrum on Uniswap first)\n\nThe swap will only cost around $2 dollars on Arbitrum. So you pay less than $5 total in fees, including the exchange withdrawal.\n\nThe value of rETH will automatically increase over time compared to ETH, because the staking rewards that are earned through staking in Rocket Pool automatically flow into the value of rETH. At the beginning of Rocket Pool, 1 rETH was equal to 1 ETH. Right now, 1 rETH = 1.02 ETH. \n\nIf the staking pool earns 5% staking rewards every year, the rETH/ETH ratio will go up by 5% in the same amount of time. Thats how you earn your staking rewards.\n\nYou can swap your rETH back to ETH at anytime to 'unstake' your ETH.\n\nTo get more information about rocket pool, check out the [official website](https://rocketpool.net/).",
            "stickied": false,
            "comments": [
                {
                    "id": "i7jh87e",
                    "author": "yadude11",
                    "score": 3,
                    "created_utc": 1651835797.0,
                    "response": "Another problem is this is (as of now and unfortunately) considered to be a taxable event",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "ujlaam",
            "title": "\"No one will spend ETH if it's deflationary\" debunked",
            "url": "https://twitter.com/domothy/status/1522056847234150400",
            "author": "frank__costello",
            "created_utc": 1651836382.0,
            "score": 4,
            "num_comments": 0,
            "subreddit": "ethereum",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uj8loi",
            "title": "Chinese are using NTFs to protest against government forced lockdown",
            "url": "https://digesttime.com/2022/05/05/chinese-are-using-ntfs-to-protest-against-government-forced-lockdown/",
            "author": "thefoodboylover",
            "created_utc": 1651788423.0,
            "score": 44,
            "num_comments": 9,
            "subreddit": "ethereum",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i7i0y4d",
                    "author": "Lordwigglesthe1st",
                    "score": 16,
                    "created_utc": 1651800218.0,
                    "response": "Non Tokenable Funge?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7i99v2",
                            "author": "Vegetable-Argument74",
                            "score": 4,
                            "created_utc": 1651804291.0,
                            "response": "Or Non Tungible Foken? 😂",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7hfp81",
                    "author": "coinfeeds-bot",
                    "score": 6,
                    "created_utc": 1651789804.0,
                    "response": "tldr; Malaysian freelance designer Simon Fong has created satirical illustrations depicting life amid quarantine in Shanghai, China's largest city. The illustrations, inspired by Maoist-era propaganda posters, can now be found on the OpenSea non-fungible token (NFTs) market as a collection called “Popaganda” Fong's works include scenes that poke fun at Covid-19 PCR testing procedures, as well as the government’s demands by\n\n*This summary is auto generated by a bot and not meant to replace reading the original article. As always, DYOR.*",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "ujj8yj",
            "title": "Question on Arbitrum L2",
            "url": "https://www.reddit.com/r/ethereum/comments/ujj8yj/question_on_arbitrum_l2/",
            "author": "mmaatt78",
            "created_utc": 1651827833.0,
            "score": 4,
            "num_comments": 9,
            "subreddit": "ethereum",
            "selftext": "Hi, I have some eth on the exchange and I'm thinking to move them to a ledger. I would like to low the gas fee of the mainnet by using Arbitrum, which is supported by my exchange but I've some difficulties to understand how these L2 works.\n\nAccording with this video (see the link at the end of the post) , once I transfer Eth from the exchange to the ledger on arbitrum I get AETH on the ledger (min. 13.17). If I want to transform them back in ETH I need to use this Hop Exchange (min. 16.25) and to do this I've to pay the mainnet gas fee.\n\nSo my questions are:\n\n1. how do I save in gas fee by using this process? It seems to me that I'm going to pay more than transferring directly eth with erc20 because first I have to pay arbitrum fee and then to pay Hop erc20 gas fee (which from the video my understanding is that being an erc20 fee its cost will be the same as transferring eth to the ledger on erc20)\n2. the second option would be to keep ETH in the ledger as AETH but...isn't this a less secure asset than the \"real\" Eth? The difference seems to me like to have real gold or paper gold...is this wrong? What if Arbitrum, which is a quite new thing breaks (from the video my uderstanding is that AETH works only on Arbitrum)? Sorry if my question doesn't make sense but I find really hard to get this thing....\n3. Consider that my scope is to accumulate eth by DCA and eventually get some yield. If I move my eth from the exchange to the ledger I would like to use a service like Lido or Rocketpool to generate some yield...so my last question is: can I use these services with AETH, instead of ETH?\n4. the last question is: if I do some mistake in setting up the exchange and the ledger on \"arbitrum mode\" do I loose my eth in the transferring?\n\nThis is the video I was referencing to: [https://www.youtube.com/watch?v=anK-OFuPwes&t=987s](https://www.youtube.com/watch?v=anK-OFuPwes&t=987s)\n\nThank you in advance!",
            "stickied": false,
            "comments": [
                {
                    "id": "i7j91gt",
                    "author": "MinimalGravitas",
                    "score": 3,
                    "created_utc": 1651829468.0,
                    "response": "> I would like to low the gas fee of the mainnet by using Arbitrum,\n\n> how do I save in gas fee by using this process?\n\nWhat is it you're wanting to do? Arbitrum makes transactions like swaps and DeFi stuff about 10x. Therefore if you are going to do loads of shenanigans like perpetuals trading, covering your trades with options, lending and borrowing etc etc then you'll very quickly save back the fees that you spent bridging onto the rollup.\n\nIf on the other hand you just want to buy and hold ether there isn't a direct advantage to moving to Arbitrum. There might be indirect advantages though, as lots of economic activity is going to be moving to L2s as time goes on (http://podcast.banklesshq.com/the-trillion-dollar-l2-opportunity-part-one).\n\nWith regards to RocketPool, while you can't use the dApp on an L2, there is liquidity for rETH on DEXs on Arbitrum so you can just swap whatever you like for it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7jg6ck",
                    "author": "Maswasnos",
                    "score": 3,
                    "created_utc": 1651835083.0,
                    "response": "1. It sounds like your exchange already supports Arbitrum withdrawals, in which case you can pretty much just skip the steps in the video and withdraw directly to your ledger on Arbitrum. It works exactly like withdrawing on mainnet, just ~10x cheaper. \n\n2. Technically yes, Arbitrum is operating in a trusted capacity right now with plans to decentralize in the near-ish future. AETH is essentially just the representation of real ETH held by the Arbitrum contracts; it won't lose its value peg to ETH unless the bridge is exploited. There are additional risks here; don't put your entire portfolio on Arbitrum yet. \n\n3. You can buy rETH on Arbitrum Uniswap, yes. I don't think stETH has been deployed there, yet. \n\n4. It depends on the mistake, but really there isn't much to it. As long as you send it to your address and *only* your address, you'll still be able to access the funds somehow. The only way you could lose them is if you sent them to the wrong address.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "ujgpp3",
            "title": "Practical use of crypto",
            "url": "https://www.reddit.com/r/ethereum/comments/ujgpp3/practical_use_of_crypto/",
            "author": "Ymhnooners555",
            "created_utc": 1651816453.0,
            "score": 5,
            "num_comments": 9,
            "subreddit": "ethereum",
            "selftext": "I have a practical real world use question about crypto. \n\nMy wife and I have separate banking accounts and we split EVERYTHING. We are constantly sending cash back and forth to each other. Every month she writes me a check for her portion of the mortgage. I deposit that check and then wait three to five business days for it to clear. Then I can finally pay the mortgage. I’m looking at using crypto as a new way to transact with her. My concern is that we will end up paying taxes on our exchanges. We are married and we file jointly. As far as I’m concerned, us exchanging currency is the same as moving between two of my own personal accounts and shouldn’t be taxed. I was considering having her buy USDC from Coinbase and sending it to me offchain to avoid fees. Then converting that to USD to pay my mortgage. Does anyone else have any idea how we could efficiently transact between each other without having tons of fees or extra taxes?",
            "stickied": false,
            "comments": [
                {
                    "id": "i7j83cz",
                    "author": "shortass12321",
                    "score": 7,
                    "created_utc": 1651828620.0,
                    "response": "Erm? You not heard of Internet banking?\n\nLike literaly all that shit you can set up to be automatic.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uj4i62",
            "title": "Question on Prysm staking",
            "url": "https://www.reddit.com/r/ethereum/comments/uj4i62/question_on_prysm_staking/",
            "author": "SoNotCool",
            "created_utc": 1651777059.0,
            "score": 3,
            "num_comments": 2,
            "subreddit": "ethereum",
            "selftext": "I'm helping a friend attempt to recover some ETH wallets that were staked on the prysm network. We've managed to recover the accounts using the prysm software but I don't see anywhere how to determine the balance of the accounts using the prysm software. What am I missing? Do I just need to load these seeds into a standard crypto wallet to see the account balance?",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uj0wwz",
            "title": "Unique Positions - The Daily Gwei #475",
            "url": "https://thedailygwei.substack.com/p/unique-positions-the-daily-gwei-475",
            "author": "DailyGweiBot",
            "created_utc": 1651767072.0,
            "score": 3,
            "num_comments": 2,
            "subreddit": "ethereum",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uimtj5",
            "title": "Otherside and the Future of NFT Consolidation",
            "url": "https://www.coindesk.com/layer2/2022/05/02/otherside-and-the-future-of-nft-consolidation/",
            "author": "lorenzomofo",
            "created_utc": 1651716774.0,
            "score": 3,
            "num_comments": 7,
            "subreddit": "ethereum",
            "selftext": "",
            "stickied": false,
            "comments": []
        }
    ]
}