{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uvfcdd",
            "title": "Trezor vs Ledger Discussion (Pros v Cons)",
            "url": "https://www.reddit.com/r/ethereum/comments/uvfcdd/trezor_vs_ledger_discussion_pros_v_cons/",
            "author": "ResponsibleWhile6991",
            "created_utc": 1653239519.0,
            "score": 12,
            "num_comments": 23,
            "subreddit": "ethereum",
            "selftext": "Today I am looking into buying a cold storage to finally get my ETH off of Robinhood (lol).\n\nI have heard lots of things about Ledger and Trezor, so please let me know the pros vs cons. (Mention that you own one if you comment so I can hear what owners are saying)",
            "stickied": false,
            "comments": [
                {
                    "id": "i9lcstl",
                    "author": "godsfist101",
                    "score": 7,
                    "created_utc": 1653244506.0,
                    "response": "I bought a trezor, immediately regretted it, and bought a ledger nano s (polkadot isn't supported on trezor so that made up my mind.). Nano s is fantastic, ledger live is fantastic. Supported assets should be the only deciding factor imo.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9mzvct",
                            "author": "SoySauceOnWhiteRice",
                            "score": 2,
                            "created_utc": 1653273386.0,
                            "response": "Is DOT your main issue with Trezor?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9l60yr",
                    "author": "camogliese",
                    "score": 3,
                    "created_utc": 1653241509.0,
                    "response": "I am using a Ledger Nano S for almost a year and couldn't be happier. \n\nI regularly buy ETH and send out to my Ledger. And I stake them directly on Ledger Live app (via Lido) when tx fees are acceptable.\n\nI have never used Trezor & in general I am a very minimalist user as I mention how I use my device. 🙂",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9mfb52",
                            "author": "LiveDirtyEatClean",
                            "score": 1,
                            "created_utc": 1653262797.0,
                            "response": "So do you convert your ETH to sETH to stake on lido?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9nx0rc",
                                    "author": "camogliese",
                                    "score": 2,
                                    "created_utc": 1653297394.0,
                                    "response": "Exactly! On Ledger Live (native interface of Ledger device) you have an official Lido application which swaps your ETH to stETH and the process is extremely easy. \n\nIf your goal is simply accumulate ETH & stake. I can recommend Ledger.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9od1gs",
                                            "author": "LiveDirtyEatClean",
                                            "score": 1,
                                            "created_utc": 1653309337.0,
                                            "response": "That’s awesome! Are the rewards in stETH?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9p7rcs",
                                                    "author": "camogliese",
                                                    "score": 1,
                                                    "created_utc": 1653323484.0,
                                                    "response": "Yes, your stETH balance increases over time. You don't need to claim separately.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9lg1ui",
                    "author": "mcsnoogins",
                    "score": 2,
                    "created_utc": 1653245985.0,
                    "response": "I've got both, trezor has better hardware specs but bugger all coins in the native software (literally like 14 maybe less)ledger is slower but let's you add a vast amount of coins to their software.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9n0z97",
                    "author": "_RootZero",
                    "score": 2,
                    "created_utc": 1653273954.0,
                    "response": "As far as I know Ledger apps and firmware is not open source so nobody really knows how secure they are.\n\n\n\nTrezor on the other hand is fully open source. I trust Trezor more. But as others mentioned if you need coins that Trezor doesn't support, ledger is your option.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9nfdc5",
                    "author": "senditFrmU2M",
                    "score": 2,
                    "created_utc": 1653282546.0,
                    "response": "I like Trezor over ledger but I have both. I suggest both, main problem I have with ledger is the database breach they’ve had twice. I get scam emails daily and scam text every week.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9l49r4",
                    "author": "SpiralBlue2",
                    "score": 1,
                    "created_utc": 1653240755.0,
                    "response": "I have a Ledger NanoX. I think I mainly went with it because it supported Bluetooth with my phone. \nMy friend though swears by his TREZOR. \nReally in the end you can’t go wrong moving to a hardware wallet. I moved a lot of my coin off CoinBase this weekend with all the FUD going around over CB’s bankruptcy even though I’m not really sure they’ll be filing since the cofounder just bought up $75 million of their stock this last week. But better safe than sorry my assets get locked up by a cash exchange.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9lydb4",
                    "author": "yvv1",
                    "score": 1,
                    "created_utc": 1653254375.0,
                    "response": "Besides crypto, ledger supports gpg encryption (never used this feature though) and FIDO U2F authentication, which you can use on plenty of sites (google, amazon, github etc).",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ny31o",
                            "author": "shim__",
                            "score": 1,
                            "created_utc": 1653298401.0,
                            "response": "Trezor does that as well",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9m8oj1",
                    "author": "rajoyce52",
                    "score": 1,
                    "created_utc": 1653259362.0,
                    "response": "I have Tresor.\n\nLedger has secure element, Trezor has not. Therefore if your Trezor get into wrong hands, they'll be able to steal your coins. You can protect against it by using an additional codeword which is not kept in Trezor. But it should be long and you should memorize it or write it down. Which kind of beats the whole idea of hardware wallet.\n\nTresor team realise this problem and did try to introduce secure element, but secure elements available on market were not secure enough by Trezor team standards, so they announced an initiative to design their own secure element. It was several years ago and no news about is so far.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9mdb0t",
                            "author": "fuzzy8balls",
                            "score": 1,
                            "created_utc": 1653261748.0,
                            "response": "I think having a hardware backed wallet is better than not having one. However I fail to see why one is better than the other. There have been vulnerabilities which allowed an attacker with physical access to recover the keys. Although those have been patched, it makes you wonder what else could be out there. \n\nIn the enterprise space, HSMs (hardware security modules) cost upwards of $100k-300k to secure root CA keys, which are not unlike the keys used for crypto. I have a hard time seeing how a consumer device that's $100, secure element or not, can protect against a determined attacker when its physically compromised.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9oksis",
                                    "author": "No_Committee5595",
                                    "score": 1,
                                    "created_utc": 1653313396.0,
                                    "response": "Infrastructure Technology vs Information Technology and playing a game of 'what's your threat model' are the main factors in price. Those HSMs need to be able to withstand relentless pounding and motivated physical theft to protect millions or billions of dollars in hypothetical assets forever (or at least a few years minimum) after it has been lost. A ledger needs to protect a few thousand dollars (maybe) from a petty thief with likely very little tech training for enough days that the owner of the device can realize its lost, get another, and transfer their funds.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}